[{"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…administration has already done a masterful job at alienating  America on the world stage, turning our back on our closest allies.  This bill goes even further. It underfunds NATO, the infrastructure, by  almost $200 million. It undermines the infrastructure projects of our  own troops in Europe that they are relying on. Our credibility as a  national…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692957/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…any pawn that will get it to him,  even those who are launching a new wave of repression in Venezuela.\n\nColombia, Mexico, Greenland--he is handing Putin a gift by dividing  NATO. Our allies had to meet yesterday to defend Denmark on Greenland  from this bully in chief.\n\nSo many conflicts but no plan to provide security to American  families. He ignores…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698602/war-for-oil"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "Ms. DEAN of Pennsylvania. Mr. Speaker, the core of NATO is Article 5:  An attack on one is an attack on all.\n\nSince the end of World War II, the U.S. and our allies have honored  and operated on this mutual trust. President Truman…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699067/nato"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…American families on  average between $1,800 and $2,000 a year.\n\nBut it has consequences bigger than that. Canada is an ally. We are  trying to convince Canada to increase their NATO expenditure up to 2  percent of GDP and related expenditures on infrastructure up to 5  percent of GDP. The new Prime Minister, Mark Carney, has gone to the  Parliament and…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696447/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…construction projects, including  new family housing construction and child development centers.\n\nThere are also investments to bolster our footprint in the Pacific  and support our NATO projects. These are incredibly important to our  soldiers, to our veterans, and to our national security.\n\nNo doubt there is more I would like to see done in this bill. It is…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694203/military-construction-veterans-affairs-and-related-agencies"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…Gunfire Liaison Company, commanding general for the 4th Marine  Division, and deputy commanding general of the 1st Expeditionary Force.\n\nHe is a distinguished graduate of the NATO Joint Warfare Officers  Course, the Naval War College Strategy and Policy Course, the Armed  Forces Work Colleges National Security Course, the Senior Reserve  Components Officers…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697745/brigadier-general-frederick-r-lopez-post-office-building"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…question was asked on this House floor who came to our  aid, who stood for the United States.\n\nI was here on September 11 serving in Washington, D.C., my first term  in Congress. NATO, the world, came to our aid. The world came and  helped us when we fought against the Taliban.\n\nMr. Chair, I thank those nations for standing with us, and I look  forward to…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693686/department-of-defense-appropriations-act-2026"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "Mr. LATIMER. Mr. Speaker, today President Trump announced that the  U.S. will provide NATO allies with weapons to send to Ukraine. Finally.  This is welcome news, but it comes 6 months late.\n\nWasn't it candidate Trump who promised to end this war on day one?  How…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693516/actions-speak-louder-than-words"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Service Officer, retired.\n\nKurt van der Walde, Senior Foreign Service Officer,       retired; Alexander Vershbow, US Ambassador, retired, Former       Deputy Secretary General of NATO, Former Assistant Secretary       of Defense; Shari Villarosa, US Ambassador, retired; Patricia       Wagner, Senior Commercial Service Officer, retired; Alexander       Watson,…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691413/recognizing-assault-on-american-diplomacy"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "…media, quashed protests, and killed,  jailed, or exiled political opponents.\n\nThree years ago, Putin invaded Ukraine, showing complete disregard  for European borders, UN and NATO doctrines, and human rights.\n\nFor three years, the Ukrainian people have faced deliberate killings,  rapes, and the abduction of their children.\n\nThe United Nations has found…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687989/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…horrifying. It is all infuriating, and it is all antithetical  to our American ideals.\n\nAs President Trump and his administration publicly trash our allies,  undermine the strength of NATO, and decimate our international aid  programs, our adversaries are greedily and happily waiting to fill the  gaps that this administration is deliberately creating.\n\nOn Monday,…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687988/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…the  Rose Revolution in 2003, the people of Georgia have worked to  successfully build their democracy and their economy, all while  fostering aspirations to join the EU and NATO.\n\nThe United States, along with European partners, have played an  integral role in ensuring that the path of integration was open to  Georgia and that its people had the means…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690699/mobilizing-and-enhancing-georgias-options-for-building-accountability-resilience-and-independence-act"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…don't  comply with his will.\n\nDespite what the President claimed on the campaign trail, war and  threats of future wars with Colombia, with Cuba, with Mexico, and even  our NATO ally Denmark, when it comes to Greenland, are now animating  features of his foreign policy.\n\nThe President's team claims their operation to oust Maduro was a  ``law enforcement''…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698608/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Yemen. He bombed Venezuela and now says  that we are running the country, whatever the hell that means. He is  also threatening to take an autonomous territory from Denmark, a NATO  ally.\n\nLet's go over another failure. Donald Trump promised ICE would only  deport the worst of the worst. Guess what. That is not true. ICE agents  are terrorizing not just…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699220/providing-for-consideration-of-hr-supporting-pregnant-and-parenting-women-and-families-act-providing-for-consideration-of-hr-pregnant-students-rights-act-and-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…hopefully forging a unity of  purpose between Europe and the United States.\n\nSomething you may not know--one of the skeletons in my closet is I  spent a rotation working at NATO in Brussels when we were trying to  develop a treaty for intermediate-range missiles because of the nuclear  threats, to stabilize the threats, in the middle of the 1980s. The…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "Mr. McCONNELL. Mr. President, for years, the most pressing concern  about the future of NATO was whether and when European allies would  take the obligations of collective defense more seriously.\n\nBut today, the biggest questions about the most successful military…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699111/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "James Risch", "party": "Republican", "sentence": "…is $1.23 billion.\n\nThis proposed sale will support the foreign policy goals       and national security objectives of the United States by       improving the security of a NATO Ally that is a force for       political stability and economic progress in Europe.\n\nThe proposed sale will improve Germany's capability to meet       current and future threats…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695866/arms-sales-notification"}, {"senator": "James Risch", "party": "Republican", "sentence": "…transmittal no. 0G-25       Report of Enhancement or Upgrade of Sensitivity of Technology           or Capability (Sec. 36(b)(5)(A), AECA)\n\n(i) Prospective Purchaser: NATO Support and Procurement       Agency (NSPA) as Lead Nation for Belgium) Czech Republic,       Denmark, Finland, Greece, Hungary, Italy, the Netherlands,       Norway, Poland,…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693742/arms-sales-notification"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…that we are eternally grateful for their bringing a  transnational criminal to justice--hopefully so--as he goes through our  court system.                                     NATO\n\nMr. President, I am also here to talk about what I think is  amateurish behavior with respect to the treatment of our NATO allies.  It has to start with an interview that I…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698624/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…corporations.\n\nOur President bombed boats and then the capital of a foreign country  for oil, and now he says he is acting President of that country.\n\nHe wants our military to invade a NATO ally. Remember, Mr. Speaker,  America and our NATO allies fought fascism together in World War II.  Republicans claim we don't have money to keep healthcare costs down,  yet…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698949/providing-for-consideration-of-hr-protecting-prudent-investment-of-retirement-savings-act-providing-for-consideration-of-hr-flexibility-for-workers-education-act-providing-for-consideration-of-hr-empowering-employer-child-and-elder-care-solutions-act-providing-for-consideration-of-hr-tipped-employee-protection-act-and-providing-for-consideration-of-hr-save-local-business-act"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "…the House and Senate.\n\nOur allies across the Atlantic are taking the lead now, as my  colleague from Kentucky just pointed out, in financing security  assistance for Ukraine. NATO allies are buying equipment from us in the  United States and giving it to Ukraine. I certainly applaud that, as  all Americans should.\n\nThe United States should increase the…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699095/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…loyal allies--some of the nicest  people on the planet. Who doesn't like Canadians?\n\nCanadians have served alongside us in virtually every war we have  ever fought. They are a NATO ally and partner, and for my small-but- mighty State of Delaware, our major export destination and the nation  from which we import the most.\n\nAnd yet, because of an emergency…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689488/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "James Risch", "party": "Republican", "sentence": "…Lithuania's capability to deter       current and future threats to support coalition operations,       as well as promote its interoperability with United States       and other NATO forces.\n\n(v) Justification: This proposed sale will support the       foreign policy and national security of the United States by       helping to improve the security of a…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690233/arms-sales-notification"}, {"senator": "James Risch", "party": "Republican", "sentence": "…program cost is $296       million.\n\nThis proposed sale will support the foreign policy and       national security of the United States by improving the       security of a NATO Ally that continues to be an important       force for political stability and economic progress in       Europe. This sale is consistent with U.S. initiatives to       provide…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692048/arms-sales-notification"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…leaders from across our Nation with  revoking their tax-exempt status?\n\nI was in Europe with a bipartisan delegation from this body just 2  weeks ago visiting our trusted, loyal NATO ally Denmark, as they were  alarmed about the rising tide of threats from our President to extract  the territory of Greenland from their nation.\n\nThis coming weekend and week,…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699917/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…Mr. Tarr faithfully served 26 years in the U.S. Army, earning  numerous military decorations including, but not limited to, the Army  Commendation Medal, Iraq Campaign Medal, NATO Medal, Army Service  Ribbon, and Overseas Service Ribbon. These honors stand as a testament  to Mr. Tarr's unwavering dedication to his fellow Servicemembers and  our great…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696875/recognizing-mr-michael-tarr-on-being-named-marquette-county-veteran-of-the-year"}, {"senator": "James Risch", "party": "Republican", "sentence": "…notified.\n\n(v) Justification: This proposed sale will support the       foreign policy and national security objectives of the United       States by improving the security of a NATO Ally that is a       force for political stability and economic       progress in Europe. The proposed sale will improve Belgium's       capability to meet current and future…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696021/arms-sales-notification"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…assignments in  challenging environments. Early in his career, he joined a Special  Purpose Marine Air-Ground Task Force for operations in Norway, where he  participated in NATO exercises under Operation Thunder Reindeer and  completed intensive arctic survival training. Later, he deployed with  the 24th Marine Expeditionary Unit during Operation Allies…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699292/recognizing-united-states-marine-corps-veteran-domenico-s-moceri"}, {"senator": "James Risch", "party": "Republican", "sentence": "…operations.\n\n(v) Justification: This proposed sale will support the       foreign policy and national security objectives of the United       States by improving the security of a NATO ally which is an       important force for political stability and economic progress       in Europe.\n\n(vi) Sensitivity of Technology: The Sensitivity of       Technology Statement…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697685/arms-sales-notification"}, {"senator": "James Risch", "party": "Republican", "sentence": "…will support Poland's capability       to meet current and future threats by enabling a credible       force that is capable of deterring adversaries and       participating in NATO operations.\n\n(v) Justification: This proposed sale will support the       foreign policy goals and national security objectives of the       United States by improving the security…", "date": "2025-07-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694372/arms-sales-notification"}]