[{"senator": "Jacky Rosen", "party": "Democrat", "sentence": "…People's kitchen tables, their refrigerators should never be a  bargaining chip. This is not a partisan issue, feeding people in the  United States. We should not be mixing natural resources with the  essential things that we need like food.\n\nAre my Republican colleagues--if they want to lower prices, they can  start--they can start--by this one small…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698816/9999"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…scene.\n\nJust as the original Goonies fans and stars have grown and matured  since the film's release in 1985, so has Oregon's film industry. With  its magnificent and diverse natural beauty, Oregon has become a much  sought after location for film production. As the backdrop for major  television shows and box office hits alike, film production in Oregon…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689533/recognizing-the-40th-anniversary-of-the-goonies"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…disruptions disrupt lumber markets and supply chains.  Some of it comes through outdoor sports industries--hunting, fishing  and scuba and skiing--as climate disruptions disrupt the natural  environments that they need.\n\nThe first biggest shock will come through insurance markets as  climate risks make real estate uninsurable. This disruption kicks off a  cascade:…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699613/9999"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…appropriated, with bipartisan support, for critical  services. He is withholding it. President Trump froze funding that  helped Michigan communities build new radio towers, prepare for natural  disasters, and construct safe and modern infrastructure.\n\nAnd when the President breaks the law to give a windfall to some  States and some communities but not others, he…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696352/trump-administration"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…my home in Mobile, Alabama, all the  way up to Casco Bay in Maine.\n\nI will always champion efforts like the National Estuary Program,  which protect and restore our critical natural resources while  utilizing local knowledge and ensuring the efficient use of Federal  funds.\n\nThis is a program that is working. It is popular, and it deserves our  support.…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698177/enhancing-science-treatment-and-upkeep-of-americas-resilient-and-important-estuarine-systems-act"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…Trump is doing. Energy costs will go up because the  cancelation of clean energy projects will constrict the supply of  energy at a time when the demand is increasing, and the natural  economic reaction when you constrict supply at a time of increasing  demand is that people are going to pay more for household energy.\n\nWe were not convincing then. Maybe…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696123/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…follow  the rules and just pay a fair market rate for access to these places.\n\nThis sets a terrible precedent. We are witnessing the wholesale  commercialization of America's natural inheritance, one sweetheart deal  at a time. Today, it is cables and sanctuaries. Tomorrow, it will be  mining in a national monument. Next week, it will be drilling in  national…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699959/undersea-cable-protection-act-of-2025"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…on in the  past with regard to the NIH, and it is critical for us to expand it to  other agencies in this package.\n\nThe bill provides funding to protect our national parks, natural  resources, endangered species, and public lands, rejecting $9.5 billion  in proposed cuts in the Interior bill. It protects our environment  while restraining polluters,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698760/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…to build a  vitrification plant that supports 3,000 jobs in the Tri-Cities to get  this post-World War II job done.\n\nWhen Secretary Wright testified in the Senate Energy and Natural  Resources Committee, he said, ``Senator,'' speaking to me, ``I can't  overstate how critical I think it is to finish the job, finish the  cleanup at Hanford. Hanford gave…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695342/hanford-site-cleanup"}, {"senator": "Doris Matsui", "party": "Democrat", "sentence": "…been dealing with the impacts of air pollution  for a long time. California's unique geography, with its valleys,  coastal basins, and surrounding mountain ranges, creates natural  barriers that trap pollutants and contribute to unique air pollution  challenges. As a State, we have long recognized the dangers of air  pollution, and we have been a pioneer…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690489/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…have produced in our history. In fact, last year, with the Biden  administration, we produced more oil than any country in the history of  humanity.\n\nThe same is true for natural gas. The same is true for LNG exports.  The United States produces more oil than any other country in the  world. We produce more natural gas than any other country in the…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688166/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…not subjected  to the long-term health effects that they have traditionally been  forced to bear.\n\nRecovery from these wildfires asks us to look ahead to make sure that  when natural disasters strike, everyone can be prepared to recover  equally. This is a core tenet of environmental justice. We must invest  in resources that allow communities and families…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698644/recognizing-sister-mary-jesus-ochoa-on-her-centennial-birthday"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…industry if you  are working in a way that is trying to maximize American ingenuity.  That is who we are. We make things that are smarter.\n\nNow, a lot of people--I would say the natural gas and oil industry at  the top of the list--they don't want there to be progress. Why is that?  Because the less efficient something is, the more energy, the more  electricity…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690527/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…infrastructure that failed earlier  this year during a storm.\n\nThey got a resiliency grant from FEMA to help upgrade that  infrastructure so they would know that when there is a natural disaster  the water infrastructure will survive it and the people in the region  will have clean drinking water. The Department of Homeland Security  canceled that grant,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695041/better-is-possible"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "Ms. ELFRETH. Madam Chair, I rise in opposition to the amendment.\n\nMs. ELFRETH. Madam Chair, House Natural Resources Committee Democrats  strongly oppose Biggs amendment No. 29, which seeks to weaken the  Department of Defense's work to preserve habitats crucial for military  readiness…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695231/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…favors commonsense land management and prioritizes community buy- in over preservationist policies that are cooked up here in Washington,  D.C.\n\nAs chairman of the Committee on Natural Resources, I have often said  that some of our most meaningful work increasing access to our public  lands will maybe never be a headline on FOX News or CNN, but it will…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690405/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "Mr. PFLUGER. Mr. Speaker, I rise today in support of my legislation,  H.J. Res. 35, to nullify the EPA's rule on the waste emissions charge,  also known as the natural gas tax.\n\nWith President Trump back in office, it is time to restore American  energy. It is time to restore American energy dominance, which is why I  am proud to lead this…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688184/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…final passage without intervening motion except: (1) one hour       of debate equally divided and controlled by the chair and       ranking minority member of the Committee on Natural Resources       or their respective designees; and (2) one motion to       recommit.\n\nSec. 7. The joint resolutions referred to in section 6 of       this resolution are as…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694880/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "French Hill", "party": "Republican", "sentence": "…the challenges of COVID-19,  played a pivotal role in the Connecting Arkansas Program, which  included over 30 State highway construction projects and helped  modernize the Natural State's transportation infrastructure.\n\nShe has left a lasting mark on the department and our State, and she  has proven to be a tireless and effective leader.\n\nI thank Lorie…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688705/recognizing-lorie-tudor-on-her-retirement"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…communities, the industries, and the sectors that they lead.\n\nI had very productive discussions about a number of actionable items  concerning public safety, wildfire prevention, natural resources,  transportation infrastructure, and California water, issues that are so  important to our region and our communities. I am so grateful that so  many leaders in…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Mike Simpson", "party": "Republican", "sentence": "…top line. EPA is cut  by nearly 4 percent.\n\nMr. SIMPSON. Mr. Speaker, renewable energy is cut by $34 million,  while providing targeted increases that preserve our Nation's natural  heritage and ensure a sustainable and fiscally responsible future.\n\nPassage of these bills will send a strong message that Congress is  determined to return to regular order…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698758/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Paul Gosar", "party": "Republican", "sentence": "…with countless jobs and the  capacity to power thousands of American homes.\n\nI thank the chairman of the committee, Mr. Westerman, committee  staff, and my colleagues on the Natural Resources Committee for helping  me bring this legislation to the floor today. A special thank you to my  Arizona delegation cosponsors, my good friends, Representatives Biggs…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693918/la-paz-county-solar-energy-and-job-creation-act"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…to Republicans. They felt they would be  discriminated against if they knew they gave money to a Republican  politician.\n\nThere are people who worked for the Department of Natural Resources  in Wisconsin, which is the equivalent of the EPA in Washington, who  tell me about problems in their department but caution me that they  could never cite them.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695628/breakdown-of-traditional-families"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…authorities to address  vulnerabilities.\n\nIn recent years, we have seen how supply chain constraints and  bottlenecks for key grid components, such as distribution transformers  and natural gas turbines, can stifle infrastructure development.\n\nBy establishing periodic assessments under this legislation, the  Department will remain in a proactive posture to identify…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697897/electric-supply-chain-act"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…nonnuclear Iran. I urge the leadership to bring it  to the floor for a vote.\n\nOur Declaration of Independence proclaims that whenever a government  becomes destructive of the natural rights of its people, it becomes  their right to alter or abolish it. This critical hour has come for the  people of Iran.\n\nI believe it is time for the United States to step…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691210/supporting-a-free-democratic-and-secular-iran"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "Mr. WALBERG. Mr. Speaker, I thank the chairman for yielding me time.\n\nMr. Speaker, to Michiganders, the Great Lakes are more than just a  natural resource. They are a source of pride for our State, a  cornerstone of our identity, and a home to our world-class fisheries.\n\nFrom Lake Michigan to Lake Erie, generations…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693993/great-lakes-mass-marking-program-act-of-2025"}, {"senator": "Richard Hudson, Jr.", "party": "Republican", "sentence": "…protect the environment, ensure we protect public health, and lower  energy costs by speeding up energy projects through much-needed reforms  to the permitting of interstate natural gas pipelines.\n\nThe development of interstate pipelines currently faces significant  regulatory and statutory hurdles. In fact, in 2024, we produced less  than half the pipeline…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698064/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…American  patriot, Craig Beam. I congratulate Craig on his well-deserved  retirement from the U.S. Marshals Service.\n\nWhen most Americans hear of a fugitive on the run, their natural  instinct is to protect their loved ones within and avoid coming across  the wanted criminal at all costs. Craig's approach to protecting his  family and loved ones is a little…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689178/border-common-sense"}, {"senator": "Mike Johnson", "party": "Republican", "sentence": "…unexpectedly at the age  of 65. A lifelong resident of Northern California, Doug was a fierce  fighter for the people he represented and for his state's vast and  beautiful natural resources.\n\nRepresenting one of California's largest districts, Doug never  hesitated to drive hundreds of miles to meet a handful of constituents.  He drew no distinctions…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698734/9999"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…passage without intervening       motion except: (1) one hour of debate equally divided and       controlled by the chair and ranking minority member of the       Committee on Natural Resources or their respective designees;       and (2) one motion to recommit.\n\nSec. 2.  The joint resolutions referred to in the first       section of this resolution are…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690387/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}]