[{"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…0          0          0          0       -375       -300      -275      -275      -275            0       -1,500  Waste Reduction Incentive Program for Petroleum and  Natural Gas Systems Sec. _26  Project Sponsor Opt-in Fees for Environmental             *          *          *          *          *          *          *         *         *…", "date": "2025-07-09", "source_url": "https://justfacts.votesmart.org/public-statement/1693322/greenhouse-gas-reduction-fund"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…drilling  and lower consumer prices.\n\nWe must act now to fix our outdated electric grid to bring more  renewable energy sources online. This will make us less reliant on  natural gas prices that fluctuate.\n\nThis week, the majority brought bills before this House, claiming to  save Americans money on utility bills. These bills did nothing to  update our…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698098/functioning-in-the-face-of-an-affordability-crisis"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…advance economic growth or provide jobs or, equally important, make  energy more affordable.\n\nIf this administration can derail a fully approved energy project,  whether it is natural gas pipelines or offshore wind farms, why would  any developer--why would anyone invest in the United States?\n\nThe credibility of the United States as a place to do business…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696127/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…delivering for everyday Americans. If they were,  they would take a stand on ridiculous tariffs that Trump is imposing on  our closest allies or unconstrained exports of liquefied natural gas  that are driving up energy prices or repealing energy tax credits in  the IRA, all policies on their side that are going to raise energy  prices.\n\nIf they were delivering…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688632/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "Mr. Speaker, I rise in strong opposition to this bill. This bill  would allow unlimited amounts of our liquefied natural gas, or LNG, to  be sent abroad to any designation in the world including to our  adversaries like China.\n\nThis is all about China. The President gets up on a regular basis…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697094/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…language in  this bill is the bogus definition about what counts as ``reliable  generation facility.'' It should come as no surprise that the only  things that count are coal, natural gas, and nuclear. That is it, not  wind, not solar, not either of those even when paired with battery  storage. It is completely ridiculous and the latest example of  Republicans'…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697886/state-planning-for-reliability-and-affordability-act"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…appear  before us. Just to show you the fast-pass that polluters and gas  companies are getting, we asked him about the Energy Secretary's trip  overseas to try to sell more natural gas from Americans. I asked him:  Well, have you done any analysis on this to show that that is not going  to raise costs on American ratepayers and consumers?\n\nHe said: No,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695752/guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…effect next year.\n\nHere is the proof. Here is a report from September of this year:  ``Residents in at Least 41 States and Washington, D.C., Are Facing  Increased Electric and Natural Gas Bills.''\n\n``Utilities are increasing prices for customers across the country.''  Including all the way through to 2028, monthly residential bill impacts  are going to be…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695692/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…the context of this bill.\n\nThe bottom line is that electricity prices are up 13 percent  nationwide just since President Trump took office--I already mentioned  that--and natural gas prices are up 8 percent nationwide since a year  ago, 14 percent in my home State of New Jersey, in part due to  increased exports of liquefied natural gas. Both of these…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698067/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…like in red States and  say with a simple vote--majority vote--we are going to get rid of them?  we don't like your rule on mifepristone? we don't like your license for  natural gas? we don't like something your State likes, and therefore we  are going to legislate by CRA? Because that is what is going to happen.  You can overturn the Parliamentarian…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691582/hj-res-88"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…unlimited access to our public lands  and waters, killing wind, killing solar, killing all-electric vehicles,  killing anything that gets in the way of the agenda of the oil and  natural gas industry in our country, and now--now--he is giving them  Venezuela. We know he told oil execs before and after the invasion  about his plans for Venezuela, not Members…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698823/9999"}, {"senator": "Greg Landsman", "party": "Democrat", "sentence": "…authority that this administration has already used to roll back  environmental protections, cancel energy projects, and drive costs up.\n\nThe bill would be a win for coal and natural gas, not American  ratepayers. For this reason, at the appropriate time, I will offer a  motion to recommit this bill back to committee. If the House rules  permitted, I would…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699995/securing-americas-critical-minerals-supply-act"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…industry if you  are working in a way that is trying to maximize American ingenuity.  That is who we are. We make things that are smarter.\n\nNow, a lot of people--I would say the natural gas and oil industry at  the top of the list--they don't want there to be progress. Why is that?  Because the less efficient something is, the more energy, the more  electricity…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690527/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…for the oil and gas industry to waste valuable methane rather  than install or upgrade equipment to control that pollution.\n\nCurrently, oil and gas companies waste enough natural gas from leaks,  venting, and flaring to meet the energy demand of 14 million households  every year. In other words, the oil and gas industry is throwing $2  billion worth…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688180/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…tremendous regulatory uncertainty through  DOGE, senseless tariffs, and unprecedented executive actions. As a  result, as I mentioned, electricity prices are up 13 percent, and  natural gas prices are up 8 percent since the President took office.\n\nMr. Speaker, this holiday season, Americans are struggling to afford  record-high utility bills and skyrocketing…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698275/reliable-power-act"}, {"senator": "Troy Balderson", "party": "Republican", "sentence": "…today in support of the Improving  Interagency Coordination for Pipeline Reviews Act. This legislation  will bring much-needed reforms to the Federal permitting process.\n\nNatural gas has become the foundation of America's energy mix,  accounting for almost 40 percent of our total energy production and 43  percent of electricity generation.\n\nThe shale…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698070/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Roger Marshall", "party": "Republican", "sentence": "…that so? If there is  a strong world economy, then the infrastructure can be built for energy  production with a smaller carbon footprint.\n\nI think of building pipelines for natural gas, for instance, as  opposed to all these countries that are still burning coal, that are  burning wood and diesel fuel, heating fuel. I can't even believe that  still, in…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698992/unanimous-consent-request-s-res-550"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…Trump  has taken us from energy desperate under the previous administration to  energy dominant again.\n\nHe declared a national energy emergency. He unleashed record oil and  natural gas production. He reopened millions of acres for responsible  energy development, and he rolled back radical regulations that were  driving up costs.\n\nPresident Trump, in Kentucky,…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699277/highlighting-republican-successes-in-2025"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…process to       authorize the construction, connection, operation, and       maintenance of international border-crossing facilities for       the import and export of oil and natural gas and the       transmission of electricity. All points of order against       consideration of the bill are waived. The amendment in the       nature of a substitute recommended…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695524/providing-for-consideration-of-hr-dc-criminal-reforms-to-immediately-make-everyone-safe-act-providing-for-consideration-of-hr-district-of-columbia-policing-protection-act-providing-for-consideration-of-hr-lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia-providing-for-consideration-of-hr-district-of-columbia-judicial-nominations-reform-act-providing-for-consideration-of-hr-guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act-providing-for-consideration-of-hr-national-coal-council-reestablishment-act-providing-for-consideration-of-hr-promoting-cross-border-energy-infrastructure-act-and-for-other-purposes"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "Mr. GUTHRIE. Mr. Speaker, pursuant to House Resolution 879, I call up  the bill (H.R. 1949) to repeal restrictions on the export and import of  natural gas, and ask for its immediate consideration in the House.\n\nThe Clerk read the title of the bill.\n\nMr. GUTHRIE.  1949.\n\nMr. Speaker, in February 2016, the first cargo of U.S.…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697089/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Mike Collins", "party": "Republican", "sentence": "…frivolous lawsuits with  environmentalists on a build-out plan of 2\\1/2\\ or 3 years.\n\nIt doesn't make common sense when an electric generating power  company wants to build a natural gas facility but they will miss the  economic growth because it takes over 10 years to get a permit to lay  the pipeline.\n\nIt doesn't make common sense when our rural communities…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698036/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…is  because of Democratic policies and mandates, EV mandates, and mandates  about solar panels and wind farms that are far less efficient than  nuclear and clean-burning natural gas. Those things are driving up the  price of energy for the average American and putting that money into  the pockets of a handful of wealthy people and the Chinese. I  congratulate…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695719/highlighting-flawed-policies"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…grant utility and transportation rights-of-way to the Apex  Industrial Park Owners Association, the city of North Las Vegas, and  Clark County for electric, power, water, natural gas, telephone,  railroad, or highway facilities.\n\nCongress created the Apex Industrial Park in 1989 by authorizing the  sale of roughly 21,000 acres of Bureau of Land Management…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691121/apex-area-technical-corrections-act"}, {"senator": "John Hoeven", "party": "Republican", "sentence": "Mr. HOEVEN. Mr. President, I am pleased to come to the floor again  today to discuss my resolution to block the Democrats' natural gas tax,  which I will call up right after we vote to affirm President Trump's  national energy emergency declaration.\n\nThe Biden administration's tax and regulatory onslaught…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688157/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Troy Balderson", "party": "Republican", "sentence": "…our commitment to lowering costs for families and  restoring American energy dominance.\n\nI am proud to represent parts of the Utica and Marcellus shale  formations, where natural gas development has transformed local  economies and strengthened our Nation's energy security. Boosting  natural gas production in Ohio and expanding LNG exports are essential…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697093/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…agencies, pipeline infrastructure approvals in this country  have been significantly delayed in many cases, often resulting in  insufficient infrastructure to transport our clean natural gas.\n\nThe result is an electric grid that is less reliable and increased  utility prices for hardworking Americans. While natural gas demand is  expected to reach an all-time…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698069/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…Potential Act of 2025. I am proud to be an  original cosponsor of this very important legislation.\n\nThe United States is already the world's leading producer of oil and  natural gas and also the top exporter of LNG. A whole lot of that  energy comes straight out of my district in the great State of Texas.\n\nThat is why it is long past time that we repeal…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697084/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…solar panels.''\n\nLast month, the Biden administration unveiled its $2       trillion Green New Deal-fueled environmental plan, which       includes eliminating coal, oil and natural gas as electricity       sources by 2035.\n\nMr. GRIFFITH. Madam Speaker, I yield myself such time as I may  consume.\n\nMadam Speaker, let me assure you that those of us on this…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688523/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…coal-producing State and the number 3 oil  and gas producer in the Nation. According to State estimates, North  Dakota produces 400 million barrels of oil, 1.1 trillion cubic feet of  natural gas, and 27.5 million tons of lignite coal annually.\n\nTo put this in perspective, North Dakota produces enough natural gas  to heat 15 million homes for an entire year, equivalent…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694908/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…the energy stakeholders  in my State.\n\nThis heavy-handed Federal mandate punishes small and midsize  independent producers who are responsible for 90 percent of America's  natural gas. It threatens jobs, raises costs for families, and  jeopardizes our energy independence.\n\nNorth Dakota leads the way in responsible energy production, not  because of government…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688186/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}]