[{"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…businesses have access to these opportunities. We need to not only do  more for small businesses with existing Federal contracts but also help  attract new small businesses to navigate the Federal contracting  process.\n\nThe SPUR Act will help ensure more small businesses, like those in  the San Gabriel Valley which I represent, can fairly compete for  Federal…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687943/small-business-procurement-and-utilization-reform-act-of-2025"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "…protections and  funding provided by IDEA, more students are left behind. Without  federally supported services that help with early detection, children  are less able to navigate a world that wasn't built for them.\n\nIDEA doesn't provide special treatment. It provides children with  fair and inclusive treatment, and it doesn't waste Federal resources.…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698947/protecting-education-for-children-with-disabilities"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…the Trump agenda to abolish  the Department of Education.\n\nThese actions will make it more difficult for local schools to get  the funding they need. Now, they will have to navigate multiple Federal  agencies instead of one. It is inefficient, unnecessary, and unpopular.\n\nPoll after poll shows that the majority of parents support the  Department of Education,…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697292/trump-administration-dismantling-department-of-education"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…would modernize the Federal Aviation  Administration's outdated policies and remove barriers to lifesaving  mental health care for the aviation workforce.\n\nAs we continue to navigate the aftermath of traffic aviation  accidents and harrowing near misses across this country, we must  support the mental health of the dedicated women and men on the front…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695006/mental-health-in-aviation-act-of-2025"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…are known to target the most vulnerable, including seniors, veterans,  and low-income borrowers. Many in these communities are already  struggling to make ends meet as they navigate the President's tariffs  and stubbornly high prices, and are continuing to pay exorbitant APRs  may cause them to fall deeper into economic insecurity. This is why it  is…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699782/9999"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…in 2010 was 54 million Americans as opposed to 73 million  Americans today. We have more people who need help with the Social  Security system and fewer staff to help them navigate it.\n\nIn just 1 week from today, they are pretty much going to shut off  phone service for Social Security beneficiaries who are trying to sign  up with their bank information…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689134/dont-touch-social-security"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…fall  under these cuts.\n\nIt will also have disastrous, long-term consequences for the rural  entrepreneurs and working-class families in my home State who rely on  the SBA to navigate Federal assistance and recover from economic  setbacks, like the increased costs they are facing because of Trump's  reckless trade war.\n\nMr. Speaker, while we are having…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691944/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…master's in Health  Law and Strategy from New York University, helping to expand her  understanding of the healthcare system, especially in the legal  context. Her ability to navigate both school and work demonstrates her  flexibility and willingness to take on new challenges.\n\nAlison has also been an active part of our office culture, helping to  mentor…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695684/recognizing-alison-cohen-and-her-service-to-the-us-house-of-representatives"}, {"senator": "Josh Harder", "party": "Democrat", "sentence": "…has rocked our community to its core.\n\nMr. Speaker, I ask for a moment of silence to honor the victims,  including Amari, Susano, Maya, Journey, and their families as they  navigate this tragedy.\n\nMy wife, Pam, and I are praying for the victims, their families, and  our community. We are and always will be Stockton Strong.", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697396/horrific-mass-shooting-in-stockton"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…and has developed award winning patient  education, advocacy, and research work to give patients the tools they  need to make informed decisions about their spine health and navigate  their own treatment journeys with confidence.\n\nTo further address the complex challenges of spinal health, the  Foundation has created four specialized task forces led by…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696032/recognizing-october-as-national-spine-health-awareness-month"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…both Departments to dedicate resources to planning for the  Supreme Court's decision. Proper planning is needed around an  information campaign for small businesses on how to navigate the tariff  protest process, ensuring that eligible tariff refunds are provided on  an expedited basis. Without a plan, the complexity and time needed to  pursue a refund…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698342/president-trumps-tariff-policies"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…they earned,  providing both in-person and virtual benefits counseling. She also  partnered closely with veteran service organizations and nonprofit  groups to help veterans navigate and access the support available to  them.\n\nEven in retirement, Rebecca continues her commitment to veterans in  her community by volunteering with arts organizations that…", "date": "2026-02-17", "source_url": "https://justfacts.votesmart.org/public-statement/1700085/recognizing-rebecca-sawyer-smith"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…team finds and tests new commercial technologies and  collaborates with companies to adapt them for use along our border.\n\nThese Federal employees also help companies and CBP navigate  procurement and other processes that we need to move these technologies  as quickly as possible to the front lines.\n\nNew technologies don't just help with catching drugs.…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688687/emerging-innovative-border-technologies-act"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…reflected in U.S. law.\n\nThis legal disconnect has left the American fleet, including vessels  operating out of Hawaii, in a state of regulatory limbo. Operators are  forced to navigate conflicting rules between what the treaty allows and  what our domestic regulations enforce. It's a situation that adds  unnecessary risk, uncertainty and cost to an industry…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691007/south-pacific-tuna-treaty-act-of-2025"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…definitely not the bill that I  would have written if it were up to me. There are steep cuts to really  important programs, and we are asking our diplomats and our partners to  navigate a riskier world with fewer resources. The cuts to humanitarian  assistance are especially disappointing, and they are the result of the  administration effectively shutting…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699751/9999"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…community projects.\n\nMy office responded to more than 81,000 constituent letters, answered  nearly 8,000 phone calls, and closed nearly 1,600 constituent cases,  helping folks navigate the Federal agencies and Federal bureaucracy.\n\nThe most rewarding part of being a Representative is helping  individuals and families get the assistance that they need. Throughout…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698682/recognizing-the-honorable-steny-hoyer"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…amended,  offered by Representative Sylvia Garcia of Texas.\n\nThis bill would create coordinators within each of the Veterans  Integrated Service Networks to help veterans navigate cancer care.  Specifically, this bill aims to improve care coordination for common  cancers in women.\n\nNo person wants to hear that they have or that their loved one has…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695420/women-veterans-cancer-care-coordination-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…with the government  more difficult and costly for small businesses.\n\nCurrently, government contract solicitations are written in an overly  complex way that is difficult to navigate unless someone is an attorney  or contract specialist. One study found that only 3 percent of  government contracts are written in a way that someone without a  college degree…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691850/plain-language-in-contracting-act"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…Army that  were instrumental in maintaining relationships between the executive  and legislative branches. Through his ability to clearly define the  Army's message and help navigate the needs of Congress to provide  essential oversight requirements, Kyle has made a lasting impact on our  Nation's ability to respond to global threats, modernize the Army,…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694098/recognizing-the-service-of-lieutenant-colonel-kyle-frazer"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Honoring Pharmacists as Key Resources\n\nMr. CARTER of Georgia. Mr. Speaker, I rise today to recognize the  invaluable role of pharmacists in supporting older adults as they  navigate the difficulties of medication management.\n\nThis expertise is especially vital as we age when new prescriptions,  changing doses, and potential drug interactions become more…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699709/retirement-of-judge-ronnie-fender"}, {"senator": "Mike Simpson", "party": "Republican", "sentence": "…the high level of service we've provided to Idahoans--and Linda played  a key role in making that happen. Federal government agencies are often  difficult and complex to navigate. However, Linda's ability to cut  through the red tape made her an invaluable resource and help to many.\n\nLinda's public service did not stop at casework. She created mobile…", "date": "2025-06-20", "source_url": "https://justfacts.votesmart.org/public-statement/1692691/recognizing-linda-culvers-retirement"}, {"senator": "Mike Johnson", "party": "Republican", "sentence": "…country's incredible Cabinet Secretaries have been involved, as well.  They have assisted us in countless ways throughout this process.\n\nOur Vice President, JD Vance, helped us navigate so many dire straits  along the last several weeks through the House and the Senate, and of  course, our bold, visionary, fearless President, Donald J. Trump.\n\nPresident Trump…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693177/one-big-beautiful-bill-act"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…economy.\n\nThe EPA established technical assistance programs to connect rural  communities like those in my district and across the United States with  experts to help them navigate the Federal funding process to obtain  water infrastructure.\n\nUnfortunately, some of these technical assistance programs have  failed to provide adequate assistance, hindering…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695402/water-resources-technical-assistance-review-act"}, {"senator": "Tony Wied", "party": "Republican", "sentence": "…U.S. Chamber of Commerce  found that over half of small business owners view the cost of  complying with regulations as a barrier to growth.\n\nSmall businesses are forced to navigate complex environmental  reporting requirements, overtime and wage rules that change from one  administration to the next, and lengthy permitting processes that can  delay construction…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697345/destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…coordinating  local response efforts and guiding recovery planning. His ability to  bring people together, communicate clearly, and keep the public  informed helped Avery County navigate hardship with resilience and  unity.\n\nPhillip's service has been widely recognized for his leadership and  impact. In 2017, he was named Mayland Community College's Distinguished…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699450/recognizing-phillip-barrier"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…will raise her hand and take the Oath of Allegiance,  becoming a proud citizen of the United States of America.\n\nMy office was honored to play a small part in helping her navigate  the final steps of that journey. Her story is a reminder that the  American Dream is not always fast or easy, but it is real, and it is  still worth fighting for.\n\nI congratulate…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691362/congratulating-oslene-ducady-on-becoming-an-american-citizen"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…Senate colleagues who are equally working on this.  This is ultimately why I am back here, is to make sure that this work  is done in the most responsible way possible. As we navigate the  reconciliation process over the next few months, I look forward to  being able to celebrate some significant wins for our American families  and our economy.", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689152/advancing-america-first-policies"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Center,  offering her time weekly to support veterans. She also volunteers with  the Salvation Army of Pasco County's Domestic Violence Program each  week, helping survivors navigate the legal process by reviewing and  drafting petitions for Injunctions for Protection at the West Pasco  Judicial Center. Kathy acts as a link between these clients in need…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691195/recognizing-kathy-logue"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "…as  a simple tool to improve sorting and delivery, but over the decades ZIP  Codes have evolved into far more than postal convenience. They have  become integral to how we navigate modern life.\n\nEconomic developers rely on ZIP Codes to attract businesses and plan  growth. Insurance companies use them to calculate premiums. Emergency  responders depend…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693904/single-unique-zip-codes-for-certain-communities"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…and wellness  initiatives, caregiver support, and much more. With senior centers  across the county, the Committee has been able to help elderly adults  and their families navigate the challenges that can arise while aging.\n\nMr. Speaker, by celebrating the Fiftieth Anniversary of the Wood  County Committee on Aging, the county can recognize the outstanding…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695853/recognizing-the-semicentennial-of-the-wood-county-committee-on-aging"}]