[{"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…benefiting  by the agency of the north, sees its agriculture grow and its commerce  expand. Turning partly into its own channels the seamen of the north,  it finds its particular navigation invigorated; and while it  contributes, in different ways, to nourish and increase the general  mass of the national navigation, it looks forward to the protection of  a…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700271/president-washingtons-farewell-address"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…1778, Native Hawaiians had  developed a complete and vibrant culture with their own language,  religion, values and sophisticated systems of governance, agriculture  and navigation.\n\nYet, like so many other indigenous peoples, post-contact Native  Hawaiians endured marginalization, suppression and loss of their  traditions in their own homelands. While…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695915/recognizing-hawaiian-history-month"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…Jordan. Just as we need roads, rails, and  broadband, we need buoys, satellites, and tide gauges so our ships can  safely transport goods in and out of our ports. This is navigation,  weather, safety, commerce, and, yes, climate science.\n\nProposals to gut NOAA's funding by more than 25 percent, to decimate  the Office of Oceanic and Atmospheric Research…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691327/noaa-contributes-to-our-economy-and-well-being"}, {"senator": "Laura Gillen", "party": "Democrat", "sentence": "…from California for  yielding.\n\nMadam Speaker, I rise in support of H.R. 4275, the bipartisan Coast  Guard Authorization Act of 2025, which includes my provision to improve  navigation in the East Rockaway Inlet off the South Shore of Long  Island and to strengthen maritime drug enforcement in our waters.\n\nMadam Speaker, East Rockaway Inlet is a critical…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694194/coast-guard-authorization-act-of-2025"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…Bonamici said it right. This legislation will enable  NOAA to continue addressing the adverse impacts of marine debris on our  country's maritime economy and will ensure safe navigation on America's  waterways. Importantly, this legislation will promote clean water and  the protection of our natural resources without imposing new mandates  on industry or…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698191/save-our-seas-amendments-act"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…survivors have evolved, The Hotline has implemented  responsible, survivor-centered technology innovations--including  expanded chat and text services and improved resource navigation to  increase access, reduce barriers, and better meet demand nationwide.\n\nThis 30-year milestone is not a celebration of the continued  prevalence of domestic violence. The…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700099/recognizing-the-30th-anniversary-of-the-national-domestic-violence-hotline"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…benefitting by the agency of the North, sees  its agriculture grow and its commerce expand. Turning partly into its  own channels the seamen of the North, it finds its particular  navigation invigorated; and while it contributes, in different ways, to  nourish and increase the general mass of the national navigation, it  looks forward to the protection of a maritime…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700163/reading-of-washingtons-farewell-address"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…face significant  challenges. Heavy smoke can severely limit visibility, grounding  aircraft and disrupting response efforts. Rapidly changing fire  behavior can complicate navigation and real-time coordination among  multiple aircraft operating simultaneously. These airspace management  challenges can hinder operations at the very moment decisive action…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700124/advanced-capabilities-for-emergency-response-operations-act"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…including fentanyl, overdoses. Sec. 272. Policy on methods to reduce incentives for illicit maritime                drug trafficking. Sec. 273. Report on condition of aids to navigation. Sec. 274. Feasibility study on supporting additional port visits and                deployments in support of Operation Blue Pacific. Sec. 275. Study and gap analysis with…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Michael Cloud", "party": "Republican", "sentence": "…there is $50 million for the ARDP  demonstration programs and $77 million for risk-reduction projects. We  secured close to $5 billion in Army Corps projects that improve  navigation and operating waterways for vessels which strengthens our  economy, helps us to export, and helps us to lead on the world stage.\n\nProjects like the Matagorda and Corpus Christi…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694857/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Garisto--Materials, Mavrick Putnam--Marine Safety and Environmental  Protection, Lisa Repetto--Publications and Recreational Boating Safety  Program Visitations, Gerard Gaudry--Navigation Systems,  Tim Dolan--Operations and Rescue and Survival Systems, Mark Kolupa-- Secretary/Records, and Andre Skoinezny--Vessel Examinations. It is my  hope that my colleagues…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690718/recognizing-coast-guard-auxiliary-clearwater-flotilla-11-1s-75th-anniversary"}, {"senator": "James Risch", "party": "Republican", "sentence": "…Electronic Units;       twenty-nine (29) AN/APR-48B Modernized Radar Frequency       Interferometers (MRFI); seventy (70) Embedded Global       Positioning Systems with Inertial Navigation Systems plus       Multi-Mode Receiver (EGI+MMR) (58 installed, 12 spares);       thirty-five (35) AAR-57 Common Missile Warning Systems (CMWS)       (29 installed, 6 spares);…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695536/arms-sales-notification"}, {"senator": "James Risch", "party": "Republican", "sentence": "…Also included were AN/APX-126 Advanced       Identification Friend or Foe (IFF); ARC-210 Radios; KIV-78       Cryptographic Appliques; other secure communications,       navigation, and encryption devices; Joint Mission Planning       System (JMPS) software; aircraft minor modification,       integration and test support, support equipment, software…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689947/arms-sales-notification"}, {"senator": "James Risch", "party": "Republican", "sentence": "…Arms Export Control Act, of three (3) RQ-4 Block 30 (I)       Global Hawk Remotely Piloted Aircraft with Integrated Sensor       Suite (EISS); eight (8) Kearfott Inertial Navigation System/      Global Positioning System (INS/GPS) units (2 per aircraft       with 2 spares); and eight (8) LN-251 INS/GPS units (2 per       aircraft with 2 spares). Also…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692321/arms-sales-notification"}, {"senator": "James Risch", "party": "Republican", "sentence": "…remanufactured T700-GE 701D engines;       twenty-seven (27) AN/AAR-57 Counter Missile Warning Systems       (CMWS); eighteen (18) Embedded Global Position Systems with       Inertial Navigation (EGI) with Multi-Mode Receiver (MMR);       thirty-six (36) remanufactured EGIs with MMR; eight (8) AN/      ASQ-170(V) Modernized Target Acquisition and Designation…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699550/arms-sales-notification"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…pass the Sanction Sea  Pirates Act and send an unmistakable message: The United States of  America stands firmly against sea piracy and is committed to ensuring  freedom of navigation against crime in the high seas. I yield back the  balance of my time.\n\nMr. BURCHETT. Mr. Speaker, on that I demand the yeas and nays.\n\nThe yeas and nays were ordered.", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692720/sanction-sea-pirates-act-of-2025"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "…As  a part of the Tennessee Valley Authority's network of hydroelectric  dams, Wilson Dam supports TVA's mission of providing low-cost, reliable  power, flood control, and navigation of the Tennessee River. Over the  past 100 years, Wilson Dam has powered communities, enabled river  commerce, and driven economic growth throughout the Tennessee Valley.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695404/recognizing-wilson-dam-on-its-100th-anniversary"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…began his career aboard  operational cutters in the Great Lakes, supporting essential missions  including fisheries enforcement, search and rescue, icebreaking, and  aids to navigation. These missions were vital to the safety of mariners  and the protection of our waterways.\n\nAs he advanced through the enlisted ranks, CWO4 McInnis served in  increasingly…", "date": "2025-12-19", "source_url": "https://justfacts.votesmart.org/public-statement/1698462/recognizing-united-states-coast-guard-cwo4-james-mcinnis-as-december-2025-veteran-of-the-month"}, {"senator": "James Risch", "party": "Republican", "sentence": "…fragment-sensitive targets       and is not intended for hard targets or penetrations.\n\n3. KMU-559 Joint Direct-Attack Munitions (JDAM) tail kits       contain an Inertial Navigation System (INS)/Global       Positioning System (GPS) (using either Selective Availability       AntiSpoofing Module (SAASM) or M-code) guidance capability       that converts…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688394/arms-sales-notification"}, {"senator": "James Risch", "party": "Republican", "sentence": "…warhead. It has an effective range of       between 70 and 300 kilometers and has increased accuracy over       previous versions of the ATACMS due to a GPS/PPS aided       navigation system provided by SAASM or M-Code.\n\n6. The AN/PRC-160 is a high frequency tactical radio       communications for vehicular and dismounted command and       control operations.…", "date": "2025-10-02", "source_url": "https://justfacts.votesmart.org/public-statement/1695978/arms-sales-notification"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…fight.\n\nMr. Chair, I rise in support of H.R. 4016, particularly our  amendments, the wireless power transmission, No. 371, as well as the  MAPS Generation II, a precision navigation and timing system.\n\nAs a combat veteran myself, I know firsthand how critical it is to  provide our warfighters with the tools they need to be able to achieve  mission success.…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693653/department-of-defense-appropriations-act-2026"}, {"senator": "James Risch", "party": "Republican", "sentence": "…capabilities. Each transceiver is software programmable and       operates at variable frequencies and uses various standard       waveforms.\n\nThe DAGR is a small commercial Navigation Satellite Timing       and Ranging (NAVSTAR) GPS receiver designed for military       operations. The Selective Availability/Anti Spoofing Module       (SAASM) is a security…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690233/arms-sales-notification"}]