[{"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…70 million American women at  risk of disenfranchisement. Seventy million is one in four voters in  this country. This burden will fall hardest on women already forced to  navigate broken systems with fewer resources and less time: working  mothers, caregivers, women juggling jobs and families.\n\nI cannot believe that in the year 2025, I have to stand…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689408/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…Ultimately, servicemembers will need to seek legal assistance to deal  with trespassing cases. We owe it to servicemembers to provide them  with the information and resources to navigate that process.\n\nThis legislation, unfortunately, does not bolster access to legal  assistance, but I hope the sponsors of this legislation will join us on  those efforts in…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695470/servicemember-residence-protection-act"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…would modernize the Federal Aviation  Administration's outdated policies and remove barriers to lifesaving  mental health care for the aviation workforce.\n\nAs we continue to navigate the aftermath of traffic aviation  accidents and harrowing near misses across this country, we must  support the mental health of the dedicated women and men on the front…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695006/mental-health-in-aviation-act-of-2025"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…both Departments to dedicate resources to planning for the  Supreme Court's decision. Proper planning is needed around an  information campaign for small businesses on how to navigate the tariff  protest process, ensuring that eligible tariff refunds are provided on  an expedited basis. Without a plan, the complexity and time needed to  pursue a refund…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698342/president-trumps-tariff-policies"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…source of immense pride for our  district.\n\nAs both a tax preparer and site coordinator at two VITA locations,  Mr. Phillips has helped thousands of individuals and families navigate  the tax system--even during the height of the COVID-19 pandemic, when  many other sites were forced to close. Thanks to his dedication, and  that of fellow volunteers, the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695269/recognizing-the-work-of-robert-phillips"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…men and women of our military. We would provide free  automatic IDs. We would allow same-day voter registration for eligible  voters, and we wouldn't force married women to navigate even more  bureaucratic obstacles. We wouldn't force States to turn over their  voter rolls, and wouldn't actively discourage voting by mail.\n\nMr. Speaker, I have a different…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699937/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…pediatric medical specialists and palliative care to behavioral health  and occupational therapies. They both have rare, incurable, disabling  diseases that require IEPs to navigate school.''\n\nShe continues but I want to pause right there. I think that is an  important point, talking about her children and the IEPs to navigate  school. We should be looking…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Josh Harder", "party": "Democrat", "sentence": "…has rocked our community to its core.\n\nMr. Speaker, I ask for a moment of silence to honor the victims,  including Amari, Susano, Maya, Journey, and their families as they  navigate this tragedy.\n\nMy wife, Pam, and I are praying for the victims, their families, and  our community. We are and always will be Stockton Strong.", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697396/horrific-mass-shooting-in-stockton"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…disenfranchise millions of women and other  Americans through a federal takeover of state election administration.  One out of four Americans--69 million women--would have to navigate  barriers that should not be necessary to vote because they changed  their last name after marriage. Republicans claim that this new version  will ``fix'' this problem by…", "date": "2026-02-13", "source_url": "https://justfacts.votesmart.org/public-statement/1700083/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…the power of  community.\n\nLong before she held public office, Rose was deeply embedded in the  Rochester community through her longstanding work helping Jamaican  immigrants navigate complex landscapes of services and programs. She  became affectionately known among family and friends as a ``community  connector''--someone with a unique ability to guide…", "date": "2025-06-13", "source_url": "https://justfacts.votesmart.org/public-statement/1692570/recognizing-rose-bonnick"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…submits a proposal to work with the  Federal Government, they invest considerable time and resources into  making their submission the best it can be. They are also forced to  navigate a complex and time-consuming contracting process while  balancing their other important responsibilities.\n\nLast year, the Small Business Committee heard testimony from a small…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691761/transparency-and-predictability-in-small-business-opportunities-act"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "…have changed their names after marriage or divorce  and do not have a matching birth certificate. There is no cure in this  bill.\n\nMillions of Americans would be forced to navigate the complicated  process to change their birth certificate or be forced to pay more than  $130 for a passport.\n\nWho would be prevented from voting? Working people who don't…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690015/safeguard-american-voter-eligibility-act"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…the Trump agenda to abolish  the Department of Education.\n\nThese actions will make it more difficult for local schools to get  the funding they need. Now, they will have to navigate multiple Federal  agencies instead of one. It is inefficient, unnecessary, and unpopular.\n\nPoll after poll shows that the majority of parents support the  Department of Education,…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697292/trump-administration-dismantling-department-of-education"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…they earned,  providing both in-person and virtual benefits counseling. She also  partnered closely with veteran service organizations and nonprofit  groups to help veterans navigate and access the support available to  them.\n\nEven in retirement, Rebecca continues her commitment to veterans in  her community by volunteering with arts organizations that…", "date": "2026-02-17", "source_url": "https://justfacts.votesmart.org/public-statement/1700085/recognizing-rebecca-sawyer-smith"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "…protections and  funding provided by IDEA, more students are left behind. Without  federally supported services that help with early detection, children  are less able to navigate a world that wasn't built for them.\n\nIDEA doesn't provide special treatment. It provides children with  fair and inclusive treatment, and it doesn't waste Federal resources.…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698947/protecting-education-for-children-with-disabilities"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…community projects.\n\nMy office responded to more than 81,000 constituent letters, answered  nearly 8,000 phone calls, and closed nearly 1,600 constituent cases,  helping folks navigate the Federal agencies and Federal bureaucracy.\n\nThe most rewarding part of being a Representative is helping  individuals and families get the assistance that they need. Throughout…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698682/recognizing-the-honorable-steny-hoyer"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…information throughout the VA claims process. It is important  for these notice letters to be understandable so that the veterans and  survivors know their rights and how to navigate the claims process.\n\nI am pleased to see that the VA has recently improved some of their  notice letters. However, hundreds of other VA letters are still  difficult to understand.…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689678/clear-communication-for-veterans-claims-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…neighbors and other States, but from businesses and corporations  around the globe. These businesses face challenges that larger  corporations are often better equipped to navigate.\n\nThis bill will clarify the authority of the Small Business  Administration's august Office of Advocacy to examine international  economic data and represent small business…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687909/doe-and-sba-research-act"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…Army that  were instrumental in maintaining relationships between the executive  and legislative branches. Through his ability to clearly define the  Army's message and help navigate the needs of Congress to provide  essential oversight requirements, Kyle has made a lasting impact on our  Nation's ability to respond to global threats, modernize the Army,…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694098/recognizing-the-service-of-lieutenant-colonel-kyle-frazer"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Honoring Pharmacists as Key Resources\n\nMr. CARTER of Georgia. Mr. Speaker, I rise today to recognize the  invaluable role of pharmacists in supporting older adults as they  navigate the difficulties of medication management.\n\nThis expertise is especially vital as we age when new prescriptions,  changing doses, and potential drug interactions become more…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699709/retirement-of-judge-ronnie-fender"}, {"senator": "Mike Simpson", "party": "Republican", "sentence": "…is the high level of service  we've provided to Idahoans--and Amy played a key role in making that  happen.\n\nFederal government agencies are often difficult and complex to  navigate. However, Amy's ability to cut through the red tape made her  an invaluable resource and help to many throughout the state.\n\nAmy was also a great team builder. She created…", "date": "2025-08-08", "source_url": "https://justfacts.votesmart.org/public-statement/1694716/recognizing-amy-sorensen-as-she-prepares-for-retirement"}, {"senator": "Mike Johnson", "party": "Republican", "sentence": "…country's incredible Cabinet Secretaries have been involved, as well.  They have assisted us in countless ways throughout this process.\n\nOur Vice President, JD Vance, helped us navigate so many dire straits  along the last several weeks through the House and the Senate, and of  course, our bold, visionary, fearless President, Donald J. Trump.\n\nPresident Trump…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693177/one-big-beautiful-bill-act"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…economy.\n\nThe EPA established technical assistance programs to connect rural  communities like those in my district and across the United States with  experts to help them navigate the Federal funding process to obtain  water infrastructure.\n\nUnfortunately, some of these technical assistance programs have  failed to provide adequate assistance, hindering…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695402/water-resources-technical-assistance-review-act"}, {"senator": "Tony Wied", "party": "Republican", "sentence": "…U.S. Chamber of Commerce  found that over half of small business owners view the cost of  complying with regulations as a barrier to growth.\n\nSmall businesses are forced to navigate complex environmental  reporting requirements, overtime and wage rules that change from one  administration to the next, and lengthy permitting processes that can  delay construction…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697345/destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…coordinating  local response efforts and guiding recovery planning. His ability to  bring people together, communicate clearly, and keep the public  informed helped Avery County navigate hardship with resilience and  unity.\n\nPhillip's service has been widely recognized for his leadership and  impact. In 2017, he was named Mayland Community College's Distinguished…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699450/recognizing-phillip-barrier"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…will raise her hand and take the Oath of Allegiance,  becoming a proud citizen of the United States of America.\n\nMy office was honored to play a small part in helping her navigate  the final steps of that journey. Her story is a reminder that the  American Dream is not always fast or easy, but it is real, and it is  still worth fighting for.\n\nI congratulate…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691362/congratulating-oslene-ducady-on-becoming-an-american-citizen"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…Senate colleagues who are equally working on this.  This is ultimately why I am back here, is to make sure that this work  is done in the most responsible way possible. As we navigate the  reconciliation process over the next few months, I look forward to  being able to celebrate some significant wins for our American families  and our economy.", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689152/advancing-america-first-policies"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Center,  offering her time weekly to support veterans. She also volunteers with  the Salvation Army of Pasco County's Domestic Violence Program each  week, helping survivors navigate the legal process by reviewing and  drafting petitions for Injunctions for Protection at the West Pasco  Judicial Center. Kathy acts as a link between these clients in need…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691195/recognizing-kathy-logue"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "…as  a simple tool to improve sorting and delivery, but over the decades ZIP  Codes have evolved into far more than postal convenience. They have  become integral to how we navigate modern life.\n\nEconomic developers rely on ZIP Codes to attract businesses and plan  growth. Insurance companies use them to calculate premiums. Emergency  responders depend…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693904/single-unique-zip-codes-for-certain-communities"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…and wellness  initiatives, caregiver support, and much more. With senior centers  across the county, the Committee has been able to help elderly adults  and their families navigate the challenges that can arise while aging.\n\nMr. Speaker, by celebrating the Fiftieth Anniversary of the Wood  County Committee on Aging, the county can recognize the outstanding…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695853/recognizing-the-semicentennial-of-the-wood-county-committee-on-aging"}]