[{"senator": "Dave Min", "party": "Democrat", "sentence": "…thing: Workforce shortages are slowing down projects, driving  up costs, and ultimately are a major contributor to higher prices for  working families.\n\nThe data is clear: Nearly 10,000 electricians retire each year, while  only about 7,000 new entrants come in each year, according to the  Bureau of Labor Statistics.\n\nGoldman Sachs has estimated the…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697895/electric-supply-chain-act"}, {"senator": "George Whitesides", "party": "Democrat", "sentence": "…protection, even as the science made clear that wildfire smoke causes  lasting lung damage and is linked to more than a dozen cancers.\n\nFirefighters' life expectancy is now nearly 10 years shorter than the  average American. That is unacceptable.\n\nThe Healthy Lungs for Heroes Act changes that. It directs our Federal  land agencies to develop and require…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698661/firefighter-protections"}, {"senator": "Lori Trahan", "party": "Democrat", "sentence": "…our children.\n\nThis month marks an opportunity to raise awareness for childhood  cancer and support research for new treatment and therapy avenues. Just  this year alone, nearly 10,000 children will be diagnosed with  pediatric cancer. This is an issue that could not be more important and  pressing.\n\nThe Give Kids a Chance Act removes many of the hurdles…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695859/recognizing-september-as-childhood-cancer-awareness-month"}, {"senator": "Jimmy Panetta", "party": "Democrat", "sentence": "…than 43 percent of people with employer-based coverage had an  HDHP. Moreover, 56 percent of employers offer an HDHP. However, nearly  59 percent of Americans--that is nearly 6 in 10 people--lack $1,000 in  savings to handle an emergency expense.\n\nThat is exactly why expanding HDHP coverage to offer critical care  for some of our most medically vulnerable…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688477/chronic-disease-flexible-coverage-act"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…for the shortest time in jail--which can  still mean weeks or months or even years--is the norm.\n\nI think of Mohammed Ibrahim, a Palestinian American who was detained  for nearly 10 months after being arrested at the age of 15 in his home  at 3 in the morning by heavily armed Israeli soldiers. He described  being bound and beaten while being transported…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697313/palestine"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…capital out of U.S.  markets, and that is not just theoretical.\n\nIn Oklahoma, public pension officials estimated that complying with a  similar blacklist policy could cost them nearly $10 million. In  Arkansas, the State retirement system estimated comparable restrictions  could reduce returns by $30 million to $40 million a year. In Indiana,  an analysis…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699153/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…the U.S.  Department of Agriculture. They have frozen programs that purchase  products from Delaware farmers.\n\nAs I stand here today, the Federal Government is withholding nearly  $10 million owed to Delaware farmers to improve their infrastructure  and lower their energy bills.\n\nAt the heart of Delaware's agriculture industry are chickens. We have  roughly…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688191/protecting-agriculture-the-backbone-of-delawares-economy"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…fiscal year under his tenure. Can you imagine that, Mr. Speaker? The  head of an organization was patting themselves on the back for making  their organization so toxic that nearly 10 percent of their workforce  quits? This is something to be proud of? It is unconscionable. What is  worse are the absurd assertions that veterans won't be negatively  affected…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693968/protecting-regular-order-for-veterans-act-of-2025"}, {"senator": "Grace Meng", "party": "Democrat", "sentence": "…them most.\n\nThis big, bad billionaire bill would impact nearly 200,000 Asian- American constituents, many of them senior citizens in my district  alone, not to mention the nearly 1 in 10 Asian Americans across our  country that rely on food assistance through SNAP and the 1 in 6 NHPIs  living in poverty.\n\nMeanwhile, the top 20 percent of income earners…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691503/gop-tax-scam-hurts-women-and-families"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…them  more money on everything, a lot more: a lot more for food, for gas, for  building materials, for cars, for trucks, for everything.\n\nToday, after the market bled off nearly $10 trillion in lost U.S.  wealth last week, the President adjusted some tariffs, but nothing he  did is reshoring American reinvestment here in our country. Our Nation  imports…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689822/tariffs-are-taxes"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…signal that says go to the doctor.  Something is out of balance.\n\nMental health is the very same way.\n\nAccording to the Anxiety and Depression Association of America,  nearly 1 in 10 men experience depression or anxiety, but less than one- half will receive treatment, and more than four times as many men than  women will die by suicide every year.…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692206/raising-awareness-about-mens-health"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…any. When you don't  send an amendment deadline, everyone knows you are doing a closed rule.\n\nMy Republican colleagues have been complicit in these 80 closed  rules. Nearly 9 out of 10 times, the majority party has not been  allowed to bring amendments to the floor. They are getting blocked by  their own leadership time and time again. How does that…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696904/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision-providing-for-consideration-of-h-con-res-denouncing-the-horrors-of-socialism-providing-for-consideration-of-hr-unlocking-our-domestic-lng-potential-act-of-providing-for-consideration-of-hr-researching-efficient-federal-improvements-for-necessary-energy-refining-act-providing-for-consideration-of-hr-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-providing-for-consideration-of-hr-district-of-columbia-cash-bail-reform-act-of-and-for-other-purposes"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…demands of today's small businesses. Recent       national polling found that 78% of small business owners are       concerned about cuts to the SBA and its programs. Nearly 8 in       10 small business owners report having used SBA programs for       their business.\n\nAlso up for consideration is H.R. 2966, the American       Entrepreneurs First Act,…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692125/american-entrepreneurs-first-act-of-2025"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…daily activities like bathing, dressing, and  eating.\n\nTheir work is both physically and emotionally demanding. It is  essential to the health, safety, and independence of nearly 10 million  older adults and people with disabilities who rely on these services to  remain in their homes and communities.\n\nFor some, it is the care they receive from these…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695577/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "…among  the best in the country. The college generates more than $276 million  annually in economic impact and supports more than 4,000 jobs across  its region, while enrolling nearly 10,000 students each year in credit,  workforce, adult education, and dual enrollment programs.\n\nDr. Karolewics herself has been recognized nationally and statewide  for her…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695474/recognizing-wallace-state-community-college-and-its-president-dr-vicki-p-karolewics"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…ensure we can  maintain today's nuclear stockpile, prepare for future needs, and  modernize aging infrastructure that underpins our nuclear deterrent.\n\nOur bill also delivers a nearly 10 percent increase for naval  reactors, advancing Columbia-class submarine reactor development, and  supporting the safe handling of naval spent fuel.\n\nThis package is not…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698749/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…that year.\n\nWomen and girls have been misled into believing that taking  mifepristone to induce an abortion is as safe as using Tylenol.  However, new data indicates that nearly 1 in 10 women taking the  chemical abortion pill experience serious complications, such as  sepsis, infection, hemorrhage, or another serious adverse event within  45 days of taking…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692892/dobbs-v-jackson-anniversary"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…American to realize the opportunities that freedom  provides.\n\nWhen Bob's father died, he was forced to drop out of high school to  work odd jobs to support their family. For nearly 10 years, he worked  as a crab cracker at Alioto's restaurant on Fisherman's Wharf in San  Francisco.\n\nSearching for a better life, he came to Modesto where his outgoing  personality…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690017/mourning-the-passing-of-bob-phelan"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…changes rather than bold  scientific advancements. Lowering the bar will hurt patients most of  all, delaying or discouraging the development of a first-ever therapy  for the nearly 10,000 rare diseases that still lack an FDA-approved  treatment.\n\nAs a physician, I know that true medical breakthroughs require bold  investment, sustained commitment, and…", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691696/support-for-the-orphan-drug-act"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…Speaker, I am honored to present Nola Jane Saldana  of Waco, Texas, with a Congressional Veteran Commendation. Nola Saldana  is a proud United States Navy veteran, who served nearly 10 years and  continues to dedicate her life to supporting veterans and her  community. A full-blooded Maidu Indian raised in poverty on a  reservation in Susanville, California,…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696264/recognizing-nola-jane-saldana-with-a-congressional-veteran-commendation"}, {"senator": "French Hill", "party": "Republican", "sentence": "…has origins in my district of central  Arkansas and stretches some 220 miles west into eastern Oklahoma  through my good friend, Mr. Westerman's district.\n\nIt encompasses nearly 10,000 acres of rugged terrain, and the most  treasured views in the Ouachita region are in Flatside Wilderness. For  those visitors that Congressman Westerman referenced, the…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691095/flatside-wilderness-additions-act"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…by foreign labor  overseas. The Americans who once held on were now being replaced by  foreign labor here at home. Their children will graduate into a  workforce where nearly 1 in 10 workers doesn't even speak their own  language.\n\nThe twin horsemen of globalism--unprotected trade and unprotected  borders--have been a catastrophe for our civilization.…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690533/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…trajectory in delivering upon the American people's mandate from  November. Just a few short weeks ago, we passed the One Big Beautiful  Bill Act.\n\nThis week, we are taking up a nearly $10-billion rescissions package,  and soon we will be moving into the appropriations process.\n\nDiscretionary waste is about to be put through the congressional  shredder.\n\nMr.…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692391/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "John Joyce", "party": "Republican", "sentence": "Mr. JOYCE of Pennsylvania. Mr. Speaker, this week, the House will  vote on the first DOGE rescissions package that will claw back nearly  $10 billion in wasteful spending. The American public expects their  government to be good stewards of taxpayer dollars and to use their  taxpayer dollars for programs that…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692145/doge-rescissions-package"}, {"senator": "Patrick Harrigan", "party": "Republican", "sentence": "…we still remember who we work for here in  Washington.\n\nWe are cutting $2.5 million for electric vehicles in Vietnam, $47,000  for transgender surgeries in Colombia, and nearly $10 billion for NPR,  PBS, and other bloated liberal pet projects that have no place in a  responsible budget.\n\nWashington acts like taxpayer dollars are theirs to waste, but…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692549/rescissions-act-of-2025"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…Alumni Club.\n\nI know his parents, Scott and Alicia, are so proud of all he has  accomplished. I wish Mitchell the best of luck in this next chapter,  and I thank him for his nearly 10 years of dedicated service to  Louisiana's 1st Congressional District.\n\nMr. Speaker, I ask my colleagues to join me in commending Mitchell  Shea and in wishing him continued…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697133/recognizing-mitchell-shea"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…Mid-Atlantic Regional Spaceport, where Virginia is playing a vital role  in America's return to the Moon and preparation for Mars. The One Big  Beautiful Bill Act provides nearly $10 billion for NASA, supporting  Artemis missions, the International Space Station, and new launch  infrastructure. These investments will directly benefit Wallops,  strengthen…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694795/promises-made-promises-kept"}, {"senator": "Mario Diaz-Balart", "party": "Republican", "sentence": "…Nation's foreign  policy in a historic way in so many different aspects. First and  foremost, the bill restores fiscal sanity by reducing spending by 16  percent, which is nearly a $10 billion cut, in recognition of the  President's and the Secretary of State's effort to make the Department  of State, frankly, more efficient, streamlined, and responsive…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699051/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}]