[{"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…camp that Donald Trump, Ron DeSantis, and his administration have  propped up in the middle of an abandoned airfield deep in the Florida  Everglades.\n\nIt is a place where nearly 1,000 humans are being forced to live in a  tent city in the middle of the hot Florida summer, hot sun, where folks  are not getting enough food. Detainees are exposed to the…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693654/internment-camp-in-the-florida-everglades"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…percent of our Federal workforce--or  more than 640,000 veterans in the civil service--and I rise today to  express my absolute outrage over the indiscriminate firings of nearly  6,000 of these veterans--from the VA to the Defense Department to the  Department of the Treasury.\n\nAt the VA, where veterans' input is particularly critical to shaping  policies…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688440/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…and you cannot drive up prices, eliminate  jobs, and put in place a national sales tax that experts now predict  will altogether--the tariff tax--cost the average family nearly $2,000  per year.\n\nAnd they are seeing it every day in their grocery bills. They are  seeing it when they want to go out and buy tools. They see it when they  are going out to…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696446/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…that making life better for my constituents  and for New Mexicans?\n\nWell, it is not going to.\n\nIn fact, this Republican budget is going to raise healthcare premiums  by nearly $1,000 a year for 20,000 people in my district. It could  force a 60-year-old couple to pay over $16,000 more annually for  coverage.\n\nNow, in my district and in my State, we…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688084/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "…all of our  constituents were receiving notices of premium increases. A constituent  of mine, a lifelong educator, has been told that her premiums will jump  from $383 to nearly $1,000.\n\nMeanwhile, Trump and Republicans can find money for a fancy ballroom.  They can give tax breaks to billionaires. They even included millions  of dollars in cash payments…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696719/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…up in a bow for  Christmas.\n\nTo Andrew and his family down in Austin, this phony bill means zero  relief on premiums, premiums that are going to spike for his family by  nearly $2,000 per month. It means nothing for Russell, a prostate  cancer survivor just 2 years away from Medicare, wondering how he will  afford the screenings and any necessary care.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698310/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Andrea Salinas", "party": "Democrat", "sentence": "Ms. SALINAS. Madam Speaker, I rise to sound the alarm about the Trump  administration's reported plans to fire nearly 7,000 workers in the  U.S. Forest Service.\n\nThese illegal firings could have devastating consequences for Oregon.\n\nWildfire season is just around the corner, and there is concern…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690926/illegal-firings-could-devastate-oregon"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…intensive training atop the Colorado  Rockies, they climbed Italy's Riva Ridge and defeated the Nazi troops  in a surprise attack.\n\nThat was not without paying a heavy price. Nearly 1,000 soldiers from  the 10th Mountain Division were killed, and some 4,000 were wounded in  4 months of fighting the Germans. They were successful, and the Germans  surrendered.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699624/9999"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…canceled hundreds of NIH-supported grants and  clinical trials and placed gag orders on experts, eliminated the  programs that attract young people to the field, and fired nearly 2,000  NIH scientists and healthcare professionals, 2,000 researchers. Is one  of those researchers working on a cure for a disease that will affect  someone in your family? It…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690656/national-institutes-of-health"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…insurance through  the Massachusetts Health Connector. Right now, for a family of five,  they pay just over $1,000 a month. If these ACA tax credits expire,  they will pay nearly $2,000 a month for an even worse plan, and that  doesn't even include their daughter, who has aged out of the plan, is  underpaid in her job, and whose premiums they will have…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698836/aca-tax-credits-extension"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…people panicked about how they  were going to afford their insurance premiums starting January 1.  Families are going to see their bills go up and up, in some cases by  nearly $1,000 more a month.\n\nMaybe that doesn't sound like a lot of money to Republicans because  these guys might not get how much that means to regular people. I know  how out of touch…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697303/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…inflation. Over the same period,  SSA is serving 17 million more Social Security beneficiaries, a 28- percent increase. Moreover, since February 2025, SSA reduced staff by  nearly 6,000 employees through encouraging retirements and voluntary  resignations, including 2,000 from frontline positions. In August 2025,  SSA diverted 2,000 field office staff away…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697776/claiming-age-clarity-act"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…that says:  If you push the button, these weapons will detonate at their designed  yields.\n\nThe reason they are confident to do that is we have a lot of test  data from the nearly 1,000 tests--many of them took place in Nevada-- and the extensive data we have and the fact that we can then put that  data back into simulation programs to get the right answer.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699037/expiration-of-new-start"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…the  Hudson Valley, in Kingston, NY, who relies on the ACA tax credits to  pay for health insurance. As his tax credits expire, Jeremy is going to  pay more than double. Nearly $1,000 every single month is what he is  going to have to pay, and that is not an expense he can deal with or  that people like him can deal with. He makes a good salary, and…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698199/new-york"}, {"senator": "Raja Krishnamoorthi", "party": "Democrat", "sentence": "…business in the U.S.\n\nEstablished in 1886, NRCA is one of the Nation's oldest trade  associations and the voice of professional roofing contractors  worldwide. NRCA has nearly 4,000 roofing company members representing  the entire roofing supply chain. Using its network of roofing  contractors and industry-related members, NRCA is responsible for the…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691476/recognizing-national-roofing-contractors-association-and-national-roofing-week"}, {"senator": "Maria Salazar", "party": "Republican", "sentence": "…Hospital's LifeFlight Critical Care Transport Program, which  includes six ambulances, two helicopters, and fixed-wing jets equipped  for pediatric and neonatal patients, saves nearly 4,000 infants and  children annually across Florida, the Caribbean, and Central and South  America.\n\nFrom Miami to the Panhandle, from the Panhandle to Central and South  America,…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696282/congratulating-nicklaus-childrens-hospital-on-its-75th-anniversary"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…bill that fixes a broken system and restores  accountability within the Federal Protective Service.\n\nThe Federal Protective Service, or FPS, is responsible for protecting  nearly 9,000 Federal facilities nationwide. In fiscal year 2024, FPS  operated with a $2.2 billion budget and oversaw more than 15,000  contract protective security officers.\n\nWith that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695060/personnel-oversight-and-shift-tracking-act-of-2025"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…Parliamentarian didn't understand is the  history and mechanisms of the National Firearms Act. Congress enacted  the NFA in 1934, imposing an excise tax of $200, equivalent to nearly  $5,000 today, on the manufacture and transfer of certain firearms.\n\nCongress enacted the NFA pursuant to its taxing power under Article  I, Section 8 of the Constitution. The…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697383/restoring-second-amendment-rights"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…The legislation  will strengthen the thresholds of reporting foreign gifts and  contracts.\n\nAccording to The Wall Street Journal, in the last 12 years, U.S.  schools had nearly 3,000 contracts with China valued at no less than  $2.32 billion. That raises an important question: Why would a country  that certainly doesn't have the best interests of American…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689032/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…110 years, farmers have met each January at the Farm Show in  Harrisburg, Pennsylvania. The event is the largest indoor agricultural  exposition in the country, featuring nearly 5,000 animals, more than  250 commercial exhibits, and welcomes more than 500,000 visitors each  year.\n\nThe Farm Show is a great event for all ages and features many  educational…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699123/pennsylvania-farm-show-recap"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…shared  American value that every life is worth saving and every individual  struggling with addiction deserves a path to recovery.\n\nAccording to data collected in 2023, nearly 5,000 Pennsylvanians lost  their lives due to fatal drug overdoses. That means that across the  Commonwealth of Pennsylvania, we lost 14 lives each day to addiction.\n\nUnder the…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699740/confronting-the-disease-of-addiction"}, {"senator": "Dave Joyce", "party": "Republican", "sentence": "…dangerous narcotics across our southern border requires  strong, decisive action from our Congress.\n\nAccording to the DEA, there were more than 36 million fentanyl pills  and nearly 4,000 pounds of fentanyl powder seized in 2025. This  represents over 157 million deadly doses.\n\nAs a former prosecutor and a co-chair of the Addiction, Treatment,  and Recovery…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692347/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…our ally and the Jewish  community.\n\nOn October 7, 2022, the world was shocked at the atrocities carried  out by Hamas terrorists against Israel and the Jewish community. Nearly  3,000 Hamas fighters crossed into Israel by land, air, and sea, killing  around 1,200 people and taking more than 250 Israeli and foreign  hostages.\n\nOctober 7 will forever be…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688138/promoting-stability-and-prosperity"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…terrorists flew planes into the Twin Towers on September  11, 2001, killing thousands of innocent Americans. You know, this was a  slap in the face of the families of the nearly 3,000 victims who were  murdered and the thousands injured on that very, very tragic day.\n\nI never thought I would see something like this in my lifetime. But  for years, the…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698981/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…and  delivered more than $6.1 million in Federal funding for nine excellent  community projects.\n\nMy office responded to more than 81,000 constituent letters, answered  nearly 8,000 phone calls, and closed nearly 1,600 constituent cases,  helping folks navigate the Federal agencies and Federal bureaucracy.\n\nThe most rewarding part of being a Representative…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698682/recognizing-the-honorable-steny-hoyer"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "…responsible population  growth, economic development, and long-term sustainability in one of  the most arid areas of our Nation. Today, the Agency's service area  spans nearly 5,000 square miles and provides water resource management  for nearly half a million residents.\n\nOver the past 65 years, the Mojave Water Agency has distinguished  itself through…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694201/recognizing-the-mojave-water-agency-on-the-occasion-of-its-65th-anniversary"}, {"senator": "Max Miller", "party": "Republican", "sentence": "…is a  partnership with six public school districts in northeast Ohio and  offers advanced career and technical education for approximately 1,200  high school students and nearly 3,000 adult students.\n\nAdditionally, the center offers secondary career development  resources and student internship opportunities, preparing students to  enter or to reenter…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689426/recognizing-medina-county-career-center"}, {"senator": "Nicholas LaLota", "party": "Republican", "sentence": "Mr. LaLOTA. Mr. Speaker, I thank the chairman for yielding.\n\nMr. Speaker, a weekend or two ago in Suffolk County, I stood with  nearly 1,000 Long Islanders at a Vietnam war Veterans Day ceremony. The  theme of the day was simple but powerful: Welcome home.\n\nWelcome home after serving in a war that was unpopular…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689626/vietnam-veterans-liver-fluke-cancer-study-act"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…delivered $240 million in  redevelopment that transformed outdated housing into modern  neighborhoods where military families can thrive.\n\nThe results speak for themselves. Nearly 2,000 obsolete units were  replaced, and hundreds more were renovated. New homes were built to  meet the needs of today's airmen and their families.\n\nThe community now known as…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696802/recognizing-lisa-yanney-roskens"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…groups that operate freely throughout the country have launched  countless attacks on our ally Israel.\n\nIn the past year alone, Hezbollah has indiscriminately launched  nearly 2,000 missiles into Israeli territory, attempting to replicate  the horrific atrocities that occurred on October 7, yet the Lebanese  military has consistently failed to take…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693678/department-of-defense-appropriations-act-2026"}]