[{"senator": "Alex Padilla", "party": "Democrat", "sentence": "…making their archives easily  accessible to the public.\n\nCoordinating with governments, nonprofits, institutions, and  individuals to grow their digital collection, for nearly three decades,  the Internet Archive has worked to preserve everything from academic  research to personal blogs, local news stories to international  breaking news, and troves of…", "date": "2025-10-28", "source_url": "https://justfacts.votesmart.org/public-statement/1696412/recognizing-the-internet-archives-one-trillionth-web-page"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…greenhouse gases are pollutants.  After losing in the Supreme Court in 2006, the fossil fuel industry has  been out to overturn this so-called endangerment finding for nearly two  decades. Repealing it would degrade the EPA's authority to regulate  greenhouse gas emissions, meaning it could no longer act to curb  emissions from vehicle exhaust, factories,…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689115/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…early  in his life. In July 1988, he answered the call to serve and reported  to Marine Corps Recruit Depot Parris Island. There, he began a journey  that would span nearly four decades and see him rise to the highest  enlisted ranks in the Marine Corps and in our Armed Forces.\n\nAfter completing infantry school and earning his military  occupational…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694958/recognizing-the-retirement-of-sergeant-major-troy-e-black"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…capturing more than 169,000  speeches. These recordings preserve the voices of 359 different  Senators, including 185 Republicans, 167 Democrats, and 7 Independents  across nearly four decades of service.\n\nThese hours include memorable moments like Senator Ted Kennedy's  speech in July 1987; then-Senate Majority Leader Harry Reid and then- Senate Minority…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691704/senate-resolution-259-recognizing-june-as-the-39th-anniversary-of-c-span-chronicling-democracy-in-the-senate"}, {"senator": "Marilyn Strickland", "party": "Democrat", "sentence": "…their  loved ones and do so with dignity.\n\nThe brave men and women who sacrifice their lives deserve peace of  mind, knowing their families will be taken care of. For nearly two  decades, the maximum coverage of the Servicemembers' Group Life  Insurance and Veterans' Group Life Insurance programs has been  stagnant, even as the costs of housing, goods,…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689627/fairness-for-servicemembers-and-their-families-act-of-2025"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…of its children.\n\nMr. Speaker, I rise today to highlight the extraordinary work of an  organization from Los Angeles that has lessons for every community in  America.\n\nNearly two decades ago, then-Mayor Antonio Villaraigosa partnered  with my good friends, philanthropists Melanie and Richard Lundquist, to  launch the Partnership for Los Angeles Schools.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695654/partnership-for-la-schools"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…government career as a graduate student at  The George Washington University in Washington, D.C., when she joined  the U.S. Department of Veterans Affairs. Over the course of nearly four  decades, she served in a variety of roles within the VA, including  Public Affairs Officer, Coach, and member of the Public Contact Team.  Her career took her to communities…", "date": "2026-02-17", "source_url": "https://justfacts.votesmart.org/public-statement/1700085/recognizing-rebecca-sawyer-smith"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "…students, new attorneys  and law clerks, taught as Jurist in Residence at Seattle University  School of Law, volunteered for the Seattle Girls' School Mock Trials  for nearly two decades, and co-chaired the Washington State Bar  Association/University of Washington Law School Leadership Institute.  Her commitment to fairness, diverse perspectives, and…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697901/recognizing-the-contributions-of-mary-yu"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…Stephens\n\nMs. McBRIDE. Mr. Speaker, I rise today to congratulate Robbie  Stephens on becoming the new fire chief of the Lewes Fire Department.\n\nChief Stephens brings nearly two decades of experience to this role,  having served as lieutenant, captain, training officer, assistant  chief, and deputy chief. He is also a firefighter with Wilmington's  Squad…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695077/recognizing-trivits-family"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…the dinners Mrs. Freida helped prepare.\n\nIndeed, Mrs. Freida lived a life of service. As an Army & Air Force  Exchange Services Manager at Maxwell Air Force Base for nearly two  decades, she helped lift up countless servicemembers and military  families. From singing in the First Baptist Church's Choir to  overseeing its Meals on Wheels program, Mrs.…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693379/mourning-the-loss-of-mrs-freida-b-dority"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…Resource Center, the Community  Foundation of the Fox River Valley, and the Batavia Community Chest.  Notably, his tenure with the Rotary Club of Batavia has spanned nearly  four decades and includes service as club president, recognition as  Rotarian of the Year, and multiple Paul Harris Fellow honors.\n\nBeyond formal roles, Bob embodies the essence…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690141/recognizing-robert-bob-p-hubbard-as-batavias-2024-citizen-of-the-year"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…permitting process for  that transmission line and that generation started over 17 years ago,  and the project is being energized, as we speak. Think about that. It  took nearly two decades to get the permits needed to build the project.  That is 17 years of redtape. That is 17 years without the jobs this  could create; 17 years of lost income, lost local…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698581/permitting-reform"}, {"senator": "Wesley Bell", "party": "Democrat", "sentence": "Mr. BELL. Mr. Speaker, I rise today not just as a Member of Congress  but as the son of a police officer and as someone who spent nearly two  decades working in the justice system as a public defender, defense  attorney, judge, and as a prosecutor. I know what it means to uphold  the law, and I know what it looks…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689721/no-rogue-rulings-act-of-2025"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "Mrs. RAMIREZ. Mr. Speaker, I rise today to celebrate longtime Chicago  leader, organizer, and my dear friend, Amisha Patel, for her nearly  three decades of civic engagement and community organizing.\n\nFrom leading environmental justice efforts at just 19 years of age to  organizing Chicago care workers with SEIU Local…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690325/national-fair-housing-month-amisha-patel"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "Ms. VELAZQUEZ. Mr. Speaker, I rise today to recognize Theodore M.  Renz, who is retiring after nearly four decades of exceptional public  service as the Executive Director of the Myrtle Avenue Business  Improvement District (BID) in Ridgewood, Queens. Throughout his  distinguished…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693397/recognizing-theodore-m-renz"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…a 2023 Bellefonte High School graduate.\n\nBailey recently received an American degree from the Future Farmers  of America. Bailey is the first Bellefonte FFA member in nearly two  decades to receive an American degree. She has been an active FFA  member since her freshman year.\n\nThe American degree is the highest FFA honor and is given to members  for…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699980/recognizing-bailey-little"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…of  our youngest learners.\n\nAt a 2023 Subcommittee on Early Childhood, Elementary, and Secondary  Education hearing, Defending Education highlighted a report exposing  nearly two decades of CCP efforts to influence thousands of children.  At one point, more than 500 schools hosted Confucius classrooms, many  located on U.S. military bases. That is no…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697532/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…increase its military presence across the Taiwan  Strait.\n\nThe U.S. and Taiwan have maintained a firm stance against any  forceful efforts to change Taiwan's status for nearly five decades.  That posture is as important now as ever.\n\nA component of the Taiwan Relations Act mandates that the President  inform Congress when China makes any attempt to threaten…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693876/taiwan-conflict-deterrence-act-of-2025"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…purpose envisioned at the  time of the conveyance.\n\nThis is a simple, bipartisan bill that cuts red tape and ensures the  University of Utah can continue building on nearly six decades of  scientific discovery, economic growth, and global impact. I commend  Representative Moore for leading this effort in the House and the  chairman of the Senate Energy…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698135/university-of-utah-research-park-act"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "Mr. FITZPATRICK. Mr. Speaker, I rise today to recognize a remarkable  individual from my district, Mr Frank C. Parker, IV. For nearly three  decades, Mr. Parker has nurtured and inspired the musical abilities of  students in the Quakertown Community School District.\n\nMr. Parker attended Moravian College, where he…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694748/recognizing-mr-frank-c-parker-iv-quakertown-community-school-district-director-of-bands-for-27-years-of-service"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…SMUCKER. Mr. Speaker, I am pleased to honor and congratulate Mr.  Leon Ressler on his retirement after 37 years with Penn State Extension  in Lancaster County.\n\nAcross nearly four decades, Leon Ressler has served Penn State  Extension, a Pennsylvania-wide educational organization and network  focusing on science, agriculture, and the environment, in many…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692202/congratulating-leon-ressler-on-his-retirement"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…exceptional  dedication and service of Sheriff Charles Foster of Wythe County,  Virginia, who retired on August 1 after a 38-year career in law  enforcement.\n\nThrough nearly four decades, Sheriff Foster has served Wythe County  Sheriff's Office with the integrity and devotion of a true public  servant.\n\nHired at the age of 18 as a dispatcher, Sheriff…", "date": "2025-08-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694755/recognizing-the-dedicated-service-and-leadership-of-sheriff-charles-foster-of-wythe-county-virginia"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…community.  George and Joanna Katergaris along with their children, Mina and Mike,  are the longtime owners of the Wagon Wheel Restaurant in Fort Lawn,  South Carolina.\n\nFor nearly five decades, the Wagon Wheel has been a cornerstone of  the community and a gathering place for generations of families all  across Chester County.\n\nGeorge and Joanna came to the…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696937/recognizing-the-katergaris-family"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…11th  Congressional District.\n\nJoanne has been a valued member of my staff since 2017, and before  that, she served for 20 years working for Congressman Joe Pitts. For  nearly three  decades, Joanne has been a steady, compassionate presence for  constituents across the 11th District who needed help navigating  Washington's vast alphabet soup of agencies…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698569/recognizing-and-thanking-joanne-horn"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…Eysink, who retired after 29 years of  service as the executive director of the Marion County Development  Commission.\n\nCarla was the very first to hold this role. For nearly three decades,  she worked tirelessly to strengthen economic growth, support local  businesses, and champion the people of Marion County. From launching  the Business Retention and…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692297/recognizing-davenport-assumption-girls-soccer-team"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…Mr. Speaker, I rise today to recognize the 46th  anniversary of C-SPAN's coverage of the U.S. House of Representatives,  a milestone in government transparency.\n\nFor nearly five decades, since March of 1979, C-SPAN has provided the  American people with unfiltered gavel-to-gavel coverage of the debates  and the decisions that shape our Nation. It is…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689056/recognizing-the-46th-anniversary-of-c-span"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…in 2009. Known for his  plainspoken demeanor and deep commitment to his constituents,  Congressman Pascrell served our Nation in the U.S. Army and in this  body for nearly three decades, until his passing last August.\n\nOverlook Park is a 2.5-acre area providing panoramic views of the  falls and the gateway to the larger historical park.\n\nThe Great Falls…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691128/redesignation-of-paterson-great-falls-nhp-facilities"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…health coverage has  dropped from 39 to 30 percent.\n\nSmall businesses have ranked the cost of health insurance as their  number one problem for 32 straight years. For nearly four decades, it  has remained the top concern. In fact, 98 percent of small businesses  report that healthcare costs will become unsustainable in the next 5 to  10 years, threatening…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698379/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Craig Goldman", "party": "Republican", "sentence": "…his young daughters proudly shared, saying, ``Dad drives the big truck  downtown.''\n\nIn addition to his many years with the Fort Worth Fire Department, he  has spent nearly two decades instructing classes at the Fire Academy at  Tarrant County College. As an instructor for both new recruits and  continuing certification courses for commissioned firefighters,…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689725/9999"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…commitment to public service and his expertise in the  legislative drafting process, it is his unparalleled sense of humor  that truly sets him apart. Over the course of his nearly four decades  of service, the House saw a lot of change. Noah's ability to constantly  adapt and consistently excel--all while maintaining his sense of  humor--is a bold testament…", "date": "2025-10-28", "source_url": "https://justfacts.votesmart.org/public-statement/1696434/thanking-noah-wofsy-for-his-service-to-the-us-house-of-representatives"}]