[{"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…should be standing together to talk about how we are going to lift  the least among us and make it easier for them. That is what we should  be talking about here tonight.\n\nNearly 20 million people are at risk of losing coverage and that  should be our priority. Chuy, myself, and Luis Correa, we call  ourselves the three amigos because we have so much…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696778/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…Public Works Committees. Most of the time, I have focused on the  many red flags raised by outrageous behavior of top DOJ and EPA  officials in their attempts to claw back nearly $20 billion in grant  funds that were awarded in April 2024 and fully dispersed into private  bank accounts by August. After terrorizing grantees with false  allegations of fraud…", "date": "2025-07-09", "source_url": "https://justfacts.votesmart.org/public-statement/1693322/greenhouse-gas-reduction-fund"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…way, using American bombs that are used in ways that have grossly  disproportionate civilian casualties--over 64,000 people in Gaza  already killed, many women and children. Nearly 20,000 children are  dead. Some experts define these actions as ethnic cleansing. Others  suggest it is genocide. And that includes, by the way, many Israeli  experts, former…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695678/cloture-motion"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…public  broadcasting and educational programming for Americans all across our  beautiful country.\n\nNow, unfortunately, just yesterday in New Mexico, the Rio Ruidoso  rose to nearly 20 feet in a matter of minutes amid heavy rainfall,  sweeping away homes, debris, and people. The flooding claimed the lives  of three people already, including two children.…", "date": "2025-07-09", "source_url": "https://justfacts.votesmart.org/public-statement/1693299/9999"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…That is nearly three times the rate of inflation. Nearly a  quarter of that jump occurred just this year alone. These rising costs  are debilitating to the middle class. Nearly 1 in 20 households are in  severe utility debt.\n\nRoughly 4 million Americans are at risk of having their utility bills  sent to collections. It is an incredible number. They have…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697034/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Federal elections at various  points, including at the founding.\n\nThe Federal Government first prohibited noncitizens from voting in  Federal elections only 29 years ago. Today, nearly 20 cities allow  noncitizens to vote in local elections.\n\nAs the House has considered this bill, Republicans have repeatedly  said the franchise is a right of citizenship. If…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692314/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…pause  on some of the tariffs he announced last week.\n\nMr. Speaker, I don't know whether it is idiocy or incompetence, maybe  both, but that means that Trump tanked the market nearly 20 percent and  put the entire American economy on the line so that countries would  give him a phone call? Is that what this is all about? Give me a damned  break.\n\nRightwing…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689864/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "…Mississippians are at risk of losing Medicaid. Black families, already  facing chronic illness and poor healthcare access, will bear the full  burden. Head Start, which serves nearly 20,000 children in Mississippi,  is also in danger. Black children, who already face significant  barriers to education, will be hit the hardest. These cuts cause actual  harm…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690730/trumps-first-100-days"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…citizens were detained by immigration agents. That is what we know of.  Two dozen were held for more than a day without being able to call  their loved ones or a lawyer. Nearly 20 of those U.S. citizens detained  were children, and 2 of them had cancer. More than 50 American citizens  were detained by ICE on suspicion of being undocumented. And, guess…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699611/9999"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…struggling to get by, yet Donald Trump continues to  block SNAP benefits to 42 million struggling seniors, parents, and  veterans.\n\nHow anyone could swipe food from the plates of nearly 20 million  children like that is simply disgusting, but that same moral bankruptcy  is embedded in this bill.\n\nThis bill unleashes huge health insurance hikes on 203,000 people…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696741/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…linemen go out and fix those lines in the worst  weather. These specialized employees, frankly, are irreplaceable.\n\nThe decision by Elon Musk and by the President to fire nearly 20  percent of Bonneville workers in the name of efficiency and saving  taxpayer dollars is not just wrongheaded. It is reckless and  outrageous. It will make power less reliable…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688300/senseless-bonneville-power-administration-workforce-cuts"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…behalf of all that is going on across America  and around the world but especially what is impacting your  constituents.\n\nIf I am not mistaken, Senator Merkley, it has been nearly 20 hours  that you have been on the floor now, speaking to the American people.\n\nNow, I like you. I am proud to be a U.S. Senator. I know, the way you  speak about Oregon, I…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696347/trump-administration"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…law enforcement officers. It was a blatant and  disgusting disregard for the rule of law and for our fine men and women  in uniform.\n\nNext, during his first week, he fired nearly 20 inspectors general,  the independent watchdogs in the executive branch agencies. It is their  responsibility to ensure that those agencies follow the law.\n\nThen he went after…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690393/attacks-and-threats-on-democracy-and-rule-of-law"}, {"senator": "Valerie Foushee", "party": "Democrat", "sentence": "…University, Durham and Wake Technical Community  Colleges, and so many new up-and-coming industry leaders in STEM.\n\nHowever, in total, the Trump administration has canceled nearly $20  million in NSF research grants to North Carolina as a whole.\n\nTake, for instance, an NSF-funded grant that was recently canceled in  my district, North Carolina's Fourth,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691388/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "Mr. DURBIN. Mr. President, last week, the world witnessed an  unprovoked violation of NATO airspace by Russia. Nearly 20 Russian  drones entered Polish airspace, some traveling up to 300 miles in the  country. For nearly 6 hours, NATO aircraft sought out and destroyed  these Russian intruders.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695519/north-atlantic-treaty-organization"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…save your life or to take the  life of another person?\n\nI also met, by the way, with that police officer after that. He was  very emotional, and he told me that he had spent nearly 20 years  patrolling that community, 20 years sitting with young girls who had  been sexually assaulted as victims and with their families and helping  them through that, 20…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691164/events-this-week"}, {"senator": "John Carter", "party": "Republican", "sentence": "…fully funds all mandatory veteran benefits, including veteran  disability compensation programs, education benefits, and vocational  rehabilitation and employment training.\n\nNearly $20 billion is for the Department of Defense military  construction program. This amount funds nearly 300 projects at military  bases around the world.\n\nMr. CARTER of Texas.…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696733/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "Mr. BEGICH. Mr. Speaker, I rise today to discuss the many  opportunities of Alaska.\n\nAs America's most Western State, most Eastern State, and most  Northern State, Alaska is nearly 20 percent of the United States'  landmass. We have more than half of the United States coastline, and it  is estimated that we have more undiscovered estimated natural gas…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689194/work-highlights-of-western-caucus"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…produces 9.8 billion pounds of milk  annually from the nearly 465,000 dairy cows that reside in  Pennsylvania. The 4,850 dairy farms located throughout Pennsylvania  represent nearly 20 percent of our Nation's dairy farms. These farms  provide 52,000 jobs across the Commonwealth and bring in more than $10  billion in annual revenue.\n\nPennsylvania's dairy…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692145/doge-rescissions-package"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…insurance companies from taxpayers.\n\nDemocrats said healthcare would be affordable, yet since the  implementation of this bad idea, premiums are up 80 percent. At the  same time, nearly 20 percent of the individual market claims are denied  by insurance companies.\n\nIn 2024, 87 percent of the revenue made by insurance companies  selling ACA exchange claims came…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698796/breaking-the-gridlock-act"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…Southwest  Minnesota State University.\n\nUnder President Jayasuriya's leadership, SMSU thrived. In a period  where most Minnesota schools saw an enrollment drop, SMSU's rose by  nearly 20 percent.\n\nJust last year, the university recorded its highest enrollment in 14  years, and I am incredibly grateful for what he has done to improve  higher education in western…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690729/congratulations-to-president-kumara-jayasuriya-on-his-retirement"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…SBIC, program. This program has a  proven track record of turning promising small businesses into  household names, all without spending any taxpayer dollars.\n\nBy unleashing nearly $20 billion in private capital, this bipartisan  bill would expand opportunities for small manufacturers, rural  communities, and businesses critical to our national security.…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697259/investing-in-all-of-america-act-of-2025"}]