[{"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…reduce dangerous pollution and are essential to fighting  the climate crisis.\n\nMake no mistake: That would have immediate impact for our  communities, for every family living near a busy highway, every child  using an inhaler, and every senior who can't go outside on a high  pollution day. This is a direct attack on over 50 years of precedent  that recognizes…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690482/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…the person approaching  aggressively: I am not mad at you. And as she is saying these things-- it has been said that these were her last words--another officer comes  across, near her, in front of her, and this officer with a video camera  has his weapon just with him. This officer, as she turns away, shoots  her and then, as she is passing by, shoots…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699134/where-do-you-stand"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…where the  Park Police and the U.S. Secret Service Uniformed Division have full  local police powers. Many other federal law enforcement agencies also  have local police powers near their respective agency buildings in D.C.\n\nIn 2022, President Biden issued an executive order (E.O.) requiring  federal law enforcement agencies to use body cameras. President…", "date": "2025-08-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694762/introduction-of-the-federal-police-camera-and-accountability-act-of-2025"}, {"senator": "Laura Friedman", "party": "Democrat", "sentence": "…us today and for bringing to all  of us the issues that she is concerned with in her district and with  her family. I thank my colleague so much for joining us.\n\nWe are now near the end of this Special Order hour. I notice that my  Republican colleagues have hopefully been listening carefully and have  learned and would not continue to pursue policies…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688232/democratic-proposals"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…an Associate's Degree with an emphasis on  political science from Inver Hills Community College. She also  graduated as part of Phi Beta Kappa.\n\nLinda grew up on a small farm near Ruthton, Minnesota. As the  daughter of a tenant farmer, Linda learned early on the challenges and  instability farmers face in trying to earn a living. This informed her  work…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690447/congratulating-linda-larson-on-her-graduation-from-inver-hills-community-college"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…such  sharp emission reductions and cleaner air over the past one-half  century. To turn back now because of a CRA vote would be catastrophic,  especially for anyone who lives near an industrial facility.\n\nIt is not enough to gut the healthcare of millions of Americans.  Republicans first want to make sure the air we all breathe will do us  harm. S.J.…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691591/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…convinced the teens to send nude images of themselves and used them as  leverage for outrageous demands. Some perpetrators will demand  thousands of dollars--a request that is near impossible for the vast  majority of teens.\n\nTeenagers worry about so many things: what they are going to wear for  homecoming, why their acne cannot seem to get under control,…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699202/supporting-hr-the-combating-online-predators-act"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…above the law  or the Constitution.\n\nAcross this country, we are witnessing a dangerous pattern: Federal  law enforcement officers--specifically, ICE agents--operating with near  total impunity. We have seen constitutional rights violated, and we  have seen communities terrorized. We have seen American citizens harmed  and, tragically, killed without…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699645/upholding-rule-of-law-for-federal-officers"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…down, you would have to drive 100 miles  each way to get to another hospital. He talked about the emergency  surgery that they had performed once when there was an accident near  where his hospital was located. If they hadn't had the hospital there  and been able to provide the emergency treatment that they provided,  those people would have died. He…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690639/trumps-first-100-days"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…chemicals,  including those used in munitions and high-performance aviation fuel,  as the chair mentioned; to develop new medical cures and treatments and  produce them on-demand near the front lines; to engineer biological  sensors that can detect pathogens and chemical threats on the  battlefield in real time; and to better extract critical minerals from…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693686/department-of-defense-appropriations-act-2026"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…risk of catastrophic wildfires. It simply allows the  United States Forest Service or the Bureau of Land Management to  approve the removal of hazardous trees or vegetation near power lines  on Federal land without the need for a timber sale.\n\nUnfortunately, catastrophic wildfires continue to ravage the Western  United States, and we need commonsense…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691069/fire-safe-electrical-corridors-act-of-2025"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…worked with the U.S. Postal Service to create a D.C.  stamp, like the stamps for the states, and with the National Park  Service to add the D.C. flag alongside the state flags near Union  Station.\n\nI urge my colleagues to support this bill.", "date": "2025-06-13", "source_url": "https://justfacts.votesmart.org/public-statement/1692567/introduction-of-a-bill-to-permit-the-flag-of-the-united-states-to-be-flown-at-half-staff-in-the-event-of-the-death-of-a-mayor-of-the-district-of-columbia"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "…soon to  preventable deaths, and billions of dollars will be spent on health  expenses that could be avoided.\n\nCommunities like the ones I represent, low-income neighborhoods near  freeways, ports, and warehouses and working-class communities of color,  are already, indeed, breathing some of the dirtiest air in our country.\n\nThousands of people in California…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690469/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "Mr. KAINE. Madam President, I rise today to continue an important  Senate tradition. Each year, beginning in 1896, on a day near in time  to George Washington's birthday, a Senator, alternating between  parties, stands in the Senate to read Washington's Farewell Address,  presented 100 years earlier as…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700163/reading-of-washingtons-farewell-address"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…war, and the risk for war will only get worse the more a belligerent  Donald Trump acts off the coast of South America.\n\nJust this weekend, a U.S. Air Force tanker jet had a near-midair  collision with a JetBlue Airbus flying to the United States. The Air  Force tanker reportedly did not have its transponder on, of all things,  and flew right through…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698188/all-senators-briefing"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Sheriff's  Office, who recently saved a life through his quick thinking and  decisive actions.\n\nOn January 29, Deputy Thomas responded to a severe accident on U.S.  1/Georgia 4 near mile marker 8. A semitruck had collided with a Ford F- 150, leaving several people injured.\n\nUpon his arrival, Deputy Thomas found the semitruck driver severely  wounded, suffering…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688323/recognizing-hunter-thomas"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…16-year-olds to vote in Federal elections. Well over half the Democrats  voted in favor of 16-year-olds. Why would one want to do that?\n\nMr. Speaker, 16-year-olds have nowhere near the wisdom and experience  to make decisions as to who to vote for in elections. The only way you  would want to do it is if you want to manipulate these young minds in  the…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693920/comatose-press-corps"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…have seen in  4 years.\n\nRents are falling month after month, and shelter inflation is at a 4- year low. Gas prices are down to their lowest levels in 4 years. Stocks  were at near highs by the end of the year, with the S&P climbing by 17  percent in 2025.\n\nAll of this occurred before the gains of the Working Families Tax Cut  Act are realized, and we…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698637/providing-for-consideration-of-hr-saving-homeowners-from-overregulation-with-exceptional-rinsing-act-providing-for-consideration-of-hr-affordable-housing-over-mandating-efficiency-standards-act-and-providing-for-consideration-of-hr-commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…driving instability in our power grid.  Right now two-thirds of the country is at risk of not having enough  power to meet demand. That is not a few years from now. That is not a  near, long-term problem. That is today. Keep in mind, the power needed  for AI is also growing exponentially, further creating a more difficult  problem for us.\n\nThird, grid operators…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690785/big-beautiful-bill"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…So now, we are in a quandary. GAO has broken their  own legal counsel. We have an issue that will have well over $100  million worth of effect onto the country. It is now a near nationwide  mandate on electric vehicle sales across the country without ever  having a vote in Congress.\n\nAnd our Democratic colleague says you can't change it because we…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691634/congressional-review-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…moved this office from the  Secretary's office to the Veterans Benefits Administration Pension and  Fiduciary Service.\n\nThis decision to hide the Office of Survivors Assistance near the  bottom of the VA organizational chart reflected the Biden-Harris  administration's lack of commitment to the surviving loved ones of our  veterans.\n\nDuring the Biden-Harris…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689687/prioritizing-veterans-survivors-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…next-generation lightweight, laser-      based, infrared countermeasure system for rotary-wing, tilt-      rotor, and small fixed-wing aircraft across the DoD. CIRCM       provides near spherical coverage of the host platform to       defeat infrared-seeking threat missiles. CIRCM receives an       angular bearing hand-off from the Common Missile Warning…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695536/arms-sales-notification"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…with the likes of Secretary Wright and Secretary Burgum to streamline  permitting and unleash American energy.\n\nThis is why I am hopeful for projects like Black Butte Copper near  White Sulphur Springs that are committed to unlocking the Treasure  State's resources and driving rural economic development, all in a  responsible manner. I can't wait to…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689193/work-highlights-of-western-caucus"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…Chamber of  Commerce, 59 percent of small businesses in Montana have adopted AI  into their operations. While this figure may seem significant, it pales  in comparison to the near-universal adoption of AI that is seen with  Fortune 500 companies. That is why I am proud to co-lead H.R. 5784, the  AI-WISE Act, with my colleague, Representative Scholten.…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699207/artificial-intelligence-wisdom-for-innovative-small-enterprises-act"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…acquisitions of  agricultural businesses, including farmland involved in interstate  commerce. Since 2018, it has also been authorized to perform reviews of  land purchases near sensitive government sites. However, there is a  need to connect the Agriculture Department's expertise, including its  longstanding tracking of farmland purchases, with CFIUS'…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692799/agricultural-risk-review-act-of-2025"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…economic feasibility in  indirect ways, such as limiting the location of future drill pads and  other infrastructure. As an example, one stipulation prevented use of  areas near the shore, which would usually be used as a critical staging  area for loading and unloading barges. The stipulation preventing use  of that area requires staging to be pushed…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697739/9999"}, {"senator": "Randy Feenstra", "party": "Republican", "sentence": "…focus on the things  that truly matter most: spending time with his wife, Joanie, his  children, and his grandchildren, and devoting his talents to causes and  organizations near and dear to his heart.\n\nI thank Dan for his incredible contributions to Iowa and wish him and  his family the very best in his next chapter of life.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694878/congratulating-dan-houston"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…region into war.\n\nA day after the attack, Hezbollah began firing rockets,       drones, and anti-tank missiles at northern Israeli       communities, carrying out attacks on a near-daily basis in       solidarity with Hamas.\n\nThe rocket fire displaced some 60,000 residents of northern       Israel. In a bid to ensure their safe return, Israel stepped…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693678/department-of-defense-appropriations-act-2026"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…support both government and commercial launches, reinforcing our  Nation's ability to remain at the forefront of space innovation.\n\nAdditionally, Clear Space Force Station near Fairbanks is pivotal in  space situational awareness and missile defense. This facility is  crucial for tracking objects in orbit, ensuring that America maintains  a vigilant…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687923/space-dominance"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…St.  Marys River and has welcomed travelers and locals for more than a  century. For generations, this hotel has offered hospitality and a  sense of belonging to visitors from near and far. It has welcomed  notable guests over the decades and stood as a testament to seaside  Georgia's heritage.\n\nThe spirit of Riverview reflects the heart of St. Marys.…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698926/recognizing-riverview-hotels-110th-anniversary"}]