[{"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…session60/advance-version/a-hrc-60-crp-3.pdf.\n\nMr. Speaker, these new determinations only confirm what Palestinians,  eyewitnesses, journalists, and researchers have been saying for nearly  2 years: This is a genocide.\n\nJournalists have been murdered in unprecedented numbers in human  history, so there is no one left to show the world what is being done.  There is…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695713/genocide-in-gaza"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…Ben  proved there was no challenge he could not face.\n\nBen's unique abilities, professionalism, and dedication are apparent  to all who across paths him. Throughout the nearly four years Ben was  in my office he continued to exceed expectations in every role he was  assigned. As a part of my legislative staff, he continuously found new  ways to address…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692875/recognizing-departing-staff-member-benjamin-hong-starr"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…disapproval closed.\n\nNow they are trying to use the Congressional Review Act to get a do- over. The CRA wasn't created to overturn a public land order,  especially one that is nearly 3 years old. CRA resolutions are for  rules, which public land orders are not, and they are to be used within  60 days of the congressional notice, not 3 years later.\n\nLet me point…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699274/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…rest. This champion of healing and compassion  served as a medic for 25 years and had relocated to Kyiv when Russia  invaded his hometown in the southern Kherson region nearly 4 years ago.\n\nA nurse who worked with Smolyak said, before his funeral, that he was  very kind, always calm, and even-tempered. He saved so many people.\n\nMr. Speaker, we must do…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698971/russian-air-attack-on-kyiv"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "…citizenship and dedicated his life to serving the  community that welcomed him with open arms.\n\nHe began his law enforcement career with the Phoenix Police  Department, and nearly 4 years ago joined the Apache Junction Police  Department.\n\nA devoted father and grandfather, a respected colleague, an  upstanding American, he served Apache Junction with honor,…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692251/mourning-loss-of-officer-gabriel-facio"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…care or otherwise abused by a provider.\n\nIn instances where Justice Jackson has dissented from the majority,  she makes a clear case for why she reached that conclusion. Nearly 2  years ago, the Supreme Court ended the use of affirmative action in  college and university admissions. Justice Jackson issued a strong  compelling dissent, and she wrote:…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689666/justice-ketanji-brown-jackson"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize Morgan Jay  Buchanan, who recently retired after nearly ten years as President of  the International Brotherhood of Electrical Workers (IBEW), Local Union  68.\n\nPresident Buchanan dedicated his life to service. He served honorably  for…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695840/recognizing-morgan-jay-buchanan"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…This effort plays a vital role in addressing a stark and troubling  reality: Men have higher mortality rates in most of the leading causes  of death and have a lifespan nearly 6 years shorter than women.\n\nThese numbers should concern all of us because they affect all of us.  When men ignore their health or delay getting care, it doesn't happen  in isolation.…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692206/raising-awareness-about-mens-health"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…Iraq, I saw conflict up  close.\n\nBut I think it is important that we put this decision to go into  Venezuela in context. It is confusing. President Trump campaigned for  nearly 2 years on staying out of foreign wars. That was a huge  signature part of his campaign. So why do we find ourselves now ``in  charge,'' in his words, of Venezuela?\n\nLet's put…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698619/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…its minerals to China, where they are then  sold on the global market, likely the same fate for these minerals if  this mine is allowed to happen.\n\nAll of this is why, nearly 3 years ago, Secretary of the Interior Deb  Haaland protected the lands surrounding the Boundary Waters and its  headwaters from mining for 20 years through a public land order,…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699273/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "Mr. BEYER. Mr. Speaker, I rise today to congratulate Ambassador Dame  Karen Pierce, who served nearly 5 years as the British Ambassador to  the United States and was recently appointed as the United Kingdom's  Special Envoy to the Western Balkans.\n\nDuring Ambassador Pierce's time…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687959/congratulating-dame-karen-pierce"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…performance. Nothing could be further from the truth. I know       because one of them was my son.\n\nThis is as much his story as mine. He worked as a       contractor for nearly twenty years at NIH, helping to run a       lab at the National Cancer Institute. He devoted himself to       cancer research after watching my father die from lung and       brain…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694772/president-trumps-attack-on-the-federal-workforce"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…has been a consistent and dependable voice  as the host of the ``Austin Rhodes Show'' on WGAC, making it one of  Georgia's longest running weekday drive-time talk shows.\n\nNearly 3 years ago, I stood before this body to recognize Austin's  30th year anniversary in broadcasting, and it is my honor to stand here  once again to mark yet another achievement…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692847/congratulating-austin-rhodes"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…historians and most economists now say prolonged the  Depression for 10 years and caused the worst part of the Depression to  actually be in 1937--7 years after the tariff and nearly 8 years after  the stock market crash.\n\nDo you know what happened to the Republicans in 1932? The Democrats  won the Presidency, and they won the House. Do you know when  Republicans…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689478/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…received a graduate degree in mathematics.\n\nHe married Lena Lockamy, with whom he shared 48 wonderful years of  marriage before Lena passed into her eternal heavenly home nearly 5  years ago.\n\nRichard and Lena had one son, Marcus, who, in his own right, is now a  wonderful man.\n\nProfessionally, Richard has worked at some of the world's leading  companies,…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690037/happy-birthday-to-richard-lockamy"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…Captain Dave Carey for  his special keynote address. Capt. Carey is a distinguished American  patriot and aviator who served as a U.S. Navy pilot in Vietnam. After  enduring nearly six years as a prisoner of war, Capt. Carey served in  key leadership positions in the Navy and became a passionate  motivational speaker and author.\n\nI have requested the United…", "date": "2025-03-18", "source_url": "https://justfacts.votesmart.org/public-statement/1688919/recognizing-the-service-of-our-vietnam-veterans"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…such a difference, Mr. Speaker.\n\nThis bill now bears the name of one of those heroic kids, Mikaela  Naylon, who passed away earlier this year after battling cancer for  nearly 6 years. May her memory be eternal. She was 16 years old, and I  will never forget the videos.\n\nThroughout her battle, Mikaela was a fierce advocate of this bill to  create  hope…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697279/mikaela-naylon-give-kids-a-chance-act"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…communications  director since the beginning of my journey here to D.C.\n\nEmma has served in my office and the constituents of Utah's Fourth  Congressional District for nearly 5 years.  During this time, I have come to rely on her sharp instincts, her keen  attention to detail, and her unwavering commitment to keeping my  constituents back home informed…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698096/recognizing-emma-hall"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…committee efforts behind H.J. Res. 87, H.J. Res. 88,  and H.J. 89 which were signed into law in June of this year.\n\nAfter serving the U.S. House of Representatives for nearly four  years, Kaitlyn will depart the House Committee on Energy and Commerce  to take a position with the Senate Committee on Environment and Public  Works, handling a portfolio of…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697136/recognizing-kaitlyn-peterson"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "…and long-range  strike capabilities that we are sending to Kyiv. More than any other  capabilities, these will help show Putin his military aims are not  achievable.\n\nFor nearly 4 years, Ukrainians have demonstrated their resolve, as  they will continue to do. The West must continue to stand resolved with  them.", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699095/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…was about justice, their hearts would have broken for the  family of Laken Riley, a 22-year-old nursing student in Georgia who was  brutally murdered while out for a jog nearly 2 years ago this day,  beaten and strangled to death by a Venezuelan illegal because she  fought back when he tried to rape her.\n\nThe two illegal aliens who murdered Jocelyn had…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699689/immigration"}, {"senator": "Markwayne Mullin", "party": "Republican", "sentence": "…through this and continue to go through this. So it is even more  personal to me now.\n\nIn July of 2020, Mikaela was diagnosed with a rare pediatric cancer.  She spent nearly 6 years traveling across the country for treatments  while also coming to Capitol Hill to advocate for children with cancer.  But unfortunately, she tragically passed away October…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698335/9999"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…alongside my colleague  Congressman Vince Fong to recognize Ms. April Woody on being awarded  the 2025 Cattlewoman of the Year by the Kern County Cattlewomen's  Association.\n\nNearly sixty years ago, April Woody joined her husband, Ron Woody, in  continuing his family's cattle ranching operation. Though new to  ranching, she quickly learned the ropes and became…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696714/recognizing-april-woody"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "…replacement of a rule.\n\nI have the utmost confidence in Secretary Burgum and Deputy Secretary  MacGregor to get this done right, but this cannot sit on the back  burner.\n\nNearly 6 years ago, during the first Trump administration, I wrote a  letter on behalf of a single constituent advocating for this RMP to be  updated so he could develop some of his privately…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696136/national-defense-authorization-act-for-fiscal-year-2026"}]