[{"senator": "Al Green", "party": "Democrat", "sentence": "…way  he did what he did and in the presence of the people. He didn't wait  until he was out behind their backs to say what he said. He said it in  front of their faces. In my neck of the woods when you tell a person  something to his face or her face or their face, that says something  about you as a person. This is why I wanted to tell the President…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689201/and-still-i-rise-censured-but-not-silenced"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…CPJRAA corrected this. These bills       would take us backward.\n\nThe CPJRAA also protects residents from dangerous and       deadly encounters.\n\nIt restricts deadly force; bans neck restraints; limits       high-speed police pursuits in a dense city where bystanders       are most likely to be hurt; and regulates the acquisition of       military-grade…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696988/opposition-letter-led-by-the-dc-justice-lab-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…their official duties.\n\nLet me translate that. That means--okay, you remember George Floyd,  who was murdered by an officer who wouldn't take his knee off of George  Floyd's neck until he suffocated. You all remember that. You all  remember Breonna Taylor, who was shot and killed in her bed after a  botched, no-knock drug raid; or Tyre Nichols, who was…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690393/attacks-and-threats-on-democracy-and-rule-of-law"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…muffled oars,\n\nCame slipping quietly down the shore,\n\nTo rid our Bay of the dread Gaspee,\n\nAnd show old King George that Rhode Island be free.\n\nThe battle was fierce off Warwick Neck.\n\nWhen the gunsmoke cleared from the Gaspee's deck,\n\nThe Rhode Islanders had her as their prize,\n\nAnd her crew bound up in chains and ties.\n\nWhen the crew was ashore, Pawtuxet's…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691707/253rd-anniversary-of-the-gaspee-raid"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…repeatedly with a TASER       in the course of raping her several times over multiple       incidents. Eventually, he carried through with his threat,       tasing her in the neck and raping and sodomizing her.\n\nThese incidents are both horrific and emblematic of a       larger issue: domestic abusers' use of weapons to exert power       and coercive…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700033/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…the most dangerous missions over war- torn Europe. His service came at great risk. The plane we see there, he  liked to fly privately also and would wear a scarf around his neck. He  was a great teacher, and he managed community colleges after his  service.\n\nDuring one of his many missions, his plane was shot down in battle,  and he was captured as…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687895/black-history-month"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…We went from the President saying on social media today ``be cool''  to then saying ``just kidding.'' We have a 90-day pause in a matter of  hours. I have whiplash. I need a neck brace to be able to get through  all of this.\n\nAlso, the President announced that he is hiking the tariffs on China  to 125  percent and keeping the 10 percent tariffs across…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689864/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…repeatedly with a TASER       in the course of raping her several times over multiple       incidents. Eventually, he carried through with his threat,       tasing her in the neck and raping and sodomizing her.\n\nThese incidents are both horrific and emblematic of a       larger issue: domestic abusers' use of weapons to exert power       and coercive…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700034/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…leave their jobs. Either,  again, Stephen Miller and Kristi Noem resign--that would be the  respectful thing--are fired by the President--they are boat anchors  around your neck--or impeach them, in the case of Kristi Noem.\n\nBut, certainly, for what this body needs to do this week, it seems  abundantly clear that we need to separate out the budgets…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699401/9999"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…12\\1/2\\ years after being  found guilty. He was filmed deploying fire extinguishers and dragging  Metropolitan  Police Officer Michael Fanone and repeatedly shocked Fanone in the neck  with a taser. He was pardoned.\n\nThe chief of the Capitol Police, when asked about those pardons, said  that it was deeply troubling to the Capitol Police, as well it should…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698552/january-6-attack"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…behalf of  their neighborhood, active in Bronx Community Board 10. Most of the  area is represented by my colleague, Congresswoman Alexandria Ocasio- Cortez, places like Throggs Neck, Pelham Bay, Westchester Square, and  the like. However, Community Board 10 also includes the major complex  of Co-op City in my 16th Congressional District.\n\nCo-op City benefits…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699710/saluting-scarsdale"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Republicans were falling all over themselves calling  Elon a genius and he could do no wrong?\n\nI have got to be honest, Mr. Speaker, it gives me whiplash. I think I  need a neck brace to deal with all of these contrary quotations coming  in.\n\nThe icing on the cake, Mr. Speaker, is the number of Republicans who  are now publicly claiming buyers' remorse…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691944/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…telehealth. This is  terrible. Many seniors can't walk. I have neighbors. One lady fell out  of her bed. She couldn't get off the floor. She had one of those things  on her neck that she pushes and then the ambulances came from the local  fire department.\n\nThere are a lot of people living at the edge. We have to be concerned  about them. We can't cut…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690052/trump-tariffs"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…weren't being shut down, but  there are a lot of questions around the status of these trials.\n\nMore than 1,000 veterans are at risk of losing access to treatments  for head and neck cancer, kidney disease, and traumatic brain injuries.  Some of these trials have not been restarted.\n\nIn Pittsburgh, a study for veterans struggling with opioid addiction  stalled…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691392/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…work collaboratively with other agencies, as  the process does now, this bill makes FERC the adversary of other  agencies by forcing it to breathe down every other agency's neck and  make decisions on whether to exclude other agencies from the review  process entirely. That is simply not an efficient or collaborative  process, in my opinion.\n\nI also…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698067/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…Patrick E. Lynch responded to a call for assistance after a woman had  been stabbed. Upon entering the apartment, they encountered the suspect  holding a knife to his father's neck. After repeated commands in both  English and Spanish were ignored and the suspect began to cut his  father's throat, Officer Lynch fired at the suspect, striking him once,…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691108/recognizing-nypd-detective-fabio-l-gonzalez"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…for our  Nation to become a wealthier nation. This is a priority for  Republicans. It is a priority for House GOP leadership, the President,  his administration, and we are neck deep in the process of getting this  over the finish line.\n\nThis bill will deliver on our conservative agenda and make positive  changes that we know that Americans want. From…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690787/big-beautiful-bill"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…ambushed by an antifa terror cell armed to the  teeth with semiautomatic rifles, Molotov cocktails, body armor, and  encrypted radios in North Texas.\n\nThe cop who was struck in the neck and critically wounded while  racing to respond.\n\nI care about the pastor and his flock in St. Paul whose church was  invaded by a screaming mob during Sunday service last month…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699689/immigration"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…which resulted in  the suspect gaining control of it, firing it, and striking Jimmy at  least once. Jimmy medically died on the scene but was revived. It  struck him in the neck, leaving him with a spinal injury, along with a  ruptured esophagus and vocal cords.\n\nHe was in the ICU at San Antonio Military Medical Center with life-  threatening injuries…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695203/people-are-sick-and-tired"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…credit rating. It is technically not a credit rating, but when Greece  can sell a bond cheaper than the United States, should that actually  raise the hair on the back of your neck?\n\nAre you thinking about the fact that the United States, for the  industrialized countries, is like number 12?\n\nLet's call it the credit stack, the ability to sell a 10-year…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697051/facing-fiscal-reality"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…ICE officer who was lacerated across  his face when one of these thugs attacked him with a steel coffee mug.  I talked about another guy that had this cord wrapped around his neck,  and they tried to get him. One of these guys did that to an ICE  officer.\n\nWhere is the concern for our law enforcement? My grandfather was the  chief of police of a small…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}]