[{"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…Living runs senior centers and distributes more than 200 million meals  every year to older adults and people with disabilities through the  Meals on Wheels program.\n\nSeniors need access to nutritious food so they can lead healthy  lives. It is not just the food. The person delivering the meal is often  the only social contact the client will have that day,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690500/blocking-resolutions-of-inquiry"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…and community engagement.\n\nTo fully learn and thrive, students need to have enough food to eat,  and they deserve the best physical infrastructure in which to learn.  They need access to behavioral healthcare, and they need to be safe and  feel safe.\n\nUnfortunately, right now, many students across the country are  terrified to go to school because ICE…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697292/trump-administration-dismantling-department-of-education"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…their connected classmates. Not  because they weren't as intelligent. Not because they wouldn't have  learned equally well on their device. But you need the device. You need  access. You need a Wi-Fi hotspot. You need internet at home. You need  something that is going to help you to compete.\n\nBy the way, we have another word for those kids. We call…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690803/addressing-the-homework-gap-through-the-e-rate-program"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…support recovery while  simultaneously gutting the programs that make it possible is politics  at its worst.\n\nMy Republican colleagues cannot honestly stand for people's need to  access treatment while kneecapping the agency that is accountable for  providing it.\n\nLives are at stake, and the American people are watching. They do  know what it means when…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691873/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…Let me say something  about order. There is no order without justice, and there is no justice  when you erect barriers to silence people instead of listening to them.\n\nWe need access. We need more access, not less. We need more voices,  not fewer. We need to make voting easier, not harder; more joyful, not  more burdensome; and more sacred, not more…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689342/fighting-voter-suppression"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…constituents' needs are being addressed here in  Washington.\n\nThe people in Ohio's 13th Congressional District need lower costs.  The people in Ohio's 13th Congressional District need access to care.  The people in Ohio's 13th District need opportunity, opportunity to  work, to buy a house, and to live their American Dream. Yet, this bill  does none of that.…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693216/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…looking at a reduction in  critical healthcare services from the recently passed Republican  budget, including cuts to the Medicaid program that children with  asthma will need to access, this resolution could not come at a worse  time.\n\nThis is not hyperbole, and I hear my colleagues when they say on the  other side of the aisle that this may be problematic.…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688529/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…don't deserve to be mistreated like that.\n\nMy God, they want to come back and enter into society and be part of  a thriving business, to help open a business, and they still need  access to their medical care. They still need access to their mental  health support, and we are going to cut that. In my mind, that is just  so unchristian.\n\nThen, we are talking…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691088/big-backstabbing-bill"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…a pregnancy to  term but not about what resources might be available for miscarriage,  not about abortion, and not about the full range of medical care that  they might need to access.\n\nIf a doctor only tells a person about one treatment option which  might not be the best for them, that would be malpractice. Here on the  House floor, it is called Republicans'…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699220/providing-for-consideration-of-hr-supporting-pregnant-and-parenting-women-and-families-act-providing-for-consideration-of-hr-pregnant-students-rights-act-and-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…to address the issues identified in our  investigation.\n\nMoving forward, we have more to do to support the Coast Guard. They  needed our help with their assets, and they need access to shipyards.  This morning, during the Commerce Committee, I said I would work with  my colleagues on all the shipbuilding efforts to help us meet our key  global shipping…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688520/coast-guard-authorization-act-of-2025"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…been introduced will  drive up everyday costs, including healthcare premiums.\n\nMr. Speaker, it is time for us to come together and deliver what the  American people need, which is access to affordable healthcare and a  government that is funded and functional.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695634/delivering-for-the-american-people"}, {"senator": "Laura Friedman", "party": "Democrat", "sentence": "…services as we lay off public  employees. Those are the same people who answer the phone if you need  to help a veteran get services or help yourself get Social Security or  need to access Medicaid. The people who answer those phones are being  laid off. That will make lives harder for our families.\n\nIn fact, on average, families making less than $157,000…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688232/democratic-proposals"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…food pantry and  played a key role in a student-led campaign to collect non-perishable  items for blessing boxes in the community of Ozark, Arkansas, ensuring  those in need have access to essential resources.\n\nJayden is also blazing trails in traditionally male-dominated fields.  She is currently the only female member of the Fire Crew at Cass, where…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692255/recognizing-ms-jayden-coffey"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…YMCA childcare expansion.\n\nThis funding will allow the Y to open 50 new childcare slots, giving  working parents in Jasper County the reliability and support they  urgently need.\n\nAccess to childcare is not just a family issue. It is a workforce  issue. When parents can't find childcare, they can't work, which hurts  local businesses and the entire economy.…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696794/highlighting-critical-investments"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…nursing  homes, and we know that we strengthened the nursing homes that came to  us because they were threatened by some of the Biden rules that we shut  down, and people need access when they have loved ones who are in need.\n\nThese tax cuts aren't talk. These efforts aren't talk. They will grow  our economy. Our legislation provides much-needed tax…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694788/promises-made-promises-kept"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…Representative Conaway.\n\nThe SBA microloan program provides entrepreneurs with access to  small-dollar loans through qualified lenders. Sometimes, entrepreneurs  do not need to access large sums of capital for their operations. That  is where the SBA microloan program can help entrepreneurs get just  enough capital to meet their exact needs.\n\nUnder current…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699176/northern-mariana-islands-small-business-access-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…reflects updated science, addresses  years of flawed Federal policy, and responds to what parents, schools,  and health professionals across the country already know: Kids need  access to milk that they will actually drink.\n\nSecretary of Health and Human Services Robert F. Kennedy, Jr., has  also voiced support for returning whole milk to school cafeterias.…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692463/national-dairy-month"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…didn't vote for this  mess, what we call Dems' dirty ObamaCare bill. This is a disaster, and  it was sold under false pretenses. We need to do better for our  constituents who need access to affordable healthcare.\n\nWell, our Democratic colleagues are calling for a clean extension of  the enhanced ObamaCare subsidies because they don't want any changes in…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697929/healthcare"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…the subsidies for healthcare for people making well in excess of  half a million dollars a year. That is crazy. We ought to be focused on  the vulnerable, the people who need access to care, and not people who  can afford to buy healthcare on their own.\n\nIn addition to medical bills, many families struggle to deal with  their car payments. You have…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698258/nominations"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…enforcement in the past.\n\nMr. Speaker, the Law-Enforcement Innovate to De-Escalate Act updates  this outdated framework and acknowledges a simple fact. Law enforcement  officers need access to better tools in order to do their job safely  and effectively.\n\nThe bill ensures less-than-lethal devices are treated for what they  are, which are tools in de-escalation,…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699905/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}]