[{"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…of my career in law enforcement,  and the word ``alleged'' before a conviction is always mandatory. But  what is on that tape is there for everyone to see--the absolutely  needless, reckless use of excessive force with a firearm, without any  apparent need for self-defense.\n\nWe are seeing a surge of violence in this country that is not only  from private…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699087/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…survive, fewer patients  will have coverage.\n\nThis budget would impose endless red tape and import the worst parts  of the private healthcare system, confusing paperwork and needless  bureaucracy, into the Medicaid program.\n\nIn total, 16 million people could lose coverage. Millions more could  lose access to care in their community. In Delaware, that will…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692901/keep-rural-hospitals-open-as-lifeline"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…merit, but because their conclusions contradict  preferred political narratives.\n\nWe have seen attacks on vaccines and changes to our public health  system that have caused needless outbreaks of disease. This President  has most assuredly not made America great again, but he has managed to  make measles great again. And when experts gently try to correct…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700183/state-of-the-union-address"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…my colleague Congressman Burlison. The FIT Procurement Act would  raise cost caps and allow the Federal Government to buy more innovative  tools without going through the needless bureaucracy.\n\nWhat we are trying to do is help agencies not have to jump through so  many hoops to get innovative tools to help people and help them serve  people. It will…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692900/congratulating-virginias-10th-district-congressional-award-medalists"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "Ms. KAPTUR. Mr. Speaker, needless chaos on U.S. financial markets  must be quelled. Today's continuing historic losses on top of last  week's are unprecedented, totalling over $6 trillion. That is trillion.…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689621/quelling-us-financial-markets"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…why we say abolish ICE, which was created in 2003.\n\nI agree with them. I agree that we must abolish ICE and protect our  communities and neighbors. It has caused so much needless harm since  its creation in 2003.\n\nThis month, Mr. Speaker, a high school senior in my district, Maykol  Bogoya-Duarte, a high school student 3.5 credits shy of graduating…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692494/violations-of-rights-by-ice"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Product Safety Commission to establish  mandatory safety standards for the manufacture of lithium-ion batteries  in e-mobility devices.\n\nIn doing so, we are acting to prevent needless fires, save lives, and  safeguard communities across our Nation, and we are honoring our most  sacred duty: to protect the American people.\n\nI urge my colleagues to support…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690260/setting-consumer-standards-for-lithium-ion-batteries-act"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…plans in place for listed species. Wholesale  exempting the Department of Defense and its many contractors from  compliance with the ESA puts our Nation's national legacy at needless  risk.\n\nTo date, as the Member from Arizona has mentioned, 99 percent of the  species listed under the ESA have been saved from disappearing forever,  making this one of the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695233/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…particularly in Islamabad.\n\nFamilies in my district have cases stuck in administrative processing  with no clear timeline. These delays are keeping families apart,  creating needless anxiety and making it impossible to plan for the  future.\n\nJust last week, this administration announced the firings of 1,300  staff at the State Department. That is 1,100…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693568/congratulating-military-academy-appointees"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…electricity prices.\n\nBy potentially enabling the executive branch to roll back       efficiency standards, H.R. 4626 would increase costs for       consumers. H.R. 4626 would add needless steps to an already       lengthy rulemaking process and set arbitrary minimum savings       thresholds and payback periods that would put future       improvements to many…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700164/dont-mess-with-my-home-appliances-act"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…dozen USAID lawyers on  leave, including its ethics lawyers.\n\nThey would not delay payment of invoices for work already completed  on behalf of the U.S. Government, incurring needless fees for violating  the Prompt Payment Act.\n\nIf this were truly about preventing waste, fraud, and abuse, if this  were truly about rooting out corruption, they would not…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688467/usaid"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "…officers should pursue a fleeing car.\n\nOur debate here is a perfect example of why D.C. needs self-rule. We  should be clear. High-speed chases are deadly. They often end in  needless deaths, injuries, and devastating property damage.\n\nOver 3,000 people died in police car chases in the U.S. between 2017  and 2022. Half of those deaths were innocent bystanders…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695640/district-of-columbia-policing-protection-act"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…strain on our hospital systems that are  already facing a workforce crisis.\n\nLet's talk about what is actually in the Republican proposal. The  majority party wants to impose needless and excessive paperwork  requirements that serve no purpose but to push people off the rolls.  They are importing the worst parts of the private health insurance  industry,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691329/nearly-one-in-four-delawareans-rely-on-medicaid"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…avoided the use of lethal force where arrest and prosecution  were possible.\n\nAfter decades of forever wars, the American people are sick and tired  of being dragged into needless armed conflicts. Despite that, President  Trump escalated his reckless campaign against Venezuela even further  last night, pushing the Nation closer to a war the American…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698324/supporting-the-war-powers-resolutions"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…bombing where people live?\n\nMr. President, 46 Senators cosponsored this simple resolution months  ago, and it is about trying to bring about an end to this relentless  and needless suffering.\n\nWe must act. We must act so that an innocent son or daughter risking  starvation does not starve. We must act to save someone's mother or  father from a bomb dropped…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695678/cloture-motion"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…the Fish and Wildlife Service has classified them as opportunist  and generalist feeders that prey on a wide range of species.\n\nYet, farmers are still forced to jump through needless hoops to  prevent these birds from wiping out their stock. The Aquaculture  Depredation Order is nothing new. It is the same commonsense tool that  was easily reinstated in…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697639/cormorant-relief-act-of-2025"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…could shape the fate of nations, but we are subsequently  proven wrong as events ended up controlling them. Our own country,  sadly, experienced this during Vietnam.\n\nThe needless tragedy of that war in which 58,000 Americans paid the  ultimate sacrifice led Congress to pass the War Powers Resolution we  debate today. Congress intended to ensure a President…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693121/motion-to-discharge-sj-res-59"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…it. She thanked me       that her community bank was there for her to cover her       overdraft so she could keep moving without having to call for       help.\n\nMr. Speaker, needless to say, the banker was tremendously humbled  that she was able to help this mother out due to the overdraft. They  are there in time of need.", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689846/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…Republicans are working hard to deliver solutions that help Americans  thrive. H.R. 2312 puts more money back in workers' pockets and eases  the burden on employers by removing needless Federal regulations.\n\nI am proud to support the Tipped Employee Protection Act. Congress  should make it clear that we are working to help put more money back in  tipped workers'…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698965/tipped-employee-protection-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "…it clear that he would not hesitate to take action to deter  our enemies and protect our Nation, and that is exactly what he has  been doing, both here at home and abroad.\n\nNeedless to say, 4 years of recordbreaking illegal immigration at our  southern border, under President Biden, left a gaping hole in our  national security. The chaos that raged at…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689044/border-security"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "Mr. BAUMGARTNER. Mr. Speaker, we are nearing 1 week since the end of  the needless, 43-day-long Democrat government shutdown. That shutdown  was a monumental waste of time that hurt a lot of people across the  country.\n\nI am grateful that the families in…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696843/focusing-on-results"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…``100 percent of the increased Gulf of Mexico compliance cost  for survey[s]'' on operators that are small entities.\n\nThis resolution would end the Biden administration's needless  overreach and return the regulatory regime to a targeted, evidence- based approach.\n\nNotably, this repeal preserves America's ability to tap its offshore  resources efficiently.…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688630/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Andy Ogles", "party": "Republican", "sentence": "…that are directly or indirectly owned,  controlled, or beneficially owned by the People's Liberation Army or  the Central Military Commission of the Chinese Communist Party.\n\nNeedless to say, these companies aren't here to be our friends. They  hate us, and they want to harm us. They are here to steal our  technology and advance China's military modernization…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689026/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…the greatest Nation in the world should  function. Today that changes.\n\nThe legislation before us reopens the government, restores critical  services, and puts an end to the needless hardship Democrats have  inflicted on the country.\n\nThis bill supports our troops. It pays Federal workers. It fully  funds SNAP benefits until September 30 of next year.…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696725/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "…on this responsibility. In early '24, under the  Biden EPA, this approval was revoked for the infrastructure updates  that were already well underway, costing our taxpayers needless  millions.\n\nThis unpredictability has been a practice of our Federal Government  for too long. It is time our local governments and taxpayers have the  transparency and certainty…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698043/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…programs. See how simple that is? Keep on with the rhetoric. I mean, it  is cute, but the American people don't buy it.\n\nListen, for the past 40 days, Democrats have inflicted needless pain  on hardworking Americans. They stranded millions of travelers. They  denied food assistance for hungry families. How did they do that? When  you vote ``no'' to continue…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696724/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…just laughable.\n\nWe watched, warned, and fought in the 118th Congress to stop an  administration that created a regulatory environment that has added  about $1.5 trillion in needless regulations that have stifled the  growth of industry and jobs in this country. Now, we are seeing them  all of a sudden change their tune.\n\nAs our new administration is less…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688464/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing-and-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "…needs  during a very dangerous time.\n\nThat said, I made the unanimous consent request with mixed feelings  because, frankly, there are two regulations--pernicious, onerous,  needless regulations--by the Environmental Protection Agency that need  to be wiped off the books.\n\nSo this will give us an opportunity to do that. It is 10 after 3 at  this point,…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690110/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Cindy Hyde-Smith", "party": "Republican", "sentence": "…who was allowed  in our country by the Biden administration even though he was wanted by  the Government of Uzbekistan because of his links to a terrorist  organization.\n\nNeedless to say, seeing ICE and State law enforcement come together  to make America's roads safer is a step in the right direction.  Republicans in the Senate and this administration…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697478/commercial-drivers-license-system"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…in addition to the data  collection that it requires and the aspects of it that seek to support  an agenda designed to promote energy independence through getting rid  of needless regulations, it also is looking at State actions that are  contributing to our decline in refining capacity.\n\nCalifornia, I am sure, will be the State where the most such…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697101/highlighting-the-state-of-california"}]