[{"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…not just  happening to temples. It is happening to all places of worship.\n\nEvery American deserves the right to safely practice their faith  without fear. That is why we need to continue fighting for increased  resources for security at places of worship, like these temples. We  must be committed to doing more to combat the rise in hate that we are  experiencing…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695057/school-funding-slashed"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…healthcare for millions of Americans, let us  also not forget to fight for research that fuels that care. We cannot  stand for this assault on medical research funding. We need to continue  to work on a bipartisan basis to make sure that funding does continue.\n\nIt is not just a matter of national pride. It is a matter of finding  cures and drugs that will…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698206/nih-funding"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…That whole history, that powerful statement of what can be created  when we invest in our manufacturing, in our technology, in our science  community is proof that we need to continue forward in that vein.\n\nSince January, Donald Trump and his political allies have launched a  full-scale assault on America's scientific enterprise. Federal  investments…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691396/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…and treasured members of their community.\n\nAmerica does not live in fear. That isn't why our country was  founded. We have been a refuge for our entire history, and we need to  continue to be a refuge for those seeking a better life. Who will speak  up for these people while they are painted as worthless or not worthy  of a place in our country by those…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690052/trump-tariffs"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…dream has become a memory for many. I think it is important  for us to recall that the dream is not a memory, it is a mandate. It is  a mission. It is a movement that we need to continue to make sure we  get that work done that Dr. King died for and so many others died for,  as well.\n\nI thank my colleague again for putting on this event tonight, giving…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699200/building-a-beloved-community"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…appropriations and agriculture  legislation, I am committed to working with my colleagues on both sides  of the aisle to ensure all of our farmers get the support they need to  continue their essential work.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695660/supporting-farmers"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…families asking for  food, and this is still going to be a big issue. We saw the SNAP cuts  over the summer. All of them told me that that is going to be a big  issue.\n\nWe need to continue to address food insecurity in America, and I  thank those organizations for stepping up when we needed them most.", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696984/recognizing-food-pantries"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…this, too.\n\nAs ranking member of the Crime Subcommittee, I hear directly from  families and officers from all across the country about the reforms  that they desperately need. I will continue to champion bills that  provide tools that help our law enforcement officers and keep them all  safe because they deserve that.\n\nWe stand with all of our officers around…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691321/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…world in which ``might  means right'' and the rule of law is abandoned.\n\nColorado cannot allow this President to create such a world for our  children, which is why we need to continue to fight on a bipartisan  basis when possible to prevent another forever war in Venezuela or  beyond and to constrain the President's dangerous, dangerous ambition  because…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698608/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…Austin  and Texas A&M, where cutting-edge biomedical research is shaping the  future of medicine. If Trump's cuts go through, these institutions will  lose the funding they need to continue their vital work.\n\nThis attack on the NIH is part of a larger pattern. This is the same  Donald Trump leading an administration that rejects science. He is  threatening…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689421/nih-cuts-put-american-lives-at-risk"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…This is the sign  of an authoritarian and autocratic way of operating. This is the sign  of a democracy that has lost its way. This is a sign that the American  people need to continue to stand up, to speak out, to show up, to  attend those townhalls, to call their Representatives, to continue  marching, to continue making sure that we hold our elected…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690395/attacks-and-threats-on-democracy-and-rule-of-law"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…report.\n\nLast year was full of legislative victories. From ensuring more milk  options in public schools to making certain that rural schools receive  the funding that they need, we continue to deliver for Pennsylvania's  15th Congressional District.\n\nI was proud to lead the charge to bring whole milk back into our  schools, push for the largest investment…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698682/recognizing-the-honorable-steny-hoyer"}, {"senator": "Trent Kelly", "party": "Republican", "sentence": "…This year's NDAA also makes key investments in future procurements of  ships, submarines, and airborne projection forces. This gives our  defense industry the base they need to continue the important work they  do in so many of our communities and paves the road for a smoother  procurement process going forward.\n\nWith global tensions as high as they are,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695143/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Dan Newhouse", "party": "Republican", "sentence": "…respect  Mr. McGovern's opinion and his viewpoints. They may conflict with mine  on many occasions, but he has the absolute right to express them on  this floor, and we need to continue that tradition. However, this is  not about the President. This is not about President Trump.\n\nThis is about how we, as Members of the House of Representatives,  conduct…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688496/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…Today, I recognize the strength of those living with alopecia and the  loved ones who stand beside them. Their resilience reminds us of the  importance of community and the need to continue fostering empathy and  inclusion for all who are navigating visible and invisible health  challenges.", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697697/recognizing-richard-nixon-presidential-library-and-museum"}, {"senator": "James Risch", "party": "Republican", "sentence": "…Middle East has an opportunity to free itself from Iran's grip,  and America will be safer for it. To promote stability in the region  and protect our national security, we need to continue to support  Israel's successful efforts.\n\nPresident Trump, Secretary Rubio, and soon-to-be Ambassador Huckabee  will work day in and day out to make sure that American…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689526/motions-to-discharge-sj-res-33-and-sj-res-26"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…decreases costs over  the long run. By extending the hospital at home waiver for 5 years,  this bill that we are considering today would give hospitals the  certainty they need to continue to build out these innovative care  models and serve their patients in a holistic way after the disruption  caused by the Democratic shutdown.\n\nMr. Speaker, I encourage…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697170/hospital-inpatient-services-modernization-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…and that is why I am sponsoring a number of measures here  to try to make housing more affordable.\n\nOf course, the tax issues speak for themselves.\n\nWe have a lot we need to do to continue to make life more affordable  for Americans. We have seen some progress in certain areas when it  comes to the price of gas across the country, when it comes to the…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697549/congratulating-eco-clean-solutions"}, {"senator": "Vince Fong", "party": "Republican", "sentence": "…technology to keep our  Nation safe.\n\nI urge my colleagues to support these amendments which would ensure  China Lake and Edwards Air Force Base have the resources they need to  continue their critical work of research, development, testing, and  evaluation of our latest military technology.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695160/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}]