[{"senator": "Julie Johnson", "party": "Democrat", "sentence": "…This is about Trump and Musk settling scores,  causing chaos, and making sure they line their pockets on the backs of  Americans and the middle class.\n\nMadam Speaker, we need to end these reckless tariffs and get back to  lowering costs for the people we serve.", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689098/understanding-tariffs"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…children in our country. This Congress  does not need to be in the business of weakening the laws that we do  have, but we do need to be in the business of doing what we need to do  to end gun violence in this country.\n\nMr. Speaker, I urge my colleagues to vote ``no.''\n\nMr. FROST. Mr. Speaker, when I first heard about this bill, I thought  it was very interesting…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700035/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…love or the politician I don't love.\n\nWhether it is a question of who is funding an ad or whether or not  the content of the ad is real, voters deserve transparency. We need to  end secret money in our politics to make sure the American people know  their elected officials work for them, not the wealthy and the powerful  few, and to make sure we have…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699114/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…willing to stand up and say: We here  in Congress have to change. We have to change the way Congress works so  that we work for the American people and not for ourselves. We need to  end this corruption. We need to end this insider dealing. We need to  end congressional stock trading.\n\nWhat you have seen tonight is that this is a bipartisan issue. We  have…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691216/stock-trading-ban-for-members-of-congress"}, {"senator": "Frederica Wilson", "party": "Democrat", "sentence": "…painful       history of the past is not forgotten or repeated;\n\nNow, therefore, be it proclaimed, That I, Representative       Frederica Wilson, in recognition of the urgent need to end       Jew-hatred in this generation, hereby declare and proclaim       every April 29 as ``#EndJewHatred Day;'' and\n\nBe it further proclaimed, That I, Representative Frederica…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690399/proclaiming-this-and-every-april-29th-as-endjewhatred-day"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…a number of my  colleagues, including Senator Warren, on the many options we have to  help Americans pay for housing. We also need to look at lowering  grocery costs. We need to end Donald Trump's destructive tariffs. We  need to help families afford daycare. These are the things that  Americans care about, not invading Venezuela, not attacking Colombia,…", "date": "2026-01-05", "source_url": "https://justfacts.votesmart.org/public-statement/1698474/cost-of-living"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…after ``the worst of the worst,'' as the administration  says, instead of unleashing fear and chaos on everybody else.\n\nWhat Democrats want is exceedingly reasonable. We need to end roving  patrols. That means arrest warrants and ending racial profiling.\n\nSecond, we need real accountability, having ICE abide by the same  rules as local police do, including…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699481/department-of-homeland-security"}, {"senator": "Tina Smith", "party": "Democrat", "sentence": "…the floor this afternoon.\n\nWe are here today because we have a full-blown, dangerous emergency  unfolding in Minnesota.\n\nIt is happening right now as I speak, and we need your help to end  it. America needs your help. The Nation has been appalled by what we  have seen happening in our State of Minnesota, the stories that have  captured everyone's attention.…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699416/9999"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…in mind that the First Amendment  is the most important amendment and probably the most important part of  our Constitution to guarantee free speech.\n\nNot only does this need to end now, but we have to continue to speak  out when we see violations of free speech, both by the President, by  the FCC, or by anyone else, frankly, who we have jurisdiction…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695754/guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act"}, {"senator": "Greg Landsman", "party": "Democrat", "sentence": "…across the board. The average family is  expected to pay an extra $4,000 this year alone. They cannot afford  that.\n\nTrump says: ``I couldn't care less.''\n\nMr. Speaker, we need to end this chaos.", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689748/tariffs-lead-to-highest-sales-tax-on-americans-in-history"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…overturn Citizens United,  get dark money out of politics, and make sure our government is  accountable to voters and not donors.\n\nTo my colleagues here in the House, we don't need to end campaign  spending for Members of Congress to do the right thing. Integrity  doesn't require authorizing legislation. We cannot allow big money  donors to buy or bully Congress.…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693551/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Norma Torres", "party": "Democrat", "sentence": "…services?\n\nWe are being left in the dark without knowing about what plans DOGE,  OPM, and OMB have. The lack of transparency is alarming, unacceptable,  and illegal.\n\nWe need to end Elon Musk's power grab over agencies and services that  Americans depend upon before it is too late.\n\nThe Republic is in crisis, and Republicans need to wake up.", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688338/stopping-appropriation-work"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…is to invite the problems which we have already  witnessed.\n\nICE is not a secret police force. It wasn't meant to be, despite what  President Trump may wish.\n\nSecond, we need to end the roving patrols. ICE does not have free  will to do as they please. This is a nation of laws, guided by the  Constitution that everyone, including ICE, must abide by.…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699485/department-of-homeland-security"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…the  White House, my friends across the aisle would be losing their minds  right now. Wrong is still wrong, regardless of which party this  President belongs to.\n\nWe need to put an end to Donald Trump's pay-for-play political gifts  for the sake of our reputation, our democracy, and our future.", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691208/ending-pay-for-play-political-gifts"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "…management. We need to take  back the authority we gave Presidents because they are not using it in  the way Congress intended it to be used. It is being abused, and we  need to end that abuse by exercising our legislative powers.\n\nMs. MALOY. I don't know what the current timeline is, but I know it  has taken years when it should take months.\n\nWe know…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689196/work-highlights-of-western-caucus"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…reintroduced a package of bills that will do much  to combat human trafficking. My SAVE Girls Act would provide States,  local governments, and nonprofits with the resources they need to end  the trafficking of young women and girls.\n\nMy National Human Trafficking Database Act, meanwhile, would  establish a national human trafficking database at the Department…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688161/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…there if you actually wanted to get into the city.\n\nOf course, I am being facetious when I say that this is an exciting,  ambitious plan. It is just another example of why we need to end this  project once and for all. There is absolutely no reason that State or  Federal taxpayers should continue to fund a project that is going  absolutely nowhere, especially…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690562/gas-prices-are-lower-for-everyone-except-californians"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…that the intergenerational trauma of the past shall never be  repeated; now, therefore, be it\n\nProclaimed, that I, Honorable Earl L. ``Buddy'' Carter, in  recognition of the need to end Jew hatred in this generation, declare  and proclaim every April 29 to be #EndJewHatred Day; and be it further\n\nProclaimed, that I, Honorable Earl L. ``Buddy'' Carter, affirm…", "date": "2025-03-21", "source_url": "https://justfacts.votesmart.org/public-statement/1688926/designating-april-29-as-endjewhatred-day"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…Senator  from California overtly saying: We have no desire to change sanctuary  policy. We think it is OK. Then we have got me and all of us on this  side saying that you need to end this; that this will continue.\n\nI am sad and disappointed we didn't have a bunch of votes today. Why  aren't we voting? Because they blocked it. Why aren't we defunding…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700070/9999"}]