[{"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…advanced aircraft technologies and airspace  management, information sharing and real-time data exchange, and the  development of an interagency coordination platform.\n\nWe need to ensure our first responders have access to the most  advanced tools to respond to wildfires. This bill supports using NASA's  brightest minds and cutting-edge technologies to…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700125/advanced-capabilities-for-emergency-response-operations-act"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…funds that Democrats and Republicans, in a bipartisan way,  historically appropriated.\n\nWe need to lower that cost of living. Bipartisan cooperation is  essential, and we need to ensure that this body's commitments to our  constituents are fulfilled.\n\nI also believe it cannot be achieved through another full-year  continuing resolution. That only increases…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695289/9999"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "Ms. KLOBUCHAR. Mr. President, I rise today to join my colleagues in  standing up for the right to vote and the critical need to ensure that  that right is protected.\n\nI want to thank Ranking Members Padilla and Reed for their leadership  on this issue and in organizing this floor block. Senator Padilla,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690545/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "…flowed and sent money to his  family when they left the White House. Donald Trump, today, by the use  of the meme coin and other means, is profiting off our government. We  need to ensure that our government is working openly and fairly for  everyone, not just for those with a political agenda.", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690819/gross-violations-of-law-by-trump-administration"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…that  surviving family members receive the benefits that they are entitled to  in a timely fashion.\n\nThis commonsense legislation will provide the information that we  need to ensure that our veterans are getting the best possible care,  which is a goal that we all share.\n\nMr. Speaker, I will end by thanking the gentleman from North Carolina  (Mr. Edwards)…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695485/modernizing-all-veterans-and-survivors-claims-processing-act"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…is only part of the equation. We  must provide full funding to the Office of the Inspector General so  that they have the resources to root out the fraud. Moreover, we need  to ensure proper staffing at the SBA to review the 1,892 active SVOG  awards totaling over $3.2 billion.\n\nMr. Speaker, with that said, this legislation is a step in the right  direction.…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697226/sba-fraud-enforcement-extension-act"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…member of the House Appropriations Committee, I will make every effort  to ensure that OSHA and the National Labor Relations Board have the  resources and direction they need to ensure that all  workers make it back home to their families and loved ones at the end  of the day.", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691010/federal-workplace-protections"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…Pharma accountable.\n\nWhen people tell us that they see government as overly bureaucratic  and complex, we can't dismiss that experience and say that it is all  fine. We need to ensure that taxpayer dollars are spent responsibly.\n\nOf course, addressing waste, fraud, and abuse is important. We also  need to make sure that our veterans, our seniors, and…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689078/economic-populism"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…Education in 1979, they did  so noting that: ``Education is fundamental to the development of  individual citizens and the progress of the Nation;\n\n``There is a continuing need to ensure equal access for all Americans  to educational opportunities of high quality, and such educational  opportunities should not be denied because of race, creed, color,  natural…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689641/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…living in this country. I am going to help and push  back and introduce the economic dignity for all agenda, a plan to  tackle the high cost of living in our country.\n\nWe need to ensure that in every family in every single corner in our  country, a child has resources that they need to live and thrive in our  country, not just hope to survive.\n\nThis plan…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697023/economic-dignity-for-all"}, {"senator": "Greg Landsman", "party": "Democrat", "sentence": "…been breaches, including our own personal  data and personal devices, and so the goal of this bill is to require  an interagency group to build out all the information we need to ensure  that we understand where all of our vulnerabilities are and that we are  dealing with those vulnerabilities--where are the gaps, how our foreign  adversaries are accessing…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693424/understanding-cybersecurity-of-mobile-networks-act"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…need to quickly field  next-generation military assets like the Columbia submarine and the B- 21 Raider. We need to bolster supply chains that support this  production. We need to ensure that the Nation has the industrial  capacity to respond to a sustained major conflict anywhere in the  world.\n\nIn order for us to achieve these goals, meet our national…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693551/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Tom Kean, Jr.", "party": "Republican", "sentence": "…influence of  adversarial governments, like the Chinese Communist Party.\n\nI think we can all agree, regardless of which side of the aisle we  stand on, that there is a need to ensure technologies critical to  America's telecommunications infrastructure do not end up in the wrong  hands.\n\nUndersea cables carry approximately 99 percent of transoceanic…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694821/undersea-cable-control-act"}, {"senator": "Carlos Gimenez", "party": "Republican", "sentence": "…States must be at the forefront of  combating and decoupling from the CCP. This includes battery  technology.\n\nAs we become more and more dependent on battery technology, we need  to ensure that these batteries are sourced from nonadversarial  countries. As it stands, Communist China produces approximately 80  percent of the world's batteries and roughly…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688683/decoupling-from-foreign-adversarial-battery-dependence-act"}, {"senator": "Michael Cloud", "party": "Republican", "sentence": "…Union, AFSCME, SEIU, and others affected by  this executive order have made no secret of their intent to resist the  agenda the American people voted for.\n\nAs Congress, we need to ensure that the Constitution is upheld. We  need more legislation like the Preserving Presidential Management  Authority Act, which simply reaffirms Article II and ensures that…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697985/protect-americas-workforce-act"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…Committee.\n\nThere is obviously a lot going into this and, on the Committee on  Ways and Means, we are trying to find the sweet spot of many  considerations at play. We need to ensure the provisions in the 2017  Tax Cuts and Jobs Act aren't just extended but, where possible, made  permanent.\n\nIf we don't act, we risk seeing critical policies roll back,…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690787/big-beautiful-bill"}, {"senator": "Russ Fulcher", "party": "Republican", "sentence": "…to that  appliance.\n\nWhile the intention may strictly be for convenience, consumers need  to be aware that private information may be captured by a smart  appliance. We need to ensure proper disclosure and consumer awareness  of these features.\n\nIt is also important to note that the bill's disclosure requirement  only applies to appliances we wouldn't…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690178/informing-consumers-about-smart-devices-act"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…70  percent of colleges and universities fail to comply.\n\nThe DETERRENT Act updates section 117 to provide the very clarity and  guidance that colleges and universities need to ensure they properly  disclose foreign sources of funding and remain in compliance. It also  adds a set of razor-sharp teeth to current law to hold colleges and  universities…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689054/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers-providing-for-consideration-of-hr-defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Kat Cammack", "party": "Republican", "sentence": "…CAMMACK. The point is, is that Americans around this country are  sick and tired of the fear-mongering tactics that they have been  subjected to by the left for decades. We need to ensure the integrity  of our elections. It has been demanded by the American people, and we  are making good on that promise today.\n\nMr. Speaker, I urge my colleagues to support…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690009/safeguard-american-voter-eligibility-act"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…and essential infrastructure in a  broad and sweeping manner--completely undermining multiple-use  management while ignoring the needs and input of local residents. We  need to ensure that our conservation policies consider and allow for  adequate economic opportunities for the communities and people impacted  by those policies.\n\nAlaskans are some of…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696162/hj-res-106"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…opportunity to grow and  innovate.\n\nThe Federal Government is the largest purchaser of goods and services  in the world. If we are serious about supporting small businesses, we  need to ensure they have a fair shot at competing for these contracts.\n\nRight now, the scorecard system measures whether agencies are meeting  their small business contracting goals,…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687941/small-business-procurement-and-utilization-reform-act-of-2025"}]