[{"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…bill that it had been paired with. Both  bills are bipartisan; both even have a budget score, and yet the  Democratic bill sits with no plan to get it signed into law.\n\nWe need to pass bills over here in a way that ensures that both  Republican and Democratic priorities and bills become law.\n\nIn addition, I do have substantive concerns with S. 1084. I…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698420/unanimous-consent-requests-the-calendar"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…low-income folks. Mr. Speaker, 69 million American women  would also be unable to register to vote simply because they changed  their last name after they got married.\n\nWe need to pass legislation to stop billionaires from buying our  elections, not making it harder for the American people to vote. I am  going to vote ``no'' on this bill. I did it last…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689318/voter-suppression-plain-and-simple"}, {"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…Congress doesn't have to wait to act. We can  ban Members of Congress from holding and trading stock. We can pass  transparency laws like the DISCLOSE Act. Ultimately, we need to pass a  constitutional amendment reversing Citizens United. This is a choice  between democracy that serves donors or one that serves people. The  choice couldn't be clearer.…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699240/restoring-election-integrity"}, {"senator": "Steven Horsford", "party": "Democrat", "sentence": "…rest of the week cooking, cleaning, or washing dishes and still be  paid as little as $2.13 an hour for that work. That is not tip work.  That is a pay cut.\n\nThat is why we need to pass my TIPS Act, which would raise the wages  for tipped workers--which has not been raised since 1991, the year I  graduated from high school--not cut them.\n\nThis GOP bill…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698970/tipped-employee-protection-act"}, {"senator": "Jimmy Gomez", "party": "Democrat", "sentence": "…buyers money for a  downpayment.\n\nIf we want to tackle the affordability crisis that is at the top of  the agenda for the American people that is not a con job, then we need  to pass the Make Housing Affordable and Defend Democracy Act. It is  about affordability, not authoritarianism. It is about American values,  not Donald Trump's wins.", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697459/fighting-dhs-immigration-raids"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…across the world, and we think permanently. The severity of this  physical, as well as tariff, drought runs straight through our  district.\n\nOur farmers need certainty. We need to pass a farm bill. We don't  need recklessly imposed tariffs that break their backs due to lost  export markets and then paying Argentina $40 billion for their beef  when our…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699499/a-plea-for-small-family-owned-farms"}, {"senator": "Jan Schakowsky", "party": "Democrat", "sentence": "…to not be able to do that. People  are going to get exactly what they had asked for, what they had paid  for.\n\nThe passage of the TICKET Act is really a happy event. We need to  pass this legislation. I know that lots and lots of people and people  who are artists are going to really do better. I look forward to  finally, after a couple of years, passing…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690176/transparency-in-charges-for-key-events-ticketing-act"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…question of why two convicted people, not just indicted,  were pardoned by the United States President.\n\nMr. Speaker, I will address my fellow Americans. Congress would need  to pass an Authorization for Use of Military Force if President Trump  wanted to put boots on the ground or conduct military strikes in  Venezuela to abide by the law.\n\nFor that,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698456/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "…extension of these ACA tax credits.\n\nArizonans cannot afford any more delays. Let's be clear: Extending  these tax credits is necessary, but it is certainly not enough. We need  to pass Medicare for All. We are the richest country in the world, and  we pay more for healthcare per person than any other developed nation.\n\nOn average, we spend at least double…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698672/protecting-healthcare-for-millions-of-americans"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…United States of America would say something like that is pathetic.\n\nHe could very easily put all of this controversy to rest by just  releasing the files, and that is why we need to  pass the Massie-Khanna bill because we could actually pass a bill that  would compel him to do that.\n\nWhat you all did in the Rules Committee last night is a resolution  that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694886/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…integrity.\n\nSpeaking as a beneficiary of the good works done as a result of the  existence of the Crime Victims Fund and a proud cosponsor of H.R. 909,  there is truly an urgent need to pass this legislation. Without Federal  funding, critical victim services are simply going to vanish.\n\nI am grateful to the sponsors of this bill and to all of our  colleagues…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698840/crime-victims-fund-stabilization-act-of-2025"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…States, law enforcement pays zero excise taxes on these devices. It is  important to know that long-range tasers can already be legally  purchased by civilians. All they need to do is pass a background check.\n\nI support tasers. I support law enforcement. This bill does not  mention tasers once, and law enforcement is only mentioned in the  title. I don't…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700033/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…and it is often inaccessible, especially in  certain communities. That is why urgent investment in research,  treatment, and equitable care is critical.\n\nThat is why we need to pass the Sickle Cell Disease Comprehensive  Care Act, introduced by my Republican colleague out of Florida,  Representative Neal Dunn. I am a proud cosponsor, and I thank him…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695786/sickle-cell-awareness-month"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…We are barreling toward another shutdown at the end of January. We  could have spent the last 2 months working on passing the nine  appropriations bills Republicans still need to pass to stop another  shutdown. Instead, they went on a taxpayer-funded paid vacation for 8  weeks.\n\nLet me just say, because we are debating a rule to consider these  eight…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696904/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision-providing-for-consideration-of-h-con-res-denouncing-the-horrors-of-socialism-providing-for-consideration-of-hr-unlocking-our-domestic-lng-potential-act-of-providing-for-consideration-of-hr-researching-efficient-federal-improvements-for-necessary-energy-refining-act-providing-for-consideration-of-hr-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-providing-for-consideration-of-hr-district-of-columbia-cash-bail-reform-act-of-and-for-other-purposes"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…and a highway to  overcriminalization. We have so many unlawful acts within our criminal  code that we don't even know how many criminal laws there are.\n\nThat is why we need to pass the Count the Crimes to Cut Act of 2025,  which would mandate the creation of a comprehensive inventory, as we  have expressed, of all Federal criminal, statutory, and regulatory…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697206/count-the-crimes-to-cut-act"}, {"senator": "Mike Simpson", "party": "Republican", "sentence": "…through Indian Country and provides over $8 billion to the Indian  Health Service for key healthcare programs, prioritizing Federal  investment where it is needed.\n\nWe need to pass this bill that efficiently invests in our priorities,  supports the programs our communities care about, and reduces the  bureaucratic overreach of the prior administration.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698758/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…trucks, the price of maintenance on trucks,  the price of those trucks then carrying goods to market all over these  United States, if we do not want to see that happen, we need to pass  H.J. Res. 89 and stop this inappropriate waiver by the Biden  administration's EPA.\n\nMadam Speaker, I yield back the balance of my time.", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690434/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-nox-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…stolen  identity, voting in several Federal elections, including the 2024  Presidential election, this is a real problem in Massachusetts right  now. I would argue that we need to pass this legislation to actually  take action.\n\nThe time for delay is over. I hope we can pass this today. I hope the  Senate will take it up immediately to protect the integrity…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699944/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…frankly, I  find it racist to assume that minorities cannot obtain an ID.\n\nWe need to have the guts to stand up and protect our dadgum election,  Mr. Speaker, and that means we need to pass the SAVE America Act.", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700006/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…legislation and get away with it. By the way, they  still might get away with it because while we are passing a bill to  repeal it today, that still has to pass the Senate.\n\nWe need to pass this in the House today. We need to insist that this  provision be included in a must-pass bill going forward so that it  cannot actually be utilized. More than that, we…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696926/repeal-of-senate-notification-requirements-relating-to-legal-process-on-disclosures-of-senate-data"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…preferences, this bill  absolutely provides a comprehensive and safe Federal framework for  stablecoin regulation.\n\nIn order to usher in a new era of blockchain innovation, we need to  pass the GENIUS Act so our regulators can get to work implementing a  comprehensive stablecoin framework.", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693846/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…a result, agencies pulled  down their guidance web pages, and guidance, once again, fell into  darkness, increasing the potential for agency abuse. This is why we  need to, once again, pass the GOOD Act in the House and require  agencies to publish their regulatory guidance in a single, easily  accessible location.\n\nThe American public deserves nothing…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688391/guidance-out-of-darkness-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…destroy our  country, and both sides of the aisle have been guilty of this. This is  not a debatable reality. It is literally occurring.\n\nFor us to survive, we have to act. We need to pass the PAUSE Act. We  need to pause immigration. We need to pass legislation like the bill  that I introduced to preserve a sharia-free America that would prohibit  the entry…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698106/bringing-america-back-to-its-roots"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…but he went on to explain that you could have a  layered CBDC. They are building just that at the Federal Reserve.\n\nWe should completely turn that off, and that is why we need to pass  Representative Emmer's bill. I will talk about that later, but we also  need to protect self-custody, which is the ability for you to move your  money directly person to…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693835/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "John Rose", "party": "Republican", "sentence": "…Mr. Speaker, that the only thing the President  needed to accomplish this was leadership. We heard the last  administration claim time and time again that Congress would need to  pass legislation to secure the border. We heard a blank check would end  the unprecedented illegal immigration happening at our southern border.  Yet, last month, President…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690428/the-first-100-days"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…will not have the program because it will break  the bank.\n\nThis is actually sensible. It is a way that we can do this. We can  make sure our veterans are taken care of. We need to pass the bill that  we were just discussing, which is H.R. 1228.\n\nMr. Speaker, I ask all of my colleagues to support this bill. I yield  back the balance of my time.", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689687/prioritizing-veterans-survivors-act"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…bipartisan support on the House floor with a vote  of 312-108 in February. The bill has the support of many law  enforcement agencies and other entities calling for the need to pass  the bill.\n\nWith passage of this version of the bill, it will be sent to the  President's desk. I am hopeful the President will sign this bill into  law quickly so that…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692345/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…student athletes are being hurt and left  behind.\n\nWe are trying to rectify it, to create a balance, so to speak. That  is why, as a first step on this first-step bill, we need to pass the  rule.\n\nWow. I am going to talk about the rule. That is what I am supposed to  talk about.\n\nI will cede to my colleague, the ranking member of the Rules  Committee,…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697302/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…happening  from the other side. Yet, the American people know, which is why they  elected Donald Trump this year. They know what a responsible budget  means, and that is why we need to pass this.\n\nMr. ARRINGTON. Mr. Speaker, I am prepared to close and I reserve the  balance of my time.\n\nMr. Speaker, I am obsessed with the threat of a looming debt crisis  and…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689910/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…gentlewoman for  yielding me time.\n\nMr. Speaker, the American farmer needs this bill to pass. The  American soldier needs this bill to pass. Our air traffic controllers  need this bill to pass. The men and women who protect us here in this  Capitol and all Federal law enforcement need this bill to pass.\n\nMr. Speaker, I am one of those who represent a lot…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696682/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}]