[{"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…bringing down the price of energy.\n\nThe bottom line is this. The Trump administration needs to follow the  law. They need to reverse their illegal stop work orders, and they need  to start approving legally compliant energy projects--full stop.\n\nFinally, I will say one last thing because something that the Senator  from Rhode Island said bears repeating.…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698581/permitting-reform"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "Ms. BALINT. Mr. Speaker, our Nation is in crisis. We are in a very  dark place. Americans are scared, and they want to see a way forward.  We all need to start with ourselves.\n\nThis morning, I sat, and I lit a candle. I thought about the anguish  and suffering of Representative Melissa Hortman's two children as they  try to cope…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695814/bringing-compassion-to-our-nation"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…to get there, I am going to need some  help. The artificial intelligence folks, the crypto folks, the data  system folks who need massive amounts of electrons, you all need to  start showing up and letting people know that you actually want  permitting reform, and you actually want an administrative and  regulatory process in which electrons are treated…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698558/permitting-reform"}, {"senator": "Tina Smith", "party": "Democrat", "sentence": "…is really not that  much we can do right now.\n\nThat is not acceptable.\n\nBut, colleagues, I can see a path forward. And, look, I want to be  really clear. In my view, we need to start over with the Department of  Homeland Security. I think it should be ripped down to the studs and  that we should start over. But that is not the question for today. That…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699416/9999"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "…The average age of a  first-time home buyer is 40 years old, which is at an all-time high,  and things feel too costly. Opportunity feels too scarce.\n\nI think Americans need to start believing in young people, and that  is exactly why I introduced my K-30 agenda. The legislation takes key  commonsense steps to make a difference, from investing in rural…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699836/empowering-americas-next-generation"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…for her  tireless work in fighting for her children--Eames, Ellison, and  Corryn--and the hard-working Michiganders who now have access to the  essential resources they need to start a family.", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691857/recognizing-tammy-myers"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…like this. We can  enforce immigration laws without this level of cruelty.\n\nNow they are asking us to give them a blank check to continue funding  this. We, as a Congress, need to start doing our jobs and put  commonsense guardrails in place.\n\nMr. Speaker, I urge my colleagues to vote ``no'' on this bill until  there are real guardrails in the way that…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699355/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…see mountains of  aluminum and steel stockpiled, stalled, waiting. Waiting for what? Our  workers and small businesses are paying the price for a trade war that  didn't need to start, and we certainly can't win as a joint economy.\n\nOur region, the Great Lakes region, we share with Canada. What is all  of this commotion for? Tariffs on Canada, our friend--I…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690375/great-lakes-tariffs-and-trade"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…through the course of this treatment, typically,  chemo stops working after about 6 months. You see some tumor reduction,  and then it stops working. At that point, you really need to start  looking for alternatives.\n\nTypically, those alternatives mean you start getting into  experimental trials. Those are no longer available because Trump and  Elon Musk's…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690445/nih-cuts-affecting-cancer-patients"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…health of our oceans impacts  public  health. The stress of crime, gun violence, racism, anti-Semitism,  hatred, and division impact our mental and physical health.\n\nWe need to start thinking holistically about public health. We need  to start thinking holistically about healthcare policy not just being  something that the Committee on Energy and Commerce's…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692205/raising-awareness-about-mens-health"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…Mr. Speaker, you say: How are we going to do this deficit  reduction?\n\nWhere are the spending cuts, and where are the revenue generators?\n\nIt is pretty simple actually. We need to start with the Pentagon and  modernizing the Pentagon. This is what Elon Musk actually signed up to  do with SpaceX and initially with DOGE. He wanted to cut the bloated  defense…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692232/addressing-our-exploding-deficit"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…small businesses, access to capital,  or the appropriate amount of capital, is challenging. H.R. 3174 gives  small American manufacturers access to capital at a level they need to  start or grow their operations.\n\nThis legislation increases the loan limit for small American  manufacturers under the SBA's 7(a) and 504 lending programs from $5  million to…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697220/made-in-america-manufacturing-finance-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…mathematical delusion where people don't  understand that is 12 zeros. They don't see the difference between a  trillion and a billion, but the fact of the matter is, we need to start  telling the truth about the math.\n\nLet's walk through. Let's get a little more geeky. This morning,  there was something called the JOLTS data. It is basically ADP's…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694915/facts-and-math"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…regulations, and  poverty.\n\nI would hope that this latest report from the Legislative Analyst's  Office will be a wake-up call for the politicians in Sacramento that we  need to start doing things differently. We need to have less of a tax  and regulatory burden. We need to support small businesses and workers.  We need to get the budget under control,…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697101/highlighting-the-state-of-california"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…policy, we can make this  budget neutral. That is actually often part of my request for the  leadership, for the committee chairs, for those of us in Ways and  Means, we need to start actually pulling out our calculators and  thinking this through. How do we do these things so we can stabilize  the economy, maximize economic growth,  but not be adding…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691518/truth-telling-with-math-and-facts"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…gentleman for yielding to me.  I thank him for taking this bull by the horns.\n\nMr. Speaker, as I have heard some of the good ol' boys say: It is  cold in here. Maybe we need to start cutting some hogs.\n\nIf you know what that means, you know what that means.\n\nMr. Speaker, I rise to address this body on the issue of stock  trading by Members of Congress.…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691219/stock-trading-ban-for-members-of-congress"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…build on  his good work.\n\nH.R. 4922 is designed to begin to address many of the problems that  stem from the D.C. courts and their refusal to hold criminals  accountable. We need to start with recognizing that 19- to 24-year-olds  shouldn't be treated as youthful offenders.\n\nLocal news has recently reported that the number of juveniles  arrested in Washington,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695563/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…absolutely,  completely squandered, wasted by the State, which not only wasted all  that money, but has now left Californians with an inadequate 911 system  because they need to start over from square A.\n\nThis, Mr. Speaker, is an example of how the failures in Sacramento  that have degraded the quality of life for people throughout our State  are not…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697549/congratulating-eco-clean-solutions"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…this in the House today. We need to insist that this  provision be included in a must-pass bill going forward so that it  cannot actually be utilized. More than that, we need to start  reasserting ourselves as a House, reclaiming our authority under  Article I and giving the American people the representation they  deserve.", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696926/repeal-of-senate-notification-requirements-relating-to-legal-process-on-disclosures-of-senate-data"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…tape is strangling  growth in America.\n\nThis legislation supports President Trump's regulatory rightsizing  agenda and gives our job creators the relief they desperately need to  start, to grow, and to succeed once again.\n\nMr. Speaker, do you want to make things more affordable in America?  Do you want to cut down on overregulation? This is the bill to…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697329/small-business-regulatory-reduction-act-of-2025"}]