[{"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…One of the reasons we passed it in the first place is because what we  know from the data is that when women are at the table in a negotiation  to end conflict, that the negotiations that are agreed to have a better  than 30-percent chance of lasting 15 years or longer because women are  at the table.\n\nIt is an advantage that it gives us because China…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690349/9999"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "Mr. ESPAILLAT. Mr. Speaker, since 2019, I have been proud to call the  gentleman from Illinois both a colleague and a trusted friend.\n\nDuring the build back better negotiations, we stood shoulder to  shoulder to defend immigrant communities when it mattered the most.  That is who Chuy Garcia is. He leads with conviction, courage, and  integrity,…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696778/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…against Vladimir Putin.  It is the reason why I have urged that we regard the Putin regime as a  terrorist organization.\n\nI recognize we are at a critical moment in these negotiations, as  well as in Ukraine's 3-yearlong fight. Actually, it is well longer than  3 years because the invasion first occurred in 2014, not long after  Ukraine gave up its nuclear…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688568/9999"}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "…And, frankly, they are pissed off about  this. They know that this is not how a government should function. They  know that, yes, we need to be able to step up and have negotiations.\n\nBut how can you have negotiations when one Chamber of this Congress  hasn't even shown up to work this week. That is right. When I told them  about how Speaker Johnson…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695926/government-funding"}, {"senator": "Rick Larsen", "party": "Democrat", "sentence": "…Guard through 2029, updates and restructures Coast Guard programs and  policies, and supports the commercial maritime industry. It is the  result of good faith, bipartisan negotiations between Chair Graves and  Chair Ezell, myself, and Ranking Member Carbajal, and it includes  important contributions from members on and off the committee.\n\nThis bill is…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694197/coast-guard-authorization-act-of-2025"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…across the Federal Government. Perhaps more  importantly, the bill is an example of what can be accomplished with a  bipartisan approach to problem solving and good-faith negotiations.\n\nThe Fiscal Responsibility Act directed the Biden administration to  study the possibility of improving digital tools for permitting.  Representatives Johnson and Peters…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697678/epermit-act"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…of some political peril to try to stabilize  the country and be the ballast that everybody needs across America.\n\nWe were trending well. We were trending well. I know how negotiations  go. They go up and down. They go sideways. They stall a bit. People get  a little irritated. But we really were trending well. And I am  legitimately shocked that we are…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695313/cloture-motion"}, {"senator": "Maggie Goodlander", "party": "Democrat", "sentence": "…our neighbors and allies.\n\nIn Congress, I am fighting every single day to ensure that New  Hampshire small businesses get true advocates and a seat at the table  in trade negotiations and discussions that impact our international and  interconnected economy. I am looking for a level playing field for  small businesses to compete and equal access to critical…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687955/small-business-advocacy-improvements-act-of-2025"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…was not  President Trump, he challenged the agreement. When he got elected, he  tore it up. But he saw at some point the wisdom of diplomacy, and he  was engaged in active negotiations about a nonnuclear Iran and was  making progress on those.\n\nThat was objected to by Prime Minister Netanyahu. He was against the  JCPOA that Obama was negotiating and actually,…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693128/motion-to-discharge-sj-res-59"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…Republicans in a deep predicament. The budget       resolution, adopted by the slimmest of margins in the       narrowly divided House, was the delicate product of       negotiations among conservative hard-liners who demand steep       spending cuts and swing-district GOP lawmakers who say they       don't want to slash funding for the health programs…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…support the peace  process that results in the protection of the sovereignty of Ukraine  and its democracy.\n\nWe have reached a Chamberlain or Churchill moment. As cease-fire  negotiations start and stop between Ukraine and Russia, the United  States must stand firm in our support of Ukraine's young democracy.\n\nHistory makes clear that appeasing a bloodthirsty…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690214/supporting-ukraines-independence"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…thank Senators Graham, Murray, and Collins as well as  Representatives Diaz-Balart and Frankel for their partnership in  negotiating the bill. It was one of the toughest negotiations and most  important negotiations I have ever been involved in.\n\nAnd I also want to thank the incredible staff here in the Senate who  worked tirelessly to get this done.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699751/9999"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…3-year reauthorization is  preferable to allowing AGOA to lapse because businesses require  predictability and certainty.\n\nInvestment decisions cannot wait for prolonged negotiations or  uncertainty. A lapse has caused immediate harm to African exporters and  U.S. importers, disrupting supply chains and costing jobs on both  sides.\n\nReauthorization preserves…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698903/agoa-extension-act"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…of Local Union 386  and Business Manager/Secretary-Treasurer for District Council 82. In  this role, he helped the Council remain solvent during the Great  Recession, led negotiations for stronger contracts and worked with a  developer to create a software program to streamline the reporting  process for prevailing wage concerns. He went on to continue…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694749/congratulating-terry-nelson-on-his-retirement-from-ftium"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…But in an  environment like that, where the executive branch refuses its  constitutional duty to faithfully execute the laws, it doesn't make any  sense for us to continue negotiations on a major bipartisan bill.\n\nI want to say, in particular, that Chair Capito has been helpful,  thoughtful, a good partner. All the Environment and Public Works  Committee…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698558/permitting-reform"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "…want to see Congress do our  most basic, essential function, which is spending government dollars  and controlling the power of the purse. Through bipartisan, bicameral  negotiations, led by appropriators, we are turning priorities into  action and putting America first.\n\nMr. Speaker, this package demonstrates the value of Congress by  delivering results…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698632/providing-for-consideration-of-hr-saving-homeowners-from-overregulation-with-exceptional-rinsing-act-providing-for-consideration-of-hr-affordable-housing-over-mandating-efficiency-standards-act-and-providing-for-consideration-of-hr-commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "…today, the government will  continue operating effectively and provide stability for the American  people.\n\nThe path forward in this legislation reflects President Trump's  negotiations and direction to avoid a long-term partial shutdown and  keep the government operating without further disruptions.\n\nAs chairman of the Labor, Health and Human Services,…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699576/consolidated-appropriations-act-2026"}, {"senator": "James Risch", "party": "Republican", "sentence": "…time, the U.S.       Government is not aware of any offset agreement proposed in       connection with this potential sale. Any offset agreement       will be defined in negotiations between the purchaser and the       contractor.\n\nImplementation of this proposed sale will not require the       assignment of any additional U.S. Government or contractor…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692048/arms-sales-notification"}, {"senator": "Adrian Smith", "party": "Republican", "sentence": "…the U.S. As their economy has  succeeded, so has their capacity for trade.\n\nThis was why I was so eager to see the first Trump administration  work to advance bilateral negotiations with Kenya, and I hope to see  continued progress with Kenya and other potential partners.\n\nAs the world works to avoid overreliance on unreliable single  sources, redundant…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698901/agoa-extension-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…time, the U.S. Government is not aware       of any offset agreement proposed in connection with this       potential sale. Any offset agreement will be defined in       negotiations between the purchaser and the contractor.\n\nImplementation of this proposed sale will not require the       assignment of any additional U.S. Government or contractor…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696967/arms-sales-notification"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…going to say this in a  second--Mr. McGovern is ready to close, and I am ready to close. I  reserve the balance of my time.\n\nMr. Speaker, for months, bipartisan, bicameral negotiations and  collaboration have been underway. They have yielded consistent,  consecutive appropriations products that deliver upon the Nation's  highest priorities.\n\nI applaud…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699311/providing-for-consideration-of-hr-consolidated-appropriations-act-and-providing-for-consideration-of-hr-department-of-homeland-security-appropriations-act-and-for-other-purposes"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…operational, and other preparations related to participation       by the United States in international telecommunications and       information policy conferences and negotiations;\n\n``(6) ensure NTIA representation with respect to       international telecommunications and information policy       meetings and the activities related to preparation…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690257/national-telecommunications-and-information-administration-reauthorization-act-of-2025"}, {"senator": "James Risch", "party": "Republican", "sentence": "…time, the U.S. government is not       aware of any offset agreement proposed in connection with       this potential sale. Any offset agreement will be defined in       negotiations between the purchaser and the contractor.\n\nImplementation of this proposed sale will not require the       assignment of any additional U.S. government or contractor…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696549/arms-sales-notification"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…Deadline.--\n\n(A) Date.--The Secretary shall finalize the agreement under       paragraph (1) by not later than 60 days after the date on       which the Secretary enters negotiations with the National       Academies with respect to such agreement.\n\n(B) Report; briefings.--If the Secretary fails to satisfy       the requirement under subparagraph (A),…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690650/aces-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…Deadline.--\n\n(A) Date.--The Secretary shall finalize the agreement under       paragraph (1) by not later than 60 days after the date on       which the Secretary enters negotiations with the National       Academies with respect to such agreement.\n\n(B) Report; briefings.--If the Secretary fails to satisfy       the requirement under subparagraph (A),…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693894/aces-act-of-2025"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…the authority of the Small Business  Administration's august Office of Advocacy to examine international  economic data and represent small business interests in trade  negotiations, ensuring that our small business people are not left  behind.\n\nAmerica, as we know it, can't exist without small businesses, and  this bill will give them a leg up to make…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687909/doe-and-sba-research-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…time, the U.S. Government is not       aware of any offset agreement proposed in connection with       this potential sale. Any offset agreement will be defined in       negotiations between the purchaser and the contractor.\n\nImplementation of this proposed sale will require the       assignment of up to two additional U.S. Government and up to…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688927/arms-sales-notification"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…found it hard to believe. It  sounds like a tax provision that you would be more likely to hear  Democrat legislators want.\n\nIn any event, I think we have to follow the negotiations that are  going on, and we have to see whether within the Republican Party we  wind up with a product to encourage more work, encourage families, or  whether we wind up…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690921/big-beautiful-bill"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…Americans  who invest in China to help them defeat us, whether militarily or in  the race for AI.\n\n(Mr. MORENO assumed the Chair.)\n\nSo I am glad that, at this point in the negotiations, the House and  the Senate are prioritizing this provision in the final version of this  year's NDAA. If we do not address outbound investment transparency,  then we are…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697555/china"}, {"senator": "Claudia Tenney", "party": "Republican", "sentence": "…club, for his entire 29-year career.  This included  serving as the tactical unit representative to the executive board for  over 20 years and as a member of the contract negotiations team, the  scholarship committee, and the house committee.\n\nOfficer Mazurkiewicz devoted 29 years to serving and protecting the  Rochester community and was looking forward…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697617/officer-anthony-mazurkiewicz-memorial-post-office-building"}]