[{"senator": "Bobby Scott", "party": "Democrat", "sentence": "…Government. The justified fear of losing critical Federal funds would  almost assuredly lead schools to eye any well-meaning donations  skeptically, sowing distrust in our neighbors.\n\nNow note, there is no limit to this level of funding. It doesn't say  contributions over $1,000 or over $10,000. It is any contribution. It  must be said that there is…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697533/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…hope.\n\nEvery day across our State, people did extraordinary things. Ordinary  people did extraordinary things. They drove other kids to school. They  brought food to their neighbors. They showed up for small businesses.  Teachers and other school leaders stood up and protected their  students, organized food drives and computer drives.\n\nAttorneys across…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700059/9999"}, {"senator": "Mike Levin", "party": "Democrat", "sentence": "…exemplifies the very best of the 49th  Congressional District.\n\nJust as importantly, John's work brings people together. His  restaurants serve as welcoming gathering places where neighbors,  families, and visitors connect over memorable meals and shared  experiences. Through great food, thoughtful drinks, and warm  hospitality, John has helped strengthen the…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699850/recognizing-john-resnick-as-january-2026-constituent-of-the-month"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…service to our communities.\n\nEvery day across our country and in my home State, law enforcement  officers wake up, put on the badge, and commit themselves to protecting  our neighbors. It is a calling that demands bravery, sacrifice, and  unwavering dedication.\n\nThis week, we remember those who answered the call and never returned  home.\n\nThis year, three…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691300/national-police-week"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…tirelessly to put out the fires and minimize  damage, will not be forgotten.\n\nWhile the fires caused great destruction and devastation, the  strength and resilience of our neighbors coming together for our  communities were on full display.\n\nMr. Speaker, 1 year later, communities across Los Angeles County are  continuing to work toward rebuilding their…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698644/recognizing-sister-mary-jesus-ochoa-on-her-centennial-birthday"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…nonprofit that has hand-delivered hundreds of  thousands of warm, nutritious meals to hungry people across Eugene and  Springfield. She also created Free Little Pantries, giving neighbors a  way to share food directly with those in need.\n\nDuring COVID, she launched Waste to Taste, a free, no-questions-asked  grocery store that now serves more than a thousand…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695683/recognizing-jennifer-denson"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…congressional district.\n\nThese are workers that protect our food, our water, our air, our  skies, and care for our veterans, our children, and our seniors. They  are our neighbors.\n\nMany people in this Chamber know that a union may have helped them  achieve the dream that they have of serving, as well as being able to  take care of their families.…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697997/protect-americas-workforce-act"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…church formed from strong community family  ties and has remained steadfastly community focused since.\n\nFBCM remains a vital part of our district today by partnering with  neighbors and local organizations to fulfill local needs through  service projects, food and supply drives, youth programs, and many  other community-centered initiatives. Through…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696034/recognizing-the-first-baptist-church-of-merrifield-on-their-155th-anniversary"}, {"senator": "Andrea Salinas", "party": "Democrat", "sentence": "…lifesaving mental and behavioral health  care, and the mental health crisis will only get worse.\n\nAs a founding member of the Bipartisan Rural Health Caucus, I know  that our rural neighbors often travel long distances to access care.\n\nI have a bill, the Home-Based Telemental Health Care Act, that would  expand access to remote mental health and substance use…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695302/mental-health-of-farmers"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…unwavering commitment to the cause.\n\nToday, we celebrate Richard's altruistic spirit and dedication as a  platelet donor. He is a shining example of what it means to serve one's  neighbors and community.                Honoring the Life of Chandrashekar Namagondlu\n\nMr. SUBRAMANYAM. Mr. Speaker, I rise today to honor the life and  memory of Chandrashekar Namagondlu.…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689774/congratulating-chief-keith-johnson-on-his-retirement"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…aren't just statistics. These are real people I see when I go  home to my district. These are children, seniors, working parents, and  people with disabilities. These are neighbors. These are people who I  grew up with in church. These are people I went to school with. These  people depend on these programs to survive, not because they want to  but…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692812/providing-for-consideration-of-hr-military-construction-veterans-affairs-and-related-agencies-appropriations-act-providing-for-consideration-of-hr-special-interest-alien-reporting-act-of-providing-for-consideration-of-hr-jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-and-providing-for-consideration-of-h-res-condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…hospitals  operating on thin margins will close, medical debt will skyrocket, and  kids across the country will suffer.\n\nAmericans on Medicaid are your grandparents, your neighbors, your  friends, and they are at risk because of these cuts. Virginians, in  particular, are vulnerable because even if 1 percent of Federal funding  of Medicaid is cut, 600,000…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690296/medicaid-is-americas-healthcare-safety-net"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…members.\n\nI have spoken with people who demonstrate extraordinary bravery and  step into the line of duty as wildland firefighters, sacrificing their  safety to protect their neighbors and their communities.\n\nThe 2020 Labor Day fires were the most destructive in our State's  history. Mr. Speaker, 1.4 million acres burned. More than 4,000 homes  were destroyed,…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692450/wildfires-in-oregon"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…Lewis joke that it is risky to be America's enemy, but it can be fatal  to be its friend.\n\n``Leaving China aside, Mr. Trump's justification for this economic  assault on the neighbors makes no sense. While House Press Secretary  Karoline Leavitt said they have `enabled illegal drugs to pour into  America,' but drugs have flowed into the U.S. for decades…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…Mortgages are  still out of reach for far too many families. Property taxes and  repairs are stretching household budgets. Homelessness programs that  protect our most vulnerable neighbors must be preserved.\n\nMr. Speaker, we have to get serious about housing and focus our  attention on lowering the cost of housing and keeping housing  accessible to everyone.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699021/rising-housing-costs"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…outstanding  contributions that Mr. Sean Arnold has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood victims, he helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those who needed help. A truly selfless…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691984/recognizing-sean-arnold"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…sovereign, self-sufficient  communities. The citizen of the classical republic had no need for  cheap trinkets, fashion, and sweatshops halfway across the globe. He  and his neighbors were the ones building their homes, growing their own  food, and when necessary, taking up arms to provide for their own  defense. People who depend on others for essential…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690533/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…support for the law enforcement officers, from Utah to D.C., who put  their lives on the line every single day.\n\nThese officers aren't just responding to emergencies. They are  neighbors, trusted members of our communities, and our role models.\n\nToday, I also want to honor a fallen hero from my home State of Utah,  Sergeant Bill Hooser of the Santaquin Police…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691165/events-this-week"}, {"senator": "Darrell Issa", "party": "Republican", "sentence": "…life matters. If the President of the United States cares  about his 5,000 or 500 or 5 or 1 enough to use the power of the  executive office to get the right thing out of our neighbors to the  north and the south, then I want to stand with him. I would never take  away a tool being used to save even one life, much less hundreds of  thousands of lives and…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699964/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…the  backbone of our economy; driving innovation, creating jobs, and  strengthening communities.\n\nIn today's world, small businesses face competition not just from  their neighbors and other States, but from businesses and corporations  around the globe. These businesses face challenges that larger  corporations are often better equipped to navigate.…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687909/doe-and-sba-research-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…outstanding  contributions that Ms. Carol Noble has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood victims, she helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those who needed help. A truly selfless…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690136/recognizing-carol-noble"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…outstanding  contributions that Tyrone Young has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood victims, he helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those who needed help. A truly selfless…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692468/recognizing-tyrone-young"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…Dayton Depot has been a center of connection, culture,  and community spirit. Since its founding in 1875, the South Dayton  Depot has welcomed generations of travelers and neighbors, serving  first as a vital hub for freight and passenger service, and now as a  museum where history is preserved for generations to come.\n\nThe South Dayton Depot has not…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694965/recognizing-the-south-dayton-depot-on-its-150th-anniversary"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…celebration, features  costumed re-enactments, kids' activities, and artillery demonstrations.\n\nFort Laramie continues to be a small town with big character. Friends  and neighbors pride themselves on caring for each other. Visitors are  greeted with Wyoming hospitality while experiencing Main Street's  authentic charm. The area also offers the opportunity…", "date": "2025-07-31", "source_url": "https://justfacts.votesmart.org/public-statement/1694485/100th-anniversary-of-fort-laramie-wyoming"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…of the eleventh month, which marked the end of World War I.\n\nThe holiday is often marked by tributes and other ceremonies to show  our gratitude to our family, friends, and neighbors who have served.\n\nIn honor of Veterans Day, my office typically hosts a Veterans  History Project event to collect stories from Iowa veterans and submit  those stories to…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696569/veterans-day"}, {"senator": "Michael Cloud", "party": "Republican", "sentence": "…resilience that defines Texas athletics and  Texas values.\n\nIt wasn't just one team on the field--it was an entire community  behind them. Coaches, families, classmates, and neighbors, each playing  a role. As one local paper put it, ``lt took all of Ganado.'' And it  did.\n\nIn a time when the spotlight so often falls on the wrong examples,  these young…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693499/congratulating-the-ganado-maidens-softball-team"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…affiliation. They were only concerned about those who had the needs  caused by the devastating flood. So they simply rolled up their  sleeves, and they simply pulled together, neighbors helping neighbors.  And, of course, that is the Iowa way.\n\nHistory tells us how important it is for elected leaders to govern by  virtue. At the Virginia ratifying convention,…", "date": "2025-10-20", "source_url": "https://justfacts.votesmart.org/public-statement/1696289/national-character-counts-week"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…outstanding  contributions that Mr. Mike Phillips has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood victims, he helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those who needed help. A truly selfless…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691726/recognizing-mike-phillips"}, {"senator": "Barry Moore", "party": "Republican", "sentence": "…other countries are beginning to take a  stand against those in the medical community who insist on these being  lifesaving procedures. They should be questioned. Even our neighbors to  the North have acted responsibly.\n\nIn Canada, all genital surgeries are only available to children who  are 18 years of age or older. This policy aligns with the World…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698346/protect-childrens-innocence-act"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…who will retire on December 21, 2025, after more than four decades of  serving his community.\n\nHooty began his career in 1985 as a firefighter, answering the call  when his neighbors needed him most. In 2003, he became director of  Hancock Emergency Management Agency, a role he has carried with steady  leadership for 22 years.\n\nDuring that time, he guided…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696876/recognizing-brian-hooty-adam"}]