[{"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…National Police, continue to launch heavily armed  attacks on ports, highways, critical infrastructure, police stations,  courthouses, prisons, hospitals, businesses, and neighborhoods. They  have committed gruesome massacres against senior citizens and, for more  than a year now, have dictated Haiti's security and political tempo.\n\nNot everyone in Haiti…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694816/haiti-criminal-collusion-transparency-act-of-2025"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Garcia: As Mayor and       Chief Executive Officer of the District of Columbia, I am       proud of the work we have accomplished to invest in our       people, strengthen our neighborhoods, and drive down crime.       Building on this progress, my Administration established the       Safe and Beautiful Emergency Operations Center to coordinate       public…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696979/district-of-columbia-cash-bail-reform-act-of-2025"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…energy security; reduce reliance on dirty  fuels; create good-paying jobs in engineering, drilling, and  maintenance; and lower energy costs for industry, public facilities,  neighborhoods, and all kinds of companies.\n\nGeothermal energy has a small land footprint. It can even be co- located with other renewables or energy-hungry data centers, which so  need…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694099/trumps-reckless-tariff-policies"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…audits in a row.\n\nAs recently as 2023, the Pentagon could not even account for 62  percent of its assets--a trillion dollars, while the President is  deploying troops in our neighborhoods and threatening to go to war  against American cities.\n\nIt seems my colleagues can always find time and money for war, but  when it comes to clean water, when it comes…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695276/taxing-excessive-ceo-pay"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "Mr. SCHIFF. Mr. President, just more than a year ago, Los Angeles  County faced one of the most destructive disasters in the Nation's  history. Entire neighborhoods torched and torn apart by wildfires, the  magnitude of which we haven't seen on suburban streets of the  Southland. The loss of loved ones, of homes, of businesses, the…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700133/climate-change"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Garcia: As Mayor and       Chief Executive Officer of the District of Columbia, I am       proud of the work we have accomplished to invest in our       people, strengthen our neighborhoods, and drive down crime.       Building on this progress, my Administration established the       Safe and Beautiful Emergency Operations Center to coordinate       public…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695596/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…called to public service as a police officer. When he went to  work, he joined the Metropolitan Police Department in Washington, D.C.,  and was sent to some of the toughest neighborhoods in Washington, where  I had actually been a prosecutor many years before.\n\nOn that tragic day, he was one of the 140 officers who were attacked  and injured. Fortunately,…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698549/january-6-attack"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "…agree and join that dissent. These raids are not about law and  order. They are about targeting immigrants because of the color of  their skin, the language they speak, the neighborhoods they live in,  and the jobs they hold. I dissent.\n\nICE is not chasing criminals. It is chasing families. I dissent.\n\nNationwide, 71 percent of those in ICE custody at the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695282/scotus-immigration-raids-action"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize the City of  Lakewood, Colorado, for its induction into the All-America City Hall of  Fame for its Sustainable Neighborhoods Program.\n\nLakewood's Sustainable Neighborhoods program has brought residents  together to promote water conservation, address food access issues, and  reduce waste and…", "date": "2025-08-08", "source_url": "https://justfacts.votesmart.org/public-statement/1694723/recognizing-the-city-of-lakewood"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…about the District of Columbia, know  very little outside of perhaps their walk from their apartment in Navy  Yard to this Capitol complex. They don't know the history,  neighborhoods, communities, and challenges that folks in the District  are facing.\n\nWhile my colleagues espouse the virtues of self-governance, they  simultaneously advocate for bills…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696978/district-of-columbia-cash-bail-reform-act-of-2025"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "…loans, and grocery costs skyrocket, all to  give the richest Americans more tax breaks.\n\nI heard how the President's cancellation of community safety funding  will make our neighborhoods less safe, and I heard how his attacks on  unions at the VA and FEMA will ripple right into the private sector,  hurting working men and women everywhere.\n\nDonald Trump's…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694808/northeast-ohioans-are-getting-squeezed"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…of the NAACP,  including the lifetime achievement of Dr. Hazel Dukes, who recently  passed away, but there are local heroes, too, who do exceptional work  in our hometown neighborhoods.\n\nLet me recognize some of these key branch leaders:\n\nIn Co-Op City, Leslie Peterson and Brenda Brown;\n\nIn New Rochelle, Aisha Cook and Jareca Lee;\n\nIn Yonkers, Kisha Skipper…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693011/recognizing-local-naacp-leaders"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…and access will make a  difference. Healthcare is more than a personal issue; it is a community  issue. I know how deeply it affects the strengths and prosperity of our  neighborhoods, especially when it comes to historically underserved  populations.\n\nIt is no secret that systemic racism negatively impacts health  outcomes for Black Americans. That…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692206/raising-awareness-about-mens-health"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…For weeks, Floridians have been calling my office in  tears. They are looking at their budgets with panic while President  Trump rips away their healthcare, sends ICE to neighborhoods, deploys  soldiers to new global conflicts, and floods billionaire and  megacorporations with free money.\n\nPeople cannot pay their bills, and Republicans here in Washington,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698835/americans-in-state-of-desperation"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…work of New Life Centers helps strengthen our  community through faith, hope, and healing. I look forward to many more  years of partnerships to change the lives and change neighborhoods.                 Recognizing Otis P. Graves Elementary School\n\nMr. GARCIA of Illinois. Mr. Speaker, I rise today with great pride to  celebrate the 100th anniversary of…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697323/9999"}, {"senator": "Ted Budd", "party": "Republican", "sentence": "…are being held accountable for their role in this  dangerous drug network.\n\nThese results are not just statistics. They represent lives saved,  overdoses prevented, and neighborhoods that can breathe easier knowing  that they are a lot safer.\n\nIn a region still working to recover from the devastation caused by  Hurricane Helene, dismantling this trafficking…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693099/operation-uptown-funk"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…engaged citizenry, Port Richey has held  tightly to its roots while embracing the promise of the future. Its  waterfront parks, thriving local businesses, and close-knit  neighborhoods speak to a community that values tradition,  collaboration, and progress.\n\nThroughout its history, Port Richey has overcome challenges with  strength and unity, guided…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691599/recognizing-100th-anniversary-of-the-city-of-port-richey-fl"}, {"senator": "Pat Ryan", "party": "Republican", "sentence": "…will continue to serve the Kingston community in an even greater  capacity than before.\n\nI thank Elder Childs for his continued dedication to and love of our  neighbors and neighborhoods. I thank him personally for his mentorship  and advice to me in serving in this position. I congratulate him on his  recent promotion and a lifetime of service to our community.", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694021/recognizing-cornwall-cleanup-crew"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…floor.  We should be able to agree that, if someone is trying to dramatically  jack up the cost of pharmaceuticals on our individual constituents and  on the families in our neighborhoods and is destroying our independent  pharmacies, we should all be able to agree that that is  anticompetitive. That has got to stop. We should be able to do that.\n\nListen,…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697814/9999"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…the country into  Nazi Germany.\n\nNew York Governor Kathy Hochul accused ICE of ``terrorizing people.''\n\nPennsylvania Governor Josh Shapiro claimed ICE officers ``make our  neighborhoods less safe.''\n\nMinnesota Lieutenant Governor Peggy Flanagan said ICE officers caused  ``chaos and terror.''\n\nSenator Chuck Schumer declared that ICE does not belong in our…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…instead, the brain trust of some of  these folks--okay, I accept the tonal quality of some of the folks out  of the White House isn't warm and cuddly, but do you go around  neighborhoods, offices, and stick Nazi signs on their cars?\n\nMy wife drives a Tesla. We bought it a couple years ago. It is funny,  at that time she got teased a bit: Oh, now you are…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689381/us-borrows-billion-a-day"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…labor, are already rising.  Factories that make or buy equipment will be making and buying a lot  more of it.\n\nNo one unable to work will lose their Medicaid benefits. Their  neighborhoods will be safer as criminal illegals are deported and not  allowed to return. Their energy bills will be lower.\n\nIf all this relief creates just average economic growth,…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693629/democrats-big-mistake"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…preferred southern route of this pipeline passes under the Sloan Canyon  National Conservation Area. Compared to other alternatives, this  alignment minimizes impacts on neighborhoods and is estimated to save  taxpayers nearly $200 million.\n\nH.R. 972 authorizes the preferred route for this pipeline through the  national conservation area. This bill also…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698162/sloan-canyon-conservation-and-lateral-pipeline-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…relating to title clearing and       home retention efforts of heirs' property and which target       services to low- and moderate-income persons or provide       services in neighborhoods that have a high concentration of       low- and moderate-income persons; and\n\n(D) by conducting other activities that assist individuals       to clear title with respect…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…ceremonial events.\n\n(iii) High-density urban areas with limited physical       security measures such as pedestrianized city centers,       commercial districts, residential neighborhoods, public       parks, recreational areas, educational institutions, and       tourist destinations.\n\n(C) A comprehensive summary of actions taken by the       Department…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696768/department-of-homeland-security-vehicular-terrorism-prevention-and-mitigation-act-of-2025"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…reinvested. He proved that American  manufacturing can still thrive, that ``Made in Bucks County'' still  matters, and that a business rooted in values can lift entire  neighborhoods.\n\nMike's commitment to the community doesn't stop at the manufacturing  doors. Whether it's stepping up in times of need, supporting local  nonprofits, or quietly funding…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690252/recognizing-michael-j-mabin-jr-50-years-of-life-leadership-and-service"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…institutions thrive, and a strong sense of community  binds residents together.\n\nBrooksville's history is reflected not only in its historic landmarks  and longstanding neighborhoods, but also in the character of its  people--those who have worked to build local businesses, serve in  public office, educate future generations, and contribute to the…", "date": "2026-02-20", "source_url": "https://justfacts.votesmart.org/public-statement/1700091/recognizing-the-city-of-brooksville"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…not let him defend the United States of America.\n\nWe are not talking about street gangs. They are militarized threats.  They have taken over entire apartment complexes and neighborhoods in  the United States.\n\nMy colleagues say this resolution is just about putting Congress on  record, so let's put Congress on record.\n\nIf you stand with protecting the…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698249/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…stronger, more resilient, and more  compassionate.\n\nWhen we give our time and our efforts to others, we foster a sense of  unity and purpose. We bridge divides, strengthen neighborhoods, and  inspire future generations to embrace the spirit of service.\n\nFrom local charities to national organizations, volunteers are the  heartbeat of our communities, demonstrating…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689399/national-volunteer-month"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…to catch and convict the very worst  kinds of criminals--those who target and abuse children.\n\nIt requires building strong police departments with officers who know  the neighborhoods and the people they protect, like our bill to send  local recruits to police academies if they agree to serve in the  precincts in their own communities.\n\nIt requires wisdom…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696003/unanimous-consent-requests"}]