[{"senator": "Kevin Mullin", "party": "Democrat", "sentence": "…me just emphasize that Democrats believe in an economy that works  for all people. Under the last administration, we passed legislation  that created nearly half a million new jobs in just 2 years. The  Federal Government set standards that will save money.\n\nMr. Speaker, I conclude by saying that Americans will save $1  trillion on their energy bills…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689261/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…how the bill was designed.\n\nThe extra tax breaks went to the States that would be energy  transition States, and there has been an explosion by the hundreds of  thousands of new jobs. And the Republican bill would make the United  States the laggard, not the leader in innovation.\n\nAlready China is investing four times more than the United States in  renewable…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692644/one-big-beautiful-bill"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…that  will strengthen the SBA and work to broaden services available to small  businesses. These firms employ roughly half of the private workforce,  create two-thirds of all new jobs, and generate almost half of our  Nation's economic activity.\n\nThese aren't just statistics. They are the foundation of our local  economies, providing essential services,…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691730/connecting-small-businesses-with-career-and-technical-education-graduates-act-of-2025"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…tradition of putting politics aside to deliver for our Nation's small  business employers.\n\nSmall businesses employ roughly half of the private workforce, create  the majority of new jobs, drive innovation, and generate almost half of  our Nation's economic activity. They are the heart and soul of our  communities. Whether it is a neighborhood childcare center,…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687932/assisting-small-businesses-not-fraudsters-act"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…generate 127 million new additional visitors over the next  decade and $478 billion in additional revenue, which translates into  $55 billion in tax revenue, creating 140,000 new jobs.\n\nWith upcoming marquee events like the Ryder Cup, the FIFA World Cup,  and the Summer Olympics, we need to be investing in systems to make the  experience seamless. This…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691775/growing-travel-industry-jobs"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Foreign direct investment from nonadversarial Nations can be used to  grow critical sectors important for our economic success and national  security including by creating new jobs in our Nation's manufacturing  sector.\n\nOnce the envy of the world, our manufacturing base has faced steady  headwinds for the last several decades. Our Nation's share of…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692696/global-investment-in-american-jobs-act-of-2025"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…Communist China, Mexico, and every other low-wage  haven in the world.\n\nThis decision delays critical upgrades, injects uncertainty into  local production lines, undermines new jobs being created, and  undermines every worker this Nation depends upon.\n\nThe Department of Commerce should release and restore these job- creating dollars immediately. Congress…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698082/funding-manufacturing-extension-partnership-offices"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…tax rebates and savings for appliances on electric bills.\n\nThis has led to a major manufacturing boom across the country of over  750 clean-energy projects and over 400,000 new jobs created all across  America, many in Republican districts.\n\nSince the Trump administration came in and started these illegal  shutdowns and threatened new taxes through tariffs,…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689260/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…agricultural region in grain  drying. It is so expensive when we have to dry corn, soybeans, and so  forth. The agricultural community uses huge amounts of energy.\n\nLet's create new jobs. Let's lower the consumer's energy bills. Let's  strengthen America's energy security. Geothermal energy holds the  potential to achieve all of those goals. Let's get it done…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694099/trumps-reckless-tariff-policies"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…will expand services available to  our country's 36 million small businesses.\n\nThese businesses are crucial to our economy and national security,  creating two-thirds of all new jobs, employing half the private-sector  workforce, and generating almost half of our Nation's economic  activity.\n\nDespite forming the bedrock of our local communities, small…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697219/made-in-america-manufacturing-finance-act"}, {"senator": "Kevin Mullin", "party": "Democrat", "sentence": "…no sense to create chaos for automakers that already  agreed to meet these standards with investments in domestic EV  production and manufacturing that created over 200,000 new jobs and  nearly $200 billion in private investment.\n\nIf they really cared about reducing costs for American families,  Republicans would focus on reversing Trump's reckless tariffs…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690436/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-nox-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…our military; military recruitment up;  defending religious liberty; sending gang members back to their own  home countries; standing up for American workers; adding 345,000 new  jobs; securing billions of dollars in new investments in the United  States.\n\nThe golden age of American prosperity is indeed here. As exciting as  the first 100 days of President…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690430/the-first-100-days"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…American  economy, and that is an absolute truth. Small businesses make up 99  percent of U.S. employers, and they are the driving force behind the  creation of a majority of new jobs.\n\nThe entrepreneurs leading these companies are building something new,  taking real risks, and driving growth in communities across the Nation,  but too often, they can't…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697190/developing-and-empowering-our-aspiring-leaders-act-of-2025"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…were initially displaced when the failed  policies of the politicians of this town sent their jobs overseas--the  towns that I grew up in--and then when they were looking for new jobs,  their wages were suppressed, and their jobs went to illegal immigrants.  The Democrats have never understood that. They have never understood  that Americans were upset…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700065/9999"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…aren't victims. For years, American  families have struggled as the flood of illegal labor has taken their  jobs and suppressed their wages.\n\nDuring Biden's 4 years, most new jobs were taken by foreigners, and  Americans' real wages declined. Just 6 months into the Trump  administration, most new jobs are now taken by Americans, and real  wages are…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694126/sorry-not-sorry-for-immigration-enforcement"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…manufacturing purchases. That means that manufacturers of  every variety will add equipment to their plants, increasing the  productivity and the pay of existing workers, and adding new jobs to  make that equipment.\n\nBy opening America's vast energy resources, domestic production is  about to rev up, a declaration of American energy independence that  will echo…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693629/democrats-big-mistake"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…There was an explosion after election day of people ready, willing,  and able to invest in America. We have seen unprecedented investment  come in from overseas, bringing new jobs, new opportunities, and new  future creation here to the United States since election day. That will  continue because that is what President Trump campaigned on. That is…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688464/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing-and-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…that a well- governed State would allow them.\n\nSo I would hope that if anything could be a wake-up call, then this  latest stunning report with this very round number of zero new jobs  will serve as that wake-up call that can catalyze and motivate some  real reform in California.                                SpaceX Rescue\n\nMr. KILEY of California. Mr.…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689211/protecting-medicaid-for-californians"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…find  additional opportunities if a solicitation on which they made an offer  is canceled so that they can go after these opportunities.\n\nSmall businesses create most of the new jobs in this country. In  fact, in Missouri's Fourth Congressional District and in rural  communities across America, they are the lifeline and fabric of our  communities, but…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691762/transparency-and-predictability-in-small-business-opportunities-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…lands outright, creating long-term certainty for this project.\n\nConstructing this road and allowing access to the Ambler Mining  District is expected to create thousands of new jobs and produce $1.1  billion of revenue for Alaska. Road construction alone will create more  than 350 jobs, creating economic opportunity desperately needed in  rural Alaska.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694898/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…emerging growth companies, or EGCs, to encourage smaller companies to  go public here right in the United States.\n\nThe JOBS Act didn't expand just that opportunity, it created new  jobs. In the 4 years after that change, EGCs made up 90 percent of our  initial public offerings. Moreover, it created 82,000 new jobs, new  careers, right here in the U.S.\n\nI…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692761/encouraging-local-emerging-ventures-and-economic-growth-act-of-2025"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…destruction and that other, better industries will arise to  take their place of the ones that were lost. It is true that some of  the workers in Springfield went on to find new jobs, but they were  often much worse than the ones that they had before. Five years after  Zenith shut down, laid-off workers saw an average pay cut of more than  10 percent.…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690533/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "John Rose", "party": "Republican", "sentence": "…respected  on the world stage. Mr. Speaker, it is clear he has delivered on that  promise, as well.\n\nThere are many, many wins I could point to. Just last month, 228,000  new jobs were added to the U.S. economy. Prices fell for the first time  since May 2020. The Border Patrol reported a 94 percent drop in illegal  immigrant encounters at our southern…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690428/the-first-100-days"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…Electric to boost  domestic manufacturing and energy infrastructure. Electronics company  ABB is investing $80 million in Selmer, TN, to expand manufacturing and  to create new jobs.\n\nLater today, I am going to be joining President Trump at the White  House as he welcomes many CEOs of these companies that are making these  investments in our Nation.…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690548/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Steve Daines", "party": "Republican", "sentence": "…affordable, reliable,  and clean baseload power in Montana and across the United States. For  years, I have worked with my colleagues to grow our hydropower  portfolio in creating new jobs, lowering prices, and strengthening our  grid.\n\nI want to thank Senator Fetterman for joining me as my colead to push  this bill across the finish line.\n\nOur bipartisan bill,…", "date": "2025-07-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694335/requiring-the-federal-energy-regulatory-commission-to-extend-the-time-period-during-which-licensees-are-required-to-commence-construction-of-certain-hydropower-projects"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…see  the punch line in the job growth numbers?\n\nThe U.S. economy added approximately 140,000 jobs; the market added  181,000. It is absolutely terrific. A dominance of the new jobs that  were created are in healthcare. The majority of spending in healthcare  comes  through government. Does anyone see the circular problem of what we are  talking about?…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699988/math-is-such-an-anathema"}]