[{"senator": "Bobby Scott", "party": "Democrat", "sentence": "…and 119th Congresses respectfully.\n\nThe Winter 2024 edition of Public Service Review comes at a pivotal  moment as we are in the early months of a new Congress and a new  administration. In this time of transition, elevating the importance of  public service is critical. The contributors to this edition, including  senior public servants and participants…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692884/stennis-center-for-public-service-winter-2024-public-service-review"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "Mr. LATIMER. Mr. Speaker, the new administration, as it  indiscriminately cuts services, has announced that it will not keep the  Social Security Administration's hearing office in White Plains, New  York. Closing this…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687931/white-plains-social-security-hearing-office-closure"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…Republicans, in addition  to Democrats, looking out for them, not just lipservice about lowering  costs.\n\nThat is why it has been so disheartening to watch Elon Musk and the  new administration. They have no plan, no interest in addressing the  problems. Instead, they continue to double down on chaos and confusion.\n\nLast night, we heard from the President. He…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688544/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…anything except begin a process.\n\nMr. Speaker, as to both of these CRAs, the effect is not only to  erase what was done under the Biden administration but prohibit the new  administration from adopting any consumer protection. That is because  my colleagues on the other side of the aisle want zero consumer  protection and the Trump administration to have…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689952/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…of the House of Representatives out of our Chamber, drove  Members of the Senate out of their Chamber, and attempted to overthrow  a Presidential election.\n\nNow, the new administration has seen fit to pardon more than 1,500  rioters and violent insurrectionists who attempted to overthrow our  constitutional form of government on that day, and they succeeded…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691242/leosa-reform-act"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…to go far back--well, actually,  maybe you do have to go far back several Energy Secretaries--to look at  what happens when it comes to Hanford cleanup. Every time a new  administration comes in, somebody looks at the amount of money that it  takes to clean up nuclear waste that has been stored in tanks and says,  ``This costs too much. We ought to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695342/hanford-site-cleanup"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Committee has sole jurisdiction. Yet, contrary to       the statute, the HHS FY 2026 Budget in Brief proposes to       eliminate SAMHSA and move some of its functions to a new       Administration for a Healthy America (AHA). If this becomes       reality, there will no longer be a federal agency whose       specific purpose, function, and expertise is to address…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692341/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…the Trump administration has unilaterally  paused Federal food assistance and canceled shipments to food banks. We  are feeling it. By withholding food and funds, the new administration  has turned its back on the American people.\n\nThey feel the rising prices, and they feel the harm. Food banks in  Ohio and across our Nation are seeing shelves go bare,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690437/empty-shelves-at-food-banks"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…people, and lots of freshwater.\n\nWe must fully fund the GLRI. Every dollar brings back four to our  economy, and that just makes common sense.\n\nLet me be clear to this new administration: Keep your hands off our  lakes. We will not stand by while shortsighted proposals gut the  programs that have protected our water, our health, and our jobs. I  would…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690375/great-lakes-tariffs-and-trade"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…global trade war he launched last week.\n\nRepublicans promised that inflation would go down and the stock  market would thrive under his leadership, but 4 months into the new  administration, that has proven to be false.\n\nWhether you like the Consumer Financial Protection Bureau or not, it  just doesn't make good sense to hike bank fees on 23 million  hardworking…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689845/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…is that the Dow Jones is on track  for its worst April since 1932.\n\nThe truth is, Donald Trump's Presidency is no golden age; it is a  disaster--the worst start to a new administration in modern times.\n\nAmericans are already fed up. Americans are already beginning to see  that Donald Trump has betrayed them, that Donald Trump's campaign  promises before…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690262/trump-administration-first-100-days"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…our words but more importantly with our actions.  Let's restore all of the funding, the hundreds of millions of dollars  that have been cut or that face cuts by this new administration.\n\nMr. Speaker, I am delighted to hear the distinguished chairman of the  Judiciary Committee denounce the assault, the violent assault, on  Congress, the Capitol, our…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691030/expressing-support-for-local-law-enforcement-officers"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…multi-million dollar  renovations of the 911 Communications Center, the Office of Emergency  Management building and built three new state-of-the-art fire stations  and a new fire administration building. Chief Sweat's tenure also saw  the department expand into responding to medical emergencies. It also  included the Covid epidemic period when the fire department…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696576/congratulating-fire-chief-gina-sweat-on-her-retirement"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…bipartisan support right  here on the House floor under suspension of the rules. Today it is  coming up under a rule because a lot has changed since last year. There  is a new administration, and the Trump administration is attacking  mental health and substance use response efforts on every front.\n\nRepublicans want to move forward with this legislation at…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691876/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…Speaker, I thank the ranking member for  yielding the time.\n\nMr. Speaker, I rise in opposition to H.R. 3015.\n\nThis bears repeating again: Here we are, 9 months into the new  administration and a new Congress, and Republicans have not brought one  bill to the floor of the House that will help tackle the cost-of-living  squeeze and the affordability crisis.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695767/national-coal-council-reestablishment-act"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…spending, we also  met the needs and met Members' requests across its many accounts.\n\nWe also reformatted. As we updated our priorities for this fiscal  year, reflecting a new administration and the majorities here in  Congress, I think that we restored balance in some of the key areas of  our bill. And the result is we have a measure that will strengthen…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699014/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…rejection of the profligate policies of the Biden-Harris  administration that existed over the past 4 years by electing President  Donald Trump.\n\nIn the first month of his new administration, President Trump has  answered this election mandate, signing executive orders aimed at  securing our Nation's borders, unleashing domestic energy production,  and rooting…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688085/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Ronny Jackson", "party": "Republican", "sentence": "…the 118th Congress. The only difference between this year's bill and  last year's bill is that we have incorporated some helpful technical  assistance provided by the new administration to ensure the legislation  better executes the letter of the law and congressional intent.\n\nI thank Chairman Mast and Ranking Member Meeks for supporting this  legislation…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690695/maintaining-american-superiority-by-improving-export-control-transparency-act"}, {"senator": "Steve Daines", "party": "Republican", "sentence": "…is we are disapproving Biden's ill-conceived  amendment and nothing else. This CRA does not prohibit the BLM from  issuing a new amendment. This CRA simply prohibits a new administration  from issuing a substantially similar coal amendment. In this case, that  means they can't permanently prohibit any new coal development.\n\nToday, you may hear from the…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696095/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Mr. WESTERMAN.  Greene).\n\nMr. Speaker, a lot of accusations have been made about serious  legislation, about working, about the things that have happened since  this new administration has come into office. I would like to recap  some of the things that have happened since this new administration has  come into office.\n\nNumber one, they spent a lot…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690939/gulf-of-america-act"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…Federal Government, in a lot of ways, failed to  do the job. Under the past administration, we saw where FEMA wasn't  doing the job. I am proud to say that under this new administration,  FEMA is getting the job done. Many folks who didn't live there saw  pictures of the mass destruction that was in western North Carolina and  the lack of response in…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690711/outrageous-government-funded-incentives"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…trillion in needless regulations that have stifled the  growth of industry and jobs in this country. Now, we are seeing them  all of a sudden change their tune.\n\nAs our new administration is less than a month and a half old, things  are moving in the right direction. People have a new view of what the  future is. We are fighting hard to preserve a predictable…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688464/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing-and-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…of border, the same personnel, the same  roads, the same physical barriers, the same communications systems, and  the same surveillance systems. In 2 weeks under the new administration,  we went from 8,000 to 10,000 illegal crossings a day to almost zero  because of a change in policy.\n\nThe guilt and the deep accountability of every injury and every…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695204/people-are-sick-and-tired"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…regulatory power and  was another attempt by the Biden administration to rush a rule out of  the door for the CFPB after President Trump had been elected but before  the new administration had the ability to have any input or  consultation on how to carry out a public rulemaking process.\n\nI am concerned this will cut down on people's use of innovative money…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689405/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…there are still aspects to that  shooting where the government hasn't been transparent.\n\nThe Biden administration stonewalled my oversight requests. I  strongly urge the new administration to let all the facts breathe,  unlike the last administration.\n\nThe day of the shooting, my oversight unit quickly got to work. They  talked to patriotic whistleblowers.…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693512/one-year-anniversary-of-trump-assassination-attempt"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…phones,  cash cards, and other things that Americans were struggling to pay for  every single day.\n\nCleaning up this mess has become our responsibility, the new  majority, the new administration that has committed itself to actually  keeping the promises from the campaign trail in 2024. Instead of  bending over backward to help people who are breaking…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690709/constitutional-crisis"}]