[{"senator": "Peter Welch", "party": "Democrat", "sentence": "…your  compassion and the care you have for Oregonians, whom you have been  serving so well for so long. It has really been, just for me, a  wonderful opportunity to be a new Member of the Senate, along with  Senator Schiff, who I know feels the same way to be working with  somebody like the Senator from Oregon, who is just honest and true and  totally…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696342/trump-administration"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…we can also see how long ago that was. I had all-black hair  at the time. I think I looked good. I got gray. I had all-black hair  because that was back in 2002. I was a new Member of Congress, trying  to work together with diplomacy from the very beginning.\n\nMr. Speaker, I didn't come here with prop photos because I am here to  debate substance. I…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698456/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…Speaker, I rise today in support of the  negotiated FY26 Commerce, Justice, Science; Energy and Water  Development; and Interior and Environment Appropriations Act.\n\nAs a new member of the CJS Committee, I am pleased to have been part  of crafting this legislation. I thank my fellow Appropriations  Committee members and staff for their extraordinary…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698757/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…Gerry Connolly's 2007 campaign for chairman of the Fairfax County Board  of Supervisors, and a year later he managed Gerry's successful campaign  for Congress.\n\nWhile a new Member, James is no stranger to Congress. After Gerry's  election to Congress, James went on to serve as his chief of staff for  over a decade, where he worked closely with many…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695220/welcoming-the-honorable-james-walkinshaw-to-the-house-of-representatives"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…from Minnesota (Ms. Omar).\n\nMr. MAGAZINER. Mr. Speaker, I thank the gentlewoman from Minnesota  for her remarks. I now yield to the gentlewoman from Arizona (Ms.  Ansari), a new Member who has come in and has already been making a  mark. I know she is here with the intent of being a reformer, which is  what we need in Congress.\n\nMr. MAGAZINER. Mr. Speaker,…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691216/stock-trading-ban-for-members-of-congress"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…times.\n\nRepublicans were so afraid of my amendment that Speaker Johnson shut  down the Rules Committee and sent us home early in July, and then he  refused to swear in a new Member of Congress for weeks because she  promised to be the 218th signature to force this bill forward. Only  four Republicans signed the discharge petition. Every single Democrat…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696904/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision-providing-for-consideration-of-h-con-res-denouncing-the-horrors-of-socialism-providing-for-consideration-of-hr-unlocking-our-domestic-lng-potential-act-of-providing-for-consideration-of-hr-researching-efficient-federal-improvements-for-necessary-energy-refining-act-providing-for-consideration-of-hr-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-providing-for-consideration-of-hr-district-of-columbia-cash-bail-reform-act-of-and-for-other-purposes"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…negotiated fiscal year 2026  appropriations package for Labor-Health and Human Services-Education,  for Defense, and for Transportation-Housing and Urban Development.\n\nAs a new member of the Subcommittee on Labor, Health and Human  Services, Education, and Related Agencies, I am pleased to have  contributed to the development of this legislation. I thank…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699330/consolidated-appropriations-act-2026"}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "Ms. SIMON. Mr. Speaker, as a new Member of Congress, I was under the  understanding that our job here is to lift up the voices of those in  this country that hold our Nation together with their own hands: The…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692264/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…the Chairs of the Fed say unemployment is dangerously  low. It scared me to death. How could it be? He was reporting as to its  impact on inflation. That was when I was a new Member.\n\nWhen I was Speaker, our Members said frequently: Why don't we have  the Fed be more accountable to us?\n\nI said: It has to be independent. They have their own funding. They…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694017/federal-reserve-independence"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…them more than our gratitude. We owe them action.\n\nMr. Speaker, I say this: There were a couple of comments about past  events, some which happened before I came here as a new Member. Yet, I  do remember very well the spring of 2020, when we saw many of our  cities burned, looted, and destroyed. Some of them have not yet even  recovered. Instead of law…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691319/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…will increase, of course, the demand for U.S. Treasuries and move  us toward that dominant position we need to have in the financial  markets.\n\nI applaud our chairman. As a new member of this committee, it has  been wonderful to watch a person in action who is attempting to work  with the other side, pushing through bipartisan legislation, and, once  again,…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693838/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Adrian Smith", "party": "Republican", "sentence": "Mr. SMITH of Nebraska. Mr. Speaker, I am glad to offer my thanks and  gratitude to James Min, as well.\n\nI appreciate the fact that when I was a brand-new Member of Congress,  a while back, that he has always been a great help not just to me but  to anyone who asks. I am grateful for his selfless public service. As  was said before,…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688733/offering-thanks-and-gratitude-to-james-min"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…as the story goes, wasn't too fond of the  painting. In true Washington fashion, he decided that the honorable way  to handle it was to regift the baby chick to the next new member of the  Washington delegation.\n\nAs such, he passed it on to Congressman Norman Dicks in 1976, and it  then went to Congressman Mike Lowry in 1979. It has been passed down…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698645/tax-relief-for-working-families"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…fellowship       program, or a detailee from another office of the Federal       Government shall be considered an employee of the House.\n\n(3) Exception for participants in new member orientation       programs.--If an individual completed a program of training       required under paragraph (1) during the new       Member orientation program administered…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692190/mandatory-completion-of-program-of-training-in-workplace-rights-and-responsibilities"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…gentlewoman from Wyoming  for her comments, and I appreciate her being a part of the Special  Order this evening.\n\nOur last colleague who is going to address us this evening is a new  Member from the great State of Kansas.\n\nHe is a good friend.\n\nMr. MOORE of Utah. Mr. Speaker, that is smart.\n\nMr. MOORE of Utah. Mr. Speaker, I thank the gentleman from Kansas…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690787/big-beautiful-bill"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…connection to the  Colorado Springs area and his district in Colorado and Utah first, both  being strong Air Force communities, I am thrilled to be working with  such a great new member of the Conference.\n\nMr. MOORE of Utah. Mr. Speaker, I thank the gentleman from Colorado  for his comments and anecdotes on his support for the police. It is  very important.…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691166/events-this-week"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…of this Act, the Commandant shall provide for the       inclusion of an initial covered misconduct prevention and       response training module in the training for each new member       of the Coast Guard, which shall be provided not later than 14       duty days after the date of accession.\n\n(B) Requirement.--In addition to the information described…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…Department of Energy finalized amended energy efficiency  standards for commercial refrigeration equipment.\n\nH.J. Res. 75, introduced by Representative Goldman of Texas, a new  member of the Committee on Energy and Commerce, repeals this final  rule.\n\nNew standards for this equipment, which included a variety of  products, became effective just 3 years…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689129/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Ken Calvert", "party": "Republican", "sentence": "…Chair, I urge all of my colleagues to support this important  bill.\n\nMs. WASSERMAN SCHULTZ. Mr. Chairman, I yield 2 minutes to the  gentlewoman from Texas (Ms. Escobar), a new member of the  Appropriations Committee.", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692941/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…good friend, the  gentleman from Florida, our new chairman of the Subcommittee on Space  and Aeronautics, for inviting me to join him tonight. I am excited to  join him as a new member on the subcommittee and highlight Utah's  exciting role in the future of space exploration.\n\nWhen we think of iconic American places associated with NASA, Houston  and Cape…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687925/space-dominance"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…future President can't again undo what we experienced in the last 4  years. That is the difference in where we are. That is why it is  important that we are doing it.\n\nHe is a new member of the  Committee on Energy and Commerce, and I am proud to have him on the  committee.\n\nMr. Speaker, I just want to say that over the next decade, we are  going to  need…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695764/national-coal-council-reestablishment-act"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "Mrs. FEDORCHAK. Mr. Speaker, I appreciate the leadership of both Mr.  Moore and Mr. Arrington. Both of them are great mentors to me as a new  Member. I hope I can aspire to be as strong as they are someday.\n\nWorking-class families, seniors on fixed incomes, farmers growing our  food, restaurant waitresses working double…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691959/supporting-the-big-beautiful-bill"}]