[{"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…important reforms to the  Federal Election Commission to improve the enforcement of our campaign  finance laws. Since the Citizens United decision came down, 16 years  ago, new technologies have emerged that only make the need for reform  more pressing. AI videos are making their way into political ads,  giving dark money groups a new and cheaper tool with…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699114/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…priority and are  quickly starting to ascend to dominance.\n\nTo preserve our lead, we must take swift action to commercialize and  scale biomanufacturing here at home. These new technologies use the  power of biological cells and systems to perform complete chemistry-- complex issues.\n\nThey will enable us to onshore the production of critical chemicals,  including…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693686/department-of-defense-appropriations-act-2026"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…control architectures fray and nuclear dangers mount,  that example takes on new urgency. The world faces a moment of great  peril: nuclear arsenals are being modernized, new technologies are  emerging that could undermine strategic stability, and the norms  against nuclear testing and proliferation are under strain. The vision  of a world free from nuclear…", "date": "2025-08-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694763/marking-the-15th-annual-international-day-against-nuclear-tests"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…Snow Water Supply Forecasting Program through 2031,  ensuring that communities have accurate water supply forecasting.\n\nThis program plays a critical role in advancing new technologies,  expanding snow monitoring areas, and improving the accuracy of water  supply forecasts.\n\nThis work is extremely vital to supporting Western communities facing  growing…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697626/snow-water-supply-forecasting-reauthorization-act-of-2025"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…reduce the amount of oil that we put into the vehicles which  we drive. This terrifies the oil industry.\n\nAmerica is a technological giant. We have a capacity to invent new  technologies. By the way, the Chinese are just on the HOV lane of new  technologies for the vehicles which they are driving. They have  invented a technology that allows for the charging…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691549/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…sustainable aviation  fuels. We cannot retreat from the future of energy and transportation,  and certainly not from our history of leading the world at the  forefront of new technologies.\n\nI would like to include in the Record a Wall Street Journal article  from April, ``Five-Minute EV Charging Is Here, but Not for U.S.-Made  Cars''. I would also point…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694959/highlighting-advances-in-chinese-electric-vehicle-technology-and-the-need-for-american-investment-in-battery-technology"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…disorders, and  neurological problems, even at extremely low levels of exposure.\n\nIt has been suggested that the 2024 rule eliminates the incentive for  facilities to deploy new technologies to reduce pollution. However, we  have some real-world data on this, and there is zero evidence that  polluters will go above and beyond what is legally required of them…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691592/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…Consumers still pay for natural gas that is wasted, but this  resolution will let those polluters off the hook. It also hurts  American companies that are innovating new technologies enabling leak  detection and repair, creating whole new pollution reduction  industries.\n\nThese new technologies are turning waste into economic value, all  while protecting…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688179/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…Technologies Act.\n\nWith this piece of legislation, the House has the opportunity to  improve the Department of Homeland Security's ability to quickly  acquire and deploy new and innovative technologies, like artificial  intelligence and machine learning, to enhance our border security.\n\nWith more innovative technology, we can improve CBP's targeting and  our…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688687/emerging-innovative-border-technologies-act"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…other technical conferences.\n\nThis is important because this technical work is key and underpins  our U.S. competitiveness and national security and paves the way for  new technologies to thrive through the reallocation of spectrum,  spectrum like 6G, and its work on technical standards vis-a-vis China  and other international players.\n\nMoreover, this…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690254/national-telecommunications-and-information-administration-reauthorization-act-of-2025"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…the businesses of the  future that are using the research, which you very correctly brought to  our attention, that is being cut.\n\nThat research has led to innovation, new technologies, and new  solutions. Perhaps you would like to expand on that.", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688233/democratic-proposals"}, {"senator": "Sharice Davids", "party": "Democrat", "sentence": "…of 2025  strengthens the United States Department of Agriculture's ability to  improve grain grading technologies through flexibilities to pursue  modernization. Using new technologies to improve grain grading is an  opportunity to make the process more accurate, efficient, and  consistent.\n\nAdditionally, the bill reauthorizes key USDA authorities for…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695052/united-states-grain-standards-reauthorization-act-of-2025"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…the  United States--$70 billion, very profitable. But times change, and we  learn about what has to happen as we are changing the way in which our  country operates and new technologies get developed.\n\nSo, yes, we had that revolution from the 1996 act. I am very proud of  it. We called the companies that got created Google, eBay, Amazon,  Hulu, YouTube.…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690803/addressing-the-homework-gap-through-the-e-rate-program"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…equipment, and better policies. For example, if data  reveals that a significant number of injuries occurred during traffic  stops, agencies can adopt safer tactics or deploy new technologies. If  certain regions report higher rates of firearm-related fatalities, we  can prioritize resources there.\n\nOfficer suicide rates outpace line-of-duty deaths. I will…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691321/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…landscape is littered with obstacles like  finding qualified workers, dealing with supply chain disruption as they  adjust to the President's tariff regime, and adopting new technologies  in order to stay competitive. These economic headwinds make SBA  services more important than ever.\n\nThe bills before us today reflect the monthslong, bipartisan effort…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697219/made-in-america-manufacturing-finance-act"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…these recommendations and make certain the FAA and Army are making the  recommended changes, provide funding for further modernization of our  aviation system, advance new technologies at the FAA, and train and  support air traffic controllers. We cannot--we should not--miss the  moment to act and ensure lasting change.\n\nI cannot imagine the pain each…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699417/9999"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…region to utilize this type of device.\n\nThe funding he has acquired has enhanced accuracy and expanded  capabilities within the department, leveraging innovative and new  technologies. Not only has Officer Schneider secured equipment for the  department, but he also has established the traffic safety committee to  actively engage with the community…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…Angels Lead  Our Startups Act, and I thank Congressman Lawler for his leadership on  this bipartisan bill.\n\nAround the country, early-stage entrepreneurs are developing new  technologies, products, and services not in boardrooms but in shared  workspaces, university labs, and community accelerators. At this stage,  the most important thing they need is…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692725/helping-angels-lead-our-startups-act-of-2025"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…to ensure air dominance with new generation fighter jets;  $25 billion to restore America's arsenal of munitions; and $145 billion  to research and develop innovative new technologies our warfighters  will need to win on future battlefields.\n\nThis is a strong bipartisan bill that delivers for our warfighters  and deters our adversaries. It will fundamentally…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697810/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…propellant. Classifying       a less-than-lethal projectile device as a ``firearm'' makes       it more difficult, costly, and time-consuming to manufacture       innovative new technologies for law enforcement.       Additionally, law enforcement officers can be unfairly       subjected to higher levels of liability exposure for       discharging a ``firearm''…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700037/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…maintain and improve domestic standard of living;\n\n(6) as digital information becomes increasingly important       to the United States economy and the development of new       technologies and services that will be crucial to the       country's competitiveness in the 21st century global economy,       barriers including data localization and infringement…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692697/global-investment-in-american-jobs-act-of-2025"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…originally created during the Clinton administration. It was  the ``once in, always in'' rule that penalized job creators and energy  producers who took steps to invest in new technologies that lowered  pollution.\n\nIf your emissions are at such a level you become a major source, once  in under this rule that we are overturning today, you are always a  major…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691590/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act"}, {"senator": "Brad Finstad", "party": "Republican", "sentence": "…department navigate decades of change. During his  years of leadership, he spearheaded the procurement of new vehicles and  equipment and oversaw the implementation of new technologies within the  department.\n\nMr. Speaker, I thank Sheriff Lange for his years of service and the  example that he has set for all of us in southern Minnesota. I offer  congratulations…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698459/recognizing-sheriff-dave-lange"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…America's maritime base, including  provisions that streamline the merchant mariner credentialing process  and laying the groundwork for the responsible deployment of new  technologies at sea.\n\nThrough this legislation, the United States Coast Guard will possess  the assets and personnel it needs to execute its safety, enforcement,  and national security…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697805/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "Mr. STRONG. Mr. Speaker, I rise today in strong support of H.R. 901,  the Research Security and Accountability in DHS Act.\n\nI understand how important new technologies are in saving lives and  protecting the American homeland as threats and challenges evolve.\n\nWhether the Department of Homeland Security is working to prevent a  terrorist…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688737/research-security-and-accountability-in-dhs-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…reauthorizes this critical legislation, but also  advances grain grading technology to modernize inspection and weighing  services. These updates will help the industry adopt new technologies,  improve the accuracy and the efficiency of grain standards, and keep  American agriculture competitive in a global market.\n\nAllowing this law's authority to lapse would…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695054/united-states-grain-standards-reauthorization-act-of-2025"}, {"senator": "Ken Calvert", "party": "Republican", "sentence": "…ingredient.\n\nWe cannot allow China to be the world innovation leader in any field,  including bioindustrial manufacturing. We must continue tried and true  practices to adopt new technologies to fortify the American defense  industrial base.\n\nAmerican lethality is degraded without bioindustrial manufacturing.  Meanwhile, China and Russia benefit from American…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693682/department-of-defense-appropriations-act-2026"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…for so many.\n\nWhen you talk about jobs in the space industry, it is not a job to so  many; it is a career. The dedicated folks at NASA are moving forward  with these new technologies. They are working hand-in-hand in public- private partnerships with companies like SpaceX, Blue Origin, Rocket  Lab, Boeing, L3Harris, and so many others, along with Northrop…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687924/space-dominance"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…continuous  challenges in acquiring capabilities to replace BioWatch.\n\nWhile DHS has the authority to utilize the Department of Energy's  national labs to identify and develop new technologies related to  biodefense, they have yet to take advantage of this resource.\n\nMy legislation will advance America's bioweapon defense posture by  directing the Secretary…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688731/dhs-biodetection-improvement-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Hagerty of  Tennessee, for his leadership in ushering this bipartisan bill through  the United States Senate.\n\nAround the world, payment systems are undergoing an evolution. New  technologies are modernizing legacy infrastructure and unlocking  innovative solutions to improve efficiency, reduce costs, and expand  access to financial services.\n\nMembers of the…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693834/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}]