[{"senator": "Jack Reed", "party": "Democrat", "sentence": "…wind projects, according to the Global Energy Monitor. And  despite President Trump's claims that China is simply exporting these  technologies and not utilizing them, the New York Times reported that  ``In China, more wind turbines and solar panels were installed last  year than in the rest of the world combined.''\n\nAt the same time, President Trump is…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696129/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…on it, and every single one of her  Republican colleagues on the Rules Committee, every single one of them  voted against it.\n\nGet this: According to this article in The New York Times titled:  ``After Muscling Their Bill Through the House, Some Republicans Have  Regrets,'' our colleague from Georgia wasn't the only Republican who  didn't read the bill…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691944/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…players in the political system. President Trump's       rhetorical attacks on critics in the media are an example.       His repeated accusations that outlets such as the New York       Times and CNN were dispensing ``fake news'' and conspiring       against him look familiar to any student of authoritarianism.       In a February 2017 tweet, he called the…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "Mr. WELCH. Mr. President, on September 11, 2025, the spokeswoman for  the U.S. Agency for International Development, USAID, confirmed to the  New York Times that $9.7 million worth of contraceptives being stored  in a warehouse in Belgium had been destroyed at the direction of the  Trump administration. These contraceptives…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696465/womens-health"}, {"senator": "Chellie Pingree", "party": "Democrat", "sentence": "…members, staff,  performers, and even Trump-appointed officials were blindsided by this  announcement. There was no plan presented, no consultation, no  transparency.\n\nThe New York Times reports that budget documents describe needed  maintenance, yes, but nothing that required shutting down the entire  institution. In fact, the very official overseeing…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699704/changes-at-the-kennedy-center"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…annexationist vision while  the plague of settler violence runs rampant.\n\nThe alternative, Mr. Speaker, is a stark and disturbing picture. This  week, Tom Friedman wrote in The New York Times that: If ``Israel goes  ahead with Netanyahu's vow to perpetuate this war indefinitely--to try  to achieve . . . the far right's fantasy of ridding Gaza of  Palestinians…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692485/supporting-israeli-security-and-palestinian-freedom"}, {"senator": "Lori Trahan", "party": "Democrat", "sentence": "…Mike Carey because we are facing an urgent  and deeply troubling trend, the promotion of sodium nitrite, a toxic  chemical, as a method to die by suicide.\n\nIn 2022, The New York Times revealed the existence of online suicide  forums that don't just discuss suicide, they promote it. Anonymous  users on these platforms encourage vulnerable children and…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690216/youth-poisoning-protection-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…director  of the museum, and the inspired board of the Toledo Museum of Art. We  give Mr. Levine a salute and congratulate him.\n\nMr. Speaker, I include in the Record a New York Times article titled  ``After 167 Years in New York, a Priceless Coin Collection Heads to  Toledo.''                  [From The New York Times, Nov. 20, 2025]     After 167 Years…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697235/priceless-coin-collection-heads-to-the-toledo-museum-of-art"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…appearances on MSNBC, NY1,  and other local New York City television news programs. He worked  closely with reporters to book interviews with major news outlets like  the New York Times and the Washington Post.\n\nMatt's commitment to learning led him to be an active and consistent  participant in the many communications classes offered in the House-- even…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693380/recognizing-matt-jansen-and-his-service-to-the-house-of-representatives"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…criminal prosecutions  during multiple Presidential terms. Todd Gilbert refused to do it, and  Todd Gilbert was forced to resign as a result.\n\nSubsequent reporting by the New York Times laid out the facts that we  believe to be true; that the Trump administration wanted to push out  the assistant because the assistant was unwilling to issue indictments…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696334/trump-administration"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…percent.\n\nSecretary Noem, meanwhile, issued a directive on July 11 saying that  all DHS contracts of over $100,000 had to be personally approved by  her, according to the New York Times--including, according to the New  York Times, deployment of search and rescue teams. Every one of them  had to be signed off.\n\nThis is not efficiency. This is adding redtape…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693517/central-texas-floods"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…to 45 years in  prison.\n\nThen what happened? Well, you won't believe it. Donald Trump pulls  out his pardon pen.\n\n[O]n Saturday, Mr. Trump said in a statement to the New       York Times that ``many friends'' had asked him to pardon Mr.       Hernandez. ``They gave him 45 years because he was the       President of the Country.''\n\nThen Donald Trump said:…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697242/the-economy"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Aside from hospitals, there is also going to be a major consequence  on American energy. I commend to my colleagues and those who are  following this debate, in today's New York Times, an article by Thomas  Friedman. He talks about the impact on energy from the decisions made  by the signing of this bill.\n\nThis bill kills solar, wind, and EV tax credits…", "date": "2025-07-08", "source_url": "https://justfacts.votesmart.org/public-statement/1693251/one-big-beautiful-bill-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…chance to deliver relief for the American  people, Republicans, by passing the same bill the House approved last  week with bipartisan support. Time is of the essence.\n\nThe New York Times reported that nearly 1.5 million Americans already  have lost coverage. Americans are in the middle of a healthcare  emergency, all because the tax credits are not being…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699088/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…the deficit by trillions--trillions-- just to reward their wealthy donors.\n\nNow, with even their own Members having second thoughts and regrets  about that vote, as The New York Times reported last week, they are  desperate to change the conversation. However, these bills, these  distractions won't work because the American people are paying  attention.…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692265/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…lying about who they were and what they were doing. We  have seen the administration sue media organizations and reporters--not  just a few: Washington Post, ABC, BBC, New York Times, Des Moines  Register--sue media outlets to cow them into compliance; using the  power of the Federal Trade Commission and the Federal Communications  Commission--the FTC…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699917/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…the country to protect women and girls  in sports. There is absolutely zero reason for Senate Democrats to  oppose this resolution, and here is the reason why: We have a New York  Times Ipsos poll that tells the story on this. Seventy-nine percent of  the American people, including 67 percent of Democrats, want to make  certain that female sports are…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688449/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…hours, something you can do on a plane in 1 hour today.\n\nThis project has been called a project that won't even be built  within the next century by even sources like The New York Times. I have  introduced legislation to eliminate all future Federal funding for  high-speed rail. The Governor continues to believe that Federal funding  will come. It is not…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691353/governor-newsom-backs-down"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "Mr. GRASSLEY. Mr. President, today, I am here to again speak about  the New York Times' anti-whistleblower reporting. Obviously, it is very  misleading.\n\nOn January 18, 2026, Glenn Thrush, Alan Feuer, and Adam Goldman gave  another big, wet kiss to their…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699769/whistleblowers"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…said--block the normal process to regular order.\n\nAnd it is not just the Democrat-elected officials calling for a  shutdown. Liberal columnist Ezra Klein recently wrote in the New York  Times and he was on television urging Democrats to shut down the  government. He did it despite the costs and consequences to the  American people, but that is where the radical…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695529/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…HAGEMAN. I rise today to recognize and congratulate Lou Taubert  Ranch Outfitters of Casper, Wyoming, for being named one of the 50 best  clothing stores in America by The New York Times.\n\nLou Taubert Ranch Outfitters first opened its doors in 1919 after  being founded by C. W. Taubert, an immigrant from Germany who grew  enamored with the cowboy spirit…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699737/recognizing-lou-taubert-ranch-outfitters"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…found that this project has no viable path  forward.\n\nOf course, Californians have known that for a long time. They have  spent $17 billion and haven't laid any track. The New York Times found  the project is not on track to be completed this century and will be  $100 billion over budget.\n\nThey initially told us that there would be a high-speed train from…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691937/high-speed-rail-in-california"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…daughters  like Kayla? Where were the general strikes and school walkouts and  tearful TV monologues for American sons like Travis? Where were CNN and  MSNBC? Where were the New York Times and the Washington Post? Where  were the armies of journalists and camera crews to tell their stories,  to interview their grieving parents, to regale us all with stories…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699689/immigration"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Anastacio, Nicholas: National Journal; Anderson, Zachary: USA       Today; Andrea, Lawrence: USA Today; Andrews, Natalie: Wall       Street Journal/Dow Jones; Anglin, Tara: New York Times;       Aoyama, Ryo: Asahi Shimbun; Appelbaum, Binyamin: New York       Times; Appleby, Julie: KFF Health News; Aratani, Lori:       Washington Post; Archambault, Haley:…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698132/members-entitled-to-admission-to-the-119th-congress-daily-press-gallery"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…2020 and yet now in 2026, no track has been laid despite  spending $18 billion.\n\nThe estimated total cost has ballooned from $33 billion to $128  billion, and even The New York Times found that it is not on pace to be  finished this century.\n\nWith the success of this legislation, our Federal tax dollars in  California can go where they are needed when…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699380/no-more-tax-dollars-for-californias-high-speed-rail"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…an island State after all, and you will get gas for 20  cents cheaper than you do in California.\n\nThe cost of electricity: California is number one in the country. The  New York Times recently published a map showing how much electricity  rates have increased over the last several years, which tracks the time  that Gavin Newsom became Governor. California…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697549/congratulating-eco-clean-solutions"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…can achieve in their life, Alaskan of  the Week.                                    China\n\nMr. President, I wanted to come to the floor to discuss a recent op- ed in the New York Times just a few days ago. It kind of made a stir. A  lot of people thought it was a really good op-ed. I didn't.\n\nI wanted to come to the floor and talk about this op-ed because…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690106/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "John Thune", "party": "Republican", "sentence": "…length on many occasions about the pain--the pain--that  government shutdowns cause Americans. Since he mentioned it, I will  show this poll. This is a poll right here, the New York Times.\n\nBy the way, this morning, the Democrat leader used one of my other  charts. Thank you for doing that. It makes my point. I am guessing he-- do you want to use this one?…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695921/continuing-appropriations-and-extensions-and-other-matters-act-2026"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…TV/NBC-4.\n\nAndrews, Kenneth: WJLA-TV/NEWSCHANNEL 8; Andrews, Tyler:       HEARST TELEVISION INC; ANDRZEJCZAK GAZIS, Olivia: CBS NEWS;       Anglim, John: CNN; Anglin, Tara: NEW YORK TIMES; Anopchenko,       Dmytro: INTER TV; Anselmo, Karyn: NEXSTAR MEDIA GROUP;       Anthony, Tony: MORNINGSIDE PARTNERS, LLC; Antosiewicz,       Marcin: TVP POLISH TELEVISION;…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698150/members-entitled-to-admission-to-the-119th-congress-radio-and-television-correspondents-gallery"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…and abuse.\n\nThe number that they keep referencing just keeps going up. It has  been 13.7 million, 14 million, and now it is 16 million. That is just  not true. Even The New York Times said that the numbers that the  Democrats have been saying about people who will ``lose their  healthcare'' is not true.\n\nIf you are illegal, if you are ineligible, if…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692263/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}]