[{"senator": "Tim Kaine", "party": "Democrat", "sentence": "…part of the Constitution that is more important than the  article I provisions making claim that the United States should not be  at war without a vote of Congress. Yet the news of the day suggests  that we are potentially on the verge of a war with Iran.\n\nWhen I was elected to the Senate in 2012, having served as a Governor  from 2006 to 2010 during…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692637/war-powers-resolution"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…one-tenth of 1 percent of the  Federal budget. Yet it is delivering information and research that are  absolutely vital to our economic prosperity.\n\nThe reports we see on the local news, on the Weather Channel, and all  our smart phones are built on forecasts and information generated by  the National Weather Service and its array of scientists, satellites,…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688171/national-oceanic-and-atmospheric-administration"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…moment, I want to try to take Republicans at their word, that  this bill is all about electric reliability, ensuring that the lights  won't go out. In that case, I have excellent news for my Republican  colleagues. The law this bill amends, the Public Utility Regulatory  Policies Act, or PURPA, already does that. The law requires States to  have an integrated…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697886/state-planning-for-reliability-and-affordability-act"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…been lost to  projects being canceled or delayed since the President's election.\n\nThat is more than enough power for 8.4 million homes in the United  States. And I have bad news: It is about to get a whole lot worse. That  is because President Trump is strangling the energy supply we badly  need to drive down costs for everyone.\n\nFrom canceling energy…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696124/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…pandemic. We lost 15 percent, or 1,135, home-based  childcare providers, and that further pressured the market and limited  options for families.\n\nI come to this floor with good news. I am proud to share that, in our  State, education and nonprofit leaders are working to find innovative  solutions to help families afford childcare through scholarships and…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699582/stop-the-republican-affordability-crisis"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…the moment we wake up to the time we turn in at night, New Mexicans  rely on radio and public broadcasting to stay safe during natural  disasters and to connect with trusted news, educational programming,  and our favorite New Mexico musicians--sometimes even a basketball game  or two.\n\nNow, over the past several weeks, I have received texts, calls,…", "date": "2025-07-09", "source_url": "https://justfacts.votesmart.org/public-statement/1693299/9999"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…rule us, and we all must open our eyes. Since he first came into  office, President Trump has persistently attacked the media to  undermine the credibility of the messenger of news that he didn't like.\n\nThen, during Special Counsel Mueller's investigation on Russia's  interference in the 2016 election to benefit Donald Trump's campaign,  President Trump…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690393/attacks-and-threats-on-democracy-and-rule-of-law"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…that no rescission of funding for the Corporation for Public       Broadcasting impedes or stops public television stations from       producing or broadcasting local news and homegrown content to       rural, remote, and underserved communities.", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693628/hr-4"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "Ms. KAPTUR. Mr. Speaker, there is always good news in America. It is  contained in the hearts of its people.\n\nI rise today in recognition of an extraordinary citizen of northwest  Ohio, Mr. Steve Martin, for his selfless dedication…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688327/recognizing-steve-martin-of-northwest-ohio"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…many of our colleagues have been through it, where these  super-PACs come in and change the dynamics of an election with millions  and millions of dollars.\n\nThe one bit of good news is that many of us, like me, are here still.  We fought that uphill battle and won it, but now we have to look at  what is going to happen in the future, at what kind of political…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699239/restoring-election-integrity"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…beginning, as you can tell, to discuss the  resolution to repeal the global tariff emergency.\n\nAs is becoming routine under this President, Americans were greeted  with grim economic news this morning. After 3 years of strong growth  and rising job numbers, the U.S. economy actually shrank in the first 3  months of 2025. The trade deficit hit a record $162 billion.…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690532/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Here is the truth: Costs are going through the roof because of  President Trump and his MAGA policies. The American people know this.  Recent polling from none other than FOX News shows that nearly two- thirds of Americans blame President Trump for higher prices--FOX News.\n\nListen to my constituent Tria, who wrote to me from Chicago. After  experiencing…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697242/the-economy"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…so-called DOGE initiative, and every day that this product  sits in warehouses in Rhode Island is a day that children around the  world are unnecessarily dying.\n\nNow, the good news is that Elon Musk, Marco Rubio, and others have  said that this funding will be restored. In fact, just yesterday, at  his Senate hearing, Secretary Rubio said again that essential…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691610/global-report-on-food-crisis"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…threatens our democracy, and every elected  official must condemn it forcefully.                                  Healthcare\n\nMr. President, now, on healthcare, there is breaking news this  morning--good news--that the discharge petition in the House got the  necessary 218 signatures to move forward.\n\nIt shows that the demand by the American people for Congress--the…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698255/nominations"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…response helped the runner regain a pulse, ultimately saving his  life.\n\nDuring the emotional ordeal, Dan missed seeing his fiancee cross the  finish line, but he told a local news outlet that if he had to do it  all over again, he would still jump in to help.\n\nFor his heroic actions, I want to extend my sincere gratitude to Dan  and members of the Akron…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696700/recognizing-dan-molnar-as-the-champion-of-the-week-for-ohios-13th-congressional-district"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…western North Carolina was slammed by the  worst storm to ever hit our region. To many across the country, we  thought that this might have been just another segment on nightly news  programs or an article in our local paper, but for those of us who call  western North Carolina home, it meant so much more.\n\nIn our mountain communities, waters crested above…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695797/hurricane-helene"}, {"senator": "French Hill", "party": "Republican", "sentence": "…into law  today.\n\nMr. Speaker, I include in the Record a link to a list of over 70  organizations that support this bill being enacted: https:// financialservices.house.gov/news/documentsingle.\n\nMr. Speaker, I appreciate the work of my friend from Illinois on this  bill, the important work he has done both in the housing portion and on  the work we…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…even harder to purchase? It is a terrible idea.\n\nWashing machines were already almost $100 more expensive as a result  of the original tariffs 4 years ago.\n\nHere is really bad news: Even beer will become more expensive. A  professor at Northeastern University states that a six-pack of Corona  could go up by 45 cents, but a small craft beer could be increased…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689478/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…he is able to  continue wasting taxpayer dollars on an epic scale on a project that  will go down as the single biggest waste of taxpayer dollars in U.S.  history.\n\nThe good news is that this lawsuit is going nowhere, and we now have  a chance to finally wind this embarrassing project down so that the tax  dollars of Californians can go where they are…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693872/ending-waste-of-taxpayer-dollars-in-california"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…oil       from Canada to Texas--leaving South Dakotans reeling and       1,000 people immediately out of work.\n\n``Where is it that they can go for their green job?'' Fox       News reporter Peter Doocy asked Psaki at her Monday afternoon       press briefing, referring to Biden's promise to create good-      paying union jobs in the green energy sector…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688523/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "Mr. CARTER of Georgia. Mr. Speaker, I rise today to recognize St.  Simons Island's designation by U.S. News and World Report as one of the  best underrated travel destinations in the U.S.\n\nThey evaluated over 1,500 vacation destinations worldwide and ranked  them across numerous categories.…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692260/recognizing-st-simons-island"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…aren't going to put up with it anymore.\n\nWhy is the government still funding public television when most  people have hundreds of channels, as has been mentioned, to watch their  news or whatever they want to watch? Is it just because it has been  around for 50 years? That is not reason enough.\n\nUnless we want to pass along $37 trillion, and climbing, of…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693710/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "James Risch", "party": "Republican", "sentence": "…Navy's proposed Letter(s) of Offer and       Acceptance to the Government of Israel for defense articles       and services estimated to cost $510 million. We will issue a       news release to notify the public of this proposed sale upon       delivery of this letter to your office.            Sincerely,                                                 Michael…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693349/arms-sales-notification"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…the  country.                           Calling for Accountability\n\nMr. KILEY of California. Mr. Speaker, I rise to present some truly  bewildering and completely unacceptable news out of my State, the State  of California. I have been very critical of government performance in  our State, with giving taxpayers the services that they are paying for.  This…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697549/congratulating-eco-clean-solutions"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…failing to promptly  approve new applicants from minority-owned businesses would result in a  lawsuit--a lawsuit--feeding accusations of racism that would be  scrawled across the news--scrawled across the news. Feeding Our Future  went to the State and said: If you stop giving us this money, we are  going to call you racist and we are going to sue you and…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697400/welfare-fraud"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…money, and they wanted to buy, but the supply wasn't  there. So what happened? Prices went up. At one point, prices went up  to--inflation reached 9 percent.\n\nNow, the good news is that it has come down. So we are better, but we  are not well. Inflation--I think new numbers came out today. They are  at about 2.7 percent. That means prices are still…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699012/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Richard McCormick", "party": "Republican", "sentence": "…Authorization Act for Fiscal Year 2026.\n\nMy amendment expands on language already in law, in this bill, and in  the Senate NDAA to combat the indirect censorship of conservative news  outlets in the Department of War.\n\nSection 1555 of the fiscal year 2024 NDAA required that the DOD, when  contracting with organizations that place military recruitment  advertisements,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695256/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "James Risch", "party": "Republican", "sentence": "…proposed Letter(s) of Offer and       Acceptance to the Government of the Netherlands for defense       articles and services estimated to cost $570 million. We will       issue a news release to notify the public of this proposed       sale upon delivery of this letter to your office.            Sincerely.                                                 Michael…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695757/arms-sales-notification"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…rooms used for mealtime       meetings, which are being renovated and preserved.\n\nMr. TILLIS. Mr. President, this is a case where we had members on the  committee responding to news reports that were proven wrong.\n\nFolks, I thought this was probably going to end this way, and it is  one of the reasons why I decided to invite myself to a tour when the  President…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700062/9999"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…the steps that we can take to protect our  hearts. Heart disease remains the leading cause of death in the United  States, affecting millions of Americans each year.\n\nThe good news is that many heart conditions are preventable through  small everyday choices. Taking care of our hearts doesn't require  drastic changes. It is about simple, constant, consistent…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688152/recognizing-heart-health-month"}]