[{"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…score on whether the California  clean air rule is treated by EPA as a waiver or a rule, it is 131 to 0.\n\nIt is nearly 50 years of constant practice undisputed. Under  President Nixon, 15 times a Republican EPA granted the waivers. Under  President Reagan, 33 times a Republican EPA granted the waivers. Under  President George H. W. Bush, nine times a Republican…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691581/hj-res-88"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…have been occasions before when Presidents said:  We would like to actually have that power of the purse. And the  President who really pursued that aggressively was President Nixon, in  the 1970s. President Nixon signed a law about how money would be spent  but then decided not to spend it and withheld the money from being  spent on housing, on education,…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693589/rescissions-act-of-2025"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…the local economy.\n\nWe are looking for three Republicans to stand with a unified  Democratic Party and Congress to push forward a bill that was last  extended in 1971. Richard Nixon was President of the United States the  last time Social Security benefits were extended for your constituents  as well as my constituents in Connecticut.\n\nIt is long overdue.…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688486/social-security-is-the-number-one-antipoverty-program-in-united-states"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…1974, the Budget and Impoundment  Control Act, normally referred to as the Budget Act, the 1974 Act. It  came about because two things were going on: One is that President  Nixon had impounded funds, and the Supreme Court said, no, you can't do  that. That is unconstitutional. You can't steal the power of the purse.  In the Constitution, that power…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693102/one-big-beautiful-bill"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…expenditures. Last year, crypto did more super-PAC  expenditures than Big Oil and Big Pharma times five.\n\nThis bill is designed to enrich President Donald Trump. Even Richard  Nixon never thought of printing up baskets of Monopoly money and  selling them for cash. Trump thought of it, and he is doing it  electronically.\n\nAbu Dhabi has announced they are…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693831/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…any public consent.\n\nCongress overwhelmingly reaffirmed this key constitutional provision  when it passed the War Powers Act in 1973 over the veto of then- President Richard Nixon.\n\nUnder the law, the President has the authority to approve military  attacks as a response to an imminent threat or with the expressed  authorization of Congress. I do not…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696557/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Susie Lee", "party": "Democrat", "sentence": "…eleven of them become in the years ahead.\n\nI commend the hard work, dedication, and achievement of Jacob  Bennett, Cannon Castor, Ethan Dastrup, Christian Earl, Jackson Hedin,  Nixon Hunt, Jack Hyer, Issac Koval, Seth Leedom, Michael Norton, and  Luke Robison. Mr. Speaker, I ask my colleagues to join me in  recognizing their achievement.", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697395/recognizing-the-eleven-newest-eagle-scouts-from-troop-407"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…regard to Social  Security to help everybody across the board, including a 2 percent  overall increase in Social Security--again, something that hasn't been  done since Richard Nixon was President of the United States.\n\nWe also want to make sure that no one receives a below-poverty-level  check from Social Security. Currently, more than 5 million of our…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694818/saving-social-security"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…subservient politburo and  judiciary.\n\nHarry Truman understood this. Dwight Eisenhower understood this. John  F. Kennedy understood this, and so did Lyndon Johnson, Richard Nixon,  Gerald Ford, Jimmy Carter, Ronald Reagan, George H.W. Bush, Bill  Clinton, George W. Bush, Barack Obama, and Joe Biden. These men,  whether you deem their Presidencies good…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698929/greenland"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…tonight in service of our kids and the  air that they breathe?\n\nNow, Ronald Reagan wasn't the only Republican President to believe in  clean air and clean water. This is Richard Nixon giving an address  January 22, 1970.\n\nI now turn to a subject which, next to our desire for       peace, may well become the major concern of the American       people in the…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691582/hj-res-88"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…she  expertly addressed challenges.\n\nFor Mike Wagner, our executive director, participation in inaugural  ceremonies began when he was a high school tuba player at President  Nixon's second inauguration in 1973 and includes a 44-year Army career  culminating as the military lead for the 57th, 58th, and 59th  Presidential inaugurations. His organizational…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691709/recognizing-the-joint-congressional-committee-on-the-inauguration"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…to decide what gets funded, and the Executive has to  implement that plan.\n\nAnd when the question of impoundments came up at an earlier date,  where in a different strategy Nixon said: Hey, I think I will just not  forward the funding; I will impound it so certain programs won't be  funded--again, that had gone to the Supreme Court.\n\nAnd again the Supreme…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "…the lawlessness is  understanding the importance of the War Powers Resolution.\n\nIn this very Chamber 53 years ago, Senator Javits, in debating the  overturning of President Nixon's veto of the War Powers Resolution,  called the power to bring America into war the ``most awesome power in  the possession of any sovereignty.'' This resolution, he said,…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696566/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…the 2.4 percent  growth the economy experienced in the last quarter of 2024. This now is  the worst economy that a President has had in their first 100 days  since President Nixon.\n\nDespite promises candidate Trump made that he would lower costs on  day one, prices remain high, and, in fact, it is expected that prices  could rise by 6.5 percent by year's…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690572/new-federal-economic-data"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…better than D.C. how to strike the proper balance in D.C.\n\nI will read for my Republican colleagues part of the signing  statement your fellow Republican, President Richard Nixon, issued on  the D.C. Home Rule Act: ``One of the major goals of this administration  is to place responsibility for local functions under local control and  to provide local…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695641/district-of-columbia-policing-protection-act"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…War Powers Act of 1973, referenced by Senator Sanders, is not  worth, in my view, the paper it was written on. It was an effort by the  Congress back then to limit President Nixon's involvement in the  Vietnam war.\n\nThe way you do that constitutionally is that Congress has the power  of the purse. If we don't like what a President is doing in terms of…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693122/motion-to-discharge-sj-res-59"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…Mr. Good's dedication to his community was matched by his unwavering  commitment to his country's political life. He was honored to serve as  a delegate for Presidents Richard Nixon and Ronald Reagan, playing a  meaningful role in advancing their principles and vision during pivotal  moments in our Nation's history. His decades of support demonstrate not…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695832/recognizing-edmund-good-on-the-occasion-of-his-100th-birthday"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…sacrifice that have  shaped our Nation, and to keep fighting for the American Dream that has  stewarded freedom for generations of Americans.\n\nI rise today to recognize the Richard Nixon Presidential Library and  Museum in Yorba Linda for helping lead this nationwide commemoration.  Its new exhibit, ``America 250: A More Perfect Union,'' invites  visitors to…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697697/recognizing-richard-nixon-presidential-library-and-museum"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Neukam, Stephen:       Axios; Ngo, Madeleine: New York Times; Nichols, Hans: Axios;       Niiler, Eric: Wall Street Journal/Dow Jones; Nishida,       Shinichiro: Mainichi Shimbun; Nixon, Ronnie: Associated       Press; Nolp, Paul: Agence France-Presse; Norman, Jane: States       Newsroom.\n\nNorwood, Candice: The 19th; Norwood, Mike: Thomson Reuters;       Notheis,…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698132/members-entitled-to-admission-to-the-119th-congress-daily-press-gallery"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…have grown over generations and made the restaurant a  cornerstone in this area.\n\nToday, the Wagon Wheel continues to thrive under their daughter,  Mina, and her husband, Bill Nixon, who carry on the same traditions and  standards that have guided the restaurant for nearly 50 years. Their  son, Mike, also remains actively involved, especially during the…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696937/recognizing-the-katergaris-family"}, {"senator": "Nicole Malliotakis", "party": "Republican", "sentence": "…It was Republican Jeannette Rankin who 4 years prior made history in  1916 as the first woman elected to the U.S. House of Representatives.\n\nIn 1972, it was President Richard Nixon who signed Title IX into law,  eliminating sex discrimination in education and athletics, opening  doors for female athletes to receive scholarships.\n\nIn 1981, Sandra Day O'Connor,…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689367/womens-history-month"}]