[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…and one to establish, within the Department of Commerce, a       National Oceanic and Atmospheric Administration.\n\nThis was the work of a Republican President: the EPA and NOAA. And  look what is happening to it today.\n\nThe Administrator of the EPA Lee Zeldin testified before our  committee today. He is calling to cut the EPA in half--cut it by more…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691582/hj-res-88"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…rejected Trump's plan to slash funding for  scientific research and the National Science Foundation's budget by 57  percent, cut NASA's science budget in half, and devastate NOAA and  climate research that all of us rely on for accurate weather  forecasting, whether we know it or not.\n\nTrump also wanted to cut funding to prevent violence against women…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698874/commerce-justice-science-energy-and-water-development-and-interior"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…There are national security assets there. There  is the Northwest Training and Testing Range, so it is a complicated  place to do a project like this.\n\nIt is a good thing that NOAA was able to charge market fees when they  approved a special use permit that took into account all of these  complexities, because those fees ended up being very necessary.…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699959/undersea-cable-protection-act-of-2025"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…invented by China, that Tylenol  use in pregnancy causes autism--the list goes on and on. And over this  past year, we have seen systematic attacks on scientists at CDC, at  NOAA, the EPA, and the NIH--career professionals driven from public  service for the crime of publishing findings the President doesn't  like, DOGE'd for speaking truth to power,…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700183/state-of-the-union-address"}, {"senator": "Scott Peters", "party": "Democrat", "sentence": "…Institution of Oceanography. Her research focuses  on addressing the threats that toxic algal blooms pose to public  health, fisheries, and coastal recreation.\n\nWith cuts to NASA, NOAA, and the National Science Foundation, she has  seen labs at Scripps shut down and watched her coworkers lose their  jobs.\n\nAnother scientist whose research focuses on ensuring…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695749/funding-cuts-to-science"}, {"senator": "George Whitesides", "party": "Democrat", "sentence": "…track fires as they move and spread  are at risk of being deorbited. Employees in my home district who work  at NASA Armstrong and JPL have no idea what their futures hold.\n\nNOAA, an organization that helps families across the country prepare  for natural disasters like hurricanes and tornadoes, is being gutted  from the ground up.\n\nThe NIH, which works…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691391/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…cleanup. It fuels economies and  strengthens resilience. Since its creation in 2006, the Marine Debris  Program has removed more than 36,000 metric tons of debris. According  to NOAA, last year, the program's removal projects drove more than $474  million in tourism and $248 million in recreational value in just the  four States in which it operates.\n\nThe…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698190/save-our-seas-amendments-act"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…recent floods  and devastating storms to know how important the Coast Guard can be in  responding to these emergencies and disasters, but they need their  partners at FEMA and NOAA.\n\nI strongly support this bill and the great work the Coast Guard does  to protect our citizens and waters, including in and around the  district I represent in the San Francisco…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694198/coast-guard-authorization-act-of-2025"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…administration that is antiscience and antiprogress.\n\nJust as we have made investments in projects that are pivotal in  artificial intelligence, quantum, and other leading areas at NIH, NOAA,  NASA, the CDC, EPA, and, tragically, the National Science Foundation,  now is not the time that we stop investing in our future. This is what  the Trump administration is…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691389/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…Republicans in Congress to gut Medicaid.\n\nNo. 54, terminated hundreds of VA contracts, including those in  cancer research and suicide prevention.\n\nNo. 55, fired more than 1,000 NOAA employees nationwide.\n\nNo. 56, gutted USAID and halted global humanitarian assistance.\n\nNo. 57, fired 2,400 VA employees, with plans to cut 80,000 additional  VA employees.…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690442/trump-administration-first-100-days"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…takes practical steps to support the Federal  programs responsible for removing debris and protecting the safety and  resilience of our coastal communities.\n\nThe bill improves NOAA's Marine Debris Program by giving the agency  clear authority to use new and existing tools to address pollution more  effectively and allowing NOAA to work faster and in closer…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698191/save-our-seas-amendments-act"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…Congress just a couple of weeks ago by the  President that would cut over a billion dollars in science, education,  and workforce programs. A budget that would slash 30 percent of NOAA's  budget, and strip the Environmental Protection Agency of more than half  of its funding.\n\nThat is why nearly 2,000 doctors, scientists, and researchers have  called this…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691393/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…director who doesn't  even know we have a hurricane season. Well, we do have a hurricane  season, and it is estimated by the National Oceanic and Atmospheric  Administration, or NOAA, that there will be at least 10 hurricanes this  year.\n\nAfter firing hundreds of weather experts and saying they wanted to  traumatize the rest, NOAA is now scrambling to refill…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692184/concerns-about-hurricane-season"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…weather effects, First Street reports  that natural disaster damages have risen more than tenfold since the  1980s and now cost the global economy over $200 billion per year.  NOAA's 5-year average of billion-dollar disasters in the period from  1980 to 2024 averaged nine of them per year; 1980 to 2024 averaged 9  billion-dollar disasters per year. From…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699613/9999"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…percent, including fundamental research, education, and  broadening participation efforts.\n\nOther agencies have been impacted by the funding cuts, including NIH  by 37 percent, NOAA by 24 percent, the EPA by 54 percent, NASA's  science arm by 46 percent, and the Department of Energy Office of  Science by 14 percent, among many others.\n\nLong term, these…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691390/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…These  are just statutes in the Committee on Natural Resources' jurisdiction.\n\nMany of these laws are implemented by the National Oceanic and  Atmospheric Administration, or NOAA. We will hear from our friends on  the other side of the aisle that this bill hinders NOAA's ability to  conduct an environmental review of these projects. That is simply not…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699960/undersea-cable-protection-act-of-2025"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…Maritime Systems. Sec. 332. Pilot program for governance and oversight of small uncrewed                maritime systems. Sec. 333. Coast Guard training course. Sec. 334. NOAA membership on Autonomous Vessel Policy Council.  Sec. 335. Technology pilot program. Sec. 336. Uncrewed systems capabilities report. Sec. 337. Medium unmanned aircraft systems…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Frank Lucas", "party": "Republican", "sentence": "…this Congress along with my  colleague and friend, the ranking member of the Science, Space, and  Technology Committee, Ms. Lofgren.\n\nIt updates the reporting requirements for NOAA's Office of Commercial  Remote Sensing Regulatory Affairs so that Congress can monitor how  regulations are impacting the growth and improvement of the commercial  remote sensing…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688972/commercial-remote-sensing-amendment-act-of-2025"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…bill now under  consideration.\n\nMr. Speaker, I rise in support of H.R. 1325, the Commercial Remote  Sensing Amendment Act of 2025.\n\nThis bill updates reporting requirements for NOAA's Office of  Commercial Remote Sensing Regulatory Affairs, giving Congress the  ability to monitor how regulations are affecting the expansion and  development of the commercial…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688971/commercial-remote-sensing-amendment-act-of-2025"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…farmers back home in Kansas and manufacturers in my State can compete  and sell their goods around the world.\n\nFinally, this bill invests in our Nation's science Agencies--NASA,  NOAA, and the National Science Foundation--to advance U.S. leadership  in scientific discovery and space exploration. At NASA, it bolsters  American leadership in human spaceflight,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699098/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}]