[{"senator": "Rob Menendez", "party": "Democrat", "sentence": "…crashes in our  region, resulting in at least 31 fatalities. We also continue to hear  from countless New Jersey residents whose lives are upended by the  constant, incessant noise of helicopters traveling at low altitudes  over our neighborhoods.\n\nSince taking office, we have consistently worked to address these  challenges, from the noise and nuisance…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690739/threats-nonessential-helicopters-pose-to-public-safety"}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "…doing our jobs in following the Constitution  and participating in the peaceful transfer of power. Then things  started to change. Information came in pieces, and we could hear noise  building outside the building. It became clear very quickly that  something was wrong.\n\nVice President Pence was sitting where the Presiding Officer is  sitting, and he was…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698511/9999"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…will look back on a decade in which 70       percent of our people lived in metropolitan areas choked by       traffic, suffocated by smog, poisoned by water, deafened by       noise, and terrorized by crime?\n\nThese are not the great questions that concern world       leaders at summit conferences. But people do not live at the       summit. They live in…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691582/hj-res-88"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…back down. In the words  of the late, great John Lewis: ``We have been too quiet for too long.  There comes a time when you have to say something. You have to make a  little noise. You have to move your feet. This is the time.''\n\nTogether, we must make a little noise and create good trouble to  protect the progress we have fought so hard for. Together,…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687894/black-history-month"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…different  stakeholders making their perspectives clear, the New England Council  can definitively speak in one voice to ensure that our region's  priorities break through the noise.\n\nOn behalf of Rhode Island, I want to congratulate the New England  Council, president and CEO Jim Brett, the entire board of directors,  and all its members on a well-earned…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696048/100th-anniversary-of-the-new-england-council"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…which would establish a grant program for the  design and construction of barriers to mitigate rail activity that can  harm homes and their occupants, including derailments, noise and  vibrations. District of Columbia residents frequently tell me about the  negative impact of train noise and vibrations on their lives. Train  noise and vibrations can…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696790/introduction-of-the-protecting-homes-from-trains-act-of-2025"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "Ms. NORTON. Mr. Speaker, today, I introduce the Train Noise and  Vibrations Reduction Act of 2025, which would direct the Government  Accountability Office (GAO) to submit a report to Congress containing  recommendations on how to reduce…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689433/introduction-of-the-train-noise-and-vibrations-reduction-act-of-2025"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…somebody says ``Oh, that is not true''; they  just dial up the volume and say it twice as much. It is not intended to  be true. This is not a quest for truth; this is a barrage of noise and  propaganda designed to cover the truth.\n\nOn the money side, we are into multiple billions of dollars that are  poured into this building from fossil fuel industry coffers…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697077/climate-change"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…matter, Mr. Speaker, what you decide to do  today, that is our struggle. Standing on the shoulders of John Lewis,  that is our struggle.\n\n``Never, ever be afraid to make some noise and get in good trouble-- '' good trouble, good trouble--``necessary trouble.''\n\nStanding on the shoulders of giants, John Lewis would often talk to  us about his admiration…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…my colleagues to reject this resolution. Mr. Speaker,  you have the opportunity to stand up for public lands and the Boundary  Waters and prevent the inevitable water, air, noise, light, and land  pollution that will destroy this unique wilderness.", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699272/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…like hell to keep these extremely loud data centers and their emissions  out of your community.\n\nSo, for more expensive utility bills, and increased air, water,  light, and noise pollution, we get a lot more AI slop bullshit that  nobody asked for.\n\nThe Silicon Valley billionaires don't care about our communities.  Believe me when I tell you, all they…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697553/protecting-michigan-communities-from-data-centers"}, {"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "…will live  on through the extensive and beautiful legacy that she built. The  legacy she left has lit fires under enough people in Kansas City, so  they can forage through the noise and echo her advocacy, which will  keep her spirit alive for eternity.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698825/recognizing-the-life-and-memory-of-alice-kitchen"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…libraries, Republicans are waging a culture war on anything they  cannot control.\n\nTheir goal is simple: Erase facts, silence independent voices,  replace them with partisan noise, and use them as propaganda machines  to spread disinformation and continue to divide our Nation.\n\nThe latest example is President Trump's removal of Dr. Carla Hayden  as Librarian…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691316/republicans-assault-on-american-arts-culture-and-public-knowledge"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…Mr. Speaker, the second session of this Congress is not about  starting  over. It is about following through. Kansans sent me here to stay  focused on results, not political noise. I will continue working to  make sure this body delivers real outcomes for the Big First District  of Kansas and keeps its promises to the people whom we serve.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698651/following-through-on-americans-priorities"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…my  staff saying: Hey, it is only 30 minutes this time, not an hour.\n\nMr. Speaker, I want to do just a handful of things. One of these days  we are going to have not enough noise about the facts, the numbers, the  data, the debt, those things that we can come in and sort of do our  boards, our charts, on things that actually reduce spending and  modernize.…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690748/the-math"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…rather let Medicaid spiral into  insolvency with no solution in sight than support a basic principle  that if you are able to work, you should.\n\nNow, Mr. Speaker, we have heard noise from across the aisle, words  like ``cruel'' and ``harsh,'' and all the hyperbole you could expect to  be thrown around to score political points from their base. Let me be…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691514/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "Mr. EDWARDS. Mr. Speaker, there is a lot of noise coming from the  other side claiming that House Republicans are cutting Medicaid with  our commonsense work requirements.\n\nLet me be clear: That is just not true.\n\nYou can't…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692933/medicaid-should-serve-the-truly-needy"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…Speaker, Republicans are not distracted by that fear- mongering and doomsaying of those who want H.R. 1 to fail. The facts  are on our side, and we have been cutting through the noise by bringing  those facts to the American people for months.\n\nSo that the record is clear, a vote against this legislation is a  vote to green-light the largest tax increase…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693234/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…when you get pulled  over because you had a lead foot, Mr. Speaker, that same police officer  is the police officer who you call in the middle of the night when you  hear a noise in the backyard and something at the door.\n\nWe have to protect the rule of law, and we only do that through  protecting our men and women of law enforcement.\n\nA few weeks ago…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691164/events-this-week"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…my time.\n\nMrs. FISCHBACH. Mr. Speaker, I am prepared to close, and I reserve  the balance of my time.\n\nAs we wrap up this debate, I want to take a moment to cut through the  noise from our colleagues on the left. Instead of focusing on the  legislation before us, they are resorting to fear tactics and tossing  out false claims about what this shutdown…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696682/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…investment decisions are based solely on maximizing  returns for the benefit of the retiree and not a social experiment.\n\nMr. Speaker, the American people are tired of the regulatory noise  coming out of Washington. They want a government that works for them,  not against them. These five bills deliver on our promise to cut red  tape, empower families, and protect…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698949/providing-for-consideration-of-hr-protecting-prudent-investment-of-retirement-savings-act-providing-for-consideration-of-hr-flexibility-for-workers-education-act-providing-for-consideration-of-hr-empowering-employer-child-and-elder-care-solutions-act-providing-for-consideration-of-hr-tipped-employee-protection-act-and-providing-for-consideration-of-hr-save-local-business-act"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…written  records in Epstein's own estate documents show Delegate Plaskett sought  his input for an official hearing.\n\nThis is the issue, that alone. Everything else is just noise.\n\nThis Chamber cannot overlook that a sitting Member of Congress  coordinated with a convicted sex offender to prepare questions for an  official proceeding. Imagine telling…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696890/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}]