[{"senator": "Jim McGovern", "party": "Democrat", "sentence": "…convince you that this is a  commonsense, simple bill, but I want you to remember a very few  important facts while he is talking.\n\nFirst of all, it is already illegal for noncitizens to vote in  Federal elections, period, full stop. If noncitizens are voting in  Federal elections, they should be prosecuted. We don't disagree on  that.\n\nSecond, nobody disputes…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699941/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…through the security measures that are in place to  ensure the integrity of our elections.\n\nI can tell you this, in case you didn't know already: It is already a  crime for noncitizens to vote in our elections. To propose it as a new  law is misleading. It is already against the law. And, by the way, it  is also extremely, extremely rare.\n\nBut if our Republican…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690535/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…noncitizens  from voting in congressional and Presidential elections.\n\nSo this is not a question of whether there is some backdoor effort on  the part of one party to allow noncitizens to vote. It can't be done.  It is illegal now. This Executive order would not change that.\n\nStudy after study has also shown that the rate of noncitizen voting  is incredibly…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690522/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…law, such as the SAVE Act, which would make it  harder for millions of Americans to cast their ballots.\n\nMr. Speaker, the facts are clear: It is already illegal for  noncitizens to vote in Federal elections, or in any elections. In fact,  under current law, noncitizens would face up to 5 years in prison for  attempting to vote in Federal elections and…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689343/fighting-voter-suppression"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…whether in the District of Columbia or in  the districts of any Member here.\n\nOne of the bills before us last week, H.R. 884, would repeal D.C.'s  local law that allows  noncitizens to vote in local elections. I have serious concerns with  allowing noncitizens who do not hold a green card to vote in local  elections, but this is the wrong way to go about…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692632/opposition-to-hr-hr-and-hr-2096"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…vote.\n\nI want to be clear; this bill is not simply a voter ID bill and  labelling it as such is a trick to convince Americans of its intent. It  is already illegal for noncitizens to vote in federal elections. Now,  Republicans want to force every American to provide burdensome and  expensive ``documentary proof of citizenship''--similar to what  Minnesotans…", "date": "2026-02-13", "source_url": "https://justfacts.votesmart.org/public-statement/1700083/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…Mayor, members of the city council, the State  Board of Education, attorney general, advisory neighborhood  commissioner, and ballot measures.\n\nThe D.C. law does not allow noncitizens to vote in Federal elections,  which is a crime under Federal law.\n\nRegardless of your views on the merits of noncitizen voting for local  elections, we have to acknowledge…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692318/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Greg Landsman", "party": "Democrat", "sentence": "…LANDSMAN. Mr. Speaker, I rise today because the House just voted  on the SAVE America Act, which will make it harder for tens of millions  of Americans to vote, not noncitizens. Noncitizens can't vote. They  can't register to vote. If they do, they will be deported.\n\nAmerican citizens are being denied their right to vote by requiring,  in this bill, all kinds…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700021/making-it-harder-for-us-citizens-to-vote"}, {"senator": "Marc Veasey", "party": "Democrat", "sentence": "…President's executive order on elections,  is a crazy, disgusting, thinly veiled attempt at disenfranchising legal  citizens from voting.\n\nIt claims to make it illegal for noncitizens to vote, which we  already know is not a problem, but this bill would also disenfranchise  millions of Americans who don't even have a passport. Millions of  Americans do not…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689430/disenfranchising-voters"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…D.C. election laws, including 14 to  prohibit noncitizens from voting in D.C. or to repeal, nullify, or  prohibit the carrying out of the local D.C. law that allows noncitizens  to vote in local elections.\n\nYet, Republicans refused to make the only election law change D.C.  has requested, which is to make D.C. a State so they can hold elections  for…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692314/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "…doesn't even take into  consideration women of all races who changed their names when they got  married. It is ridiculous.\n\nIt has been a Federal crime, we know, for noncitizens to vote since  1996. Georgia audited 8.2 million voter registrations and found 20  noncitizens, Mr. Speaker, 20. That is the emergency. That is the  emergency that justifies…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699939/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…could have voted if they wanted to, and I will tell you that  some did.\n\nWhile the Biden-Harris administration refused to verify the  citizenship of these voters, 40 noncitizens attempted to vote in Iowa.  Five of those attempts were caught before the ballots were counted, but  35 unlawful ballots were actually tallied.\n\nThanks to President Trump's Executive…", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697595/voting"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…are  aligned with embassies of foreign countries, to vote in local D.C.  elections. After the noncitizen voting law went into effect, the  District actively encouraged noncitizens to vote for Mayor, attorney  general, members of the State Board of Education, and more.\n\nSome may wrongly dismiss these as merely local elections. However,  the reality is…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692315/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Nicole Malliotakis", "party": "Republican", "sentence": "Ms. MALLIOTAKIS. Mr. Speaker, I rise to ask the question: Why are the  Democrats so obsessed with allowing noncitizens to vote in our  election? Why do they go out of their way to dilute the voices of  American citizens, the very American citizens who elected them to  represent them?\n\nIt is…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692316/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…identity all make cheating easy  and destroy the public's confidence in the process.\n\nIn many jurisdictions, the Democrats have made it clear that they  intend to allow noncitizens to vote, the ultimate in foreign election  interference.\n\nI have news for my colleagues on the other side of the aisle:  American elections are for Americans.\n\nThe SAVE Act…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690012/safeguard-american-voter-eligibility-act"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…principle is that individuals  when they vote show voter ID. Both of these are commonsense principles.\n\nWe know there are some on the other side of the aisle who want  noncitizens to vote in our elections. In fact, we could just look at  our Nation's Capital, which allows noncitizens to vote under current  law in municipal elections.\n\nI am of the view…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700014/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…Mr. Speaker, is use Washington, D.C.,  as a petri dish for liberalizing voting laws across the country. What  my Democratic friends want to do, Mr. Speaker, is allow noncitizens to  vote across the country.\n\nThe arguments that are being made fail on the merits when you  recognize that, in fact, the law, Mr. Speaker, today, allows  noncitizens who simply…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692319/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "David McCormick", "party": "Republican", "sentence": "…Finally, it improves accountability by strengthening the enforcement  of the current law and imposing penalties on election officials who  violate the law by registering noncitizens to vote.\n\nNow, the requirements for voter ID and proof of citizenship in  particular have been twisted and misrepresented. Let me set the record  straight. Federal law mandates…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700069/9999"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Citizenship matters.  Sovereignty matters. Americans alone must decide America's future.\n\nYet radical Democrats have abandoned the standard. New York City has  allowed noncitizens to vote in local elections. Washington, D.C., has  done the same, granting political power to foreign nationals in the  Capital of our Nation.\n\nGeorgia's own Senator John Ossoff,…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700004/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…voted. That may  not sound consequential, but there are races that are decided by less  than that.\n\nThe votes against the SAVE Act today were nothing more than to allow  noncitizens to vote in the United States of America. I think that falls  into the category of the 80/20 position. All I know, Mr. Speaker, is a  vote against the SAVE Act today was a vote…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690081/protecting-the-rights-of-american-citizens-to-vote"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…databases so they can  perform this important voter list maintenance.\n\nIn recent years we have seen an increasing number of jurisdictions  across the country allowing noncitizens to vote in municipal elections.  Right here in our Nation's Capital, noncitizens are eligible to vote in  these municipal elections. In Washington, D.C., a noncitizen only has…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690007/safeguard-american-voter-eligibility-act"}, {"senator": "Claudia Tenney", "party": "Republican", "sentence": "…member, Mr. Morelle. We both hail from New York. He is a dear  friend, but I just want to point out something.\n\nNew York City Democrats actually put up a bill to allow noncitizens  to vote in their elections. Our far-left leaning--and I think you can  argue that very easily--Court of Appeals, New York's highest court,  actually turned that down and said:…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700012/veterans-accessibility-advisory-committee-act-of-2025"}]