[{"senator": "Mark Takano", "party": "Democrat", "sentence": "Mr. TAKANO. Mr. Speaker, I thank my esteemed colleague, Dr. Foster,  for yielding, for organizing and hosting this Special Order hour, and  for his leadership on nuclear nonproliferation issues.\n\nIn my many years as a Member of Congress, I have watched many a fiery  floor speech filled with overstatement and hyperbole, grandiose  pronouncements laced with…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699031/expiration-of-new-start"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…the wrong direction. Last week, the Appropriations Committee  approved an energy and water bill that cuts the National Nuclear  Security Administration's Defense Nuclear Nonproliferation account by  $412 million. That is 17 percent. These activities help the U.S. stop  the spread of nuclear weapons, detect hidden nuclear activities, and  support arms control…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694117/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…forces. Russia continues to  engage in irresponsible nuclear saber-rattling during its illegal war  in Ukraine, and Iran and North Korea continue to change the global  nonproliferation regime.\n\nIn this environment, allowing arms control to collapse is not a show  of strength. It is an abdication of leadership that increases the risk  of miscalculation…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699037/expiration-of-new-start"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…Illinois,       to be an Assistant Secretary of Defense.\n\n12. Executive Calendar #152--Matthew Napoli, of Virginia,       to be Deputy Administrator for Defense Nuclear       Nonproliferation, National Nuclear Security Administration.\n\n13. Executive Calendar #153--Richard Anderson, of Virginia,       to be an Assistant Secretary of the Air Force.\n\n14. Executive…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695711/s-res-377"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…on August 29th, and to commend the Republic of Kazakhstan for its  role in working collaboratively with the United States to pursue  nuclear disarmament and our shared nonproliferation goals. In doing so,  our two countries have preserved peace, stability, and a world free  from the ever-present threat of nuclear conflict.\n\nWhen the Soviet Union dissolved…", "date": "2025-08-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694764/marking-the-15th-annual-international-day-against-nuclear-tests"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…stop talking about it, and we should certainly stop wasting  money on it.\n\nAnother place where we were always in strong agreement was how we  should be strengthening the nonproliferation efforts at our national  laboratories.\n\nOur national labs create an underlying foundation for all of our  nuclear security efforts including the nonproliferation and national…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694113/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…far worse. That is not the bar that we should set for ourselves.\n\nI am particularly concerned about the 17 percent cut in the funding  for the Office of Defense Nuclear Nonproliferation within NNSA.\n\nThis cut comes on top of last year's continuing resolution, where  this office was cut by 7 percent and was only one of a few accounts to  see its budget…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694866/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…compensate the communities who paid  the price for that last generation of weapons, so we must act in good  faith to ensure an open-ended arms race does not happen.\n\nNuclear nonproliferation has not been and should not be a partisan  issue. We don't need more weapons. We need more affordable healthcare,  upgrades to our transportation infrastructure, expansion…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699034/expiration-of-new-start"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…understand the powers and  effects of nuclear weapons, and the site played a major role in shaping  national and international policies involving nuclear testing and  nonproliferation.\n\nThe radiation, however, given off by the more than 100 atmospheric  tests had devastating impacts on those downwind. The fallout caused  cancer and premature deaths…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696970/nuclear-testing-opposition"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…were part of that testing.\n\nThe test site became a real player and had a major role in shaping  our policies, both nationally and internationally, regarding testing  and nonproliferation.\n\nThe radiation given off by more than 100 atmospheric tests had  devastating impacts, however. It wasn't a tourist attraction to those  downwinders who were exposed.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699032/expiration-of-new-start"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…across continents, helped build the momentum  to end nuclear testing. We must draw on that same spirit today to  reinvigorate arms control diplomacy, rebuild confidence in  nonproliferation regimes, and press forward on treaties like the  Comprehensive Nuclear-Test-Ban Treaty.\n\nOn this 15th Annual International Day Against Nuclear Tests, I urge  my colleagues…", "date": "2025-08-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694763/marking-the-15th-annual-international-day-against-nuclear-tests"}, {"senator": "Brad Schneider", "party": "Democrat", "sentence": "…nuclear bombs  within a few months or even a few weeks. The worry, after the IAEA  report issued 2 weeks ago declaring Iran was no longer in compliance  with the Nuclear Nonproliferation Treaty, was that the regime may have  decided to do exactly that.\n\nI just returned from visiting Saudi Arabia, Bahrain, and the United  Arab Emirates with colleagues,…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692935/cancellation-of-iran-classified-briefing"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…jeopardy.\n\nBy foolishly announcing his intention to resume nuclear explosive  testing, Trump will trigger a dangerous nuclear arms race that would  blow apart the nuclear Nonproliferation Treaty. In fact, Vladimir Putin  has already directed his forces to prepare a resumption of nuclear  testing and, just this week, the Washington Post reported that China…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696948/opposition-to-explosive-nuclear-testing"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…be an Assistant Secretary of Energy (Fossil Energy)\n\nExecutive Calendar No. 152, Matthew Napoli, of Virginia, to       be Deputy Administrator for Defense Nuclear Nonproliferation,       National Nuclear Security Administration\n\nExecutive Calendar No. 153, Richard Anderson, of Virginia,       to be an Assistant Secretary of the Air Force\n\nExecutive…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695696/authorizing-the-en-bloc-consideration-in-executive-session-of-certain-nominations-on-the-executive-calendar"}]