[{"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…and the recording said 15-minute wait, and after time       passed, the recording said I would be helped as soon as       possible, then said they were receiving higher than normal       call volumes . . . After several rings, the recording said .       . . leave [a] message (which I did) and someone will return       your call, but that hasn't happened…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690633/nomination-of-frank-bisignano"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…land.\n\nNow, I know that the word ``unprecedented'' gets used so much these  days that perhaps it has lost some of its value, but we need to put in  context just how far from normal these strikes are.\n\nFor perhaps the first time in our history, a President of the United  States ordered the U.S. military to use lethal force against  individuals who posed…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696120/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…Tuesday will  come again soon.\n\nMr. Speaker, people in my region want a job they can count on. They  don't want ying-yang on U.S. trade and tariff policy. Let's get back to  normal.", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693472/unfair-tariffs-on-canada"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…is more important.\n\nIf you are associated with a gang, then you have lost your  constitutional rights. That is what he is inculcating in our society.  He wants to make that normal. If you allow this to be normal, if we  allow this to be normal, if I allow this to be normal, we are  disserving the people, in my case, that I represent.\n\nThe Constitution…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690560/a-message-to-the-cabinet"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…that is a massively dangerous amplification of authoritarian  power, and that is why what we do this year makes such a difference.\n\nAnd we have to protest and say this is not normal. We have to ring  the alarm bells. We have to praise the 7 million people who got out  there and said: No Kings in the United States. And that is such a  beautiful, short way…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696355/trump-administration"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Committee, we considered the negative impact that these cell  phones and laptops have on children. It is frightening.\n\nParents came and testified before us that their kids--normal, happy,  productive, good students--in a short period of time were captivated by  laptops and cell phones into changes in attitude, changes in conduct.  Sadly, some of the…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698999/disrupt-explicit-forged-images-and-non-consensual-edits-act-of-2025"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…electrons--there is a huge backlog of them.\n\nSo we have an industrial renaissance happening in certain States, and  we have all of this AI data center load coming up, and we have your  normal American economy stuff happening. There are not enough electrons  on the grid.\n\nWhat happens when there is not enough of something? The people  selling that thing raise the…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699020/energy-costs"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…investigations and subpoenas, and it would be a national  scandal. Yet, we are hearing nothing from Republicans because they are  in a cult.\n\nI will say what they won't: None of this is normal. This is not a  joke. This is not something Republicans can  shrug off or turn away from. This President is threatening a NATO ally  in writing, and the world is responding.…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699220/providing-for-consideration-of-hr-supporting-pregnant-and-parenting-women-and-families-act-providing-for-consideration-of-hr-pregnant-students-rights-act-and-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…My amendments sought to limit the harm that this bill would cause and  ensure that every citizen had accessible and secure ways to register  and cast a ballot. This seems normal to me. This isn't about ID. This  is about access. This is about procedures that will minimize the  inconvenience to the United States citizens to cast their ballots.\n\nDespite…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699934/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…reflecting a familiar theme: that until President Trump thumbs  his nose definitively at a Court ruling, then his attacks on democracy  are troubling but not lethal. It is normal politics up until that  dramatic confrontation between the executive branch and the judicial  branch, for which the Constitution, as we know, really has no  prescribed remedy.…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690111/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "…disease.\n\nConner comes to my office almost every year to tell me about his  aspirations and to beg that we keep funding not just the research that  may provide him with a normal lifespan but those things that give him a  reasonable quality of life, a shot of achieving that dream of going to  college.\n\nMr. Speaker, my colleagues are not voting on numbers…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689793/defending-medicaid-for-families-like-the-currans"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…We have an opportunity to do something because our Republican  colleagues--at least some of them--understand the magnitude of this  problem for their constituents. So the normal thing to do in a  functioning legislative body, where the President of the United States  does not believe that he is an elected Monarch, is to try to negotiate  some accommodation.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695916/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Wesley Bell", "party": "Democrat", "sentence": "…broke. They feel shut out.\n\nUnder President Trump, influence isn't just whispered behind closed  doors; it is put up for sale. Money flows in and policy flows out. That  is not normal. That is not acceptable. In this administration, access  is bought instead of earned. If you are a billionaire or a special  interest, you get a seat at the table. If you are…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699585/stop-the-republican-affordability-crisis"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…product reflecting the priorities of both Congress and the White  House for protecting our Nation. That is how it normally works.\n\nBut make no mistake, this year is anything but normal. What we have  seen just 1 year into this second Trump administration is the  destruction of eight decades of bipartisan foreign policy consensus and  the destruction of postwar…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698259/nominations"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…feeding  of the fossil fuel industry and big polluters and who takes a perverse  joy from destroying American government from the inside.\n\nSo there will be misery ahead for most normal people, not counting  the weird ones who like inflicting pain and doing damage for the  benefit of a bunch of creepy, rightwing billionaires who have propped  them up their…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695927/government-funding"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…single daughter in the United States, but particularly  for our servicemembers, our women in uniform. The Republican Party is  the party of common sense. We are the party of normal. We are the party  of women.\n\nMr. Chair, I yield back the balance of my time.\n\nMs. MACE. Are you--", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695260/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…for their family, and they think: Gee, I have  got to give all that extra money back to the government, is it worth  being away from my family?\n\nWe say, you know what? Yeah, normal tax rates apply on everything  else, but if you work overtime, you are not going to pay taxes on that  overtime. This is somebody making $60,000 a year, not the billionaire.…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693191/one-big-beautiful-bill-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…football.\n\nThe resolution before us does not mandate projects, mining sites,  firms, or schedules. It simply reverses the Biden administration's  unilateral short-circuiting of the normal permitting process.\n\nThis resolution is a step toward balance and the rule of law. It is a  step toward the mineral abundance that the American people deserve and  that Washington…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699275/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "French Hill", "party": "Republican", "sentence": "…rates.--The limit on the rate of       interest referred to in paragraph (2) shall be not greater       than--\n\n``(A) the rate paid on deposits of similar maturity in the       normal market area of the covered insured depository       institution for deposits accepted in the normal market area       of the covered insured depository institution; or\n\n``(B)…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…renounces what they have been doing since 1979 and changes  course, or it is replaced.\n\nTo expect Israel to do anything else is offensive to me. You are  asking Israel to accept as normal being attacked every day and every  night by over 500 ballistic missiles? Over 24 Israeli citizens have  been killed. The missiles going into Israel are designed to kill  children.…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692780/iran"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "…down again--or at least go the other direction.\n\nSome fights aren't worth winning, much less losing. I have always  loved this institution and the norms of it, but this is not normal.  This is the exception. And this I do not want to ever have become  normal. But I, as somebody who appreciated the relationships--and still  do--that I have had with Joe Biden's…", "date": "2025-08-02", "source_url": "https://justfacts.votesmart.org/public-statement/1694711/9999"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…front of the policies the President is putting forward in  such a way that raises questions about whether they are carrying out  their jobs responsibly and in accordance with normal judicial ethics  and procedures.\n\nTherefore, I offer this amendment that would reduce the budget of the  district court, the D.C. District Court and D.C. Circuit Court, by…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699058/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…of a  rule, the mechanism of a rule, is abused for some purpose that actually  impacts policy.\n\nThat is what we had in this particular rule. At the end of it, which  was a normal rule for most purposes, but at the very end, Mr. Speaker,  you had tacked on this peculiar provision which starts by saying that  each day during the period from February 10,…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700046/legislative-calendar-days"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…to further support recovery.\n\nToo many of our Nation's citizens are stuck in the deadly cycle of  addiction, and we must extend a helping hand so that they can return to  a normal life and be integral members of their communities.\n\nI look forward to supporting this legislation on the House floor this  week to help ensure that our fellow Americans address…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691745/nippon-steel-and-us-steel-merger"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "Mr. GROTHMAN. Mr. Speaker, I think it is important to hear from  legislators on the experiences they had before this week as they toured  their district and as they talked to normal people to see whether their  concerns and observations squared with those of the people in this  building.\n\nDonald Trump has done a great job of trying to remove the diversity,…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689133/educating-young-people"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…each       federally recognized Indian Tribe.\n\n(21) Supply chain shock.--The term ``supply chain shock''--\n\n(A) means an event causing severe or serious disruption to       normal operations or capacity in a supply chain; and\n\n(B) includes--\n\n(i) a natural disaster;\n\n(ii) a pandemic;\n\n(iii) a biological threat;\n\n(iv) a cyber attack;\n\n(v) a geopolitical…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690188/promoting-resilient-supply-chains-act-of-2025"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…On January 30, 2025, Alan Feuer and Adam Goldman mischaracterized my  and Senator Johnson's Arctic Frost disclosures by saying ``messages  showed that FBI investigators took normal bureaucratic steps and  precautions'' when opening the case.\n\nNow, was this supposed to be an opinion piece on behalf of terminated  FBI agents or a real news article?\n\nNormal…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699769/whistleblowers"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…home State of Wisconsin made the news  again, in an effort to remove not just any person here illegally but  somebody who had broken the law, an abuser, somebody who under normal  circumstances would not be viewed favorably.\n\nWe had a judge in Wisconsin stop the hearing. Oh, let's not worry  about putting this guy in jail. Let's let him sneak out the…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690195/wisconsin-in-the-news"}, {"senator": "French Hill", "party": "Republican", "sentence": "…the Federal       Reserve System;\n\n``(vi) how the discount window interacts with other       providers of liquidity, including the Federal Home Loan       Banks, during both normal operations and times of financial       distress;\n\n``(vii) the effectiveness of existing discount window       operating hours and whether such hours should be expanded,…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699861/bringing-the-discount-window-into-the-21st-century-act"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…is interesting? During President Trump's first term,  more than 500 nominees moved en bloc. Do you know why? Because  Democrats allowed them to move en bloc because this was normal to be  able to do. But now we are in a new political age where nothing seems  to be normal.\n\nSo we proposed a very simple thing; that this would be helpful to do  in what is…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695311/cloture-motion"}]