[{"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…January 6, standing  where the gentleman from South Carolina is standing now: Do we have the  courage to stand up to a President who violates our Constitution, our  laws, and our norms?\n\nWill enough of my colleagues across the aisle find that courage? Liz  Cheney found that courage. Liz Cheney--the third-ranking Republican in  the House of Representatives,…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698552/january-6-attack"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…new urgency. The world faces a moment of great  peril: nuclear arsenals are being modernized, new technologies are  emerging that could undermine strategic stability, and the norms  against nuclear testing and proliferation are under strain. The vision  of a world free from nuclear tests and the spread of nuclear weapons,  advanced by Kazakhstan through…", "date": "2025-08-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694763/marking-the-15th-annual-international-day-against-nuclear-tests"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…distant or hypothetical.  It is real. It is now because of the lawlessness and recklessness of  this administration.\n\nAnd it is the result of a contempt for the law, for legal norms that,  seemingly, is boundless. We have seen it in the Jimmy Kimmel episode  where the FCC Chair said, in mobster-like language: They can do it the  hard way or the easy way.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695873/9999"}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "…of our military that are now in some sort of potential future  legal jeopardy. And it is because we have a President that I believe  doesn't do his homework, doesn't follow norms, and possibly is making  decisions that are not legal.\n\n(Mr. BANKS assumed the Chair.)\n\nWe have seen the politicalization of the U.S. military over the last  9 months. That…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696346/trump-administration"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…women worked and labored for our place in this society. We  couldn't vote. We couldn't buy land, and we couldn't even open bank  accounts until about 50 years ago. Societal norms dictated that women  were to be devalued and minimized, and it made it easy to overlook and  dismiss us.\n\nIn spite of this, women have played many important roles in our  country,…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689366/womens-history-month"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…substitute for understanding basic  hydrology and facts.\n\nMr. Speaker, President Trump, Elon Musk, and DOGE continue  dismantling Federal agencies, shredding constitutional norms.  Meanwhile, House Republicans refuse to lift a finger to rein in rogue  actors or defend the rule of law.\n\nIn the face of all of this, American farmers and rural America are…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690601/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…shaping Indo-Pacific strategy, in helping to refocus and  strengthen the indispensable Five Eyes intelligence partnership, or in  speaking out on foundational international norms, he made sure that  Australia and the United States stood shoulder to shoulder against  intimidation.\n\nBeyond policy achievements and strategic vision, Kevin Rudd is one of…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699544/9999"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…this week marks this administration's first 100 days in  office. It has been 100 days of chaos, corruption, confusion, and  absolute destruction of our Constitution and the norms that this great  Nation was built on; 100 days of tearing apart our democracy, our  families, our communities, the vital Federal programs that serve the  people who make up…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690395/attacks-and-threats-on-democracy-and-rule-of-law"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…Charity Adams-Early was born in Kittrell, North Carolina on       December 5, 1918, two years before women's suffrage, where       segregation and racial prejudice were social norms. She often       faced challenges that tested her resilience, but with her       mother's help, she excelled at learning, graduating high       school two years early as the…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688375/recognizing-virginias-fourth-district-black-history-month-essay-contest-1st-place-middle-school-winner-augustus-rezba-patel"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…clinging to  combustion engines. We should be protecting the rules of this Chamber,  not torching them when they become inconvenient to the oil industry.\n\nThe gutting of these norms doesn't end in prosperity; the sacrifice  of clean air doesn't end in making us healthy again. It ends in cancer;  it ends in an enfeebled economy; it ends in a country going…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691621/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…family. His shameless  self-enrichment is without equal in American history. You cannot think  of another President who has been so brazen, so selfish, and so  destructive of the norms of what America is about.\n\nIn truth, though, the news of the Qatari Air Force is just one tip of  the iceberg. For months, Qatar and other Gulf State nationals have  spent…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690971/qatar"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…increasingly aggressive international campaign to exclude  Taiwan from the international community through intimidation, coercion,  and distortion of established and well-accepted norms.\n\nTo be clear, there is no justification in the U.N. General Assembly  Resolution 2758 for Taiwan's continued exclusion from international  bodies. The resolution only established…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690674/taiwan-international-solidarity-act"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…protest my parade,'' warns people  about protests--and this is the thing the President of the United  States doesn't understand about this country: When a President is  violating norms and traditions and violating our Constitution, dissent  is not unpatriotic; protest is not un-American; silence is unpatriotic.\n\nThis is a time where protest is justified.…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692454/alex-padilla"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…States, is a war crime.  It is unconscionable. It is an unconscionable act of aggression that  violates the Department of Defense's own guidelines, U.S. law, and  international norms and laws.\n\nEven President Trump is trying to distance himself from this unlawful  attack, saying that he ``wouldn't have wanted that, not a second  strike.''\n\nLet me be clear.…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697303/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…nation.\n\nWe call on these leaders to reverse course--to remember the       oath we all took to uphold the Constitution--and adhere to       the legal guardrails and institutional norms on which our       justice system relies.\n\nWe call on our fellow alumni to join us in sounding the       alarm, and in mobilizing to support our colleagues still       there.…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…that taxpayer-funded organizations operate within the mission  and guardrails Congress has established.\n\nThe National Endowment for Democracy was created to support  democratic norms overseas, not to engage in domestic political advocacy  or to amplify one side of America's internal debates. That distinction  is essential to its legitimacy.\n\nYet there is…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699440/consolidated-appropriations-act-2026"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…relationship with China. Again, this is not dealing with  another country on the basis of good faith and a knowledge that  everybody is operating from the same set of rules and norms. China does  not, and we have recognized that more recently, but it is important to  reemphasize because some people, I think, still naively assume China  operates by the same…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688824/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…or  silenced.\n\nWhen the United States shows leadership, we know that others follow.  We must lead now before the Chinese Communist Party permanently  rewrites international norms.\n\nI thank Mr. Connolly for his work on this piece of legislation. I  miss seeing my friend here. As much as we have differences on many  things--and we have had many intense…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690676/taiwan-international-solidarity-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…interference and  aggression toward the American financial system is a serious and  growing threat. The CCP has a well-documented history of abusing  international financial norms, jeopardizing both our national and  economic security in the process.\n\nFrom manipulating currency and distorting markets to propping up  state-owned industries and weaponizing…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694119/china-financial-threat-mitigation-act-of-2025"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…ridiculous. Of the 10  million people that Joe Biden let in or 8 million people, whatever,  obviously it is up to ICE to remove as many as possible and get back to  historical norms.", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698892/confusion-over-who-should-be-removed-from-this-country"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…relationship with China. Again, this is not dealing with  another country on the basis of good faith and a knowledge that  everybody is operating from the same set of rules and norms. China does  not, and we have recognized that more recently, but it is important to  reemphasize because some people, I think, still naively assume China  operates by the same…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688807/cormick-and-mmcr-fettermanhagerty-kim-cormick-schumer-sullivan-fetterman-and-others-for"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…administration's  actions in capturing Nicolas Maduro.\n\nOver the past week, Democrats have claimed that Maduro's capture was  unconstitutional, illegal, and violated international norms. Democrats  argue that Congress must declare war or give explicit authorization  before the President can act.\n\nArticle II is clear. The President is the Commander in Chief,…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698883/successful-operation-to-arrest-nicolas-maduro"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "…never ever be able to  go down again--or at least go the other direction.\n\nSome fights aren't worth winning, much less losing. I have always  loved this institution and the norms of it, but this is not normal.  This is the exception. And this I do not want to ever have become  normal. But I, as somebody who appreciated the relationships--and still…", "date": "2025-08-02", "source_url": "https://justfacts.votesmart.org/public-statement/1694711/9999"}]