[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…already setting up their supply chain around the       world. If we don't make profitable EVs in the next five       years, what is the future? We will just shrink into North       America.\n\nWhat about our competitiveness? Are we walking away from that too?  Every step this body takes this week to undermine the growth of what  could be America's next great…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691582/hj-res-88"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…Bureau of Ocean Energy Management,                                Director's Order, December 22, 2025.      Rob Keiser,      Head of Asset Management, Orsted North America Inc., Boston,           MA, College Park, MD.\n\nDear Mr. Keiser: The Bureau of Ocean Energy Management       (BOEM) is issuing this Director's Order to Revolution Wind,…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698558/permitting-reform"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "Mr. HEINRICH. Mr. President, nestled in the far northeast corner of  Alaska is one of the wildest and most untouched places left in North  America: The Arctic National Wildlife Refuge.\n\nI have been blessed to see this refuge with my own eyes. I have seen  its towering peaks; I have seen the critical habitat on the…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697413/9999"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…take this incredibly important agreement and just say  it doesn't matter?\n\nThe kind of uncertainty that we are seeing with these tariffs shakes  business confidence across North America. These tariffs are paid by  families: groceries, clothes, housing. Homebuilders say higher material  costs from tariffs are adding as much as $10,000 to the cost of a new…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696446/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…Westchester  County's seat of government, is a dynamic city of over 60,000 people,  with major corporations headquartered there, such as Heineken USA,  Atlas Air, and Danone North America; a shopping mecca with major  regional businesses; as well as small businesses and large national  stores such as Neiman Marcus, Bloomingdale's, and Nordstrom's. There…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699911/recognizing-derrick-thompson"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…responsible innovation. Thank you again       for your leadership.            Sincerely,                                                       John Horton,      Head of North America Public Policy, DoorDash, Inc.                                   ____                                           International Association…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690260/setting-consumer-standards-for-lithium-ion-batteries-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…finished vehicles, crude oil and  refined gasoline crisscrossing our northern border numerous times  before getting to its final customer. To put it simply, don't hurt  North America.\n\nThe American people cannot stand idly by while we throw out all the  hard-fought gains we have made in American manufacturing since the  1980s; and, boy, believe me,…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688734/americans-are-in-for-a-rough-ride"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…Dr. Dmytriv-Kapeniak exemplifies putting  together our vocation into service for humanity. As a proud member of  the Illinois Chapter of Ukrainian Medical Association of North America  and the president of the Illinois division of Ukrainian Congress  Committee of North America, she has secured medical donations and  supply donations to help save lives…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688474/womens-history-month"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…military priorities, called Golden Dome. In  Canada, they call it Continental Shield. They have a different name for  it, but it is the same thing; it is missile defense for North America.  And we are trying to get Canada to heavily invest, as they should, to  try to provide missile defense in North America. It is much harder to  convince an ally to spend…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696447/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…sacred lands to oil and gas drilling that would irrevocably destroy  them.\n\nCan my colleagues imagine? This is one of the most sacred sites, not  just in New Mexico but in North America. It is a place that Secretary  Deb Haaland worked to set aside in 2023 and a place which the New  Mexico delegation is seeking to permanently protect.\n\nAs Pueblo leaders…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697106/chaco-canyon-is-not-for-sale"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…``I stand with Israel'' or ``Pray for Israel'' were unrepresented. That  means they weren't represented at a ratio of six to one.\n\nAccording to the Jewish Federation of North America, individuals on  TikTok for over 30 minutes a day were  17 percent more likely to be anti-Semitic. And last year, anti-Semitic  comments on TikTok rose 912 percent.\n\nMy…", "date": "2025-06-18", "source_url": "https://justfacts.votesmart.org/public-statement/1692683/tiktok"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…California spotted owls'' (proposed for listing under the       Endangered Species Act). The ROD explains that barred owls, a       non-native invasive species in western North America, compete       with northern and California spotted owls, and this       competition ``is a primary cause of the rapid and ongoing       decline of northern spotted owl…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693338/us-government-accountability-office-legal-opinion"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…always been an inspiration to me and,  frankly, to anyone who ever met him.\n\nDonny was a strong advocate for organized labor and joined the  Laborers' International Union of North America as a field  representative and organizer, eventually becoming administrator of the  New England Laborers' Labor-Management Cooperation Trust.\n\nDonny started his public…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691451/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…protecting habitats that benefit all Americans.  The North American Wetlands Conservation Act has helped to protect  millions of acres of wetlands and grasslands across North America.\n\nI commend Representatives Hurd and Elfreth for their bipartisan  leadership in advancing this proven funding mechanism and ensuring that  future generations inherit healthy…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693494/wetlands-conservation-and-access-improvement-act-of-2025"}, {"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "…mobility.\n\nBeyond the state of Missouri, Mr. Thomas' voice has been heard across  the country. As Special International Representative for the Laborers  International Union of North America and Vice President of the Missouri  AFI-CIO, he played a major role in supporting national labor efforts.  These included advocacy for the expansion of wage protections,…", "date": "2025-06-20", "source_url": "https://justfacts.votesmart.org/public-statement/1692686/recognizing-reginald-l-thomas-for-his-distinguished-service-to-laborers-local-264-and-the-missouri-afl-cio"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…Energy Information  Administration projects global demand for liquid fuels to increase by  about 20 million barrels per day by 2050. Alarmingly, over the last  several years, North America has lost an estimated 1 million barrels of  fuel per day due to low refining capacity.\n\nThe last report from the National Petroleum Council on refining was  completed over…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697029/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…strategically, and culturally.\n\nThe 10-02 area of ANWR, the coastal plain, is the most studied piece  of land in Alaska and one of the most resource-rich energy basins in  North America. Congress set this area aside specifically because of its  oil and gas potential, and Congress has twice mandated that it be  leased for energy development.\n\nYet in December…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696831/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…Lancaster to rehabilitation and employment sites in Adams,  Chester, Lebanon, and York Counties, as well as in Little Rock,  Arkansas.\n\nAdditionally, Mr. Steiner serves as the North America/Caribbean World  Blind Union representative for the National Industries for the Blind.  He is a board member for VisionServe Alliance, the Pennsylvania  Association for…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696276/congratulating-visioncorps-president-and-ceo-dennis-steiner-on-his-retirement"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…gas and the transmission of  electricity, and ask for its immediate consideration in the House.\n\nThe Clerk read the title of the bill.\n\nMr. GUTHRIE.  3062.\n\nMr. Speaker, North America has grown to be an energy superpower due  to the robust trade of oil, gas, and electricity. As energy demand is  projected to increase in staggering numbers over the coming…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695688/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…Office  owns and manages over 780,000 acres of land and 4.7 million acres of  our mineral estate.\n\nNotably, this land encompasses Wyoming's share of the Powder River  Basin, North America's largest coal deposit responsible for the  production of 40 percent of our Nation's coal.\n\nWyoming is the largest coal producer in the Nation. We, in other  words, are…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696878/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…society. There must  be one rule of law for all the people.\n\nAll the way back in 1991--a lot of people won't know this--the Muslim  Brotherhood issued a memorandum about North America, detailing a plan  for the ``enablement of Islam in North America,'' establishing an  effective and stable Islamic movement led by the Muslim Brotherhood,  which adopts…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698106/bringing-america-back-to-its-roots"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…in both the United States  and Mexico to stop the screwworm. We know that the use of sterile flies  was effective during the last outbreak of the New World screwworm in  North America, which happened in the 1960s.\n\nThe sterile male fly mates with female flies who mate only once  during their lifetime, so by releasing large numbers of sterile male  flies,…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699770/9999"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Minnesota Power, MiningMinnesota,  Minnesota State Building and Construction Trades Council, Ely Public  School District, Jobs for Minnesotans, Laborers' International Union of  North America, and more.                                                  January 20, 2026.      Hon. Mike Johnson,      Speaker, House of Representatives,      Washington, DC.…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699275/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…necessary steps to win once again.\n\nBefore I yield back, I would note a number of the outside groups that  are supporting this legislation. They include labor unions like the  North America's Building Trades Unions and the Laborers' International  Union of North America, LIUNA.\n\nMr. Speaker, I include in the Record a statement in support from  Albert Gore,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699694/critical-mineral-dominance-act"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…``But you said they will be getting green jobs. I'm just       asking when that happens?'' Doocy responded, noting a report       by the Laborers' International Union of North America that       found 1,000 union jobs on the Keystone project would       ``immediately vanish.''\n\nAnother 10,000 construction jobs expected to be created by       the project…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688523/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "Kat Cammack", "party": "Republican", "sentence": "…potential of America's abundant natural resources.\n\nNow in north central Florida, not many people know this, but we are  home to one of the largest bunkering LNG hubs in North America. This is  critical to our domestic economy, as well as our national security.\n\nThe reason why this bill is so important is, first and foremost, it  addresses the Biden…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697086/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Act of 2025.\n\nThis bill is sponsored by Representative Hurd of Colorado, and it  would ensure that the interest from unallocated Pittman-Robertson funds  continue to go to North America Wetlands Conservation Act, or NAWCA.\n\nNAWCA is one of the most successful conservation programs  administered by the Federal Government and has proven to be invaluable…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693493/wetlands-conservation-and-access-improvement-act-of-2025"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…hunter  education.\n\nSince 2004, interest generated from these funds has added an average  of nearly $11 million per year to support wetland and waterfowl  conservation across North America. That funding is leveraged by  nonprofit and State partners, often doubling or tripling the Federal  investment, delivering high-impact results.\n\nThis bill is about safeguarding…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693492/wetlands-conservation-and-access-improvement-act-of-2025"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "Mr. STAUBER. Mr. Speaker, I include in the Record the following  letters and statements from North America's Building Trades Unions,  Laborers' International Union of North America, and the International  Union of Operating Engineers, in support of H.J. Res. 140.…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699454/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…life; and\n\nWhereas, the first 42 Jewish immigrants arrived in Savannah, Georgia,  on July 11, 1733, making Savannah the largest Jewish settlement in the  English colonies in North America at the time; and\n\nWhereas, the belief in the greatness of the American way of life, the  freedoms enshrined in American law and jurisprudence, and the  opportunities sustained…", "date": "2025-03-21", "source_url": "https://justfacts.votesmart.org/public-statement/1688926/designating-april-29-as-endjewhatred-day"}]