[{"senator": "Nick Begich III", "party": "Republican", "sentence": "…systems to new areas of research such as quantum information and  environmental sciences.\n\nThis interagency relationship has greatly benefited my home State of  Alaska. The North Slope of Alaska is home to the Department of Energy's  Atmospheric Radiation Measurement, or ARM, user facility, which gathers  data pertaining to clouds and radiation processes…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688986/doe-and-nasa-interagency-research-coordination-act"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…the people who actually live there.\n\nAlaska is asking us to act.\n\nThe Inupiat people who live in the area have spoken, and they could  not have been clearer. Through the North Slope Regional Trilateral--the  Inupiat Community of the Arctic Slope, the North Slope Borough, and the  Arctic Slope Regional Corporation, we have heard that the Biden  administration's…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696835/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…all common sense to import LNG  into Alaska when the State is blessed with abundant resources that can  supply the State and beyond.\n\nEvery action must be taken to provide North Slope-produced gas to  Alaskans for their home heating and local industry needs. In addition  to providing gas to Alaska, the Alaska LNG pipeline will be able to  export 20 million…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694898/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…overturns the Biden administration's actions to  prevent the great people of Alaska from accessing and responsibly  developing their abundant oil and gas resources on the North Slope.\n\nYet again, these actions were just another part of the Democrat and  President Biden's anywhere but America, any worker but American agenda.\n\nThis was put out by the Biden…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696829/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…Reserve of Alaska, which is meant for oil and  gas development--that they shut down the whole thing, OK? Guess who  wanted that to be open. All the indigenous leaders of the North Slope:  the Tribe, the Alaska Native Corporations, the Borough Leadership. They  came down here eight times to DC--eight times--to try to meet with the  Secretary of the Interior,…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696959/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-extension-of-deadlines-in-standards-of-performance-for-new-reconstructed-and-modified-sources-and-emissions-guidelines-for-existing-sources-oil-and-natural-gas-sector-climate"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…Gas Leasing Program (2020       program) included robust protections for wildlife and       sensitive habitats and was supported by the elected       leadership from the North Slope and Kaktovik. The development       of the 2020 program followed a transparent process that       incorporated meaningful consultation with our community,       recognizing…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697510/sj-res-91-and-hj-res-131"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…conservationists in the world, with a long-standing record of balancing  conservation with responsible resource and infrastructure development.  Our oil fields on Alaska's North Slope offer a world-class example of  what it means to responsibly produce energy in a harsh and demanding  environment. The environmentally conscious way in which Alaskans have…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…which  requires four lease sales to be held over a 10-year period, Congress  had previously mandated energy leasing in the area, an action that has  the support of local North Slope communities and Native Villages.\n\nLast Congress, we held a bipartisan legislative hearing on H.R. 6285,  ``Alaska's Right to Produce Act,'' where we heard from Tribal  representatives,…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696830/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…say there is going to be a golden era in this country? We  are securing our border in this bill, too. We are opening up American  energy in this bill, everywhere from the North Slope of Alaska to, yes,  the Gulf of America, where President Biden had shut down American  energy.\n\nHe green-lighted Russia's Nord Stream pipeline so Russia could  produce their…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693191/one-big-beautiful-bill-act"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…and prevent this circumvention of Federal law from  happening again.\n\nAlaska has a strong record of responsible resource development. The  footprint of drilling pads on the North Slope has declined by 80  percent since the 1970s, while new and safer technology has expanded  the reach of underground drilling by a significant margin. The result  is that…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697739/9999"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…sponsored it and I  cosponsored it because the Biden administration imposed this management  plan over not only our objections but the objections of leaders from  across Alaska's North Slope. The third member of our delegation,  Congressman Begich, has introduced H.J. Res. 124, which is identical  and is pending in the House of Representatives.\n\nI think it is…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696449/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…131, a  resolution to overturn the Biden administration's 2024 Record of  Decision, an action that severely restricted energy development on the  coastal plain of Alaska's North Slope.\n\nFor Alaskans, this issue is foundational--economically,  strategically, and culturally.\n\nThe 10-02 area of ANWR, the coastal plain, is the most studied piece  of land…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696831/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…Pipeline System, Alaska's most essential  piece of infrastructure and a nationally strategic asset for the United  States. This system transports crude oil 800 miles from the North Slope  oil fields to marine terminals in Valdez and provides the vital access  necessary to develop the resources in the National Petroleum Reserve- Alaska, the ANWR Coastal Plain,…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696162/hj-res-106"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…new integrated activity plan for BLM's       future management of the National Petroleum Reserve in       Alaska, an approximately 23-million-acre area on Alaska's       North Slope.\n\nThe Congressional Review Act (CRA) requires that before a       rule can take effect, an agency must submit the rule to both       the House of Representatives and the…", "date": "2025-07-28", "source_url": "https://justfacts.votesmart.org/public-statement/1694269/us-government-accountability-office-legal-opinion"}]