[{"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "This is one of the most sacred sites, not  just in New Mexico but in North America.", "title": "Chaco Canyon is Not for Sale", "date": "2025-11-20"}, {"senator": "Al Green", "party": "Democrat", "sentence": "Just as North Korea made that decision, others are  making that decision.", "title": "Impact of President on Peace Process", "date": "2025-02-27"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "In the last year, we have seen  natural disasters in California, Texas, North Carolina, and Florida.", "title": "20th Anniversary of Hurricane Katrina", "date": null}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "Steel for the project was sourced  in Texas, Alabama, North Carolina, and West Virginia.", "title": "Terminating the National Emergency Declared with Respect to Energy", "date": "2025-10-08"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "In North Korea, they deleted political  leaders from online archives.", "title": "Rewriting History", "date": "2026-02-04"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "From  the hazy blue peaks of the Appalachian Mountains to the imposing spires  of the Rockies, from the saltwater estuaries of the Croatan National  Forest in North Carolina to the towering Ponderosa Pines of the Santa  Fe National Forest in my home State, across the country, many people's  favorite hunting spots, their favorite hiking trails and biking routes,  ATV trails, and fishing streams are in these protected roadless areas.", "title": "Cloture Motion", "date": null}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "We know that President Trump is the biggest threat to our education  system in America right now, not someone in North Korea or China.", "title": "Defending Education Transparency and Ending Rogue Regimes Engaging in Nefarious Transactions Act", "date": "2025-03-25"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "If you haven't noticed Ukraine's struggle against the  spiderweb of tyranny fostered by Russia, China, Iran, Belarus, and  North Korea, it is real, and it is lethal.", "title": "Department of Defense Appropriations Act, 2026", "date": "2025-07-17"}, {"senator": "Alma Adams", "party": "Democrat", "sentence": "Speaker, I rise today to recognize Chancellor Sharon  Gaber and the exceptional work that she has done leading the University  of North Carolina at Charlotte.", "title": "Recognizing Chancellor Sharon Gaber", "date": "2026-01-22"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "Today, the Senate will vote to end Donald Trump's national emergency  declaration against Canada and put a stop to the asinine trade war with  our neighbors to the north.", "title": "Terminating the National Emergency Declared to Impose Duties on Articles Imported From Canada", "date": "2025-10-29"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "Madam Speaker, before I yield to the gentleman from North  Carolina, I do want to point out that the chairman was referring to  hybrid programs.", "title": "Veterans Education and Technical Skills Opportunity Act of 2025", "date": "2026-02-02"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "Over the weekend, I had a chance to visit the Edesia Nutrition  factory in North Kingstown, Rhode Island, one of two factories in the  United States that manufactures this ready-to-use therapeutic food.", "title": "Restore Food Aid Funding", "date": "2025-07-21"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "This was a  project then with about $4 billion of investment already expended and  north of 80 percent complete--a lot of turbines fully complete out  there.", "title": "Permitting Reform", "date": "2026-01-07"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "The North Koreans use it to fund their nuclear program.", "title": "Crypto Used By Criminals and Corrupt Politicians", "date": "2025-07-16"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "Now they will close rural radio stations in the chairwoman's  district in North Carolina and in my State, Colorado, the western part  of my State that I have the privilege of representing.", "title": "Relating to Consideration of the Senate Amendment to H.R. Rescissions Act of 2025", "date": "2025-07-17"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "Seventy-five years ago, in the bitter winter of 1950, 30,000 United  Nations forces, most of them United States Marines, were surrounded by  more than 120,000 Chinese troops near the Chosin Reservoir in North  Korea.", "title": "Recognizing the 75th Anniversary of the Battle of Chosin Reservoir", "date": null}, {"senator": "Russell Fry", "party": "Republican", "sentence": "Marilyn has been a constant force for many years, leading with  strength, dedication, and a genuine heart for the people of North  Myrtle Beach.", "title": "Recognizing Mayor Marilyn Hatley", "date": "2025-07-22"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "McGuire Auto Dealership and  also a farmer in Rugby, North Dakota.", "title": "Promises Made, Promises Kept", "date": null}, {"senator": "Addison McDowell", "party": "Republican", "sentence": "Speaker, I rise today to send my greatest gratitude  to Representative Harry Warren as he retires after eight terms serving  the people of Rowan County in North Carolina's 76th District.", "title": "Recognizing Representative Harry Warren", "date": "2025-12-11"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "It is an honor to bestow Johnny with the Patriot Award for his  exceptional service to the people of North Texas.", "title": "Recognizing Congressional Patriot Award Recipient John ``johnny'' Rothfus", "date": "2025-04-28"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "It is an honor to bestow Nate with the Patriot Award for his  exceptional service to the people of North Texas.", "title": "Recognizing Congressional Patriot Award Recipient Nate Pike", "date": "2025-04-28"}, {"senator": "Maria Salazar", "party": "Republican", "sentence": "Just look at  Russia, look at North Korea, and look at Iran.", "title": "Denouncing the Horrors of Socialism", "date": "2025-11-21"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "(4) North Tustin, California.", "title": "Single, Unique Zip Codes for Certain Communities", "date": "2025-07-21"}, {"senator": "Addison McDowell", "party": "Republican", "sentence": "Madam Speaker, today, I recognize one of North  Carolina's brightest young athletes, Coy James of Davie County, who now  joins the ranks of great ballplayers from the Tar Heel State.", "title": "Recognizing Coy James and Davie County's Baseball Legacy", "date": "2025-07-22"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "It is very meaningful  to North Dakota, and I express my appreciation for the support.", "title": "Providing for Congressional Disapproval Under Chapter 8 of Title United States Code, of the Rule Submitted By the Bureau of Land Management Relating to ``North Dakota Field Office Record of Decision and Approved Resource Management Plan''", "date": "2025-10-08"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "It is an honor to bestow Corbett with the Patriot Award for his  exceptional service to the people of North Texas.", "title": "Recognizing Congressional Patriot Award Recipient Corbett Howard", "date": "2025-04-28"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "And, in recent days, I have been chilled when watching a parade in  Beijing where Xi Jinping, the dictator of the PRC, assembled the  leaders of North Korea, Iran, India, and other allies of theirs to  watch a parade of state-of-the-art weaponry.", "title": "Providing for Congressional Disapproval Under Chapter 8 of Title United States Code, of the Rule Submitted By the Internal Revenue Service Relating to ``Interim Guidance Simplifying Application of the", "date": "2026-02-10"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "Since joining Corning Incorporated in 1986 as a shift supervisor at  the company's optical fiber plant in Wilmington, North Carolina, Eric  Musser has risen through the ranks, bringing stability, growth, and  global perspective to one of the Nation's most innovative companies.", "title": "Recognizing Eric Musser on His Retirement From Corning Incorporated", "date": "2025-07-16"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "Speaker, at issue is the Duluth Complex in northern Minnesota,  one of the largest mineral deposits on the planet, including the  world's largest copper-nickel deposit.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the Bureau of Land Management Relating to Public Land Order No. 7917 for Withdrawal of Federal Lands; Cook, Lake, and Saint Louis Counties, Mn", "date": "2026-01-21"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "Through funding  provided by the North Tahoe Community Alliance, the team was able to  successfully deploy BEBOT to the shores of Lake Tahoe, maximizing beach  cleanup efforts through advanced technology and in partnership with  local volunteers.", "title": "Congratulating Eco-Clean Solutions", "date": "2025-12-04"}]