[{"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "Speaker, as I returned home to northwest Ohio this  weekend, I found soul searching among people who I represent following  the tragedies of last week in Colorado and Utah.", "title": "Resisting the Temptation to Divide", "date": null}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "Speaker, with March Madness coming to a close last  night, it is with joy that I rise to celebrate two exceptional young,  local basketball stars from northwest Ohio: Makhi Leach from Whitmer  High School and Elise Bender from Anthony Wayne High School, who were  named the 2025 All-Blade Basketball Players of the Year.", "title": "Congratulating All-Blade Basketball Players of the Year", "date": "2025-04-08"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "In New York, this priceless collection had few visitors, little  space, and no real home, but now these treasures are coming to  northwest Ohio to the world-class Toledo Museum of Art.", "title": "Priceless Coin Collection Heads to the Toledo Museum of Art", "date": "2025-12-01"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "I rise today in recognition of an extraordinary citizen of northwest  Ohio, Mr.", "title": "Recognizing Steve Martin of Northwest Ohio", "date": "2025-02-27"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "This includes hundreds of hardworking constituents even across  northwest Ohio.", "title": "Department of Energy Project Cancelations", "date": "2025-06-04"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "This is true across the entirety of our northwest  Ohio region, in both urban and rural communities.", "title": "Applauding President Zelenskyy's Address in Davos", "date": "2026-01-22"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "Seven of the eight counties I represent in  northwest Ohio are predominantly rural and home to hardworking farmers  who produce the nutritious food that feeds and fuels our Nation.", "title": "A Plea for Small, Family-Owned Farms", "date": "2026-02-02"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "Speaker, I rise this evening on behalf of the people  I am privileged to represent in northwest Ohio: workers, family,  farmers, and urban and rural communities where neighbors try to look  out for one another.", "title": "Empty Shelves At Food Banks", "date": "2025-04-30"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "The businesses and  people of northwest Ohio and all of Ohio and the industrial  agricultural Midwest overwhelmingly oppose this careless  administration's ill-conceived trade war with Canada.", "title": "Americans Are in for A Rough Ride", "date": "2025-03-10"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "Just in Ohio, we know health insurance will become unaffordable for  tens  of thousands of people across our northwest Ohio district, over half a  million Ohioans, and 15 million Americans.", "title": "Rising Healthcare Costs", "date": "2025-11-18"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "While I have the time, it is long overdue for the Department of  Veterans Affairs to approve the request from northwest Ohio to expedite  the dual affiliation of the University of Toledo Medical Center and the  VA Ann Arbor Health Care System.", "title": "Military Construction, Veterans Affairs, and Related Agencies Appropriations Act, 2026", "date": "2025-06-25"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "Speaker, currently, our Great Lakes economy is being choked by  reckless tariffs and inside-out trade policies that hit us hard,  including the district I represent in northwest Ohio.", "title": "Great Lakes, Tariffs, and Trade", "date": "2025-04-29"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "Speaker, I have the honor of representing Ohio's 9th  Congressional District, a region that embodies the industrious spirit,  deep-rooted history, and resilient communities of Northwest Ohio.", "title": "Proclamation for Fulton County's Demisemiseptcentennial", "date": "2025-07-17"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "They are the heroes  and sheroes of our northwest Ohio community.", "title": "National Fallen Firefighters Memorial: the Lyons Fire", "date": "2025-05-07"}]