[{"senator": "Dina Titus", "party": "Democrat", "sentence": "…than setting off an explosion in the desert.\n\nOur leadership on arms control and nonproliferation has clearly come  to an end, and the world is becoming a more dangerous place. Note: For  the first time ever, the U.S. was the only country to vote ``no'' on a  recent U.N. resolution supporting the Comprehensive Nuclear-Test-Ban  Treaty. You know, not even…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696970/nuclear-testing-opposition"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…whether he had been discussing TikTok at meetings with Chinese  officials in London. He said they had not.\n\nI am concerned that these extensions of the TikTok deal are illegal.  Note that Congress passed this law, and the President extending the  deadline to allow them to continue to operate in the United States  under the control of ByteDance and the Chinese…", "date": "2025-06-18", "source_url": "https://justfacts.votesmart.org/public-statement/1692683/tiktok"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…this  Chamber and the United States Senate and went on to become the  President of the United States and, as important, a leader not only for  this Nation but the world.\n\nI note, especially in these times, Madam Speaker, that it is service  above self that matters. It is service to your Nation, service to your  family, service to your community, and…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697104/saluting-the-life-of-john-fitzgerald-kennedy"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…better  today because of senate President Ruggerio's leadership and dedication.  He inspired us all and will continue to do so.\n\nMr. REED. Mr. President, on a different topic, I note that the Senate  this week has started debate on the GENIUS Act. This bill establishes a  regulatory framework for so-called stablecoins, which are  representations of dollars…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691451/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…Arizona--I am still in the A section right now, so  strap in as we make sure we lift up the voices of everyday Americans  all across this country. It is important that we take note. This isn't  abstract, taking away healthcare from the American people. It is  concrete. It is real. It has devastating implications.\n\nGarrett says: ``I was diagnosed with cerebral…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…thank the ranking member for all of his hard work because for  sure what the President of the United States has done was lied to the  American people and broke a promissory note.\n\nThat promissory note was that he told the American people on day one,  inflation would go down. Prices would go down on day one, he said.  Instead, what the President has…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689705/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…commissions, often as Chairman. He tirelessly advocated for better  education, healthcare, and public services, leaving a lasting impact on  countless lives.\n\nOn a personal note, ``CP'' was my friend and supporter for many  years. He always advocated for all things Quitman County. He never told  me what I wanted to hear, he always told me what he felt…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691304/in-memory-of-the-honorable-curtis-parham-cp-redding-sr"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…people we have observing the  floor right now. I don't know the full curriculum that they are in and  whatnot. I imagine there is an interest in government. STEM is also of  note. When we were doing STEM education in the lab I was in, we had a  great researcher. This man had a great engineering degree, and we would  do the STEM education. He would tell…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688978/mathematical-and-statistical-modeling-education-act"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…of Haiti, which is only a short distance from       Florida, must be recognized as an important ally to the       United States' national security interests.\n\nOn a personal note, I credit the people of Haiti,       especially as we are coming off of celebrating independence,       for teaching me my earliest lessons in the work of       resistance.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699707/congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…and displacement.\n\nEcumenical Patriarch Bartholomew has fostered dialogue across the  world and across religions with Christians, Muslims, and Jews. On today  of all days, I note his efforts to combat international terrorism,  helping lead the effort to the Brussels Declaration in December 2001  calling on leaders of all religions to condemn violence…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695345/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…no benefits       working at Walgreen's where he lives in Garland, TX.\n\nIncredible stress that further impacts his health       conditions including diabetes. (An additional note: Garland,       TX, where George lives, is near Dallas. Tarrant County, which       includes Garland and Dallas, is a locality with high medical       debt and high profit for…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…coverage       of CRA was intended `'to be interpreted broadly with regard       to the type and scope of rules that are subject to       congressional review.'' They went on to note that whether an       action is covered by CRA ``does not turn on whether a given       agency must normally comply with the notice-and-comment       provisions of the APA,…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699835/government-accountability-office-opinion-letter"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…abuse of power straight out  of the Project 2025 playbook. Congress created the Department. Only  Congress can dismantle it, something I will fight every step of the  way.\n\nI note that Donald Trump and Elon Musk have likely never set forth in  a public school, and they certainly do not understand what the  Department of Education actually does and why…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689037/majority-of-americans-support-department-of-education"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…Knights of St.  Patrick in New Haven, Connecticut's oldest continuously run Irish  society.\n\nI would be remiss if I did not also take this opportunity to extend a  personal note of thanks to Steve for his many years of friendship and  support. Steve has always been known for his gregarious nature, ready  smile, and big heart. Elected to our respective…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689392/recognizing-the-honorable-steven-steve-dargan-west-havens-2025-irish-person-of-the-year"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…organization, or law firm. The bill focuses on the  costs of regulations, not the benefits, which greatly outweigh the  costs.\n\nFor these reasons, I oppose the bill. It is important to note that I  said to my colleagues on the other side of the aisle that if we can get  information from the Office of Advocacy as to what small businesses are  actually submitting…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697350/destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Mike Johnson", "party": "Republican", "sentence": "…development, health care,  and other social policy issues. This year's delegation should be  familiar with transatlantic relations within the context of recent  world events.\n\nPlease note that there is a significant time commitment aspect for  those selected for the program. In addition, U.S. participants are  expected to plan and implement the meetings and programs…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693345/announcement-of-the-2025-congress-bundestagbundesrat-exchange"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…an ``atrocity'' (as such term is defined in       section 6 of the Elie Wiesel Genocide and Atrocities       Prevention Act of 2018 (Public Law 115-441; 22 U.S.C. 2656       note)).\n\n(c) Form.--The report required under subsection (a) shall       be submitted in unclassified form, but may include a       classified annex.       SEC. 5. EXCEPTION RELATING…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690648/falun-gong-protection-act"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…will raise insurance premiums by 5 percent. They are offering a CRA  that raises premiums, the effect of, by 5 percent. That is money that a  family could use to pay their car note, their flood insurance note,  their grocery bill--you name it--rent for their apartment, and,  instead, it is going to insurance companies.\n\nI don't quite know why my Democratic…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698998/disrupt-explicit-forged-images-and-non-consensual-edits-act-of-2025"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…acres--in the Superior National Forest,  which is a working industrial forest where timber harvesting and mining  are desired activities. This ban was a 20-year ban, where, I will note,  again, the Forest Service plan states mining and timber harvesting are  desired activities.\n\nThis PLO sacrificed thousands of good-paying union jobs that would  support families…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699271/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…years, a culture of  corruption. He referred to Governor Newsom's chief of staff who has now  been indicted as a ``Mafia boss.''\n\nSo I think it is important for people to take note of what has  transpired because it does cast a light on the corruption that is  endemic to politics in Sacramento.\n\nMr. Speaker, I believe that this is really the core issue…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697101/highlighting-the-state-of-california"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…new year is the amount of fraud that has been  uncovered in Minnesota. What we have learned is that now the total has  climbed to $9 billion--still rising. It is important to note that is  all stolen taxpayer money. It is so interesting that this big theft was  uncovered by a young independent journalist who really blew the story  open when he started…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698560/fraud-accountability-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…we have borrowed money from was actually a pretty  good interest rate. That is internal borrowing.\n\nThen, there is the public borrowing. These are the options. This is  the note, T bill, or bond that is in a retirement account. Another  country may buy it to hold in their version of their Federal Reserve.\n\nRemember, China is not our number one buyer…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688651/a-real-math-problem"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "Ms. HAGEMAN. Mr. Speaker, I rise today in strong support of S. 1383,  the SAVE America Act, which I am proud to cosponsor and hope will pass  the House floor today.\n\nI also note that I think it is shockingly racist and sexist for my  colleagues on the other side to believe that we are not smart enough to  figure out how to get IDs. I can assure my colleagues…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700005/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…bring a practitioner's perspective to the court.\n\nThe nonpartisan American Bar Association unanimously rated Josh as  ``well qualified'' to serve on the First Circuit. I would note that  that is the highest possible rating for a judicial nominee. It reflects  the ABA's assessment of his integrity, experience, and temperament.\n\nThere were several compelling…", "date": "2025-10-30", "source_url": "https://justfacts.votesmart.org/public-statement/1696490/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…Sanctions Act       of 2025''.       SEC. 2. FINDINGS.\n\nCongress makes the following findings:\n\n(1) The Iran Sanctions Act of 1996 (Public Law 104-172; 50       U.S.C. 1701 note) requires the imposition of sanctions with       respect to Iran's illicit weapons programs, conventional       weapons and ballistic missile development, and support for…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690688/solidify-iran-sanctions-act-of-2025"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…university, BYU provides a  steady flow of educated graduates, drives economic activity, and  fosters a culture of excellence that enriches every neighborhood.\n\nI am also proud to note that our district office calls Provo home,  and I am grateful for the support from the local community there.\n\nI am proud to represent the residents of Provo and to champion…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693581/congratulating-provo-utah-as-americas-best-run-city"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…million more per year to  operate the devices.\n\nWhile this cost is across several affected plants, these figures are  certainly much higher than the EPA's estimates.\n\nI also note that this rule does not affect most of my constituents. I  am sure some of my constituents drive from eastern Henry County to work  at the Danville Goodyear plant located in…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688523/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "Mr. BEAN of Florida. Mr. Speaker, some of our    =========================== NOTE ===========================\n\nOn September 18, 2025, on Page H4423, in the first column, the  following appeared: Mr. BEAN. Mr. Speaker, some of our\n\nThe online version has been…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695779/national-prisoner-of-warmissing-in-action-recognition-day"}, {"senator": "Nathaniel Moran", "party": "Republican", "sentence": "…Since the ACA was enacted, premiums have increased by roughly 80  percent. Guess what. Ninety percent of that increase has been paid for  by the taxpayers.\n\nIt is important to note that these premium tax credits are sent  directly to insurance companies, not the taxpayers, and it is no secret  why. The ACA was written by insurance companies to benefit…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698806/breaking-the-gridlock-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…have a whole lot more to add. I  associate myself with the remarks of all of my colleagues who have  spoken on this matter. I would only add that I think it is important to  note that this legislation is supported by the Due Process Institute, R  Street, Right on Crime, as well as the National District Attorneys  Association and the National Association…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697203/count-the-crimes-to-cut-act"}]