[{"senator": "Jared Huffman", "party": "Democrat", "sentence": "…and extra costs for  good actors who report unexpected finds, as they are required to do  under the law. It keeps bad actors from just quietly working and hoping  that no one notices, something that is much easier to get away with if  you are not required to do those studies in the first place.\n\nMr. Speaker, why do Republicans want to roll this rule back?…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688632/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…with this Policy Notice to gain approval       of its Final Proposal from the Assistant Secretary.'' The       Policy Notice also rescinded two previously issued Policy       Notices for the BEAD Program.\n\nThe Policy Notice removed several requirements imposed on       Eligible Entities and subgrantees in the BEAD NOFO, such as       requirements related…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698437/us-government-accountability-office-opinion-letter"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…that, again, I think are in need of being  highlighted here because of the significance of the action taken this  evening--quoting still from the letter:\n\nEPA stated that the Notices of Decision were not rules       under CRA, and, in the underlying decision documents for two       of those notices, cited to our 2023 decision in support of       that statement.…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691583/hj-res-88"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…bill,  you would think that including tax breaks for tens of millions of  families to afford healthcare would be their centerpiece, right? Wrong.\n\nAs families are slated to get notices of how much their premiums are  going to go up any day now, Republicans had yet another chance this  week to help address this pressing issue. House Republicans unveiled a…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695650/healthcare"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…hope we are asleep. They don't  want us paying attention. They don't want us to know what they are, in  fact, truly doing. They hope we are not watching, and they hope no one  notices until it is too late.\n\nTexans are paying attention, and I am here to sound the alarm on this  outrageous bill. In Texas, over 5 million people depend on Medicaid.  They are…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691436/republican-budget-bill"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…backdoor ban on abortion and reproductive  healthcare.\n\nRepublicans have shown they have no agenda to address healthcare  affordability and access. As Americans stare down notices that their  healthcare costs will increase by tens of thousands of dollars in just  2 weeks, Republicans are cramming through legislation that kicks them  while they are down.…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698225/healthcare-affordability-crisis"}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "…current administration.\n\nJust last month, I visited the Small Business Administration field  office. Less than 2 hours after I left, two of those employees had  received layoff notices.\n\nMr. Speaker, firing Federal employees in this moment does not  decrease the need or importance of the agency; it just makes it harder  for entrepreneurs, for restaurateurs,…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687934/assisting-small-businesses-not-fraudsters-act"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…betrayal of a  bill will kick 15 million Americans off their healthcare, force  hospitals, health clinics, and nursing homes to close. This is already  happening with the premium notices, with what they are already seeing.  It is raising costs for everyday Americans.\n\nAnd now, if Congress doesn't act to extend the Affordable Care Act's  health tax credits…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695651/healthcare"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…but in negotiations, we have always worked on extensions so  that we can address issues together in a bipartisan manner.\n\nMillions of Americans are already receiving those notices of health  plans where the price is going to skyrocket. I get stopped on the  streets where people tell me what they are seeing when they open those  bills, and they are drastic.…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697852/providing-for-consideration-of-hr-promoting-efficient-review-for-modern-infrastructure-today-act-providing-for-consideration-of-hr-increasing-investor-opportunities-act-providing-for-consideration-of-hr-electric-supply-chain-act-providing-for-consideration-of-hr-state-planning-for-reliability-and-affordability-act-providing-for-consideration-of-hr-improving-interagency-coordination-for-pipeline-reviews-act-providing-for-consideration-of-s-disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-and-for-other-purposes"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Senate in just a few days to do something about the high  cost of health insurance premiums. I am hearing it back home. People  understand what is happening. They are getting notices about what these  premiums are going to be as of the first of the year. Some 24 million  Americans are affected by the ``Big Beautiful Budget Bill'' of Donald  Trump and the…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697242/the-economy"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…unanimous  consent. I am a cosponsor of that one, too, because I am willing to  work with folks. You all know that. You all know that.\n\nLook, days before Americans start receiving notices that healthcare  premiums are about to skyrocket, as the Trump administration moves to  cut off SNAP benefits, this dysfunction is what the American people  have come to expect…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696457/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-record-of-decision-for-the-barred-owl"}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "…It currently shares two ZIP Codes with neighboring  jurisdictions.\n\nWithout a unique ZIP Code, Eastvale residents have reported mail  delivery issues for delivery of legal notices, code enforcement  activities, public outreach, and election mail.\n\nEastvale residents have also reported higher insurance rates because  of errors related to another jurisdiction,…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693861/establishing-new-zip-codes"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…before the American people talking about how  much they care about their healthcare. Why should the American people  believe these lies as they are, even as we speak, getting notices of  huge increases in their healthcare costs? The American people don't  believe the Republican lies. They see right through them.\n\nMeanwhile, Republicans, unwilling to do…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696175/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…scientists, and public health experts. This  action stalled 16,000 grant applications for around $1.5 billion in NIH  funding. The NIH has since begun to incrementally send notices to the  Office of the Federal Register to resume reviews.\n\nThe combination of these actions has irresponsibly stalled our  Nation's primary source of lifesaving biomedical…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…and Taxpayer Help Act. This bill will help taxpayers  better understand why they have received a math error notice from the  Internal Revenue Service.\n\nCurrently, math error notices can be vague and confusing. The law  does not specify how the IRS must describe the math error or require  the IRS to inform taxpayers that they have 60 days to request that…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689361/internal-revenue-service-math-and-taxpayer-help-act"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…the standard for the  Social Security Administration is through electronic communications.\n\nThis bipartisan bill is straightforward. It provides ample time for  transition, notices to consumers, and an ability for anyone to opt out  for any reason if they choose to do so.\n\nI was proud to work with the ranking member of the Capital Markets  Subcommittee,…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697832/increasing-investor-opportunities-act"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…examination history, to       include those conducted by foreign countries;\n\n``(ii) history of violations, vessel detentions, incidents,       and casualties;\n\n``(iii) history of notices of violation issued by the Coast       Guard;\n\n``(iv) safety related information provided by the flag       state of the vessel;\n\n``(v) owner and operator history;\n\n``(vi)…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Randy Feenstra", "party": "Republican", "sentence": "…adds a zero to their reported income, the  agency should clearly indicate that error to the taxpayer and explain  why the refund is different than expected.\n\nHowever, current notices do not explain or contain helpful  information, leaving millions of taxpayers confused about how and when  to rectify the issue with the IRS.\n\nThe IRS MATH Act ensures that…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689360/internal-revenue-service-math-and-taxpayer-help-act"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…aren't left behind.\n\nBy improving coordination across the VA and other Federal agencies,  we can reduce overpayments and prevent families from being hit with  unexpected debt notices.\n\nThis is a commonsense bill that would help to ensure that our  veterans and survivors receive the benefits that they deserve in a  timely and efficient manner.\n\nMr. Speaker,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695484/modernizing-all-veterans-and-survivors-claims-processing-act"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "…conducted pursuant to       paragraph (1) and other State, local, Tribal, and territorial       feedback and how such feedback was incorporated into       subsequent grant notices of funding opportunities.\n\n``(3) Other feedback mechanisms that the Administrator       determines appropriate.''.\n\n(b) State Homeland Security Grant Program.--Section 2004…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696945/enhancing-stakeholder-support-and-outreach-for-preparedness-grants-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…postponement of certain deadlines by reason of disasters  applicable to the limitation on credit or refund, and to take  postponements into account for purposes of sending collection notices,  as amended.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:                                 H.R. 1491\n\nBe it enacted by the Senate and House…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689314/disaster-related-extension-of-deadlines-act"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…required to kept confidential under       the provisions of law or Government regulation. (Paragraph       5(b) of rule XXVI of the Standing Rules of the Senate.)\n\n(c) Written notices of committee meetings will normally be       sent by the committee's staff director to all members at       least three days in advance. In addition, the committee staff…", "date": "2025-03-12", "source_url": "https://justfacts.votesmart.org/public-statement/1688786/joint-committee-of-congress-on-the-library-rules-of-procedure"}, {"senator": "Greg Murphy", "party": "Republican", "sentence": "…claim funds or credits that they  previously missed out upon.\n\nAdditionally, H.R. 1491 contains another provision that would prevent  disaster victims from receiving collection notices indicating that they  owe the IRS funds despite a postponement of tax filing.\n\nWhen someone suffers from a natural disaster, the last thing on their  minds is their tax liability.…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689315/disaster-related-extension-of-deadlines-act"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…is unacceptable. Claims letters should be the catalyst to care  and benefits and not the obstacle.\n\nThat is where my bill comes in. H.R. 1039 requires the VA to make  these notices clear, concise, and easy to understand while also  streamlining the Department's overall communication with our veterans.\n\nAs you heard already, it requires the VA to partner…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689676/clear-communication-for-veterans-claims-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "Mr. WILLIAMS of Texas. Mr. Speaker, I move to suspend the rules and  pass the bill (H.R. 787) to require plain language and the inclusion of  key words in covered notices that are clear, concise, and accessible to  small business concerns, and for other purposes, as amended.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691850/plain-language-in-contracting-act"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…when that regulation has significant impact  and is as controversial as this one is.\n\nIn the end, it is the House that is covered; the EPA transmitted the  California waiver notices of decision on the regulations in February.  The notice was published in the Federal Register. The public was  allowed to request a hearing and submit materials for the record.…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690434/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-nox-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "French Hill", "party": "Republican", "sentence": "…considers the cost of operating a call center and  ignores the many other expenses involved such as ratifying and dealing  with consumer disputes, mailing and postage for overdraft notices,  third-party collection expenses, technology costs, and cost of  regulatory compliance.\n\nThe reality is that these additional costs make it increasingly  difficult for banks…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689849/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…Congress assembled,       SECTION 1. SHORT TITLE.\n\nThis Act may be cited as the ``Clear Communication for       Veterans Claims Act''.       SEC. 2. INDEPENDENT ASSESSMENT OF NOTICES THAT THE SECRETARY                     OF VETERANS AFFAIRS SENDS TO CLAIMANTS.\n\n(a) Agreement.--Not later than 30 days after the date of       the enactment of this Act, the…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689678/clear-communication-for-veterans-claims-act"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…are notified  about their benefits.\n\nRight now, under current statute, veterans across America are left  digging through the mail, often intermixed with junk mail and other  notices that they may receive, just to find important updates from the  VA, which often leads to things getting lost and delays in their  benefits.\n\nIn fact, it was not that long…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695436/delivering-digitally-to-our-veterans-act-of-2025"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…making a determination under       paragraph (1), the person to whom such individual reports.''.\n\n(c) Effective Date.--The amendments made by this section       shall apply to notices issued, and penalties assessed, after       December 31, 2025.\n\nMr. Speaker, I rise today in support of the Fair and Accountable IRS  Reviews Act introduced by our colleague,…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697248/fair-and-accountable-irs-reviews-act"}]