[{"senator": "Tim Kaine", "party": "Democrat", "sentence": "…fighting with reporters  about intelligence that had come out that the President wasn't happy  about.\n\nIn the immediate aftermath of the attack, he said that the Iranian  nuclear program had been completely obliterated. All sources--Iranian  sources, Israeli sources, the IAEA, the United States--have said  ``severe damage,'' but because the President sort…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693124/motion-to-discharge-sj-res-59"}, {"senator": "Brad Schneider", "party": "Democrat", "sentence": "…must never be allowed to have nuclear  weapons, ever.\n\nPresident Trump's decision to unilaterally withdraw from the JCPOA in  2018 enabled Iran to advance forward in its nuclear program to the  point that the regime was weeks, if not days, from having sufficient  enriched uranium for multiple nuclear bombs.\n\nSome have assessed that Iran could have built…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692935/cancellation-of-iran-classified-briefing"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…seen the three-star general leading the Defense Intelligence  Agency pushed out after analysts produced a straightforward, evidence- based assessment showing that Iran's nuclear program had not been  obliterated, as President Trump so loudly claimed. Rather than face  those facts, the administration decided to punish the messenger, and he  was let go…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695695/authorizing-the-en-bloc-consideration-in-executive-session-of-certain-nominations-on-the-executive-calendar"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…actually understood what  our true options were in that negotiation.\n\nAfter the U.S. bombing of Iran, there has been an immense amount of  debate about whether or not Iran's nuclear program was set back by a  certain amount of time, whether it is years or whatever. The level of  technical ignorance that has been displayed by this administration is,  frankly,…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694113/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…prefers  diplomacy, and only uses war as a last resort when diplomacy fails.\n\nWe had a diplomatic deal with Iran that was entered into in 2015 that  was limiting their nuclear program--peacefully, without having to bomb  them, without having to kill civilians, without having to assassinate  scientists.\n\nThe United States, together with other nations,…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692637/war-powers-resolution"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…China, Israel, India, Pakistan,  and North Korea.\n\nRussia has threatened to use nuclear weapons against Ukraine and even  against NATO nations. North Korea uses its nuclear weapons program to  intimidate the United States, Japan, and Korea. China continues to  build up its nuclear arsenal. It has some 600 warheads today and is  expected to pass 1,000…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694117/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…dangerous question: Can we stop the spread of  nuclear weapons through military force? I believe the answer is no. We  cannot destroy knowledge with a bomb. We cannot erase a nuclear program  by targeting one facility.\n\nStrikes might delay a program, but they almost always provoke  retaliation and harden resolve. They do nothing to build the kind of  long-term…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694115/risk-of-conflict-with-nuclear-weapons"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…and the executive  branch have utilized the Iran Sanctions Act, or ISA, to constrict  Iran's energy sector, denying the Iranian regime needed funds to grow  its nefarious nuclear program and carry out state-sponsored terror  activities.\n\nOriginally passed into law in 1996, the ISA has been the key  statutory element undergirding our sanctions infrastructure…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690687/solidify-iran-sanctions-act-of-2025"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…is because the tool is  overwhelmingly used for crime.\n\nThe Russians use crypto to evade sanctions and fund their war in  Ukraine. The North Koreans use it to fund their nuclear program. Hamas  used it to fund their October 7 attack. Fentanyl traffickers use it to  get paid. All, 100 percent, of ransomware attacks get paid in crypto.\n\nThat is a really…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693618/crypto-used-by-criminals-and-corrupt-politicians"}, {"senator": "John Thune", "party": "Republican", "sentence": "…sow chaos and violence throughout the Middle East. They threatened  ``Death to America'' and to wipe Israel off the map. All the while, the  mullahs have pursued a nuclear enrichment program that goes well beyond  what is required for peaceful energy purposes.\n\nMadam President, Iran can never be allowed to have a nuclear weapon.  This has been the position…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692769/iran"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…29 years, this  law has acted as the cornerstone of U.S. efforts to address the Iran  regime's malign influence. From its support to terrorist proxies to its  dangerous nuclear program, the impact of the regime's provocative  actions continues to be felt far and wide.\n\nThese sanctions are more important now than ever. As this  administration pursues…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690688/solidify-iran-sanctions-act-of-2025"}, {"senator": "Ryan Mackenzie", "party": "Republican", "sentence": "…long-range missiles which together pose an unprecedented  threat to regional stability.\n\nAs the current administration works to achieve the total  dismantlement of Iran's nuclear program, it is critical that we give  them the tools that they need in order to enforce their policy of  maximum pressure. In order to achieve peace and stability in the  region,…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690689/solidify-iran-sanctions-act-of-2025"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…muscular  defense of the American way of life upon his return to office and  especially pleased that Norman lived to watch America join with Israel  to devastate Iran's nuclear program on President Trump's watch.\n\nOne of the great benefits of my work as a Senator is the opportunity  to cross paths with great men like Norman Podhoretz. After learning…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698421/unanimous-consent-requests-the-calendar"}, {"senator": "James Risch", "party": "Republican", "sentence": "…Agency from its  facilities marked the latest in a long chain of violations of Iran's  nuclear commitments. These actions confirmed what we have known all  along: The Iran nuclear program is not civilian, as they claim; it is  the pursuit of a bomb to destroy Israel and threaten U.S. national  security interests in the region.\n\nThe international community…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694081/9999"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…peace, ending eight wars  in 8 months. Tell me who in history has ever done this.\n\nThe war between Israel and Hamas is over. The hostages were returned  home. The Iranian nuclear program has been set back for decades, and  the Middle East is more stable than it has been in years.\n\nTo gain peace through strength, we have invested in America's  national…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697390/providing-an-update-to-the-american-people"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…remembers last summer when the  frequent fliers of the War Powers Resolution reached yet again for  their favorite tool after the President's decision to degrade Iran's  nuclear program without putting a single American boot on the ground.\n\nOf course, there are serious questions at hand to which the Senate  and the American people should expect serious…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698662/venezuela"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…around the world. Military recruitment has surged to its highest level  in 15 years. Morale is high. Deterrence is back.\n\nPresident Trump successfully crippled Iran's nuclear program. He  strengthened the success of the Abraham Accords. He secured the release  of the hostages in Gaza. He ended wars around the world not once, not  twice, but eight times.…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696537/government-funding"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Israeli operations to blunt them.\n\nNow, fortunately, the President rejected the pleas of appeasers and  isolationists. The strikes he ordered dealt a massive blow to Iran's  nuclear program, bolstered American credibility, and strengthened U.S.  and Israel leverage to end Iran's pursuit of nuclear weapons and its  support for terrorism for good.\n\nThanks to…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692870/9999"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…successful protection of the American people is an impeachable offense.  Democrats are calling for the President's impeachment because of his  successful attack on the Iranian nuclear program.\n\nNational security should be something that unites us. But let's not  forget that Democrats have said Presidents can act without a vote of  Congress. They have said it…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693090/iran"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…disturbing to see the reflexive partisan  reactions by certain Members of Congress. Either they believe Iran  should obtain a nuclear weapon or they hope the regime's nuclear  program will magically disappear on its own. Both positions are equally  delusional.\n\nIt is time to put partisanship aside and come together as a country.  This is not just another…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692744/iranian-regime-is-worlds-foremost-sponsor-of-terror"}]