[{"senator": "Ed Markey", "party": "Democrat", "sentence": "…rescinded $80 million in congressionally  appropriated FEMA funding for New York City bank accounts.\n\nNo. 43, fired--and then rehired--over 300 staffers at the National  Nuclear Security Administration, jeopardizing  the security of the U.S. nuclear stockpile.\n\nNo. 44, threatened to take over Canada.\n\nNo. 45, weakened NATO by cozying up to Russia and alienating…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690442/trump-administration-first-100-days"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…of control. Let me lay out several of my  concerns with this legislation.\n\nFirst, this NDAA authorizes $890 billion in funding for the  Department of Defense, National Nuclear Security Agency, and other  national security agencies. This is approximately $8 billion above what  the President requested in his Fiscal Year 2026 Budget for national  security…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698005/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…about the chaotic situation that we are in while we are  here talking about $5, Mr. Speaker, you know that this President fired  our nuclear experts from the National Nuclear Security Administration.  So here we are without the protection of the experts to let us know  what should be done to make sure that we don't have nuclear power  destroying us…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689845/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "Ms. STANSBURY. Mr. Speaker, Donald Trump's war on science is putting  our country and our economy in peril. From haphazard firings of Federal  workers who work on nuclear security and keep our food and medicine  safe to firefighters and healthcare workers, I am here to say enough is  enough.\n\nAs a proud woman in STEM and a bona fide science nerd,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691393/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…was cut by 7 percent and was only one of a few accounts to  see its budget reduced by that bill.\n\nThe Office of Defense Nuclear Nonproliferation is involved in  critical nuclear security work, which is actively keeping us safe, from  securing nuclear material worldwide to verifying that other countries  and various rogue actors are not developing nuclear…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694866/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…rise today to open the Special Order hour  to discuss the expiration of the New START treaty, the importance of  arms control, and the urgent need to strengthen global nuclear  security.\n\nI thank the Members who will be joining me this evening for their  leadership and their willingness to engage on issues that carry  existential consequences for our…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699037/expiration-of-new-start"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…overseas--must command  the new energy frontiers and not lose the edge on inventing our common  future.\n\nFinally, our bill provides an increase to $25.4 billion for the  National Nuclear Security Administration.\n\nMs. KAPTUR. Mr. Speaker, I thank the gentlewoman for allowing me to  focus on our National Nuclear Security Administration, where we must  maintain safe,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698752/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…and other critical agencies.\n\nWe have seen this firing be so haphazard that they have had to hire  some of them back, including the decision to fire all the National  Nuclear Security Administration personnel responsible for overseeing  our U.S. nuclear weapons stockpile and then having to rehire them once  they had realized who they had actually fired.…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692038/consequences-of-doge"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Speaker, activity in House committees is taking us  in the wrong direction. Last week, the Appropriations Committee  approved an energy and water bill that cuts the National Nuclear  Security Administration's Defense Nuclear Nonproliferation account by  $412 million. That is 17 percent. These activities help the U.S. stop  the spread of nuclear weapons, detect…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694117/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…politics were quite different, we were united by a  special responsibility to join the discussion about nuclear weapons and  ask what we could do to strengthen global nuclear security and maintain  U.S. leadership in trying to prevent nuclear war.\n\nOne area where we were always in violent agreement was to stop  wasting money on Star Wars, which was…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694113/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…of New York, to be       Under Secretary for Science, Department of Energy.\n\n3. Executive Calendar #107--Brandon Williams, of New York,       to be Under Secretary for Nuclear Security.\n\n4. Executive Calendar #123--Theodore J. Garrish, of       Maryland, to be an Assistant Secretary of Energy (Nuclear       Energy).\n\n5. Executive Calendar #124--Andrea…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695711/s-res-377"}, {"senator": "Chuck Fleischmann", "party": "Republican", "sentence": "…billion cut to defense funding. Again,  for my colleagues and for those watching, it is in the Energy and Water  Development appropriations bill that we fund the National Nuclear  Security Administration. This is our country's nuclear weapons  activities. This would be cut by almost $9 billion, roughly 50 percent,  causing, in my view, irreparable harm…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694951/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Chuck Fleischmann", "party": "Republican", "sentence": "…strengthen our economy, and unleash American energy  dominance.\n\nThe bill delivers strong support for our national defense and  provides $25.4 billion for the National Nuclear Security  Administration, prioritizing the continued modernization of the nuclear  weapons stockpile and the United States Navy nuclear fleet.\n\nThe bill strengthens our Nation's…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698750/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Scott DesJarlais", "party": "Republican", "sentence": "…command and control systems,  and the scientific capabilities that maintain our nuclear stockpile. We  also established a new Rapid Capabilities Program within the National  Nuclear Security Administration to enhance our ability to respond to  growing nuclear threats from China and Russia.\n\nOur adversaries, China in particular, continue to rapidly develop…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697798/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…provisions I  secured to modernize our nuclear deterrent and strengthen our national  defense.\n\nAs chair of the Strategic Forces Subcommittee, I fought to upgrade  the National Nuclear Security Administration's infrastructure. The bill  establishes an annual independent assessment of NNSA's progress toward  modernization goals, ensuring our nuclear deterrent…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695027/9999"}, {"senator": "Rick Scott", "party": "Republican", "sentence": "…Florida. Mr. President, the President deserves his  national security nominees today. Let me see if we will consider this  one: Brandon Williams to be Under Secretary for Nuclear Security,  Military Health System.\n\nMr. Williams is a nuclear submarine officer. During his service, he  made six strategic deterrence patrols, was a nuclear weapons safety  officer,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691405/motion-to-discharge-s-res-195"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…of New York, to be       Under Secretary for Science, Department of Energy\n\nExecutive Calendar No. 107, Brandon Williams, of New York,       to be Under Secretary for Nuclear Security\n\nExecutive Calendar No. 121, Tristan Abbey, of Florida, to       be Administrator of the Energy Information Administration\n\nExecutive Calendar No. 122, Leslie Beyer, of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695696/authorizing-the-en-bloc-consideration-in-executive-session-of-certain-nominations-on-the-executive-calendar"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…critical investments in our national defense by  increasing Department of Energy defense program funding by $912  million. This includes $25.4 billion for the National Nuclear Security  Administration, an increase of $1.3 billion. These funds ensure we can  maintain today's nuclear stockpile, prepare for future needs, and  modernize aging infrastructure…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698749/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}]