[{"senator": "Mark Warner", "party": "Democrat", "sentence": "She  joins the growing number of Muslim Virginians that already serve across  all three levels of Virginia government--in the State House, in our  judiciary, and in so many levels of local government.", "title": "Commerce, Justice, Science; Energy and Water Development; and Interior", "date": "2026-01-12"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "We have had a number  of fires similar, but smaller in scope, to the one that just hit Los  Angeles due to the Santa Ana winds that come through our area in  southern California every year and also due to drier conditions because  of climate change and droughts.", "title": "Cuts to Forest Service Endanger Millions", "date": "2025-04-08"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "In my district in Virginia, we  have some of the largest number of soy farmers in the Commonwealth.", "title": "Stories From Home: the Human Cost of Expiring Healthcare Tax Credits", "date": "2025-11-17"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "It is  not just numbers in a line item in a budget.", "title": "Privileges of the Floor", "date": "2025-03-31"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "Yet, around the world, malnutrition and starvation is the  number one cause of death for children.", "title": "Calling on Trump Administration to Restore Food Aid", "date": "2025-06-10"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "Speaker, is the number of Republicans who  are now publicly claiming buyers' remorse for voting for this bill.", "title": "Providing for Consideration of H.R. Support for Patients and Communities Reauthorization Act of Providing for Consideration of H.R. Save Sba From Sanctuary Cities Act of Providing for Consideration of H.R. American Entrepreneurs First Act of and Providing for Consideration of H.R. Capping Excessive Awarding of Sblc Entrants Act of 2025", "date": "2025-06-04"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "1602 and  ask that it be reported by number.", "title": "-9999", "date": "2025-04-04"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "He served in that role until 1999, when  he became GAO's Chief Operating Officer, the agency's number-two  position, helping guide the direction and long-term vision of the  workforce.", "title": "Commending the Honorable Gene Dodaro", "date": "2025-12-19"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "While large systems, such as aircraft, ships, tanks, and missiles,  are principally provided via the foreign military sales, or FMS,  process, a number of important items, such as small arms, vehicles,  radars, and other equipment, are transferred via direct commercial  sales.", "title": "International Traffic in Arms Regulations Licensing Reform Act", "date": null}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "They silence  public opinion, ignore the fires and storms that are made worse by  climate change to make fossil fuel extraction the number one priority  going forward for how we manage our public lands.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the Bureau of Land Management Relating to ``Buffalo Field Office Record of Decision and Approved Resource Management Plan Amendment''", "date": "2025-11-18"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "We can talk about the number of children who will be impacted by cuts  to Medicaid, a total of over 30 million nationwide.", "title": "Establishing the Congressional Budget for the United States Government for Fiscal Year 2025 and Setting Forth the Appropriate Budgetary Levels for Fiscal Years 2026 Through 2034", "date": "2025-04-03"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "Number one, they are concerned that  foreign diplomats might vote in local D.C.", "title": "Prohibiting Voting By Noncitizens in District of Columbia Elections", "date": "2025-06-10"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "It is an incredible number.", "title": "Researching Efficient Federal Improvements for Necessary Energy Refining Act", "date": "2025-11-20"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "That number is expected to grow, sadly, in  the coming days.", "title": "Central Texas Floods", "date": "2025-07-08"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "I had a number of those events, in Mansfield, Colchester, and Old  Saybrook, Connecticut, with very packed rooms.", "title": "Congress' Long To-Do List", "date": null}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "Registrations with USA Hockey       have increased by nearly 400 percent since 1980 from 136,000       to over 564,000, and the number of National Hockey League       players from the United States has increased from 72 in 1980       to 245 in 2024.", "title": "Miracle on Ice Congressional Gold Medal Act", "date": "2025-04-28"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "There are a number of factors that a police officer has to figure,  but it has to be an option that you can pursue that car.", "title": "District of Columbia Policing Protection Act", "date": null}, {"senator": "Rob Wittman", "party": "Republican", "sentence": "While I am encouraged to see that number beginning to recede, it is  still way too high.", "title": "Support for Patients and Communities Reauthorization Act of 2025", "date": "2025-06-04"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "Congress actually got together and said we are going to  have some efficiency standards on showerheads and a number of other  things.", "title": "Saving Homeowners From Overregulation with Exceptional Rinsing Act", "date": "2026-01-07"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "We are at an all-time high, even greater than the  1890s or 2010s in the number of people in this country who were not  born here.", "title": "Confusion Over Who Should Be Removed From This Country", "date": "2026-01-12"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "When I was growing up, the number of naturalized people every year  was about 200,000.", "title": "Diversity, Equity, and Inclusion", "date": "2025-04-07"}, {"senator": "Hal Rogers", "party": "Republican", "sentence": "In addition to an Emmy Award, Wayne has earned a number of accolades,  including Ohio Valley Conference (OVC) Coach of the Year in 1982, OVC  Hall of Fame Inductee in 2004, MSU Athletic Hall of Fame Inductee in  1995, the 2017 MSU Distinguished Alumni Award, and most recently, the  MSU Founders Award for University Service in 2025.", "title": "Tribute in Honor of Wayne Martin", "date": "2025-10-17"}, {"senator": "James Lankford", "party": "Republican", "sentence": "I went there to be able to see the implementation of the new  authorities and the things that the President is actually implementing  there that have so precipitously dropped the movement of illegal  immigration and have dramatically increased the number of interdiction  of drugs that are moving through that area.", "title": "Guiding and Establishing National Innovation for U.S. Stablecoins Act--", "date": "2025-05-08"}, {"senator": "Trent Kelly", "party": "Republican", "sentence": "We also are advancing support for our airborne force projection  needs, investing in aerial drones and antisubmarine sonobuoys, raising  the floor on the minimum number of aerial refueling missions, and  maintaining the inventory requirement for C-130 aircraft needed for  intra-theater airlift.", "title": "Streamlining Procurement for Effective Execution and Delivery and National Defense Authorization Act for Fiscal Year 2026", "date": null}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "That requires more time and a great  number of hoops to jump through.", "title": "National Audiology Awareness Month", "date": "2025-10-28"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "The independent Government Accountability Office recently came out  with a preliminary report that showed one Social Security number was  used to receive over 125 different insurance policies in 2023 alone.", "title": "Providing for Consideration of H.R. Lower Health Care Premiums for All Americans Act; Providing for Consideration of H.R. Do No Harm in Medicaid Act; Providing for Consideration of H.R. Protect Children's Innocence Act; and Relating to Consideration of H.R. Standardizing Permitting and Expediting Economic Development Act", "date": "2025-12-17"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "The Committee on Agriculture also reserves the       right to seek appointment of an appropriate number of       conferees should it become necessary and ask that you support       such a request.", "title": "Fire Safe Electrical Corridors Act of 2025", "date": "2025-05-13"}]