[{"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…reported last week, and these are  incredibly impressive young men and women.\n\nMy district, Virginia's 10th, has an incredibly competitive process  and nominates the most number of people  to military academies of any district in the country.\n\nThese young men and women were able to get through our rigorous  progress by demonstrating leadership, patriotism,…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693568/congratulating-military-academy-appointees"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…enthusiastic.\n\nLater on we heard from Ted Donnelly, who leads QCAP's food and  nutrition programs at their South West Community Center. He spoke about  the record-breaking number of people coming to the food pantry every  month, especially when USDA let SNAP benefits lapse during the  Republican shutdown.\n\nWe also heard poignant stories from a few of QCAP's…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699212/end-hunger-now-visit-to-quincy-community-action-programs"}, {"senator": "Mark Pocan", "party": "Democrat", "sentence": "…an official  shrug when the Israeli Government is called out.\n\nThe definition of genocide by the New Oxford American Dictionary is  ``the deliberate killing of a large number of people from a particular  nation or ethnic group with the aim of destroying that nation or  group.''\n\nThat is exactly what we are seeing in Gaza right now by the Israeli  Government…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695067/condemning-benjamin-netanyahu"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…service, which, again, has been in practice  in the past for decades.\n\nThey are also closing 47 Social Security offices across the country.  Again, at a time when the number of people who need to interact and  interface with the Social Security system is bigger than ever, they are  shutting down offices, laying off staff, and shutting off phone  service.…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689134/dont-touch-social-security"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…online dating service bans a user for fraud, it  notifies all the other users who have been in contact with that banned  person on the service. This will help to reduce the number of people  who fall victim to identified fraudsters looking to extort money from  dating app users.\n\nMr. Speaker, this bill is an important first step in addressing harm  in the…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692728/romance-scam-prevention-act"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…United States, especially in the last 9 months, we  are doing everything we can--well, the Trump administration is doing  everything it can, it would seem, to limit the number of people who can  go into this kind of work. They are cutting back on the grants that  would allow people to do the research, and they are cutting the funding  for people who are…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695606/devastating-harm-caused-by-trump-administration"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…Virginians to lose their health insurance. Our  population is about 8.8 million; 330,000 people losing health insurance  is not a small number. This is a big--big--deal. That number of people  who lose their health insurance is essentially what I call the top  layer of a five-layer cake of consequences to these healthcare bills.  That is consequence one, people…", "date": "2025-10-01", "source_url": "https://justfacts.votesmart.org/public-statement/1695967/en-bloc-nominations"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…powerful strategic weapons that would cause incalculable  loss of life, widespread radiation poisoning, and destruction on a  scale unlike anything seen in human history. The number of people  killed immediately is estimated to be in the tens or even hundreds of  millions, and many more would later die from famine.\n\nThere is little doubt that a nuclear war…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694014/new-start-treaty"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…gun violence are completely out of control when  compared to the nations in the European Union or Canada, our next-door  neighbor. We are losing 5, 10, or 20 times the number of people that  the residents of those countries are losing because our gun laws are  like Swiss cheese. They are filled with holes. Let's close those  loopholes. It doesn't diminish…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691242/leosa-reform-act"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…Mr. Speaker, 57 percent of Americans, both Democrats and  Republicans, disapprove of the way ICE is enforcing immigration laws.\n\nPut simply, ICE is out of control. The number of people with no  criminal records being detained is 16 times greater than in previous  administrations. Mr. Speaker, 92 percent of individuals recently held  in ICE detention…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699655/horrific-ice-abuses"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…going to have to decide if they are going to keep their  coverage at all, and for those who do keep it, it is going to  skyrocket. And we don't know yet the final number of how many people  are trading their good insurance for junk plans that have cheaper  premiums but also have unaffordable deductibles. But we do know that  working families will suffer…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697772/healthcare"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…he doesn't want to, but please don't  mischaracterize what I said.\n\nMr. Speaker, I am looking over to the other side of the aisle and  can't help but be stunned by the number of people over there who I  remember coming on this floor and denying the election results in the  year 2020 because they didn't like the results.\n\nMr. Speaker, I am going to urge…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699941/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…they don't need to listen to me. Here is what the experts have  found. A study published in the Annals of Internal Medicine found that  Republican cuts would increase the number of people skipping medical  care because of cost from nearly 129,000 people to nearly 839,000  people a year.\n\nA study from Yale and Penn found that Federal cuts from Medicaid and…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692644/one-big-beautiful-bill"}, {"senator": "Jim Costa", "party": "Democrat", "sentence": "…25,000 people could lose coverage through the Affordable Health  Care Act. We have made remarkable progress as a result of the  Affordable Health Care Act, reducing the number of people without  insurance in our constituency to less than 10 percent. That would be  changed.\n\nThere would be $3 million in energy and conservation funds that would  be withheld…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688104/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions-and-providing-for-consideration-of-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…the  contributions of people with physical disabilities. Designated by  Congress as NDEAM in 1988, commemoration evolved to acknowledge the  importance of increasing the number of people with disabilities in the  workforce. In 2001, the Department of Labor's Office of Disability  Employment Policy (ODEP) was created and was given responsibility for  NDEAM…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696023/recognizing-national-disability-employment-awareness-month"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…the standard deduction. Who does the  standard deduction support, and who does it help? It helps lower- and  middle-income Americans, plain and simple. It increased the number of  people who took the standard deduction and gave them the best tax  benefit. It is the wealthy folks who itemize, for the most part. Right  there, we are already targeting middle-…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690427/the-first-100-days"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…right  people who assist and contribute to society as opposed to taking from  it, let alone commit violent actions against society.\n\nThe good news to report is that the number of people coming across  the border is down 99 percent. It didn't take a new law. It simply  meant enforcing the law. Those people who are enforcing the law are  actually men and…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692334/election-promises-made-promises-kept"}, {"senator": "John Thune", "party": "Republican", "sentence": "…eligibility. We are signing them up.'' And  since they don't have to pay a premium, they don't even know they are  covered.\n\nSo what has happened the past few years? The number of people who  haven't filed claims literally since 2021 has tripled.\n\nAs I said before, there are lots of reasons why people don't file  claims. You might have a good, healthy…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697879/healthcare"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…her district from MS-13.\n\nMr. MAST. Mr. Speaker, I would let Ms. Jayapal know that in her  district they have lost 237 people in the last year from overdoses and  had a number of people killed by MS-13 and Tren de Aragua. The  President is working to protect her people.\n\nMr. MAST. Mr. Speaker, I would let Representative Omar know that in  her district,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698249/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…employment going up or down, you should ask what type of employment is  going up or down. Is it like Donald Trump wants, and the vast majority  of Americans want, in which the number of people involved in  manufacturing or service industries that make us a wealthier country  are going up?\n\nDo we want to have the type of figures--which kind of, I think,  misled…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700071/issues-of-the-day"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…demographic crisis. We have a shortage of young people.\n\nThink about this bit of math. Twenty years ago and today, we  functionally have the same number of 18-year-olds, but the number of  people who are 65 and up has doubled.\n\nOver here, I have my 18-year-olds. Over here, I have gone from 35  million to now almost 70 million of our brothers and sisters who are…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692327/math-always-wins"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…in the 1960s, that our crime rate would drop like a stone? Does anybody  think or not think that the number of--even though it can happen in the  best of families--the number of people dying of drug abuse wouldn't  fall? Does anybody think our education would improve if we had kids who  are doing a better job of focusing at school?\n\nIt is high time,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695628/breakdown-of-traditional-families"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…particular, they have harassed staff members because  people raised the question about why you zero out staff.\n\nMr. Chairman, ask Dan Scavino. Ask Mark Meadows. Ask a number of the  people who have been targeted and were harassed by these judges and  January 6ers. We should make amends, and we should not fund this court  to continue its lawlessness.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699058/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…saw  from the poster board, illegal immigration has a true cost, whether it  be increasing demand, let alone the vital services that are strained  under that increased number of people in a very short period of time.\n\nI yield to the gentleman from Montana (Mr. Downing), who also serves  on the Financial Services Committee.\n\nMr. HARIDOPOLOS. Mr. Speaker,…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699813/lowering-housing-costs-and-advancing-main-street-community-banks"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…don't like what the House  Republicans are doing and don't like what the  President is doing, but the American people do.\n\nPoll after poll is showing that an increasing number of people now  believe this country is heading in the right direction. A Rasmussen  Reports survey shows that this is the first time in 20 years that the  majority of respondents…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691940/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…abroad. That is an all-time high. As we  analyze what we have to do on this situation, we ought to remember: If  we do nothing, we are already at an all-time high in the number of  people who are in the United States who were not born here.\n\nAs far as the over 800,000 who were naturalized, that is about four  times what it was when I was a child in the…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699344/fundamentally-changing-immigration"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…based on innovation and hard  work. That should be our model and approach.\n\nWhile I appreciate those who have gone through a terrible disease  like cancer, as I did, as a number of people in this Chamber, and as  millions of Americans across this country have done, it is not always a  rationale for more government spending, more government action, and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695719/highlighting-flawed-policies"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…wrong here.\n\nLet us not forget: Every year in this country, 850,000 people are  naturalized. They are sworn in as new citizens. We are at an all-time  record of the number of foreign-born people in this country. The United  States has nothing to apologize for about the number of people being  allowed in this country, as we try to remove people.\n\nRight now,…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699125/united-states-naturalizes-people-every-year"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…more money back in their  pockets, instead of sending it up here to Washington, D.C.\n\nHe promised a secure border. Mr. Speaker, there is a 99 percent  reduction in the number of people coming across the border illegally.  That is action. What are we putting in this bill? We are putting in the  money needed to make sure it stays that way.\n\nI am proud…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693227/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…demographics. I am going to  probably say this twice just so it starts to bleed in.\n\nToday, we have the same number of 18-year-olds as we had 20 years  ago. We have doubled the number of people 65 and up. So, functionally,  we have the same number of 18-year-olds--it is no one's fault. It is  not Republican and Democratic. Starting in 1990, U.S. fertility rates…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693062/stop-bathing-in-folklore-and-start-bathing-in-math"}]