[{"senator": "Betty McCollum", "party": "Democrat", "sentence": "…It is a terrible deal for the American people.\n\nAmericans deserve an open and transparent government that works for  them. They deserve access to affordable healthcare and nutritious food  for their families. That is what Democrats are fighting for. I wish the  President and Republicans would join us in this fight and share our  priorities.", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696728/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…address childhood obesity, nutrition, or hunger.\n\nThe bottom line is that Members of Congress should not inject  politics into child nutrition standards at the expense of nutritious  school meals that our children need.\n\nFor those reasons, I urge my colleagues to oppose S. 222, and I yield  back the balance of my time.", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698183/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "Mr. McGOVERN. Mr. Speaker, in 99 percent of counties in the United  States, SNAP benefits don't cover the cost of a nutritious meal.\n\nThe good news is that there are exciting partnerships happening that  show us it is possible to improve access to healthier foods.\n\nIn New York City, local nonprofits,…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689401/end-hunger-now-with-innovative-ways-to-feed-hungry-people"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…generation began in  the Monrovia Unified School District as the director of food service.\n\nHe has been a vital part of the school district, ensuring our  students have healthy, nutritious meals every day to focus and thrive  on their studies.\n\nMr. Singleton has brought discipline, leadership, and a commitment to  service to our schools in Monrovia Unified.…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696998/small-business-saturday"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…individuals who are the  life force of our nation: our farmworkers. Their commitment and  tireless efforts in the field ensure that every family in this country  can access fresh, nutritious food. I see and hear you, and I am proud  to represent you.\n\nEvery day, these tireless workers face challenges that require  strength and perseverance. Whether enduring extreme…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687984/dire-consequences-of-funding-freeze-and-mass-firings"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…heartland and  communities I represent. Seven of the eight counties I represent in  northwest Ohio are predominantly rural and home to hardworking farmers  who produce the nutritious food that feeds and fuels our Nation. They  deserve our unwavering support because what America makes and grows  makes and grows America.\n\nYet their work has never been harder.…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699499/a-plea-for-small-family-owned-farms"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…listening. Healthcare is real.\n\nLet's make America healthy again by keeping programs like Medicaid.  Let's make America healthy again by making sure that children are  eating nutritious meals. Let's make America healthy again by making  sure people in rural communities have access to hospitals and  healthcare. Let's make America healthy again by providing…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692206/raising-awareness-about-mens-health"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…centers and distributes more than 200 million meals  every year to older adults and people with disabilities through the  Meals on Wheels program.\n\nSeniors need access to nutritious food so they can lead healthy  lives. It is not just the food. The person delivering the meal is often  the only social contact the client will have that day, which is  especially…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690500/blocking-resolutions-of-inquiry"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…gap so that families  don't go hungry amid these reckless Republican cuts.\n\nLorraine's, named after the first executive director of the soup  kitchen, has been providing nutritious food and hope to families in  western Massachusetts for 30 years. Under the incredible leadership of  Kim Caisse, Lorraine's serves hot meals and provides nutritious pantry…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699562/end-hunger-now"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…Let's  say that, because I know private sector companies that have bent their  cost curves and saved money not by cutting healthcare but by giving  people better access to nutritious, healthy foods. You are what you  eat.\n\nWe are not coming up with bipartisan proposals to save money, to  create efficiencies, to do things that can make programs run better.…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Amherst recently joined together to address the terrible  problem of food insecurity on their campus. After witnessing--and some  even experiencing--difficulty affording nutritious food, these  remarkable students worked with Chancellor Reyes and his team, the  Amherst Survival Center, and the Food Bank of Western Massachusetts to  establish the UMass…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695079/umass-amherst-campus-pantry"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…Jennifer  Denton.\n\nSince 2015, she has led as executive director of Burrito Brigade, a  volunteer-driven nonprofit that has hand-delivered hundreds of  thousands of warm, nutritious meals to hungry people across Eugene and  Springfield. She also created Free Little Pantries, giving neighbors a  way to share food directly with those in need.\n\nDuring COVID,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695683/recognizing-jennifer-denson"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…and food banks.\n\nLocal farms who rely on these programs for consistent purchases of  their food no longer have an important market, and it means that  locally grown, more nutritious food is no longer available for food  banks and schools.\n\nJust yesterday, USDA announced that it was ending part of the Farm to  School Program. This program for years incentivized…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689059/feeding-our-children"}, {"senator": "John Mannion", "party": "Democrat", "sentence": "…bring Democrats and Republicans together.\n\nThis bipartisan bill that I proudly cosponsored does something simple  and practical. It gives schools the flexibility to serve nutritious  milk options, while supporting local dairy farmers.\n\nSince whole milk was removed from school cafeterias, milk consumption  has dropped sharply. Kids aren't meeting recommended…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698263/supporting-whole-milk-for-schoolchildren"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Republicans are taking  away people's healthcare in this country, it is a big deal.\n\nThis bill, this tax scam bill, would literally take food out of the  mouths of kids, and take nutritious food from senior citizens and  veterans. For what? To give massive tax breaks to billionaires and to  add trillions of dollars to our national debt.\n\nMr. Speaker, their ugly,…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691944/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…programs,  which were put under unnecessary strain during the shutdown. It will  fund WIC and SNAP, ensuring that low-income mothers and their babies  have access to healthy and nutritious foods.\n\nThese programs should not have been used as a bargaining chip during  the shutdown. Republicans are stepping up to protect Americans and  ensure these programs remain…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696682/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "John Moolenaar", "party": "Republican", "sentence": "…many  kids, milk is the most reliable source of vital nutrients they receive.\n\nThis legislation is about common sense and choice. Whole and reduced- fat milk are safe and nutritious options that many children prefer and  are more likely to drink. When kids enjoy milk, they are more likely to  drink it and get the nutrition it offers instead of pouring…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698184/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…to recognize the  65th anniversary of the Meals on Wheels program led by Senior Citizens,  Inc. in Savannah, Georgia.\n\nFor 65 years, this program has provided thousands of nutritious meals  and vital daily contact with elderly, homebound adults.\n\nThis year, to celebrate the milestone, Senior Citizens, Inc.  partnered with local chefs, including James…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692062/meals-on-wheels-65th-anniversary"}, {"senator": "John Boozman", "party": "Republican", "sentence": "…discussed, would allow for schools  participating in the National School Lunch Program to, once again,  offer whole and reduced-fat milk while also expanding the options for  nutritious nondairy beverages.\n\nThe good news is, this legislation has support in the Senate and was  unanimously reported out of the Senate Agriculture Committee earlier  this year.…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697061/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…be clear. This is a win for everyone involved. It supports our  children's health and gives a boost to our Nation's dairy farmers who  work hard every day to provide safe, nutritious products.\n\nMr. Speaker, National Dairy Month is not just a moment of  recognition. It is a call to action to stand with rural America, invest  in the next generation, and…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692463/national-dairy-month"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…Pennsylvania, the dairy industry  contributes $14.7 billion to the State's economy.\n\nMr. Speaker, I thank our American dairy farmers who work around the  clock to provide nutritious and delicious milk to all Americans.\n\nHappy National Milk Day.", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698847/national-milk-day"}, {"senator": "Dan Newhouse", "party": "Republican", "sentence": "…their products go right back into the communities from  where they were produced.\n\nI thank my colleagues in both Chambers on both sides of the aisle for  helping put this nutritious, high quality whole milk back into our  schools and also for bringing back common sense into how we keep  Americans healthy.", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698185/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "Roger Marshall", "party": "Republican", "sentence": "Mr. MARSHALL. Mr. President, before I start talking today, I just  want to pause for a moment to take a quick drink of the most  nutritious, delicious drink known to humankind. So here is to healthy  bones and here is to all the hard-working dairy farmers across Kansas  and across America.\n\nThis summer, the Senate…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697062/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…serve a broader variety of milk in the school lunchroom.\n\nDairy farmers in Pennsylvania's 15th Congressional District and  across our country work hard every day to produce nutritious milk for  our families and communities.\n\nI am proud to lead this legislation that would allow schools to serve  flavored and unflavored whole and reduced-fat milk in school…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698178/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…hot meal. In addition to those who enjoy the  sit-down meals on Sunday, she makes sure that two families with a  combined total of nearly two dozen children also receive a nutritious  and delicious Sunday meal. Because of the length of time she's been  with PHP and her deep involvement with PHP's mission, Mary also serves  as an ``unofficial'' historian.…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691234/recognizing-mary-adams-adamczewski"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…his dedication to our country, Albert is a lifelong volunteer  who finds joy in helping his community. He spent a lot of his time  volunteering at soup kitchens, providing nutritious meals to families  and individuals in need.\n\nAlbert is also a devoted husband and loving father. He was married to  his wife for over 60 years, and together they raised 8…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692324/recognizing-wwii-combat-veteran-albert-busacca-on-his-100th-birthday"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…hundreds of dollars.\n\nStudies show that frozen produce is less likely to be wasted compared  to fresh produce that spoils over time, giving consumers access to  affordable, nutritious food year-around.\n\nBy freezing food at its peak, we preserve both the flavor and  nutrients, making it a smart choice for families looking to eat well  while managing their…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689069/frozen-food"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…organization, her leadership, tenacity, and compassion for those in  need have led the Community Food Bank to grow from supplying 1-2  million meals each year to over 5 million nutritious meals and critical  supplies to fill the meal gap and basic needs for over 70,000 of our  neighbors in need. She has taught the entire team to ``BELIEVE that  they will end…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690137/recognizing-barbara-sprague"}]