[{"senator": "Jason Crow", "party": "Democrat", "sentence": "…courses. Her dedication to excellence is further highlighted  by her numerous awards and decorations, including the Bronze Star Medal  and the Meritorious Service Medal with three oak leaf clusters. She has  also been recognized with multiple Airman and Noncommissioned Officer  of the Year awards throughout her career.\n\nChief Master Sergeant Sharma J. Haynes…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692495/recognizing-the-service-of-chief-master-sergeant-sharma-j-haynes"}, {"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…Resolution Copper, blew up a 46,000- year-old sacred aboriginal site in Australia in 2020.\n\nNow, just upstream from Phoenix, Arizona, BHP and Rio Tinto are  pushing to destroy Oak Flat, a sacred site for multiple Apache Tribes  that is listed on the National Register of Historic Places, to build  the Resolution Copper mine. This is a mine that would create…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699693/critical-mineral-dominance-act"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…rise to congratulate Edie Brooks on being  named Teacher of the Year by the Virginia Business Educators  Association.\n\nEdie is a business and IT career education teacher at Post Oak Middle  School. She was honored for her innovative teaching strategies,  unwavering commitment to student success, and active pursuit of  professional growth. Through her commitment…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695517/constituent-of-the-week-edie-brooks"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…as Commander and  contributed to fundraising efforts for the Kin On Nursing Home and  youth scholarships. Additionally, Bill served as the English secretary  for the Gee How Oak Tin Family Association and the Bing Kung  Association, and as an officer of the Chinatown Chamber of Commerce. He  left a resounding impact on all those around him and was a…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691351/recognizing-william-bill-leonard-chin-former-cathay-post-no-186-commander-and-world-war-ii-veteran"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…Nationwide, 95 million birders generate  over $90 billion annually for our economy.\n\nThe biggest week in American birding is sponsored by the Black Swamp  Bird Observatory in Oak Harbor, Ohio. This event leverages public- private partnerships to promote conservation of migratory bird  populations and promote millions of dollars of economic development…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690918/national-american-birding-week"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…Her service reflects the very  best of our military.\n\nIn recognition of her outstanding contributions, Major General  Clellan has been awarded the Legion of Merit with Bronze Oak Leaf  Cluster, the Bronze Star Medal, the Meritorious Service Medal with two  Bronze Oak Leaf Clusters, and the Parachutist Badge.\n\nOn behalf of the people of Colorado and the…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696265/recognizing-major-general-laura-clellan"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…large number of customers, McDonald's soon became  the talk of California. It was a success, and people noticed.\n\nOne of those people was Ray Kroc, a traveling salesman from Oak Park,  IL. Kroc also was the son of immigrants, his parents were born in  Bohemia, which is now part of the Czech Republic. Ray became enamored  by Dick and Mac's business model…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689830/recognizing-70-years-of-mcdonalds"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "Mr. DAVIS of Illinois. Mr. Speaker, today I rise to recognize and  honor Mrs. Essie Pough, one of my constituents from Oak Park, Illinois  as she prepares to celebrate her 100th birthday on February 11, 2026.  Reaching the age of ``five score'' is a testament to a century of  grace, wisdom, endurance…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699343/recognizing-mrs-essie-pough"}, {"senator": "Ilhan Omar", "party": "Democrat", "sentence": "…rise today to recognize John and Amy Higgins  and their work to host the Fourth Annual Lake of the Isles Pencil  Sharpening.\n\nIn 2022, after high winds damaged a 180-year-old oak tree near the  historic Bull Higgins house, John and Amy commissioned local sculptor  Curtis Ingvoldstad to shape it into a piece of art that folks of all  ages can identify…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692927/lake-of-the-isles-pencil-sharpening"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…efficient flight operations at the Department of Defense's largest  aerial port.\n\nFor his outstanding service, Capt. Hammond received the Air and Space  Commendation Medal with two oak leaf clusters, the Air and Space  Achievement Medal with one oak leaf cluster, and the Army Achievement  Medal. He was also named the 2025 Company Grade Officer of the Year…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690077/recognizing-the-military-service-of-nathan-l-hammond"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…mullets, 47 in number,       alternating with three rampant lions and incorporating four       chevrons. In base, the word ``SACRIFICE'' is inscribed. In       dexter base, three oak leaves are placed, symbolizing the       national tree of the U.S., representing strength, resilience,       and honoring the families and widows of the fallen. The       reverse…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699505/medal-of-sacrifice-act-of-2025"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…fuel  supply chains. And more than any other State, Tennessee is best  positioned to lead our Nation's nuclear renaissance, especially with  the work that is being done at the Oak Ridge National Lab and at our  universities. I will remind my colleagues that our nuclear energy  industry had its birth at the Oak Ridge National Lab, in Tennessee.\n\nWe also…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698427/unanimous-consent-requests-the-calendar"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…this is going to be a special hour,  thanks to the gentleman from California.\n\nMr. MOORE of Utah. (English translation of the statements made in  Korean is as follows:)\n\nYoung Oak Kim Sister\n\nThank you!\n\nYou did well!\n\nYou did well!\n\nGim Yeong-ok uiwon-nim\n\nGamsahamnida\n\nSugohasyeosseumnida\n\nSugohasyeosseumnida Take that, Doug.\n\nMr. MOORE of Utah. Mr.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698737/9999"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…as  a tail gunner on a B-24 bomber and was briefly stationed overseas for  six months. As a result of his meritorious service, he received the  Purple Heart, an Air Medal with Oak Leaf Cluster, the European-African- Middle Eastern Campaign Medal with one silver battle star, and the Good  Conduct Medal with one overseas bar. Johnny completed his service…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690292/recognizing-congressional-patriot-award-recipient-john-johnny-rothfus"}, {"senator": "John Carter", "party": "Republican", "sentence": "…from over ten  nations, including Russia, Turkey, and Norway.\n\nCOL Patterson's distinguished military service earned him numerous  accolades, including the Legion of Merit with oak leaf cluster, the  Army Commendation Medal with oak leaf cluster, and the Meritorious  Service Medal with four oak leaf clusters. He is also a recipient of  the prestigious…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689317/saluting-the-service-of-colonel-garry-patterson"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…lived big in the small moments with warmth, attention to detail, and  genuine kindness.\n\nDoug was the only Member of Congress who ever called me by my Korean  name, Kim Young Oak. He didn't have to remember it. He never needed to  do that, but that small, thoughtful gesture meant the world to me and  spoke volumes about who Doug was.\n\nDoug was a strong,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698709/9999"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…training center for ag in Sedalia to  prepare the next generation.\n\nWe are replacing a failing bridge so first responders, schoolbuses,  and commerce can move safely and reliably in Oak Grove, Missouri.\n\nThese are reasonable Member-directed investments in America, our true  Article I authority.\n\nMr. Speaker, we are just inches away from the finish line. Let's…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699347/department-of-homeland-security-appropriations-act-2026"}, {"senator": "John Carter", "party": "Republican", "sentence": "…where he managed all U.S. alert fighters and  oversaw Presidential support. He earned numerous accolades, including  three Top Gun awards and a Meritorious Service Medal with 3 oak leaf  clusters.\n\nAfter retiring from the Air Force, Lt. Col. Davison has continued to  serve his community. He is an active member of the Central Texas  Chapter of the Military…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689349/saluting-the-service-of-lieutenant-colonel-jeff-davison"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…commendations.\n\nIn addition to his military service, Ralph has continued to be a  fierce advocate for American values and a dedicated community  volunteer. He served as the President of Oak Cliff Junior Chamber of  Commerce and was a member of Rotary International, the Texas Silver- Haired Legislature, the Reserve Officers Association, Veterans of  Foreign Wars,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690225/recognizing-congressional-patriot-award-recipient-ralph-odell"}]