[{"senator": "Steve Cohen", "party": "Democrat", "sentence": "…Madam Speaker, I watched the President's interview on  ``Meet the Press'' yesterday. I was shocked at the lack of  understanding that the man has of his job.\n\nHe takes an oath to protect, preserve, and defend the Constitution of  the United States, and he says he is not sure if the Fifth Amendment is  applicable to people in this country and is not sure…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690660/comments-on-presidents-statements"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "Mr. THANEDAR. Madam Speaker, when I was sworn into office, I took an  oath to protect the Constitution of this great Nation.\n\nI am an immigrant who came to this country with just $20 in my  pocket. The United States has given me so much. I love America,…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1690991/the-truth-still-matters"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…current members of the military and intelligence  communities to adhere to the Constitution and the laws of our country.  They specifically said: ``Like us, you all swore an oath to protect and  defend this Constitution. Right now, the threats to our Constitution  aren't just coming from abroad, but from right here at home. Our laws  are clear. You can refuse…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697872/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…regimes  do business.\n\nTrump has turned the Office of the Presidency into a personal  moneymaking machine, and we must speak truth to power for the Americans  we took an oath to protect.\n\nLet's take a look at the timeline of this, shall we?\n\nAs the Republican Presidential nominee, Trump launched his family's  crypto venture called World Liberty Financial,…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "Lizzie Fletcher", "party": "Democrat", "sentence": "…who we represent and protecting the Constitution that gives us all of  our rights. It is being violated daily by this administration and by  officials who have sworn an oath to protect it, just as we have, as  Members of Congress.\n\nMr. Speaker, we are not doing that here today. That is why I am  voting ``no'' on this rule, and I urge my colleagues to…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699596/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…sent us here instead of making  their life better.\n\nMr. Speaker, we have to ask ourselves in this moment what role are we  playing and who are we here for? Did we take an oath to protect the  Constitution of the United States of America or not?\n\nIs our loyalty to the values of this country and the people that sent  us here? I hope it is not to super-PACs,…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692932/holding-power-accountable"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…veteran of the United  States Air Force on this national Women Veterans Day to tell Secretary  Hegseth and President Trump that women who raise their hand and swear  an oath to protect and defend this Nation are not going anywhere and we  will not be silent.\n\nFrom the earliest days of our Nation, women have always served, both  officially and unofficially,…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692563/women-in-the-military"}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "…personal gain.  At Quantico last week, Trump told our top military leaders that he  wants American servicemembers to ``train'' against the same citizens  they swear an oath to protect.\n\nLast month, he essentially declared war on Chicago, one of the  largest cities in the country that he leads, with a meme from a Vietnam  war movie about the loss of…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696180/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Call me crazy, but I think if we abdicate that power, we are not only  doing a disservice to the people we represent but we are violating our  sacred oath of office, our oath to protect and defend the Constitution  of the United States.\n\nThe last time I brought up this resolution, I was told it was  premature because there had been no strikes in Venezuela.…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699359/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…veteran who served in Iraq and Afghanistan, was  recently fired from his job at the USDA. He summed it up perfectly when  he said: ``This is not the America I swore an oath to protect.''\n\nThat is the sentiment I know many of us in this Chamber share.  Federal workers, like that veteran, swore an oath to protect this  country. Their dedication and service…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697870/providing-for-consideration-of-hr-2550-to-nullify-the-executive-order-relating-to-exclusions-from-federal-labor-management-relations-programs-and-for-other-purposes"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "Mr. THANEDAR. Mr. Speaker, when I was sworn into office, I took an  oath to protect the Constitution of this great Nation.\n\nI am an immigrant who came to this country with just $20 in my  pocket. The United States has given me so much. I love America,…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691026/protecting-our-constitution"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…President of these United States. That means that he may have to do a  little bit of research and decide that he wants to understand that he  swore an oath, and this oath was to protect and defend the  Constitution. That is the oath that he was supposedly taking on January  20.\n\nWe may want as well that the President look into what the Declaration…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690636/trumps-first-100-days"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "Ms. KAPTUR. Mr. Speaker, I rise today to sound the alarm for our  Republic and our Constitution.\n\nEvery one of us here in Congress swore a solemn oath to protect and  defend our Constitution against all enemies foreign and domestic. We  did not give any President a blank check for war.\n\nPresident Trump is over his skis. Article…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697914/venezuelan-strikes-and-congressional-war-powers"}, {"senator": "James Risch", "party": "Republican", "sentence": "…President sees a group of terrorists  planning to harm America or our allies, he has the right--not only the  right but the duty--to do something about it. He has taken an oath to  protect this country, and I and the majority of my colleagues are glad  the President took this action.\n\nNow, for some reason which I don't understand, the people who oppose…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696565/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…shut down. What is similar in  them both is the reason because Democrats have put the priorities of  illegal immigrants over the priorities of the people that we swore an  oath to protect; that is, the American citizens.\n\nA few months ago, the shutdown was to try to give illegal immigrants  free healthcare, and now the shutdown is simply over whether they…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699594/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…communities, and they do this despite the obstacles and dangers that we  all know that they face. Police officers rush into harm's way out of  duty and devotion to their sacred oath: ``To Protect and Serve.''\n\nThe families of law enforcement officers also bear the burden of  service through missed birthdays, school events, and sports games. This  resolution is…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691031/expressing-support-for-local-law-enforcement-officers"}, {"senator": "Ashley Moody", "party": "Republican", "sentence": "…spitting, kicking, and biting during arrests to vehicle-ramming, open  gunfire, and throwing Molotov cocktails--all because they are doing  their jobs that they took an oath to do to protect other human beings.  From January 21, 2024, through November 21, 2024, there were only 19  recorded assaults against ICE law enforcement. At the same time this  year,…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697550/halo-act"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…battlefields that define the  Army. It is the people. It is the young men and women from small towns  and big cities who raise their hands, lace up their boots, and swear an  oath to protect this Nation and its values.\n\nI have seen what that sacrifice looks like. I have worn the uniform.  I have served beside heroes, and I know what it means to be part of…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692297/recognizing-davenport-assumption-girls-soccer-team"}]