[{"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…Vivian in my  district, who I had a phone conversation with recently about the rising  cost of her healthcare premiums due to the Republicans' cruel refusal  to extend ObamaCare tax subsidies, are depending on those tax credits.\n\nShe told me: That is just an amount I simply cannot afford.\n\nMr. Speaker, her premiums are going from $50 a month all the way…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697217/medical-bills-are-too-high"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…untenable position of Democrats to come  before  this body and say: Oh, we want to give subsidies to people who make  $225,000 a year. That is what they are arguing for. The ObamaCare  subsidies are not the basic subsidies. These are add-on subsidies that  started 2 years ago. If you make $100,000 a year, the Democrats want to  give you $13,000. Meanwhile, people…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696562/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…Compounding these design failures are serious fraud and enforcement  breakdowns within the system itself. A 2024 GAO investigation found  that fake identities were approved for ObamaCare subsidies at a 100  percent rate. Often remaining enrolled despite missing or falsified  documentation, these ObamaCare subsidies continued for these fraudulent  applications.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698804/breaking-the-gridlock-act"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…were going up so much that Democrats passed extended,  temporary, enhanced premium tax credits--if you will, EPTCs--which  helped give more money on top of the original ObamaCare subsidies to  help people afford their premiums.\n\nThe way it works is they didn't give the money to the patient, to the  individual, to our fellow American; they gave the money…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697554/healthcare"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…High costs are not the only ObamaCare failure. It also resulted in a  major increase in fraud. A 2024 GAO investigation found that fake  identities were approved for ObamaCare subsidies at a 100 percent rate,  often remaining enrolled despite missing or falsified information.\n\nIn 2023, $21 billion in subsidies were paid out with no evidence of  tax…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698431/republicans-have-delivered-in-2025"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…need to do better for our  constituents who need access to affordable healthcare.\n\nWell, our Democratic colleagues are calling for a clean extension of  the enhanced ObamaCare subsidies because they don't want any changes in  what I have described here, and that is the heart of the problem. We  know there is a whole host of problems with this ObamaCare…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697929/healthcare"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…number two expense in our country is now? It is interest. If you do the  total interest load, interest.\n\nThe next is Medicare.\n\nNumber four turns out to be the ObamaCare, or the ACA subsidies and  Medicaid. That is number four.\n\nGuess what is number five now in our spending? It is defense.\n\nSo often, I will talk to my liberal brothers and sisters, and…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698412/fun-with-math"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…open-ended       government welfare can easily become an inducement for fraud.       A new Government Accountability Office report finds the       pandemic-era sweetened ObamaCare subsidies are . . . ripe for       gaming.\n\nThe GAO last fall began an undercover test in which it       submitted insurance applications for fictitious individuals       to the…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697906/affordable-care-act"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…the United States House Committee on Ways & Means]   Ways and Means: Watchdog Report Uncovers Widespread Fraud in Obamacare\n\nFraud prevention failures in Obamacare lead to insurance       subsidies for fake enrollees.\n\nInitiated by a Ways and Means, Energy and Commerce, and       Judiciary request in 2024, the Government Accountability       Office…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698438/uncovering-widespread-fraud-in-obamacare"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…because that is what  they want to do. They want to continue it for 83 billion more dollars.\n\nWhat about the Washington Post? This is yesterday's Washington Post:  ``Obamacare subsidies make it too easy to scam the system.''\n\nThat is what the Democrats appear to be wanting to do, continuing to  put money--$83 billion--into a system that even the Washington…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697878/healthcare"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…taxpayer.\n\nLast week, I was on the floor talking about this and about how  Democrats are peddling falsehoods to try to justify their Schumer  shutdown. They claim that ObamaCare subsidies are going to expire. In  reality, it is only the Biden COVID credit bonus that will expire.\n\nWhat happened during COVID for the ObamaCare subsidies--they took off  the…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696539/government-funding"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…your number two. It is going to come in at about $1.2  trillion.\n\nMedicare is going to come in at about $1.1 trillion this year, maybe  a little more.\n\nMedicaid and ACA, ObamaCare subsidies, are going to come in at $900  billion.\n\nThose are your top four.\n\nNumber five is the defense. The thing that is actually in the United  States Constitution is actually…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699988/math-is-such-an-anathema"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…little more money  than the poverty level but you can't get insurance through your  employer, we provide what is called the ObamaCare exchanges.\n\nSo when we talk about the ObamaCare subsidies, that is what we are  talking about. It is about 24 million people, and it was meant for  lower income people.\n\nUp until 2019, it was all for low-income people. Then,…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695979/government-funding"}]