[{"senator": "Brian Schatz", "party": "Democrat", "sentence": "This is what, I think, we should linger on because now that the fight  over ObamaCare is sort of in the rearview mirror, people just think  they get onto the ACA portal; they sign up for their healthcare; and  they pay what they pay, right?"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "In short, it means replacing ObamaCare with  nothingcare."}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "Speaker, with  attacking the Affordable Care Act, gave it the nickname ObamaCare, but  the great  Jim Clyburn flipped the script and said, yes, it is  ObamaCare because President Barack Obama cares about the American  people just like we do as House Democrats."}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "We all know it, those who support Obamacare and those       who oppose it."}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "Speaker, in their incessant drive to impose a  national ban on all forms of abortion, Republicans continue to block  relief for millions of Americans who are struggling with soaring  ObamaCare health insurance premiums."}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "In any case, they have never supported the Affordable Care Act,  ObamaCare."}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "But we have a situation here, as the senior Senator from New  Hampshire described, where if these healthcare premium supports expire,  every American who has come to depend on access to healthcare through  ObamaCare, which is now accepted as an important element in our  healthcare system, every person on that is in incredible jeopardy."}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "In February 2016, then-Presidential candidate Donald Trump said: ``We  are going to replace ObamaCare with something so much better.'' Nothing  followed."}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "No one  says ObamaCare is perfect."}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "So if you want my vote next week or in the next couple of weeks, we  are going to have to talk about the significant Medicaid cuts that you  made, the ending of a bunch of subsidies for the marketplace, or  Obamacare, and talk to me about putting money back into things like  cancer research that you slashed, because there are few things as  fundamental as providing healthcare to your family, and yet there are  few systems in America that are as broken as healthcare in America."}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "This is a rule that the administration set forward last year that adds  enormous amounts of regulatory burden for any American who chooses to  access the so-called ObamaCare Marketplace."}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "Then, of course, we have the promise that Trump would replace  ObamaCare with something better."}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "What is worse is that this very resolution goes further by using the  specter of socialism to undermine some of the most important government  programs in our country like Social Security, Medicare, Medicaid, and  ObamaCare."}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "The biggest fraud of all would be replacing  ObamaCare with Republican nothing care."}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "The vote was  whether or not we would keep the Affordable Care Act--or ObamaCare, as  it was known then--extending health insurance to millions of Americans,  some of whom had never had it."}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "Now let's go to the ObamaCare exchanges because the shutdown we just  had for over 40 days was related to the fact that subsidies are ending  on the ObamaCare exchanges."}, {"senator": "Nathaniel Moran", "party": "Republican", "sentence": "It is fiscally irresponsible and fails  to address the waste, fraud, and abuse of ObamaCare while ignoring the  real problems in our healthcare system and ignoring the fact that these  temporary COVID-era enhanced subsidies have done nothing but pad the  profits of big insurance companies and drive up the very premiums that  they purport to reduce."}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "President Obama famously said that ObamaCare would let Americans keep  their health insurance if they liked it and that it would also lower  their premiums."}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "Such is the case with ObamaCare."}, {"senator": "David Schweikert", "party": "Republican", "sentence": "Over the years, some of it was in ObamaCare and other things."}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "Speaker, I rise to include in the Record a copy of the  article, ``Ghostbusting ACA Fraud: Millions Who Don't Use Their Health  Insurance Expose Abuse in the Program'' and a document from the  Committee on Ways and Means entitled ``Watchdog Report Uncovers  Widespread Fraud in Obamacare.''               [From Paragon Health Institute, Oct."}, {"senator": "Chip Roy", "party": "Republican", "sentence": "We are talking about COVID-era pandemic cash that was thrown out  into our economy in this case for some plus-ups for some subsidies for  the broken ObamaCare system."}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "Speaker, she mentioned healthcare, and the healthcare system that  she is talking about that she says has failed is ObamaCare, what they  voted for and they created."}, {"senator": "Chip Roy", "party": "Republican", "sentence": "What we are really talking about--for  everybody at home watching C-SPAN, all 14 of you--we have a situation  where ObamaCare expanded the Medicaid population, and it expanded it  massively to a population that is much bigger and much more able- bodied, i.e., healthier."}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "At the heart of their demands is the  permanent extension of President Biden's COVID credits under ObamaCare."}, {"senator": "Roger Marshall", "party": "Republican", "sentence": "Yes, we have all sorts  of new toys and new treatments available and new drugs out there, but  if you want me to impact the true cost of healthcare--whether you are  getting your insurance through your workplace, whether you are on  ObamaCare, or if you are on Medicaid or Medicare--if you want me to  save the Federal Government's budget, we need to fix the cost of  healthcare."}, {"senator": "David Schweikert", "party": "Republican", "sentence": "What if we took that knowledge of, hey, these incentives do work, and  actually legalese that and made that part of how we deliver healthcare  services or how we allow insurers to provide incentives because the ACA  ObamaCare is a finance bill."}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "Since its  inception, ObamaCare premiums have skyrocketed by over 220 percent."}, {"senator": "John Cornyn", "party": "Republican", "sentence": "On  the healthcare front, we offered an alternative to the disaster known  as ObamaCare."}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "ObamaCare came into existence,  and it was supposed to decrease premiums by $2,400 a year."}]