[{"senator": "Mark Takano", "party": "Democrat", "sentence": "…establish contact with  descendants of those fallen servicemembers who were mistakenly buried  under the Latin cross and works in partnership with a nonprofit  organization to obtain the grave marker that accurately represents  their religious heritage and replace the inaccurate headstone.\n\nActs like this provide a structure to identify our veterans not…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695467/fallen-servicemembers-religious-heritage-restoration-act"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…OTA authority last year because one Senator allowed it to lapse.  OTA was a vital tool that enabled DHS to work with nontraditional  government contractors to more quickly obtain cutting-edge emerging  technologies that addressed evolving threats.\n\nSince September 2024, the lapse in OTA, 50 projects have been  disrupted, including 1 that led to identifying…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688702/producing-advanced-technologies-for-homeland-security-act"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…corruption and waste in our government.\n\nThere has been no outrage when President Trump decided that he would  take on General Milley for being the patriot that he is and seek to  obtain revenge on him.\n\nWhat Mr. Green was talking about was outrage about something that is  very important. There are 700,000 seniors in Texas who rely on Medicaid  and nursing…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688501/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…deserve       access to Small Business Administration resources. Small       Business Majority strongly supports uplifting immigrant       communities working in good faith to obtain U.S. citizenship.       These bills will lead to less vibrant communities and fewer       Main Street business opportunities for many in search of the       American Dream.…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692125/american-entrepreneurs-first-act-of-2025"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…neighbors and  friends.\n\nICE squads descending on homes, bursting through doors to conduct  arrests, isn't just violent and frightening, but it is  unconstitutional. Agents must obtain a judicial warrant signed by a  neutral judge, not an administrative warrant in-house, to enter private  property.\n\nYou have seen the videos--we have all seen them--where they…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699485/department-of-homeland-security"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…additional avenues for voters. Why would we expect the  EAC to disregard the President's clear desire to limit documentary  proof of citizenship to a small, exclusive, difficult-to-obtain list of  options?\n\nI would say in addition to my dear friend--and I mean that  sincerely--the gentleman from Wisconsin, I would like to remind him  that an estimated 165,000…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690001/safeguard-american-voter-eligibility-act"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…widespread confusion, the National Taxpayer Advocate  recommended that Congress enact legislation to fix this provision.  Therefore, this bill clarifies that an IRS employee must obtain  supervisory approval in writing before any written communication is  sent to a taxpayer about certain proposed penalties. It also clarifies  that an IRS employee's immediate…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697250/fair-and-accountable-irs-reviews-act"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…of  more than 600 nuclear weapons. North Korea is expanding its arsenal of  nuclear warheads and ballistic missiles. And it may be only a matter of  time before terrorists obtain the enriched uranium to build a crude  nuclear bomb.\n\nUnlike the atomic bombs that destroyed Hiroshima and Nagasaki in  1945, many of today's thousands of nuclear weapons are…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694014/new-start-treaty"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…Indians of Florida can access the Osceola Camp, a  historic Tribal village that was, unfortunately, excluded from the  original reserved area, without requiring the Tribe to obtain special  use permits.\n\nH.R. 504 would also direct the Department of the Interior to  implement needed flood control measures to protect homes and structures  within this village.…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693409/miccosukee-reserved-area-amendments-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…an increased authorization line that has no score but  then bring a bill to the floor that could have a mandatory score.\n\nIt is the majority's responsibility to request and obtain CBO scores  for bills they are planning to move. The Republicans are changing the  rules as they please. I am, of course, concerned about this from a  process perspective,…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692716/charlotte-woodward-organ-transplant-discrimination-prevention-act"}, {"senator": "Nikki Budzinski", "party": "Democrat", "sentence": "…Office. Especially following a turbulent government shutdown, these  three interns played an integral role in supporting constituents from  Central and Southern Illinois to obtain much needed assistance from the  federal government. Their commitment to constituent service by  assisting my casework team has been amazing to see, and I am so proud  of the…", "date": "2025-12-19", "source_url": "https://justfacts.votesmart.org/public-statement/1698463/recognizing-the-class-of-interns-for-their-service-to-illinois-13th-congressional-district"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…agree upon--work hard, play by the rules,  and then being able to be part of a country. Imagine a country where,  when you work hard and play by the rules, you can afford to obtain the  American Dream, to experience the good life: a good-paying job, good  housing, good healthcare, a good education for your children, and,  then, a good retirement.\n\nWe…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…and he deserves to be prominently displayed and honored in the  United States Capitol.\n\nMadam Speaker, I look forward to working with the Joint Committee on  the Library to obtain a new statue of Benjamin Franklin. I urge my  colleagues to support this measure, and I reserve the balance of my  time.\n\nMr. MORELLE. Madam Speaker, I yield 4 minutes to the…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688219/procurement-and-placement-of-statue-of-benjamin-franklin-in-the-united-states-capitol"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…conclude that the Policy Statement is a rule subject to CRA's       submission requirements.\n\nOur practice when rendering decisions is to contact the       relevant agencies to obtain factual information and their       legal views on the subject of the request. Accordingly, we       reached out to HHS on April 29, 2025, and received HHS's       response…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694840/government-accountability-office-legal-opinion"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…is a 2-year exception for the  newly designated Chumash Heritage National Marine Sanctuary, current  law requires operators and installers of deep-sea fiber-optic cables to  obtain a permit from NOAA and pay fair market fees for use of these  areas.\n\nI and many others here today believe we need secure and reliable  telecommunications infrastructure. I…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699957/undersea-cable-protection-act-of-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…general of the State may, as parens patriae, bring a civil       action on behalf of the residents of the State in an       appropriate district court of the United States to obtain       appropriate relief.\n\n(B) Rights of the commission.--\n\n(i) Notice to the commission.--\n\n(I) In general.--Except as provided in subclause (III), the       attorney general…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690200/hotel-fees-transparency-act-of-2025"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…for many families across this country, living paycheck to  paycheck, overdraft services are a critical safety net. Without this  service, necessities would become harder to obtain. Overdraft services  are not a luxury. They are a lifeline. For my friends on the other side  of the aisle to use incendiary language like ``shameful,'' I submit  what is shameful…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689846/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "French Hill", "party": "Republican", "sentence": "…necessary, and ensure that people providing       information are informed about how it will be used. Under the       bill, the office would no longer be required to seek or       obtain approval from the Office of Management and Budget to       collect information or announce such collections in the       Federal Register.\n\nThe exemption under the bill could…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693954/improving-access-to-small-business-information-act"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…``(2) In any case in which the Secretary reissues a benefit       payment (in whole or in part) under paragraph (1), the       Secretary shall make a good faith effort to obtain recoupment       from the fiduciary to whom the payment was originally made.\n\n``(3) In any case in which the Secretary obtains recoupment       from a fiduciary who has misused…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690673/veteran-fraud-reimbursement-act-of-2025"}, {"senator": "David McCormick", "party": "Republican", "sentence": "…illegal immigrants entered our country during the last administration  and a total of at least 22 million noncitizens reside in the United  States. In 19 States, noncitizens can obtain a driver's license, and in  some cases, that driver's license automatically registers them to vote.  This is an unacceptable vulnerability in our election integrity. For  that…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700069/9999"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…later than 1 year after the date of       the enactment of this Act, the Assistant Secretary shall       enter into an agreement with the head of any relevant agency       to obtain any information, data, or assistance that the       Assistant Secretary determines necessary to conduct the       activities described in subsection (b).\n\n(h) Rule of Construction.--Nothing…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690188/promoting-resilient-supply-chains-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Clause.--\n\n``(1) In general.--Nothing in this section shall be       construed to adversely affect the authority of Congress,       including a Committee or Member thereof, to obtain any record       or information.\n\n``(2) No negative implication.--The absence of a provision       similar to paragraph (1) in any other provision of law shall       not be…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691006/south-pacific-tuna-treaty-act-of-2025"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…Congressional Review Act (CRA). As       discussed below, we conclude that the Buffalo RMPA is a rule       for purposes of CRA.\n\nOur practice when issuing decisions is to obtain the legal       views of the relevant agency on the subject of the request.       Accordingly, we reached out to Interior to obtain the       agency's views. We received Interior's…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695880/government-accountability-office-opinion-letter"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…Meeting.--In the course of       completing the study described in subsection (a), NASEM or       such other appropriate entity shall hold not fewer than one       public meeting to obtain stakeholder input on the topics of       such study.\n\n(c) Report.--The agreement under subsection (a) shall       require NASEM, or such other appropriate entity, not later…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688976/mathematical-and-statistical-modeling-education-act"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…FRANKLIN IN THE UNITED STATES CAPITOL.\n\n(a) Obtaining of Statue.--Not later than December 31, 2025,       the Joint Committee on the Library shall enter into an       agreement to obtain a statue of Benjamin Franklin, under such       terms and conditions as the Joint Committee considers       appropriate consistent with applicable law.\n\n(b) Placement.--Not…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688218/procurement-and-placement-of-statue-of-benjamin-franklin-in-the-united-states-capitol"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…included fictitious applicants who provided invalid (i.e.,       never issued) Social Security numbers (SSN). Additionally, we       stated income at a level eligible to obtain APTC. As       appropriate, we used publicly available information to       construct our applications for coverage and subsidies. We       also used publicly available hardware,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698381/lower-health-care-premiums-for-all-americans-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…level of classification of defense articles,       components, and services included in this potential sale is       SECRET.\n\n6. If a technologically advanced adversary were to obtain       knowledge of the specific hardware and software elements, the       information could be used to develop countermeasures that       might reduce system effectiveness…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692048/arms-sales-notification"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "…though we were very young  at the time, these coins were issued for that occasion at that time.  These coins gave parents, families, and community members the  opportunity to obtain a physical keepsake to pass down for the next  generation. This is exactly what this legislation would do, as well.\n\nI know that my parents passed the circulating coin down…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699869/for-americas-250th-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…classification of defense articles,       components, and services included in this potential sale is       UNCLASSIFIED.\n\n5 . If a technologically advanced adversary were to obtain       knowledge of the specific hardware and software elements, the       information could be used to develop countermeasures that       might reduce system effectiveness…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688394/arms-sales-notification"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…Congress and the public with annual, data-driven  risk assessments of the 504 loan portfolio.\n\nThe 504 program is an incredibly important tool that helps small  businesses obtain long-term, fixed-rate financing like the acquisition  of fixed assets such as land, buildings, and heavy machinery.\n\nIn fiscal year 2025, the program supported $7.8 billion…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699188/504-program-risk-oversight-act"}]