[{"senator": "Bill Foster", "party": "Democrat", "sentence": "…this is negotiations,  and we have to get very serious about that.\n\nIt is not something that the Iranians even have to test. We did not  test the Hiroshima weapon. It was obviously going to work. The physics  hasn't changed in the 80 years since then, so we are at a very  uncertain position on that, and we shouldn't pretend otherwise.\n\nWe have also…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694113/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…emissions from burning fossil fuels cause a greenhouse  effect and that increased use of fossil fuels would cause global  warming and severe sea level rise. His audience, obviously, was fossil  fuel executives at that event commemorating the 100 years of the fossil  fuel industry.\n\nThis chart is of the famous Keeling Curve, which shows the dramatic…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698993/unanimous-consent-request-s-res-550"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…that at all.\n\nCastor), the ranking member of our Energy  Subcommittee.\n\nMr. PALLONE. Mr. Speaker, listening to my colleagues on the  Republican side of the aisle, this report obviously does absolutely  nothing to address the prices of power and electricity that continues  to go up.\n\nMr. Speaker, I include in the Record a document from the Joint  Economic…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697034/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…protecting the environment.\n\nPart of the secret I mentioned is that I happened to have       been Governor of California back when much of this was being       done. Now, obviously, neither the problems in California nor       those nationally have been solved, but I'm proud of having       been one of the first to recognize that States and the…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691582/hj-res-88"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…ego-driven rebrand, a performative  stunt rooted in President Trump's imperial edict absurdly titled:  ``Restoring Names That Honor American Greatness.''\n\nMr. Speaker, this is so obviously what authoritarians through history  have done. They do things like call for parades on their own birthday,  or rename things, or do other stunts to distract the American…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690937/gulf-of-america-act"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…Congress had passed some legislation at least  appropriating funds for it and somewhat authorizing it during the  Johnson administration. Congress knew about the war in Vietnam.\n\nObviously, there was a draft, and 56,000 Americans were killed in  that war. But President Nixon, without informing Congress, extended the  war and started bombing Cambodia--it was…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692637/war-powers-resolution"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…committee say the only reason we can't consider bipartisan approaches,  even if they are good ideas, is because of the urgency of this moment.\n\nAll I am saying is--this is, obviously, a fait accompli--I just don't  want my colleague to walk away thinking this is some kind of stunt.  This is my attempt to take away an argument for us to do the work on…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687971/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…we do not produce any of those goods here in  this country.\n\nIncluded in his order are coffee, tea, fruit juices, tropical fruits,  spices, bananas, oranges, and tomatoes. Obviously, if you talk to  anybody who has been in a grocery store lately, the prices for all of  those products have gone up by large margins, again, in the wake of the  April tariffs…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696749/congress-must-take-action-on-tariffs"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…to say how  powerful the presentations were talking about the tragedy in Minnesota  and how all of our hearts go out to the families and to the entire  State because it is obviously something that had a profound impact upon  the entire community, and it is something that has all of us grieving  for them. I was just touched, as I think everyone who heard…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692644/one-big-beautiful-bill"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "…prison  instead of serving her time as one of Epstein's main co-conspirators  and groomers of young girls to be abused by Epstein and his cohort of  rich and powerful men?\n\nObviously, once again, my colleagues across the aisle want to try to  distract us by returning to their tried-and-true playbook of demonizing  immigrants. That is not actually what…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695359/stop-illegal-entry-act-of-2025"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…the way, looked at general temperature effects, not at  the costs of specific extreme weather effects like hurricanes, sea  level rise, or wildfires. So the actual number is obviously worse.\n\nAs to those uncounted extreme weather effects, First Street reports  that natural disaster damages have risen more than tenfold since the  1980s and now cost the…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699613/9999"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…colleagues know what the difference is? We all have Republican  Governors. Our Republican Governors are working to lower the cost of  energy. The Democratic Governors are obviously keeping energy prices  high and blaming the President for that. I reserve the balance of my  time.\n\nMr. Speaker, it is interesting. Now the gentleman is blaming the  Governors…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699220/providing-for-consideration-of-hr-supporting-pregnant-and-parenting-women-and-families-act-providing-for-consideration-of-hr-pregnant-students-rights-act-and-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…for all their  prescription drugs. We worked hard, we legislated, and we got prices  down.\n\nDonald Trump does a photo op, says it is going to come down  immediately, but, obviously, this is a half-baked political stunt that  is unlikely to bring any meaningful change.\n\nToday's announcement is so typical of Donald Trump's Presidency: He  promises a golden…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690954/prescription-drugs"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…Washington Tribes and the Coast  Guard. And the bill invests in critical safety programs. We are very  proud of all of that.\n\nBut one of the most important things in the bill is, obviously,  dealing with the workforce--making sure that we have access to medical  care, housing, and behavioral health and to deal with what we know in  2023 was a decades long,…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688520/coast-guard-authorization-act-of-2025"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…isn't working for everybody.  According to Moody's Analytics, the top 10 percent of earners account  for nearly 50 percent of all of the United States' consumer spending,  so obviously something is out of whack. Despite this reality, House  Republicans are attempting to pass three bills this afternoon that  would cut workers' wages.\n\nThis bill, H.R. 2262,…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698955/flexibility-for-workers-education-act"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…the States gets ahold of it, Madam Speaker, you can wind up with  regulations of hundreds of pages that have to be negotiated when you  begin running the projects, which obviously means a lot more money for  the lawyers and much more difficulty for the politicians to understand  exactly what is going on.\n\nYou would think, Madam Speaker, that of all…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691328/the-big-beautiful-bill"}, {"senator": "Adrian Smith", "party": "Republican", "sentence": "…losing ground, and data would show that.\n\nDuring the Biden administration, the President and this body were way  too passive on our trade agenda. Right now, President Trump obviously  is taking a new aggressive approach in order to level the playing field  and address supply chains that have put Americans at risk.\n\nBeyond the gains made in addressing…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699963/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…in closing, again, I commend  Representative James for his great work on this particular bill. It is  very necessary.\n\nMr. Speaker, I encourage a ``yes'' vote on the bill, obviously, and I  yield back the balance of my time.", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690188/promoting-resilient-supply-chains-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "Mr. ROY. Mr. Speaker, it was great to have had the chance last night  to be at the White House with the President, his Cabinet, and my  colleagues.\n\nObviously, we celebrated the Christmas season and our collective  belief that this season is particularly important for the American  people in recognition of who we are as a people…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698106/bringing-america-back-to-its-roots"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…I don't do a lot of the floor speeches on individuals because I feel  like if I do them for one or two and I don't do them for everybody that  I represent that gets tough. Obviously, veterans, police officers,  there are things that rise to the occasion.\n\nDiana was a legendary mentor not just to me but to many of my  friends, many of the people that…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690594/fiscal-responsibility"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…in one fell swoop.\n\nLet's not forget it was a Democrat, President Clinton, who signed the  Congressional Review Act into law on a bipartisan basis, but our  colleagues have obviously fallen far from those past overtures of  consensus and common sense.\n\nRepublicans and President Trump are constantly emphasizing common  sense, which is not very common from…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689054/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers-providing-for-consideration-of-hr-defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…from Pakistan. Here is a group that didn't come from  Europe. They aren't Christian, but nevertheless, they have a mosque in  Oshkosh, Wisconsin, in my district, and they are obviously succeeding  very well. They have strong families. They have a good work ethic. If  America were Eurocentric, as they say, they would not be so successful.\n\nI have also seen…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689603/diversity-equity-and-inclusion"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…businesses, this is a once-in- a-generation moment, and I am grateful to be part of this effort on  both the Committee on Ways and Means and the Budget Committee.\n\nThere is obviously a lot going into this and, on the Committee on  Ways and Means, we are trying to find the sweet spot of many  considerations at play. We need to ensure the provisions in…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690787/big-beautiful-bill"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…spending $912 million extra on defense in the Energy and  Water bill over the current budget--a 2.7-percent increase even though  overall the bill is 2.8 percent less.\n\nWell, obviously, we had to cut something. We did. We are cutting  nondefense spending, the nondefense portion of the bill, by 3.8  percent. We took a meat ax to the Green New Deal provisions…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699012/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…President Trump free the last American  citizen who was being held hostage because of Iran, those problems and  challenges continue to happen today.\n\nI did a little research. Obviously, I have an affinity for Jewish  problems around the world because I am Jewish. I have always been part  of a small minority throughout my life. I am one here in Congress,…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691211/supporting-a-free-democratic-and-secular-iran"}, {"senator": "Paul Gosar", "party": "Republican", "sentence": "…because that is what our job is, tell me why we would actually  say the ``Potential Benefit of Superbrewed Food's Sustainable  Postbiotic Protein on Warfighter Health.'' That is obviously not what  the gentleman is talking about.\n\nThen, we are talking about the ``Sustainable, Low-Cost, Oil Process  for Heart-Healthy DOD Rations.''\n\nThe other side's mantra…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693694/department-of-defense-appropriations-act-2026"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…has been for at least the last 130 years.\n\nWe have nothing to apologize for. We are not being xenophobic. We are  not saying we are going to let nobody in this country, but obviously we  have to have some restrictions or we would wind up with tens of  millions more people in the country.\n\nHowever, despite our generosity in letting more people here, we…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700071/issues-of-the-day"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "Mrs. BICE. Mr. Speaker, I rise, obviously, in strong support of H.J.  Res. 24, legislation that I authored which uses the Congressional  Review Act to overturn regulations by the Biden administration.\n\nI was extremely…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689262/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…Water--be able to advance those.\n\nBut then we have to get moving on the fiscal year 2027 cycle. We are  already, technically, behind on that. So we have got efforts there.\n\nWe obviously need to do more when it comes to the situation around  the world.\n\nWe just had a vote on a motion to discharge a War Powers Resolution  as it relates to Venezuela. We need…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698821/9999"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…fun. I think it is ``Forbes  Breaking News'' that took about 12 or 13 hours of these floor speeches  and put them up on YouTube. I have actually had a couple of people who  obviously don't have lives who have been watching them, and we have  been playing this game of: Here is the prediction, Schweikert, you made  over the last year. Here is what you have…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697051/facing-fiscal-reality"}]