[{"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…core Article I spending authorities, the power to  make appropriations and the power to declare war. Continued inaction  will only allow more power grabs by this White House to occur.\n\nAt every turn, Republicans have fought Democratic efforts to place  oversight and enforcement riders in legislation that we are passing.  With this NDAA, our Republican colleagues…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695109/providing-for-consideration-of-hr-streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-and-providing-for-consideration-of-hr-stop-illegal-entry-act-of-2025"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…officers after that if they cannot do a background check. So an agency  could unknowingly sell a surplus firearm to someone who cannot lawfully  buy a gun, and all of this would occur under the statute without any  background check at all.\n\nThe bill also allows for the sale of any firearm except machine guns.  That includes not just handguns, but also assault…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691349/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…the wrong direction. And directives  telling U.S. personnel to avoid speaking publicly about how elections  are run overseas only make it harder to call out abuses when they  occur. The United States should not be stepping back; we should be  stepping up.\n\nFew leaders understood these stakes more clearly than Madeleine  Albright. At her confirmation hearing…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697939/international-human-rights-day"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…Congress.  I am going to fight for you as your Senator, if you are from  Connecticut--or anywhere else. There are lots of different points where  oversight and advocacy can occur on your behalf.\n\nBut the inspector general is inside the VA and has access to all of  the documents, all of the information that are necessary to protect the  integrity of…", "date": "2025-07-31", "source_url": "https://justfacts.votesmart.org/public-statement/1694542/9999"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…think it is a super wise investment to invest in our  Forest Service that will thin the forest, prevent catastrophic  wildfires, and then fight catastrophic wildfires when they occur.\n\nI would say, and my constituents would also say because we all choke  on smoke every summer, that this is not a time to cut the Forest  Service. In fact, it is a time to…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689811/cuts-to-forest-service-endanger-millions"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…months we have been  calling attention to the need to act now, and this shutdown was  avoidable. The path to stopping it was available. And shortening it,  assuming it will occur, is still a possibility, if we come together, if  Republicans are willing to negotiate, if they come back to town. House  Republicans are out of town. They are out of touch…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695920/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…border Czar  Tom Homan announced that there would be a drawdown of federal  immigration agents in Minnesota. When asked by a reporter that same day  whether a drawdown would occur, President Trump stated: ``No, no, not  at all.'' Considering that President Trump has rejected his own Border  Czar's intentions to reduce the presence of federal agents in…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699913/consolidated-appropriations-act-2026"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…first atomic bomb at the  Manhattan Project.\n\nIt is very important that we go from popular culture to real history  and talk about this in terms of the destruction that will occur if we  do not continue the New START treaty.\n\nI am a former political science professor. I have taught and written  about the history of nuclear weaponry. I am now a Member…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699032/expiration-of-new-start"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…provided by Medicaid.       My clients require repetition of these skills to function in       their daily lives. Without these programs provided by       Medicaid, regression will occur, and learned skills will not       be retained. Without Medicaid, this community will struggle,       isolate, and lose any quality of life they have enjoyed since       receiving…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…needs  to be with them. That is exactly what we are doing in Ukraine: helping  a sovereign nation defend its democracy from Russian aggression. A  similar situation could easily occur in the Pacific, where Taiwan is  threatened by the People's Republic of China.\n\nChina has a recent history of seizing territory. Look at the invasion  of Tibet in the 1950s.…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693686/department-of-defense-appropriations-act-2026"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…already because they were cut off from food and medicine for  tuberculosis, AIDS, and malaria.\n\nThe Center for Global Development says that 3.3 million preventable  deaths will occur because of the gutting of USAID, but they won't just  die there. Americans will die, too, because when malaria, tuberculosis,  and AIDS infect anyone in the world, those diseases…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692536/rescissions-act-of-2025"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…driving--and, again, I take this very  seriously because I lost a cousin to a drunk driver who is a U.S.  citizen, not a noncitizen. The vast majority of drunk driving incidents  occur because of citizens, not because of noncitizens, because the vast  majority of the people in the country are here legally as citizens.\n\nLet's do a serious thing. Let's say…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693082/jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-2025"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…committee to put together a decent bill, which I did vote for.\n\nHowever, I am seriously alarmed by some of the things that are in the  bill and even more that are likely to occur today. It is the erosion of  our defense policy's lack of fiscal discipline, strategic clarity, and  constitutional boundaries.\n\nSince we passed this out of committee, the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695144/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…45th and the 47th precincts work together cooperatively  with police from Westchester County and its cities to deter and prevent  crime and apprehend criminals when crimes do occur.\n\nBronx Borough President Vanessa Gibson and Westchester County  Executive Ken Jenkins work together to advocate for the Penn Access  project that benefits commuters from both…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697353/america-needs-unity"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…could be further from the truth.\n\nThere are a whole bunch of incentives in this program to drive down  excess methane pollution and remediate the effects of pollution that do  occur, but the program provides over $1.5 billion to assist the  industry with reducing current and legacy methane emissions, including  $700 million of incentives for small producers.…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688180/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Rob Wittman", "party": "Republican", "sentence": "…dedication to learning and pursuing the highest standards  of performance speaks to both her exceptional aptitude and her strong  character. Achievements of this caliber do not occur by chance; they  are the result of sustained hard work, personal sacrifice, and a  devoted commitment to excellence.\n\nMr. Speaker, I ask my colleagues to join me in congratulating…", "date": "2026-02-20", "source_url": "https://justfacts.votesmart.org/public-statement/1700087/recognizing-madeline-brobst-receiving-a-perfect-score-on-the-act"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…Now, what they forgot is in many of the defense  facilities in my district, and also across the globe, that they are  near saltwater.\n\nWe have all seen the horrible fires that occur when saltwater and  batteries mix. They are horrific, runaway fires. In the Joe Biden  Department of Defense, I can only imagine a scenario where a natural  disaster causes…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695161/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "John Rose", "party": "Republican", "sentence": "…by abusive mortgage credit trigger leads. Being contacted dozens to  hundreds of times a day after applying for a mortgage is simply  unacceptable. Many abusive trigger leads occur at nearly all hours of  the day and night. This is especially true if the trigger lead user  resides in a different time zone than the individual that they are  contacting.…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692803/homebuyers-privacy-protection-act"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…Our government doesn't trade with their government. Our individuals  buy products from their individuals. If it is a voluntary trade,  everyone benefits or the trade doesn't occur.\n\nIt is perhaps no surprise, then, that the United States and Canada  share the world's longest international land border and are  continuously at peace.\n\nCanada is a great…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689478/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…than any other State, and more than 50 of those have been  active in the last 300 years.\n\nVolcanic hazards are difficult to estimate on a year-to-year basis,  but when they occur, the results can be catastrophic. For example, the  Mount St. Helens eruption in 1980 caused more than $1 billion in  damage. Adjusting for inflation, that figure would now…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698113/southcentral-foundation-land-transfer-act-of-2025"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…Security Cutter       acquisition process until Polar Security Cutter 2 achieves       full operational capability.\n\n(2) Timeline.--The briefings under paragraph (1) shall       occur after any key milestone in the Polar Security Cutter       acquisition process, but not less frequently than every 90       days.\n\n(3) Elements.--Each briefing under paragraph…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…competitive advantage to control the next-generation economy.\n\nThis legislation takes an important step to prepare our Federal  agencies against supply chain constraints that could occur as our  Nation seeks to address timely development of electric generation and  transmission infrastructure.\n\nMr. Chair, I urge my colleagues to support H.R. 3638.", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697897/electric-supply-chain-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…estimates that any additional collections and associated       spending would be insignificant because of the relatively       small number of additional cases likely to occur over the       2025-2035 period.\n\nH.R. 1716 would impose a private-sector mandate as defined       in the Unfunded Mandates Reform Act (UMRA) on U.S. financial       institutions…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693876/taiwan-conflict-deterrence-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…of 2025.\n\nSinkholes are a natural hazard that cost the United States Government  approximately $300 million per year and pose a serious threat to public  safety.\n\nSinkholes occur when there is a lack of proper external surface  drainage so when a heavy rainstorm comes through and the ground cannot  drain the water properly a void may form underground.…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693479/sinkhole-mapping-act-of-2025"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…round of funding, and I would argue that this actually saves tax  dollars for the rest of the country because the BRIC Program helps  prevent against flooding, flooding that may occur after a big rain  event or after a hurricane. And in Louisiana and in many parts of our  country, this is an inevitable part of life.\n\nBut the best way to recover from a flood…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690105/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…PRC, including with respect to       prisoners of conscience (including Falun Gong) and other       prisoners;\n\n(2)(A) the number of organ transplants that are known to       occur or are estimated to occur on an annual basis in the       PRC;\n\n(B) the number of known or estimated voluntary organ donors       in the PRC;\n\n(C) an assessment of the sources…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690648/falun-gong-protection-act"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "…July 3, 1997, we reached this       conclusion by noting that the Forest Service's RMP provided a       ``management prescription'' giving general direction on what       may occur within an area allocated to a particular land use       designation. Similarly, in B-329065, Nov. 15, 2017, we       concluded that four BLM RMPs had a substantial effect on…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693059/us-government-accountability-office-legal-opinion"}, {"senator": "Maria Salazar", "party": "Republican", "sentence": "…malignant and non- malignant brain tumors in the United States. These range from primary  brain tumors called Gliomas, including Glioblastomas, to secondary  brain tumors that occur from metastases from other parts of the body.\n\nToday, I want to recognize the work and efforts of a wonderful  patient advocacy organization--Voices Against Brain Cancer (VABC).…", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691692/recognizing-brain-cancer-awareness-month"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…counsel, are accountable to IRS legal  counsel, and answer to IRS legal counsel, not the National Taxpayer  Advocate.\n\nIt is a situation that begs for conflicts of interest to occur. It  risks undermining the ability of the National Taxpayer Advocate to  trust that the legal advice that she receives is without any undue  influence from the IRS. It certainly…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689378/national-taxpayer-advocate-enhancement-act-of-2025"}, {"senator": "James Risch", "party": "Republican", "sentence": "…involving up to twenty U.S. Government and up       to fifteen contractor representatives for program management       reviews to support the program. Travel is expected to occur       approximately twice per year as needed to support equipment       fielding and training.\n\nThere will be no adverse impact on U.S. defense readiness       as a result…", "date": "2025-10-02", "source_url": "https://justfacts.votesmart.org/public-statement/1695978/arms-sales-notification"}]