[{"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…intelligence analysts to immigration       judges, grant managers, civil rights attorneys and more, we       all carried out our duties faithfully, regardless of who       occupied the White House. Until we no longer could.\n\nEach of us left the Department, either voluntarily or       involuntarily, because of actions taken by this       administration.…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…olive groves, and the 400  Palestinian villages that they all grew up in. We, of course, see that  the Israeli Government continues to illegally steal Palestinian land in  the occupied West Bank where my family lives. They illegally evict  Palestinian families, Mr. Speaker, demolish homes, and deny  Palestinians basic human rights.\n\nWe honor those all around…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691384/the-nakba-never-ended"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…the Justice Department.  It is a letter that has as its reference Unconstitutional Race-Based  Congressional Districts, and then it cites the districts: Texas  District 9, occupied by a person of color; Texas 18 was occupied by a  person of color, who is deceased, to be filled soon; District 29,  occupied by a person of color; District 33, occupied by…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694163/racism-infused-in-texas-politics"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…the rest of the world  was gathering--to discuss the climate crisis. In the facility where we  were, the kind of main intersection where the two big aisleways crossed  was occupied by China, at one of the key corners, with a huge  delegation, a very big pavilion, lots of activity and crowding, and all  of the different countries that were there seeing…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697077/climate-change"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…battlefields for. I can't explain it.\n\nThey know that in Ukraine because that is what they are fighting for.  They know that if they give up, the Russians will occupy. In those  occupied areas, they have already deported tens of thousands of  children to be reeducated and taken away from their family. They put  the Ukrainian people in camps.\n\nRussia is basically…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687990/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…ecologically sensitive and, yes, incredibly difficult  regions to drill but it would reverse significant strides that  Democrats have made to protect lands that Tribal Nations have occupied  since time immemorial.\n\nThis misguided bill would lock in oil and gas development in the  Arctic National Wildlife Refuge, an area known to the Gwich'in people  as the sacred…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696832/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision"}, {"senator": "Brad Schneider", "party": "Democrat", "sentence": "…sympathetic policeman. Immediately she went into hiding. She       then obtained forged identity papers and, with the help of a       smuggler, set out to cross the border from Nazi-occupied       northern France into French-controlled southern France--so-      called Vichy France--but still equally dangerous for Jews.       Instead of helping her cross the border,…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690804/rose-helene-spreiregen"}, {"senator": "André Carson", "party": "Democrat", "sentence": "…Journalist, was killed on  May 11, 2022. She was killed while wearing a clearly marked press vest  on assignment, reporting on a military raid that took place in the  Israeli occupied city of Jenin. Shortly after her death, I led a  letter, signed by 58 Members of Congress, to the FBI and State  Department calling for an independent and open investigation…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699427/reintroduction-of-the-justice-for-shireen-act"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…processes to strengthen oversight,  performance, and accountability of contract security personnel engaged  in the protection of Federal buildings and grounds that are owned,  occupied, or secured by GSA.\n\nFPS law enforcement officers and the contract guards who support them  risk their lives every day to protect Federal workers and the public by  controlling…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695059/personnel-oversight-and-shift-tracking-act-of-2025"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…is a well-worn authoritarian playbook. It is one that quite  literally the United States of America was founded on rejecting--the  idea that the British soldiers, when they occupied American cities,  abused American citizens to the point where Americans turned against  them.\n\nI am a former CIA officer, a former Pentagon official. I have worked  alongside…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696126/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…years, if not decades, to see substantial returns.\n\nA large number of Ukraine's rare earth deposits are actually located  in Ukrainian territory that is currently contested or occupied by  Russia. I am not sure how one is to square this agreement with  Secretary Hegseth's comments about the forfeiture of Ukraine's  sovereign territory.\n\nFurthermore, the…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688332/ukraine"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…the murdered, not the  murderer.\n\nTrump is joining a rogues' gallery of lesser dictators to deny  Putin's murderous invasion, his war crimes, and a demand that he return  occupied Ukrainian territory. Trump, ``the great appeaser,'' is joined  in this appalling wrong by House Republican accomplices.\n\nWhile Ukrainians dodge bullets and missiles and are…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688131/ukraine"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…In 1881, the  Georgia General Assembly granted land at Eleventh Street and Sixth  Avenue, leading to the church's renaming as Six Avenue Baptist Church.  This site is now occupied by Golden Foundry and Machine Company.\n\nThe current church home, located at the corner of Fifth Avenue and  Ninth Street, was established in 1915, at which time the church…", "date": "2025-08-08", "source_url": "https://justfacts.votesmart.org/public-statement/1694727/recognizing-first-african-baptist-churchs-185th-anniversary"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…that they have revealed today, is going to be running  the country of Venezuela. And it is just true that when we were  involved in the quagmires in Iraq and Afghanistan, it occupied an  enormous amount of time at that White House. The amount of time that  the President and his team spent worrying about Baghdad and worrying  about Kabul--it was a distraction…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698610/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…that--again, going back into my youth, the fifties and  the sixties--that children with disabilities will be sitting in the  back of the room by themselves trying to keep themselves occupied  because what we have created through IDEA--a system of education  tailored to the individual child's disability--will be unsupportable.\n\nAnd that is the kind of damage he…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689546/h-con-res-14"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…Latvia,  and Lithuania by lighting candles in the memory of these deportees.\n\nThe reason the Soviets did this is pretty simple: They wanted to  crush civil society in newly occupied areas because they took over the  Baltic countries in 1940.\n\nThe ultimate goal was to eliminate Estonian, Latvian, and Lithuanian  national identity entirely, replacing it…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689062/russia"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Qualification exception.--Notwithstanding paragraph       (1)(A), a rental unit shall be considered to qualify as       affordable housing under this title if--\n\n``(A) the unit is occupied by a tenant receiving tenant-      based rental assistance under section 8 of the United States       Housing Act of 1937 (42 U.S.C. 1437f);\n\n``(B) the tenant's contribution…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…conviction shall not be       regarded as a conviction under Federal law and the movant for       whom the conviction was vacated shall be considered to have       the status occupied by the movant before the arrest or the       institution of the criminal proceedings related to such       conviction.\n\n``(d) Expungement of Arrests.--\n\n``(1) In general.--If…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697182/trafficking-survivors-relief-act"}, {"senator": "John Carter", "party": "Republican", "sentence": "…McCook served as the pilot of a B-25C Mitchell  aircraft during the Second World War. Answering his Nation's call, he  bravely flew into the dangerous jungles of Japanese-occupied Burma, now  known as Myanmar. His missions were perilous, often requiring low- altitude attacks and precise coordination in an environment where  survival was never guaranteed.…", "date": "2026-01-16", "source_url": "https://justfacts.votesmart.org/public-statement/1699163/saluting-tmche-service-and-sacrifice-of-first-lieutenant-charles-w-woody-cook"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…conveyed to SCF       under section 3(a), except that the Secretary shall not be       liable for any contamination that occurred after the date       that SCF controlled, occupied, and used the property.\n\n(b) Environmental Contamination.--Environmental       contamination referred to in subsection (a) includes any oil       or petroleum products, hazardous…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698113/southcentral-foundation-land-transfer-act-of-2025"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…their rights.\n\nI thank Chairman Mast for bringing this issue to the committee's  attention and championing this legislation. We must ensure that  servicemembers' homes are not occupied by squatters while a  servicemember is away serving our great country.\n\nI look forward to continuing to work with the ranking member this  fall on a bipartisan piece of legislation…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695471/servicemember-residence-protection-act"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…to strengthen oversight,       performance, and accountability of contract security       personnel engaged in the protection of buildings and grounds       that are owned, occupied, or secured by the General Services       Administration Public Buildings Service.\n\n(b) Oversight of Contract Security Personnel.--In carrying       out the activities described…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695058/personnel-oversight-and-shift-tracking-act-of-2025"}]