[{"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…report  from The Century Foundation found that utility prices are up 32 percent  since 2022. That is nearly three times the rate of inflation. Nearly a  quarter of that jump occurred just this year alone. These rising costs  are debilitating to the middle class. Nearly 1 in 20 households are in  severe utility debt.\n\nRoughly 4 million Americans are at…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697034/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…important aspect of this Voting Rights Act is section 2.  Section 2 had its genesis, as is the case with the Voting Rights Act of  1965, with Bloody Sunday. Bloody Sunday occurred in March 1965 at the  Edmund Pettus Bridge.\n\nOne of our Members, John Lewis, was there. In fact, he was a leader  of this march on Bloody Sunday. As such, he informed us--I…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694943/bloody-sunday-and-voting-rights-act"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…that  I could make it here to actually speak on the bill. I very much  appreciate it.\n\nMy bill, as you have heard, is straightforward and bipartisan. It  rights a wrong that occurred in some cases by accident where a Jewish  servicemember was laid to rest under a headstone misidentifying their  religion.\n\nIt ensures the United States properly honors the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695467/fallen-servicemembers-religious-heritage-restoration-act"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…egregious than the action that precipitates the coverup. It is true.  The coverup is more egregious than the action that precipitates the  coverup. There is something that occurred here that is more egregious  than the action that precipitated the coverup, than the coverup itself,  and that thing is the ability of all of these actors to do this and…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689201/and-still-i-rise-censured-but-not-silenced"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "Mr. WELCH. Mr. President, exactly 2 years ago today, Vermont was  struck with devastating floods. Those floods occurred not only a year  ago today, but 2 years ago today. We had back-to-back floods in 2023  and 2024, doing about a billion dollars' worth of damage.\n\nAnd by the end of last year,…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693402/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…bruised, was not  broken. That is what we are remembering here this evening.\n\nBut today, we confront something that perhaps is even more sinister  than the heinous violence that occurred that day. Today, we face the  systemic attempt by supposed leaders, by Trump and rightwing MAGA  Republicans, to erase and rewrite the truth of January 6, whitewashing  the…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698517/anniversary-of-january-6"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…families to give trillions in tax giveaways to the wealthy.\n\nThis is not beautiful. It is ugly. It is revolting.\n\nAs the bill proceeds, perhaps the most dramatic change that occurred  overnight is the surrender of America's clean energy future to China.  Republicans are condemning Americans to higher energy costs and killing  hundreds of thousands--even…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691671/budget-reconciliation"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…many of these women didn't cover  the first year, so they didn't have health insurance when their first  cardiac event or pregnancy-related event that led to their death  occurred.\n\nWe looked at expanding Medicaid to cover the first 12 months after  birth, which we did here at the Federal level, as well. We looked at  expanding Medicaid under the Affordable…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690243/health-disparities-in-minority-communities"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…respect for those who defended democracy, liberty, and Article I  of the Constitution of the United States right here in the House of  Representatives, defending the vote that occurred in 50 States across  this union. We owe them that memorial.", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698548/january-6-attack"}, {"senator": "Cleo Fields", "party": "Democrat", "sentence": "…Attorney General to file lawsuits on behalf of Americans who were  denied the right to vote and gave them the ability to investigate  threats on civil rights.\n\nA watershed moment occurred when we passed the 1964 Voting Rights Act  and the 1965 Voting Rights Act, which made Jim Crow practices and  discrimination illegal. Thank God for subsection 5. I will take…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689340/fighting-voter-suppression"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…enhancement of the American system of justice.\n\nOf course, this whole litany of the way Trump attacked the referees  was a prelude to the absolute assault on the referees that occurred  during this year in such a systematic fashion, in such an expanded  fashion.\n\nThe Trump administration also mounted efforts to sideline       key players in the political…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize the tragic  shooting at Evergreen High School in Evergreen, Colorado, that occurred  on September 10, 2025.\n\nThis senseless act of violence has left students, educators, and the  greater Evergreen community in shock and grief. Two victims were  hospitalized,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695839/recognizing-the-evergreen-high-school-shooting"}, {"senator": "Rick Larsen", "party": "Democrat", "sentence": "…has  proven to be a trusted partner and effective negotiator.\n\nJust to show you how much work he does do, one of the issues we had  to settle on the FAA Reauthorization Act occurred when I was in my  district on Whidbey Island, while Sam was on Midway Island in the  middle of the Pacific--I don't even know which day it was on Midway at  the time--but…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692223/designating-the-house-press-gallery-in-the-united-states-capitol-as-the-frederick-douglass-press-gallery"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…not  just some other person. It is the President.\n\nThey are hanging there. I am waiting to get the order from a judge  who is looking at it. I have been waiting since this occurred. There is  a judge looking at a case that was before him. If this judge rules, as  I think he will, the sword of Damocles will fall on him. I am referring  to the articles…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697060/no-mandate-to-cut-medicaid"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…be angry, to be a voice for my people. I have  never come this close to having tears in my eyes as I speak to both  sides of this aisle about this horrendous incident that occurred.\n\nWe are a democracy, but we can lose that democracy. It can be gone  unless all of us speak out and forcibly reject what happened to a U.S.  Senator and to send the message…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692471/alex-padilla"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…department in June 2013.\n\nSergeant Leap was nominated for this award by his fellow officers for  his heroic actions above and beyond the call of duty in an incident  that occurred on August 1, 2024, on the Lower East Side of Manhattan.  On that night, Sergeant Leap, along with Sergeant Carl Johnson,  responded to reports of an armed robbery and apprehended…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691041/recognizing-nypd-sergeant-christopher-e-leap"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…pulled that trigger, the people who are  just as guilty because they created that environment. They fomented the  radicalization and the creation of an environment where that occurred  knowingly, knowingly destabilizing our society in the process.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695719/highlighting-flawed-policies"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…again: I am not here to denigrate the Somali people or people of Somali  ancestry just because of the actions of a few, but it is a fact that  this $1 billion in welfare fraud occurred almost exclusively in the  Somali community in Minnesota and was orchestrated by people of Somali  ancestry. That is a fact. Facts aren't racist; facts are facts. So far,…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697400/welfare-fraud"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…the drug overdose epidemic plaguing our  country. According to the Centers for Disease Control and Prevention,  in 2023, there were more than 107,000 overdose deaths that occurred in  the United States. These staggering numbers are due in large part to  the increasing presence of fentanyl and fentanyl analogues which are  approximately 100 times more…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692345/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…year low. Gas prices are down to their lowest levels in 4 years. Stocks  were at near highs by the end of the year, with the S&P climbing by 17  percent in 2025.\n\nAll of this occurred before the gains of the Working Families Tax Cut  Act are realized, and we are just getting started.\n\nIt will take us a while to recover from the years of inflationary  policies…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698637/providing-for-consideration-of-hr-saving-homeowners-from-overregulation-with-exceptional-rinsing-act-providing-for-consideration-of-hr-affordable-housing-over-mandating-efficiency-standards-act-and-providing-for-consideration-of-hr-commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…drugs were       interdicted, the amount and type of drugs interdicted, and       the Coast Guard sectors and geographic areas of       responsibility in which such incidents occurred.\n\n``(2) The number of incidents in which persons were       interdicted, the number of persons interdicted, the number of       those persons who were unaccompanied minors,…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…The legislation we are introducing today has been the culmination of  years of work, and I believe it is stronger as a result of the input  and the collaboration that have occurred.\n\nThe FIGHT China Act will establish a program at the Department of  Treasury to prohibit U.S. investments in certain sensitive technologies  in the PRC.\n\nNow, some people…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688824/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…important moment. His dedication was not just to  his job, but to his family.\n\nI would also add that David's father was in law enforcement for a  number of years, and when 9/11 occurred, guess who was first to  volunteer his time to risk his health to go help clean up the damages  of 9/11?\n\nOn behalf of the American people, I extend my deepest appreciation…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689427/recognizing-david-camhi"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…continue down the road we  have traveled these past 30 years.\n\nThat is not a question that people in this city are asking. For many,  it is not a question that appears to have occurred to them at all. The  debates right now are about the future and how President Trump's  policies will shape it. That is good. These are important debates that  we should have.…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690533/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…ones of the victims of  the crash of American Flight 5342 and PAT 25.\n\nThis is a bipartisan resolution to honor the 67 lives that were lost  during the tragic collision that occurred over the Potomac River on  January 29, 2025.\n\nJanuary 29 is typically a day of celebration in Kansas. From  Manhattan to Goodland, Topeka to Liberal, Kansas City to Dodge…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688371/expressing-condolences-to-the-families-friends-and-loved-ones-of-the-victims-of-the-crash-of-american-eagle-flight-5342-and-pat-25"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…colleagues, as a person who loves history  and has a history degree, I need to get all the documents on the table,  the good, the bad, and the ugly, and let history determine what  occurred on that day.\n\nThere is no point in trying to hide it. I don't understand why my  colleagues on the other side want to hide a terabyte. A fourth of what  the prior committee…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694880/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…have seen chaos emerge from our misguided wars before. We  overthrew Saddam Hussein thinking Iraq will be transformed into this  great Jeffersonian democracy. Instead, what occurred was an insurgency  that led to some of the most brutal sectarian violence in living  memory. Washington's foolish invasion empowered radical jihadists and  ultimately led…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696562/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…access it. When the law  passed in 1996, the internet was in its early days long before the  average American spent nearly half the month online and nearly one in  six sales occurred online. Congress can no longer ignore the fact that  the average American spends nearly 60,000 percent more time online than  during the year of the law's passage.\n\nTo be…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699543/true-cost-of-big-tech"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Department of the District of Columbia, and other Federal,       State, and local law enforcement agencies and protective       entities who responded to the violence that occurred at the       United States Capitol on January 6, 2021. All points of order       against consideration of the concurrent resolution are       waived. The concurrent resolution…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691169/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…his team when they played the Soviets, ``you were born to be       hockey players, everyone one of you . . . and you were meant       to be here''.\n\n(7) The tournament occurred at a time when the United       States was struggling with rampant stagflation, high gas       prices, hostages held in Iran, and increased tensions with       the Soviet…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695439/miracle-on-ice-congressional-gold-medal-act"}]