[{"senator": "Danny Davis", "party": "Democrat", "sentence": "…export market for oil, vehicles  parts, and agricultural products, has already signaled retaliation,  threatening our supply chains and manufacturing sectors. A similar  pattern occurs with China, where Illinois sends substantial volumes of  agricultural products and electronics. Mexico is another major trading  partner in auto parts, machinery, and food…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690134/opposing-the-chaotic-and-harmful-trade-policies-of-president-trump"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…decisions about when a chase is permitted or  should be permitted or not, we need to keep in mind that there can be  deadly consequences from when this happens, and it frequently occurs.  It is not like this is unusual. The Washington Post just did a piece  about the Park Police. There have been 10 of these instances in recent  weeks.\n\nI have a couple last…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695639/district-of-columbia-policing-protection-act"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…resolution. I would stand with them. I stand with them now, 50 of them  who stood for this resolution.\n\nMr. Speaker, 50 Members were antithetical to the resolution. When  this occurs, the Vice President of the United States has a vote.\n\nThe Vice President of the United States voted with those who were  antithetical to this resolution, S.J. Res. 90. You…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699134/where-do-you-stand"}, {"senator": "Jim Costa", "party": "Democrat", "sentence": "…worry about hazardous material being stored in facilities  next door to schools and residential areas. Communities deserve  transparency and safeguards, whether the incident occurs in California,  Nevada, or anywhere else in the country.\n\nIt is important that we protect our constituents from a larger  crisis. The legislation would strengthen oversight,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699754/stopping-unregulated-biological-laboratories"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…our legal and Court system       into chaos and directly undermine successful tools that focus       on serious accountability and effective rehabilitation when a       crime occurs. As always, when revisions or amendments to DC       laws are necessary, those changes should only take place       within our local legislature which has the best capacity…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695641/district-of-columbia-policing-protection-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…our legal and Court system       into chaos and directly undermine successful tools that focus       on serious accountability and effective rehabilitation when a       crime occurs. As always, when revisions or amendments to DC       laws are necessary, those changes should only take place       within our local legislature which has the best capacity…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695596/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…our legal and Court system       into chaos and directly undermine successful tools that focus       on serious accountability and effective rehabilitation when a       crime occurs. As always, when revisions or amendments to DC       laws are necessary, those changes should only take place       within our local legislature which has the best capacity…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696933/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…not silenced. I stand for the people I  have been faithful to in my congressional district. I am going to be  faithful to them until the very end, wherever and whenever that occurs.  I stand for what is best to help them through these turbulent times and  the crisis that the GOP healthcare initiatives have introduced to  people who are in need of healthcare.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695807/censured-but-not-silenced"}, {"senator": "Mark Pocan", "party": "Democrat", "sentence": "…imminent  threat. It is happening now, and babies are dying. The killing of  people in hospitals and those trying to get food aid, normally  considered off-limits even in war, occurs regularly, with an official  shrug when the Israeli Government is called out.\n\nThe definition of genocide by the New Oxford American Dictionary is  ``the deliberate killing…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695067/condemning-benjamin-netanyahu"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "…deemed law-enforcement sensitive. That is because this bill requires  Customs and Border Protection to publicly report who is getting extra  screening and where that screening occurs in real time, which tips off  terrorists and other bad actors.\n\nUnder administrations of both parties, DHS has never regularly  published who it has considered a special interest…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693073/special-interest-alien-reporting-act-of-2025"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…their self-respect,  and their honor. They will forfeit these things to protect themselves  and to protect the President, themselves and the President.\n\nWhat we have when this occurs with all of these people doing this, we  have now a group of people who have sacrificed their honor. When you  sacrifice your honor in this fashion, the people who serve under…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689201/and-still-i-rise-censured-but-not-silenced"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…our legal and Court system       into chaos and directly undermine successful tools that focus       on serious accountability and effective rehabilitation when a       crime occurs. As always, when revisions or amendments to DC       laws are necessary, those changes should only take place       within our local legislature which has the best capacity…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695559/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…a hero  from Ohio's 13th Congressional District, Mariah Stacy Frederick.\n\nMariah is the voice and advocate for her daughter, who lives with  spina bifida, a condition that occurs when the spine and spinal cord  don't form properly.\n\nFor Mariah and her daughter, Medicaid is a crucial resource without  which they would not be able to afford the proper…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691524/gop-tax-scam-hurts-women-and-families"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…that.\n\nThis bill is built on a myth that is rooted in the Big Lie of  election denial that has poisoned our democracy for years, which is  that supposed noncitizen voter fraud occurs with any meaningful  frequency. It is the same Big Lie that is still being perpetrated by  Kurt Olsen, who is the President's ``Stop the Steal'' lawyer now  working in the…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700066/9999"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…holding a capital or profits       interest in the domestic partnership, or\n\n``(ii) the management and control of the expanded       affiliated group which includes the entity occurs, directly       or indirectly, primarily within the United States, and such       expanded affiliated group has significant domestic business       activities.\n\n``(3) Exception…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699933/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Abraham Hamadeh", "party": "Republican", "sentence": "…should a trained physician sit  idle? The current state is intolerable. The status quo has failed, and  it is time for genuine reform.\n\nMr. Speaker, I have seen firsthand what occurs when the systems fail  for those on the front lines overseas. We cannot allow failure at home.  When I served as an Army intelligence officer overseas, we lived by a  simple…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695432/health-professionals-scholarship-program-improvement-act-of-2025"}, {"senator": "Elise Stefanik", "party": "Republican", "sentence": "…eliminates the burden on a veteran's surviving family by  ensuring that the veteran is entitled to receive their pre-approved  pension benefits within the month that death occurs.\n\nI represent New York's 21st Congressional District, representing the  largest number of veterans in any district in New York State. That is  why I am proud to take action…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699466/ernest-peltz-accrued-veterans-benefits-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…country and is in everyone's interest. However,  that requires real leadership, and right now that leadership is sorely  lacking.\n\nI believe that gerrymandering wherever it occurs is a plague on our  democracy whichever party does it. Both parties have been amply guilty.  That is why I proposed H. Res. 4889. H. Res. 4889 will bring this  redistricting…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…question of the environment and the  ESA.\n\nIt exempts our personnel from ESA prohibitions during defense-related  operations. That is what is happening, even if incidental harm occurs,  because in the heat of preparation for real-world threats, we cannot  afford to pause for paperwork.\n\nThe ESA was not meant to become a tool for endless lawsuits,  environmental…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695254/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Josh Hawley", "party": "Republican", "sentence": "…companies will  deploy algorithms to the end of the Earth in order to target our kids,  in order to advertise to our kids. They know every detail. Every  scintilla of action that occurs on their platforms, they know about it  because they are making money off of it.\n\nAnd yet when we bring them before this body and put them under oath,  the executives of these…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697735/9999"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…all Americans worse off? Shouldn't we learn from  our success?\n\nWe should ask ourselves a fundamental question: Is trade good? Well,  trade is simply capitalism. Trade never occurs unless you want a  product more than you want your money. Has anyone ever made a trade, a  voluntary trade, where you thought you were being ripped off? No. You  buy stuff…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690543/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…is what we should all be doing in every aspect of  our life: planning ahead, planning proactively. The waste is that, if  we don't do this program and the inevitable flood occurs, then we have  to go in and rescue communities. That is waste because we could have  prevented that from happening in the first place by implementing  programs such as the…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690105/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…veteran in certain                circumstances.''.\n\n(c) Effective Date.--The amendments made by this section       shall apply with respect to the death of a veteran that       occurs on or after the date of the enactment of this Act.       SEC. 3. EXTENSION OF CERTAIN LIMITS ON PAYMENTS OF PENSION.\n\nSection 5503(d)(7) of title 38, United States Code, is…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699467/ernest-peltz-accrued-veterans-benefits-act"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "…with my friend and colleague the  distinguished Senator from Florida to consider her bill in the Energy  and Natural Resources Committee in a transparent matter.\n\nUntil that occurs, I must object and object now.\n\nMr. LEE. Mr. President, I respect and deeply appreciate my friend and  colleague the distinguished Senator from Florida. And I respect and…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698296/9999"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…Meeting of working group.--\n\n`` `(A) In general.--The Commandant shall convene the       working group annually or at the creation of new examination       questions, whichever occurs sooner.\n\n`` `(B) Remote participation.--The Commandant shall allow       any member of the working group to participate remotely if       the member of the working group does…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…AMENDMENTS.\n\n(a) In General.--Except as provided in subsection (b), the       amendments made by this Act shall take effect on the first       day of the calendar quarter that first occurs on or after the       date of enactment of this Act.\n\n(b) Exceptions.--\n\n(1) Compensation of officers.--Section 3 and the amendments       made by section 3 shall apply to…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698845/bankruptcy-administration-improvement-act-of-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…redistricting war is going to end as a wash or with a  modest advantage for one party or the other.\n\nNow, it really shouldn't matter. I am against gerrymandering wherever  it occurs no matter which party stands to benefit, but this present  uncertainty has created a window of opportunity for a bipartisan  agreement to bring this madness to an end.\n\nMr.…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696907/bring-the-senseless-redistricting-war-to-an-end"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…of a great reset. One of the core components of it  is resetting the money system.\n\nThe money system they have in mind is the central bank digital  currency. When a crisis occurs, they might say that, well, there are  all kinds of things we could do, but here is what we can do now. It  would take forever to develop every other alternative. What we could…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693006/central-bank-digital-currency"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…it is estimated.\n\nThese aren't just numbers. They are our parents, our grandparents,  our neighbors, and our veterans. Elder abuse isn't limited by geography  or income. It occurs in nursing homes and private residences, the very  places meant to offer these elderly people care and protection.\n\nWith a fast-growing senior population in our country, the…", "date": "2025-06-16", "source_url": "https://justfacts.votesmart.org/public-statement/1692579/national-elder-abuse-awareness-month"}, {"senator": "Laurel Lee", "party": "Republican", "sentence": "…passing the  Combating Online Predators Act today.\n\nMr. Speaker, the rise of sextortion against our Nation's children is  troubling. Sextortion is a form of exploitation that occurs when  someone threatens to distribute another person's private, sensitive  material unless that person complies with a demand for additional  sexual content, sexual favors,…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698861/combating-online-predators-act"}]