[{"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…premature retirements, and  it paves the way for private equity takeovers, leaving care delayed,  denied, and diminished.\n\nFor this reason, at the appropriate time I will offer a motion to  recommit this bill back to committee. If the House rules permitted, I  would have offered the motion with an important amendment to this bill.\n\nMy amendment would mandate…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692948/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "Mr. JEFFRIES. Mr. Speaker, pursuant to clause 2(c) of rule XV, I rise  to provide notice of my intent to offer a motion to discharge the  Committee on Rules from the further consideration of House Resolution  780.\n\nMr. JEFFRIES. Yes, Mr. Speaker, I did.", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698488/notice-of-intention-to-offer-motion-to-discharge-committee-on-rules-from-further-consideration-of-house-resolution-780"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…``no'' on this truly reprehensible  piece of legislation. Congress should not be making medical decisions  for your kids.\n\nFor this reason, at the appropriate time, I will offer a motion to  recommit this bill back to committee. If the House rules permitted, I  would have offered the motion with an important amendment to this bill.  My amendment would ensure…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698348/protect-childrens-innocence-act"}, {"senator": "Greg Landsman", "party": "Democrat", "sentence": "…impact  that the global trade wars that this administration has pursued has had  on the rising costs of utility bills.\n\nFor this reason, at the appropriate time, I will offer a motion to  recommit this bill back to committee. If the House rules had permitted,  I would have offered an amendment to this bill, requiring the  Department of Energy to tell…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698058/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Nikki Budzinski", "party": "Democrat", "sentence": "…workers is tone-deaf, at best. At worst, it  is a handout to corporations at a time when workers can least afford  it.\n\nFor this reason, at the appropriate time, I will offer a motion to  recommit this bill back to the committee. If the House rules permitted,  I would have offered the motion with an important amendment to this  bill.\n\nMy amendment would…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698967/tipped-employee-protection-act"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…great, everything is fine, nothing to  see here.\n\nMr. Speaker, that is out of touch. It is really out of touch.\n\nFor all of these reasons, at the appropriate time, I will offer a  motion to recommit this bill back to the committee. If the House rules  permitted, I would have offered the motion with an important amendment  to this bill.\n\nMy amendment would…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700223/homeowner-energy-freedom-act"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, pursuant to clause 2(c) of rule XV, I  rise to provide notice my intent to offer a motion to discharge the  Committee on Rules from the further consideration of House Resolution  164.\n\nMs. PETTERSEN. I did, Mr. Speaker.", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689702/notice-of-intention-to-offer-motion-to-discharge-committee-on-rules-from-further-consideration-of-house-resolution-164"}, {"senator": "Lauren Underwood", "party": "Democrat", "sentence": "…discharge petition for my  bill to extend these tax credits for 3 years, and now four Republicans  have signed on, as well.\n\nFor this reason, at the appropriate time, I will offer a motion to  recommit this bill back to committee. If the House rules permitted, I  would have offered the motion with an important amendment to this bill.\n\nMy amendment would extend…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698394/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…We don't need new showerheads. We  don't need a new name for the Kennedy Center. We need lower costs,  better jobs, and a square deal.\n\nAt the appropriate time, I will offer a motion to recommit this bill  back to committee. If the House rules had allowed it, I would have  offered a motion with an amendment to lower costs for hardworking  families in…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698564/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…overseas. When we stray from that mission, we put our  national security at risk, and we disrespect these men and women.\n\nFor these reasons, at the appropriate time, I will offer a motion to  recommit this bill back to committee. If the House rules permitted, I  would have offered the motion with an important amendment to this bill.  This simple amendment…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695246/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…pay our bills and we can pay our taxes online.  You can apply for college, a car, a home, and everything else online.\n\nFor this reason, at the appropriate time, I will offer a motion to  recommit  this bill back to committee. If the House rules permitted, I would have  offered the motion with my commonsense amendment to this bill.\n\nMy amendment would…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690011/safeguard-american-voter-eligibility-act"}, {"senator": "Summer Lee", "party": "Democrat", "sentence": "…working overtime are the ones who need childcare the most  and the bill undermines workers' ability to pay for that care.\n\nFor this reason, at the appropriate time I will offer a motion to  recommit this bill back to committee. If the House rules permitted, I  would have offered the motion with an important amendment to this bill.\n\nMy amendment would replace…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699007/empowering-employer-child-and-elder-care-solutions-act"}, {"senator": "Donald Norcross", "party": "Democrat", "sentence": "…be an incredibly important vote for  the history of our country. Mr. Speaker, I thank all of those involved.\n\nMr. NORCROSS. Mr. Speaker, at the appropriate time, I will offer a  motion to commit this bill back to committee. If the House rules  permitted, I would have offered this motion with an important amendment  to this bill.\n\nThe amendment would…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697802/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Donald Norcross", "party": "Democrat", "sentence": "…There are ways we can do this that benefits workers  while not creating an opportunity for those who want to exploit them.\n\nMr. Speaker, at the appropriate time, I want to offer a motion to  recommit the bill back to committee. If the House rules permitted, I  would have offered this motion with an important amendment to this  bill. My amendment, Raise…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698957/flexibility-for-workers-education-act"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "Ms. DeLAURO. Mr. Speaker, I offer a motion to instruct conferees.\n\nMr. Speaker, I rise in support of the motion to instruct conferees to  adopt the Senate funding level for Special Supplemental Nutrition  Program…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695289/9999"}, {"senator": "Anna Luna", "party": "Republican", "sentence": "Mrs. LUNA. Mr. Speaker, pursuant to clause 2(c) of rule XV, I rise to  provide notice of my intent to offer a motion to discharge the  Committee on Rules from further consideration of House Resolution 164.\n\nMrs. LUNA. I did, Mr. Speaker.", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689424/notice-of-intention-to-offer-motion-to-discharge-committee-on-rules-from-further-consideration-of-house-resolution-164"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…has been made available at least       five business days in advance of the scheduled meeting.\n\nRule 18. It shall be in order, without prior notice, for a       Member to offer a motion to strike a single section of any       bill, resolution, or amendment under consideration.\n\nRule 19. This section of the rule may be waived by       agreement of the Chair…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687982/us-senate-committee-on-rules-and-administration-rules-of-procedure"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "Mr. COLE. Mr. Speaker, pursuant to clause 1 of rule XXII, and by  direction of the Committee on Appropriations, I offer a motion.\n\nMr. COLE. Mr. Speaker, I support this return to regular order in the  appropriations process.\n\nI support the motion. I yield back the balance of my time, and move  the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695266/motion-to-go-to-conference-on-hr-military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}]