[{"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…enough to disqualify him, one whistleblower  testified Mr. Bove repeatedly told DOJ lawyers to ignore court orders  and even deliberately mislead judges. Mr. Bove encouraged officials not  to tell judges the truth, the same sort of judges he is now nominated  to serve alongside.\n\nHow can someone who has such disregard for our judges and our courts  be…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693921/nomination-of-emil-j-bove-iii"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…and 1998.\n\nI will skip some of the additional scientific details and jump to  more of the conclusions because during those decades differential in  the study, ``California officials set groundbreaking standards that  phased out many inefficient car and truck engines and some of the  dirtiest fuels for everything from jet skis and lawnmowers to school…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691583/hj-res-88"}, {"senator": "Nelida Pou", "party": "Democrat", "sentence": "…been matched.\n\nAcross the U.S., the Department of Education is dismantling public  schools. New Jersey is the latest victim.\n\nI will continue working with our district school officials to use  every single tool available to restore this funding and to fight to  support public education. I will not give up on our children.", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698570/lodi-teachers-recognition"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…Minneapolis-based business leaders  called for cooperation to de-escalate tensions and achieve durable  immigration reforms.\n\nIt is important for this body to hold Federal immigration officials  accountable and ensure that small businesses do not bear the brunt of  this administration's immigration enforcement abuses.", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699617/small-businesses-bear-brunt-of-immigration-enforcement-abuses"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…documentation in the right period  of time, since passing the SAVE America Act and putting it on the  President's desk means it is implemented immediately for this election?  Election officials are generally open normal working hours, which would  mean a voter would have to take time off from work or hire childcare  just to go down there and show these papers.…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700198/save-america-act"}, {"senator": "Mike Levin", "party": "Democrat", "sentence": "…largely unknown midlevel career  employee at the Social Security Administration, Leland Dudek, was  caught sharing unauthorized data with Elon Musk's team at DOGE. Senior  officials were so alarmed they put him on leave and launched an  investigation. He may have violated privacy and tax laws.\n\nHere is the stuff you can't make up. President Trump just…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688267/dismantling-social-security"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…reform in FEMA.\n\nIn the aftermath of the floods of 2023 and 2024, I visited all of our  communities that were affected, and I followed up after that to talk to  our local officials, our local volunteers, our local regional planning  commissions: What worked and what didn't in the long-term response?\n\nAnd what I heard from officials--regardless of what…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693402/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…if they don't  turn it over, then we can go to court. It is comprehensive. It includes  everything from flight logs and travel records to individuals,  including government officials named or referenced, in connection with  all of Epstein's criminal activities, all of the entities involved. We  want to know about all the immunity deals.\n\nIt even tried…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693713/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…people don't want some people to vote.\n\nYet what are the words that are inscribed at the Justice Department  over its entrance?\n\nEqual Justice for All.\n\nDepartment of Justice officials would like us to believe that the  fight for equal rights and the fight for voting rights is already over.  In fact, the Assistant Attorney General for Civil Rights has said…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690545/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…executive order to  erode voting rights and gave Elon Musk, an unelected, unconfirmed  person, the right to access Americans' personal voter information.\n\nMr. Speaker, as elected officials in this House, we should be  fighting to protect and expand access to the ballot box, not restrict  it. As old battles have become new again, we in the Congressional Black…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689343/fighting-voter-suppression"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…the community with, as you can  see, adorable grandchildren. He was arrested, detained, and sent to the  Northwest Detention Center in Tacoma, Washington. Then immigration  officials tried to deport him.\n\nI visited Victor in Tacoma, where he was kept in bleak conditions and  spoke about his experience and his hopes to be reunited with his  family.\n\nAfter…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696911/aggressive-immigration-enforcement-tactics-in-oregon"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "…more  residents than two States, pays more in Federal taxes than 26 States,  and more per capita than any State as it relates to paying those taxes.\n\nD.C.'s locally elected officials are accountable to D.C. residents,  and local leaders should be empowered to address local matters without  Congress interfering.\n\nI have said this many times before, but…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699683/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…Hungary.\n\nSt. Elizabeth of Hungary lived 1,000 years ago. She was a teenager,  and she was a queen in a time of great poverty. Against the wishes of  her husband and other officials, she would take bread and put the bread  inside of her garments and go out and distribute it to the poor.\n\nOnce, she was caught, and she was made to open her garment, and…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693592/rescissions-act-of-2025"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…demonstrate what they  accomplished last week, a failure to comply would result in their  termination by resignation according to a tweet by Elon Musk.\n\nHours later, Trump officials in the same administration told their  staff not to respond. In solidarity, let me say what my five bullets  for the week are: I fought to defend the Constitution and the…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687966/five-bullet-points"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…essential functions.\n\nNo one knows or cares more about keeping DC safe than DC       residents who work, live and raise their families here. Our       democratically elected officials work closely with local law       enforcement, policy experts, and community leadership to pass       laws that are in the best interests of all Washingtonians.       Substituting…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695614/district-of-columbia-judicial-nominations-reform-act"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…historic U.S. Army iron bridge where the Laramie  and North Platte Rivers meet and Oregon Trail ruts.\n\nToday, the Town of Fort Laramie is led by a distinguished group of  officials, including:\n\nRyon Brown, Mayor\n\nAlicia Tanner, Council Member\n\nChris Sachanandani, Council Member\n\nJason Curtsinger, Council Member\n\nJacob Ellis, Council Member\n\nTristica…", "date": "2025-07-31", "source_url": "https://justfacts.votesmart.org/public-statement/1694485/100th-anniversary-of-fort-laramie-wyoming"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…outlined procedures for SSA       employees to follow in processing and adjudicating benefits       claims. Because the manual was directed to and binding only       on SSA officials without imposing new burdens on claimants,       we concluded that the manual met CRA's third exception.\n\nIn contrast, rules that are directed at and primarily       concerned…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695880/government-accountability-office-opinion-letter"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…another illegal,  dangerous biolab run by Chinese nationals.\n\nIn 2023, when the secret lab in Reedley, California, came to light,  thanks to the tremendous efforts of local officials there, I gave  several speeches on this floor calling attention to the danger that  this posed to all Americans. I noted that we don't know how many  similar such labs might…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699738/national-oversight-for-biological-labs"}, {"senator": "Mike Kelly, Jr.", "party": "Republican", "sentence": "…detail, and tireless work ethic have not only  ensured the responsible management of county finances but have also  earned her the respect and admiration of colleagues, local officials,  and community members alike.\n\nMs. Krzysiak's career reflects a deep sense of duty and pride in her  work. Her efforts have directly contributed to the effective operation…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689885/recognizing-christine-krzysiak-as-a-community-champion-in-pennsylvania-16"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…including more than 169,000 speeches. It has documented more  than 23,439 rollcall votes, providing a live testimonial of Senate  decision making. Its coverage helps hold elected officials accountable  to our constituents, who are able to see every rollcall vote as it  actually happens.\n\nAnd it just so happens, on C-SPAN2's inaugural day, on June 2, 1986,…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691703/senate-resolution-259-recognizing-june-as-the-39th-anniversary-of-c-span-chronicling-democracy-in-the-senate"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…ensure  that our farmers can finally defend their ponds without any Federal red  tape in the way.\n\nMr. Speaker, I thank Chairman Westerman, Leader Scalise, the Gulf  Coast officials, and numerous Mississippians who have worked hard to  bring this bill to the floor. I urge my colleagues to vote ``yes.''", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697639/cormorant-relief-act-of-2025"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…immigration documentation, for any aircraft, vessel, or       vehicle owned, operated, or used by Jeffrey Epstein or any       related entity.\n\n(4) Individuals, including government officials, named or       referenced in connection with Epstein's criminal activities,       civil settlements, immunity or plea agreements, or       investigatory proceedings.\n\n(5)…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696818/epstein-files-transparency-act"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…distinguished Templeton  Prize, a testament to his lifelong dedication to advancing spirituality  and humanity.\n\nDuring his visit, he is scheduled to meet with administration  officials, Members of Congress, distinguished leaders, and  representatives from various faith communities. These meetings provide  a wonderful opportunity to discuss ways to promote…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695423/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Byron Donalds", "party": "Republican", "sentence": "…by the crime here in  Washington, D.C. Rather than prioritizing the safety of law-abiding  citizens and protecting the lives of innocent residents and visitors,  District officials have actively facilitated dysfunction and chaos  through  their progressive, soft-on-crime policies.\n\nInstead of addressing the clear epidemic of youth crime in this city,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695561/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…outlined procedures for SSA       employees to follow in processing and adjudicating benefits       claims. Because the manual was directed to and binding only       on SSA officials without imposing new burdens on claimants,       we concluded that the manual met CRA's third exception.\n\nIn contrast, rules that are directed at and primarily       concerned…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694908/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Carlos Gimenez", "party": "Republican", "sentence": "…and to promote cultural unity across  our diverse community.\n\nThis year, Miami-Dade County's 2025 Hispanic Heritage Month Kickoff  Celebration will bring together elected officials, more than 30 Consuls  General and international diplomats, as well as community leaders from  across South Florida. This celebration reflects the multicultural  richness…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695658/recognizing-hispanic-heritage-month-and-the-miami-dade-county-hispanic-affairs-advisory-board"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…safety, and  economic vitality.\n\nAs Mayor, Larry Keller placed a strong emphasis on collaboration  between borough council, local businesses, residents, and public safety  officials. His leadership reflected a practical, community-first  approach, focused on maintaining New Hope's unique identity while  addressing the everyday needs of its residents…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699203/congratulating-larry-keller-on-his-service-as-mayor-of-new-hope-pennsylvania"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…is a regulation on the entire Nation.\n\nThat is why this Congress is paying attention to its own  responsibilities and not listening to the bureaucrats and other  unelected officials. We must make a decision and vote to pass H.J. Res.  87.\n\nIt is important to the Nation as a whole to protect our trucking  industry and to protect jobs across this great…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690474/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…technical  assistance programs.\n\nAccess to clean and safe water should not be determined by where you  live, Mr. Speaker. During my time in Congress, I have heard from  elected officials across southern Ohio about the difficulties they face  navigating the Federal grant process due to budgetary constraints,  insufficient time, and lack of technical expertise.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695402/water-resources-technical-assistance-review-act"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…healthcare  premiums would go down as a result of our work.\n\nWe went after Medicaid fraud, especially involving illegal  immigrants. By the way, a Federal court recently ordered officials to  turn over Medicaid information to ICE enforcement. If illegal  immigrants weren't accessing Medicaid on Democrats' watch, as they  tirelessly asserted, then why would…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698637/providing-for-consideration-of-hr-saving-homeowners-from-overregulation-with-exceptional-rinsing-act-providing-for-consideration-of-hr-affordable-housing-over-mandating-efficiency-standards-act-and-providing-for-consideration-of-hr-commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}]