[{"senator": "Jamie Raskin", "party": "Democrat", "sentence": "Her bill allowed Federal agencies to sell handguns that  they were no longer using to the active-duty officers, who previously  carried those handguns, for fair market value as long as they completed  a background check like everybody else in America.", "title": "Federal Law Enforcement Officer Service Weapon Purchase Act of 2025", "date": "2025-05-15"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "His formal office is Archbishop of Constantinople-New  Rome and Ecumenical Patriarch, a historic title dating to the sixth  century.", "title": "Welcoming His All-Holiness Bartholomew I, Ecumenical Patriarch of Constantinople", "date": null}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "Speaker, I rise today to congratulate Alexandra  Vakos on being named the 2025 Distinguished Assistant of the Year in a  medium-sized office by the Virginia Association of Commonwealth's  Attorneys.", "title": "Constituent of the Week Alexandra Vakos", "date": "2026-01-15"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "My office is receiving notes from people who are not  receiving their hard-earned awards.", "title": "Congressional Award Program Reauthorization Act", "date": "2025-12-15"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "In an entirely  unprecedented move, they are moving forward, even though the Government  Accountability Office hasn't yet ruled on whether they believe this  public land order constitutes a rule that would be subject to the CRA.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the Bureau of Land Management Relating to Public Land Order No. 7917 for Withdrawal of Federal Lands; Cook, Lake, and Saint Louis Counties, Mn", "date": "2026-01-21"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "In the National Defense Authorization Act for Fiscal Year 2022  (Public Law 117-81), I secured Section 813 (Office of Corrosion Policy  and Oversight employee training requirements) directing the U.S.", "title": "Introduction of the Bridge Corrosion Prevention and Repair Act of 2025", "date": "2025-06-26"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "However, Republicans, the gentleman from  Virginia included, refuse to even display a plaque to honor the police  officers who were here that day.", "title": "Providing for Consideration of H.R. Energy and Water Development and Related Agencies Appropriations Act, Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Bureau of Land Management Relating to ``Miles City Field Office Record of Decision and Approved Resource Management Plan Amendment''; Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Bureau of Land Management Relating to ``North Dakota Field Office Record of Decision and Approved Resource Management Plan''; Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Bureau of Land Management Relating to ``Central Yukon Record of Decision and Approved Resource Management Plan''; and for Other Purposes", "date": null}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "Speaker, today, I introduce the Government  Accountability Office District of Columbia Home Rule Act.", "title": "Introduction of the Government Accountability Office District of Columbia Home Rule Act", "date": "2025-10-14"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "Speaker, I rise today to thank Matt Jansen for over  six years of outstanding service in the United States House of  Representatives working with the House Judiciary Committee, the House  Ethics Committee, and my personal office representing constituents  living in the heart of New York City.", "title": "Recognizing Matt Jansen and His Service to the House of Representatives", "date": "2025-07-10"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "Unlike in the past, OMB has refused to make the apportionments for  the accounts at issue available to the Government Accountability Office  for their required review under the Impoundment Control Act of 1974.", "title": "Senate Amendment to H.R. 4", "date": "2025-07-23"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "During Reconstruction, formerly enslaved and free Black men voted and  got elected to office.", "title": "Fighting Voter Suppression", "date": "2025-03-31"}, {"senator": "Norma Torres", "party": "Democrat", "sentence": "While some of my colleagues celebrate his actions, I am reminded why  I first ran for office and why I continue fighting for my community.", "title": "Standing for America", "date": "2025-04-28"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "She also served as a  National Environmental Policy Act (NEPA) and Endangered Species  Specialist for the Office of Airports and Environmental Planning.", "title": "Recognizing the Exceptional Environmental Research of Dr. Shamira Brown", "date": "2025-08-12"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "D.C.'s Comprehensive Policing and Justice Reform Amendment Act, among  other things, gave the police chief more authority to discipline  officers for serious misconduct and crimes; strengthened civilian  oversight of the police department; improved public access to body-worn  camera video; and imposed limitations on the purchase of military  weapons and the use of force.", "title": "Common-Sense Law Enforcement and Accountability Now in DC Act of 2025", "date": "2025-11-19"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "Speaker, I am just pulling up my note on these reciprocal tariffs  because it was an executive office announcement to do reciprocal  tariffs.", "title": "Reflecting on America's History", "date": "2025-04-08"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "As just one example, whistleblowers told my office, some who were  merely present at a rally on January 6, 2021, with President Trump were  added to the Quiet Skies' list of targeting.", "title": "-9999", "date": "2025-06-10"}, {"senator": "James Risch", "party": "Republican", "sentence": "If the cover letter references a classified annex, then such  an annex is available to all Senators in the office of the Foreign  Relations Committee, room SD-423.", "title": "Arms Sales Notification", "date": "2026-01-28"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "When reapportionment brought my district into Stanislaus County, I  was fortunate to bring him into my congressional office where he served  ably as my district representative.", "title": "Mourning the Passing of Bob Phelan", "date": "2025-04-10"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "(b) Contents.--\n\n(1) Determination by congressional leadership.--The Office       of the Speaker of the House of Representatives, Office of the       Minority Leader of the House of Representatives, Office of       the Majority Leader of the Senate, and Office of the Minority       Leader of the Senate shall jointly determine the contents of       the Time Capsule, taking into account the requirements of       paragraph (2).", "title": "Semiquincentennial Congressional Time Capsule Act", "date": "2025-02-26"}, {"senator": "David Taylor", "party": "Republican", "sentence": "3427, the Water Resources Technical  Assistance Review Act, would instruct the Government Accountability  Office, or GAO, to conduct a study reviewing the EPA's technical  assistance programs.", "title": "Water Resources Technical Assistance Review Act", "date": null}, {"senator": "James Risch", "party": "Republican", "sentence": "If the cover letter references a classified annex, then such  an annex is available to all Senators in the office of the Foreign  Relations Committee, room SD-423.", "title": "Arms Sales Notification", "date": "2025-05-14"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "(15) In October 2024, Taiwan announced it would seek IMF       membership, with the Taipei Economic and Cultural       Representative Office in the United States stating,       ``Taiwan's membership at the IMF would help boost financial       resilience.''.", "title": "Taiwan Non-Discrimination Act of 2025", "date": "2025-06-23"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "I was sworn into office in  January of 2021.", "title": "Streamlining Procurement for Effective Execution and Delivery and National Defense Authorization Act for Fiscal Year 2026", "date": null}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "22) to amend the National Voter Registration Act of 1993  to require proof of United States citizenship to register an individual  to vote in elections for Federal office, and for other purposes, and  ask for its immediate consideration.", "title": "Safeguard American Voter Eligibility Act", "date": "2025-04-10"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "A State comptroller's office also revealed that the State  provided more than $500 million in Medicaid benefits to out-of-State  residents.", "title": "Fraud Accountability Act", "date": "2026-01-07"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "Recently, Brannon accepted a role in Senator Todd Young's office as a  Policy Advisor.", "title": "Recognizing Brannon Rains", "date": "2025-05-01"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "My office has been told that of the  more than 100,000 Afghan evacuees, as of August 2022, 1.6 percent had  links to terrorism or other derogatory information.", "title": "Afghan Evacuees", "date": "2025-07-08"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "Recently,  Senator Johnson and I have exposed that the Special Counsel's office  obtained phone records of at least 11 Senators and 6 Members of the  House of Representatives--all of them Republican.", "title": "-9999", "date": "2025-12-10"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "The bill would require       the Federal Deposit Insurance Corporation (FDIC), the Federal       Reserve, the Government Accountability Office (GAO), and the       Office of the Comptroller of the Currency (OCC) to submit       information about bank supervision, regulation, management,       and recommendations to improve the safety and soundness of       the industry.", "title": "Systemic Risk Authority Transparency Act", "date": "2025-12-01"}, {"senator": "Ron Estes", "party": "Republican", "sentence": "She served as the chief of staff for the Kansas Senate Ways  and Means Committee before joining my staff to lead my district office.", "title": "Recognizing Debbie Luper's Tenure As District Director for the Fourth District of Kansas", "date": "2025-04-30"}]