[{"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…the United  States of America, for those who met the fire hoses just to try to  claim their right to vote.\n\nMr. Speaker, both of my grandfathers served in World War II.  Oftentimes, when I look at Union Station, I remember that my  grandfather, having fought the Nazis in World War II, coming back to  the United States and into Washington, D.C., he had…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689342/fighting-voter-suppression"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…again.\n\nSo I want to start most directly with what we all share, and that is  an incredible appreciation for the Capitol Police. They showed up that  day. These are folks who oftentimes have to commute an hour and a half.\n\nThe person who was guarding us--I was in the Gallery of the House of  Representatives--had an hour and a half commute each day--to and…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698518/anniversary-of-january-6"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…nobody believes them. They were told to be silent.\n\nWhen the truth about Jeffrey Epstein finally started to come out,  when the world started listening to their stories, oftentimes, the laws  on the books said: Sorry, it is too late. The deadline to bring your  case has passed.\n\nVirginia's Law will change that because justice for victims of abuse  should…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699879/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…WELCH. I am so glad that you brought that up because what drives  everyone crazy is the so-called cost shift. A lot of our community  hospitals, they get underreimbursed, oftentimes on Medicare or  Medicaid. And then the employer-sponsored premiums are the only place  the providers can go to cover their legitimate costs.\n\nSo there is a huge spike in…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695678/cloture-motion"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…Finally, I will say one last thing because something that the Senator  from Rhode Island said bears repeating. The challenge to doing  permitting reform is not in this building. Oftentimes, the problem of  getting to yes is in this building. It is not the chairman of the  Energy and Natural Resources Committee. It is not the chairwoman of the  EPW Committee.…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698581/permitting-reform"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…Religious Heritage Restoration Act, as amended. I thank  my good friend and colleague Representative Debbie Wasserman Schultz  for introducing this bill.\n\nMadam Speaker, oftentimes veterans who were buried overseas during  World Wars I and II were put to rest on foreign soil without the full  picture of who they were as people. In life, these servicemen…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695467/fallen-servicemembers-religious-heritage-restoration-act"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…circumstances. I don't know why we are wasting time on this  floor. I urge Members to reject this wasteful, harmful, anticompetition  resolution.\n\nWhen I talk about rubber-stamping, oftentimes people don't really  know what we are talking about. What I am saying is that we need to  have better review. The OCC needs to be able to do everything possible  to ensure…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691499/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Eric Swalwell", "party": "Democrat", "sentence": "…who just want to be attached to tablets  or anything but the directions that you are giving to them to hopefully  get them from the entrance of the airport to the plane.\n\nOftentimes with little kids, you have, in transit with them, a mother  who is breastfeeding. Many of us have experienced going through airport  security where our TSA agents, who are…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696792/bottles-and-breastfeeding-equipment-screening-enhancement-act"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…and they are at the point of clinical trials.\n\nMr. Speaker, I don't know if you know anyone in your family who is a  survivor of breast cancer or any other kind of cancer. Oftentimes, when  you go in and the surgeon puts you under to take it out, they don't  know if they have gotten all of it out. They hope that they have, but  for some odd reason, we…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690637/trumps-first-100-days"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…that dangerous trend. One bill  actually diverts Federal TANF funds meant for low-income families to  fund so-called crisis pregnancy centers, which provide pregnant women  oftentimes with fake medical advice with the goal of dissuading them  from accessing contraception or abortion care.\n\nRepublicans aren't providing more funding for TANF. God forbid…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699220/providing-for-consideration-of-hr-supporting-pregnant-and-parenting-women-and-families-act-providing-for-consideration-of-hr-pregnant-students-rights-act-and-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Jahana Hayes", "party": "Democrat", "sentence": "…for those in their earliest and most  formative years. IDEA part C, a Federal program closely intertwined the  Medicaid, provides early intervention from birth to age 3, oftentimes  the difference between a child meeting developmental milestones or  falling behind.\n\nThese Federal dollars change millions of lives across the country  every single year.…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698939/protecting-education-for-children-with-disabilities"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…Colorado Senator Bennet.\n\nThe Energy and Natural Resources Committee does have a long tradition  of bipartisanship and cooperation when it comes to passing very local  and oftentimes very parochial land bills. Typically, this is negotiated  in a package rather than the piecemeal approach that we are seeing  today--for many reasons but in part because…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696960/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-extension-of-deadlines-in-standards-of-performance-for-new-reconstructed-and-modified-sources-and-emissions-guidelines-for-existing-sources-oil-and-natural-gas-sector-climate"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…these accusations.\n\nRepublican support for this bill seems to be strictly based on this  one case, but without the facts and circumstances, how can we know the  truth?\n\nOftentimes, my counterparts seem to refer to anyone born outside the  U.S. as an ``illegal,'' but Democrats understand the nuances of  immigration status. What they call an illegal…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692125/american-entrepreneurs-first-act-of-2025"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…harmful  to everyone. As my colleagues have said, what we have seen is the  endless proliferation of criminal offenses, some of them statutory,  some of them regulatory, oftentimes in a kind of political reaction to  a particular event that might have been criminal already under a more  general category.\n\nThis legislation will allow us to get on top…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697205/count-the-crimes-to-cut-act"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…date, is that you are less likely to get those preventative screenings.  You are less likely to get annual checkups. Therefore, these  preventative illnesses are caught oftentimes when it is too late.\n\nThere are certain illnesses that are deadly but silent killers, and I  will close with this. My brother-in-law is one such example, Greg  Beckwith.…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692205/raising-awareness-about-mens-health"}, {"senator": "Adrian Smith", "party": "Republican", "sentence": "…Under President Trump's leadership, we have seen  this change, most recently when Canada removed its discriminatory  digital services tax.\n\nThese productive--and I will say oftentimes uncomfortable-- conversations must continue, though, as we strengthen and extend USMCA  during this 2026 Joint Review.\n\nThe President has, at every turn, reaffirmed his commitment…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699963/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…and Means Committee, and  I have seen the work that Mark Roman did, mostly behind the scenes, the  stress that he is put under, and the outcomes that we have delivered.\n\nOftentimes, we don't talk about this being a functional place.  Sometimes when you go to Congress, Mr. Speaker, all you hear about is  the gridlock, the nonsense, and all the rhetoric.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699706/historic-tax-relief-for-families"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…problem is far bigger than any one country. Sixty percent of all  foreign money in U.S. universities comes from just four sources,  including China and Qatar, nations that oftentimes have strategic and  ideological conflicts with U.S. interests. Despite this, 70 percent of  universities fail to comply with foreign funding reporting  requirements. Worse,…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689028/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Andy Harris", "party": "Republican", "sentence": "…is a mentor to not only the legislative  team, but also to other members of my staff.\n\nIt is important that Representatives recognize outstanding staff such  as Mr. Trejo. Oftentimes, the work of these staffers goes unnoticed but  is nonetheless critical in maintaining the functions of our government.  Travis is a true patriot, and Maryland's First Congressional…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692740/congratulating-mr-travis-trejo-on-8-years-of-service-to-marylands-first-congressional-district"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…manufacturing roles. These jobs, like other good, blue- collar jobs in my district, provide stable, good-paying careers to  constituents to help provide for their families. Oftentimes, these jobs  are obtainable to folks with a high school degree after a quick and  affordable career technical education course.\n\nMy bill tasks the Secretary of Commerce with…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692695/global-investment-in-american-jobs-act-of-2025"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…can sometimes happen when a law enforcement officer needs to reach  out for some kind of mental health counseling.\n\nIf the Speaker would think about it, these men and women oftentimes  see the worst of folks. They see folks who are in their worst state.  They see the tragedies that hopefully most of us will go through life  and never have to see, and they…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691319/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…country post-2017  when you saw a significant economic boon in the U.S.\n\nYears prior to 2017, you saw a lot of companies decide there were  favorable tax rates elsewhere. Oftentimes, in countries in Europe-- there was a tax provision that was done in 2017 that is called FDII, an  intangible income piece.\n\nYou can establish intellectual property overseas…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691960/supporting-the-big-beautiful-bill"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…discussions with larger folks, and those are  the people who are okay with it. I hear from Representatives from  places like Alaska, North Dakota, and Texas whose constituents  oftentimes are small mom-and-pop operations. It is hard to think of oil  and natural gas that way, but that is the way it is in those regions.  They say this will, in fact, hurt them…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688182/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…natural gas and  propane hookups in new construction starting in 2026. That means  families in western New York, where winters are long, snow is great,  and it is cold and oftentimes dangerous in these terrible winter  storms, they will be denied the ability to choose the energy source  that best keeps them safe and warm in their homes. Taking affordable…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695524/providing-for-consideration-of-hr-dc-criminal-reforms-to-immediately-make-everyone-safe-act-providing-for-consideration-of-hr-district-of-columbia-policing-protection-act-providing-for-consideration-of-hr-lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia-providing-for-consideration-of-hr-district-of-columbia-judicial-nominations-reform-act-providing-for-consideration-of-hr-guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act-providing-for-consideration-of-hr-national-coal-council-reestablishment-act-providing-for-consideration-of-hr-promoting-cross-border-energy-infrastructure-act-and-for-other-purposes"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…balance of my time.\n\nMr. Speaker, like my friend, the gentleman from Arizona (Mr.  Stanton), implied, these are heartbreaking, heart-wrenching stories  about real people. Oftentimes, in our country, people look for heroes.  They look to sporting fields. They look to pop culture for their  heroes, but their heroes walk right among them, right in their…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689661/authorizing-the-use-of-the-capitol-grounds-for-the-national-peace-officers-memorial-service-and-the-national-honor-guard-and-pipe-band-exhibition"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…the  States which were receiving it.\n\nNow, most families across the country have not heard of the BRIC  Program, but if you were to explain what it does, they would say,  oftentimes, that they need it. I can tell you folks in Louisiana do.\n\nLouisiana has benefited the most per capita in the BRIC's latest  round of funding, and I would argue that this…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690105/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Kat Cammack", "party": "Republican", "sentence": "…ensures that individuals with disabilities are  not discriminated against in organ transplant eligibility. It gives  families a mechanism for timely intervention, time that oftentimes  families just don't have, through the Department of Health and Human  Services, when medical decisions are clouded by bias rather than  compassion and science.\n\nI am proud…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692717/charlotte-woodward-organ-transplant-discrimination-prevention-act"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…will,  seriously.\n\nMr. Speaker, we are public servants. We serve the people who we  represent. We aren't elected to come up to Washington and get rich  while our constituents oftentimes struggle to make ends meet.\n\nI am here to serve the least amongst us and try my dadgum hardest to  make the lives of east Tennesseans better, Mr. Speaker. I don't sell  stocks.…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691219/stock-trading-ban-for-members-of-congress"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…corp, deduction from their qualified  business expense, a 20 percent deduction, expires at the end of this  year. That is a massive tax hike on small businesses, and this is  oftentimes a category that gets overlooked because my colleagues talk  about corporations and about high-net-worth individuals, but the small  businesses are structured in a way that…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690787/big-beautiful-bill"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…allow us to, in essence, lay  the issue of voting by proxy on the table.\n\nI have heard people say: These folks followed the rules.\n\nThis is also a component of the rules, and oftentimes there is a  clash of the rules.\n\nMr. Speaker, I urge my colleagues to quit making it sound like it is  some kind of a nefarious thing. I don't agree with voting by proxy.…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689405/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}]