[{"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…crisis has become. We have  only about half of the mental health behavioral workforce that we need  to meet the demand. In fact, there is just one psychiatrist for every  6,000 Ohioans. That is not just a workforce problem. That is a public  health emergency.\n\nThe SUPPORT for Patients and Communities Reauthorization Act would  authorize hundreds of millions…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691943/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…that saved her life and her future.\n\nYet, despite all of this, the people of Ohio did what we have always  done in the face of injustice. We fought back.\n\nIn November 2023, Ohioans from across the political spectrum came  together and voted to enshrine reproductive freedom directly into our  State's constitution: the ability to bear a child, to use…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692969/dobbs-decision-anniversary"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…KAPTUR. Mr. Speaker, I will move on now to remember someone that  was an extraordinary American.\n\nIt is my great privilege, Mr. Speaker, to offer deepest gratitude on  behalf of Ohioans and Americans as we recognize the life of an honored  and indefatigable public servant in the truest sense.\n\nSteven D. Fought was born in Rapid City, South Dakota, on June…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699337/applauding-president-zelenskyys-address-in-davos"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…that I represent.\n\nJust in Ohio, we know health insurance will become unaffordable for  tens  of thousands of people across our northwest Ohio district, over half a  million Ohioans, and 15 million Americans.\n\nPlease let me share some examples. A constituent from Clyde, Ohio,  said it clearly: High insurance prices will allow people to die by  making…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696841/rising-healthcare-costs"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…this crisis has become, where  we have only about half the behavioral health workforce we need to meet  the demand. In fact, there is just one psychiatrist for every 6,000  Ohioans. That is not just a workforce problem. It is a public health  emergency, a safety issue, and a challenge to our quality of life.\n\nWhen I came to Congress, I promised to work…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690847/mental-health-solutions"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…homes. These cuts are compounded by the fact that  ratepayers in Ohio are on the hook for a corrupt bill that adds  hundreds to energy costs to bail out a coal plant in Indiana. Ohioans  cannot afford any more Republican malfeasance that literally costs  Ohioans hundreds of dollars a year.\n\nEven more, this bill does not adequately fund two authorities in…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694842/massive-cuts-to-energy-and-water-infrastructure"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…the crooked PUCO and Ohio's Legislature  have granted giant tax breaks to data centers, while local township  officials remain in the dark about details. That is not fair.\n\nOhioans know what secrecy and inside deals bring. FirstEnergy  scandals led to indictments, prison terms, and even suicides. Ohio  Statehouse corruption rewards big business and harms…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697372/rushing-to-build-ai-data-centers"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…healthcare coverage at risk for millions of Americans  while raising energy costs for families.\n\nIn fact, just today there is a report that came out that showed over  120,000 Ohioans chose to forgo their healthcare because they simply  couldn't afford it. These are real people, and that bill had real  consequences. Not only does it impact us in terms of…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699255/2025-final-priority-results-survey"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…in both Ohio's past and its future; and\n\nWhereas, its 406.8 square miles of rich farmland, flowing       rivers, and vibrant towns have been home to generations of       Ohioans committed to hard work, community, and service; and\n\nWhereas, for 175 years, Fulton County has stood as a proud       testament to the enduring values of self-reliance, civic…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693801/proclamation-for-fulton-countys-demisemiseptcentennial"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…double, triple, or quadruple, costing them hundreds of additional  dollars a month, and more than 4 million Americans will lose their  coverage entirely. This includes 12,300 Ohioans in my district alone.\n\nThis Republican healthcare crisis is completely and entirely  preventable, and House Democrats and even a few Republicans have a  solution: Extend the…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698303/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…protected the  American people and provided not just for the wealthy, but for all, for  the least of us.\n\nTonight, I want to put a face on it, Mr. Speaker. I want to lift up  two Ohioans who put names to these numbers. You see, it is not about  the politics, as our chairwoman said. It is about people. It is about  everyday people.\n\nLet me tell you the story…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697648/restoring-enhanced-premium-tax-credits"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…Guard Wing to the 179th  Cyberspace Wing. During the COVID-19 pandemic, his strong leadership  allowed the National Guard to respond across the state and assist  hospitals and Ohioans in need.\n\nMr. Speaker, I ask my colleagues to join me in paying special tribute  to Major General John Harris, on his retirement from the Ohio National  Guard. On behalf of…", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691689/special-recognition-of-major-general-john-c-harris-jr-upon-his-retirement-as-adjutant-general-of-the-ohio-national-guard"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…prioritize rest, connection, and the things  that contribute to our overall wellness.\n\nIn our great Buckeye State, we are grateful to have multiple  resources available to help Ohioans in times of need. The Ohio  Department of Mental Health and Addiction provides resources and  readily available services with their Ohio CareLine available 24 hours  a day…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691424/increasing-mental-health-services"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…Carroll County Commissioner and a member of the Carroll County Farm  Bureau Hall of Fame.\n\nSelection for the Hall of Fame is a high honor that has been accorded  to only 257 Ohioans since 1966. Consideration for induction is given to  those who have made outstanding contributions to agriculture, Ohio's  top industry.\n\nOn behalf of the people of Ohio's…", "date": "2025-07-25", "source_url": "https://justfacts.votesmart.org/public-statement/1694257/recognizing-the-2025-class-of-the-ohio-agricultural-hall-of-fame"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…than what was collected in 2024.\n\nEfforts from youth like C.J. and Isaac will ensure that fewer  Buckeyes will go hungry. Their actions show just what can be achieved  when Ohioans set their minds to a common goal to look out for the needs  of others.", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699469/recognizing-cj-jones-and-isaac-corcoran"}, {"senator": "David Taylor", "party": "Republican", "sentence": "Mr. TAYLOR. Madam Speaker, during the month of August, I spent time  in Ohio's Second Congressional District, talking with countless Ohioans  about their priorities, touring family-owned businesses, and hearing  from local farmers, manufacturers, and defense companies about the  issues most important to them.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694798/promises-made-promises-kept"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…comeback. The  Clermont Chamber is an integral part of local economic development  projects and supports businesses of all sizes. Their work is helping to  build a community where Ohioans can achieve the American Dream.\n\nEconomic development remains one of my top priorities in Congress,  and I look forward to continuing to work with the Clermont County  Chamber…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699834/recognizing-carl-and-nancy-schneider"}]