[{"senator": "Emilia Sykes", "party": "Democrat", "sentence": "Mrs. SYKES. Mr. Speaker, I rise today to recognize the Akron Rites of  Passage as the Ohio's 13th Congressional District Champions of the  Week.\n\nLed by 13 elders in the community, AROPI, as it is also known, is an  African-centered organization established for the purpose…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699619/recognizing-akron-rites-of-passage-institute"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "Mrs. SYKES. Mr. Speaker, today, I rise to recognize Jackson High  School Automotive Teacher Joseph Drury as Ohio's 13th Congressional  District Champion of the Week.\n\nJoseph was recently awarded a $50,000 prize for his school's skilled  trades program as a winner of the 2025 Harbor Freight Tools…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695925/recognizing-joseph-drury-conner-as-ohios-13th-congressional-district-champion-of-the-week"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "Mrs. SYKES. Mr. Speaker, today I rise to recognize the University of  Akron Zips Women's Lacrosse team and their coach, Elaine Jones, as  Ohio's 13th Congressional District Champions of the Week.\n\nFor the first time ever, this lacrosse team won the Mid-American  Conference Lacrosse Championship when they took down Robert Morris…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691189/champion-of-the-week-university-of-akron-womens-lacrosse-teams"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "Mrs. SYKES. Mr. Speaker, today I rise in support of my proposed  amendments to the National Defense Authorization Act for fiscal year  2026.\n\nOhio's 13th Congressional District has long been known as the Rubber  Capital of the World, and both of my amendments uphold that legacy by  investing in American manufacturing to ensure this…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697853/providing-for-consideration-of-hr-promoting-efficient-review-for-modern-infrastructure-today-act-providing-for-consideration-of-hr-increasing-investor-opportunities-act-providing-for-consideration-of-hr-electric-supply-chain-act-providing-for-consideration-of-hr-state-planning-for-reliability-and-affordability-act-providing-for-consideration-of-hr-improving-interagency-coordination-for-pipeline-reviews-act-providing-for-consideration-of-s-disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-and-for-other-purposes"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "Mrs. SYKES. Mr. Speaker, today, I rise to recognize The Remedy Church  and its congregation as Ohio's 13th Congressional District's Champion  of the Week.\n\nThis past weekend marked a significant milestone as The Remedy Church  celebrated 5 years of faithful service to God and community.…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699339/recognizing-the-remedy-church"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…revolutionizing  the way that the world travels. Decades later, the Goodyear Tire and  Rubber Company was founded and headquartered in Akron, Ohio, my  hometown, in Ohio's 13th Congressional District.\n\nFor many years, the city of Akron, which I proudly represent, has  been nicknamed the Rubber Capital of the World due to its long history  of rubber and…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688529/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "Mrs. SYKES. Mr. Speaker, as families in Ohio's 13th Congressional  District get ready for the holiday season, I will talk about something  that is weighing on many of them.\n\nThe cost of everyday life keeps going up and people feel…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696852/higher-costs-of-everyday-life"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "Mrs. SYKES. Mr. Speaker, today, I rise to recognize Addelynn Ferguson  as  Ohio's 13th Congressional District Champion of the Week.\n\nAddelynn is a junior from Portage Lakes Career Center in Uniontown,  Ohio, and out of nearly 50 participants, she took home the first-place…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690574/champion-of-the-week-addelynn-ferguson"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…retiring for real, as he has been sworn into the APD Reserves. I am  sure we will continue to see him serving our community in his own  special way.\n\nOn behalf of Ohio's 13th Congressional District, I congratulate and  thank Detective Jerry Gachett on a storied career at the Akron Police  Department and for over 31 years of outstanding service and devotion…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687992/congratulating-jerry-gachett-on-his-retirement"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "Mrs. SYKES. Mr. Speaker, today, I rise to recognize the City of  Green's 2025 Volunteer of the Year, John Piersol as Ohio's 13th  Congressional District's Champion of the Week.\n\nFor the last 30 years, as president of the Green Soccer Association,  John helped create opportunities for more than 600 youth players.…", "date": "2025-11-25", "source_url": "https://justfacts.votesmart.org/public-statement/1697165/recognizing-john-piersol-as-ohios-13th-congressional-districts-champion-of-the-week"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "Mrs. SYKES. Mr. Speaker, I rise today to oppose this terrible bill  that is a bad deal for Ohio, the residents of Ohio's 13th Congressional  District, and the people of the United States of America.\n\nWhen I was first elected, I told the people of Ohio's 13th  Congressional District that it may be my name…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693216/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…proposed  amendments to H.R. 3838, the Streamlining Procurement for Effective  Execution and Delivery and National Defense Authorization Act for  Fiscal Year 2026.\n\nOhio's 13th Congressional District has long been known as the Rubber  Capital of the World, and my First Amendment upholds that legacy by  investing in American manufacturing to ensure that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695128/my-amendments-to-hr-3838"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "Mrs. SYKES. Mr. Speaker, today I rise to recognize the Black Chamber  of Commerce of Summit County and cofounders Robert DeJournett and Misty  Beasley as Ohio's 13th Congressional District Champions of the Week.\n\nOne year ago I had the honor of attending its kick-off event in  Akron, and I was truly inspired to see so many people support this…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699951/recognizing-black-chamber-of-commerce-of-summit-county"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "Mrs. SYKES. Mr. Speaker, I rise today to recognize Vince Marchetta as  the Champion of the Week for Ohio's 13th Congressional District.\n\nVince recently earned the State Lead Ambassador of the Year Award  from the American Cancer Society Cancer Action Network. This award  recognizes his efforts…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696703/recognizing-vince-marchetta-as-the-champion-of-the-week-for-ohios-13th-congressional-district"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "Mrs. SYKES. Madam Speaker, today I rise in support of H.R. 3095, a  bill that would assign a new ZIP Code to the city of Green, a  municipality within Ohio's 13th Congressional District.\n\nEstablishing unique ZIP Codes may not be what most folks think about  when they are considering Federal legislation; however, for the  citizens and businesses…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693900/single-unique-zip-codes-for-certain-communities"}]