[{"senator": "Ed Markey", "party": "Democrat", "sentence": "…with cleaner, smarter, more efficient technologies, we can reduce and  reduce and reduce the amount of oil that we put into the vehicles which  we drive. This terrifies the oil industry.\n\nAmerica is a technological giant. We have a capacity to invent new  technologies. By the way, the Chinese are just on the HOV lane of new  technologies for the vehicles…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691549/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…discover these archeological resources until they go to drill.\n\nHere is what happens when they find out at that point: It forces  costly delays for their friends in the oil industry because, regardless  of whether this survey work is completed beforehand, companies still  have to comply with laws that protect shipwrecks and mitigate impacts  to sites…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688632/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…than it was about drugs. It was about oil.\n\nJust yesterday, the Secretary of Energy said that the United States  intended to maintain significant control over Venezuela's oil industry,  including by overseeing the sale of the country's production  indefinitely--indefinitely--and Donald Trump has promised to use the  revenue from these oil sales to create…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698678/venezuela"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…not  Venezuela. We need jobs here, not in penny-wage havens.\n\nIt is clear that the President deployed the U.S. Navy to the Gulf and  the Atlantic to take over Venezuela's oil industry. Both China and  Vladimir Putin's close relations with Venezuela have been a regional  concern, but we don't need to take over old, broken-down former  platforms for oil…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698837/reflecting-on-impact-of-illegal-action-in-venezuela"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "Mr. MARKEY. Mr. President, I also rise today to oppose the effort to  open up the Arctic National Wildlife Refuge to permanent, irreversible  damage from the Big Oil industry.\n\nThis effort to overthrow the Biden administration's Record of  Decision for the management of the Arctic Refuge through the  Congressional Review Act process will sow…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697516/hj-res-131"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…double the need for electricity in our country.\n\nAnd what this bill will do is take wind and solar and batteries off  the field and then say to the natural gas industry and oil industry:  You figure out how to get it done.\n\nBut that is not what, obviously, people in our country want. They are  making decisions that have resulted in 2024 with 94 percent…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692644/one-big-beautiful-bill"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…burdened taxpayers with an additional $2 billion in national debt.\n\nWhy? Well, because the Arctic is one of the most expensive places on  Earth to drill, and investors in the oil industry know this. In fact,  BP and Shell already abandoned their Arctic proposals, even paying to  exit those leases. Financing has dried up completely, with nearly every  major…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696880/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…that nothing is going on here, nothing new is going on  here, no precedent is being set here because it is; and that is to  eliminate the filibuster in the service of the oil industry--in the  service of the oil industry.\n\nWhether it is an attack on the GAO or the Parliamentarian, the new  ground we find ourselves in today is dangerous, both in the effects…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691452/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…ever being enacted  in the future. Counter to some arguments, this rule is not financially  burdensome.\n\nBOEM reports the total annualized financial impact for the entire oil  industry is less than $400,000 a year. For an industry with a reported  pretax profit of $83.9 billion in 2024, this has a negligible impact.\n\nThe rule does not negatively impact…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688635/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…campaign in exchange for favorable treatment when he  became President.\n\nNow, he has already given them a lot of favorable treatment, but,  boy, this would be a coup--the oil industry having full access to the  world's largest petroleum reserves.\n\nBut, today, this morning, in our briefing, we did learn that there is  another objective.\n\nYes, Trump wants…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698610/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…This  is a dangerous new kind of nuclear option that dispenses with the  filibuster. But they would have us believe: only here, only when it is  necessary to cater to the oil industry. It is the oil exception to the  filibuster rule.\n\nNow, the nuclear option has been used over nominees in the past. And  there has been debate about doing away with the…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691621/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…imagine instability in Venezuela. In 2017, we had  protests on the ground. Back in the early 2000s, the then-government  had to fire or ended up firing 18,000 people in the oil industry  because there was a general strike. We have no idea and, certainly,  this President has no idea where this is going to go. He had no plan  going in, but we are all along…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698619/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…ecologically sensitive, culturally important, and incredibly remote  regions of the Arctic to oil and gas drilling.\n\nDrilling proponents have grossly overstated how much oil industry  interest there is in drilling in the Coastal Plain of the Arctic  refuge. The Arctic is an extremely remote and harsh environment  requiring specialized equipment and infrastructure,…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696832/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…Congressional Review Act to revoke California's waivers  that allow us to set our own vehicle emissions standards, Republicans  seem to be putting the wealth of the Big Oil industry over the health  of our constituents.\n\nWhat happened? You know, nearly 60 years ago, it was Republican  Governor Ronald Reagan who established the State Air Resources Board…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691454/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…Federal waivers to get the job done.\n\nBut I know that even after all this progress, the detractors will  fall back on the same tired playbook of excuses. We know that the big  oil industry sees California's clean cars and clean truck sales as  existential threats. California has made tremendous advancements not  just in technology but in markets, but that…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691620/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…3702(b) of title 46, United States       Code, is amended--\n\n(1) in the matter preceding paragraph (1) by striking       ``offshore drilling or production facilities in the oil       industry'' and inserting ``exploration, development, or       production of offshore drilling or production facilities in       the oil industry and non-mineral energy production'';…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}]