[{"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…are doing is absolutely stupid and  counterproductive. You don't even know what you are doing. You just  think: Oh, clean energy, let's just get rid of it. We will rely on oil,  gas, and coal.\n\nWell, there ain't enough oil, gas, and coal to fuel the world, and it  is more expensive to do it, Donald Trump. What the heck are you doing?\n\nThis is an American…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691671/budget-reconciliation"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…suspension of new offshore wind leasing and       a crackdown on permitting for onshore wind and solar projects       on federal land.\n\nPresident Trump has vowed to boost the oil-and-gas       industry, in part by cutting support for renewable-energy and       emissions-reduction initiatives. A key factor in the U.S.       downgrade was the ``One Big Beautiful…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696127/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…power can get online. We should do it all in  a way that is fair to American families paying the bills.\n\nThis bill does none of that. It simply gives a fast pass to Big Oil  and Gas, and I urge my colleagues to oppose the bill.\n\nMr. PALLONE.  Castor), the ranking member of our Energy  Subcommittee.\n\nMr. Speaker, the Energy and Commerce Committee has…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695754/guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…providing for congressional  disapproval under chapter 8 of title 5, United States Code, of the rule  submitted by the Bureau of Land Management relating to ``Coastal Plain  Oil and Gas Leasing Program Record of Decision.'' On rollcall vote No.  632, had I been present, I would have voted no.", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697695/vote-explanation"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…credits  and ending longstanding home energy efficiency tax credits.\n\nIf these aren't bad enough, they also add provisions to require the  accelerated sale of public lands for oil and gas drilling and to  rescind funding from the Greenhouse Gas Reduction Fund that protects  America from pollution and lowers the cost of energy bills.\n\nClimate change is real,…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691602/environmental-protections"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…the beginning of the Trump  administration, was producing more energy than at any time in the  history of the United States. Where is the emergency? We were producing  more oil, gas, and coal than at any time in the history of the United  States. Where is the emergency?\n\nEven more exciting to me because of its tremendous acceleration, we  were producing…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696123/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…law. It was signed into law as the National Appliance  Energy Conservation Act.\n\nNow, I am going to be honest with you, Ronald Reagan vetoed it the  first time because the oil and gas industry wanted him to veto it. And  that law ultimately did pass, and it covered 13 major appliances-- kitchen refrigerators, dryers, air conditioners, and, yes, commercial…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690527/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…the first place.\n\nMr. Speaker, why do Republicans want to roll this rule back? Well,  for one, my guess is that Republicans saw that it was a Biden  regulation on offshore oil and gas. If Biden did it, it must be bad.\n\nMy colleagues want to pick a fight with anything that Republicans  perceive to be a threat to Big Oil, even a minor rule that actually…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688632/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…lower  people's costs would include clean energy sources like wind and solar,  which this order deliberately excludes.\n\nSo what does this Executive order do? It lets big oil and gas  companies off the hook on following our environmental laws and  regulations. And those are the rules that make sure that you have clean  air to breathe and clean water…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688155/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…resolutions to  gut protections for clean air and public lands across the West, while  they prepare a reconciliation package next week that would open our  public lands to oil and gas drilling, selling them to the lowest  bidder, and repealing historic investments in climate and clean energy.\n\nTo think that just 55 years ago, a historic bipartisan people's…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690326/one-hundred-days-of-chaos-dysfunction-and-attacks"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…action. The emergency  declaration has nothing to do with energy dominance, but it has  everything to do with giveaways for Big Oil. Donald Trump is looking  out for the same oil and gas companies that he solicited for big checks  for years and years. His offer to them was: Give me your money. Get me  elected. I will let your companies run the show.\n\nI will…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696128/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…cosponsor of this resolution, which would overturn  President Trump's really sham energy emergency.\n\nAt a time when the United States is already producing record amounts  of oil and gas, the President wants to bypass laws and explore eminent  domain to fast-track fossil fuel projects--not alternate energy  projects, fossil fuel projects--and really not…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688190/sj-res-10"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…installation in our country in 2025 as we begin this debate in the  Senate over the reconciliation bill--over the tax policy for our  country.\n\nUnfortunately, it is why the oil and gas and coal industry, through  the Republicans, are using the budget bill to rig the game while  eliminating incentives that lower energy costs and reduce collusion,  but they…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692644/one-big-beautiful-bill"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…online faster.\n\nYes, we need more energy, but this comes at a time when they are, in  doing so, going to raise electric bills across the country because they  say it is only oil and gas. Forget about solar, wind, storage, all the  energy that is ready to come onto the grid.\n\nIt is another example of sacrificing the people's interests for the  special interests'.…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691593/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…really, what they are doing is  just hugging Big Oil because Big Oil hates clean energy because they  know clean energy eventually means the great reduction of polluting oil  and gas and what they put into our atmosphere.\n\nSenators Kaine, Heinrich, and all Democrats will continue to shine a  spotlight on Republican attacks on domestic energy in the weeks…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688168/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…which it uses to purchase advanced weaponry from abroad.\n\nSpecifically, this bill requires the President to impose full  blocking sanctions on, first, the state-owned Myanma Oil and Gas  Enterprise, also known as MOGE. This is the junta's single largest  source of foreign revenue, reportedly generating over $1 billion  annually.\n\nSecond, the bill requires…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699832/bringing-real-accountability-via-enforcement-in-burma-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…locked up more than 4 million acres of land in  North Dakota.\n\nAstonishingly, this RMP blocked coal leasing on 99 percent of coal  deposits in North Dakota and prohibited oil and gas leasing on an  additional 44 percent of Federal land.\n\nNorth Dakota is a top 10 coal-producing State and the number 3 oil  and gas producer in the Nation. According to State…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694908/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…is the most studied piece  of land in Alaska and one of the most resource-rich energy basins in  North America. Congress set this area aside specifically because of its  oil and gas potential, and Congress has twice mandated that it be  leased for energy development.\n\nYet in December 2024, in the final days of the outgoing  administration, the Department…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696831/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision"}, {"senator": "John Hoeven", "party": "Republican", "sentence": "…This new charge  can equate to an effective tax increase on natural gas on top of other  taxes of more than 5 percent.\n\nThis will have a disproportionate impact on small oil and gas  producers in my home State of North Dakota and across the country, many  of which already operate on thin margins and cannot afford the high  costs to comply with this…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688157/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "…production--as soon  as I get in front of a microphone, I have a tickle in my throat--by  restricting the areas that are open for use, withdrawing them from  mineral exploration, oil and gas exploration, and energy production.\n\nThe original intent of the Presidential proclamation authority in the  Antiquities Act was for the President to be able to move quickly…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689196/work-highlights-of-western-caucus"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…Americans. Even other countries depend on our energy sector.\n\nThis legislation, Mr. Chairman, will help us to continue to lead in  producing the cleanest, most affordable oil, as well as gas. Many of  the projects within this bill will advance many of President Trump's  goals. It is working. He is making progress. We are making progress.  His goal is to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694854/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…exactly why we are here.\n\nThe truth is because of the checkerboard nature of Federal land and  minerals across our State, this plan would close vast amounts of North  Dakota to oil, gas, and coal leases for future development.\n\nIn fact, it would lock up nearly 99 percent of North Dakota's Federal  coal acreage. That is more than 4 million acres. It would…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694907/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…Representative  Begich. This resolution overturns the Biden administration's actions to  prevent the great people of Alaska from accessing and responsibly  developing their abundant oil and gas resources on the North Slope.\n\nYet again, these actions were just another part of the Democrat and  President Biden's anywhere but America, any worker but American agenda.…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696829/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…fact, we have lost an estimated 1 million barrels of fuel per day due  to low refining capacity.\n\nThe Biden administration declared war on American energy by  suspending oil and gas leasing on Federal lands, delaying permits for  energy infrastructure, and canceling the Keystone XL pipeline.\n\nWith President Trump and House Republicans in charge, those…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697032/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…only the naval  value but the national value of the area. They have directed the  Department of the Interior to ``conduct an expeditious program of  competitive leasing of oil and gas in the Reserve'' to help boost our  energy security.\n\nWhat I just shared there is a word-for-word requirement from existing  Federal law, so this is what is in law: ``to…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696449/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…would also replace the outdated Presidential permitting  process with a clear statutory framework: the certificate of crossing.\n\nThis process will be overseen by FERC for oil and gas projects and by  the Department of Energy for electricity. It establishes firm timelines  for reviewing applications and puts subject matter experts, not  politicians, in…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695691/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…Energy is another area where House Republicans are working hard for  the good of our Nation. Kansans support an all-of-the-above energy  strategy that prioritizes American oil, gas, biofuels, and renewables.  This approach supports good-paying jobs, strengthens our economy, and  keeps prices affordable. Green New Deal policies that pick winners and…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698651/following-through-on-americans-priorities"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…rise today to urge my colleagues to  reject the Biden administration's sweeping plan to lock down nearly  half of the National Petroleum Reserve in Alaska to responsible oil and  gas development in contradiction to congressional mandates. I urge my  colleagues to support the Alaska delegation's joint resolution of  disapproval, S.J. Res. 80, to protect…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…enactment of this Act.\n\n(d) Conflict.--In the event of a conflict between the       deadline described in subsection (a) and a deadline under       section 115(h) of the Federal Oil and Gas Royalty Management       Act of 1982 (30 U.S.C. 1724(h)) or section 525(b) of the       Surface Mining Control and Reclamation Act of 1977 (30 U.S.C.       1275(b)), the…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691038/expedited-appeals-review-act"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…a great word to pay $10,000 more  for a car?\n\nCanada is also the leading provider of grain, livestock, meat, and  poultry. The United States imported $97 billion worth of oil and gas  from Canada last year. Canada is a major provider of cars, car parts,  steel, lumber, aluminum.\n\nThis amount of trading demonstrates that no American will be able to  avoid…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689478/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}]