[{"senator": "Brian Schatz", "party": "Democrat", "sentence": "…kind of self-contained grids. But our  challenge is, to meet the load, we need electrons. And we do the  dirtiest and most expensive thing, which is to light low-sulfur fuel  oil on fire to create electrons. That is just north of like, you know,  wood-burning stoves in terms of its efficiency. It is not a good way to  do it economically, and it is not…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699020/energy-costs"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "Mr. MARKEY. Mr. President, I also rise today to oppose the effort to  open up the Arctic National Wildlife Refuge to permanent, irreversible  damage from the Big Oil industry.\n\nThis effort to overthrow the Biden administration's Record of  Decision for the management of the Arctic Refuge through the  Congressional Review Act process will…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697516/hj-res-131"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…Russia's war economy; designating Russia a ``state sponsor  of terrorism'' if it fails to return those abducted children; shutting  down the Kremlin's shadow fleet transporting oil and gas to the  countries that are buying it and fueling Russia's war machine; and, in  fact, sanctions and even tariffs targeting those countries, focusing on  them because…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700241/9999"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…resources  to flow to Chinese factories on the other hand.\n\nThese are not hypothetical concerns. In June, the President posted  that hopefully China will be purchasing plenty of oil from the U.S.\n\nThen, after meeting with President Xi in October, the President said  that a very large-scale transaction may take place concerning the  purchase of oil and gas…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697080/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…MURRAY. Mr. President, I am beyond outraged that President Trump  would commit such a brazen act of war as he has done in Venezuela with  absolutely no notice, except to the oil companies and newspapers they  leaked it to. No consultation with Congress, no legitimate  justification for these unauthorized strikes, nor any kind of serious  long-term strategy.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698684/9999"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…bipartisan permitting package. They are the latest attempt  for President Trump and Congressional Republicans to roll back  protections for our environment so that their big oil and gas friends  can ``drill, baby, drill'' without consequence or punishment.\n\nRepublicans claim that H.R. 3893, the PERMIT Act, just cuts  unnecessary bureaucratic red tape.…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698075/opposition-to-permitting-bills"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…leaves us exposed politically and  economically.\n\nScorned allies could pull out or change their free trade agreements,  cause shortages in imported goods, including food and oil,  pharmaceuticals, and more. President Trump campaigned on bringing down  costs, but his very actions right now are indeed undermining the value  of the dollar and driving up…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687988/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…online, as his Energy Secretary has  acknowledged. Meanwhile, President Trump has invoked emergency powers  to fast-track dirty fossil fuel projects, primarily to reward the Big  Oil donors whom he reportedly asked to donate a billion dollars to his  campaign.\n\nThe fact is, energy prices are a real emergency for the American  people, and we need more energy…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696129/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…year, the purified water is thrown back  into the lake when it leaves the plant. That city throws into Lake Erie  the equivalent of a waste heat load of nearly 400,000 barrels of oil  annually. Think about that. That is waste heat that we, as a country,  could be capturing.\n\nThat is just one untapped location along just one great lake, Lake  Erie. Imagine…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694099/trumps-reckless-tariff-policies"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "Mr. COURTNEY. Mr. Speaker, last Friday, President Trump hosted a  meeting at the White House with all the major oil company executives  and members of his Cabinet to talk about Venezuelan oil.\n\nDuring the televised gathering, he veered off topic and rambled on  one of his pet peeves, wind…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698954/china-is-not-scamming-europe-and-united-states-on-wind-power"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…that installs and  operates undersea surveillance technology using sonar rays and pickets  to keep watch and detect malign activity. They protect wind farms  today. They protect oil rigs today. They protect U.S. maritime ports  today with the finest technology.\n\nMadam Speaker, Secretary Burgum and his staff at BOEM should review  its own prior investigation…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695066/halt-work-orders"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…emergency. That is the subject of today's floor action. The emergency  declaration has nothing to do with energy dominance, but it has  everything to do with giveaways for Big Oil. Donald Trump is looking  out for the same oil and gas companies that he solicited for big checks  for years and years. His offer to them was: Give me your money. Get me  elected.…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696128/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…bolstering sanctions enforcement and anti-evasion efforts. At the top  of the effort to control the evasion of sanctions, we should be working  with allies to combat the illicit oil trade, including efforts to go on  the offensive against the so-called ghost fleet of aging tankers Russia  employs to facilitate the export of oil and other sanctioned goods.…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688332/ukraine"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…Khalifa       Haftar.\n\nIn exchange, the Government of National Unity envisions       boosting business and investment ties--particularly regarding       Libya's vast reserves of oil--with an administration known       for its deal-based transactional foreign policy. The Libyan       authorities also aim to solidify security ties that may       bolster NATO's…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697384/recognizing-the-importance-of-libyas-return-to-stability"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…veterans and their  families.\n\nIn 1982, Tim joined the U.S. Air Force, where he was deployed to  Saudi Arabia during Desert Storm. There, he was exposed to toxic burn  pits and oil well fires purposely set by Iraqi forces.\n\nThe Department of Defense estimates 3.5 million service members were  exposed to toxic burn pits during their time serving abroad.…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696713/recognizing-tim-hauser-as-the-champion-of-the-week-for-ohios-13th-congressional-district"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…plain, is the most studied piece  of land in Alaska and one of the most resource-rich energy basins in  North America. Congress set this area aside specifically because of its  oil and gas potential, and Congress has twice mandated that it be  leased for energy development.\n\nYet in December 2024, in the final days of the outgoing  administration, the Department…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696831/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…which it uses to purchase advanced weaponry from abroad.\n\nSpecifically, this bill requires the President to impose full  blocking sanctions on, first, the state-owned Myanma Oil and Gas  Enterprise, also known as MOGE. This is the junta's single largest  source of foreign revenue, reportedly generating over $1 billion  annually.\n\nSecond, the bill requires…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699832/bringing-real-accountability-via-enforcement-in-burma-act"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…from pastures to sagebrush to  majestic mountains, our small business landscape boasts a robust  variety of services and industries. We have small businesses catering  to the oil and gas industry and mining and energy, and we have boutique  shops that make up our incredibly vibrant downtown areas. We have  international businesses, like Brunton, within…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690788/big-beautiful-bill"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…Forces for 21st  century threats by properly funding our military and funding the Golden  Dome.\n\nH.R. 1 ends the progressive left's war on American energy by  unleashing domestic oil, natural gas, and nuclear energy production.  H.R. 1 lowers energy costs, ensuring reliable and stable energy  sources. H.R. 1 renews not just energy independence but makes…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693210/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…I was a kid, I guess, in  the 1970s--I remember gas lines and having to push my father's car to  get gasoline. At the time, everybody said we were going to run out of  crude oil. That was the thing, running out of crude oil.\n\nI appreciate the gentleman bringing up the crude oil issue. It is  actually because of the ingenuity of the American people that…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697031/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…to report that the bill permanently  locks in low taxes for working families; provides additional tax relief  for seniors; and protects generational family farms, family-run oil and  gas companies, and other family-owned businesses with enhanced death  tax relief.\n\nIn Shackelford and Hockley Counties, folks said that it is about time  that we put a…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694789/promises-made-promises-kept"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…Just 1 year ago, I was sworn in to the 119th Congress and welcomed as  one of the two new members of the Washington congressional delegation.  If you are wondering why I have an oil painting of a baby chick next to  me right now, I will tell you that it is about one of the most charming  traditions of our Washington delegation.\n\n``The Chick'' was bought…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698645/tax-relief-for-working-families"}, {"senator": "Maria Salazar", "party": "Republican", "sentence": "…thriving. Grenada is thriving.\n\nOnce Maduro is gone and order is restored to the country, it will be  the most prosperous country in Latin America, having the largest  reserves of oil in the world, which will give them enough resources not  to depend on the charity of the United States or any other country to  fix the destruction that Maduro wrought.\n\nMr.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698241/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…American energy hits American families who use the energy  to heat their homes. It was mandated by the Democrats' reckless tax- and-spending bill. The Democrat tax penalizes oil and gas production in  America, and in doing so, it punishes American families.\n\nThe golden age of American energy is the foundation of our golden age  for America. It is linked…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688189/energy"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…Domestic LNG Potential Act of 2025. I am proud to be an  original cosponsor of this very important legislation.\n\nThe United States is already the world's leading producer of oil and  natural gas and also the top exporter of LNG. A whole lot of that  energy comes straight out of my district in the great State of Texas.\n\nThat is why it is long past time…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697084/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…Representative Pfluger.\n\nFor years, America has been blessed with abundant natural gas. In  Texas, we have been at the heart of it all. We are the world's number  one producer of oil and natural gas and the top exporter of LNG. That  didn't happen by accident. It happened because American workers,  American innovators, and American energy producers were…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697091/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…carefully       select areas within existing federal lands and define them as       wilderness--areas would be off limits in perpetuity to roads,       timber harvesting, mining and oil/gas exploration and other       commercial activities--and, more importantly in today's       culture, all motorized vehicles: no ATV's or 4-wheelers. But,       man himself…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691095/flatside-wilderness-additions-act"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…percent of the United States'  landmass. We have more than half of the United States coastline, and it  is estimated that we have more undiscovered estimated natural gas and  oil resources than any other State in the country.\n\nWe have nearly every critical mineral on the critical minerals list  in Alaska. We have base metals, precious metals, and of…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689194/work-highlights-of-western-caucus"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…congressional disapproval under chapter 8 of title 5, United       States Code, of the rule submitted by the Bureau of Land       Management relating to ``Coastal Plain Oil and Gas Leasing       Program Record of Decision''.\n\nSec. 3. Upon adoption of this resolution it shall be in       order to consider in the House the concurrent resolution (H.…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696900/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision-providing-for-consideration-of-h-con-res-denouncing-the-horrors-of-socialism-providing-for-consideration-of-hr-unlocking-our-domestic-lng-potential-act-of-providing-for-consideration-of-hr-researching-efficient-federal-improvements-for-necessary-energy-refining-act-providing-for-consideration-of-hr-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-providing-for-consideration-of-hr-district-of-columbia-cash-bail-reform-act-of-and-for-other-purposes"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…due to  its vast energy resources. In 1980, Congress amended the act and  directed the Secretary of the Interior to conduct ``an expeditious  program of competitive leasing of oil and gas in the National Petroleum  Reserve in Alaska.''\n\nIn 2020, in President Trump's first administration, the Bureau of  Land Management released its IAP for the NPR-A. The…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696834/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision"}]