[{"senator": "Joe Courtney", "party": "Democrat", "sentence": "…enough level of volume to maintain       that proficiency,'' Kramer said. ``And if it becomes a       service that is too expensive to offer, we've got to think       about, `Okay, is this something that we should partner with       somebody else who has larger scale to provide it?' ''\n\nWhile the federal changes directly impact people who get       coverage…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694776/congress-long-to-do-list"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…have an obligation to do this. I don't think that  we should stand by, we, meaning the people who agree with me. People  who don't agree, they will do what they do. That is okay with me.\n\nI am going to vote my conscience. I ask others to vote theirs. Just  vote your conscience, that is all I ask. If we vote our conscience, I  hope that in the end, maybe…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700075/black-history-stolen-legacies"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…very complex issues.\n\nI remember standing on one of the levees, and you were talking about  your rice field. I said, Doug, let me talk about my cows in my fields.  He said, Okay, you go ahead, but I am going to go first.\n\nYou shared your knowledge with me and with others. You were good. You  were really good at the work you did for your people. You…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698742/9999"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "…American people are calling for leadership. They are calling for  solutions to help them afford basic necessities. They want to be able  to tell their loved ones it is going to be okay, but they are not  getting that right now, especially in the Black community.\n\nInstead, they are getting political theater about renaming the Gulf  of Mexico and military parades.…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690634/trumps-first-100-days"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…relationships, Mr. Chairman,  that you can get directly from the President of the United States. When  he was talking about Kim Jong-un, here is what he said: ``We fell in  love, okay? No, really. He wrote me beautiful letters, and they're  great letters.'' We are in love.\n\nThat is Kim Jong-un. You can also talk about him and Xi, where  fentanyl is coming…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698456/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…richest nations in Africa that has still yet to rebound       from its pre-2011 economic performance.\n\nAlftise said that ``there is still a big hope that things       will be okay,'' though he acknowledged a wave of nostalgia       for Qaddafi's rule, fueled largely by social media and       foreign outlets. In response, he said, ``we're trying to tell…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697384/recognizing-the-importance-of-libyas-return-to-stability"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…Foundation is putting an  even brighter light on what those numbers are, saying that probably  that most people will just see an actual doubling of their premiums.\n\nSo how can it be okay to--and even if you thought, ``Well, okay, 5  million Americans, they are just going to be short changed. No  problem.'' It is not that. It is when those people don't have health…", "date": "2025-10-01", "source_url": "https://justfacts.votesmart.org/public-statement/1695964/en-bloc-nominations"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…about Chappie  James. How can that be an insult? There is no insult to my children to  learn about Jimmy Doolittle. Why is it an insult to learn about Chappie  James?\n\nWhy is it okay for everybody to enjoy the baseball skills of Jackie  Robinson? It is all right to put his contributions to sports in books.  Before Jackie Robinson ever set foot on Ebbets…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699863/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…that  transaction from the interest earnings alone. That is Abu Dhabi's  money.\n\nMore concerning, by passing this bill, Congress will be telling the  world that Congress is okay with corruption, okay with foreign  companies buying influence, and okay with criminals buying Trump coins  to seek pardons and beneficial treatment.\n\nEach of my colleagues…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693839/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…gamble with New Jersey or other coastlines. I think about it like a  slot machine on the Atlantic City boardwalk: We will just hope that the  storm doesn't come, and we will be okay.\n\nMr. Chairman, that is not what happens. The reality is that places  like the Jersey shore need protection from the next big storm and  making drastic cuts like these are simply…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694863/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "…including myself, breathe it  after watching colleagues and public figures gunned down in front of  their families.\n\nThis is the America we are living in right now, and this is not okay.  We don't need to agree with someone's politics to say that their murder  is a tragedy. The assassination of Charles Kirk, the murders of  Minnesota House Speaker Melissa Hortman…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695714/calling-for-empathy-in-the-face-of-tragedy"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…voices that are  emanating from communities of color in the State of Texas. It is  racist.\n\nNow, in this country there seems to be a problem with people saying  ``racism.'' It is okay to say ``anti-Semitism,'' but don't say  ``racism.'' Racism has not received the same amount of  acclaim when it comes to dealing with racist issues that anti-Semitism  has…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694163/racism-infused-in-texas-politics"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…and I asked him if he had heard anything about wokeism  or what does woke mean?\n\nJim looked around the room. He was a little cautious, and he said:  Well, woke means we are okay with Elmo.\n\nI didn't realize that the Republicans had actually broken the code,  and that anyone who is okay with Elmo has to be suspect of wokeism.\n\nHe further said to me:…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693050/defunding-sesame-street"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…colleagues that is watching  us in the Chamber, we invite you down so we can have a debate, a  discussion on DEI and stop the polarization and racializing this. They  find it okay.\n\nMr. Pete Hegseth finds it okay to resurrect the name of Ku Klux  Klansman General Bragg, Fort Bragg, but yet you take down the name of  Jackie Robinson. And you are not done…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690321/ending-of-dei-programs-through-executive-order"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…or she is not going to subject her most precious  judicious thoughts to the whims of a President who is reckless,  ruthless, and lawless. That is what you want to believe.\n\nOkay. Well, maybe that takes care of the judges, Congressman Green,  but what about Members of Congress? He is just threatening them.\n\nRemember, we had a Member of Congress who was…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698076/liberty-and-justice-for-all"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…worker but the  American worker when it comes to mining. Anywhere but America, and any  worker but the American worker.\n\nThey are exporting their environmental guilt. They are okay with  getting these critical minerals mined by child slave labor.\n\nMr. Speaker, 30 percent of the cobalt comes from child slave labor.  Both the Trump and the Biden administration…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699694/critical-mineral-dominance-act"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…other side of the aisle say today  that we are just catering to Big Oil and others.\n\nThen I hear there were discussions with larger folks, and those are  the people who are okay with it. I hear from Representatives from  places like Alaska, North Dakota, and Texas whose constituents  oftentimes are small mom-and-pop operations. It is hard to think of…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688182/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Rudy Yakym III", "party": "Republican", "sentence": "…first time, we saw our child, who, at that time, was about  the size of a peanut. Half of that peanut was a heartbeat. Most  importantly, they assured us that our child was okay and would be just  fine.\n\nWhen we went to leave, I had just one question for them: How much do  we owe you? They looked at us and they said: Guys, the services that we  provide…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699232/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…``Hey, guys, the greatest  threat to your Republic is actually the math''?\n\nThis group hates something Donald Trump does. Our side doesn't like  some of the things they do. Okay, great. The lack of civility is  crushing. However, one of my personal theories is the reason you just  had a 40-something-day shutdown, Mr. Speaker, is that it is not like…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697051/facing-fiscal-reality"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…trying to see what is coming in in custom  duties. That is the tariffs. What is that offsetting? You will see me  over the coming weeks with a couple of charts and start saying: Okay,  here is what we have to plug into our models. For everyone who has been  whining around here, here is your math problem. I wish they would start  the whining with telling…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691518/truth-telling-with-math-and-facts"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…art, but I am trying to find where this  heresy, these cuts are.\n\nThere is a discussion here that basically says we need not to just  purely stick this on the debt and deficit. Okay.\n\nIn the Energy and Commerce instruction, I think it is 4 percent of  the area of authorization, you are telling me after the hundreds of  hours idiots like me have come behind…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688035/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…substantially unreadable, but I wanted to  actually just show it for the fun of it. This is one of the things that  we use in our economic shop, where we try to actually say: Okay, here  is 1 year. If it went up \\1/2\\ percent, that 1 year costs $206 billion  over 10 years. It is basically a table that says that if interest rates  pop up this much, and…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699257/debt-deficits-and-demographics"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…some of the things that are in here, but  I really want to offer legislation to pay for it because I think there  are some eloquent things we could do to offset. The deal was, okay, go  ahead. See if you can get anyone to sponsor it and vote for it.\n\nWe have been chasing for over a year. Go read The Wall Street Journal  articles, the MedPAC report--the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694915/facts-and-math"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…only U.S. citizens are voting in U.S. elections. Mr.  Speaker, it is about enforcement of the law. I ask my colleagues across  the aisle: How many noncitizen votes should be okay?\n\nThe answer to me and my colleagues on this side of the aisle is zero  because every noncitizen that votes in a Federal election in the United  States of America cancels out…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690007/safeguard-american-voter-eligibility-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…child will be the first generation to live poorer than his mommy  and daddy. Great job, America. This is our morality.\n\nPeople will say: ``No, it is going to be great.'' Great. Okay. I hope  it is great. Tell me how I do it in the math. Walk me through the  economics. Walk me through what we are going to do to maximize GDP  growth or what we are going to…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693062/stop-bathing-in-folklore-and-start-bathing-in-math"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…They  wanted just stability.\n\nAs foreign governments and foreign central banks are getting rid of  U.S. debt, bond markets, hedge funds, and others are the ones buying  it. Okay. Wonderful. We have people buying our debt.\n\nBut do you see the problem? These are traders. If there is a carry  trade, if there is an opportunity to make a spread, if there…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699674/united-states-fiscal-situation"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…top  IT university in the entire world with 500,000 data points. Across 17  miles of river, it was determined that dredging needed to happen, so  the Corps of Engineers said: Okay, we need $50 million to accomplish  this.\n\nI got them the $50 million. They have been sitting on that money, Mr.  Chair, for 4 years, and we have had enough. I believe the Corps…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694867/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…Haiti. This is rich. They are angry  that we are cutting that money off, but those same Democrats who are  going to vote ``no'' on that will oppose voter ID in America. They are  okay with voter ID in Haiti, but they are against it in America.\n\nI will continue.\n\nThey keep talking about Sesame Street. $3 million was going to Iraqi  Sesame Street. Again, if…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693719/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…because there is a limit to what a  society should have to take.\n\nIf you are going to say crazy things, then there can be a consequence  to saying those crazy things. That is okay.\n\nNo, it is not interfering with your First Amendment rights to say  that you cannot engage in effecting a conspiracy to foment violence-- including, by the way, the riots in…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695719/highlighting-flawed-policies"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…we are seeing it happen.\n\nThis is among Americans in our country. These are our neighbors.  These are people right here in every town who somehow think that,  suddenly, it is okay. Now, there unfortunately has been a death.\n\nThe death that happened recently is so tragic and unfortunate. Ms.  Good, who lost her life, she could have protested peacefully…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698925/ice-under-attack"}]