[{"senator": "Zoe Lofgren", "party": "Democrat", "sentence": "…rise in strong support of H.R. 1326, the  ``DOE and USDA Interagency Research Act'' which I was proud to  introduce alongside my colleague and friend, the gentleman from  Oklahoma, Mr. Lucas.\n\nH.R. 1326 is a bipartisan bill that would authorize cross-cutting and  collaborative research and development between the Department of Energy  and the U.S. Department…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689015/doe-and-usda-interagency-research-act"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…to the biggest banks to make sure that  they could pay their workers in good times or bad.\n\nThere have been at least 37 bank failures since 2007, including a  recent one in Oklahoma, that were too small for regulators to use  emergency tools, and unlike Silicon Valley Bank's customers, small  business depositors lost money through no fault of their own.…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699862/bringing-the-discount-window-into-the-21st-century-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…overall of clean energy job growth?  Idaho, Texas, and New Mexico--two out of those three States represented  by Republicans in the Senate. For wind energy, it is Texas, Iowa,  Oklahoma, Kansas, and Illinois--four out of five States represented in  this Senate by Republicans. For solar energy it is California, Texas,  Florida, North Carolina, and Arizona--three…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688159/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Ruben Gallego", "party": "Democrat", "sentence": "…Department to release  these files. It is that simple. If there is nothing to hide, then come  out and prove it.\n\nRes.\n\nMr. GALLEGO. Mr. President, in response to the Senator from Oklahoma,  the reason we are here, the reason why there is a request of this  nature is because there is one and only one administration and one  campaign that ran more than 8 years…", "date": "2025-07-24", "source_url": "https://justfacts.votesmart.org/public-statement/1694235/9999"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…this bill passes, MSU will lose.\n\nBut Michigan State University is not alone. Institutions across the  country in States like Kansas, Alabama, Mississippi, Texas, Louisiana,  Oklahoma, North Carolina, and many more will also have their vital  research projects canceled.\n\nForeign assistance is designed to prevent the need for more costly  interventions down…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693590/rescissions-act-of-2025"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "Mr. Speaker, I am rising in support of the DOE and USDA Interagency  Research Act, H.R. 1326.\n\nI thank the gentleman from Oklahoma (Mr. Lucas), again, our former  committee chair, for reintroducing this legislation alongside the  gentlewoman from California (Ms. Lofgren), our ranking member of the  Committee…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688982/doe-and-usda-interagency-research-act"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…wife their lawyer's number. And then, as the judge  put it, they seem to have ``deported a U.S. citizen with no meaningful  process.''\n\nNow we are hearing about a family in Oklahoma--U.S. citizens who  recently moved in who had their home raided by ICE. A mom and her  daughters were forced out of their house in the rain in underwear. ICE  agents seized…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690540/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Bill Keating", "party": "Democrat", "sentence": "…the  bottom of the ship in the boiler room when the attacks began. Although  he could not see the strikes, he could feel and hear the vibrations as  the USS Arizona and USS Oklahoma were struck. Understanding the urgency  of the situation, Johnson and his fellow shipmates quickly got to work  to repair the boiler. In less than 40 minutes the USS St. Louis…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696706/recognizing-freeman-johnson"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…was living legally in the United States,  was wrongfully disappeared to a horrific prison in El Salvador because  of an administrative error.\n\nThis week, U.S. citizens in Oklahoma were dragged out of their home  while ICE agents, with no warrant for them, took their phones, laptops,  and life savings, even though they weren't the suspects in question.…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690511/trump-immigration-policies"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…to pull up a couple of things on gas  prices since they are blaming President Trump for it. They are correct.\n\nIn Worcester, the gas price is $2.91 a gallon on average. In  Oklahoma, it is $2.21. In Wyoming, it is $2.22. In Texas, it is about  $2.23. In Georgia, it is about the same thing.\n\nDo my colleagues know what the difference is? We all have Republican…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699220/providing-for-consideration-of-hr-supporting-pregnant-and-parenting-women-and-families-act-providing-for-consideration-of-hr-pregnant-students-rights-act-and-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…The cost to those voters would be $37.7  million to get passports.\n\nWilliams), my dear friend.\n\nMr. Speaker, I hate to disagree with my dear friend, the gentlewoman  from Oklahoma (Mrs. Bice), but the words ``marriage certificate'' do  not appear anywhere in the SAVE Act. In fact, it could have been  written in that way since Republicans are adding…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690001/safeguard-american-voter-eligibility-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "Mr. MERKLEY. Mr. President, I missed the conversation on the floor--\n\nMr. MERKLEY. Thank you, and thank you to my colleague from Oklahoma.\n\nThe issue we are addressing needs to be addressed. The nomination  process is entirely broken. People are sick and tired of bringing their  expertise to the Senate and basically…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695308/cloture-motion"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…to introduce the Law  Enforcement Training for Mental Health Crisis Response Act of 2025.  This bill is a bipartisan effort alongside with Congresswoman Stephanie  Bice of Oklahoma. Our goal is to ensure our officers have the tools  they need to effectively and safely respond to mental health  emergencies.\n\nEvery day, law enforcement officers across…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689347/help-our-country-become-a-safer-healthier-place-for-all"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…1713, encourages more permanent, coordinated  communications between those who focus on agriculture and our national  security experts at CFIUS.\n\nI commend the gentleman from Oklahoma for his work on the committee  on so many different issues. I urge my Republican colleagues not only  to support this bill but to support the activities of the Department…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692798/agricultural-risk-review-act-of-2025"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…communities will feel the pain of this change too. Our  universities, not just in blue States but in every State--great  research institutions in Alabama, Kansas, Louisiana, Oklahoma--will be  unable to pursue more cures. Our hospitals, already scaling back  operations thanks to budget cuts and the President's so-called ``Big  Beautiful Budget Bill,''…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698206/nih-funding"}, {"senator": "Barry Loudermilk", "party": "Republican", "sentence": "…for his service to Georgia's 11th Congressional  District, the State of Georgia, and the United States of America.\n\nMr. Bart Mitcham was born on December 24, 1945, in Ada, Oklahoma, to  John and Virginia Mitcham. Bart's parents both served in the United  States Navy during World War II, with his father serving as a naval  aviator on the USS Hornet during…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698432/republicans-have-delivered-in-2025"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "Mr. SULLIVAN. Mr. President, I want to compliment my friend and  colleague from Oklahoma. The One Big Beautiful Bill does have a lot of  really  good stuff in it. I think, to be perfectly blunt, my State probably has  more good stuff in it than anyone. So I am…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693700/one-big-beautiful-bill-act"}, {"senator": "Kevin Hern", "party": "Republican", "sentence": "Mr. HERN of Oklahoma. Mr. Speaker, I rise today to congratulate Holy  Trinity Greek Orthodox Church on its centennial anniversary.\n\nEstablished in 1925, this parish has served Tulsa and the Greek…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690557/holy-trinity-greek-orthodox-church-centennial-celebration"}, {"senator": "Gary Palmer", "party": "Republican", "sentence": "…Corps  of Cadets, which is the highest ranking cadet in the Corps of Cadets'  chain of command.\n\nSecond Lieutenant Robinson will now report for active duty at Fort  Sill, Oklahoma.\n\nI am proud of Caroline and her desire to serve our Nation as an  officer in the United States Army. I know she will serve our Nation  with great distinction and honor.", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692105/congratulating-vincent-high-school"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…be a woman undressed in  the women's restroom and exposed himself to shoppers.\n\nIn Virginia, a girl was sexually assaulted by a biological male in a  woman's bathroom.\n\nIn Oklahoma, a young woman was beaten for daring to say she was  uncomfortable sharing a bathroom with a man.\n\nThis is not theoretical. These aren't just random incidents. This is  an…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695260/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…is redirected to critical infrastructure needs. This  is welcome news for taxpayers across the country.\n\nFinally, and most importantly, this bill delivers direct wins for  Oklahoma's Fifth District, including fully funded runway improvements  at the Chandler and Shawnee Regional Airports and critical electric  grid upgrades in Edmond, Oklahoma.\n\nMrs.…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699326/consolidated-appropriations-act-2026"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…career, he rose to the rank of Sergeant First  Class, serving in diverse and demanding environments across the globe.  After completing his initial training at Fort Sill, Oklahoma, he was  assigned to the 4th of the 11th Field Artillery at Fort Richardson,  Alaska, where he excelled in missions from the icy glaciers of Whittier  to international operations…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691145/recognizing-sergeant-first-class-leidlein-as-may-2025-veteran-of-the-month"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "Mr. BARRASSO. The following Senators are necessarily absent: the  Senator from Kentucky (Mr. McConnell) and the Senator from Oklahoma  (Mr. Mullin).\n\nThe result was announced--yeas 90, nays 8, as follows:                        [Rollcall Vote No. 428 Leg.]                                  YEAS--90…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694208/military-construction-veterans-affairs-and-related-agencies"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…instill truth and justice.\n\nAfter retiring from the bench in 2014, Judge Ginn transitioned to the  business world as he purchased a struggling horizontal pump company in  Tulsa, Oklahoma. Over the next 3 years, with the help of key employees  and through exemplary leadership, he managed to turn the business into  one of the largest privately owned horizontal…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688470/recognizing-phil-ginn"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…The Nittany Lions won 46-0, performing in front  of a sellout crowd of more than 6,000 fans.\n\nThe team broke the NCAA Division I record in December, which had been  held by Oklahoma State University since 1951. The Nittany Lions are led  by Coach Cael Sanderson, who has been with the team since 2009.\n\nMr. Speaker, congratulations to the Penn State wrestling…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699135/recognizing-pennsylvania-state-wrestling"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "…infrastructure achievements for the region.\n\nMr. Greer has also demonstrated a lifelong commitment to professional  growth and excellence. He is a graduate of the University of Oklahoma  Economic Development Institute, completed coursework at Georgia Tech,  and attended the Intensive Economic Development Course at Auburn  University. He is also a graduate…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699608/recognizing-mr-dale-greer"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…his district.\n\nThe Ouachita National Forest is the oldest and largest national  forest in the Southern United States, spanning nearly 1.8 million acres  across Arkansas and Oklahoma.\n\nManaged by the U.S. Forest Service, it is a true multiple-use forest,  supporting timber harvesting, wildlife conservation, and a wide range  of outdoor recreation opportunities,…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691096/flatside-wilderness-additions-act"}, {"senator": "Kevin Hern", "party": "Republican", "sentence": "Mr. HERN of Oklahoma. Madam Speaker, by direction of the Republican  Conference, I offer a privileged resolution and ask for its immediate  consideration.\n\nThe Clerk read the resolution, as follows:…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694034/electing-members-to-certain-standing-committees-of-the-house-of-representatives"}, {"senator": "Ken Calvert", "party": "Republican", "sentence": "Mr. CALVERT. Madam Speaker, I thank my good friend from Oklahoma,  Chairman   Tom Cole, for a job well done.\n\nMadam Speaker, I rise today in strong support of the Senate amendment  to H.R. 7148, which includes my bill, the Department of…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699578/consolidated-appropriations-act-2026"}, {"senator": "Frank Lucas", "party": "Republican", "sentence": "…House Financial Services Committee for two  Congresses now, and it is past time for it to become law.\n\nFrom Hawaii and Washington to New York and Florida to my home State  of Oklahoma, our Nation's agricultural land must be protected. That is  why a bipartisan group of Members from over 20 States across the  country have supported me in this effort.\n\nI…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692797/agricultural-risk-review-act-of-2025"}]