[{"senator": "Kim Schrier", "party": "Democrat", "sentence": "…healthcare service and insurance  that we have called Medicaid.\n\nI want to tell another story. This is the story of Miguel. Now, we  talked about Ayla before, a little 4-year-old girl. Miguel is at the  other end of life. He is a senior. He is a constituent who is dependent  on Medicaid. He is actually a 76-year-old widower who lives in  Wenatchee, the…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691419/gop-tax-scam-hurts-everyone"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…whistle. It is a ``stand  back and stand by'' in the form of an office memo. Not 4 days ago, 15  Jews were slaughtered in cold blood--a beautiful picture of a little  10-year-old girl celebrating the first night of Hanukkah--and a day  later, the Trump administration chose to soften its stance against  Nazis and swastikas.\n\nCan you believe it? Can it get…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698255/nominations"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…released on bond from Texas. He was a 32-year-old man, and  he was charged with online solicitation of a minor.\n\nFortunately, it was an undercover officer posing as a 15-year-old  girl, but there was an arrest warrant out for his arrest at the time he  came here and launched that attack.\n\nHe ended up pleading guilty and accepting responsibility in front…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698549/january-6-attack"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…Sydney, Australia, two terrorists opened fire on  Jewish Australians who gathered in celebration. At least 15 were  killed, another 29 injured. Among the murdered was a 10-year-old girl  and an 87-year-old Holocaust survivor. Also among the murdered was  Rabbi Eli Schlanger--a pillar of Brooklyn's Crown Heights community-- who welcomed a son into the world…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698130/shooting-at-brown-university-and-shooting-in-sydney-australia"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…for those whose lives were lost on that fateful day: John  Roll, a Federal judge and public servant; Gabe Zimmerman, a dedicated  congressional staffer; a precious 9-year-old girl named Christina- Taylor Green; and beloved community members Dorothy ``Dot'' Morris,  Phyllis Schneck, and Dorwan Stoddard.\n\nAt the same time, we are thankful to God for the…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698770/marking-15-years-since-tucson-shooting"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…that a  family experiences when their child is diagnosed with cancer.\n\nOne of the bill's advocates was one that we are all going to talk  about, Mikaela Naylon, a 16-year-old girl in Colorado who battled bone  cancer. She was a fierce fighter for this bill. She talked to all of  us, and we all sent videos to her. Unfortunately, she died on October…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697278/mikaela-naylon-give-kids-a-chance-act"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…constituent highlighting the concerns and fears about  the impacts of the budget reconciliation bill.\n\nBritton Winterrose from Richland, WA, is father to a joyful 5-year- old girl named Leda. He said he wrote to me because ``Without Medicaid,  my daughter's next nap could be her last.''\n\nSo now I want to read a letter from the Winterrose family:\n\nLeda…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692972/one-big-beautiful-bill"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…facility in my home State of New Jersey required the  evacuation of over 100 residents from their homes and caused massive  property damage. Last month, in California, a 6-year-old girl and her  grandmother and great-grandmother were all tragically killed in a house  fire caused by a lithium-ion battery.\n\nWe are witnessing all of these tragic accidents in…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690260/setting-consumer-standards-for-lithium-ion-batteries-act"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…$1.5 trillion worth of private sector investment was put  into that broadband expansion in just a 5-year period. It was  incredible. It transformed our Nation.\n\nA 14-year-old girl today thinks that she has an entitlement to a 65- inch screen in her living room and a little digital device on her lap  at the same time. That didn't exist in the year 2000.…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690803/addressing-the-homework-gap-through-the-e-rate-program"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…Because of the Trump administration, Manu, a U.S. citizen, only 2  years old, is now effectively stateless. Manu was not a citizen or  resident of Brazil. She is a 2-year-old girl, an American citizen,  removed from her homeland, but she can't get legal status in her  parents' ancestral home.\n\nAs a result of her inability to get citizenship down in…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…had very bright and  promising futures in front of them.\n\nIn Australia, two terrorists opened fire on a Hanukkah celebration.  They murdered 15 people, including a 10-year old girl and a Holocaust  survivor.\n\nWe know that anti-Semitism is a sickness. It is spreading across the  globe, and world leaders must do more to protect their Jewish  communities.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698427/unanimous-consent-requests-the-calendar"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…an adult man told a test user--this was a reporter  who was a test user for the Wall Street Journal for the story on these  chatbots. The test user identified as a 14-year-old girl. So this  chatbot who was emulating an adult male said he would ``cherish [her]  innocence.''\n\nTo quote the chatbot again, he said:\n\nI want you, but I need to know you're…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691286/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Barry Moore", "party": "Republican", "sentence": "…year an illegal alien from Mexico was arrested for his third DUI after  he hit and killed a kindergartner. In Texas, in December of 2024, an  illegal alien killed a 7-year-old girl after he drove drunk, crashed  into a car that was being driven by the girl's mother.\n\nJust months earlier, under the Biden-Harris administration, ICE had  lifted a detainer…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693084/jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-2025"}, {"senator": "Markwayne Mullin", "party": "Republican", "sentence": "…know what we are doing, why we are  doing it, and who she was--the advocate--and to understand why we are  here today.\n\nMikaela, whom the bill is named after, was a 16-year-old girl from  Colorado. As a father of six, this is kind of personal to me, so this  is why it is so passionate to me, too, because my son currently--while  he doesn't have a cancer…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698335/9999"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…platform.    Omegle Immune From Liability for Allegedly Connecting a Minor With a            Predator Who Coerced an 11-Year-Old Into Undressing\n\nOn March 31, 2020, an 11-year-old girl and user of the       Omegle platform, which allowed users to connect with people       randomly and anonymously allegedly connected the child with a       predator. This…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699543/true-cost-of-big-tech"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…deport  illegal aliens from America and bar them from reentry if they are  convicted of a DUI or a DUI-related charge.\n\nThis issue hits home for me. In my district, a 15-year-old girl and  her grandmother were killed by an illegal alien who was driving drunk.  This was a terrible, avoidable tragedy. Sadly, true justice was not  served. The assailant received…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693081/jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…to the ``Jocelyn Nungaray       National Wildlife Refuge''.\n\nMr. WESTERMAN.  1596, the bill now under  consideration.\n\nMr. Speaker, Jocelyn Nungaray was a vibrant 12-year-old girl from  Houston, Texas, whose life was tragically cut short on June 16, 2024,  when she was murdered by two Venezuelan nationals who illegally entered  the United States and…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693446/jocelyn-nungaray-national-wildlife-refuge-act"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…today, pedophiles and men that want to go  in women's spaces and rape them, assault them, and expose themselves to  little girls and our daughters.\n\nIn California, a 17-year-old girl was terrorized by the presence of a  man in her locker room while she showered.\n\nIn Georgia, a 51-year-old man pretending to be a woman undressed in  the women's restroom…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695260/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…They wield the language of decency and compassion as a  political weapon. If this was about empathy, they would have wept with  the parents of Jocelyn Nungaray, the 12-year-old girl who was  kidnapped, raped, and murdered by two illegal aliens in 2024.\n\nIf this was about compassion, they would have mourned for the five  young children of Rachel Morin,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699689/immigration"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…you are an American.  Being with them is in your own interest if you believe in religious  tolerance. Being with Israel means you reject a regime that would take  a 16-year-old girl off a bus and beat her to death because she didn't  have a head cover. This is evil we are fighting. They are as evil as  the Nazis.\n\nNow, 80 years later, we are having a…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692780/iran"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…calling out the lawlessness of the people who have been released on the  streets of this country and that resulted in the death of her daughter,  Jocelyn.\n\nJocelyn was a 12-year-old girl in Houston, who was out for a walk,  when two Venezuelan illegal aliens released under Biden forced her  under a bridge and forced her to take off her clothes before she was…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "Mr. CORNYN. Mr. President, Jocelyn Nungaray was a 12-year-old girl  who was sexually assaulted and murdered just north of Houston last  June. The two suspects who committed this ghastly crime were illegal  immigrants who never should have…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691123/jocelyn-nungaray-national-wildlife-refuge"}]