[{"senator": "Joshua Gottheimer", "party": "Democrat", "sentence": "…cheated out of their retirement savings. It is  appalling. It is offensive, and it is unacceptable.\n\nSenior scams have more than doubled since 2020. These senior scams  cost older Americans more than $36 billion a year, with the average  victim losing $34,000 from these crimes annually, not to mention the  pain you can't put a dollar amount on. What is worse…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693937/national-senior-investor-initiative-act-of-2025"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…insured financial firms responded. That is, on average,  25,000 complaints each week.\n\nThe Consumer Financial Protection Bureau helps servicemembers,  veterans, students, and older Americans. Mr. Speaker, they don't care  who you are. They help Republicans, Independents, and Democratic  consumers. The CFPB will not be able to help anyone if Trump and Musk…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689845/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…pass this dangerous budget blueprint       did not come easily, and we will make sure lawmakers know       that voting to enact these cuts would be voting to abandon       older Americans.\n\nThe National Alliance for Caregiving:\n\nThe House budget blueprint to eliminate at least $800       billion in Federal funding unfairly targets critical       healthcare…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…these  populations.\n\nBecause my colleagues blocked consideration of this resolution, I  want to take this opportunity to tell you more about what is at risk.\n\nThrough the Older Americans Act, the Administration for Community  Living runs senior centers and distributes more than 200 million meals  every year to older adults and people with disabilities…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690500/blocking-resolutions-of-inquiry"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…the aisle  will at some point actually decide to focus on the issues that matter,  to lift children up, not target them; to lift families up, not target  them; to lift older Americans up, not target them; to lift veterans up,  not target them; and to lift healthcare for everyday Americans up, not  target them. That is what House Democrats will continue…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692530/rescissions-act-of-2025"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…assault on the economy. It is an assault on Medicaid, an  assault on healthcare, and an assault on nutritional assistance to  children and families. It is an assault on older Americans and an  assault on hospitals, nursing homes, and community health centers. It  is an assault on veterans. That is why we reject it, because we are  going to stand on the…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689902/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…These are the air traffic controllers who make sure your flights land  safely, the workers responsible for sending Social Security checks out  the door for millions of older Americans, the national security experts  who keep our Nation safe from threats. These people are not loyal to  any party or President. They are career civil servants devoted to…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688591/recognizing-federal-employees"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "…implementing Medicaid expansion after a decade of political gridlock.\n\nMedicaid expansion has helped new moms and their babies during a  critical phase of life. It has supported older Americans living in  nursing homes. It has ensured that individuals with disabilities get  the care that they need.\n\nRepublicans want to roll back this progress to pay for tax cuts…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690766/opposing-republican-budget-plan"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "Ms. BONAMICI. Mr. Speaker, I rise today to recognize the importance  of the Older Americans Act nutrition programs.\n\nProviding nutrition assistance to seniors is one of the most fiscally  responsible actions Congress can take, and it is also the right thing…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699732/nutrition-programs-for-seniors"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…this commonsense legislation.\n\nMr. Speaker, I think this is a commonsense bill, and I am so happy  that our colleagues thought it appropriate to bring it forward to help  older Americans make better-informed decisions.\n\nAs I indicated, I have had friends who retired at age 62 and thought  that that would be a better time based on the misinterpretation…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697233/claiming-age-clarity-act"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…opposed to this  reckless legislation that Republicans bring to the House floor. It will  hurt everyday Americans. It will hurt children. It will hurt families.  It will hurt older Americans. It will hurt people that Republicans  represent in rural America and all while undermining American  leadership in the world.\n\nMr. Speaker, once again, this is unfortunate.…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693714/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…about whether benefits they paid for during their working       careers will continue. Social Security is the primary source       of income for about 40 percent of older Americans.\n\nTrump has said repeatedly that the administration ``won't       touch'' Social Security, a promise that aides say applies to       benefit levels that can be adjusted…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689130/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Mitchell's.\n\nIn Florida, the number of residents with healthcare coverage has  doubled since passage of the Affordable Care Act. In Alabama, tens of  thousands of children and older Americans have obtained health  insurance for the very first time because of the Affordable Care Act.\n\nWhy do we want to reverse this? Why do we want to put the waitress  that I…", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697576/department-of-defense"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…has a few  defects--such as the method of payment of certain specialists--then I  am confident those can be quickly remedied, and I hope they will be.\n\n``No longer will older Americans be denied the healing miracle of  modern medicine. No longer will illness crush and destroy the savings  that they have so carefully put away over a lifetime so that they…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…Democratic Senator Blumenthal for this very purpose.  This is a time to shed light on a crisis that too often remains in the  shadows.\n\nLast year, an estimated one in six older Americans experienced some  form of abuse in a community setting, whether physical, emotional,  financial, or neglect. For every elder abuse case that is reported, as  many as 24…", "date": "2025-06-16", "source_url": "https://justfacts.votesmart.org/public-statement/1692579/national-elder-abuse-awareness-month"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, as tax filing season begins, important  improvements to our tax code are already making a real difference for  older Americans. For too long seniors were treated unfairly, Mr.  Speaker, taxed on their Social Security benefits and left struggling to  cover rising costs.\n\nThat is finally starting…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700050/tax-policy-should-reward-a-lifetime-of-hard-work"}, {"senator": "Rick Scott", "party": "Republican", "sentence": "Mr. SCOTT of Florida. Mr. President, I rise today to recognize the  60th anniversary of the passage of an essential piece of legislation:  the Older Americans Act. As the chairman of the Senate Special  Committee on Aging and Senator from Florida, I am committed to honoring  and supporting the more than 59 million older Americans…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693849/recognizing-the-60th-anniversary-of-the-passage-of-the-older-americans-act"}]