[{"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…member  of the West Haven Irish American Club, a lifetime member of West  Haven's Elks Lodge 1537, and a former member of the Knights of St.  Patrick in New Haven, Connecticut's oldest continuously run Irish  society.\n\nI would be remiss if I did not also take this opportunity to extend a  personal note of thanks to Steve for his many years of friendship and…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689392/recognizing-the-honorable-steven-steve-dargan-west-havens-2025-irish-person-of-the-year"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…of Jeff Bezos, for donating $50  million to Bowie State University, the largest single contribution in  the school's history.\n\nBowie State University is not only Maryland's oldest HBCU; it is one  of our State's finest higher education institutions, period.\n\nMacKenzie Scott's generous gift will help make Bowie State University  even more affordable and…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698077/thanking-mackenzie-scott"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…agricultural workers in the fields, to warehouse employees, to  construction crews and factory staff, many are laboring in extreme heat  with no Federal protection from one of the oldest, most serious, most  common workplace hazards, and that is, of course, heat stress.\n\nThe science is clear, the medical evidence is overwhelming, and the  moral case is undeniable.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695655/extreme-heat-caucus"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…standards as every other law enforcement  officer in the United States of America.\n\nIf you don't understand the righteousness of that position, just  study the case of Narciso. His oldest son, a U.S. Marine veteran, said  in an interview: What we weren't prepared for and didn't prep him for  was these guys attacking him. We never expected anything like that.…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…happening. Dozens have already  lost their jobs. They want the United States to be a leader for good in  the world. They care about the image of the United States as the  world's oldest democracy. They are smart enough to know that abandoning  friends and allies is how you lose friends and allies.\n\nThe destruction of USAID and these other Agencies will reverberate…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688467/usaid"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…security partners to defend against a world war and  new threats of tyranny like that of Putin, North Korea, and Iran today.\n\nThat is why we have the European allies. They are our oldest friends  and partners and we share a love of liberty. Rather than stand united  as we have been for decades, the Trump administration has threatened  to--are you ready for…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691084/liberty-versus-dictatorship"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…every report       about what House Republicans are doing. We support anything       that can be done to maintain Medicaid. Please, Senator.\n\nDanielle, she writes:\n\nI am the oldest sibling to my two younger brothers, Matt       and Christian, who have been living with a rare neuromuscular       disease since they were diagnosed as babies. Throughout their…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…I support the underlying goals of this measure, I  must express concern over the majority's decision to offset its cost by  diverting pension payments from some of the VA's oldest and sickest  veterans.\n\nThe VA pension programs exist specifically to assist our most  vulnerable veterans and their survivors. Slashing these benefits,  particularly when…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689624/vietnam-veterans-liver-fluke-cancer-study-act"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…support of my Resolution to  recognize the month of March as ``Zoroastrian Legacy and Heritage  Month.''\n\nOriginating in ancient Persia, Zoroastrianism is one of the world's  oldest monotheistic religions. Its legacy includes significant  contributions to history and civilization, including influencing  democracy, universal human rights, and international…", "date": "2025-03-21", "source_url": "https://justfacts.votesmart.org/public-statement/1688922/introducing-a-resolution-to-recognize-march-as-zoroastrian-legacy-and-heritage-month"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "…days, thousands of miles and every       imaginable type of road, Bob Sanders is back home in Bend.\n\nThe 85-year-old just finished biking across the country,       becoming the oldest man to complete the feat from coast to       coast. Sanders started in San Diego and wrapped up his ride       in St. Augustine, Florida, relying on sheer determination and…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691375/recognizing-mr-bob-sanders-for-cycling-across-the-united-states"}, {"senator": "Jimmy Panetta", "party": "Democrat", "sentence": "Mr. PANETTA. Mr. Speaker, I rise to recognize the 50th anniversary of  the Santa Cruz Pride Parade, one of the oldest Pride events in the  Nation and the first of any small American city.\n\nSince 1975, Santa Cruz Pride embodies the spirit of resistance and  persistence. Even though it was California,…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692043/recognizing-santa-cruz-pride-parades-50th-anniversary"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…Episcopal Zion Churches in New York, Connecticut,  North Carolina, and Alabama. In 1992 he became the senior pastor at the  Wesley Temple Church in Akron, which is Akron's oldest Black  congregation.\n\nReverend Dr. Walker has been a faithful servant of God, the African  Methodist Episcopal Zion Church, and the Beth-El AME Zion Church where  he currently…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688261/recognizing-reverend-dr-curtis-theodore-walker-sr"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…are 2 years older. You are stronger.  You pop it.'' John struggled, and he couldn't pop it.\n\nHe then took it back, and he gave it to me. He said, ``Now, James,  you are the oldest. You are the strongest. You pop the string.'' I  struggled. I couldn't pop it.\n\nHe then took it back and placed it in his palm, and he began to rub  his hands together. The…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690244/health-disparities-in-minority-communities"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "Mr. LATIMER. Mr. Speaker, I quote: ``Political satire is one of the  oldest and most important forms of free speech. It challenges those in  power while using humor to draw more people into the discussion. That's  why people in influential positions…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695811/brendan-carrs-words"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "Mr. MORELLE. Mr. Speaker, I rise today to congratulate the Rochester  Community Players theater group on their 100th season.\n\nAs the second oldest continually operating community theater in the  State of New York and a part of the Little Theatre Movement in America,  their rich history dates back to 1925, with their opening…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689016/congratulating-rochester-community-players"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…voice for freedom abroad and for liberty at home. I couldn't be more  pleased to have him here today to speak on behalf of this resolution.\n\nMr. Speaker, Iran is one of the oldest and greatest civilizations in  history. It was one of the most free, advanced, prosperous, and open  countries in the Middle East just a few decades ago. Then, came the  revolution…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691210/supporting-a-free-democratic-and-secular-iran"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "Mr. THOMPSON of Pennsylvania. Mr. Speaker, I rise today to recognize  the 60th anniversary of the AmeriCorps Seniors Foster Grandparent  Program.\n\nThis is one of the oldest, most impactful senior service programs in  the country. Since 1965, foster grandparents, who are volunteers aged  55 and older, have provided consistent support, mentorship,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695216/recognizing-americorps-seniors-foster-grandparent-program"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…of Indians\n\nMr. BAUMGARTNER. Mr. Speaker, I rise to celebrate the 145th  anniversary of the Spokane Tribe of Indians, a proud milestone honoring  one of eastern Washington's oldest and most resilient communities.\n\nThe Spokane Tribe recently hosted its 1881 Powwow near Wellpinit,  bringing together families, dancers, and community members to mark this…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699649/recognizing-1984-walla-walla-high-school-girls-basketball-team"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…changing needs of Hernando County's business community. Guided by  its Pillars of Success--Advocacy, Marketing, Networking, and Training-- the Chamber has become the largest and oldest business organization in  Hernando County. Its influence has been recognized across the region,  including by the Tampa Bay Business Journal, which named it one of the  largest…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695644/recognizing-the-greater-hernando-county-chamber-of-commerce"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…doesn't like, your rights are in jeopardy.\n\nSound familiar?\n\nThe administration has gone after some of our Nation's best known,  longest established universities, among our very oldest--Harvard, Penn,  Duke, Brown, Columbia--revoking funding, conducting investigations,  shutting down partnerships, depleting their endowments, coercing  compliance.\n\nEven major…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699917/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…keeping the  marines the world's finest fighting force, which it is and has been for  decades. We take time to recognize not just the marines present but, in  particular, the oldest and youngest marines present.\n\nWe have a very solemn cake-cutting ceremony. In fact, after the  birthday cake is cut with a Mameluke sword, the guest of honor presents  the…", "date": "2025-11-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696624/recognizing-the-250th-anniversary-of-the-united-states-marine-corps"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "Mr. DOWNING. Mr. Speaker, this coming weekend marks one of the oldest  and greatest rivalries in all of college football, the ``Brawl of the  Wild.''\n\nSaturday, November 22, 2025, will be the 124th meeting between the  University of Montana Grizzlies…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696930/recognizing-the-124th-playing-of-the-brawl-of-the-wild-as-delivered-to-wake-up-montana-on-nonstop-local"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "Mr. BOST. Mr. Speaker, I thank Mr. Jordan for allowing me this time.\n\nMr. Speaker, I rise today to honor the Woman's Relief Corps, the  oldest national women's patriotic organization and the auxiliary to the  Grand Army of the Republic, which was our first VSO in the United  States.\n\nThis organization has a long history…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699501/moving-national-womans-relief-corps-incorporation-and-domicile-to-illinois-principal-office-to-murphysboro-illinois"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…handful  of huge databases. The problem is, they don't talk to each other.\n\nYou saw the story last week of, hey, we just looked at some of the  Social Security death files. The oldest person in America is, what, 114  years old? We took people over 114 years old and then wondered how they  were getting loans at the Small Business Administration.\n\nForgive…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689025/tell-the-truth-about-math"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…Speaker, I rise to celebrate the 106th birthday of someone  born that year, an American hero named Hazel Womble of Jacksonville,  Florida, who is today one of our Nation's oldest living veterans. Here  she is surrounded by friends and family.\n\nBorn on Christmas Eve in 1919, Hazel would go on to serve her country  with extraordinary courage in World…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699733/happy-106th-birthday-to-hazel-womble"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…remember. With age, I  admire, respect, and appreciate the man Richard is, and that admiration  is growing with every day.\n\nBriefly, Richard grew up in Benson, North Carolina, the oldest of  four. He attended Shaw University, followed by North Carolina State  University, where he received a graduate degree in mathematics.\n\nHe married Lena Lockamy, with whom…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690037/happy-birthday-to-richard-lockamy"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…It was the beginning of a force that would go on to secure our  freedom, shape our Nation's history, and stand as a pillar of strength  in times of war and peace.\n\nAs the oldest and largest branch of our Armed Forces, the U.S. Army  has played a central role in defending our Nation, upholding our  values, and advancing peace around the globe.\n\nFor…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692561/united-states-armys-250th-birthday"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…heart of Georgia's Third Congressional District and  less than 1 hour away from Hartsfield-Jackson Atlanta International  Airport.\n\nFounded in 1831, LaGrange College is the oldest private college in  Georgia, and its vision is to be an innovative institution,  holistically educating students to connect with and contribute to an  ever-changing world.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694895/recognizing-lagrange-college-panthers-and-the-point-university-skyhawks"}, {"senator": "French Hill", "party": "Republican", "sentence": "…about considering recreation conservation lands in our  national forests.\n\nThe Ouachita Mountains and the surrounding forest sit in the  southwest corner of Arkansas. It is the oldest and largest national  forest in our southern region. It has origins in my district of central  Arkansas and stretches some 220 miles west into eastern Oklahoma  through my…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691095/flatside-wilderness-additions-act"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…extraordinary twenty-year tenure as President of Loras College. As  the longest-serving president in Loras college's 185-year history,  Collins has left an indelible mark on Iowa's oldest institution of  higher education.\n\nCollins earned his Bachelor of Science degree in Finance from Loras  College in 1984. After graduation, what began as a brief visit to his…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694164/congratulating-loras-college-president-james-collins-on-his-retirement"}]