[{"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…percent. First, it  was Elon Musk calling Social Security a Ponzi scheme. Then Donald Trump  spent 10 minutes in his congressional address talking about checks to  150-year-olds, which we all know is a lie. And now the Vice President  has picked up the ax and is coming for Social Security too.\n\nWe need to be very clear: What the Vice President said…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689776/social-security"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Prekindergarten and Early Childhood Education Act of 2025, which would  establish and expand prekindergarten programs in public and public  charter schools for three- and four-year-olds.\n\nThis bill seeks a breakthrough in public education by providing  funding for states to add prekindergarten for children at three and  four years of age, like the kindergarten…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695812/introduction-of-the-universal-prekindergarten-and-early-childhood-education-act-of-2025"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…killed?\n\nI refuse to send another dollar to the Department of Homeland  Security. My residents don't want their tax dollars going to execute  people in the streets, abduct 5-year-olds, tear gas children, and  separate our families.\n\nThis is what the Trump administration is doing right now with DHS  funding. It is a fascist army, and it is shameful.\n\nI grew…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699666/horrific-ice-abuses"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…16.\n\nAs a lifelong baseball fan, I love watching these young players take  the field with determination and energy. Just this summer, the minor  league division, the 10-year-olds, made it to the State tournament,  while the senior team won the fourth consecutive Central Region  Tournament, something no other team has done before, and went on to  represent…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694916/congratulating-burbank-american-little-league"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…incarceration.\n\nThis bill would make Washington, D.C., an outlier in its approach to  juvenile justice. While the current law already allows prosecutors to  charge 16 and 17 year-olds as adults at their discretion, without a  judge's approval, H.R. 5140 would lower that age even further.\n\nEven in states with a history of tough-on-crime stances, many are…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695783/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Rob Menendez", "party": "Democrat", "sentence": "…every day, and he just  brightens the room. His friends haven't asked about him yet, but I know  that they'll catch on.''\n\nMr. Speaker, what they will catch onto, those 5-year-olds, the age of  my daughter, is that this government, this administration, House  Republicans have failed the American people. They failed our  communities. They failed to keep…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699379/speaking-out-against-ice"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…proved to themselves and the world  that Americans can do it.\n\nI am blessed to have many Rosies in my life. I have gone to many  birthday parties for 100-, 102-, and 103-year-olds because we are  blessed to have a number of the original Rosies living in my area. They  have inspired me. They tell me their stories. On a cold Veterans Day  this year, when…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697725/world-war-ii-womens-memorial-location-act"}, {"senator": "Richard Neal", "party": "Democrat", "sentence": "…able to complete the doctor's appointment  that you had made for them because you didn't have health insurance.\n\nI didn't hear the other side complaining about keeping 26-year-olds  on their parents' health insurance. How about the idea that, in the  ACA, we were able to abolish preexisting conditions being routinely  used to deny the opportunity to access…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698788/breaking-the-gridlock-act"}, {"senator": "Rob Menendez", "party": "Democrat", "sentence": "…children--no one is safe. We have seen people like Greg Bovino and his  masked paramilitaries come into our communities and cause an immense  amount of harm. We have seen 5-year-olds come home from school only to  be detained and then sent to Dilley, Texas, then be returned and see  the administration try to end their asylum claim. This is what people  are…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700054/safety-in-america"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "…into adult  prisons where they are more likely to come out worse off than they were  and not better. If we care about public safety, the last thing we  should do is put 14-year-olds in adult prison.\n\nInstead of taking power away from D.C. residents and our elected  officials, Congress should focus on real national priorities like  addressing gun violence…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695593/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…line  into tyranny. He is even arresting judges whom he sees as standing in  his way.\n\nWhen tyranny takes root, no one is safe. Today, it is immigrants with  tattoos, 2-year-olds, and even children with cancer. Tomorrow, it could  be anyone who falls out of favor, even Republicans who don't clap long  enough or make the pilgrimage to Mar-a-Lago to kiss…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690835/recognizing-jessica-suarez-nieto-during-teacher-appreciation-week"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…political class knew that  Hiroshima was a target because it was an industrial city. But little  did they know that the teachers, the middle schoolteachers and the 13- year-olds who were there at the city center doing this public service  work were all going to perish that day. My cousin survived because she  stayed home at the behest of her mother.…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694115/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…retirement. I had people who were 90- or 100-year-old retirees, and I  had first-year teachers who were 23 years old. I owed just as much of a  fiduciary duty to those 23-year-olds as the 90-year-olds.\n\nSo long-term factors and ESG factors matter even when corporate  executives who are focused on the short term don't care about them.\n\nThis bill claims…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699159/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…bill is irrelevant, since there is never  justification for Congress to legislate on local D.C. matters.  Nevertheless, I will discuss it.\n\nI strongly oppose charging 14-year-olds as adults. However, whether  to amend D.C. law to reduce or increase the minimum age a minor can be  charged as an adult should be a decision for D.C. alone.\n\nIn a series of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695596/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Richard Neal", "party": "Democrat", "sentence": "Mr. Speaker, the Republican bill was put together with bubble gum and  Elmer's glue last Friday night. This isn't a plan. It sounds like their  argument that 300-year-olds are receiving Social Security benefits.\n\nFamilies are staring at massive premium hikes, and now, thanks to  four Republicans, we can force a vote. When you listen to the argument…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698400/lower-health-care-premiums-for-all-americans-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…dramatically fewer children than we expected. I have done a series of  presentations here on the floor where I have shown that we actually  have the same number of 18-year-olds as we had 20 years ago, but double  the number of those who are 65 and up.\n\nIs that Republican or Democrat? Look, there is policies that have  been engaged in by Democrats that…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699988/math-is-such-an-anathema"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…tax  hike.\n\nHere is my battle. I have tried for years and years and said, we need  to do a fiscal commission. The fact of the matter is, we have the same  number of 18 year olds as we had 20 years ago, but we have double the  number of Americans, our brothers and sisters, who are now 65 and up.\n\nTwenty years ago, we had 35 million Americans 65 and up.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695567/we-are-borrowing-a-second"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…trillion. It doubles in 7 years. It is demographics. It is  not personal. It is not Republican-Democrat. It is what we are as a  society.\n\nWe have the same number of 18-year-olds today as we had 20 years ago,  but we have double the number of our brothers and sisters who are 65.  It is math.\n\nBehind these microphones this week, how many people have come…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694915/facts-and-math"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…productivity.\n\nYou can't be afraid of AI, synthetic biology, robots. People go,  ``Oh, David, you are not supposed to say that,'' but it is true. Next  year, the number of 18-year-olds is lower, smaller, than this. The year  after that, it is smaller than that. Then, it is smaller than that.  America is now running into a situation where we have too many…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697051/facing-fiscal-reality"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…is demographics, it is functionally Medicare; in a few years,  Social Security, when the trust fund is gone; and interest.\n\nIf you go back 20 years ago, the number of 18-year-olds we had then  compared to the number of 18-year-olds today is almost identical. The  number of our brothers and sisters who are 65 and up has almost doubled  in that 20 years.…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691811/actual-solutions"}, {"senator": "John Thune", "party": "Republican", "sentence": "…But growing government is the driving philosophy of the Democratic  Party, and you can just look at the Biden years. We had the Federal  Government mandating masks for 2-year-olds outside--not in a building,  outside for 2-year-olds; the EPA regulating puddles and saddling  farmers and ranchers with massive compliance laws, which we experienced  in my…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697344/biden-administration"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…healthcare and the reality that we are going to have to  deal with is debt, deficits, and demographics.\n\nOnce again, remember, we functionally have the same number of 18 year  olds today as we had 20 years ago, but we have double the number of 65  and up. It is just what we are. Don't get mad. It is not Republican or  Democrat. It is just demographics…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699257/debt-deficits-and-demographics"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…young people into the idea that it is cool to be transgender.\n\nIn fact, recently, it has come out that the number of kids who are  transgender, and I think it is 18- or 19-year-olds, has been cut in  half, which proves what anybody with commonsense knew all along: It was  a cool thing created so that young people could say: Look at me. I am  transgender.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698356/protect-childrens-innocence-act"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…and older are  eligible to have their case moved up to criminal court and to be tried  as an adult in D.C. This bill lowers that age to 14 years old, making  14- and 15-year-olds who commit violent crimes eligible to be charged  as adults.\n\nViolent crime refers to murder, first-degree sexual abuse, burglary  in the first degree, and robbery while armed,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695595/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…masks. I  think that this is outrageous. We have seen threats against our ICE  officers absolutely skyrocket. It is very ironic for folks that had no  problem forcing 2 year olds to wear masks all day, in defiance of even  the World Health Organization's guidelines, that are now somehow  objecting to Federal officers who feel the need to do this in order…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693143/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…when my  economists on the Joint Economic Committee are saying that we may have  zero population growth in the United States this year and the fact that  we have fewer 18-year-olds today than we had 20 years ago but almost  double those who are 65 and older?\n\nMadam Speaker, I keep coming here week after week after week and  showing charts about the debt…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698412/fun-with-math"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…30 years ago. Today, we are approaching  about 70 million of our brothers and sisters who are 65 and up, so more  than double.\n\nGo back 20 years ago, the number of 18 years olds we had is pretty  much the same as the number of 18 year olds we have today. Next year,  the number of 18 year olds goes down, the year after that it goes down,  and the year…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694131/dismantling-californias-citizens-redistricting-commission"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…you have ever had before.\n\nIf you are disabled on Medicaid, right now you have been crowded out  of those programs by people turning down work. Able-bodied people, 35- year-olds sitting at home playing video games are going to have to now  go get a job. That is right. By the way, that is a good thing for them.  Their mom doesn't want them sitting in…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693191/one-big-beautiful-bill-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…go  just to interest. You are now seeing, in 3 years, the majority of our  spending will actually go to benefits here. We have a math problem.  Today, we have fewer 18 year olds than we had 20 years ago, but we have  double the number of 65 year olds.\n\nWe can sit here and blame each other, but it is just demographics. It  is happening over the entire…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698698/congress-is-a-math-free-zone"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…little  bit more attention.\n\nOver the weekend, or late last week, there was an article that said  that the United Kingdom, in a few years, is going to begin having 16- year-olds vote. Since frequently problems in America happen in Great  Britain first, I think it is something we should pay a great deal of  attention to.\n\nAbout 6 years ago, in this body,…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693920/comatose-press-corps"}]