[{"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…Building  and blew it up, killing 168 people and injuring over 800 people. That  is a major artery in front of the Murrah Building.\n\nThe Reagan Building was designed as an open and public-private  building with public access, public accommodations, and the public  coming into the building for eating. It has a big cafeteria. It has a  big parking lot that…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699075/providing-for-consideration-of-hr-financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…and what are  you guys putting on the floor to eat up precious floor time as we are  headed into the holidays? We are debating bills to micromanage D.C.  affairs, bills to open public land and Tribal sacred sites to oil and  gas drilling, and a ridiculous political resolution that I heard your  own Members last night on the floor talking about. They called…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696976/district-of-columbia-cash-bail-reform-act-of-2025"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…worries these farmers behind closed  doors, but they don't say much publicly.\n\nThey don't like tariffs. They tell me that behind closed doors too.  They don't want to be open in public about their criticism of President  Trump, but the tariffs are taxes that they know are going to make it  difficult for them and their exporters and importers of important…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697242/the-economy"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…putting forth a set of resolutions to  gut protections for clean air and public lands across the West, while  they prepare a reconciliation package next week that would open our  public lands to oil and gas drilling, selling them to the lowest  bidder, and repealing historic investments in climate and clean energy.\n\nTo think that just 55 years ago, a…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690326/one-hundred-days-of-chaos-dysfunction-and-attacks"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…may carry their concealed  firearms under LEOSA. It would force States to allow off-duty and  retired officers to carry concealed firearms onto all private property  open to the public, including restaurants, bars, parks, national parks,  and playgrounds. It would also force States to allow off-duty and  retired officers to carry concealed firearms…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691242/leosa-reform-act"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…Harvard.\n\nNo. 90, froze public safety grants for public broadcasters in our  country.\n\nNo. 91, halted Federal leasing and permitting for wind projects in  our country as they open our public lands for coal mining.\n\nNo. 92, gutted permitting processes in order to fast-track dirty  energy projects to reward his Big Oil and Gas and Coal cronies.\n\nNo. 93, canceled…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690442/trump-administration-first-100-days"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…about a campaign.'' The number has grown dramatically and  now is in the millions for candidates for the House and for the Senate.\n\nYou are looking at the last open, public sponsor of public financing  of campaigns. Nobody else has tackled it since I stopped introducing  it. At the time I introduced it, Arlen Specter of Pennsylvania, a  Republican,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699112/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "…discipline.\n\nFourth, H.R. 2096 would repeal a provision that required the police  department to publish on a public website a schedule of officer  discipline hearings which are open to the public. The House of  Representatives itself publishes on a public website a schedule of its  committee hearings.\n\nI close with a question and a plea. If Republicans support…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692304/protecting-our-nations-capital-emergency-act"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…are no ships there.\n\nMy main focus is, as I said earlier, even if you disagree with me,  why don't we do our work as Members of Congress? Why aren't we having  hearings, open, public hearings with members of the administration  coming to testify before us and the American people so that they can  hear for themselves?\n\nIn prior Congresses, when I was…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698248/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…opinions. If you  think that they are the kind of organization that they are--I believe  the other night on the floor they were called communistic, as well. How  about we have an open public hearing and debate on that and put  legislation forward not in the dark of night but when the public can  actually view what you are saying.\n\nMr. Speaker, I am here today…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692502/doge-has-unfettered-access-to-personal-data"}, {"senator": "Rick Larsen", "party": "Democrat", "sentence": "…people across the States of  Tennessee, Mississippi, Alabama, Georgia, North Carolina, Virginia, and  Kentucky.\n\nThis legislation requires TVA's board meetings to be open to the  public when possible, which will increase transparency for the  communities impacted by TVA's decisions.\n\nMr. Speaker, I support H.R. 1373, as amended, and I urge my  colleagues…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692214/tennessee-valley-authority-transparency-act-of-2025"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…citizenship  recognized.\n\nThere is existing evidence that the D.C. seal should have been  depicted. The Members of Congress room in the Thomas Jefferson  Building, which is not open to the public, depicts the D.C. seal with  the depiction of state seals on its ceiling. This precedent reinforces  D.C.'s request to be represented among the stained glass panels in…", "date": "2025-11-25", "source_url": "https://justfacts.votesmart.org/public-statement/1697163/introduction-of-a-bill-to-require-the-library-of-congress-to-install-the-district-of-columbia-seal"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…protecting, and this pristine, one-of-a- kind place is one of those incredible places.\n\nMr. Speaker, I urge all of my colleagues to vote ``no'' on this  backdoor attempt to open our public lands to foreign mining, and I  reserve the balance of my time.\n\nMr. Speaker, to the claim that Secretary Haaland failed to notify  Congress as required by law, I am holding…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699273/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…member of the       Committee in writing of the date and time of the meeting.                          Rule 2. Meeting Procedures\n\n2.1. Meetings of the Committee shall be open to the public       except as provided in paragraph 5(b) of rule XXVI of the       Standing Rules of the Senate.\n\n2.2. It shall be the duty of the Staff Director to keep or       cause…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688225/us-senate-select-committee-on-intelligence-rules-of-procedure"}, {"senator": "James Risch", "party": "Republican", "sentence": "…matters by the committee.\n\n(f) Closed Sessions.--Each meeting and hearing of the       Committee on Foreign Relations, or any subcommittee thereof       shall be open to the public, except that a meeting or hearing       or series of meetings or hearings by the committee or a       subcommittee on the same subject for a period of no more       than…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691700/us-senate-committee-on-foreign-relations-rules-of-procedure"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…provision of paragraph 3 of rule XXVI of the Standing Rules       of the Senate.\n\nRule 2. Meetings of the Committee, including meetings to       conduct hearings, shall be open to the public, except that a       meeting or series of meetings by the Committee on the same       subject for a period of no more than 14 calendar days may be       closed to the…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687982/us-senate-committee-on-rules-and-administration-rules-of-procedure"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…example, the LEOSA Reform Act will allow law enforcement officers  qualified under LEOSA to carry concealed firearms in national parks,  certain Federal facilities that are open to the public, on public  transportation, in school zones, and in other areas.\n\nThe bill also reduces the frequency that qualified retired law  enforcement officers are required to…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691241/leosa-reform-act"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…Valley were barricaded.\n\nNow, compare that to the government shutdown in the first Trump  administration. Vendors remained in business, the public lands remained  fully open to the public, no monuments were obstructed, no barricades  were erected, and the gates to the national parks remained fully  accessible.\n\nToday, opponents of President Trump's war…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688585/yosemite-belongs-to-the-people"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "Mr. EZELL. Mr. Speaker, I move to suspend the rules and pass the bill  (H.R. 1373) to require certain meetings of the Tennessee Valley  Authority to be transparent and open to the public, and for other  purposes, as amended.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:                                 H.R. 1373\n\nBe it enacted…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692213/tennessee-valley-authority-transparency-act-of-2025"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "(b) Meetings of the committee, including meetings to       conduct hearings, shall be open to the public, except that a       meeting or series of meetings by the committee on the same       subject for a period of no more than 14 calendar days may be       closed to the…", "date": "2025-03-12", "source_url": "https://justfacts.votesmart.org/public-statement/1688786/joint-committee-of-congress-on-the-library-rules-of-procedure"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "Mr. KENNEDY of Utah. Mr. Speaker, in 2027, beginning in April and  ending in October, the Salt Lake Temple, which is to my left, will be  open for public tours.\n\nAll are welcome, with 3 million to 5 million visitors expected during  this historic event that will be important to Utahns and especially to  those who will again…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698141/visiting-salt-lake-temple"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…General.--Under conditions to be prescribed by the       Architect of the Capitol and the Capitol Police Board, the       event shall be--\n\n(1) free of admission charge and open to the public; and\n\n(2) arranged not to interfere with the needs of Congress.\n\n(b) Expenses and Liabilities.--The sponsors of the Memorial       Service and Exhibition shall assume…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689661/authorizing-the-use-of-the-capitol-grounds-for-the-national-peace-officers-memorial-service-and-the-national-honor-guard-and-pipe-band-exhibition"}]