[{"senator": "Al Green", "party": "Democrat", "sentence": "…against the unconstitutional policies of the Biden-Harris       Administration, setting the constitutional framework for       opposing the liberal agenda including DEI, open borders,       anti-gun hysteria, and transgender procedures forced on       children. I also filed the landmark Texas v. Pennsylvania       lawsuit and have vigorously defended…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694943/bloody-sunday-and-voting-rights-act"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…order. That is why I fully support his decision to send       Marines and National Guard troops to LA.\n\nUnfortunately, we will continue to pay for the consequences       of open borders for decades to come; but to address these       issues, I'm co-sponsoring the following bills:              Stop Anarchists from Endangering (SAFE) Cities Act\n\nCodifies…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692878/newsletter-from-congressman-chuck-edwards"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…up by the famous slogan of the French  student radicals in 1968: ``It is forbidden to forbid.''\n\nThat is what the phrase ``suicidal empathy'' is meant to describe. We  open our borders and import millions of unvetted refugees because we  can't bear to turn a single asylum seeker away. We empty out our  prisons because we just can't stomach the thought…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699689/immigration"}, {"senator": "David McCormick", "party": "Republican", "sentence": "…absolutely absurd.\n\nNow, many on the left look at our electoral system and say: There is  nothing to see here, no issue, no problem. But that is what they said  about wide-open borders. That is what they said about censoring  conservatives online. That is what they said about the botched  Afghanistan withdrawal. That is what they said about President Biden's…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700069/9999"}, {"senator": "John Thune", "party": "Republican", "sentence": "…disease prevention  programs that are essential to a robust agriculture sector.\n\nWith this bill, Republicans are also making America more secure. We  are ending the era of open borders by making a generational investment  in border security. We are finally finishing the border wall. We are  hiring more border agents and giving them the tools they need…", "date": "2025-07-08", "source_url": "https://justfacts.votesmart.org/public-statement/1693279/one-big-beautiful-bill-act"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…welcomed at the Munich Security  Conference, supporting freedom for the people of Belarus.\n\nIn conclusion, God bless our troops as the global war on terrorism  continues. Open borders for dictators put all Americans at risk of more  9/11 attacks imminent as warned by the FBI. Trump is reinstituting  existing laws to protect American families with peace…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688138/promoting-stability-and-prosperity"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…million of our brothers and sisters who are 65  and up.\n\nYou have a shortage of young people in this country. Unless you deal  with that reality--but you don't want to open up the borders. That is  the disaster. You make people poorer by bringing in people to compete  with your working poor. That is the cruelty of what the last  administration did. They…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692327/math-always-wins"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Mr. Speaker, the policies of the Biden-Harris administration crushed  the spirit of the American people under the weight of rising costs from  a 40-year high inflation, open borders, uncertain futures, and spending  an avalanche on Biden's Big Government spending priorities that have  saddled us with an annual deficit of $2 trillion.\n\nThe resolution…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689915/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…Mr. Chair, I want to thank Mr. Arrington for  yielding.\n\nMr. Chair, 4 years ago, President Trump left Joe Biden a blueprint  for success, and then Democrats proceeded to open our borders,  undermine American energy, and spend trillions of dollars on handouts  to the wealthy.\n\nThey created the highest inflation in 40 years that made it  impossible for working…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688028/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…growth. That is one of  the things that has actually shortened the life of the Social Security  trust fund by a year.\n\nThe next time someone says that we just need to open up the borders,  that that will take care of the Social Security trust fund, it turns  out that it doesn't work that way. You actually didn't get anything  from it. You did a suppression…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693062/stop-bathing-in-folklore-and-start-bathing-in-math"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…small  businesses to ensure they have everything they need to expand and grow.\n\nThis bill codifies both President Trump's executive order to end  taxpayer subsidization of open borders and Administrator Loeffler's SBA  7(a) program guardrails put in place earlier this year.\n\nMr. WILLIAMS of Texas.  Van  Duyne).\n\nMs. VAN DUYNE. Mr. Speaker, I thank the…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692123/american-entrepreneurs-first-act-of-2025"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…down in Central America.\n\nMr. Knott was helping prosecute these folks, and I know the  prosecutors were very frustrated at the time with what they were seeing  with these open borders. I appreciate, one, what he did before he came  to Congress; two, what he is doing now; and, three, hosting this  opportunity today to bring attention of this to the American…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690711/outrageous-government-funded-incentives"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…supposedly the freest and strongest and greatest country on  Earth. She was brutally murdered because feel-good radical liberals  with their jailbreak, let-all-the-criminals-out, open borders, take  money from George Soros, DAs, and judges put these criminals on the  streets. You have a guy who was a 14-time offender, 14-time offender  sitting behind this beautiful…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695203/people-are-sick-and-tired"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…that  are being used by NGOs to undermine the very police they are saying  they are trying to support. For example, one grant to an NGO that was  promoting prostitution and open borders, this is the kind of stuff that  the American people sent us here to stop. This is the kind of stuff  that they are proud of the President for using DOGE to identify and…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691169/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "Mr. KNOTT. Mr. Speaker, I rise in strong support of this bill.\n\nAfter listening to the previous few hours, it should surprise no one  that the party of open borders, the party of illegal aliens, and now  the party of State-run grocery stores hates this bill because this bill  secures America's borders. It protects America's farmers…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693184/one-big-beautiful-bill-act"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…appreciate what this is, this moment, because this isn't some  isolated incident. This is a 10-year struggle for commonsense Americans  who have pushed back against a radical open borders policy that has  been pushed by the Democrats.\n\nPresident Trump won in 2016 on a few issues, but the electrical cord  that began when he came down the escalator, that continues…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700065/9999"}]