[{"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…both sides of the  transaction. Any person, any foreign country can bribe and buy  politicians through cryptocurrency like this. Those who have purchased  such coins have been open about their motivations for doing so.\n\nRight before his inauguration, President Trump issued his own coin,  the Trump coin, for which he is the majority owner. Millions of dollars…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693551/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…bill, and I reserve the balance of my  time.\n\nMr. CISNEROS. Mr. Speaker, I will close by thanking the chairman for  his commitment to working on behalf of small businesses to open up  avenues of financing for small businesses hoping to contribute to the  reshoring of manufacturing.\n\nMr. Speaker, I support this legislation, and I yield back the balance…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697219/made-in-america-manufacturing-finance-act"}, {"senator": "Nikki Budzinski", "party": "Democrat", "sentence": "…Illinois chapter of the National  Conference of Black Mayors.\n\nAs mayor, he prioritized bringing new business opportunities to  Venice and making sure that his door was always open to constituents.\n\nHis dedication to public service is truly an inspiration, and I am  honored to call him my friend.\n\nI thank Mayor Echols for all he has done for our community…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691471/retirement-of-mayor-tyrone-echols"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…against the unconstitutional policies of the Biden-Harris       Administration, setting the constitutional framework for       opposing the liberal agenda including DEI, open borders,       anti-gun hysteria, and transgender procedures forced on       children. I also filed the landmark Texas v. Pennsylvania       lawsuit and have vigorously defended…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694943/bloody-sunday-and-voting-rights-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…to keeping electricity  bills down or the lights on.\n\nMadam Speaker, the bills on the floor today will only worsen the  Republican affordability crisis. Every time Americans open their power  bill or see their lights flicker, Republicans are responsible. I think  the American people will hold them accountable.\n\nMadam Speaker, I urge my colleagues to…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697886/state-planning-for-reliability-and-affordability-act"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…don't seek help when they need it. Whether they are  held back by fear, stigma, or lack of access, we need to do more as a  society to remove all the barriers and encourage open and supportive  communities.\n\nPlease, if you are having issues around depression or suicidal  thoughts, seek help and call 988.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695318/recognizing-suicide-prevention-month"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…businesses, like our restaurants, manufacturers, and  childcare providers, the small group health insurance market isn't just  a huge administrative burden, it is also expensive. The open  marketplace is the difference between being able to hire and retain and  keep doors open and losing staff to jobs at companies that have the  wherewithal to provide health…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695650/healthcare"}, {"senator": "Kirsten Gillibrand", "party": "Democrat", "sentence": "…relationship. If you could see a document  itemizing every change that has been made since the minute we  introduced this bill, it is volumes long.\n\nIt is extraordinary how open this process was; how many Senators were  able to give serious critical thinking to the bill to make it better to  bring bipartisan support behind this effort.\n\nI can't thank…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692380/9999"}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "…had access to care and institutions that cared  about my life.\n\nIf we want people to be healthy in this country and to participate in  their communities and work, we need to open up choices, and we need to  provide more opportunities instead of less. That is why I offered an  amendment to the Republican budget reconciliation bill that would have  protected…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694154/defunding-planned-parenthood"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "…Republicans in this Chamber. They froze  program funds, closed regional offices, and forced mass layoffs of  those who administer Head Start. Worse still, Republican budget  proposals open the door to hundreds of billions of dollars in cuts to  Head Start.\n\nRecently, I visited a Head Start provider in Woonsocket, Rhode  Island, to hear from those who rely on the…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689866/protect-head-start"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…adjournment,  notwithstanding that this amendment vote is pending. Is it appropriate  under the Rules of the House of Representatives' procedure or  Jefferson's Manual to keep a vote open while simultaneously declaring  to Members that they are free to leave?\n\nMr. NEGUSE. Mr. Speaker, it does, and I appreciate the Speaker's  response. Is it customary for a vote…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693214/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…husband and other officials, she would take bread and put the bread  inside of her garments and go out and distribute it to the poor.\n\nOnce, she was caught, and she was made to open her garment, and when  she did open her garment, the bread had turned into roses. That is the  miracle that was attributed to her. She lived only a short time and  died, but…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693592/rescissions-act-of-2025"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "Mr. CARTER of Louisiana. Mr. Speaker, I thank Ranking Member Pallone  for yielding the time.\n\nI stand in strong support of H.R. 2037, the Open RAN Outreach Act. I  am proud to introduce this bipartisan Open RAN Outreach Act with  Representative Richard Hudson of North Carolina. I am grateful that the  full House is…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693487/open-ran-outreach-act"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "…support a lot  of things Americans care about: Survivors of sexual assault, programs  that offer mental health care for police officers and keep hotlines to  victims of crime open, programs that assist law enforcement in rural  communities, provide guidance on finding safe housing, and offer care  and counseling for children facing abuse.\n\nMr. Speaker,…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1690993/support-safer-communities"}, {"senator": "Richard Neal", "party": "Democrat", "sentence": "…hearing the other side say that there are  billionaires and millionaires who are driving the benefit. JCT has said  that nobody over $500,000 is getting this benefit. We are open to these  conversations as we go forward, as well. Yet, only 38 percent of their  tax cuts inure to the benefit of people at the lower end of the  economic spectrum.\n\nBy ending…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698788/breaking-the-gridlock-act"}, {"senator": "Lance Gooden", "party": "Republican", "sentence": "…that. They have said Republicans are corrupt. They have  said that Republicans are starving kids.\n\nWhat they haven't said is the one thing that this bill does, which is  to open up the government. Not one Democrat is getting up here saying  this bill opens the government.\n\nLet me remind them and my colleagues and the American people that  this bill…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696720/continuing-appropriations-and-extensions-act-2026"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…not only in this program but at  the southern border as well to admit hundreds of thousands, even  millions of individuals into the country during the Biden years and  their open border policies.\n\nBut even though this authority is supposed to be used only on a case- by-case basis, the Biden administration turned this exception into the  rule. Now we…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699092/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…continue  to support youth in our community. Raising money for the local 4-H  program is a worthy endeavor, but the true impact of those dollars are  the opportunities they open for young people engaged in Citrus County  4-H programs. Marlene's support and advocacy for youth development  provides vital resources for school enrichment programs, residential…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691259/recognizing-marlene-law"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…vision for America can be seen in our trading  relationships with Canada. In 1986, President Reagan said:\n\nOur trade policy rests firmly on the foundation of free and       open markets. . . . I . . . recognize the inescapable       conclusion that all of history has taught: The freer the flow       of world trade, the stronger the tides for human progress…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689478/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…former President, but the acclaimed ``Father of the Constitution.''\n\nOn its 20th anniversary, Sunshine Week continues to be a crucial  reminder of the need for transparency and open government. To control a  government as big as ours, it takes a lot of very bright light shining  on every Agency. As Justice Brandeis wrote in 1913, ``Sunlight is said  to…", "date": "2025-03-12", "source_url": "https://justfacts.votesmart.org/public-statement/1688777/sunshine-week"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…referred to as OMUFA. This funds the review process to bring  over-the-counter drugs to market.\n\nBecause of the shutdown, because of my Democratic colleagues refusing  to vote to open the government, for the first time in history, a user  fee program has expired, meaning patient access to new over-the-counter  treatments for common ailments is in jeopardy.…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696452/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…taking another  pill, taking another pill, changing the pills, whatever it happens to  be, forever.\n\nIt is about new therapies that will enable those members going  through it to open up their minds, clear out the demons, and move  forward with life.\n\nWe have a responsibility as the House of Representatives and as the  legislative branch of our government,…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692714/recognizing-national-post-traumatic-growth-day"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…simply cannot afford this ridiculous  regulation and should not be forced to purchase entirely unaffordable  vehicles that do not meet their needs.\n\nOur economy was built on an open market and the freedom of consumer  choice. Congress cannot allow California to continue its abuse of its  standing in the Clean Air Act to limit consumer freedom. It is time…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690494/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision"}, {"senator": "John Thune", "party": "Republican", "sentence": "…and disease prevention  programs that are essential to a robust agriculture sector.\n\nWith this bill, Republicans are also making America more secure. We  are ending the era of open borders by making a generational investment  in border security. We are finally finishing the border wall. We are  hiring more border agents and giving them the tools they need…", "date": "2025-07-08", "source_url": "https://justfacts.votesmart.org/public-statement/1693279/one-big-beautiful-bill-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…this action comes at a steep cost.\n\nIn 2024, the bypass flows produced $20 million in lost hydropower  generation, which instead had to be replaced with power purchased on  the open market.\n\nWAPA makes these purchases using the Basin Fund, which is funded by  hydropower revenues, not appropriations. In other words, utility  customers end up footing the…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691060/memorandum-of-understanding-to-address-potential-impacts-of-a-certain-record-of-decision-on-the-upper-colorado-river-basin-fund"}, {"senator": "Ashley Moody", "party": "Republican", "sentence": "…harmful energy standard would force commercial fridge and  freezer manufacturers to discontinue product lines and close factories  in the U.S. The results would be layoffs and open the door for other  foreign competitors to step in instead of those here in our own  country.\n\nFood producers, distributors, wholesalers, grocery stores, consumers  would be…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690525/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…practices.\n\nThe success of U.S. agriculture has been built through the ingenuity,  hard work, and the strategic application of science and technology.\n\nI was proud to help open the 110th Farm Show on Saturday. It is  always an honor to meet farmers from across the Commonwealth and learn  about how they continue to ensure agriculture remains Pennsylvania's…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699123/pennsylvania-farm-show-recap"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Laken Riley, Americans like Rachel Morin? I could go down the list of  people who were killed, abused, assaulted, or harmed because a radical  group of leftists decided that open borders for their political  purposes was more important than your safety and security as Americans.\n\nYes, I think we should have a select committee or an organized effort…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695719/highlighting-flawed-policies"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Prop 36, an initiative that I helped to lead  and qualify for the ballot that has made crime illegal again in  California by restoring some basic consequences for theft and open drug  use and dealing fentanyl.\n\nNow, of course, Gavin Newsom and the supermajority in California  fought against Prop 36 each and every step of the way. They even  concocted…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…she called home in Sublette and Teton Counties.\n\nFrom the day Juli moved to Wyoming to attend the University of  Wyoming, she embraced the romance of the West. She loved the open range  and never tired of participating in the cowgirl life from baking bread  to moving cattle. Juli was particularly fond of the natural beauty and  wildlife we are blessed…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687885/recognizing-the-legacy-of-juli-spitzer"}]