[{"senator": "Brian Schatz", "party": "Democrat", "sentence": "…deem the 30 hours  expired. We will accommodate your imperative to get this done if you  needed to get it done by the end of next week. We said: Sure, keep  negotiations open. And we ran a hotline on that, and it cleared our  hotline.\n\nWe had some very difficult conversations with Members who hate this  idea. But just to keep the aperture open to renegotiate…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695313/cloture-motion"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "Mr. PALLONE.\n\nMr. Speaker, I rise in strong support of H.R. 2037, the Open RAN  Outreach Act.\n\nOpen RAN, or Open Radio Access Network, technology is a wireless  network architecture that has the potential to drive 5G and 6G  innovation forward. Like…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693486/open-ran-outreach-act"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "Mr. CARTER of Louisiana. Mr. Speaker, I thank Ranking Member Pallone  for yielding the time.\n\nI stand in strong support of H.R. 2037, the Open RAN Outreach Act. I  am proud to introduce this bipartisan Open RAN Outreach Act with  Representative Richard Hudson of North Carolina. I am grateful that the  full House is considering…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693487/open-ran-outreach-act"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "Mr. LATTA. Mr. Speaker, I move to suspend the rules and pass the bill  (H.R. 2037) to provide outreach and technical assistance to small  providers regarding Open RAN networks, and for other purposes, as  amended.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:                                 H.R. 2037\n\nBe it…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693488/open-ran-outreach-act"}]