[{"senator": "Jack Reed", "party": "Democrat", "sentence": "…and majority leader. In 2017, he was honored by his colleagues with his  election to the Office of Senate President. The hallmark of Donny's  leadership style was to have an open-door policy which encouraged  colleagues and constituents and elected officials to become engaged. He  devoted his life to improving our community, to strengthening public  health…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691451/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…paid it well, dedicating her time and resources to numerous community  organizations, including the National Infantry Museum, the Muscogee  Educational Excellence Foundation, Open Door Community Center, St. Luke  Church Administrative Board, Girls in the Game, Chattahoochee Council  of the Boy Scouts of America, Jordan Vocational High School College and…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690837/in-memory-of-the-honorable-judy-thomas"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…or rely on the help of Good Samaritans  to grocery shop for them, to take their kids to school, to have access  to what we value in life--all because they are afraid to open their  door.\n\nThree hundred and seventy-four days ago, standing up for your First  Amendment rights, your Fourth Amendment rights, even your Second  Amendment rights was not in itself…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699422/9999"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…Apex Industrial Park is a critical driver of job creation,  logistics, and advanced manufacturing in southern Nevada and the  critical update provided by this bill would open the door to more  efficient growth, infrastructure investment, and regional coordination.\n\nThis bill reflects how modern public-private partnerships should  work, by empowering…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691120/apex-area-technical-corrections-act"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…Accountability Office and the Senate Parliamentarian both ruled that  these waivers are not subject to the CRA. Proceeding sets a dangerous  precedent.\n\nMisusing the CRA today could open the door to striking down a wide  range of Federal programs tomorrow, including Medicaid waivers, which  worries me greatly. I don't sleep at night on that one.\n\nWe are here today…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690490/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "…this Chamber. They froze  program funds, closed regional offices, and forced mass layoffs of  those who administer Head Start. Worse still, Republican budget  proposals open the door to hundreds of billions of dollars in cuts to  Head Start.\n\nRecently, I visited a Head Start provider in Woonsocket, Rhode  Island, to hear from those who rely on the great…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689866/protect-head-start"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…our small- and medium-sized businesses without a  penny of cost to the American taxpayer and without any risk to the  American taxpayer.\n\nThis bipartisan legislation will open the door to more investment in  BDCs, thereby unlocking capital for small- and medium-sized businesses.\n\nThe most important thing that our financial institutions and the most  important…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692711/access-to-small-business-investor-capital-act"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…a       federal rulemaking only once. Again, public land orders have       historically not been submitted to Congress under the CRA--      setting this precedent could open the door for overturning       any public land order since 1996.\n\nFurther, this would open the door for Twin Metals MN, a       subsidiary of the Chilean mining company Antofagasta,…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699274/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Wesley Bell", "party": "Democrat", "sentence": "…conditional, I am reminded why their work  matters. Black History Month isn't just about remembrance. It is about  vigilance.\n\nMr. Speaker, I stand here because they fought to open the door, and I  won't let anyone quietly close it.", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700077/st-louis-all-star-frankie-muse-freeman"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…jeopardize individuals' access to lifesaving       health insurance coverage.\n\nBruce Siegel, president and CEO of America's Essential Hospitals:\n\nThis budget resolution will open the door to devastating       Medicaid cuts that will impact millions of Americans,       especially those middle-to-low-income working Americans in       both rural and urban communities,…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…plans to address affordability, and I think today proves it.\n\nThey are beginning this new Congress with a bill that changes the  definition of ``showerhead'' in order to open the door for the Trump  administration to increase already rising monthly utility bills and to  waste our scarce water resources. This bill would actually increase  costs for consumers.…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698564/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…been the bulwark against Russian aggression in Europe since  1949. The alliance has more than doubled its membership since its  founding. Central to the enlargement is NATO's open-door policy,  enshrined in article 10 of the North Atlantic Treaty, which affirms a  core NATO tenet that any European nation that demonstrates a  willingness to contribute to…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688332/ukraine"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…investors a clear view of true costs.\n\nImportantly, it does so without rolling back investor protections or  weakening existing SEC oversight.\n\nThis bipartisan legislation will open the door for more investment in  BDCs, thereby unlocking more capital for small and mid-sized businesses  across the country. The most important thing that our financial  institutions…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697831/increasing-investor-opportunities-act"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…investment, and supporting initiatives  pursued by the city of Gary and the State of Indiana, this funding will  help bring new businesses, create good-paying jobs, and open the door  to new passenger services for the residents.\n\nI am also grateful for the HUD funding that will allow Gary and  Michigan City to tackle long-neglected vacant and unsafe…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699321/consolidated-appropriations-act-2026"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…our most vulnerable  citizens--seniors, veterans, kids, low-income families, and especially  the disabled. Today, that lifeline is being strained by illegal  immigration and open-door policies.\n\nWhile Democrats and sanctuary States deny the problem, the data is  clear. Let's be clear that every dollar spent on illegal immigration is  a dollar taken from…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690712/outrageous-government-funded-incentives"}, {"senator": "Ashley Moody", "party": "Republican", "sentence": "…harmful energy standard would force commercial fridge and  freezer manufacturers to discontinue product lines and close factories  in the U.S. The results would be layoffs and open the door for other  foreign competitors to step in instead of those here in our own  country.\n\nFood producers, distributors, wholesalers, grocery stores, consumers  would be severely…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690525/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "French Hill", "party": "Republican", "sentence": "…transaction: monitoring, controlling, and possibly  restricting how Americans could use their own hard-earned money. An  American Government-controlled digital dollar threatens to open the  door to government overreach here at home.\n\nIt would threaten individual privacy and stifle innovation by  undermining progress that we have seen from private-sector solutions…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693731/anti-cbdc-surveillance-state-act"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "Mr. BEAN of Florida. Mr. Speaker, some achievements don't just earn  applause, they open the door for others. Today, we honor someone who  has done just exactly that: Miley Meredith, the first female Eagle  Scout in Nassau County, Florida.\n\nFrom Troop 9152 of Scouting…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698832/congratulating-miley-meredith"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…seen, they have been overlooked,  underserved, and, frankly, undermined by the very government they pay  taxes to support. Federal agencies are simply not doing enough to open  the door for small businesses to compete. Mr. Speaker, this must  change.\n\nTo do that, I am proud to co-lead this bipartisan bill because  supporting our small businesses should…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691762/transparency-and-predictability-in-small-business-opportunities-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…or  legal supports aren't important or may have some potential relation to  someone's health, but they fall far outside the scope of what Medicaid  is intended for. They open the door for States to draw down Federal  funds or for services that are oftentimes entirely funded by the  States.\n\nIn 2023, as the then-subcommittee chairman for Energy and Commerce's…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691874/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…and maybe get the nice things in life. They don't have that  opportunity if this resolution fails. That is what is at stake.\n\nWe do a lot of other things that we will open up the door to go do in  reconciliation by passing this resolution. We secure America's border.  Now, again, this was a major issue on the campaign, and I know the  folks on the other…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689896/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…courses. She balances academic rigor with  leadership in volleyball, the art club, and the Girls Inc. Eureka!  program.\n\nHer extensive history of community service includes the Open Door  Mission and organizing gift drives for overseas troops and local  seniors. Ms. Anthony is known for her compassionate leadership and is a  role model for her peers.\n\nMr.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699725/happy-90th-birthday-to-beth-ragland"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…currency issuance within the  hands of the people's Representatives.\n\nA central bank digital currency would centralize unprecedented power  in the Federal Government and could open the door to real-time  surveillance of every financial transaction in America.\n\nExisting banking practices safeguard Americans' privacy. A CBDC could  undo that protection overnight,…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693733/anti-cbdc-surveillance-state-act"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…fashioned a flamethrower was an illegal  immigrant with a bad history.\n\nThere would be people who are good human beings in this country who  would be alive if we didn't have an open-door border policy. That is  the simple truth. It is not complicated.\n\nThat is not using Jews. It happened to be Jews that got hurt this  time. It is not using women when it was…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692192/denouncing-the-antisemitic-terrorist-attack-in-boulder-colorado"}]