[{"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…landscapers, mediators, chiropractors, funeral directors,  farmers, ranchers, freelancers, contractors, and gig workers, and now  they are stuck.\n\nAs open enrollment began and they opened their mail, they found that  their premiums, in some cases, doubled; in some cases, tripled. I heard  from a local restaurateur in my district, Lester Johnson. He and his…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696767/stories-from-home-the-human-cost-of-expiring-healthcare-tax-credits"}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "…receive both diagnostic and care  for cervical cancer, hypertension, and basic medical care.\n\nEarlier this year, the largest Planned Parenthood health center in  the country opened in my district, named after my predecessor and  champion of reproductive health and access, Congresswoman and now Mayor  Barbara Lee. The Barbara Lee Oakland Health Center…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694154/defunding-planned-parenthood"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…did not serve children.\n\nAfterward, Minnesota investigators visited 10 businesses he       identified and found that nine were operating normally; the       10th had not yet opened for the day when officials arrived.\n\nShirley's video prompted other conservative activists       around the country, including in San Diego, to follow his       lead.\n\nIn San…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699222/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…we carry wasn't born from our highs,\n\nBut was forged through our lows.\n\nSo dear Pages, a truth not often shared in this place,\n\nTo the young people who carried our water and opened our       doors with such grace:\n\nGreatness isn't achieved when you reach the highest ground.\n\nGreatness is forged when you get knocked down and despite       it all, rise,…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699130/senate-pages"}, {"senator": "John Mannion", "party": "Democrat", "sentence": "…Department of Education.\n\nLast year, one of our Nation's most fundamental laws, the Individuals  with Disabilities Education Act, or IDEA,  reached its 50th anniversary. IDEA opened the doors to opportunities  and protected the rights of millions of students with disabilities and  their families. It guaranteed a free, appropriate public education  where…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698941/protecting-education-for-children-with-disabilities"}, {"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…greatest force  that continues to distort our democracy: the role of money in our  politics.\n\nMr. Speaker, 16 years ago today, the Supreme Court's Citizens United  decision opened the floodgates to unlimited corporate and billionaire  spending in our elections, drowning out the voices of working people.  The decision overturned longstanding precedent…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699240/restoring-election-integrity"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…have seen is the  fundamental erosion of our democratic system, and at the rotten root of  it all is the influence of big money in politics. That is because  Citizens United opened the door for corporations and billionaires to  dump untold sums of money on to our elections anonymously and calling  corporations people.\n\nMr. Speaker, corporations are not…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699236/restoring-election-integrity"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…peaceful place for solemn remembrance.\n\nWith a rich history linking the site to the Native Hawaiian people  and the defense of Honolulu during the Second World War, the cemetery  opened to the public on July 19, 1949, with services for five who lost  their lives in service to our Nation: an unknown serviceman, two  Marines, an Army lieutenant and one civilian--noted…", "date": "2025-12-26", "source_url": "https://justfacts.votesmart.org/public-statement/1698471/introduction-of-hawaii-national-cemetary-act"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…must always stand with Ukraine against Russian aggression.\n\nBuffalo is known as the City of Good Neighbors, and that spirit has  been evident in the way our community has opened its doors to Ukrainian  refugees, providing shelter, education, and hope for a better future.\n\nMembers of this body, both Democrats and Republicans alike,  understand that…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687988/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "…were  available during the pandemic; securing multiple sources of public  funding for a Center for Recovery and Wellness, a substance use  disorder outpatient center that  opened in October 2024; and numerous additional legislative  accomplishments.\n\nIn addition to some of the civic engagements already mentioned,  Gerard has served on numerous other…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688302/recognizing-mr-gerard-j-grimaldi-on-his-retirement-and-expressing-appreciation-for-a-lifetime-of-dedicated-service-to-our-community"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…SAINT PAUL, Minn.--Congresswoman Betty McCollum (MN-04),       Dean of the Minnesota Congressional Delegation, issued the       following statement on Wednesday after a gunman opened fire       on a mass service during the first week of classes at       Annunciation Catholic School, killing two children and       wounding 17 others.\n\n``The horrific violence…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694811/mourning-the-tragic-shooting-at-annunciation-catholic-church-in-minneapolis-minnesota"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…tender age of 30, Beverly's impact resonated beyond her  lifetime. Her legacy of determination and excellence paved the way for  future Black educators, ensuring the doors she opened would remain open  for others to walk through.\n\nJimmy Carter, Basketball: No, not that Jimmy Carter, but still, he  looms large in west Michigan as a basketball phenom and…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688206/highlighting-notable-black-leaders-from-michigans-third-congressional-district"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…benefit cuts. I heard from  recipients who were worried, but I also heard from grocery stores,  rural and urban. I represent Surry County. Surry County has one grocery  store. It opened last year. Prior to that, it didn't have a grocery  store for 20 years. That meant that people in Surry County drove 30  minutes to go grocery shopping. They couldn't get a…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695041/better-is-possible"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…earlier, that will be measured in things like  cancer diagnoses. This gets personal pretty quickly when it is clean  air and health matters.\n\nInside the body, we have just opened an entirely new avenue for  mischief. It could be mischief by any 30 of us. Frankly, it could be  mischief by a minority of the majority who want to drive something  through…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691656/congressional-review-act"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…both  sides of the aisle to do that.                         Supporting Small Businesses\n\nMr. SUBRAMANYAM. Madam Speaker, since May, 33 new small businesses  have officially opened in Prince William County.\n\nThey include AlSham, a Syrian grocery store and bakery; GN Banquet  Center, an event venue; Modern Remodeling, a restoration service;  Shotted, a…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695057/school-funding-slashed"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…This food drive was used to educate the  students about the struggling Veterans in the community and to teach  about the importance of service to others. This project has also opened  their hearts to lend a helping hand to others in need. The students  look forward to this food drive every year and have such pride in  participating. The students also speak…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691946/recognizing-steven-walker"}, {"senator": "Barry Loudermilk", "party": "Republican", "sentence": "…expertise, training, and talents to continue to  serve others, Bart became a licensed private investigator and an  executive protection agent. As his reputation expanded, Bart opened his  own agency and began teaching and facilitating classes in private  investigation and executive protection. For a time, he served as a  member of the Georgia Board of Private…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698432/republicans-have-delivered-in-2025"}, {"senator": "Elise Stefanik", "party": "Republican", "sentence": "…County Board of Supervisors on the grounds of the old Hotel Champlain  on Bluff Point in Plattsburgh, New York, under Governor Nelson  Rockefeller's Administration. The College opened its doors to 216  students in 1969 and graduated its first cohort of students in 1971.\n\nThe College has since expanded to include the William Forrence  Health, Physical Education,…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691529/recognizing-clinton-community-college-day"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…goal of restoring nearly 100  acres of waterways by the City of Crystal River's 100th Year  Anniversary on July 3, 2023. To date, more than 850 new spring vents  have been opened, 107 plus acres have been cleaned of 680M plus pounds  of lyngbya algae and detrital materials from the riverbeds, and 590,000  plus eelgrass plants have been hand-planted.…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691243/recognizing-marie-bienkowski"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…land along the Chena River--the  Chena River runs right through Fairbanks--under the Homestead Act.\n\nIn 1959--by the way, the same year Alaska became the 49th State--Pike  opened the original Pike's Landing. Throughout the years, Pike's  Landing cemented itself as a landmark in the Fairbanks community.\n\nWhen Jay purchased Pike's Landing in 2000, he…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690106/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…with a disability in America  should have access to a high-quality public education.\n\nWhen Congress passed IDEA in 1975, it was a landmark step toward  educational equity. It opened classroom doors to ensure that every  child with a disability could grow, learn, and succeed at school. The  legislation expanded opportunities for millions of students with…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697493/9999"}, {"senator": "Carlos Gimenez", "party": "Republican", "sentence": "…the 100th  anniversary of St. Theresa Catholic School, a pillar of faith,  education, and community in the heart of Coral Gables, Florida.\n\nIn 1925, the Sisters of St. Joseph opened a school with 70 students,  planting the seed for one of south Florida's most distinguished  Catholic schools. In 1991, the Carmelite Sisters began administering  and teaching,…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696910/congratulating-st-theresa-catholic-school"}, {"senator": "Shelley Capito", "party": "Republican", "sentence": "…submit their final  rules to the Senate and to the House of Representatives. When a rule is  submitted to Congress and published in the Federal Register, a 60-day  period is opened for any Member to introduce a resolution of  disapproval that, if passed by both Chambers and signed by the  President, prevents the rule from taking effect. These resolutions,…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691584/hj-res-88"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…the only company that builds noncondensing tankless water  heaters on American soil.\n\nRinnai America is headquartered in my hometown of Peachtree City, and  3 years ago, it opened a state-of-the-art facility in Griffin, Georgia,  two cities I proudly represent in this Congress.\n\nOver 500 of my constituents are working to manufacture and market the  very…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688098/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions-and-providing-for-consideration-of-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…congressional  family stands with you in prayer and support.\n\nNow, standing in Jim's place, I will turn to the business before us.\n\nRepresentative Roy and I agree on how we opened this, but not on much  more this morning because we see a different view on this 100th day  that is marking Trump's service in office, 100 days of chaos,  corruption, and economic…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690387/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…will ever be able to forget 9/11--U.S. airspace was shut  down. The people of Canada stepped right up to the plate. They  immediately implemented Operation Yellow Ribbon. They opened their  airports. The Canadians opened their homes. The Canadians opened their  hearts to 33,000 Americans who were stranded.\n\nThere is a little town in Newfoundland called…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689486/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Hal Rogers", "party": "Republican", "sentence": "…at  home. Every department responded, along with support from the Kentucky  National Guard and other emergency teams from across the state. Local  churches and schools were opened in the early hours after the storm to  give tornado survivors a safe place to shelter and recover. In the days  following the storm, law enforcement officers from every department…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692791/recognizing-first-responders-in-laurel-county-kentucky"}, {"senator": "Roger Marshall", "party": "Republican", "sentence": "…Look, long before we knew what MAHA moms were, my grandmothers were  MAHA grandmothers, and my mother was a MAHA mom. And my wife was  cooking MAHA food, as well. They seldom opened a box. If you are  opening a box to cook, think twice about it.\n\nAnother good option, as we discussed what the new guidelines are, is  putting water back where it belongs.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698680/9999"}, {"senator": "James Risch", "party": "Republican", "sentence": "…person) or\n\n(6) may divulge matters required to be kept confidential       under other provisions of law or government regulations.\n\nA closed meeting or hearing may be opened by a majority       vote of the committee.\n\n(g) Staff Attendance.--A member of the committee may have       one member of his or her personal staff, for whom that member…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691700/us-senate-committee-on-foreign-relations-rules-of-procedure"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…greatest sports       moment of the 20th century by Sports Illustrated.\n\n(9) The historic win brought ice hockey to the front-page       of newspapers everywhere, and forever opened the door to the       National Hockey League for players born in the United States.       The impact of the event was far-reaching and is still being       felt today.\n\n(10)…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695439/miracle-on-ice-congressional-gold-medal-act"}]