[{"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…consume.\n\nMadam Speaker, I rise in support of the bill before us today, H.R.  5788, the 504 Program Risk Oversight Act.\n\nMadam Speaker, transparency is key to ensuring the proper operation  and functioning of the SBA lending programs, including the 504/CDC  program. This bill will give the Committee on Small Business the  necessary information to carry out…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699187/504-program-risk-oversight-act"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…servants. They are leaving the Federal Government workforce not  as happy campers, and everybody knows it.\n\nThis follows workers like Dr. Peter Marks, who is one of the heroes  of Operation Warp Speed and one of the lead scientists at the FDA.  There are hundreds of others, unfortunately, following in their  footsteps.\n\nTo shed light on this issue, for example,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691390/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…Renee and Alex should be alive today, and as we honor their  memories, I am on the floor again today following the administration's  announcement of its plan to finally end Operation Metro Surge and drawn  down the thousands of federalized agents that aren't just in  Minneapolis or St. Paul--that, actually, I don't think people quite  understand. They…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700059/9999"}, {"senator": "Raphael Warnock", "party": "Democrat", "sentence": "…but her initial excitement quickly gave way to fear and anxiety  as her pregnancy proved to be most difficult.\n\nDuring the pregnancy, doctors needed to perform an emergency  operation, followed by an unexpected C-section delivery. And at the  time of her pregnancy, Bristeria was working a part-time job that did  not offer health benefits.\n\nThrough family,…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689540/h-con-res-14"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…circumstances, many at great personal risk and an  immeasurable cost in the loss of Renee, Alex, and the 40 others listed  here.\n\nI join my fellow Minnesotans in calling for Operation Metro Search to  end now. It is incumbent on every single one of us to honor their  resilience, embrace their courage, and put an end to this senseless and  preventable suffering…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699669/horrific-ice-abuses"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…on Appropriations with the following amendment:\n\nAt the appropriate place, insert the following:\n\nSec. __. Of the amounts appropriated in this Act under the       heading ``Operation and Maintenance, Defense-Wide'', for the       Defense Security Cooperation Agency, $300,000,000, to remain       available until September 30, 2027, shall be for the Ukraine…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693693/department-of-defense-appropriations-act-2026"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…separate measures to address these specific  consequences.\n\nThe overall answer for our country to this national security risk is  not to force any and all fabrication, repair and operation exclusively  into our country since that just compounds a problem we can't  effectively fix. It is instead to cease rewarding our adversaries and  start incentivizing our…", "date": "2025-08-01", "source_url": "https://justfacts.votesmart.org/public-statement/1694572/introduction-of-the-merchant-marine-allies-partnership-act"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…and they must be confronted aggressively and dismantled  thoroughly.\n\nBut that is not what is happening here. Let me begin with the most  fundamental question: What is the operation actually meant to  accomplish?\n\nThe administration has emphasized fentanyl as the primary  justification for these strikes. Yet their own officials have  acknowledged that…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696553/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…have not only looked at the costs of climate change; they  have also studied the economic benefits of eliminating carbon  pollution. An OECD--Organisation for Economic Co-operation and  Development--study suggests that the most advanced economies on our  planet would enjoy an increase of 60 percent in GDP by 2050--those  societies, 60 percent richer…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699613/9999"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…talking to oil companies before the strikes but not to Congress?\n\nThe Gang of 8, not all of us--I understand 535 of us can't be briefed  on an ongoing, kinetic, risky military operation. I am an adult here. I  don't think we have a right to know--all 535 of us--but there is a  thing called the Gang of 8. They are supposed to be trusted with the  most sensitive…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698623/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…a  country tried to do this to American leaders? Of course not. So we  should stop playing dumb. Trump can't just say magic words and pretend  this wasn't a major military operation.\n\nThis is the U.S. Congress, and we have a constitutional role to be a  check on the President. Only Congress can declare war, and Congress did  not authorize the use of…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698684/9999"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…personnel were involved in planning and executing the raid that seized  Maduro.\n\nA mobilization of this size costs hundreds of millions of dollars, if  not billions. This operation is, and apparently always has been, about  one thing: seizing control of Venezuela's oil. President Trump and his  closest advisers have made that clear. It is about President…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698606/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…told would  never come to pass, by a President who promised to avoid starting new  foreign wars, engaging in nation building, or conducting regime change  operations.\n\nThis operation was not about narcotics, nor was it about democracy,  nor was it about oil. The military occupation in Venezuela captured the  country's corrupt dictator but has left the…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699093/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…forcing 1.5 million people to flee to Bangladesh and  Thailand. A recent investigation by the United Nations concluded the  2017 attacks were a ``coordinated and organized operation'' to strip  the Rohingya of their land rights within the country. In 2022, the  State Department officially determined that these actions constituted a  genocide.\n\nToday,…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697902/burma"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…certainly do not sound like mere drug enforcement  against organized criminals--not even close. These are actions you take  before you consider launching a major military operation against  another country, and that authority--the Constitution is clear--must  come from Congress.\n\nNobody here denies the Maduro regime is horrific and undemocratic,  and…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696558/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…Space Command, 91st Training Division, 5th armored  Brigade, 99th Regional Support Command, and the 222nd Broadcast  Operations Detachment.\n\nSFC Macleod deployed in support of Operation Desert Storm, Operation  Private Comfort, Operation Iraqi Freedom, and Operation Sandy in New  Jersey. A highly trained professional, he completed advanced courses in  leadership,…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696275/recognizing-sergeant-first-class-alyn-michael-macleod-usa-retired-with-a-congressional-veteran-commendation"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…Congress assembled,       SECTION 1. SHORT TITLE.\n\nThis Act may be cited as the ``Secure Our Ports Act of       2025''.       SEC. 2. PROHIBITION ON CERTAIN CONTRACTS FOR PORT OPERATION                     AND MANAGEMENT.\n\n(a) In General.--Subchapter II of chapter 700 of title 46,       United States Code, is amended by adding at the end the       following:…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692209/secure-our-ports-act-of-2025"}, {"senator": "Paul Gosar", "party": "Republican", "sentence": "…facilities.\n\n``(2) Operations and maintenance.--The contract for the       Arkansas Valley Conduit shall provide for the assumption by       the contracting parties of the care, operation, maintenance,       and replacement of the conduit.''; and\n\n(2) in section 2(b)(3)(A), by striking ``this section'' and       inserting ``subsection (d) of the first section''.…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693879/finish-the-arkansas-valley-conduit-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Allied troops who took part in the D-Day invasion. That historic day  changed the course of World War II and, ultimately, the course of world  history. But behind that massive operation were brave individuals like  Floyd--young Americans from small towns like Wauchula, Florida--who  answered the call to serve without hesitation. Mr. Wells' bravery, and…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692492/recognizing-henry-floyd-wells"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…if there  were not one Commander in Chief but 535, and we had to sit down and  talk among ourselves and debate as to whether or not we should go  forward with the military operation in question. That would paralyze  this country.\n\nAnd this leak of the defense intelligence assessment tells you  exactly what would happen if they brought this problem over…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693122/motion-to-discharge-sj-res-59"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…Control Act of 1941 established that this river should be  maintained at 9-feet deep and 100-feet wide.\n\nIn 1956, the Army Corps of Engineers classified the project as an  operation and management project to be maintained at 9-feet deep and  100-feet wide for a 17-mile stretch of a river that runs through a  density of population and has never been maintained.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694867/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…Marjorie  became an inspector, where she played a critical role in maintaining  records on the Briggs & Stratton airplane engines being rebuilt at the  facility until the operation closed in 1945.\n\nMarjorie's legacy, however, goes far beyond the factory floor. After  marrying her husband John David Curtiss, she raised four children, put  herself through…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690143/recognizing-marjorie-curtiss"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…creation of both Fisher House I and  II, providing families of hospitalized veterans a place to stay during  long-term care. She was also instrumental in founding the monthly  Operation Helping Hand dinners at JAHVH SCI, ensuring that veterans and  their families received nourishment, fellowship, and support.\n\nBeyond her service, Mary Ann was a loving mother…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697717/recognizing-mary-ann-keckler"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…was as a Tank Platoon Leader with  3rd Platoon, Battle Company, 1st Battalion, 66th Armored Regiment at  Fort Carson, Colorado. In 2019, he deployed to Kuwait in support of  Operation Spartan Shield, where his leadership made a significant  contribution to the mission's success. Upon returning, he served as the  Headquarters Company Executive Officer,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695837/recognizing-united-states-army-captain-mike-retzlaff"}, {"senator": "Ronny Jackson", "party": "Republican", "sentence": "…quickly  became my Director of Operations the following year. During her time in  my office, Kathy worked diligently behind the scenes to ensure the  smooth and effective operation of my office. From travel,  events, and meeting coordination to office administration, she  consistently demonstrated precision and professionalism. She also  greatly contributed…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697542/recognizing-and-expressing-gratitude-to-former-director-of-operations-kathy-zhu"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…the House the bill (H.R. 261) to amend       the National Marine Sanctuaries Act to prohibit requiring an       authorization for the installation, continued presence,       operation, maintenance, repair, or recovery of undersea fiber       optic cables in a national marine sanctuary if such       activities have previously been authorized by a Federal…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699943/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…I remember, on  9/11--who will ever be able to forget 9/11--U.S. airspace was shut  down. The people of Canada stepped right up to the plate. They  immediately implemented Operation Yellow Ribbon. They opened their  airports. The Canadians opened their homes. The Canadians opened their  hearts to 33,000 Americans who were stranded.\n\nThere is a little…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689486/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…and continued his reserve duty  through 2012. During his distinguished military career Mac was also a  Reconnaissance Officer and deployed to the Middle East in support of  Operation Desert Shield, Desert Storm, and in support of the Global War  on Terror.\n\nMac was decorated with four awards for exceptional individual service  and received numerous awards…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695496/thanking-john-mcintyre-mac-tolar-for-his-dedicated-service-to-our-nation"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…online  predation, I am proud of the work multiple sheriff offices, as well as  state and federal agencies did to arrest 13 suspects during an online  child sexual predator operation in my district and in surrounding  communities last fall.\n\nImagine how much more ``Big Tech'' would be willing to do to shut  down the predator superhighway if they faced…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699543/true-cost-of-big-tech"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…Mr. President, also last week, an Afghan evacuee was  arrested for threatening to bomb a building in Texas. The terrorists  entered our country as part of a program called Operation Allies  Welcome in the aftermath of the Biden administration's chaotic  withdrawal from Afghanistan.\n\nSince 2021, I have warned the Biden administration, my congressional…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697333/national-security"}]