[{"senator": "Bennie Thompson", "party": "Democrat", "sentence": "Under Putin's rule, Russian intelligence operations pose one of the  most aggressive and sophisticated threats to our national security.", "title": "Three-Year Anniversary of Russia's Brutal Attack on Ukraine", "date": "2025-02-25"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "Whether it is through communications equipment,  the networks themselves, or social media, we have seen these operations  time and time again, which is why we must stay vigilant to minimize  these risks or avoid them altogether.", "title": "Foreign Adversary Communications Transparency Act", "date": "2025-04-28"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "Now, he is telling us that he is going to leave the Federal  Government in just a few weeks to expand his data and AI operations, as  he announced last week, with his own AI company, of which a number of  the executives are actively operating inside the Federal Government  with DOGE right now.", "title": "Demanding Answers", "date": "2025-04-01"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "President, among the bills in the funding package  that was signed into law yesterday was the State and Foreign Operations  appropriations bill.", "title": "-9999", "date": "2026-02-04"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "Building on this progress, my Administration established the       Safe and Beautiful Emergency Operations Center to coordinate       public safety and beautification efforts as the presidential       emergency declaration ends.", "title": "Common-Sense Law Enforcement and Accountability Now in DC Act of 2025", "date": "2025-11-19"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "ICE must adhere to the Constitution and use only judicial  warrants for its enforcement operations.", "title": "Providing for Consideration of Senate Amendments to H.R. Consolidated Appropriations Act, Providing for Consideration of H.J. Res. Disapproving the Action of the District of Columbia Council in Approving the D.C. Income and Franchise Tax Conformity and Revision Temporary Amendment Act of and Providing for Consideration of H.R. Critical Mineral Dominance Act", "date": "2026-02-03"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "One repeal removes the requirement to inspect drilling areas for  hazards before operations begin and gets rid of the need to repair  dangerous drilling equipment.", "title": "Trump's Labor Agenda: Unsafe and Underpaid", "date": null}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "And they must testify about what the end state of these  military operations would actually look like.", "title": "Directing the Removal of United States Armed Forces From Hostilities Within or Against Venezuela That Have Not Been Authorized By Congress--", "date": "2025-11-06"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "In a       letter dated October 27, 2021, the Department of Defense       (DoD) described the potential impacts to military operations       for the project.", "title": "Halt Work Orders", "date": null}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "Despite the President's promises to not start new wars nor pursue  regime change operations abroad, today there are 15,000 brave U.S.", "title": "Providing for Congressional Disapproval Under Chapter 8 of Title United States Code, of the Rule Submitted By the Environmental Protection Agency Relating to ``Air Plan Approval; South Dakota;", "date": "2026-01-07"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "Special Operations  Commander Admiral Frank Bradley, and retired U.S.", "title": "Supporting of H. Con. Res. 61 and H. Con. Res. 64", "date": "2025-12-17"}, {"senator": "Richard Neal", "party": "Democrat", "sentence": "Over the course of his career, he  has accumulated more than 3,150 flight hours in the F-15 Eagle and  other aircraft, and has participated in combat and support missions in  Operations SOUTHERN WATCH, ENDURING FREEDOM, and ATLANTIC RESOLVE.", "title": "Recognizing Colonel David ``moon'' Halasi-Kun", "date": "2026-01-08"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "For this reason, I urge       you, Cory Booker, to take immediate action to restore normal       federal grant operations so that my colleagues and I can       continue making paradigm-shifting, state-of-the-art       discoveries with the potential to save millions of lives.", "title": "Privileges of the Floor", "date": "2025-03-31"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "The impacts of these tragedies and aggressive operations continue to  be felt every single day and are staunchly opposed because the people  targeted are an inseparable part of the fabric of their communities.", "title": "Horrific Ice Abuses", "date": "2026-02-04"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "Criminal organizations could then use this  information to adjust their operations and try to avoid enhanced CBP  inspections.", "title": "Special Interest Alien Reporting Act of 2025", "date": "2025-06-26"}, {"senator": "John Carter", "party": "Republican", "sentence": "It provides requested  resources for the American Battle Monuments Commission, Armed Forces  Retirement Home, and operations at Arlington National Cemetery.", "title": "Continuing Appropriations and Extensions Act, 2026", "date": "2025-11-12"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "What authority did this operation exceed that  President Obama or President Reagan did not exceed in operations in  Libya?", "title": "Venezuela", "date": "2026-01-08"}, {"senator": "John Thune", "party": "Republican", "sentence": "Current projects can face delays  and cost overruns, and the appropriate resources may not always be  available for operations.", "title": "Government Funding", "date": "2026-02-02"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "However,  these propaganda operations didn't stop at higher education.", "title": "Promoting Responsible Oversight to Eliminate Communist Teachings for Our Kids Act", "date": "2025-12-04"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "The Red Tape Hotline empowers small business owners to speak up and  help Office of Advocacy hold Federal agencies accountable for the red  tape that is crushing their day-to-day operations.", "title": "Destroying Unnecessary, Misaligned, and Prohibitive Red Tape Act", "date": "2025-12-02"}, {"senator": "James Risch", "party": "Republican", "sentence": "The proposed sale will enhance Estonia's capability to meet       current and future threats by providing a credible force that       is capable of deterring adversaries and participating in NATO       operations.", "title": "Arms Sales Notification", "date": "2025-06-05"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "Alaska, the Last Frontier, is well positioned to play a key role in  our Nation's space operations.", "title": "Space Dominance", "date": "2025-02-24"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "The duties of the Committee staff       shall be performed, and Committee staff personnel affairs and       day-to-day operations, including security and control of       classified documents and material, shall be administered       under the direct supervision and control of the Staff       Director.", "title": "U.S. Senate Select Committee on Intelligence Rules of Procedure", "date": "2025-02-26"}, {"senator": "Joni Ernst", "party": "Republican", "sentence": "As we continue to uncover and pursue fraud, it is critical that we  have a Deputy Administrator who can identify and evade those pitfalls  while simultaneously ensuring the Agency's day-to-day operations are  running smoothly.", "title": "-9999", "date": "2025-07-09"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "When United Way activated its FRC in  Ridge Manor, Donna oversaw operations for distribution at the center-- prepackaging food and toiletry bags, creating a procedure to collecting  and filling the needs, and organizing all items donated to us and  distributed out.", "title": "Recognizing Donna Telesco", "date": "2025-06-09"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "After his tenure as a company commander, Rob was stationed at the  Pentagon as an Army Staff operations officer.", "title": "Recognizing the Service of Major Robert Coleman", "date": "2025-07-23"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "I would then ask my distinguished friend from Alaska: Isn't it a fact  that General Caine time and again has demonstrated his aptitude and  leadership abilities while actually deployed in combat zones, leading  servicemembers in Iraq and Syria, and while serving in various Special  Operations forces units and also in the intelligence community and that  he ran some of our most secretive programs for the security of  Americans?", "title": "Authorizing Representation By the Senate Legal Counsel in the Case of Desmond Bellard V. Ronald Wyden, U.S. Senator", "date": "2025-04-10"}, {"senator": "James Risch", "party": "Republican", "sentence": "Should       hostilities resume, we anticipate Israel will recommence its       military operations in Gaza in the near-term.", "title": "Arms Sales Notification", "date": "2025-03-03"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "Instead, under the previous administration, American support was  delayed, restricted, and paired with attempts to micromanage Israel's  operations and even interfere with Israeli politics.", "title": "-9999", "date": "2025-06-24"}]