[{"senator": "Joe Courtney", "party": "Democrat", "sentence": "…shortage is real. Just go  to any hospital, nursing home, or health clinic in your district, and  you will hear the same thing: they are short-staffed in ERs, exam  rooms, operating rooms, and on the floors. Short-staffing is bad for  patients, and it is bad for nursing burnout.\n\nDespite this blindingly obvious reality, the Education Department's  designation…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697261/nursing-excluded-as-professional-degree-by-department-of-education"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Pennsylvania, 321 people lost their lives. These deaths were  preventable.\n\nAdvanced drunk and impaired driving prevention technology will  prevent impaired drivers from illegally operating vehicles and causing  deaths and injuries. I understand that my Republican colleagues are  concerned about privacy, but the technology being developed does not  track the…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699286/amendment-no-1-offered-by-mr-massie"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…epidemic  in our country.\n\nI met with representatives of Peninsula Behavioral Health in Port  Angeles, WA, and Sound Health in King County, who told me that clinics  are already operating on narrow margins and have already sustained a 1- percent budget cut this year at the State level. If Congress passes the  budget reconciliation bill and enacts policies…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692972/one-big-beautiful-bill"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…site seemingly from a sense of  noble obligation with wonky academic explanations about why everything  is fine, even when everyday Americans can't make ends meet. I had an  operating engineer tell me last week that he thinks that both parties  are pissing on his leg and telling him that it is raining.\n\nWe have to understand that working people do not…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689078/economic-populism"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…money, that $4,000 that  was paid at the point of entry, is now collected from you because the  person who is selling, purveying, does not want to pay that because  they are operating possibly on a thin profit margin. They already have  an overhead that they have to consider, so you pay it.\n\nNow it goes into the Treasury, and here is where it gets really…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690093/protecting-the-american-dream"}, {"senator": "George Whitesides", "party": "Democrat", "sentence": "…independent agency and has  given DOGE the green light to cut USPS staff and gut services.\n\nLet me be clear. The United States Postal Service does not use  taxpayers dollars for operating costs. Reducing post office locations  will lead to slower service, longer wait times, and delays in receiving  packages, medications, and other necessary deliveries.\n\nI…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1692996/closure-of-quartz-hill-post-office"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…ago.\n\nThe better path is to quickly lift the order, meet face-to-face with  the developer and the Governors of Rhode Island and Connecticut to end  this chaos and get the operating engineers, the longshoremen, the  laborers, and the electrical workers back on track to finish the job  that today is 80 percent finished.\n\nThat is not a partisan statement.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695066/halt-work-orders"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…nothing to help small businesses grow  or adjust to supply chain disruptions or unexpected tariff costs.  Rather, it will actually make it harder for thousands of legally  operating small businesses to get the financing they need at a time  they need it most.\n\nSBA loans are supposed to help creditworthy businesses that cannot  get loans elsewhere. That…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692125/american-entrepreneurs-first-act-of-2025"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…carry Americans' most sensitive personal and government data  on a daily basis, so we must have a clear understanding if any foreign  adversary countries or the companies operating within those countries  are investors in our networks.\n\nWith this bill, we continue to secure our communications networks,  protect Americans and their personal data, and…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690266/foreign-adversary-communications-transparency-act"}, {"senator": "Julia Brownley", "party": "Democrat", "sentence": "…Mr. Chair, I have spoken directly with senior DOD officials who have  shared with me the potential benefits cultivated meat could bring to  readiness. This includes from operating in harsh bases to sustaining  missions where supply lines are contested or disrupted.\n\nKeeping the option open for DOD research and evaluation ensures we  remain competitive…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695257/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…funding is on the chopping block. Medicaid funding provides lifesaving  care for millions of Americans.\n\nMedicaid is America's healthcare safety net. Without it, hospitals  operating on thin margins will close, medical debt will skyrocket, and  kids across the country will suffer.\n\nAmericans on Medicaid are your grandparents, your neighbors, your  friends,…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690296/medicaid-is-americas-healthcare-safety-net"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…closing three primary care centers in western  Virginia as part of its response to the one big, ugly big.\n\nIt is not hyperbole. You have rural hospitals that are already  operating on the margins who now are going to have to provide more  uncompensated care.\n\nMr. Speaker, when people come off of Medicaid and when the Enhanced  Premium Tax Credits for…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695041/better-is-possible"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…privacy, basic privacy, for the veterans who are  talking about their innermost doubts and fears; service lines at VA  hospitals and clinics that have been halted; beds in operating rooms at  VA facilities that have been suspended. We are hearing about VA supply  teams now understaffed and behind on placing critical supply requests  for medication and…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690353/9999"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…workers that I carry with me into this Chamber every day because  even upon her firing for trying to organize as a factory worker, my  mother became one of the first women operating engineers to work on  heavy equipment in the State of New Mexico. That is the spirit I see  all across our State.\n\nJust last week, we stood in solidarity with striking workers…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695576/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Diana DeGette", "party": "Democrat", "sentence": "…are out of  control.\n\nPresident Trump and Secretary Noem have turned ICE and border patrol  into masked paramilitary forces that are terrorizing our neighborhoods.  They are operating outside the law, terrorizing our communities,  violating court orders, and shooting and killing immigrants and  American citizens alike.\n\nI cosponsored Articles of Impeachment…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699910/holding-ice-accountable"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…Nation's defense infrastructure. Its civilian  experts, many of them veterans, produce, repair, and innovate the  equipment our troops depend on from the front lines to forward  operating bases.\n\nEvery rifle sight calibrated, every artillery shell inspected, and  every 3D-printed replacement part shipped from Rock Island shortens the  time between a soldier's…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693676/department-of-defense-appropriations-act-2026"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…reliable broadband connections  are essential to their operations. After all, it helps deploy  technologies that increase productivity, produce higher yields, and  minimize operating costs.\n\nToday's smart agriculture technology, from autonomous tractors to  distributed soil sensors, rely on internet connections to share data.\n\nIn fact, farmers use information…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693469/precision-agriculture-satellite-connectivity-act"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…small businesses can't afford the extensive legal and  regulatory expertise that large, multinational firms employ to comply  with every regulation while still managing their operating costs.\n\nRecognizing that company sizes and market dynamics constantly evolve,  my bill requires the SEC to update its definition of ``small entity''  every 5 years.\n\nFor…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693958/small-entity-update-act"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…rulemaking is expected       to reduce energy costs for consumers, making heating,       cooking, and electricity more affordable for households. For       manufacturers, it lowers operating expenses, enabling greater       investment in production and job creation, which in turn       stimulates economic growth and strengthens the overall       economy. Disapproving…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688182/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…that every person who comes to an ER receives care. Day or  night, emergency nurses answer the call of duty--providing quality care  to patients in critical condition while operating in demanding, high- stakes environments where every second counts. Emergency nurses work  around the clock, caring for patients of all ages and across every  specialty--from…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696115/recognizing-emergency-nurses-week"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…Congress on ending this  exploitative relationship with China. Again, this is not dealing with  another country on the basis of good faith and a knowledge that  everybody is operating from the same set of rules and norms. China does  not, and we have recognized that more recently, but it is important to  reemphasize because some people, I think, still…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688824/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…department,  ambulance services, outpatient services, and more.\n\nToday, 42 rural hospitals in 17 States have transitioned to a rural  emergency hospital model and, hence, are still operating. Some States  are still working to establish the necessary hospital licensing  flexibility so that they can participate in this program.\n\nRural emergency hospitals have been…", "date": "2025-10-16", "source_url": "https://justfacts.votesmart.org/public-statement/1696257/rural-emergency-hospital-program"}, {"senator": "French Hill", "party": "Republican", "sentence": "…partnerships play an integral role in our ability to safeguard  the U.S. financial system and our national security.\n\nMrs. Beatty's commonsense bill authorizes private-sector firms,  operating under an OFAC license, to conduct nominal transactions with  sanctioned entities, allowing them to more effectively trace funds and  uncover illicit networks during financial…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693944/ofac-licensure-for-investigators-act"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…this Act, and appointing a Secretary of the Coast Guard, the       Commandant, in coordination with the Secretary of the       Department in which the Coast Guard is operating, shall--\n\n(A) develop a plan on the structure, feasibility of the       Secretary of the Coast Guard position and the reorganization       and restructuring of the Coast…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…the following:\n\n(A) Mobile service.\n\n(B) Mobile communications equipment or services.\n\n(C) Commonly used mobile phones and other mobile devices.\n\n(D) Commonly used mobile operating systems and       communications software and applications.\n\n(5) A discussion of the barriers for providers of mobile       service to adopt more efficacious encryption and…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693423/understanding-cybersecurity-of-mobile-networks-act"}, {"senator": "Max Miller", "party": "Republican", "sentence": "…is the first  in Ohio ever to win it.\n\nThe department focuses on fitness, mental wellness, financial  wellness, and family programming to keep its officers supported and  operating at the highest levels.\n\nPhysical wellness is supported by onsite gym access, organized  challenges and workouts, and free wellness exams and cancer screenings.  Its mental…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697742/congratulating-the-independence-police-department"}, {"senator": "Michael Cloud", "party": "Republican", "sentence": "…million for the ARDP  demonstration programs and $77 million for risk-reduction projects. We  secured close to $5 billion in Army Corps projects that improve  navigation and operating waterways for vessels which strengthens our  economy, helps us to export, and helps us to lead on the world stage.\n\nProjects like the Matagorda and Corpus Christi Ship Channel…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694857/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…family.\n\nBorn on Christmas Eve in 1919, Hazel would go on to serve her country  with extraordinary courage in World War II. Hazel enlisted in the Navy  Reserves and served as an operating room nurse at U.S. naval hospitals  from Portsmouth to Newport and even overseas in Bermuda.\n\nIn the darkest days of the war, she answered her country's call with  the steady…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699733/happy-106th-birthday-to-hazel-womble"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "…claims.--\n\n``(i) In general.--Subject to clauses (ii) and (iv), the       Secretary may expend funds that have been appropriated or       otherwise made available for the operating expenses of the       Department to pay claims for money damages against the United       States, in accordance with the first paragraph of section       2672 of title 28,…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696951/combatting-international-drug-trafficking-and-human-smuggling-partnership-act-of-2025"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…digital  currency is ever created by the Federal Reserve, it must be debated,  authorized, and legislated by Congress instead of unilaterally  developed by unelected bureaucrats operating behind closed doors.\n\nThe potential consequences are too significant to permit unchecked  bureaucratic experimentation with tools that could fundamentally  redefine the relationship…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693544/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}]