[{"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…vaccines  to military personnel.\n\nIn order to maintain the strength of our military, we need people  equipped for whatever the world throws at them, and that includes  diseases.\n\nOperation Warp Speed was a success. Over 95 percent of Active-Duty  personnel were vaccinated. While no vaccine is perfect, only three  individuals who took the vaccine while on Active…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695621/vaccines-protect-our-communities"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…immeasurable loss following the tragedies of recent months.\n\nThe Trump administration's reckless actions and deliberate inaction  from Republicans in Congress jeopardize the operation and availability  of facilities that are the first site of care in the most tragic  circumstances.\n\nI have a responsibility to be abundantly clear, Madam Speaker. The  consequences…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698783/unaffordable-health-care-costs"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…Renee and Alex should be alive today, and as we honor their  memories, I am on the floor again today following the administration's  announcement of its plan to finally end Operation Metro Surge and drawn  down the thousands of federalized agents that aren't just in  Minneapolis or St. Paul--that, actually, I don't think people quite  understand. They…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700059/9999"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…and they must be confronted aggressively and dismantled  thoroughly.\n\nBut that is not what is happening here. Let me begin with the most  fundamental question: What is the operation actually meant to  accomplish?\n\nThe administration has emphasized fentanyl as the primary  justification for these strikes. Yet their own officials have  acknowledged that…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696553/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…these boats could  have, per the law, been intercepted by the Coast Guard and suspected  traffickers questioned and prosecuted in a U.S. court, this is not a  counternarcotics operation.\n\nThe administration's actions, whether the largest military deployment  to the region since the Cuban Missile Crisis, the seizure of a  Venezuelan oil tanker, ordering a…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698248/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…on Appropriations with the following amendment:\n\nAt the appropriate place, insert the following:\n\nSec. __. Of the amounts appropriated in this Act under the       heading ``Operation and Maintenance, Defense-Wide'', for the       Defense Security Cooperation Agency, $300,000,000, to remain       available until September 30, 2027, shall be for the Ukraine…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693693/department-of-defense-appropriations-act-2026"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…militarization of our Federal Government and its impact on States like  yours of Oregon and mine of Illinois.\n\nWhat I am finding as I read the newspaper accounts is that the ICE  operation from the Department of Homeland Security in Illinois  continues to intimidate people who live in the city, in their  neighborhoods, and all around, and bring fear to parts…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696348/trump-administration"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…servants. They are leaving the Federal Government workforce not  as happy campers, and everybody knows it.\n\nThis follows workers like Dr. Peter Marks, who is one of the heroes  of Operation Warp Speed and one of the lead scientists at the FDA.  There are hundreds of others, unfortunately, following in their  footsteps.\n\nTo shed light on this issue, for example,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691390/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…(DHS). I will vote no on H.R. 7148  because it does nothing to stop the dangerous and illegal activity of  ICE and Border Patrol agents.\n\nThe Department of Homeland Security's Operation Metro Surge, under  the direction of Secretary Noem, has brought 3,000 unidentified federal  agents into Minnesota's communities. This surge is not about  immigration enforcement.…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699913/consolidated-appropriations-act-2026"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…lives to perform.\n\nMore broadly, what troubles me most is the administration's refusal  to explain itself to Congress and the American people. This suggests  they know this operation and the tortured legal rationale they use to  justify it cannot withstand scrutiny.\n\nChairman Wicker--and I applaud him for his very forceful  determination to investigate…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697387/caribbean-boat-strike"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…as police officers,  intelligence officers, and servicemembers in our Armed Forces. One of  those patriots was CPT Humayun Khan, who died in service to our country  during Operation Iraqi Freedom. His efforts alone saved the lives of  more than 100 soldiers, and I still remember his mother and father  speaking at a political convention and holding up…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698866/commerce-justice-science-energy-and-water-development-and-interior"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…in countless hearings and  markups. We identified the most powerful messages and amplified them in  the press and on social media.\n\nDaniel built the greatest social media operation of any Committee on  Capitol Hill--training and supervising staff that were nimble,  provocative, and engaging. Under his supervision the number of  subscribers and their…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693365/recognizing-daniel-rubin-and-his-service-to-the-house-of-representatives"}, {"senator": "Kweisi Mfume", "party": "Democrat", "sentence": "…assistance in  getting the federal resources necessary for a wiretap. Mr. Barron  personally lobbied law enforcement leaders and secured those  resources--and after a 6-month operation, 39 people across 4 criminal  networks were arrested, 67 firearms were confiscated, 15 stolen  vehicles were recovered, and more than $350,000 in drug money was  seized.…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688210/recognizing-a-trailblazing-career-in-criminal-justice-us-attorney-erek-lawrence-barron"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…have not only looked at the costs of climate change; they  have also studied the economic benefits of eliminating carbon  pollution. An OECD--Organisation for Economic Co-operation and  Development--study suggests that the most advanced economies on our  planet would enjoy an increase of 60 percent in GDP by 2050--those  societies, 60 percent richer…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699613/9999"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…was not some bad apple using this terminology amongst otherwise  upstanding immigration officials. No. These labels were applied by the  highest ranking officials of this operation in President Trump's White  House--the Cabinet Secretary overseeing these raids, Kristi Noem; the  architect of this campaign of fear and mass arrest and detention, the…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699422/9999"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…are willing to risk it all in  defense of America.\n\nMy friend on the opposite side of the aisle mentions hip surgery. I  think that is entirely different than a sex change operation. That  doesn't say the person doesn't have it. With regard to the military and  the funding, that is not where the money should come from.\n\nHow about telling that child who…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695252/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Dan Newhouse", "party": "Republican", "sentence": "…fiscal year 2025 continuing  resolution. It also delivers funds directly to communities across the  country, including my own Yakima County, to establish a dedicated  emergency operation center and ensure timely and well-coordinated  emergency response efforts.\n\nThe U.S. Coast Guard is fundamental in protecting our border and  domestic security. This bill…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699356/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…Congress assembled,       SECTION 1. SHORT TITLE.\n\nThis Act may be cited as the ``Secure Our Ports Act of       2025''.       SEC. 2. PROHIBITION ON CERTAIN CONTRACTS FOR PORT OPERATION                     AND MANAGEMENT.\n\n(a) In General.--Subchapter II of chapter 700 of title 46,       United States Code, is amended by adding at the end the       following:…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692209/secure-our-ports-act-of-2025"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…Control Act of 1941 established that this river should be  maintained at 9-feet deep and 100-feet wide.\n\nIn 1956, the Army Corps of Engineers classified the project as an  operation and management project to be maintained at 9-feet deep and  100-feet wide for a 17-mile stretch of a river that runs through a  density of population and has never been maintained.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694867/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Rick Crawford", "party": "Republican", "sentence": "…``seems content to drag our country . . . into an  endless war with no plan, no transparency, and nothing but wishful  thinking.'' Nothing could be further from the truth.\n\nOperation Absolute Resolve was a masterfully, meticulously planned  law enforcement operation supported by the U.S. military.\n\nI don't know how much clearer we must be with our colleagues…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699371/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…to take this opportunity to commend the exceptional skill and  bravery of our troops, CIA officers, and FBI agents for executing such  an amazing military and intelligence operation that brought Maduro's  reign to an abrupt end. It is impossible to overstate the complexity of  this mission. But for our troops and our intelligence officers--whose  skill,…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698556/venezuela"}, {"senator": "Trent Kelly", "party": "Republican", "sentence": "…through rhetoric but through results.\n\nI express my deep gratitude to the law enforcement officers,  servicemembers, and intelligence professionals who carried out this  operation. Their discipline and professionalism reflect the highest  standards of our Nation.\n\nI thank President Trump for his actions. He did not escalate a  conflict. He enforced…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698886/successful-operation-to-arrest-nicolas-maduro"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…when intervention is most needed. The impact of this program  has been extraordinary. While the UCC initially anticipated serving 450  individuals during its first year of operation--from February 5, 2025,  through September 30, 2025--it ultimately provided services to 1,274  adults, exceeding expectations by 183 percent. Approximately 94 percent  of…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698647/recognizing-pasco-county-community-development-for-receiving-the-audrey-nelson-award"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…strikes against  the Iranian regime under the leadership of President Donald J. Trump.\n\nI also will take a moment to honor the other heroes who are part of  this historic operation. Pilots from the Air National Guard's 131st  Bomb Wing, also at Whiteman, made up 50 percent of the flyers alongside  the 509. The operation, maintenance, and the support…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692964/taking-a-step-toward-true-energy-dominance"}, {"senator": "James Risch", "party": "Republican", "sentence": "…engaged in hostilities in  Venezuela. The President did authorize actions that were limited in  scope, short in duration, and done to protect U.S. interests and  citizens. The operation only saw 200 troops, and they were inside  Venezuela, on Venezuela's soil, for less than 2 hours. Those troops  engaged with some unfortunate Cuban guards, who are no longer…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699089/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…better ways to handle this. The  legislative branch should correctly address the Biden administration's  weaponization of the FBI to spy on United States Senators in its  operation, Arctic Frost. The abuses, Mr. Speaker, by the Biden  administration are completely unacceptable, and I am committed to  holding those involved accountable.\n\nNo one benefited…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696929/repeal-of-senate-notification-requirements-relating-to-legal-process-on-disclosures-of-senate-data"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…say that I am very impressed and thankful for the  expertise, the resources, and the work that was done by the men and  women on the ground. It was truly an extraordinary operation that  couldn't have been done by any other nation other than the United  States.\n\nAs for those who were injured, I understand they are recovering and  that some have been…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698624/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Paul Gosar", "party": "Republican", "sentence": "…facilities.\n\n``(2) Operations and maintenance.--The contract for the       Arkansas Valley Conduit shall provide for the assumption by       the contracting parties of the care, operation, maintenance,       and replacement of the conduit.''; and\n\n(2) in section 2(b)(3)(A), by striking ``this section'' and       inserting ``subsection (d) of the first section''.…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693879/finish-the-arkansas-valley-conduit-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…containing--\n\n(A) additional detail on the applicants for a license under       the pilot program;\n\n(B) identification of the firms granted a license;\n\n(C) information on the operation of the pilot program,       including how long each license lasted and the personnel       needed to manage the pilot program;\n\n(D) information gleaned by the Office of Foreign…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693944/ofac-licensure-for-investigators-act"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…Florida agriculture.  Their family has carried forward a proud legacy of fanning that began  in 1982 when Jennifer's grandfather, Mr. Joe Bundrick, established  their beekeeping operation. Today, with the guidance of Mr. Bundrick  and the leadership of Jennifer's father, Ken, the Tomlins manage about  400 hives annually. Their farm produces honey, provides…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695268/congratulating-the-tomlins-the-2025-okaloosa-county-farm-family-of-the-year"}]