[{"senator": "Henry Cuellar", "party": "Democrat", "sentence": "…this: It is better than the alternative, leaving the  Department with a blank check, virtually unchecked by the Committee on  Appropriations and Congress.\n\nAllowing DHS to operate under a continuing resolution or trying to  shut it down, ICE would ensure that they have no direction from  Congress.\n\nThis bill flat-funds ICE, but at the same time, we…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699346/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Alma Adams", "party": "Democrat", "sentence": "…and water and distribution, and gave a direct line for North  Carolinians to speak to their communities.\n\nSlashing public broadcasting funding will limit their ability to  operate during crises and delay critical information to the people who  need it most.\n\nMake no mistake: Without public broadcasting, we would have seen more  lives lost in Helene.…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693723/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…in need around the globe. If Republicans pass this bill,  those farmers will lose.\n\nFeed the Future also partners with universities and colleges across  the United States to operate innovation labs that draw on their  expertise to tackle the world's biggest challenges to food security.\n\nInstitutions like Michigan State University conduct cutting-edge…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693590/rescissions-act-of-2025"}, {"senator": "Ilhan Omar", "party": "Democrat", "sentence": "…be alive.\n\nRenee Good was a 37-year-old beloved wife, mother, and community  member. She should be alive.\n\nKristi Noem's DHS must be held accountable. We cannot continue to  operate as if this terror is acceptable. We cannot allow a Federal  agency--one that was created for the purpose of terrorizing--to  function as an occupying force in our communities.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699668/horrific-ice-abuses"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…opposition to this resolution. We have heard a lot today  about upfront costs to businesses, the rising cost of doing business,  and the slim margins under which businesses operate.\n\nFirst, let me say that no one is forcing businesses to replace their  commercial refrigerator equipment. These standards don't go into effect  until 2029, and even then…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689127/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…delving into these  topics have really glommed on to the risks posed to our research  enterprise from adversaries like China and Russia.\n\nThe committees that are enabling us to operate in a bipartisan way  have also explored the methods used to circumvent the safeguards that  our country has put into place, including going through third-party  countries.…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688933/united-states-research-protection-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…changes the Impoundment Control Act, the foundation  of Congress's appropriations authority, and the authorization laws that  require USAID and other Agencies to exist and to operate the programs  as Congress has assigned to them. Nothing changes title 5, governing  the civil service, the Administrative Procedure Act, and so on.\n\nOne of the reasons I am…", "date": "2025-03-14", "source_url": "https://justfacts.votesmart.org/public-statement/1688900/full-year-continuing-appropriations-and-extensions-act-2025"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…GAO has found that the judiciary has requested and received  courthouses that are larger than the size authorized by Congress, more  expensive to build, and more expensive to operate than Congress was  aware of.\n\nThe judiciary has tried, however, to meet the concerns of Congress  over the last several years. Recently, the judicial conference revised  its…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695379/courthouse-affordability-and-space-efficiency-act-of-2025"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…employees. Further, workers who face longer       workweeks as a consequence of H.R. 2270 would likely       experience higher childcare costs as childcare providers who       operate during nontraditional hours (including evenings and       weekends) tend to cost more. H.R. 2270 would contradict the       basic premise, going back to 1938. that employers…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698964/tipped-employee-protection-act"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…contradictory, and harmful trade policy that  affect American families and my state of Illinois. His emergency powers  to impose tariffs have disrupted business and commerce to operate  successfully during a time of inconsistent policy initiatives with  major trading partners like Canada, China, and Mexico.\n\nWhat is more alarming is that this trade policy…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690134/opposing-the-chaotic-and-harmful-trade-policies-of-president-trump"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…workforce like the President says?\n\nThese moves are not about fairness. They are about power and about  stripping protections from the most marginalized so that the powerful  can operate without accountability.\n\nWe need to be open and honest about the truth. These actions will  increase discrimination in the workforce. They will make us less  productive, not…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695577/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…region because of its  harm to the climate and public health and because of decreasing demand  for coal.\n\nAt the same time, the plan allowed existing mines to continue to  operate through the end of their current leases. Rescinding this plan  means locking us into unnecessary emissions and energy costs at a time  when the planet and the American people…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696881/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…some reason, over the last 6  months, it seems that Washington, D.C., is intent on doing everything  that it can to make it harder for small businesses in this country to  operate.\n\nLet's reset. Let's prioritize tax relief for small businesses and the  middle class instead of the rich. Let's eliminate these tariffs on  products that we don't even produce…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694157/plumpynut-saves-lives"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…pre-college level students and  are committed to continuing education, clinical training of health  professionals, and responding to community health needs. The Nation's  300 AHECs operate in nearly every State and in multiple U.S.  territories.\n\nAHEC clinical training placements put students in a variety of real- world settings, such as urban and rural community…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689246/national-ahec-week"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…of you who are listening, the ISO grid, like  almost all the others--the price at any given minute on the grid for  electricity is set by the highest cost plant that has to operate to  meet that level of demand. So if you can get that 9-cent cost to be the  highest cost, that is it for everybody, but if you got to go back to  18, that is also it for…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699019/energy-costs"}, {"senator": "John Hoeven", "party": "Republican", "sentence": "…more than 5 percent.\n\nThis will have a disproportionate impact on small oil and gas  producers in my home State of North Dakota and across the country, many  of which already operate on thin margins and cannot afford the high  costs to comply with this onerous rule.\n\nSimply put, this is a punitive tax that will be passed along to  consumers and will force…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688157/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…realize we have now borrowed $628 billion in the  first 51 days of this new fiscal year? Treasury has put more--is  holding almost $900 billion in cash, which they typically operate with  about $800 billion because of the in and out, but you start to realize,  at the current borrowing rate, we crossed $1 trillion this fiscal year  before Christmas.\n\nIt…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697051/facing-fiscal-reality"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…know that China is the threat that we are concerned about the most. We  also know that others around the world don't want to do business with  China because of the way they operate. They manipulate their currency.  They take advantage of their own people, and they don't respect the  environmental standards that we do.\n\nWhat President Trump is doing is…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691249/president-trump-in-the-middle-east"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…individual, cannot afford the new equipment  mandated by these unreasonable standards. In fact, 90 percent of food  and drink retailers are categorized as small businesses and operate  with a 1 to 3 percent margin. That is how slim their margin is.\n\nThe result will be significant costs being passed down to consumers  and, in the worst case scenario, the…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689265/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…the constitutional foundation for applying the  NFA's transfer and registration requirements to those zero-tax firearms  no longer exists. These requirements now improperly operate without any  corresponding exercise of Congress' taxing power.\n\nAs the Supreme Court upheld the NFA's provisions only as ``in aid''  of that taxing power, and since the relevant…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697383/restoring-second-amendment-rights"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…America's role in the world. As we reassess how we deploy our time,  money, and political capital abroad, Congress has an obligation to  ensure that taxpayer-funded organizations operate within the mission  and guardrails Congress has established.\n\nThe National Endowment for Democracy was created to support  democratic norms overseas, not to engage in domestic…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699440/consolidated-appropriations-act-2026"}, {"senator": "Jim Baird", "party": "Republican", "sentence": "…when she joined the local radio  station WJNZ, formerly known as WXTA, as the sales manager in 1969.\n\nIn 1977, Jinsie Bingham became the first woman in Indiana to own and  operate a commercial radio station. She ran WJNZ, which is now known as  WREB and serves Greencastle to this day. In 1996, she received the  Lifetime Achievement Award from the Indiana…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690518/congratulating-mccutcheon-high-schools-mavericks-robotics-team"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…vote this rule down, you are basically saying if you are not  going to do what I want, you shouldn't do anything. I don't believe  that is the way a legislative body ought to operate.\n\nMr. Speaker, I urge passage of this rule in order to bring more  transparency and oversight into our children's schools, to ensure that  our children are not being improperly…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697302/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…between  States and Federal agencies on mine drainage remediation.\n\nMany third-party organizations support this legislation, as they need  this liability protection in order to operate efficiently and  effectively.\n\nThe Community Reclamation Partnerships Act passed the House in the  115th Congress and has moved through committee for the last three  Congresses.…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691092/community-reclamation-partnerships-act-of-2025"}, {"senator": "John Rose", "party": "Republican", "sentence": "…Estimates tell us that the immediate expensing for R&D will  accelerate more than $20 billion in investment. I have seen this  firsthand in my own small business that I continue to operate. This  bill is further proof of promises made, promises kept, and I was proud  to support the One Big Beautiful Bill Act.\n\nMr. Speaker, the men and women who put a badge on…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693037/benefits-of-the-one-big-beautiful-bill"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…that language was continued in  the second CR. However, the House did not extend this anomaly in the  yearlong CR. As a result, unless this bill is passed, DC would have to  operate under its fiscal year 2024 budget for the remainder of 2025,  potentially requiring $1.1 billion in local spending cuts.\n\nReducing DC's local funding expenditures will not…", "date": "2025-03-14", "source_url": "https://justfacts.votesmart.org/public-statement/1688849/district-of-columbia-local-funds-act-2025"}, {"senator": "James Risch", "party": "Republican", "sentence": "…February 20, 2025--\n\nHis date of inauguration--       as a foreign terrorist organization or specially designated       global terrorist, any states in which those entities operate,       or any non-state organization engaged in the promotion,       trafficking, and distribution of illegal drugs.\n\nYou are telling the President to stop using this against…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696121/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…midnight rule to the burn pile.\n\nS.J. Res. 28, another Congressional Review Act resolution, would  overturn another CFPB rule that unjustly shackles private-sector  companies that operate within the digital asset marketplace.\n\nThis rule is billed as a ``consumer protection'' mechanism, but what  it really does is misclassifies an entire segment of digital products…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689703/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…President Trump's vision to strengthen the domestic  maritime base and boost the pool of qualified United States merchant  mariners who can mobilize during times of crisis to operate sealift  assets.\n\nThe legislation also gives the service an important voice by  establishing a Coast Guard service secretary, as envisioned in my  legislation, H.R. 2546,…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694195/coast-guard-authorization-act-of-2025"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…House Administration.\n\nToday, Mr. Speaker, we have an opportunity to move forward with  election integrity and to regain the trust of the American people in  the way that we operate our elections.\n\nThe SAVE America Act has two key principles, both of which are common  sense. The individuals who want to vote in U.S. elections should be  U.S. citizens,…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700014/veterans-accessibility-advisory-committee-act-of-2025"}]