[{"senator": "Haley Stevens", "party": "Democrat", "sentence": "…suppliers. These are really unbelievable enterprises that put so much  into making door panels, making interiors, and making sure that we have  got the full sweep of mobility opportunities from, of course, the  engines, and we have got companies like Allison Transmission that is  working on electric engines. They are still, of course, doing the  internal…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689752/reflecting-on-americas-history"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…a brain drain in our Federal  Government by choosing loyalty to the President over merit and  competence, creating less efficiency and more waste, fraud, and abuse,  and opportunities for corruption.\n\nEssentially, we have to stop this. Make no mistake, I will fight this  every step of the way.                            Celebrating Station 7\n\nMr. SUBRAMANYAM.…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692238/backlog-in-irs"}, {"senator": "Zoe Lofgren", "party": "Democrat", "sentence": "…strengthen  this momentum in its entirety, by empowering deeper collaboration  between these two agencies, enabling our research and agriculture  communities to fully utilize the opportunities presented by a broad  range of new emerging technologies.\n\nWith this, I encourage all my colleagues to support this bill.", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689015/doe-and-usda-interagency-research-act"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…which includes the       Boundary Waters, contains 20 percent of all the fresh water       in the entire National Forest System.\n\nThe Boundary Waters offers unparalleled opportunities for       fishing, hunting, camping, and paddling. It's a haven for       hunters and anglers who come to the region to pursue walleye.       smallmouth bass, northern…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699274/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…Diversity does not mean Black. Diversity can  mean making sure people who use wheelchairs are not discriminated  against and get equal consideration for housing and employment  opportunities. It can mean making sure that senior citizens have the  same protection as young people. To say nothing of the fact that  ensuring the right of young people to be in leadership…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690321/ending-of-dei-programs-through-executive-order"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…Year, John Piersol as Ohio's 13th  Congressional District's Champion of the Week.\n\nFor the last 30 years, as president of the Green Soccer Association,  John helped create opportunities for more than 600 youth players. Here,  his inspiring dedication to his community shines through his heartfelt  service and purposeful leadership.\n\nJohn also led the GOAL…", "date": "2025-11-25", "source_url": "https://justfacts.votesmart.org/public-statement/1697165/recognizing-john-piersol-as-ohios-13th-congressional-districts-champion-of-the-week"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…community  supervision professionals, who are dedicated public servants and  perform many vital roles in their work with justice-involved adults and  juveniles. They identify opportunities and services to help justice- involved individuals contribute to society, while holding them  accountable for their actions. They remain mindful of their role in  protecting…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693630/recognizing-the-nations-community-supervision-professionals"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…Schools and directed the Goleta State Preschool. Throughout  her career, JoAnne centered the well-being and success of all students.  She introduced innovative enrichment opportunities--including drumming  circles, swing dancing, and visiting artist programs--and organized a  Spring Sing performance at UCSB's Campbell Hall that brought together  hundreds…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698084/the-year"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…and so that is why debate matters.\n\nMr. McGOVERN. Mr. Speaker, the gentlewoman doesn't oppose this? Boy,  she has a funny way of showing it. I gave the gentlewoman nine  opportunities in the Committee on Rules to bring this measure to the  floor. I gave her nine opportunities. Every time I brought up an  amendment, she voted it down. There were nine…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696904/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision-providing-for-consideration-of-h-con-res-denouncing-the-horrors-of-socialism-providing-for-consideration-of-hr-unlocking-our-domestic-lng-potential-act-of-providing-for-consideration-of-hr-researching-efficient-federal-improvements-for-necessary-energy-refining-act-providing-for-consideration-of-hr-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-providing-for-consideration-of-hr-district-of-columbia-cash-bail-reform-act-of-and-for-other-purposes"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…introduction of these  pollutants.\n\nIn Southeastern Virginia, one of our region's most critical resources  is the Chesapeake Bay. The Bay provides our local economy with many  opportunities in recreation, business, education, and tourism.  Throughout the watershed, the Bay brings in nearly $14.3 billion in  annual revenue and supports nearly one million jobs.…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698148/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…funding for a brownfield       site that would serve as a critical community hub in a       Republican district. The center would also provide training       and education opportunities for a population that lives in a       rural and historically underserved area. The project was       awarded a $16.3 million EPA environmental justice grant--      great…", "date": "2025-07-09", "source_url": "https://justfacts.votesmart.org/public-statement/1693322/greenhouse-gas-reduction-fund"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…Area Chamber of Commerce is a crucial support system for  businesses and the community of Conifer, offering workshops on  marketing, managing finances, and other economic opportunities for  residents. In addition, the Chamber connects local small businesses and  non-profits with the resources to grow their organizations, support  staff development, and…", "date": "2025-08-08", "source_url": "https://justfacts.votesmart.org/public-statement/1694715/recognizing-the-conifer-area-chamber-of-commerce"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…much  better.\n\nIn taking action, the Biden Department of Labor spoke for those  workers and pushed for them to have a livable, honorable wage. The  Department noted that opportunities, legal protections, and support for  disabled workers have increased since 1989 when the regulation was last  updated.\n\nHowever, in July, the Trump Department of Labor…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695575/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…quickly becoming an       essential part of our nation's transportation system,       especially in urban areas. These micromobility devices also       enable flexible earning opportunities for workers across the       country, including the couriers--we call them ``Dashers''--      who provide delivery services facilitated by the DoorDash       platform.…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690260/setting-consumer-standards-for-lithium-ion-batteries-act"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…continues throughout the year, through crucial after-school  programming that extends the mission of academic success and personal  growth for students, while providing parents opportunities to finding  meaningful employment and attending school so that their families can  get ahead and stay ahead.\n\nPresident Franklin D. Roosevelt said, ``We cannot always build…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693506/recognizing-macons-next-level-community-development-center"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…founder and owner of Beauty Mood, a hair and beauty salon located  in Warminster, Pennsylvania. With her business' mission to enhance  people's natural beauty and provide opportunities to indulge in self- care, Beauty Mood offers a wide range of services in a relaxing  environment, delivered by skilled professionals. On June 24, 2025,  Beauty Mood will…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691903/recognizing-beauty-moods-one-year-anniversary"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…advance student achievement  for kids all across the country. It will reverse this decline that we  have continued to see in our education system. It will give families  the opportunities that they deserve and that they are entitled to. It  will put our country on much stronger footing for generations to come.                       congratulating tahoe yacht…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…making sure that everyone has a chance to experience the joy and  connection of sports.\n\nToo often, athletes with special needs are left without access to the  kinds of opportunities so many take for granted, which is real teams,  real competition, and real crowds cheering them on.\n\nThis is an exciting new effort. There is so much going on with soccer…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695809/recognizing-spokane-impact"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…transformative programs that empower families and strengthen  communities.\n\nAmanda knows that preserving communities goes beyond simply building  homes. She has provided opportunities for families to create  generational wealth through innovations such as education programs for  homeowners about wealth transfer and heirs' rights. She has also  implemented…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689058/recognizing-amanda-brewer-for-womens-history-month"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…especially in rural  areas like many in Iowa. This isn't just a workforce issue. It is a  public health crisis.\n\nWe must do more to strengthen nursing by expanding training  opportunities, reducing burnout, and investing in the future of care.\n\nNurses don't ask for recognition, but they sure deserve it. Mr.  Speaker, on National Nurses Day and every day,…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690623/recognizing-national-nurses-day"}, {"senator": "Troy Balderson", "party": "Republican", "sentence": "…reliability and meet demand, bypassing the years-long wait in  the interconnection queue.\n\nThe bill also promotes transparency by requiring that grid operators  provide opportunities for public comment and stakeholder engagement  before submitting proposals to FERC. Operators must also provide  regular reports to FERC on the state of grid reliability…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695755/guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…otherwise known as  the HALOS Act.\n\nThis bipartisan bill, which I am proud to lead alongside Josh  Gottheimer, is a straightforward way to give early-stage startups more  opportunities to connect with potential investors. The HALOS Act  clarifies the definition of ``general solicitation'' and allows  startups to participate in demo day events without…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692723/helping-angels-lead-our-startups-act-of-2025"}, {"senator": "Hal Rogers", "party": "Republican", "sentence": "…victims. Thanks to their  fundraising efforts, more essential resources are available for  families, including educational programs, healthcare initiatives, and  recreational opportunities for patients who need them the most.\n\nI salute the Brother's Keepers Motorcycle Club of Kentucky for  providing a beacon of hope for families across the Commonwealth, going…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694746/tribute-in-honor-of-brothers-keepers-motorcycle-club"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…this country.\n\nIn this role, I am grateful to get to know as many small business  owners as possible and hear their concerns, understand their areas of  growth, what their opportunities are, and, most importantly, what their  challenges are.\n\nGoing back to the reconciliation package--and we are working on,  particularly, the tax portion--we are looking…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690787/big-beautiful-bill"}, {"senator": "Mike Kelly, Jr.", "party": "Republican", "sentence": "…kindness, and commitment to this community are what make it truly  special.\n\nSo, as we celebrate this historic anniversary, let us not only honor  our past but also embrace the opportunities ahead. Let us work together  to ensure that Mercer County continues to be a place of growth, unity,  and prosperity for generations to come.", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689795/recognizing-mercer-county-pennsylvanias-225th-anniversary"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…(1) Interagency coordination between each Federal agency       involved in the research and development activities carried       out under this section.\n\n(2) Potential opportunities to expand the technical       capabilities of the Department of Energy and the Department       of Agriculture.\n\n(3) Collaborative research achievements.\n\n(4) Areas of…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688980/doe-and-usda-interagency-research-act"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…they were born, No. 1, and that  they had an opportunity to be able to speak out for the next generation  of people that so much desires to be born and to have the same  opportunities all of us in this room have: to grow, to learn, to love.  That is all that child wants, and they had the opportunity to be able  to have that.\n\nAs I mentioned, 50 years…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699097/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…United States.\n\n(b) Elements.--The report required by subsection (a) shall       include an assessment of--\n\n(1) the digital security, national security, and economic       opportunities associated with a trans-Atlantic submarine       fiber optic cable described in subsection (a);\n\n(2) the lifespan of submarine fiber optic cables currently       connecting…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692701/assessment-of-trans-atlantic-submarine-fiber-optic-cable"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…work  serving their community.\n\nThis legislation will provide a permanent home for programs that  strengthen conservation, support farmers and landowners, and create new  opportunities for young people through 4-H extension services.\n\nIt is a practical, cost-effective solution that delivers real value.  I, once again, thank Representative Hill for his…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698160/conveyance-of-specified-forest-service-property-to-perry-county-arkansas"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…reckless attacks in the future.\n\nSome argue that LNG exports raise energy prices for Americans by  reducing domestic supply. This claim is simply false. Increased export  opportunities incentivize production and drive efficiency gains, which  will help domestic prices continue to be affordable.\n\nGiven the abundance of economic and environmental benefits…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697092/unlocking-our-domestic-lng-potential-act-of-2025"}]