[{"senator": "Maxine Waters", "party": "Democrat", "sentence": "…of more junk  fees, abusive medical debt collection practices, Big Tech domination,  and predatory lending--then the answer is pretty clear.''\n\nMr. Speaker, S.J. Res. 28 is opposed by nearly 200 consumer, civil  rights, religious, and good governance organizations. It was also  opposed by a bipartisan group of Senators. I urge my colleagues to vote…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689953/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…Sec. 551 (6), (8), (9)). We noted that the       notice was particular to California's Advanced Clean Car       Program, involved consideration of particular facts, as       opposed to general policy, and had immediate effect on       California. Id.\n\nWe also concluded that even if the Advanced Clean Car       Program Waiver Notice met the APA definition…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691583/hj-res-88"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…undermining the independence of the Federal judiciary, and flouting the  constitutional mandate of due process, all of which have devolved our  democracy into authoritarianism.\n\nI opposed authoritarian President Donald Trump's behavior that made  him a threat to our democracy prior to his election and have witnessed  that threat become a reality. Therefore,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691346/proud-to-be-an-unbought-unbossed-liberated-democrat"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…fundamental purpose of our military in this country.\n\nThe Founding Fathers were deeply worried about the use of a standing  army, potentially, within the homeland, and many were opposed to a  standing army because of that concern.\n\nSo we have laws--Posse Comitatus--that forbid the use of the military  against American citizens on American soil. The health…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696345/trump-administration"}, {"senator": "Julia Brownley", "party": "Democrat", "sentence": "…military, this is about  investing in a new industry in our country that both Democrats and  Republicans support because it is an opportunity for us to move and  lead this, as opposed to China, Singapore, Israel, or Australia, which  are already leading in this.\n\nWe want to be competitive in the global marketplace. We want our  military to be ready.\n\nThis…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695257/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "…Mr. Speaker, I rise today to address the House and oppose  the defunding of Planned Parenthood clinics nationwide.\n\nThe Republicans' cruel budget bill, which all Democrats opposed,  included a provision to block Federal Planned Parenthood clinics from  receiving Medicaid funds. This was a devastating choice that  Republicans have made which will undoubtedly…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694154/defunding-planned-parenthood"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Republican colleagues refuse to hold this administration to  account for these devastating and illegal cuts. Instead, they are  trying to distract with this bill. This bill is opposed by nearly 190  national, State, and local public health, criminal justice, and civil  rights organizations.\n\nSo, Mr. Speaker, I oppose the bill, and I encourage my colleagues…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692341/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…combined.''\n\nAt the same time, President Trump is trying to keep the United States  hooked on expensive oil and gas and dependent on OPEC and other foreign  actors with interests opposed to our own; and while he is doing that,  China is launching into a new age of relatively cheap energy that will  power their data centers and their infrastructure.\n\nRhode…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696129/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Robin Kelly", "party": "Democrat", "sentence": "…pollution,       deforestation, and climate change, among other acts harmful       to the environment, should be considered ``ecological sin''       and moral failings, as opposed to merely practical missteps;\n\nWhereas, he has worked to guide the Orthodox Christian       Church in an environmentally conscious and Godly way, helping       to develop…", "date": "2025-08-26", "source_url": "https://justfacts.votesmart.org/public-statement/1694760/recognizing-his-all-holiness-ecumenical-patriarch-bartholomew-i-archbishop-of-constantinople-new-rome"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…shutdown that they started, they decided  to have a picnic.\n\nIt is my understanding that President Trump may even be leaving the  country this weekend. He is leaving for a week as opposed to bringing  people together?\n\nI am reminded, Senator Merkley, that President Trump said not too  long ago in an interview: If there is a shutdown, it is up to the  President…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696347/trump-administration"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "Mr. Speaker, I am strongly opposed to H.J. Res. 142, which would  repeal provisions of a law enacted by the District of Columbia because  D.C. deserves the right to govern itself.\n\nThe Supreme Court has held…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699681/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…rules-based international exchange. That order was never  perfect.\n\nAnd the United States often undermined it with our own hubris,  particularly the invasion of Iraq--which I opposed. And we need to  learn from our own mistakes, including by avoiding reckless new wars  like the one President Trump has launched.\n\nNevertheless, the postwar order that prevented…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698608/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…all of that in  favor of merit that just happens to focus on people who are blindly  loyal to Pete Hegseth and President Trump, that is not merit.\n\nI should clarify, I am not opposed to DEI programs. I am opposed to  bad DEI programs--we ought to excise those--but we don't do enough  here, I think, to correct those problems as we move forward.\n\nI am saving…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697790/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…and we have a constitutional role to be a  check on the President. Only Congress can declare war, and Congress did  not authorize the use of force against Venezuela.\n\nNow, I opposed the war in Iraq from the outset. And the parallels to  what President Trump has kicked off in Venezuela are glaring. And I  absolutely will not support any large-scale military…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698684/9999"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…Chicago and across  the State of Illinois.\n\nI am proud to have worked alongside Amisha during her 15 years as the  executive director of Grassroots Collaborative, where we opposed school  closures, championed affordable housing, and fought for critical  investments to our social safety net.\n\nAmisha is a fighter for peace, justice, and community. As…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690325/national-fair-housing-month-amisha-patel"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…personally prefer a new $5,000 exemption. Nevertheless,  there is no time in life when people are more financially strapped than  when they have young children.\n\nI am strongly opposed to the so-called SALT Caucus of people who  desperately want to have a greater deduction for State and local taxes.  These people are, as a practical matter, looking to encourage…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691328/the-big-beautiful-bill"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…Movement leader Alexander Campbell       (1788-1866) advocated for a rational and deliberative       understanding of Christianity, firmly rooted in the New       Testament. He opposed both speculative theology and emotional       revivalism, emphasizing a return to the Bible as the primary       source of truth. Campbell advocated for a focus on biblical…", "date": "2025-08-26", "source_url": "https://justfacts.votesmart.org/public-statement/1694761/recognizing-campbell-the-nature-of-truth-odessa-american"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…because there are some appointees in the  Pentagon who have embraced the foolish policy of decoupling from Europe  and weakening our leadership in NATO. We have got to stand opposed to  this. We need to use our Article I powers today and be counted for what  we believe in.\n\nWhat happens if we withdraw from the Baltics? No one will be more  happy than…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695259/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "Mr. BERGMAN. Mr. Chairman, I rise in opposition, although I am not  opposed to the amendment.\n\nMr. BERGMAN. Mr. Chairman, I thank my dear friend and fellow PATH  Caucus co-chair, Congressman Correa, for his work on this amendment.\n\nWashington, D.C.,…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692940/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…Congress and America, we need to clarify for the citizens watching,  Mr. Speaker, Congress has a unique authority, and therefore,  responsibility for our Nation's Capital as opposed to other  municipalities across the country. Why not Phoenix, New Orleans,  Atlanta, et cetera? It is because they are not the Nation's Capital,  that is why. It is because…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692375/district-of-columbia-federal-immigration-compliance-act-of-2025"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…also ask the press corps to wake up and ask Congress whether  it is appropriate that we penalize married couples by $25,000 or  $35,000 a year because they got married, as opposed to their siblings  who may not have gotten married.\n\nMr. Speaker, there is one other thing I want to comment on tonight. I  was listening to a television program on one of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695628/breakdown-of-traditional-families"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…with some  Senate Republicans, advanced legislation that enables us to fund the  government.\n\nI do find it interesting that our colleagues in the House here are so  adamantly opposed to funding our government when 20 of their colleagues  in the Senate, in their own party, not only support giving our troops a  pay raise but support paying and funding our…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699590/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Mike Crapo", "party": "Republican", "sentence": "…something we have  been battling over for a couple of years now. It is a textbook example  of the type of out-of-control spending that President Trump and  Republicans have rightly opposed.\n\nRather than working together to help the IRS solve its massive  taxpayer service and IT shortcomings, the misnamed Inflation Reduction  Act went to fund untargeted and heavily…", "date": "2025-03-14", "source_url": "https://justfacts.votesmart.org/public-statement/1688897/full-year-continuing-appropriations-and-extensions-act-2025"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…not adding deficit.  When you see people actually grasp that concept, it is fascinating to  be able to say, of course, I would rather people be paying taxes in the  U.S. as opposed to a foreign nation. Now, the foreign country doesn't  love that when we do it.\n\nIf we put things on par, companies will almost, in every  circumstance, choose to do business…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694786/promises-made-promises-kept"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…unleash the  full potential of our great natural resources.\n\nMr. Speaker, what is ironic is the fact that Secretary Burgum, when  he was the Governor of North Dakota, vehemently opposed this resource  management plan, but the prior administration just brushed him off.  They didn't care what he thought or what the people of North Dakota  thought, just like…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694908/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Commission.\n\nThe Governor and his enablers insist they are only doing this because  of what is happening in other States. However, the redistricting  commission itself was opposed by Nancy Pelosi, for example, who led the  opposition to its creation and was opposed by the California Democratic  Party.\n\nNothing could justify what is happening in California…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…data.\n\nHouse Oversight Committee Republicans have attempted to legislate  annual public reporting on the use and abuse of official time. However,  Democrats have consistently opposed even this ounce of accountability.\n\nThey have another opportunity to change their ways by supporting the  current version of this legislation H.R. 5749, the Official Time…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697996/protect-americas-workforce-act"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…comes straight out of the  pockets of American consumers.\n\nConservatives used to understand that tariffs are taxes on the  American people. Conservatives used to be uniformly opposed to raising  taxes because we wanted the private marketplace, the private  individuals to keep more of their incomes. So we were always for lower  taxes. And yet now the mantra…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689478/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "James Risch", "party": "Republican", "sentence": "…against Iran or, indeed,  if there were hostilities against Iran, but we are not, and we do not  intend to. You can't terminate something that is not going on. Every  American is opposed to the long, drawn-out conflicts that we have, in  our history, from time to time, experienced. I assure you that  President Trump feels exactly the same way. He hates those…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693132/motion-to-discharge-sj-res-59"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…who had been  accidentally put on jury duty and say: Hey, I don't know how I got  registered to vote, but I am not an American. We had to take them off  jury duty. Democrats opposed our efforts even there to clean up the  rolls.\n\nThere is nothing we have more important to do here than to make sure  that Americans are confident in our elections and the…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700011/veterans-accessibility-advisory-committee-act-of-2025"}]