[{"senator": "Gil Cisneros", "party": "Democrat", "sentence": "Mr. CISNEROS. Madam Chair, I rise in opposition to this amendment.\n\nMadam Chair, I thank the gentleman for recognizing me. This highly  partisan amendment would prevent DOD from contracting with entities  that perform fact-checking…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695250/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "Ms. BONAMICI. Mr. Chair, I thank Representative Stansbury for  yielding.\n\nMr. Chair, I rise today in opposition to this amendment, which would  ban transgender women from participating in women's sports but also  lead to challenges on all women's bodies, making the military and  academies less…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695232/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "Mr. PALLONE. Mr. Chairman, I rise also in strong opposition to this  amendment.\n\nIn 2023, 12,429 people died in drunk driving crashes nationwide. In  Kentucky alone, 198 people were killed. In  Pennsylvania, 321 people lost their lives. These…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699286/amendment-no-1-offered-by-mr-massie"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "Ms. DeLAURO. Mr. Chair, I claim the time in opposition to the  amendment.\n\nMs. DeLAURO. Mr. Chair, I yield myself 2\\1/2\\ minutes.\n\nMr. Chair, before I get into the specifics of this amendment, I will  start with, hopefully, common ground.…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699285/amendment-no-1-offered-by-mr-massie"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "Mr. SMITH of Washington. Mr. Chair, I rise in opposition to the  amendment.\n\nMr. SMITH of Washington. Mr. Chair, I yield myself 2 minutes.\n\nMr. Chair, there are going to be five amendments now that are all  targeting the transgender community.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695253/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "Mr. CLYBURN. Mr. Chair, I rise in opposition to the amendment.\n\nMr. CLYBURN. Mr. Chair, the bipartisan infrastructure law requires  drunk and impaired driving technology to become standard equipment in  new cars once a rule…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699287/amendment-no-1-offered-by-mr-massie"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…DeLauro), I move to strike the last word.\n\nMs. KAPTUR. Mr. Chair, I yield to the gentlewoman from Illinois (Ms.  Budzinski).\n\nMs. KAPTUR. Mr. Chairman, I rise in opposition to this amendment.\n\nMs. KAPTUR. Mr. Chair, I listened to the gentleman, and he and I  share a piece of the continent in a way. Part of Pennsylvania drains  into Lake Erie believe…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694952/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Sara Jacobs", "party": "Democrat", "sentence": "…bigoted; it is shortsighted and would hurt our national security. I  urge my colleagues to oppose this amendment.\n\nMs. JACOBS. Mr. Chairman, I claim the time in opposition to the  amendment.\n\nMs. JACOBS. Mr. Chairman, I yield myself such time as I may consume.\n\nTrans people, including trans servicemembers, deserve the basic human  dignity and common…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695241/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "Ms. TOKUDA. Mr. Chair, I rise in strong opposition to this amendment.\n\nLet's be clear: The Exceptional Family Member Program does not pay  for medical care. Its purpose is simple: to ensure that military  families are stationed where…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695235/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "Mr. COURTNEY. Mr. Chairman, I rise in strong opposition to this  amendment, which would have our Nation turn its back on the brave  people of Ukraine in their greatest hour of need by cutting off all  military assistance.\n\nAs we stand…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695239/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "…who are watching, for the  transgender  community, you are loved and respected for your resilience and for your  breadth. Keep pushing.\n\nMr. Chair, I rise today in opposition to this amendment that would  prohibit the Department of Defense from collecting data on gender  identity.\n\nData is not just numbers. Data is a story and reflection of those  lived…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695230/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "Ms. BALINT. Mr. Chair, I rise today in strong opposition to this  amendment.\n\nIf passed, this amendment would immediately prohibit TRICARE coverage  of mental health counseling for transgender young people. Let me repeat  that. This amendment…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695248/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "Mr. BEYER. Mr. Chairman, I rise in opposition to the amendment.\n\nMr. BEYER. Mr. Chairman, the current law that this amendment  addresses doesn't hinder our readiness at all, nor does it raise costs.  It is not costly. It is…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695135/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "Mr. BEYER. Madam Chair, as co-chair of the Congressional Endangered  Species Caucus, I rise today in opposition to this amendment.\n\nI can't believe that we are here again considering this unpopular  amendment. It was brutally defeated last year, and it was crushed the  year before, both times…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695233/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…yield to the gentlewoman from New Mexico  (Ms. Stansbury).\n\nMs. McCOLLUM. Mr. Chair, I yield back the balance of my time.\n\nMs. McCOLLUM. Mr. Chair, I rise in strong opposition to this  amendment.\n\nLet me be as clear as the chairman was. BioMADE has never funded any  efforts to develop or produce lab-grown meat for any purpose.\n\nThe Rules Committee should…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693686/department-of-defense-appropriations-act-2026"}, {"senator": "Shelley Capito", "party": "Republican", "sentence": "Mrs. CAPITO. Mr. President, I rise to join my ranking member on the  subcommittee that we share leadership on. I do thank Senator Paul, but  I rise in opposition to his amendment. As she has stated, this  amendment would eliminate HHS funding provided in the bill--which the  Trump administration actually requested in their budget--that will…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699430/consolidated-appropriations-act-2026"}, {"senator": "Ken Calvert", "party": "Republican", "sentence": "Mr. CALVERT. Mr. Chair, I rise in opposition to the amendment.\n\nMr. CALVERT. Mr. Chair, I think there may be a misunderstanding about  bioindustrial manufacturing, what it is and what it is not.  Bioindustrial manufacturing…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693682/department-of-defense-appropriations-act-2026"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…doing that, and I look forward to  hopefully a bipartisan vote on this bill.\n\nMr. Chair, I yield back the balance of my time.\n\nMr. GUTHRIE. Madam Chair, I rise in opposition to the amendment.\n\nMr. GUTHRIE. Madam Chair, I yield myself such time as I may consume.\n\nMadam Chair, I really appreciate the hard work of the gentlewoman  from Colorado (Ms. Pettersen)…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691874/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "John Rutherford", "party": "Republican", "sentence": "Mr. RUTHERFORD. Mr. Chair, I rise in opposition to the Davidson  amendment.\n\nMr. RUTHERFORD. Today, our Nation is facing growing and real threats  from adversaries around the world. There is China, who continues to  rapidly grow their…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693680/department-of-defense-appropriations-act-2026"}, {"senator": "David Rouzer", "party": "Republican", "sentence": "…It is very simple and  straightforward. It is actually exceptionally pro-environment, and I  support this amendment.\n\nMr. ROUZER. Mr. Chair, I claim the time in opposition to the  amendment, even though I am not opposed to it.\n\nMr. ROUZER. Mr. Chairman, although I claim time in the opposition, I  do not oppose the amendment. I rise, in fact, in support…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698028/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "Mr. MAST. Mr. Chair, I rise in opposition to the amendment.\n\nMr. MAST. Mr. Chair, I rise in opposition to this amendment I am  going to say for procedural reasons, but there are procedures that are  important here. The ranking…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695244/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…and I recommend  that my colleagues vote for this bill.\n\nMr. Chair, I yield back the balance of my time.\n\nMr. GUTHRIE. Mr. Chairman, I rise to claim the time in opposition to  the amendment, though I am not opposed to it.\n\nMr. GUTHRIE. Mr. Chairman, I yield myself such time as I may consume.\n\nMr. Chairman, I rise in support of the amendment from my…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697890/electric-supply-chain-act"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…targets for  our adversaries, and that is unacceptable.\n\nWe must pass this bill.\n\nMr. Chairman, I yield back the balance of my time.\n\nMr. WALBERG. Mr. Chair, I rise in opposition to the amendment.\n\nMr. WALBERG. Mr. Chairman, this is essentially the same amendment  that my friend and colleague, Ranking Member Scott, offered last  Congress on the floor as well…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689032/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Darrell Issa", "party": "Republican", "sentence": "Mr. ISSA. Madam Chair, I claim the time in opposition to the  amendment.\n\nMr. ISSA. Madam Chair, I yield such time as he may consume to the  gentleman from Illinois (Mr. LaHood).\n\nMr. ISSA. Madam Chair, may I inquire as to the time remaining.…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693681/department-of-defense-appropriations-act-2026"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…national security posture.\n\nMr. Chair, I thank the judge for his leadership, and I urge adoption  of this amendment.\n\nMs. WASSERMAN SCHULTZ. Mr. Chairman, I rise in opposition to the  amendment.", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692947/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Chuck Fleischmann", "party": "Republican", "sentence": "Mr. FLEISCHMANN. Mr. Chair, I claim the time in opposition to the  amendment.\n\nMr. FLEISCHMANN. Mr. Chair, I share some of my distinguished  colleague's concerns about EERE, but let me, for the record, lay some  things out.\n\nI am a strong…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694951/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Eli Crane", "party": "Republican", "sentence": "…to prevent taxpayer resources from  funding this rogue organization that works against our Nation's  interests.\n\nMs. LOIS FRANKEL of Florida. Mr. Chair, I rise in opposition to the  amendment.\n\nMr. CRANE. Mr. Chair, I thank my colleague for those remarks and also  thank her son for serving in the Armed Forces. I too served in the  Armed Forces, went on…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699052/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}]