[{"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…obligations of the Department of Education, and  we know that a lot of the education laws that came about were signed by  President Johnson in the civil rights era to expand opportunities and  to close opportunity gaps.\n\nRight now, there are approximately 25,000 pending civil rights  complaints at the Office for Civil Rights, which has been gutted.\n\nMr.…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698126/dismantling-the-department-of-education"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "…Education Trust, helping union labor train  workers and expand market share.\n\nThere is no doubt that his work saved lives, prevented accidents, and  helped union labor gain new opportunities in the 21st century.\n\nArthur was not only a labor leader, he was also a dedicated father,  grandfather, husband, and friend. My thoughts are with his family at  this incredibly…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693984/recognizing-arthur-coia-of-rhode-island"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…space that celebrates creative  expression. Through her vision, Ms. Merkling has significantly  contributed to the cultural vitality of Crystal Lake, creating valuable  opportunities for artists to share their work with the community.\n\nMr. Speaker, I am proud to represent Nancy Merkling, whose dedication  as both an artist and a mentor has made a lasting…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690945/recognizing-nancy-merkling-for-receiving-the-robert-o-covey-business-of-the-year-award"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…demonstrating what is  possible when communities come together. I am proud to stand with them  in this effort, and I look forward to seeing Seaford become a symbol of  progress and opportunities for generations to come.", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689020/food-banks-facing-urgent-crisis"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…contractors; they are rolling  that back.\n\nEnforcement of antidiscrimination and affirmative action requirements  that ensure that Federal contractors are for equal employment  opportunities for workers, they are rolling that back.\n\nThere are more rollbacks waiting in the wings, because, in fact, the  Labor Department in a draft rule that is sitting in the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695574/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…lives of others.\n\nMrs. Booker's service extends far beyond her church. She has been a  consistent advocate for children's welfare and has worked relentlessly  to provide opportunities for underserved populations. Her tireless  efforts reflect her core belief that every child deserves access to  quality education and a supportive community. Mrs. Booker…", "date": "2025-08-26", "source_url": "https://justfacts.votesmart.org/public-statement/1694759/recognizing-mrs-juanita-carson-booker"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…volunteering in students' classrooms, which led to her co-founding the  Adams 12 Community Action Network, dedicated to empowering students by  providing equal learning opportunities at local schools.\n\nOn behalf of the people of Colorado's 7th Congressional District, it  is my honor to thank Representative Bird for her dedication to serving  her community.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698814/recognizing-colorado-state-representative-shannon-bird"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…rent assistance, homeless assistance, maternal  mortality, childcare, and Head Start.\n\nThere are two paths that we face today. One: If we pass the bills and  see what our opportunities are to make a difference and make changes in  an agency so needed to be changed--and I do believe we all recognize  that--and at the same time to save the American people.…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699573/consolidated-appropriations-act-2026"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…what their employers owe  them, rather than serving as an occasional boost in take-home pay for a  job well done.\n\nIn short, it expands the subminimum wage and offers more  opportunities to pay workers less. As I said, we should really call  this bill the Republican invent new ways to pay workers less bill.\n\nNo responsible policymaker should be arguing…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698962/tipped-employee-protection-act"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…foundation for us to end the affordable  housing and homelessness crisis.\n\nThis bill would update and improve existing Federal housing programs  by expanding local development opportunities and modernizing existing  housing programs in communities across the country. It will also  support community financial institutions to meet the housing needs in  their…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699805/housing-for-the-21st-century-act"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…in Waterford, you-picks like Great Country Farms in  Bluemont, and llama and alpaca farms like Double 8 Alpaca & Llama Ranch  in Purcellville, agritourism offers growing opportunities for farms to  diversify their revenues, connect with our communities, and become more  resilient.\n\nAgritourism isn't just a trend or fad. It is an economic imperative…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691461/supporting-agritourism"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…admit Taiwan as a member, allowing the IMF to monitor and evaluate the  health of Taiwan's economy, provide technical support to Taiwanese  officials, and support employment opportunities at the IMF for Taiwan  nationals.\n\nGiven its contribution to the global economy, Taiwan should certainly  not be locked out of membership. Not only will this benefit Taiwan,…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692795/taiwan-non-discrimination-act-of-2025"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…money talks, so let's talk money. This administration  slashed funding of seven government agencies that provide Black  communities with educational materials and economic opportunities,  including the Minority Business Development Agency, the only Federal  agency dedicated to uplifting minority businesses. This agency helped  entrepreneurs all across…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690636/trumps-first-100-days"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…firms are critical partners to Federal  agencies as a result of that law, yet the WOSB goal has been met only  twice, and women-owned firms are not seeing the contracting  opportunities that should accompany their level of participation in the  market. We need to again provide a boost to the WOSB program and  encourage more competition and success for…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691797/wosb-accountability-act"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…is raining.\n\nWe have to understand that working people do not want a handout. They  want a good job, a pathway to the middle class, and a comfortable  retirement. Those opportunities have slipped away for too many people.\n\nWhen people tell us that they are struggling to afford prescription  medications, we can't turn around and tell them that they are…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689078/economic-populism"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…making sure that everyone has a chance to experience the joy and  connection of sports.\n\nToo often, athletes with special needs are left without access to the  kinds of opportunities so many take for granted, which is real teams,  real competition, and real crowds cheering them on.\n\nThis is an exciting new effort. There is so much going on with soccer…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695809/recognizing-spokane-impact"}, {"senator": "Ashley Hinson", "party": "Republican", "sentence": "…other Iowans.\n\nHowever, outdated regulatory red tape prevents skilled workers from  being able to take advantage of voluntary--I repeat--voluntary  professional development opportunities offered by employers. My bill,  the Flexibility for Workers Education Act, would cut this red tape,  expanding access to these voluntary education programs that allow…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698956/flexibility-for-workers-education-act"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "…concerns and priorities.\n\nI met with leaders in our communities, including our Governor, to  discuss how our Federal policies affect their lives. Together, we  explored opportunities to deliver more for all Hoosiers.\n\nI visited hardworking families, farmers, local businessowners, and  the employees who make them go. I discussed our passage of the working…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694973/hoosier-heartland-tour"}, {"senator": "Mike Collins", "party": "Republican", "sentence": "…have got more years behind me than in front of me.  One of the reasons that I came to Washington, D.C., was to make sure  that my kids and the next generation had the same opportunities that I  did when I was growing up.\n\nThis piece of legislation addresses that. It is one of many pieces,  but it addresses that with the fact that all we are doing is asking…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698036/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…our economic strength but our national  security, our global leadership, and God forbid, a sovereign debt  crisis certainly would rob our children of their freedom and  opportunities in this great land.\n\nMr. Speaker, I thank Mr. Moore for his leadership on the committee. I  thank him for his strong voice and vision and most of all for his  courage to…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691961/supporting-the-big-beautiful-bill"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…voted twice to extend  these temporary enhanced premium tax credits but specifically did not  make these  premium tax credits permanent. They didn't do it. They had many  opportunities to make these permanent if they wanted to do that as much  as they say today, but they didn't. They had many opportunities to make  these permanent if the enhanced premium…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698304/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…work  serving their community.\n\nThis legislation will provide a permanent home for programs that  strengthen conservation, support farmers and landowners, and create new  opportunities for young people through 4-H extension services.\n\nIt is a practical, cost-effective solution that delivers real value.  I, once again, thank Representative Hill for his…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698160/conveyance-of-specified-forest-service-property-to-perry-county-arkansas"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…tailored education that meets  a student's unique needs. As chairman of the Education and Workforce  Committee, I am committed to expanding strong, personalized educational  opportunities so every student can succeed.\n\nIDEA was an incredible first step in making education possible for  our Nation's students. As we look to the future, we must maintain and…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697766/50th-anniversary-of-the-individuals-with-disabilities-education-act"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…opportunity to debate. That is  important.\n\nWhen we are in the minority, Republicans put up amendments to  constant legislation that the Democrats are doing, and it does create  opportunities for dialogue. I think once we go through that, there is  obviously a lot of posturing and messaging going on, but there is real  communication.\n\nAfter a housing affordability…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691166/events-this-week"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…trafficking prevention, and family outreach.\n\nOver the past 25 years, Place of Hope has served more than 150,000  children, youth, and families--offering safe homes, educational  opportunities, and pathways to independence. Their programs keep  siblings together, provide refuge for trafficking survivors, and  distribute more than two million pounds of food to…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694742/recognizing-place-of-hope"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…reduced subsistence, and no hope for the future of our people.'' In  front of those gathered, Secretary Burgum committed to rectifying this  injustice.\n\nBecause of the opportunities provided by oil and gas operations, this  industry has provided thousands of good-paying jobs to Alaskans, become  the primary driver of my State's economy, and transformed…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697739/9999"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…appropriate, connecting small businesses with       career and technical education programs to assist students       and graduates of such programs with identifying career       opportunities.''.\n\n(c) Women's Business Centers.--Section 29(b) of the Small       Business Act (15 U.S.C. 656(b)) is amended--\n\n(1) in paragraph (2), by striking ``and'' at the end;…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691731/connecting-small-businesses-with-career-and-technical-education-graduates-act-of-2025"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…For a court to grant this relief, a defendant must show that the  offense was committed as a direct result of being a victim of human  trafficking.\n\nTo ensure that these opportunities are only available to true victims  of trafficking and not criminals, we have worked hand in hand with law  enforcement to include appropriate safeguards in the bill. The…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697182/trafficking-survivors-relief-act"}, {"senator": "Mark Messmer", "party": "Republican", "sentence": "…and Exchange Commission and the  Commodity Futures Trading Commission, while also creating guardrails to  incentivize and safeguard investment.\n\nThe bill not only expands opportunities for Wall Street and Silicon  Valley, but it also provides great opportunities for Hoosier farmers by  opening a new frontier for rural innovators and expanding access to…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693781/digital-asset-market-clarity-act-of-2025"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…drive to serve others.\n\nThis program is more than just a pageant. It promotes healthy living,  creative expression, and academic achievement, while offering  scholarship opportunities that help young women achieve their  educational dreams. It fosters personal growth, professional  development, and a powerful network of female leaders who are making…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695223/congratulating-miss-ohio-olivia-fosson-and-miss-ohios-teen-allison-payton"}]