[{"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…face  due process.\n\nDue process is the cornerstone of our country. It distinguishes us  from an authoritarian dictatorship, and Donald Trump wants to destroy  it. It is not optional, and court rulings are not simply suggestions.  They are the backbone of American democracy. They are our final  safeguard against the unchecked power of the executive.\n\nWhen…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690393/attacks-and-threats-on-democracy-and-rule-of-law"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…Rights is so dangerous. This is  not reform. This is retreat. It will set public education back more  than 50 years.\n\nIn Hawaii, we know what happens when FAPE is treated as optional. The  Felix Consent Decree raised the alarm more than 30 years ago that we  were failing our children. We are the tenth largest school district in  the Nation. One in ten…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698942/protecting-education-for-children-with-disabilities"}, {"senator": "Ilhan Omar", "party": "Democrat", "sentence": "…government can silence you, detain you, or deport you while defying  court orders, then none of our rights are safe. If we let this slide,  we are saying the Constitution is optional. It is not.\n\nWhat we are seeing is authoritarianism creeping in through the  backdoor, one ignored ruling at a time.\n\nMy colleagues and I are ready to fight back with everything…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690505/trump-immigration-policies"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…home-care spending. 4.5  million people receive Medicaid-covered home-care services each year in  America.\n\nMedicaid cuts as proposed under the Republican budget threaten  optional benefits the most, including long-term services and supports  that help the disabled and the elderly in home- and community-based  services that help protect these Americans…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691415/gop-tax-scam-hurts-everyone"}, {"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…justification  for censorship.\n\nIf we allow history to be erased in our national parks, places meant  to endure beyond political cycles, we normalize the idea that facts are  optional and truth is negotiable.\n\nThat is not just an attack on historians or park rangers. It is an  attack on democracy itself, and the timing could not be more ironic.\n\nAs we approach…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699714/rewriting-history"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…Energy would have the  final say on pipelines and power lines, respectively.\n\nWhile FERC and DOE could consult with other appropriate Federal  agencies, such consultation is optional.\n\nIf there is a disagreement between the State Department and the  Department of Energy or the State Department and FERC, this bill says  that our national security and diplomatic…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695689/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…undermining it. The Constitution guarantees due process. It guarantees  equal protection. It guarantees freedom from unreasonable searches and  seizures. Those rights are not optional, and they are not  discretionary. They are not suggestions. They do not disappear because  someone wears a badge.\n\nThis bill sends a simple message. If you violate someone's…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699645/upholding-rule-of-law-for-federal-officers"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…families will be forced  to pay even more for the products they need to care for their children  such as high chairs, cribs, strollers, and car seats. Car seats are not  an optional purchase. They are required by law.\n\nThat is why today my Democratic colleagues and I are calling on the  administration to exempt essential childcare products from these…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689419/protecting-american-families"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…whenever it claims national security.\n\nIn Hawaii, where trust around military land use is damaged, quite  frankly, and lease negotiations are ongoing, accountability is not  optional. A back-door taking of our lands is 100 percent unacceptable.\n\nAllowing this amendment to pass would set a dangerous precedent, undo  decades of progress, and erode community…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695235/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "…we are the ones who must be the adults in the  room because Trump is, yet again, acting like a toddler throwing a  tantrum on a playground, acting as if obeying the law is optional,  acting as if the Constitution is nothing more than a yellowing piece of  paper that he can rip up at will.\n\nThose are just some of the many, many reasons why, today, I am…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696554/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…kind of  specificity within the Constitution, but that is it. You have got a  right to say it. Don't follow illegal orders. That is a mandate. It is  not something that is optional. You have got a right to say it. And you  have got a right to say it without having someone indicate that you  somehow have done something wrong and that you somehow ought…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698076/liberty-and-justice-for-all"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…express consent of Congress. The Constitution is clear: The power to  declare war belongs to the people through their elected Representatives  in Congress. That authority is not optional; it is not symbolic. It is  actually a pillar of democratic accountability when it comes to matters  of war and peace, to life and death.\n\nThe Senate has now spoken with a…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698823/9999"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…close  to the people. They rejected centralized control because they  understood that democracy cannot survive when the Executive controls  the ballot.\n\nThat principle is not optional. It is structural. It is foundational.  It is what the Founding Fathers built into the system to make sure that  we did not have a King, that we did not have a Monarch. They…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700022/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…nonelderly AIAN adults and 44 percent of [American Indian/      Alaskan Native] children.\n\nHow the Federal Government funds the states' Medicaid       plans.\n\nMedicaid began as an optional program in 1966 alongside       Medicare, with around 8 million people eligible for       enrollment. By the 1980s, all states had opted into providing       health insurance…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…need to rise. Yet, people  still rise because of a Congressman like Chuy Garcia, the kind who  understands that the struggle for human dignity is never finished and  never optional.\n\nChuy Garcia's life is stitched together with the same thread that  carried our greatest fighters forward, the belief that one does not  have to accept the world as it is,…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696773/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…colleagues want to blur the edges, soften the facts, or  bury this under procedural fog--noise, as I call it. Sunlight is the  best disinfectant, and accountability is not optional.\n\nThis resolution is not excessive at all. It is appropriate. It is  measured. It is necessary at this time.\n\nThe question before us is very simple: Do we uphold a minimal--a…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696890/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Todd Young", "party": "Republican", "sentence": "…manufacturing State. About 45 percent of our  instate electricity generation comes from coal. That is the reality.  That means dependable, around-the-clock capacity isn't optional; it is  how the Hoosier economy runs.\n\nYes, the expectation was that four Indiana coal-fired power units  would be offline by 2024, but the facts on the ground have changed,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695511/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-emissions-budget-and-allowance-allocations-for-indiana-under-the-revised-cross-state-air-pollution"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…centers. Rare earth elements make possible the  cutting-edge technologies that enable our economy to innovate and our  military to keep us safe.\n\nThe global mineral race is not optional. Over the next 15 years,  demand for copper and rare earth elements is expected to rise by 50  percent; cobalt, 150 percent; and lithium, up to 500 percent. Shortages  of…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699695/critical-mineral-dominance-act"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…remaining six bills have all passed the House, we are  dealing with a partial government shutdown that could have and should  have been avoided.\n\nFunding the government is not an optional exercise. It is the most  basic duty we have in Congress. Two weeks ago, the House and the Senate  struck a bipartisan and bicameral deal to move forward on these  remaining…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699575/consolidated-appropriations-act-2026"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…there is a way to keep these offices in these cities:  Stop being sanctuary cities. Comply with the law.\n\nWhen did complying with the Federal law become something that was  optional in America? It is incredible.\n\nAs we hold sanctuary jurisdictions accountable, we must recognize  that not every community in a sanctuary State is part of the problem. I…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692103/save-sba-from-sanctuary-cities-act-of-2025"}, {"senator": "Nicole Malliotakis", "party": "Republican", "sentence": "…However, outdated IT  infrastructure and delivery systems have left many vulnerable to fraud  and stolen tax reimbursement checks.\n\nModernizing these systems is no longer optional. It is necessary to  protect taxpayers, to enhance efficiency, and to reduce fraud.  Obviously, there is still more work to be done. We still need the DOJ  and our law enforcement…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689293/recovery-of-stolen-checks-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…and low-income households are living paycheck to paycheck, ensuring  Americans have access to affordable credit has never been more  important.\n\nOverdraft protection is an optional service that financial  institutions provide to help consumers avoid having purchases declined.  Instead of the transaction being denied, the bank or credit union  charges…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689849/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…targeting global communication  networks, especially cutting undersea cables that connect us to our  allies, like Japan, Korea, and Taiwan.\n\nSecure, resilient connectivity is not optional. It is a strategic  necessity. H.R. 261 is a solution that offers a balanced, commonsense  solution. It cuts unnecessary red tape. It preserves environmental  safeguards.…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699956/undersea-cable-protection-act-of-2025"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…fraud, and abuse found  in Federal programs, such as funding for Iraqi ``Sesame Street,''  electric buses in Rwanda, and LGBTQ programs in Uganda. Fiscal  responsibility is not optional. It is a basic obligation that House  Republicans are focused on each and every day in the 119th Congress.\n\nMr. Speaker, the second session of this Congress is not about…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698651/following-through-on-americans-priorities"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…imposed by a government or quasi-      government entity;\n\n(iii) assessment fees of a government-created special       district or program; or\n\n(iv) any charges or fees for an optional product or service       associated with the covered services that may be selected by       a purchaser of covered services.\n\n(2) Commission.--The term ``Commission'' means…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690200/hotel-fees-transparency-act-of-2025"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…is a joint Federal-State program . . . The  Federal Government requires States to cover certain mandatory  populations and services,'' but ``allows States to cover other  optional populations and services.'' Due to this flexibility, there is  substantial State variation in ``factors such as Medicaid eligibility,  covered benefits, and provider payment…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691940/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "…appropriations package. As has been said, it  provides the full-year funding for five out of the remaining six  appropriation bills.\n\nUnfortunately, funding these bills is not optional. It is part of our  constitutional requirements, and we must act on our commitment to the  American people. With this bill before us today, the government will  continue operating…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699576/consolidated-appropriations-act-2026"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…service fee, charge and order processing fee, delivery fee,       facility charge fee, tax, and any other charge; and\n\n(B) does not include any charge or fee for an optional       product or service associated with the event that may be       selected by a purchaser of an event ticket.\n\n(7) Optional product or service.--The term ``optional…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690175/transparency-in-charges-for-key-events-ticketing-act"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "…this sort of resource management plan is out of  bounds.\n\nBy passing this resolution, we reassert congressional intent and  remind the bureaucracy: Our boundaries are not optional.\n\nMr. President, this rule will need to be replaced once we repeal it.  Thank goodness Congress had the foresight in the Congressional Review  Act to say no replacement rule…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696136/national-defense-authorization-act-for-fiscal-year-2026"}]