[{"senator": "Val Hoyle", "party": "Democrat", "sentence": "HOYLE of Oregon."}, {"senator": "Jahana Hayes", "party": "Democrat", "sentence": "Speaker, I thank the gentlewoman from Oregon for her  support."}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "Oregon is no stranger to the  devastating effects it has wreaked in our communities."}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "Speaker, I have been an education advocate for decades, and I  speak with students, parents, and educators in Congress and at home in  Oregon, and I can't count the number of times where parents have said  to me: Please, please fully fund IDEA."}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "Over the past few months, I have heard from many  Federal workers in Oregon who have faced illegal firings, threats, and  mistreatment."}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "Speaker, I now yield to the gentlewoman from Oregon (Ms."}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "HOYLE of Oregon."}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "Speaker, I rise today not just as a Member of  Congress but as a proud Oregonian."}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "In my district alone, over 255,000 Oregonians, including 59 percent  of our children, rely on Medicaid for lifesaving care."}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "So I would like to ask my colleague from the great State of Oregon a  question about these decisions to basically unlawfully pick winners and  losers."}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "Madam Speaker, I yield 3 minutes to the gentlewoman from Oregon (Ms."}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "President, I was participating in the 2025 Oregon  Business Plan Leadership Summit and necessarily absent for rollcall  vote No."}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "Thousands of workers, many in rural and coastal counties in my home  State of Oregon, but also across the country, will lose the jobs they  just started."}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "HOYLE of Oregon."}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "In Oregon,  ICE agents are stalking school parking lots and school routes and  detaining parents in front of their children."}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "655) to direct the Secretary of Agriculture to  convey certain Federal land to the City of The Dalles, Oregon, as  amended."}, {"senator": "Mike Bost", "party": "Republican", "sentence": "4446 offered by my  colleague, Representative Maxine Dexter, from Oregon."}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "Chair, it is Florida, Michigan, and New Jersey, but here are the  States that are in line, that say we  want to protect our own environment, too: Alaska, Arizona, Indiana,  Kentucky, Maryland, Minnesota, North Dakota, Oregon, and Virginia."}, {"senator": "Mike Simpson", "party": "Republican", "sentence": "In fact, Idaho ranks third nationally in SRS funding, behind only  Oregon and California."}, {"senator": "John Barrasso", "party": "Republican", "sentence": "The local newspapers around the country--as a matter of fact, a  newspaper in the Senator's home State of Oregon reported:\n\nFood is the first thing to go."}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "They  are 88 cents higher than fourth place Oregon, 94 cents higher than  fifth place Nevada, a $1.16 higher than sixth place Alaska."}, {"senator": "Bernie Moreno", "party": "Republican", "sentence": "The Senator from Oregon."}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "Speaker, we heard the gentlewoman from Oregon (Ms."}, {"senator": "Cliff Bentz", "party": "Republican", "sentence": "His office is right across from mine and his district is right across  from mine in California from Oregon."}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "The opportunities to save lives--whether it's someone who suffered a  cardiac arrest following a motor vehicle incident in Evansville,  Indiana, or a 12-day old infant who stopped breathing in Clackamas,  Oregon--are the situations for which EMS professionals train and  prepare."}, {"senator": "John Thune", "party": "Republican", "sentence": "President, this resolution concerns a lawsuit filed in  the Oregon Supreme Court against Senator Wyden."}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "Speaker, with gray wolf populations reaching  over 400 in Washington State and Oregon, I rise today to warn of the  danger they continue to pose for hunters, farmers, and livestock."}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "A native of Oregon and a proud graduate of the United States  Military Academy at West Point, Mr."}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "A Dundee, Oregon native and 2018 graduate of Oregon State University,  Brannon began his career in the U.S."}]