[{"senator": "Tim Kaine", "party": "Democrat", "sentence": "…is  affected; particularly hospitals, for whom Medicaid is a huge portion  of the revenue stream coming into the hospital, find that they can't  make it work.\n\nA national organization that looks at hospital fiscal soundness has  put about 300 hospitals in the United States on a list of hospitals  that are in danger because of the Medicaid cuts. Six of…", "date": "2025-10-01", "source_url": "https://justfacts.votesmart.org/public-statement/1695967/en-bloc-nominations"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "Mr. BISHOP. Mr. Speaker, I rise today to recognize the outstanding  achievements of the Next Level Community Development Center, a  community nonprofit organization driven by its mission to foster  academic achievement, college and career readiness, parental  involvement, and youth development through mentorship and programming  in…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693506/recognizing-macons-next-level-community-development-center"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…Slovakia, Spain, and Sweden.\n\nWith this resolution, House Republicans are sending a message to many  proud democracies, including multiple members of the North Atlantic  Treaty Organization (NATO), that we condemn the domestic political  process within their nations. As Ranking Member of the House  Appropriations Subcommittee on Defense, I know just how crucial…", "date": "2025-11-28", "source_url": "https://justfacts.votesmart.org/public-statement/1697166/denouncing-the-horrors-of-socialism"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…__________\n\nTo Whom it May Concern: This testimony is submitted       anonymously on behalf of a Massachusetts-based, community-      rooted mental health organization that primarily serves       Haitian individuals and families, many of whom hold TPS. To       protect the safety, dignity, and privacy of our clients,       staff and community…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699638/expert-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…Nursing, the National Academies of Practice and the New York Academy of  Medicine.\n\nThe American Association of Nurse Practitioner is the largest  professional membership organization for nurse practitioners,  representing the interest of the over 431,000 licensed nurse  practitioners in the United States who are delivering care in nearly 1  billion patient…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690400/recognizing-the-service-of-dr-stephen-a-ferrara"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…you is going to, in fact, raise the price of  goods for Americans.\n\nDon't take my word for it, listen to the National Association of Home  Builders, a staunch Republican organization that has warned this  administration that putting tariffs on everything from steel to copper  and nickel is going to drive up the price of home construction.\n\nIn fact, screws…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689376/cost-of-living-still-high"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…These three agencies are  critical to the independent operations of Congress and should not be  subject to undue influence by the executive branch or any other  external organization.\n\nThe Librarian of Congress is the main research arm of Congress,  managing the Congressional Research Service. The Comptroller General  leads the Government Accountability…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697708/supporting-the-legislative-branch-independence-act"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…also waging a war against nonprofit organizations, yanking  grants away that have already been made and allocated. He is  threatening to remove the tax-exempt status of any organization that  may disagree with his opinions or support lawsuits that might actually  enforce existing laws.\n\nMr. Speaker, you see where this is going. The media, the FBI,  inspectors…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690393/attacks-and-threats-on-democracy-and-rule-of-law"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…nationals on February       3, 2026, Rian Immigrant Center respectfully submits the       following remarks.\n\nRian Immigrant Center (``Rian'') is a 501(c)(3) non-profit       organization located in Boston, Massachusetts and serving       immigrant and refugee communities across the Commonwealth,       primarily through our Immigration Legal Services program.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699703/community-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…hard to measure and would not have any material impact  on our elections.\n\nIf you don't believe me, ask folks over at the libertarian Cato  Institute, a very conservative organization. They have labeled  President Trump's claims about noncitizen voting as ``bogus''--their  word, not mine.\n\nThe order of the President also raises significant constitutional…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690522/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…like it was that great under the previous Trump  administration, either. The National Coal Council operated in the  previous Trump administration as some kind of bizarre organization that  was intertwined with a trade association that went by the same name,  funded by private contributions from companies that made up the real  government coal council.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695765/national-coal-council-reestablishment-act"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…benefits to 73 million retired workers, their       survivors, and poor and disabled Americans is engulfed in       crisis--further undermining the already struggling       organization's ability to provide reliable and quick service       to vulnerable customers, according to internal documents and       more than two dozen current and former agency employees…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689130/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…those present to ``protect and  advance the interests and ideals of America.''\n\nSince such time the DACOR Bacon House has served as the headquarters  of DACOR, a premier organization of foreign affairs professionals,  whose members include ambassadors, Foreign Service Officers, military  and intelligence officials, political appointees from both major…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692065/recognizing-the-dacor-bacon-house-bicentennial-day"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…send a signal about the  independence of this branch, the legislative branch.\n\nForeign governments have figured out a lot of ways to line Donald  Trump's pockets. The Trump Organization--he is still the owner. It may  be in trust. He maybe figured out some technical legal way to seem to  insulate or isolate himself from it. But that organization is doing…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691548/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…Schiff and Kaine's resolution regarding war powers.\n\nThis resolution would just say very simply that if the Trump  administration wants to be at war against a terrorist organization,  they should come to Congress, notify us, and seek our approval.\n\nCurrently, the administration is waging a secret war against a secret  list of unnamed groups that they…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696126/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…a broken leg, but I don't have $5,000  for the emergency room visit and all the care and whatnot, so you share  and defray that cost across people often in a faith-based organization,  but sometimes secular.\n\nIsn't that the engine of what we are talking about?\n\nMr. ROY. Then, would it not require us to simply say that you can  leave ObamaCare in place?…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698106/bringing-america-back-to-its-roots"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…Association of Public Personnel  Administrators and the Public Sector Human Resources Association. She  also served in leadership roles for the IPMA-HR Southern Region  organization.\n\nBersheba is blessed with two daughters, Ashley Burton and Alayna  Pernell, and two grandchildren. On December 10, 2025, an event will be  held to celebrate her retirement…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697364/recognizing-the-retirement-of-bersheba-austin"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…hard-to-staff subjects like STEM, special  education, and bilingual education. In fact, in this last school year,  over 75 percent of TFA teachers served in title I schools.\n\nThe organization is recruiting motivated and talented young people to  go teach in areas where they have a hard time getting teachers, but how  do they do once they are there? The second…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…hand to those in need.\n\nTheir work is not just about addressing immediate challenges but  about creating lasting change and hope.\n\nAs co-chair of the Congressional Service Organization Caucus, it is a  privilege to celebrate National Volunteer Month, recognizing and  honoring the millions of individuals who dedicate their time and  talents to making our…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689399/national-volunteer-month"}, {"senator": "Eric Burlison", "party": "Republican", "sentence": "…funding for the National Endowment for Democracy, a  program that Elon Musk, while leading DOGE, publicly said was a scam,  that it was rife with corruption and an evil organization that should  be dissolved. President Trump and his administration attempted to do  that, and yet here we are trying to fund it.\n\nThis program was sold to the American people…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699049/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Troy Balderson", "party": "Republican", "sentence": "…could increase by 100 percent by 2030.\n\nMr. BALDERSON. The Reliable Power Act directly responds to those  concerns. First, it requires NERC, the electricity reliability  organization, to conduct annual long-term assessments of the bulk power  system. If NERC finds the grid is at risk of inadequate generation, it  must notify FERC.\n\nFERC must then notify…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698277/reliable-power-act"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…held key positions in  Sales, Marketing, and Government Affairs, including serving as the  director of U.S. Public Affairs before leading the Global Government  Affairs organization. In this pivotal role, he developed Deere's  strategy and advocacy priorities leading to legislative, regulatory,  and public policy outcomes that ultimately benefited the…", "date": "2025-08-12", "source_url": "https://justfacts.votesmart.org/public-statement/1694731/congratuling-deere-company-vice-president-of-global-government-affairs-collis-jones-on-his-retirement"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…will be working here to make happen.\n\nWe must join Egypt, Saudi Arabia, the UAE, and Bahrain and declare  the Muslim Brotherhood and all of its affiliates the terrorist  organization that it is.\n\nWe must tackle the anti-Semitism that we have seen at our  universities, and I have a bill that will deal with that. That is  because when people hear lies…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691864/call-evil-by-its-name"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…make Federal spectrum available       for commercial uses as required by section 113(j)(1) of the       National Telecommunications and Information Administration       Organization Act (47 U.S.C. 923(j)(1)).\n\n(5) Sharing of Federal spectrum between Federal entities       and commercial entities provides access to Federal spectrum       for commercial…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693439/institute-for-telecommunication-sciences-codification-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Pasco County. Charles W. Anderson, recently retired  January 2025 as President & CEO of United Way of Pasco County (UWPC).  He has made a profound and lasting impact on the organization and the  community it serves. Since assuming leadership in January 2019, Charles  transformed UWPC into a more dynamic, responsive, and impactful  organization, nearly doubling…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690203/recognizing-chuck-anderson"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Tahoe. A small group of individuals formed the Tahoe  Power Boat Club to organize seasonal boat regattas, which quickly  became a highlight of the Tahoe Basin. In 1938, the organization  officially became the Tahoe Yacht Club, the name it proudly holds  today.\n\nOver the following decades, membership grew exponentially to around  600. The organization later…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…including--\n\n``(I) not less than one individual from the private sector;\n\n``(II) not less than one individual from academia;\n\n``(III) not less than one individual from an organization       with demonstrated expertise in ensuring artificial       intelligence outputs--\n\n``(aa) are reliable, secure, transparent, and not used for       illegal purposes;…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699206/artificial-intelligence-wisdom-for-innovative-small-enterprises-act"}, {"senator": "Markwayne Mullin", "party": "Republican", "sentence": "…sum of 10,000 more individuals--than we  lost in U.S. personnel during the entire Vietnam war. If that is not an  attack on us, I don't know. If that is not a terrorist organization  that is truly poisoning our streets, then I don't know.\n\nDuring the time that the junior Senator from California sat on Intel,  not one time did he ever ask for the release…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698424/unanimous-consent-requests-the-calendar"}, {"senator": "Gary Palmer", "party": "Republican", "sentence": "…Attorney General Dave  Sunday. It really doesn't matter what the motivation is. What matters  is the result--fraudulent voter registrations.\n\nBack in 2008, there was an organization called ACORN. There was an  ACORN whistleblower who worked for both it and its Project Vote  registration affiliate from 2005 until 2006. She said: It is ludicrous  to say…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699945/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "Mr. FITZPATRICK. Mr. Speaker, I rise today to recognize an  extraordinary group of individuals from Pennsylvania's 1st  Congressional District--an organization that has gone above and beyond  the call of duty in service to both our community and our country. It  is with great respect and admiration I recognize the Ukrainian American…", "date": "2025-10-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696205/recognizing-the-ukrainian-american-sport-center-tryzubs-75th-anniversary"}]