[{"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…during the Whiskey  Rebellion, there was a need for Federal troops there. Nearly 1,000  Federal troops, in fact, died at the Battle of Wabash.\n\nWe are not seeing armed rebels organized to resist Federal taxes  coming against local police. We are not seeing the troops in a pitched  battle with organized rebels here in DC or in Portland or Chicago. What…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696297/9999"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…congregation  grew into a thriving interdenominational ministry impacting lives  locally and globally. He also served as Pastor of New Zion Hill Baptist  Church and later organized Divine Covenant International Fellowship,  providing apostolic covering and mentoring more than 100 ministers,  preachers, and leaders--many in Liberia--under his apostolic…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699461/in-memory-of-bishop-dr-frederick-williams-sr"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…affiliated group which includes the entity has       substantial business activities in the foreign country in       which or under the law of which the entity is created or       organized when compared to the total business activities of       such expanded affiliated group. For purposes of subsection       (a)(2)(B)(iii) and the preceding sentence, the term…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699933/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…State Police established their  headquarters in North Scituate, where they remain to this day.\n\nDuring their 100 years, they have been known for excellence in  disrupting organized crime, responding to emergencies, solving complex  financial and cybercrimes, and keeping the roads safe and traffic  moving. They also have a history of lending a hand to…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689770/hands-off-social-security"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…language to say no tax on tips,  no tax on overtime, no tax on Social Security.\n\nWell, what did Elon Musk have to say about that or what did his  organization have to say?\n\nThey organized the readers content comments to correct falsehoods  that people put in their tweets, and every single time a Republican  went up and said that that resolution had eliminated…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688265/problems-caused-by-doge-cuts"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…minority, forcing 1.5 million people to flee to Bangladesh and  Thailand. A recent investigation by the United Nations concluded the  2017 attacks were a ``coordinated and organized operation'' to strip  the Rohingya of their land rights within the country. In 2022, the  State Department officially determined that these actions constituted a  genocide.…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697902/burma"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…his life as an activist.\n\nRustin's most important role was as the chief organizer of the  historic March on Washington for Jobs and Freedom, the largest  demonstration ever organized at the time, in which a quarter of a  million people turned out to demand civil rights for African Americans.\n\nIn the years after the civil rights movement, Rustin, a gay…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699806/introduction-of-the-bayard-rustin-stamp-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…as irritability or sadness;       or\n\n(IV) difficulty sleeping; and\n\n(C) can occur--\n\n(i) with or without the loss of consciousness; and\n\n(ii) during participation in any organized sport or       recreational activity.\n\n(2) Health care professional.--The term ``health care       professional'' means an individual--\n\n(A) who has been trained in diagnosis…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695777/by-mr-padilla"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…been focusing on a variety of other things that relate simply to  jamming their extreme rightwing ideology down the throats of the  American people, including by targeting organized labor, hardworking  men and women, including those who are part of the Federal workforce.\n\nWhat is it that Federal employees do each and every day to make sure  that they…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697994/protect-americas-workforce-act"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…Station in Fauquier County. I am so excited  about this center because it is going to deliver top-quality care to  veterans in our region.\n\nMr. Speaker, 128 private rooms are organized into households and  neighborhoods around a central community center. The site actually  played a decisive role during World War II in intercepting enemy  communications,…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698917/korean-american-day"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…This annual event brings hope and healing to families across our  region, offering space for remembrance, resilience, and collective  action to end the tragedy of suicide.\n\nOrganized by the National Capital Area chapter of AFSP, the Fairfax  Walk has become one of the most visible demonstrations of solidarity in  the fight for mental health awareness…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696049/recognizing-the-18th-annual-out-of-darkness-walk"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…nightclub.\n\nYou and I talked a lot before we got on this floor, and I think the  agony that you and I were feeling was, how can this be the strongest  Nation in the world, organized government?\n\nIf you read our founding documents, if you read our Founding Fathers,  one of the first things they organized this government for--you know,  it is good to carry…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…waste or certainly fraud and  abuse, I want to do that, and I want that to be done across the board.  Whether you are talking about health programs where they could be  better organized or they could be more efficiently run to achieve the  goal of better services for the people you represent and I represent  for all Americans, I want to do that.\n\nBut how…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688257/department-of-health-and-human-services"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…strong support of the Protect  America's Workforce Act.\n\nSince day one, President Trump has worked to dismantle the  institutions that protect workers and weaken the power of organized  labor. He dismissed commissioners from the Federal agency responsible  for enforcing workforce civil rights, and he stripped the National  Labor Relations Board of its quorum.…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697980/protect-americas-workforce-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…generations to work to ensure that such horrors never ever, ever happen  again.\n\nMr. Speaker, I regret I cannot be with them in Hiroshima and  Nagasaki. That is why I have organized this Special Order on the House  floor today so that Members can share their message from the floor of  the House.\n\nTo our colleagues, to the President, and to the American…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694117/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…across the country, our law enforcement officers are beset  from below and above. From below, on our streets, they face an  emboldened criminal element and a resurgence of organized political  violence. From above, in the halls of power, they face a political  class which seems hell-bent on undermining and attacking them at every  turn.\n\nWe have watched…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696003/unanimous-consent-requests"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…evolving threat to public       safety in the United States and around the world, targeting       innocent civilians and first responders.\n\n(3) These attacks, carried out by both organized terrorist       groups and individual actors, often aim to exploit high-      density public gatherings, critical infrastructure, and key       transportation hubs, causing…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696768/department-of-homeland-security-vehicular-terrorism-prevention-and-mitigation-act-of-2025"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…of the United Nations;\n\n(2) oppose any efforts to prevent the participation of any       Uyghur human rights advocates in nongovernmental fora hosted       by or otherwise organized under the auspices of any body of       the United Nations; and\n\n(3) support the appointment of a special rapporteur or       working group for the XUAR for the purposes…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694799/uyghur-policy-act-of-2025"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…the 144th Legislative District  with questions, concerns, and access to government services.\n\nHer long professional career reflects a deep commitment to public  service and organized labor. Ms. Hoover served the City of Philadelphia  as a Real Property Evaluator and later as Legislative Coordinator for  AFSCME District Council 47. She has held numerous…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697487/recognizing-warminster-township-board-of-supervisors-judy-hoover"}, {"senator": "Mike Johnson", "party": "Republican", "sentence": "…delegation of German staff members will visit the United  States from Saturday, December 6 to Saturday, December 13, 2025. They  will attend similar meetings in Washington organized by the members of  the U.S. delegation.\n\nThe Congress-Bundestag/Bundesrat Exchange is highly regarded in  Germany and the United States and is one of several exchange programs…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693345/announcement-of-the-2025-congress-bundestagbundesrat-exchange"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…revenue--the receipts always sort of stay right there in that  mean.\n\nIf I can get my boards in some sort of order so they will make sense  to us--forgive me, as I get myself organized here. I put them in out of  order.\n\nWhat should scare us to death is, right now, basically the percentage  of all tax receipts required to cover interest. This year, for…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692327/math-always-wins"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…thus directly       affecting the area for and number of timber sales that would       result in contracts. In essence the memorandum went beyond       how the Forest Service organized its internal operations.       Similarly, in B-238859, Oct. 23, 2017, we declined to apply       CRA's third exception to the Tongass Amendment, because it       was directed…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694908/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…of Commerce  embodies these principles and has served as a vital engine of  prosperity for generations.\n\nThe Chamber traces its origins to 1925, when local leaders first  organized a community chamber under the guidance of Frederick  Williamson, its inaugural president. Despite the challenges of the  Great Depression, the Chamber persevered and experienced…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695644/recognizing-the-greater-hernando-county-chamber-of-commerce"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…to break  the stigma and offer real support.\n\nJon and Haley's partnership has made a real difference. Together,  they have sent 24 officers at Thomson to ASSIST training, organized  suicide prevention walks, and led multiple staff recalls focused on  mental health and resources. They have also created a law enforcement  support group open to all staff…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699214/proud-announcements"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…pillar in the Savannah community, who passed away last month.\n\nMs. Pryor was an activist, joining the civil rights movement at a  young age where she proudly participated in organized sit-ins, marches,  and peaceful protests in the city of Savannah.\n\nAfter graduating from Savannah State College and Georgia Southern  University, Ms. Pryor served as an educator…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687985/mourning-the-loss-of-john-reginald-murphy"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…the       Commission, the Commission shall also enforce this section in       the same manner provided in subparagraph (A), with respect to       organizations that are not organized to carry on business for       their own profit or that of their members.       SEC. 4. DEFINITIONS.\n\nIn this Act:\n\n(1) Commission.--The term ``Commission'' means the Federal…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690186/tools-to-address-known-exploitation-by-immobilizing-technological-deepfakes-on-websites-and-networks-act"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…the       following:\n\n(1) An analysis and description of the extent to which any       foreign person who is a citizen of the People's Republic of       China or an entity organized under the laws of the People's       Republic of China, or any foreign person or entity controlled       by or operating at the direction of the Government of the       People's…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690679/economic-espionage-prevention-act"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…his age do in a full  day.\n\nHis Eagle Scout project was to replace a retaining wall at the fire  department in Gardiner, Montana. He arranged the preconstruction  meetings, organized the delivery of the supplies, and was even able to  get a price reduction to save money. He then rallied his football team  and his troop to replace the wall, completing…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689243/recognizing-eagle-scout-colter-lumley"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…can  scarcely capture.\n\nFounded in Philadelphia by displaced World War II Ukrainian  immigrants, the UASC Tryzub became an important part of the community.  The UASC Tryzub organized teams of all sports to play in various  leagues in Philadelphia, as well as gave the Ukrainian American  community a nourishing environment with personal and professional…", "date": "2025-10-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696205/recognizing-the-ukrainian-american-sport-center-tryzubs-75th-anniversary"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…46,       United States Code, is amended--\n\n(1) in paragraph (1) by inserting ``, including damage or       destruction resulting from cyber incidents, transnational       organized crime, or foreign state threats'' after ``adjacent       to such waters''; and\n\n(2) in paragraph (2) by inserting ``or harm resulting from       cyber incidents, transnational…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}]