[{"senator": "Becca Balint", "party": "Democrat", "sentence": "Ms. BALINT. Mr. Speaker, last Friday President Trump said he would  give a full and complete pardon to Juan Orlando Hernandez, the corrupt  former President of Honduras. It is disgusting.\n\nTrump is going to erase a major drug trafficking conviction against  Hernandez, who is serving 45…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697176/juan-orlando-hernandez-former-president-of-honduras"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…serious about drugs, I asked the chairman  previously: Why would the President of the United States pardon one of  the biggest drug dealers who was killing Americans, Juan Orlando  Hernandez. The last time, the gentleman said that he hadn't spoken to  the President and didn't know why.\n\nMr. Speaker, if he is so interested in stopping drugs, maybe he…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699971/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…learned they likely committed war crimes by ordering  a second strike targeting and killing survivors.\n\nAt the same time, President Trump is pardoning criminals like Juan  Orlando Hernandez, the former President of Honduras who was convicted  in a U.S. court for smuggling more than 500 tons of cocaine into our  country and was sentenced to 45 years.…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697535/venezuela-boat-strikes"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…Mr. President, I want to begin with a truly disgusting  and alarming piece of news the American people got this morning. This  morning, the former President of Honduras, Juan Orlando Hernandez, was  released from prison after Donald Trump gave him a pardon.\n\nWe all know Donald Trump does a lot of hypocritical things. Almost  every day there is hypocrisy…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697368/trump-administration"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…extreme measures that divide and polarize the Congress and the people.\n\nOnce upon a time this was a sensible, bipartisan bill led by our  Democratic colleague, Val Demings from Orlando, Florida, who had been a  police chief. Her bill allowed Federal agencies to sell handguns that  they were no longer using to the active-duty officers, who previously  carried…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691349/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…Parliament.  Significant fraud has been a problem in many of Honduras' past  elections, most notably prior to, and during, the 2013 and 2017  elections of former President Juan Orlando Hernando who today sits in a  U.S. prison. So it is important that this election, like the election  of Hernandez' successor in 2021, is widely accepted as free, fair, and…", "date": "2025-10-30", "source_url": "https://justfacts.votesmart.org/public-statement/1696472/honduras"}, {"senator": "Darren Soto", "party": "Democrat", "sentence": "Mr. SOTO. Mr. Speaker, 9 years ago today, on June 12, 2016, at 2:02  a.m., our little happy town of Orlando, Florida, was changed forever as  we saw 49 angels killed and 53 others who were injured in a mass  shooting during Latin Night at the Pulse nightclub, a safe place for  the…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692469/moment-of-silence-in-memory-of-pulse-nightclub-victims"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…Through tireless advocacy, they have strengthened our neighborhoods,  expanded opportunity for those too often left behind, and improved the  lives of countless families across Orlando: Admiral David Brewer, Alvin  J. Cowans, Jennifer Desir Hilaire, Chet Glover,  Florida Supreme Court Justice James Perry, Anne Piervil, Lisa Williams,  the late great State…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700051/black-history-month"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "Ms. PELOSI. Mr. Speaker, I rise today with deep concern at the  President's outrageous and shameful pardon of Juan Orlando Hernandez, a  man an American jury convicted of trafficking tons of cocaine into the  United States and of corrupting his own government in the process.\n\nI saw this firsthand…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697367/shameful-hernandez-pardon"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…State Scholastic Team Chess Tournament in both the  kindergarten through third grade and kindergarten through fifth grade  categories. The wins qualified them for a trip to Orlando, Florida,  earlier this month to compete in the National Elementary Championship  hosted by the U.S. Chess Federation. Beatty founded the Idlewild team  in 2013. He also coached…", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691697/congratulating-the-idlewild-elementary-school-chess-team-champions"}, {"senator": "Darren Soto", "party": "Democrat", "sentence": "…Senator Thompson developed a reputation as a respected local  historian for compiling the history of African Americans in Central  Florida and authoring the book ``Black America: Orlando, Florida.'' She  developed a passion for the history of African Americans in Central  Florida. She wrote a play based on her book called ``A Vote a Voice.''\n\nHer passion led…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689507/recognizing-geraldine-f-thompsons-service-to-the-great-state-of-florida"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…Well, it turns out those plans had been developing over a very  significant period of time.\n\nSo if it was about drugs, by the way, the President wouldn't have  pardoned Juan Orlando Hernandez, a drug kingpin, right in the middle of  the process of saying he is trying to stop drugs. Here is a guy who was  sitting in our prison because he was the architect…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698617/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Susie Lee", "party": "Democrat", "sentence": "…States  Transportation Command and three different assignments at the Defense  Logistics Agency.\n\nHer command tours include: The 143rd Sustainment Command  (Expeditionary), Orlando, Florida; The 77th Sustainment Brigade, Joint  Base McGuire-Dix-Lakehurst, New Jersey; The 655th Regional Support  Group, Westover Air Force Base, Massachusetts; The 359th…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692707/recognizing-deputy-chief-of-army-reserve-major-general-deborah-deb-kotulich-on-her-retirement-from-the-us-army-reserve"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…of  bipartisanship.\n\nThe last point I want to make is almost impossible to understand or  explain. Can you imagine that the former President of Honduras--his  name is Juan Orlando Hernandez--was prosecuted by the Federal  Government of the United States for his involvement in the trade of  narcotics? He was found guilty of having been involved and was…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697242/the-economy"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "Mr. FROST. Mr. Speaker, 9 years ago today, 49 lives were stolen and  ripped away from us at Pulse nightclub in my district, in my home of  Orlando, Florida, a safe haven for Orlando's LGBTQ+ community that was  turned into the site of unimaginable horror and a mass grave.\n\nPulse was more than just a club. It was love.…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692458/pulse-shooting-anniversary"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…continued hosting quarterly large  force exercises, training specialists in theater-deployable  communications, and delivering exclusive cross-demand training from  Charleston to Orlando.\n\nHis vision has solidified the CRTC as a vital national asset for the  Air Force, Air National Guard, Reserves, and other partners.\n\nMr. Speaker, I thank Colonel Thomas for…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699886/mark-burns-inducted-into-living-legends-of-aviation"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "…to his work as a barber, Earl has faithfully served the  Lord. For more than 35 years, he has served as a pastor to the deaf  community, including the past 17 years at West Orlando Baptist Church.  Through both his ministry and profession, he has strengthened families,  encouraged faith, and brought people together.\n\nI join his family, friends, the City…", "date": "2026-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1700281/recognizing-earl-brigham"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…pretending to be licensed therapists.       For example, a 14-year-old boy, after allegedly prolonged       conversations with an AI chatbot, tragically ended his life       near Orlando, Florida. His brave mother recently testified in       the Senate Judiciary Committee that the company Character       Technologies, Inc., would not disclose to her many of…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699543/true-cost-of-big-tech"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…artists such as Kid Rock. He will buy  the tickets and give them to people that deserve those tickets that  otherwise would not be able to afford them. My good friend Tony  Orlando, as well, does this. They are just wonderful artists that do so  much for our country, particularly our military and our veterans.\n\nMr. BILIRAKIS. Mr. Speaker, in closing,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690175/transparency-in-charges-for-key-events-ticketing-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…equipment and support will not       alter the basic military balance in the region.\n\nThe principal contractor will be Lockheed Martin Missiles       and Fire Control, located in Orlando, FL. At this time, the       U.S. Government is not aware of any offset agreement proposed       in connection with this potential sale. Any offset agreement       will be…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699396/arms-sales-notification"}, {"senator": "James Risch", "party": "Republican", "sentence": "…balance in the region.\n\nThe principal contractors will be the Javelin Joint Venture       between RTX Corporation, located in Tucson, AZ, and Lockheed       Martin, located in Orlando, FL. At this time, the U.S.       Government is not aware of any offset agreement proposed in       connection with this potential sale. Any offset agreement       will be…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692048/arms-sales-notification"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…BLOOMBERG RADIO & TV;       Rudowski, Taylor: CNN; Ruffini, Christina: NBC NEWS CHANNEL;       Ruffini, Joseph: CBS NEWS; Ruggiero, Diane: CNN; Ruiz,       Carlos: NBC NEWS; Ruiz, Orlando: CNN; Rupe, Megan: WJLA-TV/      NEWSCHANNEL 8; Ruppe, Blake: FOX NEWS; Rushing, Joshua: AL       JAZEERA ENGLISH; Ruskin, Elizabeth: ALASKA PUBLIC RADIO       NETWORK/ALASKA…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698150/members-entitled-to-admission-to-the-119th-congress-radio-and-television-correspondents-gallery"}]