[{"senator": "Seth Moulton", "party": "Democrat", "sentence": "Mr. MOULTON. Mr. Speaker, I rise today to welcome His All-Holiness  Bartholomew to Washington, D.C.\n\nThe Ecumenical Patriarch is the spiritual leader of over 300 million  Orthodox Christians worldwide. Since 1991, he has served as the  Archbishop of Constantinople--New Rome and Ecumenical Patriarch, a role  that traces its lineage to the earliest days…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695352/welcoming-his-all-holiness-bartholomew-to-washington-dc"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "Mrs. McIVER. Mr. Speaker, I rise today to extend a warm welcome to  His All-Holiness Ecumenical Patriarch Bartholomew, an esteemed leader  of the Eastern Orthodox Church, upon his visit to the United States.\n\nFor more than three decades, Patriarch Bartholomew has stood as a  moral voice in times of global challenge. When Europe faced…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695736/recognizing-the-visit-of-ecumenical-patriarch-bartholomew"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…Constantinople-New  Rome, and Ecumenical Patriarch, a historic title dating to the sixth  century.\n\nThe role of the Ecumenical Patriarch as the primary spiritual leader  of the Orthodox Christian world and transnational figure of global  significance has increased exponentially during the tenure of His All- Holiness.\n\nHe has co-sponsored international peace…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695051/recognizing-his-all-holiness-bartholomew"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…distinguished Templeton Prize. As the Representative for Rhode Island's  2nd Congressional District, I welcome Ecumenical Patriarch Bartholomew  on behalf of the vibrant Greek Orthodox constituency in my district,  including at the Church of the Annunciation in Cranston, Rhode Island.\n\nThe Church of the Annunciation was the first Orthodox Parish  established…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695494/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Rob Menendez", "party": "Democrat", "sentence": "…MENENDEZ. Mr. Speaker, I rise today to honor and welcome the  Ecumenical Patriarch of Constantinople, His All-Holiness Bartholomew,  to Washington, DC. The spiritual leader of the Orthodox Christian  Church, Ecumenical Patriarch Bartholomew comes to the United States to  accept the Templeton Prize, which recognizes an individual who has  ``made an exceptional…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695648/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Summer Lee", "party": "Democrat", "sentence": "…Speaker, I rise today to welcome His  All-Holiness Ecumenical Patriarch Bartholomew, Archbishop of  Constantinople-New Rome and spiritual leader of more than 300 million  Orthodox Christians worldwide, to Washington, D.C.\n\nThis week, His All-Holiness is visiting our Nation's Capital to  receive the Templeton Prize, the most prestigious international…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695564/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…Ecumenical Patriarch Bartholomew to Washington, D.C.\n\nAs the Ecumenical Patriarch of Constantinople, His All-Holiness  Bartholomew, is the spiritual leader of 300 million Orthodox Christians  worldwide, including thousands living in Western Pennsylvania. Since  his election as the 270th Archbishop of Constantinople-New Rome in  1991, His All-Holiness…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695410/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…STEVENS. Mr. Speaker, I rise today to express my gratitude  towards His All-Holiness Ecumenical Patriarch Bartholomew, the  Archbishop of Constantinople and spiritual leader of Orthodox  Christianity worldwide, for his time spent in our Nation's Capital last  week. On behalf of the strong Eastern Orthodox community I represent in  Michigan's 11th Congressional…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696019/appreciating-the-presence-and-contributions-of-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…October 1991 as the 270th Archbishop of the 2,000-year-old  Church founded by the Apostle Andrew, Ecumenical Patriarch Bartholomew  is the spiritual leader of 250 million Orthodox Christians worldwide.  He is also a leading figure in the dialogues among the Abrahamic  Faiths--Judaism, Christianity, and Islam--and his presence in our  Nation's capital…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695586/recognizing-the-spiritual-head-ecumenical-patriarch-bartholomew"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…Chalcedon. Finally, he was elected in October of 1991 as the 270th  Archbishop of the 2000-year-old Church founded by the Apostle Andrew.\n\nAs the spiritual leader to 300 million Orthodox Christians worldwide,  Ecumenical Patriarch Bartholomew is known as a transnational  figure who has focused on organizing international and interfaith peace  conferences,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695391/welcoming-the-ecumenical-patriarch-bartholomew-to-washington-dc"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…a proud Greek-American, I rise today to welcome His All-Holiness  Bartholomew I, Ecumenical Patriarch of Constantinople, to the United  States, the spiritual leader of the Orthodox Christian community around  the world. His All-Holiness's visit to Washington, D.C. and New York is  yet another demonstration of his commitment to peace, his see, and the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695407/welcoming-his-all-holiness-bartholomew-i-ecumenical-patriarch-of-constantinople"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…our Nation's Capital His All-Holiness Ecumenical Patriarch Bartholomew,  Archbishop of Constantinople-New Rome and Ecumenical Patriarch. He is  the Spiritual Head of the Orthodox Christian Church worldwide and  shepherd to over 300 million faithful. For Orthodox Christians across  the globe, including many of my own constituents in Northwest Ohio,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695409/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew-archbishop-of-constantinople-new-rome-and-ecumenical-patriarch"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…Congressional District, I congratulate His All Holiness  Bartholomew on receiving this great honor.\n\nHe is the spiritual leader, and the Primus inter Pares--First among  Equals--of Orthodox Christianity worldwide, a Church of 300 million  people. Named as one of the world's most influential people by Time  Magazine, His All Holiness is an exemplary leader who…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695852/recognizing-the-ecumenical-patriarch-of-constantinople"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "…and help--how we can, where we can--feels vital to the  moral health of the American people and the long-term viability of our  global environment.\n\nOn behalf of the Eastern Orthodox Christian community of Southwestern  Connecticut, I would like to extend my congratulations to His All- Holiness for his Templeton Prize; it is a well-deserved acknowledgement…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695502/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "Mrs. SHAHEEN. Mr. President, today I rise to join my constituents in  New Hampshire, including those at the St. Nicholas Greek Orthodox  Church of Manchester and the St. Nicholas Greek Orthodox Church of  Portsmouth, in welcoming His All-Holiness Ecumenical Patriarch  Bartholomew on the occasion of his visit…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695442/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…second largest Christian church  in the world who is visiting our Nation's Capital this week. Back home  in Colorado's 5th Congressional District, Archangel Michael Greek  Orthodox Church is the home for many of my constituents of the Greek  Orthodox faith. I welcome the Ecumenical Patriarch Bartholomew, wish  him well during his time in America, and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695657/welcoming-ecumenical-patriarch-bartholomew-to-america"}, {"senator": "Michael Rulli", "party": "Republican", "sentence": "…I rise today to welcome Ecumenical Patriarch  Bartholomew of Constantinople to Washington, D.C. A true beacon of  peace, Ecumenical Patriarch Bartholomew leads 250 million Orthodox  Christians.\n\nElected in October 1991, Ecumenical Patriarch Bartholomew has  continuously shown his desire for peace, even in the face of attacks  and persecution. He has…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695849/welcoming-ecumenical-patriarch-bartholomew-of-constantinople-to-washington-dc"}, {"senator": "Abraham Hamadeh", "party": "Republican", "sentence": "Mr. HAMADEH of Arizona. Mr. Speaker, I rise today to offer a warm  welcome to His All-Holiness Ecumenical Patriarch Bartholomew, the  spiritual leader of 300 million Orthodox Christians throughout the  world and the current Archbishop of Constantinople, serving in one of  the oldest sees in Christendom. This month, Patriarch Bartholomew will  visit…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695076/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew-to-the-united-states"}, {"senator": "Pat Ryan", "party": "Republican", "sentence": "…his lifetime of work curating harmony between  science and faith.\n\nEcumenical Patriarch Bartholomew not only serves as the spiritual  leader to the upwards of 300 million Orthodox Christians around the  globe, he serves as a model for us all, having dedicated his life to  peacemaking, environmental advocacy and conservation, and facilitating  inter-faith…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695565/welcoming-ecumenical-patriarch-bartholomew-to-washington-dc"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "Mr. PATRONIS. Mr. Speaker, I rise today on behalf of the Greek  Orthodox community in Florida and also across the United States to  extend a heartfelt welcome to his All-Holiness Ecumenical Patriarch  Bartholomew who will visit Washington, D.C.,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695267/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…welcome His All- Holiness Ecumenical Patriarch Bartholomew to Washington, D.C.--the  spiritual leader and Primus inter Pares (First among Equals) of more  than 300 million Orthodox Christians worldwide. For decades. he has  been a tireless voice for religious freedom, and as the longest serving  Archbishop of Constantinople in two millennia of Christian…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695856/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew-to-washington-dc"}, {"senator": "Kevin Hern", "party": "Republican", "sentence": "Mr. HERN of Oklahoma. Mr. Speaker, I rise today to congratulate Holy  Trinity Greek Orthodox Church on its centennial anniversary.\n\nEstablished in 1925, this parish has served Tulsa and the Greek  Orthodox Archdiocese of America for a century. The Church continues…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690557/holy-trinity-greek-orthodox-church-centennial-celebration"}, {"senator": "Barry Moore", "party": "Republican", "sentence": "…soon to be the recipient of  the Templeton Award, the world's foremost award in Religion and  Science.\n\nHis All-Holiness is the spiritual leader and Primus inter Pares of  Orthodox Christianity, providing leadership to a Church of 300 million  people. He has throughout his ministry been a foremost advocate of  religious freedom and has regularly traveled…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696715/recognizing-the-accomplishments-of-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Roger Marshall", "party": "Republican", "sentence": "…Bartholomew, the  Spiritual Head of the second-largest Christian Church in the world. His  All-Holiness serves as the current Archbishop of Constantinople and  leads over 300 million Orthodox Christians worldwide.\n\nHis All-Holiness is visiting Washington, DC, from September 15  through September 17 and will meet with President Trump at the White  House. This visit…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695589/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Darrell Issa", "party": "Republican", "sentence": "…extend a warm welcome to the  Ecumenical Patriarch of Constantinople, His All-Holiness Bartholomew,  the spiritual leader and ``First Among Equals'' of more than 300  million Orthodox Christians worldwide. During this historic visit to  the United States, His All-Holiness will receive the Templeton Prize-- the world's most prestigious award in Religion…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695541/welcoming-ecumenical-patriarch-of-constantinople-his-all-holiness-bartholomews-2025-visit-to-the-united-states"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…Mr. President, I rise today to welcome to America His  All-Holiness Ecumenical Patriarch Bartholomew, the spiritual leader of  the world's second-largest Christian Church--Orthodox Christianity-- which encompasses over 250 million faithful worldwide.\n\nWe in Louisiana take particular pride in welcoming His All-Holiness,  given that the very first Greek…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695653/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Jon Husted", "party": "Republican", "sentence": "…acceptance of the prestigious Templeton Prize, an award which has  been received by faith leaders including Mother Teresa, the Dalai Lama,  and Archbishop Desmond Tutu. The Greek Orthodox community in Ohio and  across the country take great pride in this recognition of their faith  leader's global influence.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695552/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…I rise today to recognize His All- Holiness Ecumenical Patriarch Bartholomew, who is the spiritual leader  and the ``primus inter pares''; ``first among equals'' of Greek  Orthodox Christianity worldwide, a church of over 300 million people.\n\nHis All-Holiness is visiting the United States to receive the  Templeton Prize, the world's most prestigious…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695074/raising-awareness-of-world-suicide-prevention-day"}, {"senator": "Chuck Fleischmann", "party": "Republican", "sentence": "Mr. FLEISCHMANN. Mr. Speaker, I rise today to extend a warm welcome  to His All-Holiness Bartholomew, the Ecumenical Patriarch of  Constantinople and spiritual leader of Orthodox Christianity.  Recognized as ``First Among Equals'' among Orthodox bishops, he is  visiting our Nation's Capital to receive the Templeton Prize--the  world's most prestigious…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694769/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…call from Rabbi Greenberg in Anchorage. He is a great  friend of mine, one of the leaders of our Jewish community throughout  the State. He asked Jay if he could host a young orthodox rabbi and his  wife for a short visit. Of course, Jay, a very generous man, agreed.  ``I think it would be around a two-week summer stay.'' Then they came  again for a second…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690106/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}]