[{"senator": "LaMonica McIver", "party": "Democrat", "sentence": "Mrs. McIVER. Mr. Speaker, I rise today to extend a warm welcome to  His All-Holiness Ecumenical Patriarch Bartholomew, an esteemed leader  of the Eastern Orthodox Church, upon his visit to the United States.\n\nFor more than three decades, Patriarch Bartholomew has stood as a  moral voice in times of global challenge. When Europe faced the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695736/recognizing-the-visit-of-ecumenical-patriarch-bartholomew"}, {"senator": "Nelida Pou", "party": "Democrat", "sentence": "…Patriarch Bartholomew to the United States. On behalf of the many  Eastern Orthodox Christians who call New Jersey home, including my  constituents at St. George Greek Orthodox Church in Clifton, I offer my  heartfelt congratulations and express deep admiration to His All- Holiness for his ongoing efforts to foster peace, understanding, and  stewardship…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695843/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…legislators. ``The Pentagon embodies might, but the Capitol embodies  right. In these halls, different points of view meet and are reconciled  . . . And--most important to the Orthodox Church during many dark  ages--in these halls human rights are preserved and human dignity is  enhanced.''\n\nEcumenical Patriarch Bartholomew is a leading figure in the dialogues…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695407/welcoming-his-all-holiness-bartholomew-i-ecumenical-patriarch-of-constantinople"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…went on to receive Norway's Sophie prize in 2002.\n\nMichigan's 13th Congressional District has a beautiful community of  Greek Orthodox constituents at St. George Greek Orthodox Church and  Annunciation Greek Orthodox Cathedral. They continuously work to create  welcoming spaces in our community by hosting celebrations such as  festivals, luncheons,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695458/welcoming-the-ecumenical-patriarch-bartholomew-of-constantinople-to-washington-dc"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "Ms. McCLELLAN. Mr. Speaker, I rise today to extend a warm welcome to  His All-Holiness Ecumenical Patriarch Bartholomew, the Spiritual Head  of the Eastern Orthodox Church, the second largest Christian Church in  the world. It is a distinct honor for our Nation's Capital to host such  a revered global religious leader whose life's work has…", "date": "2025-10-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696208/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Katherine Clark", "party": "Democrat", "sentence": "Ms. CLARK of Massachusetts. Mr. Speaker, I rise today to warmly  welcome the spiritual head of the Eastern Orthodox Church, His All- Holiness Ecumenical Patriarch Bartholomew, to Washington, D.C.\n\nThe longest-serving Archbishop of Constantinople in the history of  Christianity, the Ecumenical…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695285/welcoming-ecumenical-patriarch-bartholomew-to-washington-dc"}, {"senator": "Herb Conaway, Jr.", "party": "Democrat", "sentence": "…CONAWAY. Mr. Speaker, I rise today to welcome His All-Holiness  Ecumenical Patriarch Bartholomew to Washington, D.C.\n\nKnown as the ``Patriarch of Peace'' by the Eastern Orthodox Church,  he guides millions of faithful around the world in their spiritual  journey and relationship with God. He has long championed interfaith  dialogue, global peace, and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695506/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "…His All-Holiness distinguishes himself as a  global advocate for peace, reconciliation, and religious freedom.\n\nElected in 1991, Bartholomew leads efforts to unify the Orthodox  Church and other faiths across national and cultural boundaries. He  convenes councils, restores long-oppressed churches, and recognizes the  independence of emerging Orthodox…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695503/welcoming-ecumenical-patriarch-bartholomew-to-washington-dc"}, {"senator": "Summer Lee", "party": "Democrat", "sentence": "…same courage we need to meet our own fights for  justice at home.\n\nThe people of Pennsylvania's 12th District, including the faithful of  the Presentation of Christ Greek Orthodox Church in East Pittsburgh and  St. Nicholas Greek Orthodox Cathedral in Pittsburgh, are proud to share  in this welcome.\n\nI ask my colleagues to join me in celebrating the extraordinary…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695564/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "Mrs. SHAHEEN. Mr. President, today I rise to join my constituents in  New Hampshire, including those at the St. Nicholas Greek Orthodox  Church of Manchester and the St. Nicholas Greek Orthodox Church of  Portsmouth, in welcoming His All-Holiness Ecumenical Patriarch  Bartholomew on the occasion of his visit to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695442/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Joshua Gottheimer", "party": "Democrat", "sentence": "…Bartholomew, to  Washington, D.C. this week, and to congratulate him on receiving the  distinguished Templeton Prize.\n\nHis All-Holiness has been a steadfast leader for the Orthodox Church,  and especially for my constituents in New Jersey. He continues to  encourage us all to reach toward peace, to love and respect our  neighbors, and to uphold our values…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695803/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…see care for creation not just as  policy, but as a sacred duty.\n\nIn Riverside, we are blessed with a vibrant Orthodox Christian  community. Parishes such as Saint Andrew Orthodox Church remind us of  the enduring presence of Eastern Orthodox faith in Southern California.  These communities embody the values Patriarch Bartholomew champions-- reverence,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695408/recognizing-the-accomplishments-of-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Raphael Warnock", "party": "Democrat", "sentence": "Mr. WARNOCK. Mr. President, I welcome His All-Holiness Ecumenical  Patriarch Bartholomew of the Eastern Orthodox Church to the United  States of America. Since 1991, Ecumenical Patriarch Bartholomew has  served as the spiritual leader for 300 million Orthodox Christians  across the world.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695587/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Jacky Rosen", "party": "Democrat", "sentence": "…Christians,  convened the first Synaxis of Orthodox primates in 1992, supported the  restoration of autonomous churches in Eastern Europe, and granted  autocephaly to the Orthodox Church of Ukraine in 2019.\n\nThe Patriarch's role extends far beyond his ecclesial leadership.  Widely known as the ``Green Patriarch,'' he has pioneered the  integration of ecological…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694986/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…Teresa, the Dalai Lama, and Archbishop  Desmond Tutu.\n\nHis All-Holiness has been a pioneer in merging spirituality with  science as a force for change. As head of the Eastern Orthodox church,  he has gathered scientists, scholars, politicians with Catholic,  Jewish, and Muslim clerics. He also became the first Christian hierarch  to visit countries like Libya,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695851/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Roger Marshall", "party": "Republican", "sentence": "…called for the protection of religious minorities and has  championed the rights of Orthodox Christians to worship freely. His  efforts to promote dialogue between the Orthodox Church and other  Christian denominations have significantly strengthened interreligious  understanding.\n\nIn my home State of Kansas, we are honored to have a strong and  active…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695589/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…Christianity-- which encompasses over 250 million faithful worldwide.\n\nWe in Louisiana take particular pride in welcoming His All-Holiness,  given that the very first Greek Orthodox Church in America, Holy  Trinity Church, was established in 1864 by Greek merchants in New  Orleans. This historic church welcomed Orthodox Christians of various  nationalities…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695653/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Pat Ryan", "party": "Republican", "sentence": "…all the more through the countless people he has inspired.\n\nIt is a great honor to add my voice to the many, including the Greek  Orthodox Christians at St. George Greek Orthodox Church in Kingston,  St. Nicholas Greek Orthodox Church in Newburgh, Kimisis tis Theotokou  Greek Orthodox Church in Poughkeepsie, and across the Hudson Valley,  thanking him…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695565/welcoming-ecumenical-patriarch-bartholomew-to-washington-dc"}, {"senator": "Abraham Hamadeh", "party": "Republican", "sentence": "…protectors of the Earth.\n\nThere are thousands of Greek-Americans living in Arizona's 8th  Congressional District, including the hundreds of faithful at St.  Haralambos Greek Orthodox Church in Peoria. They, and Orthodox  Christians throughout our land, welcome this visit with joy. My  constituents are particularly proud of the fact that Patriarch  Bartholomew…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695076/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew-to-the-united-states"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "…us that,  ``The Pentagon embodies might, but the Capitol embodies right. In these  halls different points of view meet and are reconciled. . . And most  important to the Orthodox Church during many dark ages--in these halls  human rights are preserved and human dignity is enhanced.''\n\nThis week, His All-Holiness Ecumenical Patriarch Bartholomew will…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695424/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "Mr. BACON. Mr. Speaker, on behalf of my constituents at St. John the  Baptist Greek Orthodox Church in Omaha, I would like to welcome their  Spiritual Leader, the Ecumenical Patriarch of Constantinople, His All  Holiness Bartholomew, to the United States. He is visiting…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695924/welcoming-the-ecumenical-patriarch-of-constantinople-his-all-holiness-bartholomew"}, {"senator": "William Timmons", "party": "Republican", "sentence": "…bonds of community and enriching the  fabric of our state.\n\nOn behalf of my constituents in South Carolina's 4th District,  including the faithful at St. Nicholas Greek Orthodox Church in  Spartanburg, I extend a warm welcome to His All-Holiness Ecumenical  Patriarch Bartholomew. His presence in Washington is a reminder of the  enduring bonds of faith,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694924/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Kevin Hern", "party": "Republican", "sentence": "Mr. HERN of Oklahoma. Mr. Speaker, I rise today to congratulate Holy  Trinity Greek Orthodox Church on its centennial anniversary.\n\nEstablished in 1925, this parish has served Tulsa and the Greek  Orthodox Archdiocese of America for a century. The Church continues to…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690557/holy-trinity-greek-orthodox-church-centennial-celebration"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…second largest Christian church  in the world who is visiting our Nation's Capital this week. Back home  in Colorado's 5th Congressional District, Archangel Michael Greek  Orthodox Church is the home for many of my constituents of the Greek  Orthodox faith. I welcome the Ecumenical Patriarch Bartholomew, wish  him well during his time in America, and thank…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695657/welcoming-ecumenical-patriarch-bartholomew-to-america"}, {"senator": "Rick Scott", "party": "Republican", "sentence": "…Florida. Mr. President, I rise, on behalf of all  Floridians, to recognize the meaningful visit of Ecumenical Patriarch  of Constantinople, His All-Holiness Bartholomew of the Orthodox Church  to our Nation's Capital. Ecumenical Patriarch Bartholomew has been on  the forefront of religious freedom for his entire ministry, and now as  the longest serving Archbishop…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695570/welcoming-ecumenical-patriarch-bartholomew"}]