[{"senator": "Peter Welch", "party": "Democrat", "sentence": "…and life and death impacts that are reverberating in the United States  and around the world.\n\nHow does cutting off infectious disease surveillance and treatment  during outbreaks of Ebola, bird flu, and the deadly hemorrhagic Marburg  virus disease make Americans safer? It doesn't. How does abandoning our  allies and partners and ceding ground to…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688467/usaid"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…pulls the plug on lifesaving programs.\n\nJust 9 months in, he fired his own CDC director and has forced out  disease experts who protected us through a pandemic and disease  outbreaks.\n\nHe has perpetuated distrust in vaccines, while we see the highest  number of measles cases in more than three decades.\n\nHe has decimated gun violence prevention research…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695085/commending-myesha-cooper-and-robert-johnson-south-fulton-police-officers"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…because their conclusions contradict  preferred political narratives.\n\nWe have seen attacks on vaccines and changes to our public health  system that have caused needless outbreaks of disease. This President  has most assuredly not made America great again, but he has managed to  make measles great again. And when experts gently try to correct these…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700183/state-of-the-union-address"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…government money down the road. Every dollar we spend on global  health, on diplomacy, on humanitarian aid can save $10, $100, even  $1,000 later by preventing conflict, disease outbreaks, refugee crises,  and wars.\n\nThis bill eliminates those smart investments. It strips away those  tools. It tells the world at a time when it is desperate for American  leadership…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692385/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…me, that they even needed  to worry about this.\n\nThis bill requires the Department of Health and Human Services to  conduct research and education campaigns to prevent TB outbreaks caused  by contaminated human cell and tissue product donations.\n\nThrough the markup process, we have also included an important  provision to allow the Federal Government…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692765/shandra-eisenga-human-cell-and-tissue-product-safety-act"}, {"senator": "Andrea Salinas", "party": "Democrat", "sentence": "…was sent down to  Texas.\n\nWhen I asked about the tuberculosis outbreak in the Alaska detention  facility, ICE claimed the news reports got it wrong. I questioned if  similar outbreaks happened in the Tacoma facility, and, again, was told  flatout lies. The attorney I spoke to afterward told me, yes, there  were outbreaks in the Tacoma facility.\n\nWhen I…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697458/fighting-dhs-immigration-raids"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…opposition to the firings of scientists, medical researchers,  and more at the Department of Health and Human Services.\n\nHHS is in charge of everything from preventing disease outbreaks to  making sure that our kids are healthy to ensuring that seniors can live  with dignity.\n\nIt directly touches more lives than any other Cabinet Agency. That is  why the…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688282/department-of-health-and-human-services"}, {"senator": "Zoe Lofgren", "party": "Democrat", "sentence": "…at the CDC.       Almost all of the fellows in our program were terminated. LLS       fellows have been instrumental in the past by responding to       combat public health outbreaks like Ebola. Likewise, my       current fellows and I have helped protect the United States       from new and emerging infections within the past year. This       has directly…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688204/fired-by-president-trump"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…are devastating communities across this country; when  countries all around the world are banning together to do something and  he turned his back?\n\nDid you speak up when outbreaks of dangerous, infectious diseases are  still  a global threat, yet we have stopped engaging in the efforts necessary  to meet those threats?\n\nWhere were you when the American…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…50-country network for stronger surveillance to deadly       diseases from bird flu to swine fever [is] gone.\n\nOur emergency response system that cut response times to       global outbreaks from greater than two weeks to less than 48       hours [is] gone.\n\nAIDS programs to prevent new cases of HIV in high-risk       populations [is] gone\n\nPrograms for preventing…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691139/us-global-health-programs"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…but I don't think it  takes an expert to understand listeria will not go away just because  States don't track it. It will not go away because nobody is looking.  Shigella outbreaks will not go away if you ignore them.\n\nFoodborne diseases sicken people. They actually kill people. This  isn't about following the science. That is as plain as day. You don't…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694964/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…mission is. He is doing the administration's bidding to  eliminate funding that goes toward finding cures for cancer,  Alzheimer's, and rare diseases; and in the midst of outbreaks of  measles--a disease that researchers had virtually eliminated--he has  pressed forward with firing thousands of vital workers in our health  Agencies. This is not efficient,…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690300/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…entire effort is threatened by the  administration's plan to defund key GPEI partners.\n\nJust at the time when this disease is closer than ever to being  eradicated, the risk of outbreaks is greatly increased. We must do all  in our power to protect the gains already made, and finish the job,  including appropriating the funds required.\n\nPeople from my generation…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699265/recognizing-the-scarsdale-forum"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…industries       in the United States;\n\n(V) consumer confidence in sheep and goat meat;\n\n(VI) the health of sheep and goat herds in the United       States; and\n\n(VII) disease outbreaks across species of animals;\n\n(vi) the estimated amount of direct payments made by       foreign countries to producers of live sheep and goats in       such countries as a…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697537/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…time for Congress to pass a fiscally conservative 5-year  farm bill, including support for agricultural research and development.  We have seen the devastating impact disease outbreaks can have with the  HPAI virus, and now we must continue to take steps to prevent the New  World screwworm from reaching our borders.\n\nThe Big First District is home to crown…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693761/getting-animal-health-research-right-in-farm-bill"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…openings creating  infections that, left untreated, can cause animals to die within 1  week. We do not have vaccinations, unfortunately, to prevent screwworm  infections. So outbreaks in cattle herds require labor-intensive daily  inspections of livestock to make sure they have not been infested.\n\nNow, some may be wondering: That sounds pretty horrific,…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699770/9999"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…2023, from tuberculosis, or TB.\n\nThis bipartisan bill requires the Department of Health and Human  Services to conduct public awareness campaigns to assist in preventing  TB outbreaks caused by contaminated human cell and tissue product  donations.\n\nShandra's death was a preventable tragedy, and we will honor her  memory by strengthening guidelines and…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692767/shandra-eisenga-human-cell-and-tissue-product-safety-act"}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "…Tech to expedite measles testing in West Texas.\n\nAnd he engaged the broader public as well. The CDC       accelerated its public reporting of measles cases and       outbreaks so that anyone who visited the CDC's website could       see hot spots of infection. It also posted a ``Be Ready for       Measles toolkit, which provided outbreak response…", "date": "2025-10-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696063/texas-measles-outbreak"}]