[{"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…force them to choose between  feeding their families or paying their rent. They are waging a war of  attrition on the working people and those who are most in need.\n\nAs if this outcome wasn't bad enough, what may be worse is the reason  that they are doing all of this: To pay for huge tax breaks for the  wealthiest Americans.\n\nIn an attempt to cover the…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691770/151-days-without-a-vote-to-lower-costs"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…two bad choices. Different Senators  will come down on different sides of the question, but that does not  mean that any Senate Democrat supports a shutdown.\n\nWhatever the outcome, our caucus will be united in our determination  to continue the long-term fight to stop Donald Trump's dangerous war on  our democracy and on America's working families.…", "date": "2025-03-14", "source_url": "https://justfacts.votesmart.org/public-statement/1688900/full-year-continuing-appropriations-and-extensions-act-2025"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…our government from overreach and to  safeguard our public rights. Instead of respecting that, Republicans  are attacking judicial independence because they don't like the outcome  when the courts rule against them.\n\nEarlier today, Republicans in debate acknowledged that President  Trump has been overruled by judges more than the last three Presidents…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689780/role-of-the-judiciary"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…be accepted,       however, Congress could easily address it by replacing the       current law mandating that the Capital area's electors vote       in accordance with the outcome of the popular vote in the       District with a new legislative mandate that the Capital       area's electors vote in other ways. For example, Congress       could require…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695559/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…Ukraine's       . . . 2014 borders is an unrealistic objective.\n\nHe further stated:\n\n[T]he United States does not believe that NATO membership       for Ukraine is a realistic outcome of a negotiated       settlement.\n\nIn essence, Secretary Hegseth conceded away our most important  leverage against Russia. His statements, echoed by President Trump and…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688332/ukraine"}, {"senator": "Rick Larsen", "party": "Democrat", "sentence": "…creating effective  legislation that will upgrade our infrastructure, that will build our  economy and create jobs, all while protecting our waters.\n\nMr. Chair, unfortunately, the outcome of this bill, if enacted, will  be increasing pollution and contamination of our waters. I oppose this  bill, and I urge my colleagues to do the same.", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698022/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…couple of people asked me earlier how I felt about what is going on  in this lovers' quarrel. I am, like, you know what? You get mixed up  with messy people, you get a messy outcome. It is very clear that that  is exactly what is going on.\n\nI think we have all been hearing the rumors here in Washington, the  breakup rumors. In fact, I think many of us,…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692039/consequences-of-doge"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "…and one thing only. It is not about the  horrors of drug abuse.\n\nWe know that over here. There is not a Democrat who doesn't believe  that 100,000 overdoses is an appalling outcome. There is not a Democrat  here who doesn't experience the crushing, disgusting horror of those  losses. We couldn't agree with the majority more that this is a huge  problem.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698242/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…United States.\n\nWe have to go back to where America began, and that is: We have  elections; we do all we can to encourage people to vote; we count the  votes; and we accept the outcome as decided by the people of this  country.\n\nThat is what a democracy has to be about, where the competition is  about ideas. It is about aspirational connection to the wonderful…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698518/anniversary-of-january-6"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…be accepted,       however, Congress could easily address it by replacing the       current law mandating that the Capital area's electors vote       in accordance with the outcome of the popular vote in the       District with a new legislative mandate that the Capital       area's electors vote in other ways. For example, Congress       could require…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695641/district-of-columbia-policing-protection-act"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…hidden, and that is what this bill does.\n\nWe have asked the Congressional Budget Office what it means. How big  will the cuts be? When will they take place?\n\nWell, here is the outcome: Given the magnitude of this massive  increase, it will create a $45 billion cut to Medicare in 2026--next  year. Next year, $45 billion cut to Medicare.\n\nUnfortunately, it…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695699/authorizing-the-en-bloc-consideration-in-executive-session-of-certain-nominations-on-the-executive-calendar"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…seize paper ballots from the 2020 election--ballots that have  already been counted at least three times in three different ways and  that have all reached the same election outcome.\n\nThe fact of the matter is that audit after audit and investigation  after investigation in red States and in blue States have all reached  the same conclusion, which is…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700066/9999"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…with the apparent abdication of the U.S. President,  Vice President, and Secretary of State, Ukraine has everything to lose  and Russia everything to gain. Who would want that outcome? What kind  of mindset would want that?\n\nThe White House isn't leading a legitimate peace process. It is  enabling the globally aggressive reach of the most lethal dictatorship…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690215/supporting-ukraines-independence"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…in  manufacturing. That does not make America great again.\n\nPlease, please, Trump administration, pay attention to the details. I  don't think the President would want this outcome. I think there must  have been a blip somewhere in the bureaucracy.\n\nRepresentative Glenn Ivey is a distinguished judge, as well as a very  great intellect, and I am very…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695604/devastating-harm-caused-by-trump-administration"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…determinations based on the specific circumstances of each case. Aliens  determined to require detention are transferred to an ICE detention  facility pending removal or the outcome of their removal proceedings.  Due to our high operations tempo, we are not facilitating any visits to  ICE field offices or suboffices at this time.''\n\nMr. Speaker, is that…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692932/holding-power-accountable"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…but she doesn't have enough in  her account to cover both. If she is not able to access overdraft  protection or other far riskier means of short-term liquidity, imagine  the outcome.\n\nThis rulemaking doesn't help people in these positions as it pretends  to. It jeopardizes their survival.\n\nWhen governments act as though they know better than the consumers…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689840/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "James Risch", "party": "Republican", "sentence": "…a lot of people were upset when they saw the exchange this  weekend, understandably. But, look, what you are looking at is the tip  of the iceberg. Everybody wants the same outcome and that is to have  peace in Ukraine.\n\nThere is one man on this planet--one man--that can make that happen,  and that is Donald J. Trump. He promised he would do that in…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688569/9999"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…transgender athlete claimed the Class 2A girls' State  title in the 400-meter dash for the second year in a row. Every person  in this country deserves dignity and respect, but this outcome is  unfair and deeply troubling.\n\nKeeping women's sports female is common sense and an issue that  unites the vast majority of Americans. Transgender males should not be…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692397/recognizing-lauren-matthew-of-west-valley-high-school-state-champion"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…immigration, but the right  way.\n\nAll in all, this package, combined with economic growth unleashed by  the America First agenda, can ensure it will provide a deficit-neutral  outcome, including seven times the amount of cuts that were initially  unveiled. For every dollar that Republicans surpass the goal of  spending cuts, there will be another dollar…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688091/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions-and-providing-for-consideration-of-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…that a Federal infrastructure promise  will be kept.\n\nI ran for Congress to fight for my district, even when it is  difficult, even when it is uncomfortable, and even when the outcome is  uncertain. This is one of those moments.\n\nMr. Speaker, some of my colleagues may be feeling pressure today to  accept the veto. I get it. However, I would ask every Member…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698701/finish-the-arkansas-valley-conduit-act-veto-message-from-the-president-of-the-united-states"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…border has diluted the voting power that is reserved for only American  citizens. This crisis is not only a national security concern but one  that can seriously alter the outcome of our elections.\n\nJust this past election cycle, both the States of Alabama and  Virginia removed thousands of registered voters who were not American  citizens. Securing…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690005/safeguard-american-voter-eligibility-act"}, {"senator": "Keith Self", "party": "Republican", "sentence": "…SELF. Mr. Speaker, America and our European Union allies find  ourselves at an inflection point. We have an amazing opportunity, and  the actions we take today will shape the outcome for generations to  come.\n\nThe world is significantly more dangerous because of the Biden  administration projecting American weakness to the world. Under the  previous administration,…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689088/america-must-not-be-idle-while-adversaries-advance-capabilities"}, {"senator": "Jake Ellzey", "party": "Republican", "sentence": "…and nieces.\n\nHis personal relationship with Jesus Christ took him through his last  difficult journey with the strength and confidence that he could trust  his Lord with the outcome of his life. We will miss him dearly but look  forward to the day we will be reunited in Heaven.\n\nBruce will be remembered for his great sense of humor and his  generous heart.…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691519/truth-telling-with-math-and-facts"}, {"senator": "Darrell Issa", "party": "Republican", "sentence": "…plaintiffs before the court but across  the entire country, including individuals and entities that are not  even parties to the litigation and, in many cases, may not favor the  outcome and would not have been willing plaintiffs.\n\nThis undermines the system of government. It empowers individual,  unelected judges to dictate national policy and to thwart the…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689711/no-rogue-rulings-act-of-2025"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…(ii) by striking ``technologies'' and inserting ``and       integrated modeling technologies''; and\n\n(iii) by striking ``technology used'' and inserting       ``application, outcome, and data resources used''; and\n\n(C) in paragraph (2), by striking ``or sub-basin''; and\n\n(5) in subsection (g), by striking ``$15,000,000, in the       aggregate, for fiscal…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697627/snow-water-supply-forecasting-reauthorization-act-of-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…and healthcare       facilities. It also slows innovation in technologies       explicitly designed to de-escalate encounters and reduce the       need for deadly force, an outcome directly at odds with       public safety goals nationwide.\n\nH.R. 2189 corrects this problem by establishing a       modernized definition of a ``less-than-lethal projectile…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700037/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…Appropriations, Agriculture, Legislative Branch, Military Construction  and Veterans Affairs, and Extensions Act, 2026.\n\nHistory reminds us, Mr. Speaker, that shutdowns never change the  outcome. The only cost is paid by the American people.\n\nOver the last 43 days, the facts did not shift, the votes required  did not shift, and the path forward did not change. The…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696725/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…zero tax.\n\nThe Department's recent filing ignores this reality and instead  offers a theory that would convert the NFA from a tax statute into a  freestanding gun registry, an outcome Congress has never authorized and  has repeatedly rejected. Even the 1986 Firearm Owners' Protection Act  prohibited a Federal registration scheme: `` . . . nor that any system…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697383/restoring-second-amendment-rights"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…statutory definition of an  endangered species.\n\nInstead of being based on science, this listing comes from the common  radical environmental playbook of suing for a predetermined outcome.\n\nRadical groups have litigated for years trying to get the longfin  smelt listed under the ESA, with a 2024 lawsuit compelling the U.S.  Fish and Wildlife Service to make…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690599/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt"}, {"senator": "Pat Ryan", "party": "Republican", "sentence": "…United States House of Representatives in this Chamber, to forge the  path forward.\n\nUnlike some of my colleagues on the other side of the aisle, I won't  try to deny the outcome of the election in November 2024.\n\nToo many Americans felt Democrats had become the party of the elites  and had stopped meeting people where they are, not understanding the…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689084/economic-populism"}]