[{"senator": "Jack Reed", "party": "Democrat", "sentence": "…am wrong about these dangers ahead. I hope this  administration is right, and the transition in Venezuela proceeds  smoothly. I hope that the Venezuelan people embrace this outcome and  see their lives improve quickly. I hope the violent factions in  Venezuela choose peace over conflict. I hope the economic recovery for  the people of Venezuela justifies…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698780/venezuela"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…right to receive notice of potential agency action and to       submit information to the agency to inform the agency's       determination and potentially affect the outcome of the       proceeding. Therefore, the rules establishing or       rescinding those procedures substantially affected the       rights or obligations of the non-agency parties.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694840/government-accountability-office-legal-opinion"}, {"senator": "Rick Larsen", "party": "Democrat", "sentence": "…creating effective  legislation that will upgrade our infrastructure, that will build our  economy and create jobs, all while protecting our waters.\n\nMr. Chair, unfortunately, the outcome of this bill, if enacted, will  be increasing pollution and contamination of our waters. I oppose this  bill, and I urge my colleagues to do the same.", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698022/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…be accepted,       however, Congress could easily address it by replacing the       current law mandating that the Capital area's electors vote       in accordance with the outcome of the popular vote in the       District with a new legislative mandate that the Capital       area's electors vote in other ways. For example, Congress       could require…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695559/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…these videos and  outraged, angry, but also saddened and grief-stricken because the  killing of Renee Nicole Good last week at the hands of an ICE agent  showed the tragic outcome of abuse of power. This death was preventable  and predictable. It was preventable. It needn't have happened.\n\nBut it was also predictable because it is only an example of…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699087/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…two bad choices. Different Senators  will come down on different sides of the question, but that does not  mean that any Senate Democrat supports a shutdown.\n\nWhatever the outcome, our caucus will be united in our determination  to continue the long-term fight to stop Donald Trump's dangerous war on  our democracy and on America's working families.…", "date": "2025-03-14", "source_url": "https://justfacts.votesmart.org/public-statement/1688900/full-year-continuing-appropriations-and-extensions-act-2025"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…Medicaid.\n\nHe is exactly right. What is contemplated in this one big, ugly bill  is wrong. It is dangerous, and it is cruel. Cruelty should not be  either the objective or the outcome of legislation that we consider  here in the United States House of Representatives.\n\nMr. Speaker, cruelty should never be the objective or the outcome of  legislation that…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…do directly.\n\nThis Congress ought to recognize that the Constitution clearly had in  mind that you cannot do this, directly or indirectly, when the  expressed intent of the outcome of the adoption of this amendment is to  cut the salaries of judges with whom they disagree.\n\nThat would not be a nation of laws. It would be a nation of men.  That, we should…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699056/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…seize paper ballots from the 2020 election--ballots that have  already been counted at least three times in three different ways and  that have all reached the same election outcome.\n\nThe fact of the matter is that audit after audit and investigation  after investigation in red States and in blue States have all reached  the same conclusion, which is…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700066/9999"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…is being undermined, as I speak.\n\nNow, today's news that the stock market took a major nosedive across  the board is serious. The Dow is down 900 points, the worst market  outcome of this year. But it isn't just this year. If you look back,  the plummet that happened today is not pretty. Perhaps the President  thinks that putting a pause on tariffs…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688734/americans-are-in-for-a-rough-ride"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…be accepted,       however, Congress could easily address it by replacing the       current law mandating that the Capital area's electors vote       in accordance with the outcome of the popular vote in the       District with a new legislative mandate that the Capital       area's electors vote in other ways. For example, Congress       could require…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696933/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…deciding  important Federal cases. How does it work? You claim to be neutral,  but, in fact, you contort history and overturn precedents to reach the  Republicans' preferred outcome.\n\nMs. Hermandorfer followed this playbook to a tee in the Tennessee  Attorney General's Office. She opposed LGBTQ rights and reproductive  rights as well as environmental…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693415/nomination-of-whitney-d-hermandorfer"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…coverage, and deliberately allow the Affordable Care Act  tax credits to expire, knowing full well that millions of families will  lose affordable coverage as a result.\n\nThat outcome is not a side effect. It is the point. For more than a  decade,  Republicans have promised a better healthcare system, a replacement for  the ACA, something, anything that…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698312/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…Approximately 45 percent of full-time Black students graduate from  public four-year colleges and universities within six years, with  finances playing a large role in this outcome. Stripping first- generation, low-income, or minority students of the few financial and  academic resources the government provides reduces college  affordability and, once…", "date": "2025-04-21", "source_url": "https://justfacts.votesmart.org/public-statement/1690128/alarm-at-the-trump-administrations-dangerous-attack-on-education"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…in  manufacturing. That does not make America great again.\n\nPlease, please, Trump administration, pay attention to the details. I  don't think the President would want this outcome. I think there must  have been a blip somewhere in the bureaucracy.\n\nRepresentative Glenn Ivey is a distinguished judge, as well as a very  great intellect, and I am very…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695604/devastating-harm-caused-by-trump-administration"}, {"senator": "Mike Crapo", "party": "Republican", "sentence": "…to implement the tax,  including on complex issues like how it should apply to partnerships.  The notice is within the Treasury's authority, but the Democrats  dislike the outcome.\n\nApproving this resolution would revive ambiguity, inviting audits,  litigation, and significant compliance costs. Therefore, I register my  objection when the unanimous…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699912/9999"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…for 8 hours on that side of the building. I will tell you, for the 8  hours--could we have order?\n\nMr. Speaker, the 8 hours of hogwash that we just heard will not  change the outcome that you will see very shortly when we deliver  historic tax relief for working families, small business owners, and  farmers.", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693189/one-big-beautiful-bill-act"}, {"senator": "Laurel Lee", "party": "Republican", "sentence": "…Court interpreted existing statutory language in a  way that limited accountability, even though a child's image was used  in sexually exploitative conduct.\n\nMr. Speaker, that outcome underscores an important reality. A child  is harmed whenever their image is intentionally placed into a  sexualized setting. The absence of physical contact or active  participation…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698894/child-predators-accountability-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…the problem.''\n\n``The definition of insanity,'' said Democrat Assembly Member Cottie  Petrie-Norris, ``is doing the same thing over and over again and  expecting a different outcome.''\n\nThe truly amazing thing is the legislative analyst testified that  this update that the rail authority provided, even this incomplete  update, assumes there will still…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689211/protecting-medicaid-for-californians"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…that a Federal infrastructure promise  will be kept.\n\nI ran for Congress to fight for my district, even when it is  difficult, even when it is uncomfortable, and even when the outcome is  uncertain. This is one of those moments.\n\nMr. Speaker, some of my colleagues may be feeling pressure today to  accept the veto. I get it. However, I would ask every Member…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698701/finish-the-arkansas-valley-conduit-act-veto-message-from-the-president-of-the-united-states"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…immigration, but the right  way.\n\nAll in all, this package, combined with economic growth unleashed by  the America First agenda, can ensure it will provide a deficit-neutral  outcome, including seven times the amount of cuts that were initially  unveiled. For every dollar that Republicans surpass the goal of  spending cuts, there will be another dollar…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688091/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions-and-providing-for-consideration-of-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "John Thune", "party": "Republican", "sentence": "…incapable of deciding on the  merits. They reflexively oppose anything he does or says, even when it  contradicts or is in tension with their own prior opinions.\n\nWhatever the outcome of this process, I trust that the Trump  administration will continue to work to combat the terrible scourge of  illegal drugs and to keep our Nation and our communities safe.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699100/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "James Risch", "party": "Republican", "sentence": "…a lot of people were upset when they saw the exchange this  weekend, understandably. But, look, what you are looking at is the tip  of the iceberg. Everybody wants the same outcome and that is to have  peace in Ukraine.\n\nThere is one man on this planet--one man--that can make that happen,  and that is Donald J. Trump. He promised he would do that in…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688569/9999"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…and healthcare       facilities. It also slows innovation in technologies       explicitly designed to de-escalate encounters and reduce the       need for deadly force, an outcome directly at odds with       public safety goals nationwide.\n\nH.R. 2189 corrects this problem by establishing a       modernized definition of a ``less-than-lethal projectile…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700037/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…(ii) by striking ``technologies'' and inserting ``and       integrated modeling technologies''; and\n\n(iii) by striking ``technology used'' and inserting       ``application, outcome, and data resources used''; and\n\n(C) in paragraph (2), by striking ``or sub-basin''; and\n\n(5) in subsection (g), by striking ``$15,000,000, in the       aggregate, for fiscal…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697627/snow-water-supply-forecasting-reauthorization-act-of-2025"}, {"senator": "Elise Stefanik", "party": "Republican", "sentence": "…of the Small Business  Development Center and the Zone 9 Police Training Academy. Clinton  Community College and its leadership have always worked towards  building the best outcome for their students. As hard times arose, the  College made the difficult decision to revamp and relocate its campus  to a shared space with the State University of New York…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691529/recognizing-clinton-community-college-day"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…Appropriations, Agriculture, Legislative Branch, Military Construction  and Veterans Affairs, and Extensions Act, 2026.\n\nHistory reminds us, Mr. Speaker, that shutdowns never change the  outcome. The only cost is paid by the American people.\n\nOver the last 43 days, the facts did not shift, the votes required  did not shift, and the path forward did not change. The…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696725/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…zero tax.\n\nThe Department's recent filing ignores this reality and instead  offers a theory that would convert the NFA from a tax statute into a  freestanding gun registry, an outcome Congress has never authorized and  has repeatedly rejected. Even the 1986 Firearm Owners' Protection Act  prohibited a Federal registration scheme: `` . . . nor that any system…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697383/restoring-second-amendment-rights"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…dolphin or other marine mammal in the course       of fishing.''.       SEC. 9. ENFORCEMENT.\n\n(a) Notice Requirements to Pacific Island Party Concerning       Institution and Outcome of Legal Proceedings.--Section       10(c)(1) (16 U.S.C. 973h(c)(1)) is amended--\n\n(1) by striking ``paragraph 8 of Article 4 of''; and\n\n(2) by striking ``Article 10 of''.…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691006/south-pacific-tuna-treaty-act-of-2025"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…Instead of working for peace,  Putin recently threatened to use nuclear weapons in Ukraine in order to  bring the war, in his own words, ``to a logical conclusion with the  outcome [that] Russia requires.''\n\nHow does this relate to President Trump's peace efforts? Well, we  should listen to Putin's own words. In a speech he delivered to the  Russian…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690955/ukraine"}]