[{"senator": "Susie Lee", "party": "Democrat", "sentence": "…our time. He is also known for being the first person to ever free solo  El Capitan in Yosemite.\n\nI am proud to say that Alex and I have worked together to promote  outdoor recreation with my PARC Act, which helps protect climbers on  our beautiful public lands. Alex also founded the Honnold Foundation,  which partners with marginalized communities…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699610/recognizing-alex-honnold"}, {"senator": "Susie Lee", "party": "Democrat", "sentence": "…award-winning community is home to  over 70 diverse neighborhoods with convenient access to strong schools,  shopping centers, and other amenities. Not only does its outdoor  recreation set it apart, but Mountain's Edge offers its residents a  strong sense of community.\n\nI would like to extend my congratulations to the Mountain's Edge  Master Association,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691310/recognizing-the-20th-anniversary-of-mountains-edge-community-in-clark-county-nevada"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…Waters.\n\nAllowing copper mining to proceed by overturning the       mineral withdrawal puts at risk not only the environment but       also the regional economy. The outdoor recreation economy in       northeastern Minnesota supports over 17,000 jobs and       contributes more than $1 billion in annual sales. Studies       consistently show that protecting…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699274/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…jobs, and supported  more than $80 billion in wages alone. And this is part of a larger  pattern. The Bureau of Economic Analysis calculated that the economic  output of outdoor recreation in 2023 was over $1 trillion.\n\nIf the administration builds roads in these places, we not only lose  these experiences, but our economies lose their customers. It is…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695667/cloture-motion"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…Boundary Waters is the  most visited wilderness area in the country. There is literally no  other place like it on Earth. It is a major driver of the nearly $13.5  billion outdoor recreation economy in Minnesota.\n\nAll that is at risk if sulfide-ore copper mining is allowed in the  watershed of the Boundary Waters. It is known as the most toxic  industry in…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691611/boundary-waters-canoe-area-wilderness"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…staying on Main Street. They are  not getting the rewards for the work which they have done.\n\nA small business in Massachusetts that designs and manufactures and  sells outdoor recreation equipment told me that they have paid an extra  $500,000 this year because of Trump's tariff taxes. Earlier this week,  they received a $40,000 bill from imports from…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696444/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…of  Colorado, boasting a slower lifestyle ``up the hill'' away from the  City of Denver. Evergreen's charm can be seen in the community's  appreciation for the arts, outdoor recreation opportunities, and small  community feel, along with the work of the more than 70 nonprofit  organizations that embody the town's attitude of ``taking care of  ourselves…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692111/recognizing-evergreen-colorado"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…H.R. 183 would amend the Federal  Lands Recreation Enhancement Act to provide free America the Beautiful  passes to law enforcement officers and firefighters.\n\nExpanding outdoor recreation and ensuring Americans can access and  enjoy our public lands is a shared bipartisan priority on the Natural  Resources Committee. Currently, the National Park Service…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693929/law-enforcement-officer-and-firefighter-recreation-pass-act"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…Northern Virginia.\n\nMr. Gilbert's many contributions to public service have been  recognized throughout his career, including receiving the Outstanding  Contribution to Outdoor Recreation award from the Virginia Department  of Conservation & Recreation and the Land Manager of the Year award  from the Mid-Atlantic Mountain Bike Enthusiasts. Along with his…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697129/recognizing-nova-parks-executive-director-paul-gilbert-on-the-occasion-of-his-retirement"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…Tribal, and local governments lacking.\n\nI want to express gratitude to U.S. Forest Service staff because they  are also keeping our cherished public lands accessible for outdoor  recreation.\n\nMr. Speaker, I don't know if you have ever been to Washington State.  If you have, you will know that outdoor recreation is our pride and joy  and is what sustains…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689811/cuts-to-forest-service-endanger-millions"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…spirit that  defines rural New Mexico. Communities like Silver City, Cloudcroft,  Quemado, and many others throughout New Mexico continue to lead in  forest conservation, outdoor recreation, wildfire resilience, and  natural resource management. They deserve a Federal partner that  matches their commitment, and today, they are getting that.\n\nMr. Speaker,…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697655/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…should be off-limits from  this kind of mining, and the Boundary Waters Canoe Area Wilderness is  clearly one of those places.\n\nMr. Speaker, remember too that 22,000 outdoor recreation jobs and the  $13.5 billion outdoor recreation economy in Minnesota will all be in  serious jeopardy if this resolution passes. The Boundary Waters is a  national treasure,…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699272/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…Whiting, an early settler and the town's first  representative to the Maine Legislature.\n\nToday, Whiting is a nature lover's paradise of gorgeous scenery and  year-round outdoor recreation. The beautifully maintained Union Meeting  House, built nearly two centuries ago, is a wonderful example of  traditional New England church architecture and a worthy…", "date": "2025-07-08", "source_url": "https://justfacts.votesmart.org/public-statement/1693257/town-of-whiting-200th-anniversary"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Connecticut, and New Jersey combined.\n\nRMPs are meant to be collaborative approaches to land management that  balance multiple uses, including energy and mineral production, outdoor  recreation, grazing, and timber harvesting. When done correctly, RMPs  help guide public land management in a way that provides fuel, food,  and fiber for the Nation and conserves…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694888/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "French Hill", "party": "Republican", "sentence": "…the county where it is located: Governor Sarah Sanders,  Arkansas Parks & Tourism, the leadership of our Game and Fish  Commission, and many other local  leaders and outdoor recreation groups in our State.\n\nRest assured also, Mr. Speaker, the current forest management plan  for Flatside already includes prescribed burns, fire suppression  techniques,…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691095/flatside-wilderness-additions-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…only the most able-bodied and  wealthy will be able to have access to areas of Glen Canyon that used  to be open and accessible to everyone. Utah boasts $9.5 billion of  outdoor recreation economy driven largely by motorized recreation. By  shutting down some of the State's most popular motorized recreation  trails, the National Park Service is shutting…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690405/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…promotes the use of public lands for recreation,  health, and family time, particularly among those who may face long  hours, stressful shifts, and dangerous conditions. Outdoor recreation  is good for both mental and physical well-being, and this bill ensures  that our first responders can take full advantage of America's natural  beauty.\n\nI commend Representative…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693931/law-enforcement-officer-and-firefighter-recreation-pass-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Arkansas and Oklahoma.\n\nManaged by the U.S. Forest Service, it is a true multiple-use forest,  supporting timber harvesting, wildlife conservation, and a wide range  of outdoor recreation opportunities, such as hiking, hunting, camping,  and fishing.\n\nArkansans take great pride in this forest, which draws more than  670,000 visitors each year. Currently,…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691096/flatside-wilderness-additions-act"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…Works Park into a  welcoming community space, helping to lead the development of the  Lauridsen Amphitheater and creating new opportunities for Iowans to  gather, enjoy outdoor recreation, and build stronger community ties.\n\nI have had the opportunity to work with Ted on matters of regional  infrastructure and public health. His professionalism, clarity,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694988/recognizing-the-retirement-of-ted-corrigan-after-35-years-of-public-service"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…advanced the mission of Okefenokee Swamp  Park, promoting a community connection with nature and preserving its  ecological health through stewardship, education, and outdoor  recreation.\n\nWhile serving as chairman, Dr. Clark was instrumental in expanding  the park's mission to promote tourism and education. Under his  leadership, the park strengthened…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690751/recognizing-dr-william-clark"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…legislation.\n\nThis bill would reduce the financial burden on our military families  who want to visit our national parks and expand their access to the  healing powers of outdoor recreation.\n\nMr. Speaker, I urge adoption of this legislation, and I yield back  the balance of my time.", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691053/benefits-that-endure-for-lifetimes-of-service-act"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…Mountains. The town of Rico was established in 1880.\n\nOriginally a mining community, the area has become known throughout  Colorado for its gorgeous scenery, its incredible outdoor recreation,  and its unique tourist attractions.\n\nThis year's award honors Rico for excellence in both leadership and  economic development. The town earned this distinction through…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697140/recognizing-2025-small-community-of-the-year-rico-colorado"}]