[{"senator": "George Latimer", "party": "Democrat", "sentence": "…increase from 2025.\n\nNext year, the annual standard Medicare part B premium will be over  $2,400. Seniors and disabled enrollees rely on Medicare part B to cover  costs for outpatient hospital care, ambulance services, preventative  screenings, medical equipment, certain prescription drugs, and more.\n\nIf that is not enough, since Medicare premiums are…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697122/americans-access-to-healthcare-under-attack"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…therapy and  occupational therapy so she could be in her own home.\n\nLater, she had a life-threatening event and was hospitalized.  Eventually, she was well enough to move to an outpatient rehabilitation  facility, followed by in-home care. Again, Medicaid was there for her.  The care was safe, reliable, and appropriate, and it gave tremendous  relief to her…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691419/gop-tax-scam-hurts-everyone"}, {"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "…outreach and vaccinations were  available during the pandemic; securing multiple sources of public  funding for a Center for Recovery and Wellness, a substance use  disorder outpatient center that  opened in October 2024; and numerous additional legislative  accomplishments.\n\nIn addition to some of the civic engagements already mentioned,  Gerard has served…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688302/recognizing-mr-gerard-j-grimaldi-on-his-retirement-and-expressing-appreciation-for-a-lifetime-of-dedicated-service-to-our-community"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…for the Denver community.\n\nIt will eliminate funding to Temple University Hospital in  Philadelphia to purchase modern, diagnostic X-ray technology equipment  to strengthen outpatient care.\n\nThe list goes on and on and on.\n\nIt would also eliminate funding for K-12 education programs, higher  education programs, and job training programs.\n\nMr. Chair, I…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699285/amendment-no-1-offered-by-mr-massie"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…says to us: ``My youngest child is a nonverbal 43-year-old  female with autism who has been on Medicaid since she was 12. She has  had three major surgeries and six or more outpatient surgeries, all  made possible because of Medicaid. We would not have been able to get  our daughter what she needed if it wasn't for Medicaid.\n\n``She also has a seizure disorder…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…safe harbor       limit. Connecticut, for example, taxes hospitals at the       maximum       6 percent for inpatient revenues, but received a federal       waiver to tax outpatient revenues at slightly over 10       percent, said Paul Kidwell, senior vice president at the       Connecticut Hospital Association. It's unclear whether the       federal…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694776/congress-long-to-do-list"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…For almost two decades, these dedicated healthcare  professionals have profoundly impacted our community through their  commitment to providing exceptional, cost-effective outpatient surgical  services, including colonoscopies and endoscopies.\n\nThe founders' vision of delivering safe and effective surgical care  through innovation and technology culminated…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695923/recognizing-the-physicians-at-dallas-endoscopy-center"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…veterans living in U.S. territories, but it is likely that this number  is even higher. However, only Puerto Rico has a VA Medical Center, and  only American Samoa and Guam have outpatient clinics or CBOCs.  Therefore, veterans living in the territories have limited access to VA  medical care.\n\nWhile eligible veterans can receive care through the VA's community…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695430/territorial-response-and-access-to-veterans-essential-lifecare-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…The term `facility of the Veterans Health       Administration' means any land or building (including any       medical center, nursing home, domiciliary facility,       outpatient clinic, or center that provides readjustment       counseling) that is--\n\n``(A) under the jurisdiction of the Department of Veterans       Affairs;\n\n``(B) under the control…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695434/health-professionals-scholarship-program-improvement-act-of-2025"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…community should be left without  emergency services or forced to travel over an hour for lifesaving  treatment.\n\nThis funding will help reopen emergency services and create  outpatient specialty care, closing a major gap in healthcare access and  restoring the safety net that Lee County deserves. The CEO of Insight  said that it was pivotal in establishing…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696794/highlighting-critical-investments"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…communities. It  gives these hospitals the flexibility to operate without hospital  inpatient services, while still retaining a 24/7 emergency department,  ambulance services, outpatient services, and more.\n\nToday, 42 rural hospitals in 17 States have transitioned to a rural  emergency hospital model and, hence, are still operating. Some States  are still…", "date": "2025-10-16", "source_url": "https://justfacts.votesmart.org/public-statement/1696257/rural-emergency-hospital-program"}, {"senator": "Maria Salazar", "party": "Republican", "sentence": "…Nicklaus has is not felt in District 27 alone.  Nicklaus Children's Health System, the parent organization of Nicklaus  Children's Hospital, maintains an extensive network of outpatient and  urgent care centers in Miami-Dade, Broward, Palm Beach, and Martin  Counties, serving families throughout Florida, the United States, and  more than 100 countries.…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696282/congratulating-nicklaus-childrens-hospital-on-its-75th-anniversary"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…affected by the disease;\n\n(9) esophageal cancer can be prevented through early       detection of its precursor, Barrett's esophagus, which can be       eliminated with curative outpatient techniques;\n\n(10) research indicates that patients diagnosed with early-      stage esophageal cancer have a significantly higher 5-year       survival rate (as high as 49…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691831/gerald-e-connolly-esophageal-cancer-awareness-act-of-2025"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…Victory  Park in Lincoln, Nebraska. On the VA campus, Burlington Capital  developed 70 new apartments for veterans and partnered with the VA to  deliver a new community-based outpatient clinic for Lincoln's veteran  population. Victory Park combines housing, healthcare, and supportive  services in one location, a community that restores independence,  connection,…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696802/recognizing-lisa-yanney-roskens"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…off its income, its tax receipts from the FICA taxes, it is still an 11  percent cut.\n\nThe next time we get someone here saying that we need more money for  our hospitals, outpatient surgeries, and hospice care, point out to  them that, in 7 years, there is an ugly cut coming. This 11 percent  shortfall isn't even in our long-run CBO projections yet because…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693062/stop-bathing-in-folklore-and-start-bathing-in-math"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "Mr. BOST. Mr. Speaker, I move to suspend the rules and pass the bill  (H.R. 2170) to name the Department of Veterans Affairs community-based  outpatient clinic in Toms River, New Jersey, the Leonard G. `Bud'  Lomell, VA Clinic, and for other purposes.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693923/leonard-g-bud-lomell-va-clinic"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…critical gap in access to urgent  mental health and substance use services for vulnerable populations.  The Behavioral Health UCC provides immediate, voluntary access to  outpatient behavioral health care with extended hours, offering a vital  alternative to emergency departments. It also serves as an essential  access point for individuals transitioning…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698647/recognizing-pasco-county-community-development-for-receiving-the-audrey-nelson-award"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…disabled, pregnant,  whether they used prescription drugs, their gender identity, whether  they are a victim of domestic abuse, how often they sought care at  inpatient or outpatient facilities.\n\nA spokesperson for Covered California even admitted they installed  these trackers as part of a marketing campaign, and the trackers, by  the way, were not removed…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690562/gas-prices-are-lower-for-everyone-except-californians"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…Certification, is a 3-year certificate program that recognizes  hospitals for their quality care and patient safety. This prestigious  certificate is awarded to less than 300 outpatient oncology practices  across the Nation.\n\nTo meet the high standards of the certificate, the hospital's patient  care process and chemotherapy standards are evaluated.\n\nThe…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699849/recognizing-upmc-hillman-cancer-centers"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…abuses and includes legislation that I  authored to expand telehealth access to cardiac and pulmonary  rehabilitation and requires unique provider numbers at every hospital  outpatient department.\n\nThis package forms a key downpayment on delivering meaningful health  cost reduction for all Americans.\n\nLast week, President Trump announced the Great Healthcare…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699211/streamlining-review-process-for-federal-projects"}]