[{"senator": "Luz Rivas", "party": "Democrat", "sentence": "…RIVAS. Mr. Speaker, as we speak, House Republicans are finalizing  an extreme budget plan that includes the largest cut to Medicaid in our  country's history.\n\nThis is an outright assault on the healthcare of nearly 14 million  Americans, including over 370,000 people in my district, California's  29th.\n\nAdditionally, hospitals like Olive View Medical…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691188/protect-medicaid"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…interests. These are the kinds of amendments that foster  deterrence, not instigate and facilitate Chinese propaganda, as this  one would.\n\nWhen we question our support for Taiwan outright, as this amendment  does, onlookers will wonder what else are we willing to walk back on?  Who else will we abandon on the line? That is not the message we should  be sending.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695235/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Andrea Salinas", "party": "Democrat", "sentence": "…deescalation and due process against U.S. citizens. Although the  administration claims it is only targeting undocumented criminals who  pose a threat, we know that is an outright lie.\n\nAt every turn, the administration erodes any trust it has ever had  with the public. That became even clearer when Secretary Noem signed an  order barring Members of…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699128/ice-operations"}, {"senator": "Jahana Hayes", "party": "Democrat", "sentence": "…addresses past failures to educate students with disabilities. I  am old enough to remember a time when students with special needs were  educated in the basement of schools or outright denied entry. Before  IDEA, millions of children with disabilities were denied an education  and often refused admission to schools or even programs.\n\nToday, children with…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698939/protecting-education-for-children-with-disabilities"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…Twenty-three years ago, I stood on this same floor as Congress  debated an Authorization for Use of Military Force in Iraq.\n\nThe Bush administration relied on bad intelligence and outright lies  to march America into a disastrous foreign intervention that cost  trillions of dollars, took thousands of American lives, and helped  destabilize the region for a generation.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698448/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Lauren Underwood", "party": "Democrat", "sentence": "…million people rely on this tax credit, so the fact  that my colleague doesn't need to rely on it and that he has enough  cash so that he can go and buy the prescriptions outright is great for  him.\n\nMr. Speaker, what about those 20 million Americans, many of whom are  in his district, who rely on the Affordable Care Act tax credits? Not  only that,…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697855/providing-for-consideration-of-hr-promoting-efficient-review-for-modern-infrastructure-today-act-providing-for-consideration-of-hr-increasing-investor-opportunities-act-providing-for-consideration-of-hr-electric-supply-chain-act-providing-for-consideration-of-hr-state-planning-for-reliability-and-affordability-act-providing-for-consideration-of-hr-improving-interagency-coordination-for-pipeline-reviews-act-providing-for-consideration-of-s-disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-and-for-other-purposes"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "Ms. McCOLLUM. Mr. Speaker, I rise in strong opposition to H.R. 4, the  Recissions Act of 2025, because this bill undermines and outright  destroys long-held, bipartisan American values at home and abroad.\n\nI'll start right here at home. This bill makes an unprecedented  attack on public media that Americans…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692634/rescissions-act-of-2025"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…podium, Madam Speaker, we heard President Trump last March  come to give a lengthy address to a joint session of this Congress. In  his remarks that combined misinformation, outright lies, and a good  many platitudes, the President devoted special attention to Social  Security, ridiculing it with outlandish tales. He spoke of ``3.9  million people from…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698920/ending-improper-payments-to-deceased-people-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "Mr. Speaker, I rise in strong opposition to H.R. 3668. This bill is  an outright assault on our Nation's environmental laws. It completely  strips States of their ability to enforce clean water laws when it  comes to pipelines.\n\nI have to say, Mr. Speaker,…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698067/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…know that the clean energy tax  credits are popular. They know that the clean energy tax credits will  reduce costs for American families.\n\nSo instead of saying, ``Kill it outright,'' they say, ``You must  start within 60 days.'' That is saying, ``Kill it outright.'' Everyone  knows that, and I saw that some of the hard-right people from the oil  patch…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691671/budget-reconciliation"}, {"senator": "John Mannion", "party": "Democrat", "sentence": "…secure retirement, and a real path to the middle class.\n\nThe indiscriminate stripping of collective bargaining rights through  executive action was an illegal gray area if not outright unlawful.\n\nThis legislation ends that ambiguity. It should never have been a  partisan issue.\n\nMr. MANNION. I am grateful to my colleagues on both sides of the  aisle for…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697993/protect-americas-workforce-act"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…don't even know  what there is to say. Yes, we can fight to restore funding. Yes, we  will fight here to restore funding, especially as so many of Trump's  cuts are, in fact, outright illegal. But we cannot restore from here  lost time--invaluable time--for kids fighting an incredibly deadly  disease. For some of them, it may be too late. And that is  heartbreaking,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694964/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…Constitution, belong to the States.\n\nSo let me be clear. This is not a policy disagreement. This is not a  gray area. This is not a novel constitutional question. This is,  flatly, outright, unquestionably, unconstitutional. The Framers could  not have been more clear. Article I, section 4 of the Constitution  places the times, the places, and the manner of Federal…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700022/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…Venezuela and particularly their oil fields. We used to make fun of the  conspiracy theories of George Bush taking over Iraq because of the oil.  Donald Trump just admitted it outright. He is happy to brag about the  fact that he is taking over the oil fields of another country. The only  problem is, if you talk to some of the oil executives, as of this…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698619/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…serious answers. The only thing we do know is why Trump  is doing this--for oil--because this clearly is not about ending  tyranny and establishing a democracy since Trump outright dismissed any  possibility of helping the opposition party to build a true democracy.  And it is clearly not about drug trafficking. After all, not even a  month before this,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698684/9999"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…build-out of interstate natural gas pipeline  infrastructure has faced significant challenges. Approvals are often  delayed due to a lack of coordination, pure inaction, or outright  obstruction by States and relevant Federal agencies.\n\nSection 401 of the Clean Water Act has turned into a procedural  chokepoint with varying application and drawn-out State…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698073/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…conveyances. A big part of the reason why  so few of the more than 2,000 eligible Vietnam-era veterans or their  heirs have received those lands is because they were delayed or  outright blocked by the previous administration.\n\nThe previous administration blocked their ability to select and  receive their lands. To hear my colleagues, Mr. Speaker, in this…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694897/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…businesses dedicate precious time, money, and  resources, sometimes thousands of dollars, to just submit these  proposals. Too often, they are met with silence, confusion, or outright  cancelation of the solicitation without any explanation. That is not  just inefficient. That is unfair.\n\nAgencies right now have broad discretion to cancel or amend  solicitations…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691762/transparency-and-predictability-in-small-business-opportunities-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…permit for Ambler Road, effectively preventing Alaskans from  developing their own resources.\n\nPassing this CRA is the first step in allowing Alaska to acquire  these lands outright, creating long-term certainty for this project.\n\nConstructing this road and allowing access to the Ambler Mining  District is expected to create thousands of new jobs and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694898/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…their first  driver's license--they shouldn't have to worry whether an illegal alien  driving under the influence of alcohol is going to cause them bodily  harm or kill them outright.\n\nWe simply cannot continue the status quo of allowing aliens who  entered our country illegally or were allowed by the Biden  administration's open border policies and who…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698979/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…shelter workshops in my district  in which people who have different abilities are allowed to work--maybe  they have spina bifida, maybe Down's Syndrome. I know a guy who is an  outright quadriplegic. They are allowed to work for under minimum wage.\n\nThey usually get some other sort of Federal subsidy, SSI or  something, but by being allowed to work in these…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689252/abandon-biden-administration-rule"}, {"senator": "Kevin Hern", "party": "Republican", "sentence": "…almost a sevenfold, 700 percent, increase in inflation  on the American people.\n\nWhen they talk about being good stewards of the American taxpayers'  tax dollars, this is an outright abuse of the facts. The facts are they  are the ones who increased inflation, as my colleague said, over 20  percent over a 4-year period.\n\nThe reason the American people…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689912/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…to limited resources and that high poverty rate,  this small county has been unable to easily navigate the complex  Federal rules and to find a way to purchase the property outright.\n\nMy legislation would enable the Federal Government to convey the  property at no cost to the county with all the benefits that Mr.  Stauber outlined.\n\nThe building will…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698159/conveyance-of-specified-forest-service-property-to-perry-county-arkansas"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…organ harvesting, a practice that amounts to mass  murder.\n\nOn July 20, 1999, the CCP detained hundreds of thousands of Falun  Gong practitioners and banned their practice outright. Since then, the  persecution has only intensified.\n\nMultiple studies, including the 2020 report from the Independent  Tribunal Into Forced Organ Harvesting, have exposed…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690647/falun-gong-protection-act"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…from the CFPB's regulatory purview. That idea that a merchant  engaging in a commercial financial activity due to payment activities  in a merchant's own store or website is outright ridiculous, and it  represents yet another expansion of the CFPB's rapidly growing  authority.\n\nFinally, I would like to highlight another major concern with CFPB  examination…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689949/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…Denmark. And then,  apparently, there was actually a formal offer made back in 1946, at the  outset of the Cold War, in the Truman administration, where there was  actually an outright offer--$100 million, as I understand it, in gold-- to buy Denmark. That is what it was reported as.\n\nThat was, again, rejected by Denmark.\n\nBut it was at this time where we…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698821/9999"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…sisters say on the other side.\n\nI have used this article before. It is one of the best in explaining  the reality of the math and also the reality of the lies. They are just  outright lies. We have to tell the truth.\n\nThis is written by Jessica Riedl in 2023. What was done is, they took  all these tax proposals that the Democrats have proposed, the ones…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692327/math-always-wins"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…think that alone would be a good reason to support the  One Big Beautiful Bill, but there is more.\n\nThe main way they have opposed that bill is by mischaracterizing it  and outright misrepresenting what is contained in it. One of the  accusations made is that it will take away healthcare coverage from  people who need it.\n\nDemocratic Leader Senator Schumer…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695530/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…really is. We  understand its history of failure and oppression. Throughout history,  this ideology has collapsed into the most brutal of dictatorships,  communist regimes, and outright totalitarian rule.\n\nMany are quick to avert their eyes and cover their ears when  presented with facts about the horrors of socialism, how many  individuals across the world…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696900/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision-providing-for-consideration-of-h-con-res-denouncing-the-horrors-of-socialism-providing-for-consideration-of-hr-unlocking-our-domestic-lng-potential-act-of-providing-for-consideration-of-hr-researching-efficient-federal-improvements-for-necessary-energy-refining-act-providing-for-consideration-of-hr-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-providing-for-consideration-of-hr-district-of-columbia-cash-bail-reform-act-of-and-for-other-purposes"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…know that many of the feminists in the sixties, I think Kate  Millett, who was described as the mother of women's studies classes,  which are all over our universities, were outright opposed to the  nuclear family.\n\nIt is disappointing they are not doing more in this budget to address  that problem, to stop encouraging young people not to be married. We…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691328/the-big-beautiful-bill"}]