[{"senator": "George Latimer", "party": "Democrat", "sentence": "…from the San Souci Rehabilitation and Nursing Center  received the Distinguished Service Award;\n\nAnn Muro, the longtime president of the Exchange Club of Yonkers,  Outstanding Leadership and Community Service Award.\n\nAll of these individuals deserve our respect and our congratulations.  We wish them all the very best as they are honorees this year.", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697851/finding-solutions-to-bridge-strikes"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…Department spokeswoman was a  recitation of outdated, vague, and inaccurate criticisms of an  organization that has seen dramatic reforms over the past 7 years under  the outstanding leadership of Director General Audrey Azoulay. Since  her initial appointment in 2017, Director General Azoulay has made  numerous trips to Washington to meet with leaders in…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694037/unesco"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "Mr. LATIMER. Mr. Speaker, it is with great appreciation that I rise  to recognize Dr. Stephen A. Ferrara, DNP, FNP-BC, FAANP, FAAN of White  Plains, New York for his outstanding leadership and contributions as  President of the American Association of Nurse Practitioners (AANP).\n\nDr. Ferrara is a dedicated health care leader with over two decades  of…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690400/recognizing-the-service-of-dr-stephen-a-ferrara"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…hour for the month  of June. I thank my esteemed colleague and dear friend, Congresswoman  Jennifer McClellan, a Democrat from Virginia's Fourth District, for her  outstanding leadership and for leading this incredible hour.\n\nMr. Speaker, I rise tonight during National Gun Violence Awareness  Month not just with sorrow but with a sense of urgency. I…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691752/national-gun-violence-awareness-month"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…Nation's security and to the state  of Colorado will have a lasting impact.\n\nI ask my colleagues to join me in honoring Colonel Ernest R.  ``Bobby'' Schmitt for his outstanding leadership and service to our  Nation. We wish him and his family all the best as they transition to  their next chapter.", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693489/recognizing-colonel-ernest-r-bobby-schmitt"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…restore dignity and  stability, ensuring that every student has the opportunity to thrive.\n\nI want to especially recognize Superintendent Dr. Alejandro Ruvalcaba  for his outstanding leadership in overseeing this project. His  dedication, and the dedication of the entire district, has made this  Center a reality and reflects Moreno Valley Unifier's belief…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695914/congratulating-the-moreno-valley-unified-school-district-health-and-wellness-center"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…for the Arts in Walnut Creek and the Walnut Creek Library, two  remarkable local institutions.\n\nSadly, Gwen passed away in November. She will be remembered for her  outstanding leadership, her indelible mark that she left on Walnut  Creek and the San Francisco Bay Area, the State of California, and,  indeed, the United States of America.\n\nMr. Speaker,…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697386/recognizing-gwen-regalia"}, {"senator": "Rick Larsen", "party": "Democrat", "sentence": "…northwest Washington. She has been a  transformational advocate for the people of Skagit County.\n\nMr. Speaker, it is an honor to commend Commissioner Janicki for her  outstanding leadership and vision, dedication to serving her community,  and the enduring legacy she has helped to cultivate. I ask my  colleagues to join me in expressing our deepest gratitude…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698557/recognizing-lisa-janicki"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…recognizing the Nation's top  academic-performing athletic department. I commend Director of  Athletics Patrick Quest and Assistant Athletic Director Joe Dotson for  their outstanding leadership.\n\nChristendom's varsity teams posted a 3.51 GPA, with the senior  student athlete class achieving a 3.61 average. A total of 45 student- athlete sophomores, juniors,…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693527/congratulating-central-high-school-womens-softball-team"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "Mr. LaHOOD. Mr. Speaker, today I rise to recognize Dr. Sheila Quirk- Bailey, President of Illinois Central College, for her outstanding  leadership and over three decades of dedicated service to higher  education. Since becoming president in 2016, Dr. Quirk-Bailey has  guided Illinois Central College through a…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697402/congratulating-dr-sheila-quirk-bailey-on-her-retirement"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…his commitment.\n\nOn behalf of Kentucky's First Congressional District, I join with  Mayor Cotton's family, friends, and citizens of Madisonville in  celebrating his outstanding leadership and dedication.", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696906/recognizing-mayor-kevin-cotton"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "Mr. WILLIAMS of Texas. Mr. Speaker, today, I recognize Dale Petroskey  for his outstanding leadership and dedicated service as President and  CEO of the Dallas Regional Chamber. Under his guidance, the Chamber has  helped make North Texas one of the most dynamic and…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696653/recognizing-dale-petroskey"}, {"senator": "Roger Marshall", "party": "Republican", "sentence": "…access, at 90 percent. Additionally, it holds the  third-shortest wait time for new patients seeking pulmonology services.  These accomplishments are a testament to the outstanding leadership and  the tireless dedication of the staff at the Dole VA.\n\nThe city of Wichita is also playing a vital role in providing care  for our Nation's veterans, particularly…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690253/recognizing-the-robert-j-dole-va-medical-center-and-the-city-of-wichita"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…five enemy 155-millimeter guns.  . . .\n\n``[He] gallantly led his patrol against the enemy and successfully  destroyed the guns . . . . First Sergeant Lomell's bold and outstanding  leadership in the face of superior numbers is in keeping with the  highest traditions of the military forces of the United States and  reflect great credit upon himself and the…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693923/leonard-g-bud-lomell-va-clinic"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…in livestock  production. Join me in congratulating Alexis on this notable  achievement and for her commitment to Pennsylvania agriculture.               Recognizing Outstanding Leadership of Sam Worley\n\nMr. JOYCE of Pennsylvania. Mr. Speaker, I rise today to recognize the  outstanding community leadership of Sam Worley, who celebrated his  104th birthday…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698173/lowering-healthcare-costs-for-all-americans"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…captured that victory. This makes the 2025  championship the most watched Little League Softball World Series game  ever.\n\nWest Suburban's success is a tribute to the outstanding leadership of  the coaches, the tremendous talents of the players, and the enduring  support of family and community.\n\nI congratulate Manager Lester Gaunt, Coach Rick Baxter,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694805/critical-supply-chains"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…law enforcement experience. Upon  returning home from his recent deployment, Master Sergeant Holliday was  awarded the Meritorious Service Medal in recognition of his outstanding  leadership.\n\nWhat makes America exceptional are men and women like Brandan  Holliday, the quiet heroes who put their lives on the line in defense  of our freedoms. This country…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697701/recognizing-brandan-holliday"}, {"senator": "Ronny Jackson", "party": "Republican", "sentence": "…of Airmen who served at Sheppard Air Force Base  throughout his eighteen-year tenure, I express my sincere gratitude and  appreciation to Mr. George Woodward for his outstanding leadership and  unwavering support for the missions of the U.S. Air Force.", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693070/recognizing-the-career-of-mr-george-woodward"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…The RISE Empowerment Center and Food Bank targets the specific needs  of residents with the collaborative power of our most effective  resources. Barbara's vision, outstanding leadership, and unyielding  drive to make a true difference not only make her a hero in her  organization's mission, but she is also a community treasure.\n\nIt is clear that Barbara…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690137/recognizing-barbara-sprague"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…about  young people from Ohio's 4th Congressional District. Today, I am  pleased to commend to the House twelve high school students who are  being honored for their outstanding leadership skills and volunteerism.\n\nOn February 11, 2026, the Noon Optimist Club of Lima will recognize  Andrew Baldauf, Vivian Elrod, Sheldyn Fetter, Daniela Garcia, Jackson…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699533/recognizing-the-lima-noon-optimist-clubs-annual-youth-appreciation-luncheon"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…could be wielded against  the American way of life.\n\nI am proud to be a cosponsor of this important legislation, and I  thank Whip Emmer and Chairman Hill for their outstanding leadership on  this important issue.\n\nMr. Speaker, I urge my colleagues to support this legislation.", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693725/anti-cbdc-surveillance-state-act"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "Mr. LANGWORTHY. Mr. Speaker, I rise today to honor the outstanding  leadership and service of Dr. Karol B. Wight, who retires this year  after fifteen years of exceptional stewardship at The Corning Museum of  Glass. Since joining the Museum…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697880/recognizing-dr-karol-b-wight-on-her-retirement"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Clerk read the title of the bill.\n\nMr. HILL of Arkansas.  1919.\n\nThis bill has been before us in this House Chamber. We debated it in  the last Congress. It has had the outstanding leadership support and  advocacy by our majority whip here in the House, Mr.   Tom Emmer of  Minnesota. I rise in strong support.\n\nAt stake is a fundamental choice about the future…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693731/anti-cbdc-surveillance-state-act"}]