[{"senator": "Bobby Scott", "party": "Democrat", "sentence": "…will receive the healthiest meals possible.\n\nMr. Speaker, I am also disappointed by the majority's decision to  depart from precedent by moving a limited child nutrition bill outside  of a comprehensive child nutrition reauthorization.\n\nMore to the point, this is the only piece of legislation that our  committee has considered this year that amends laws…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698183/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…two termination cases it has considered under the       new system--one originally overturned on a timing       technicality involving a member who worked unauthorized       outside employment while on duty, accepted gratuities, and       made untruthful statements; and another where the member had       repeated alcohol-related misconduct, including…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692302/protecting-our-nations-capital-emergency-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…traveling from powerplants in  the Midwestern States. Data shows that anywhere from 90 to 95 percent  of air pollution impacting Connecticut on high ozone days originates  from outside our State, and it is causing serious harm to Connecticut  and our residents. Last year, Connecticut exceeded the Federal health  standards for ozone on 23 different days.…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689118/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…appropriations.  Activities that we authorize, or do not, through lawmaking, which is  our constitutional role.\n\nMy favorite part of our interaction that day--1\\1/2\\ hours of our  time outside waiting to be seen--was the sign that staff from the  holding center placed on the door which reflects ICE's formal response  to our visit.\n\nMr. Speaker, let me tell you what…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692932/holding-power-accountable"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…glamorous. It demands patience,  perseverance, and quiet strength. There are early mornings, late  nights, and countless moments when the work you do goes unnoticed by  the world outside. But it's people like Rikki who keep everything  running--the unseen hands and steady hearts behind the work we all  depend on, whether we realize it or not.\n\nRikki has been…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696707/recognizing-the-career-of-erica-rikki-miller-and-her-work-on-behalf-of-michigans-3rd-congressional-district"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…Fair Labor Standards Act to excuse employers of their       responsibility to pay workers for trainings or other       professional development opportunities that are outside of       regular work hours. Despite the bill's generous-sounding       title, this bill would not give workers any more flexibility.       Instead, it allows employers to…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698964/tipped-employee-protection-act"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…no mistake: That would have immediate impact for our  communities, for every family living near a busy highway, every child  using an inhaler, and every senior who can't go outside on a high  pollution day. This is a direct attack on over 50 years of precedent  that recognizes that EPA has the authority and the obligation to allow  States to do what…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690482/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "…breathe it in their own neighborhoods where ICE  raids at schools and festivals turn everyday life into a source of  terror. Transgender Americans breathe it just stepping outside, never  knowing if they will be targeted for simply existing as themselves.\n\nJournalists and everyday Americans breathe it for simply exercising  their free speech rights.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695714/calling-for-empathy-in-the-face-of-tragedy"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…dictator  buddies will rule the day, and in their world, liberty cannot survive.\n\nAmerica must pay attention. Pay attention not just to what is  happening inside our borders but outside our borders. I can tell you  there are enemies to liberty across this world. We have to hold our  ground. We have to tell our own President pay attention, learn from  history,…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691084/liberty-versus-dictatorship"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…I believe we need some kind of independent monitor, just like would  be appointed, and has been done, when local police forces are found to  be so corrupt that they need an outside enforcer to make sure that  there is adherence to the rule of law--an outside monitor who can take  complaints, who can oversee and report to the public. And, at some  point,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699650/9999"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…President Trump claimed he was going to reduce this kind of  migration, but the political turmoil he is causing will, in fact, make  it worse, pushing people to seek safety outside of their own home  country.\n\nWe can't turn our back on Ukraine and the world, and we cannot expect  that the consequences of that decision will not reach our shores. The…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687988/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…United States of America governmental presence at the COP. That  was it. Just me. Nobody else went. And not only did nobody else go-- this is not important to anybody really outside the Senate--but for my  codel, my congressional delegation trip of one, the State Department,  under President Trump, refused to facilitate my trip.\n\nI think this is the first…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697077/climate-change"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…residents, there are more than enough existing  BOP facilities within 250 miles of D.C. to house all these D.C.  residents. Under this bill, BOP could place a D.C. resident outside 250  miles upon the request or consent of a resident, and BOP could place a  D.C. resident outside 250 miles without consent in extraordinary  circumstances.\n\nThis bill would…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690140/introduction-of-the-improving-reentry-for-district-of-columbia-residents-in-the-bureau-of-prisons-act-of-2025"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…help expand membership and  increase funding. More than 90 organizations hold congressional  charters, and many of them have principal offices and places of  incorporation outside D.C.\n\nParticularly as this administration has slashed programs that serve  our veterans, gutted staff at the Veterans Crisis Line and Veterans  Health Administration, and…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699500/moving-national-womans-relief-corps-incorporation-and-domicile-to-illinois-principal-office-to-murphysboro-illinois"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…the returns generated  through the brokerage windows with those of other investments available  through retirement plans.\n\nBrokerage windows allow plan participants to invest outside the menu  of designated investment alternatives available under their plan. Such  investments can include mutual funds and, in some cases, individual  stocks and bonds.\n\nOf…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699154/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…study, the Comptroller       General shall--\n\n(1) consider the direct and indirect costs of an IPO,       including--\n\n(A) fees of accountants, underwriters, and any other       outside advisors with respect to the IPO;\n\n(B) compliance with Federal and State securities laws at       the time of the IPO; and\n\n(C) such other IPO-related costs as the Comptroller…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693907/middle-market-ipo-cost-act"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…more than $5 billion in fraudulent unemployment insurance.  Well, do you know what? They didn't do a thing about it.\n\nLast month, the Trump administration indicted two men outside Chicago  who submitted nearly $300 million in fraudulent claims to Medicare and  Medicaid as well as to private insurers.\n\nThen, this week, in Mississippi, a trial started…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698560/fraud-accountability-act"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…Bar Associations,  the American Judicature Society, the Illinois Judges' Association, the  Appellate Lawyers Association, and is a fellow of the Illinois Bar  Foundation.\n\nOutside of the courtroom, Judge Knecht is heavily involved in our  Illinois communities and within his alma maters. He serves on the  Illinois Family Violence Coordinating Council…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694150/congratulating-judge-jim-knecht-on-50-years-of-service"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…The partnership between law enforcement agencies at all levels is  critical to keep our communities safe. From the sheriff in Rio Arriba  to the Capitol Police officers right outside these doors, each plays an  important role. Unfortunately, not everybody respects all of our law  enforcement officers.\n\nIn this very building, January 6 insurrectionists…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691169/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…panel on the nursing home  workforce, representing various stakeholders, including members from  rural and underserved areas. This will ensure that the government hears  voices outside the big cities--those big cities on the coasts--when it  comes to our nursing homes.\n\nNursing homes are few and far between in rural areas of our country.  If one facility…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688195/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…are deaf, deafblind, hard of hearing, or have a speech       disability may dial 711 (TTY, TDD, or TeleBraille) to access       telecommunications relay services. Individuals outside the       United States should use the relay services offered within       their country to make international calls to the point of       contact in the United States.\n\nSUPPLEMENTARY…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699271/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Dave Joyce", "party": "Republican", "sentence": "…to protect our children and maintain the  integrity of the U.S. system of schools.\n\nThese Confucius classrooms are just another example of the CCP trying  to exert influence outside their borders. The fact that they are  targeting our kids should be a significant cause for concern.\n\nThat is why I urge my colleagues to support this legislation and  demonstrate…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697408/combating-the-lies-of-authoritarians-in-school-systems-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "…joys of living in a  rural community. I also know some of the challenges.\n\nEverything from package delivery to internet reliability can be more  difficult when you live far outside a major city, and access to  healthcare can sometimes be a real challenge. More than 100 rural  hospitals have closed over the past two decades, and doctors can be few  and…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698574/rural-health-transformation-program"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…this country. They put forward a spending  bill of $1.5 trillion. That is twice the discretionary budget.\n\nMr. Chairman, they are spending more money than we have ever spent  outside of COVID. That is their counterproposal. It is not only  disingenuous. It is unserious.\n\nWhat is it about? It is about politics. It is about resisting and  fighting and undermining…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696731/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…it.\n\nA new Muslim community in Texas, not even a few days old, with a  150,000-square-foot Muslim community center, was opened in Houston,  called EPIC City. It is in Plano, outside of Dallas-Fort Worth and it  has raised all sorts of questions about their intentions to create an  effectively Muslim-only community where sharia law no doubt would and…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698106/bringing-america-back-to-its-roots"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…dissatisfaction and lacking purpose  in life. In some cases it does leave them in a better condition.\n\nThe point I am making with this true story is that veterans need to  have options outside of these narcotics.\n\nIn many States, there are legal cannabis medical programs. They need  to have the ability when they are being seen by their primary care  physician inside…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692956/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…terms),  Vice President (one term), and President (two terms) of the Bowie  County Republican Women, a chapter affiliated with the Texas Federation  of Republican Women (TFRW). Outside of her service, Lisa is also close  to completing a personal goal--visiting all fifty states, with only two  remaining.\n\nLisa Singleton's lifelong commitment to her community,…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696870/recognizing-congressional-patriot-award-recipient-lisa-singleton"}, {"senator": "Victoria Spartz", "party": "Republican", "sentence": "…Shop for  Kids'' drive. Lieutenant Delong, in his 25 years of service, provided a  strong foundation for safety, training, and growth for the citizens of  Hamilton County.\n\nOutside of his law enforcement duties, Lieutenant Delong operates a  small landscaping business. Lieutenant Delong is an avid fan of both  high school and college wrestling, and he…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689279/recognizing-lieutenant-kurt-delong"}, {"senator": "John Thune", "party": "Republican", "sentence": "Mr. THUNE. Mr. President, before I begin, I need to mention the  shooting that occurred last night outside an event at the Capital  Jewish Museum in Washington, DC, held by the American Jewish Committee.  From everything we know so far, it is appallingly clear that event  attendees…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691633/capital-jewish-museum-shooting"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…directs the SEC's Office of the Advocate for Small Business Capital  Formation to do more to support underserved entrepreneurs, particularly  those in rural communities or outside of traditional investment hubs.\n\nSpecifically, the bill requires the advocate to provide educational  resources and host public events that highlight the capital raising…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692706/promoting-opportunities-for-non-traditional-capital-formation-act"}]