[{"senator": "Bill Foster", "party": "Democrat", "sentence": "…FOSTER. Mr. Speaker, I rise today to recognize the Crystal Lake  Strikers for receiving the Carl E. Wehde Award. This award honors the  late Carl E. Wehde and celebrates outstanding contributions that  enhance the quality of life for the people of Crystal Lake.\n\nThe Crystal Lake Strikers are a drumline that seamlessly integrates  the arts and education. They…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690915/recognizing-the-crystal-lake-strikers-for-receiving-the-carl-e-wehde-award"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…generations of service members, particularly women  pursuing leadership roles in uniform. Her service reflects the very  best of our military.\n\nIn recognition of her outstanding contributions, Major General  Clellan has been awarded the Legion of Merit with Bronze Oak Leaf  Cluster, the Bronze Star Medal, the Meritorious Service Medal with two  Bronze…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696265/recognizing-major-general-laura-clellan"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "Mr. VASQUEZ. Mr. Speaker, I rise today to recognize Terri Judah for  her outstanding contributions to Carlsbad, New Mexico. Terri is a  community leader who has devoted her time and effort to feeding New  Mexico's families and working for New Mexico's children…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699949/recognizing-terri-judah"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…impact  in our community through the Women of the Year Award. This year, it is  my pleasure to recognize JoAnne Meade Young of Santa Barbara,  California, for her outstanding contributions to education and  community leadership.\n\nJoAnne's lifelong commitment to educational equity was shaped early  in life. Born on February 11, 1946, she attended a segregated…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698084/the-year"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "Mr. HIMES. Mr. Speaker, it is with great respect and admiration that  I recognize the outstanding contributions of Nick Alton, who has served  as Minister Counsellor Political at the British Embassy in Washington  for the past four years. Throughout his tenure, Nick has been…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698086/recognizing-nick-alton"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…commitment to strengthening the economic fabric of New York  City. Therefore, Mr. Speaker, I ask my colleagues to join me in  celebrating Theodore M. Renz for his outstanding contributions and  wishing him good health and joy in this next chapter of life.", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693397/recognizing-theodore-m-renz"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "Ms. CROCKETT. Mr. Speaker, I rise today to recognize the outstanding  contributions of the physicians at Dallas Endoscopy Center (DEC) to the  health and well-being of the residents of Texas' 30th Congressional  District. For almost two decades,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695923/recognizing-the-physicians-at-dallas-endoscopy-center"}, {"senator": "Nelida Pou", "party": "Democrat", "sentence": "…and respected religious figures of our time.\n\nWhile in the United States, Ecumenical Patriarch Bartholomew will be  awarded the prestigious Templeton Prize for his outstanding  contributions to the advancement of science and spirituality. He will  join the company of other spiritual leaders like Mother Teresa and the  Dalai Lama. I am honored to add my…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695843/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Eric Swalwell", "party": "Democrat", "sentence": "Mr. SWALWELL. Mr. Speaker, I rise today to recognize and celebrate  the outstanding contributions of Parvin Ahmadi, a lifelong educator  whose 36 years of service in public education have profoundly shaped  the lives of students, families, and educators across…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691728/recognizing-parvin-ahmadi"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…exemplifies the true spirit of community  and compassion.\n\nI ask my colleagues to join me in recognizing Corey Rose and her  Wishes & Heroes Benefit Concert for their outstanding contributions and  wishing her all the best in her future endeavors.", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692442/recognizing-and-commending-the-service-of-corey-rose"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…heritage is accurately represented in  public discourse.\n\nMr. Speaker, on behalf of the Hindu community, I commend Rajiv  Malhotra and the Infinity Foundation for their outstanding  contributions to Hindus around the world. I thank them for their  exceptional work. We wish them continued success in their quest to  foster better understanding and goodwill between…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689467/recognizing-the-contributions-of-rajiv-malhotra-and-the-infinity-foundation"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "Mr. VASQUEZ. Mr. Speaker, I rise today to recognize Ronnie Torres for  his outstanding contributions to Belen, New Mexico. Ronnie is an  exceptional citizen and neighbor who tirelessly dedicates his time and  energy to improving his local community.\n\nRonnie was born…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699893/recognizing-ronnie-torres"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…leads to coordinate the day-to-day  scheduling of associates. Our West Michigan Community is fortunate to  have lived and worked alongside Mr. Jennings, who has made outstanding  contributions during his time at SpartanNash.\n\nMr. Speaker, I once again ask my colleagues to join me in  congratulating Robert Jennings on his retirement from SpartanNash. We…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689251/recognizing-the-retirement-of-robert-jennings"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…difference--lifting others as they  lead and setting powerful examples for future generations. It is a  privilege to celebrate their accomplishments and recognize their  outstanding contributions.\n\nBusinesswoman of the Year--Monika Mueller: Monika's journey to  becoming Chief Strategy Officer is a true testament to her visionary  leadership, relentless innovation,…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690568/virginias-fourth-district-women-in-excellence-awards"}, {"senator": "Marc Veasey", "party": "Democrat", "sentence": "Mr. VEASEY. Mr. Speaker, I rise today to recognize the outstanding  contributions and enduring legacy of the Junior League of Arlington  (JLA), an organization that has been empowering women and strengthening  the Arlington community for nearly…", "date": "2025-10-28", "source_url": "https://justfacts.votesmart.org/public-statement/1696424/recognizing-the-junior-league-of-arlington-empowering-women-strengthening-community"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Tommy Baker has made through his work with NAMI  Hernando. Tommy works as the Operations Manager of Meares Plumbing and  Electrical and former Board President…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692203/recognizing-tommy-baker"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Ms. Kay Hoffland has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691124/recognizing-kay-hoffland"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…process, ensure the security of this great institution,  maintain our technology and service infrastructure, and contribute to a  more efficient and productive House. The outstanding contributions and  accomplishments of these devoted employees during their years of  service, have benefited the U.S. House of Representatives, its Members,  staff, and the American…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698362/recognizing-employees-of-the-us-house-of-representatives-who-have-reached-25-years-of-service"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Emily Mazzaro has made to our community through her  volunteer service at Double Branch Elementary School. Emily is the PTA  President at Double Branch Elementary…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690622/recognizing-emily-mazzaro"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Lesa Burnham has made through her work with the  CARES Senior Clinic. Lesa is a tireless volunteer, eager to assist with  all clinic needs. She is quick to get…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691080/recognizing-lesa-burnham"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Ms. Lynn White has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691191/recognizing-lynn-white"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Ms. Kimberly Godding Brooks has made to our  community through her volunteerism. Since 2008, 17 years, Kimberly  Godding Brooks has volunteered her time and…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691047/recognizing-kimberly-godding-brooks"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Mr. Ronnie Hutton has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691912/recognizing-ronnie-hutton"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Pastor Kenny Buzzie of Life Style Church has made to  our community in the aftermath of Hurricane Milton. In addition to  providing countless hours of direct…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690644/recognizing-pastor-kenny-buzzie"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Ms. Barbara Sprague has made to our community  through her work with the Community Food Bank, leading the charge in  our fight against food insecurity. Since…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690137/recognizing-barbara-sprague"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Cheryl Dillow has made through her work with the  CARES Senior Clinic. Cheryl is the check out clerk at the clinic.  Speedy in her typing, proficient with patient…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690208/recognizing-cheryl-dillow"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Tyrone Young has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692468/recognizing-tyrone-young"}, {"senator": "Barry Moore", "party": "Republican", "sentence": "Mr. MOORE of Alabama. Mr. Speaker, today, I rise to recognize the  outstanding contributions, hard work, and legacy of Mr. Frank Caskey.  His dedicated service to the Alabama Legislative over several decades  has made a lasting impact on the lives of many…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690777/recognizing-the-retirement-of-frank-caskey"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Ms. Tasha Phillips has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692158/recognizing-tasha-phillips"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Jeanne White has made through her work with K-9  Partners for Patriots. After retiring from a successful career, Jeanne  completed a two-year apprentice trainer…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690843/recognizing-jeanne-white"}]