[{"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…I wanted the shutdown to end. I also believe the  legislation to reopen the government should have included provisions to  lower escalating healthcare costs. Lowering costs overall, from  healthcare to groceries to electricity, is the top priority for  Minnesotans and for me. The Nation is facing a healthcare crisis that  will raise costs and threaten…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696995/hr-5371"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…was a co-chair of the General Assembly's Public Safety and  Security Committee, which oversees all matters related to civil  preparedness, state and municipal police, and the overall safety of  residents. He also served on the Gaming Policy Task Force, the Police  Pursuit Task Force and the Private Security Personnel Task Force as  well as on the Executive…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689392/recognizing-the-honorable-steven-steve-dargan-west-havens-2025-irish-person-of-the-year"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…trade facilitation and capacity-building  program for the Pacific Islands to help partner governments strengthen  customs procedures, meet U.S. product standards, and improve overall  export readiness, ensuring they can fully realize the benefits of  enhanced trade ties.\n\nI urge my colleagues to join me in supporting this legislation to  sustain and expand…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697950/supporting-the-prosper-in-the-pacific-act"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…to get to us. We also have a requirement in here that if any  senior-level military officer is going to be fired, Congress has to be  notified and a reason has to be given.\n\nOverall, I think this bill is a good balance of the interests of both  sides, in the Senate and the House, as well. It is a good product that  we should be supportive of.\n\nMr. SMITH…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697790/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…inventory keep homeownership out of reach for  many in my district. We cannot ignore the inequities baked into the  system.\n\nIn Ohio's 13th District, the homeownership rate overall is nearly 69  percent, but for Black families, it drops to just 37 percent, dropping  by nearly half. That gap reflects generations of barriers we still have  a responsibility…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699021/rising-housing-costs"}, {"senator": "Zoe Lofgren", "party": "Democrat", "sentence": "…have seen report a ROI of at least 10:1. That is a remarkable win for  the taxpayer for a relatively small investment.\n\nWhile the Small Business Administration administers the overall  program, it is the science agencies themselves that solicit and fund  SBIR/STTR award proposals. As the Ranking Member of the Science, Space,  and Technology Committee, I…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695449/extension-of-sbir-and-sttr-authority"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…talking about cutting Medicaid by as much as 20 percent-- that is what we are talking about here today. An $880 billion cut in  Medicaid represents about 10 percent of the overall program, but you  have to assume that States are not going to continue to match if the  Federal Government isn't putting in their share. So that 10-percent cut  could very…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689306/privileges-of-the-floor"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…developed in close consultation with industry, using industry data.  It also proposes emissions reduction technology that the best  performers in the industry are already using.\n\nOverall, it is estimated to cost less than a fraction of 1 percent of  the company's annual revenue and facilities have years to comply.\n\nThis should be a no-brainer, a win-win scenario…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688531/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…5 points. Worse, the average eighth grader recorded a score of 8  points lower than the previous assessment. The 2024 survey was even  more concerning because it showed an overall growth of zero from 2022  and even declines among some students, as well.\n\nWith all the chaos that is unfolding in other parts of our  government, particularly in the education…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688979/mathematical-and-statistical-modeling-education-act"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…percentage of the IPO price as compensation for their  work.\n\nLarge companies have in recent years been able to negotiate lower  percentages for this process, which reduces their overall fee. At the  same time, smaller companies have continued to pay the same historic  percentage for this service.\n\nSimply put, this bill sheds light on how much small- and medium-sized…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693906/middle-market-ipo-cost-act"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…encouraging the FDA  to explore liability protections for certain infant formula  manufacturers, over which the agency has absolutely no jurisdiction  whatsoever.\n\nWhile the overall funding package may reopen the government for 1  month or 2, this bill does not address the breach of trust that this  administration has demonstrated since January.\n\nThey…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696744/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…were a year ago because of the big, ugly bill  and the sledgehammer that DOGE and Secretary Wright took to the  Department of Energy. That is a large reason why I oppose the overall  bill. But this amendment isn't about that.\n\nWhile I still oppose the underlying bill, I do not oppose the  amendment, even though I think it is too narrow.\n\nMr. Chair, I…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697896/electric-supply-chain-act"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…that we can be adults.\n\nSo we were achingly close to a deal, but I am afraid that my  colleagues on the other side of the aisle have run out of patience.\n\nI understand the overall argument about the number of nominees who  are in a backlog. I understand that argument. I am not talking about  that. I am talking about they just want to go today. They…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695313/cloture-motion"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…networks and methods, intelligence that would be of great  assistance to law enforcement agents, to government, to consumers of  their products, and the financial industry overall, Mr. Speaker.\n\nSo by giving OFAC the authority to tailor the parameters of the  specific licensure pilot program, this legislation enhances our  investigatory toolbox while…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693943/ofac-licensure-for-investigators-act"}, {"senator": "André Carson", "party": "Democrat", "sentence": "…Congressional action has helped support medical  research through the NIH and CDC, supported in part by the bipartisan  appropriations letter I lead each year to increase NIH overall funding  and increasing funding for the Veterans Medical and Prosthetic Research  Program. I urge all my colleagues to join me in both these  appropriations requests. Imagine…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695475/introduction-of-a-resolution-recognizing-medical-research-week-from-september-15-through-september-2025"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…additional supporting documentation. The       results of our covert testing, while illustrative of       potential enrollment control weaknesses, cannot be       generalized to the overall enrollment population.\n\nTo examine federal Marketplace enrollment for plan years       2023 and 2024, we obtained and analyzed federal Marketplace       enrollment and payment…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698800/breaking-the-gridlock-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…then get to Gilroy. At Gilroy, a  person would get off and wait for another train, one that is not a  high-speed one. That would take them from Gilroy into San Francisco.\n\nOverall, the trip at a minimum would take 6 hours and would span  three different transit systems. It wouldn't be doable until 2045 at a  minimum.\n\nRight now, today, for decades,…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Eli Crane", "party": "Republican", "sentence": "…have  breached the U.S. border, with an 80 percent increase in tunnel  activity occurring since 2008.\n\nOver the years, CBP has worked to combat these tunnels as part of  their overall strategy. In fact, the United States conducts research,  development, and test activities with Israel, which must contend with a  vast network of Hamas tunnels originating…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688707/subterranean-border-defense-act"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…undercover calls atso provided evidence that former Chinese       President Jiang Zemin issued the order to harvest organs from       Falun Gong practitioners. Based on the overall collective       body of evidence reviewed, the China Tribunal concluded that       state sanctioned forced organ harvesting in China amounts to       Crimes Against Humanity.…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690630/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…dramatically for defense. In  fact, we are spending $912 million extra on defense in the Energy and  Water bill over the current budget--a 2.7-percent increase even though  overall the bill is 2.8 percent less.\n\nWell, obviously, we had to cut something. We did. We are cutting  nondefense spending, the nondefense portion of the bill, by 3.8  percent.…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699012/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…important part of the Clean Water Act's cooperative       federalism structure. Assumption can streamline permitting       processes, reduce duplication of effort and overall       expenditures by state and federal authorities, while       providing better protection of a state's environmental       resources by those who know their state best.…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698026/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Michael Rulli", "party": "Republican", "sentence": "…has represented his country at multiple hockey events, including  the World Junior Ice Hockey Championships. J.T. was drafted in 2011 by  the New York Rangers with the 15th overall selection. Following his  tenure with the Rangers, J.T. was traded to the Tampa Bay Lightning.  After Tampa Bay, he was traded to the Vancouver Canucks, where he  scored over…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699838/congratulating-jt-miller-on-his-selection-to-the-team-usa-hockey-roster-for-the-2026-winter-olympics"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…speech, function, movement, and swallowing. His specialization lies in  restoring mobility in patients, reducing pain, rehabilitating injuries,  and increasing movement and overall health. Mr. Barth's allegiance to  his patients highlights the importance of leaders stepping up and  caring for patients across Georgia.\n\nMr. Speaker, I thank Mr. Barth for…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699261/recognizing-wayne-barth"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…advocacy, collaboration, and leadership that  improves the health status and access of Asian Americans, Native  Hawaiians, and Pacific Islanders. Jeffrey's oversight of the overall  strategic direction and execution of the Association of Asian Pacific  Community Health Organizations' mission seeks to bring about a world in  which all the communities…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694737/recognizing-jeffrey-b-caballero-mph-executive-director-of-the-association-of-asian-pacific-community-health-organizations-aapcho"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…are producing CO2 and other particulate matter that is bad  for the air is rising.\n\nWhy would we undermine our own economic well-being to pursue a  negligible impact on the overall global emissions, while driving up the  price of goods and services for the average American family? They have  to live for today. They have to pay their bills today.\n\nAll…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690387/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…going to be newer to the tax code,  and we will try them out to see how it plays out in 4 years to give us  time to be able to analyze and see how they are being effective and  overall impact.\n\nThis is going to provide real relief to American families, workers,  and businesses. The bill expands the child tax credit, provides  critical tax breaks for small…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691166/events-this-week"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…forward.\n\nVolunteering doesn't just help those whom we serve, it enriches our  own lives. Studies show that service fosters personal growth, reduces  stress, and even enhances our overall well-being. Beyond the data, we  know firsthand that giving back fills our hearts with meaning and our  communities with hope.\n\nMr. Speaker, as we observe National Volunteer…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689399/national-volunteer-month"}, {"senator": "James Risch", "party": "Republican", "sentence": "…maintenance, repair,       and overhaul capability will directly contribute to       battlefield effectiveness through a more resilient and rapid       repair cycle that will increase overall operational rates       with reduced logistics and financial burdens. Ukraine will       have no difficulty absorbing these articles and services into       its armed forces.…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694097/arms-sales-notification"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…small restaurants were all required to pay the full Federal  minimum wage to all tipped workers, as my Democrat colleagues suggest,  on top of a complete elimination of the overall tip credit system,  which has also been supported by my Democrat colleagues, there wouldn't  be very many small restaurants remaining at the end of it all.\n\nMr. Speaker, the…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698965/tipped-employee-protection-act"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…lose  talent, experience, and economic growth potential. This bill helps  remove one of the biggest barriers to keeping willing workers on the  sidelines and strengthens our overall economic resilience.\n\nThis legislation also recognizes that caregiving does not end with  childhood. As our population ages, more workers are caring for elderly  parents or…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699006/empowering-employer-child-and-elder-care-solutions-act"}]