[{"senator": "Scott Peters", "party": "Democrat", "sentence": "…administration that is indifferent to and  may be hostile to scientific research. She has watched critical  datasets and research tools disappear from government websites  overnight. As she so aptly put it: ``I have sacrificed so much of my  livelihood for the betterment of our planet, only to see it all burn  down in less than half a year.''\n\nMyiesha,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695749/funding-cuts-to-science"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…hemisphere.\n\nCongress must act now. Businesses rely on this critical program both  in Haiti and the United States. Workers need the reassurance that these  jobs will not vanish overnight. Our close neighbor, just 700 miles from  our shore, needs the continued support of this very important program.\n\nMs. SEWELL. Madam Speaker, I thank the gentlewoman from…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698850/haiti-economic-lift-program-extension-act"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…in fact, it  did. When the UAE complied with that corrupt request, World Liberty  Financial--the stablecoin that it issues became the fifth biggest  stablecoin in the world overnight.\n\nNow, the UAE felt like it had to comply with the President's request  because they had things they wanted from the United States.\n\nFirst, they wanted a continuation of…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692362/motion-to-discharge-sj-res-54"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…on the ACA and face premiums that are doubling or tripling.\n\nA self-employed mom recovering from cancer in Lake Worth Beach is  dropping her coverage as her premium tripled overnight. A 62-year-old  waiter in West Palm Beach is going without insurance because it now  costs more than his rent.\n\nHere is a fact. When people lose health insurance, the consequences…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698564/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…impact because we are eroding the  infrastructure of science, of inquiry, and of investigation for better  health cures. You don't destroy that and put it back together again  overnight. That is what is so wrong-headed about the DOGE approach to  things--body count versus better service, better performance, more  sustainability.\n\nMr. President, you couldn't…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688257/department-of-health-and-human-services"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…Medicaid. In  my State, 100,000 people through Medicaid have access to treatment and  to recovery. That is in jeopardy.\n\nIn 19 days, ACA tax credits will expire, spiking premiums overnight.  Mr. Speaker, 30,000 Pennsylvanians have already dropped coverage. By  the end of January, it is estimated by my Governor that 150,000 will be  without insurance.\n\nThe students…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698085/healthcare-and-affordability"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…survivors and family members who are here today  at the Capitol. Their courage is inspiring. They have come a long way  from across the country, taking red eyes and flying overnight so they  can be here for this important moment. Their decision to be here today,  to push Virginia's Law, will ensure others get the justice that they  have been wrongly…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699879/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…sense.\n\nTariffs will hurt jobs across our region's manufacturing belt, in the  automotive industry, in the energy sectors. The significant harm to our  economy cannot be undone overnight, and it is happening right now as I  speak.\n\nThe regions' economies are intertwined across the Great Lakes, with  iron ore and steel, auto parts and finished vehicles, crude…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688734/americans-are-in-for-a-rough-ride"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…them that year-round counseling and support services meant to assist  them and their disabled child in transitioning from high school to  adulthood have been discontinued--overnight, in the middle of the  school year.\n\nAs every parent knows, raising a child takes an incredible amount of  planning and care, especially if your child has unique or special…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689642/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…going up $2,400 this year? And now, on Friday, the administration is  planning to make the goods businesses and families need 10 or 30 or 40  or 50 percent more expensive overnight.\n\nThis President promised to lower the price of everything--groceries,  rent, energy. What these tariffs do is just the opposite.\n\nWe are hearing a lot of positive spin from…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694454/9999"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…must not let these concerns  go unanswered, especially when we have the ability to act. And we have  the solution to prevent healthcare costs from skyrocketing even further  overnight.\n\nThat is why a number of my colleagues and I have worked in the Senate  to introduce bicameral legislation that would permanently extend the  enhanced premium tax credits,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695663/cloture-motion"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…steadied me through victories and through  heartbreak.\n\nWhen my daughter, Rosa, passed away in 2023 and left us four  beautiful young children, it shook our entire world. Overnight, our  house became a home for those kids. We did what every family does: We  stepped up. We held them close, and we gave them love and stability.\n\nDespite dealing with multiple…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696777/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…advance. They need to  place orders and plot out their growth in order to succeed. How can  they plan when they can't even know whether their costs are going to go  up 25 percent overnight? How can a developer know if they can start  building the housing that New Hampshire desperately needs if their  lumber costs 25 percent more overnight? And how can a family…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688447/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…6-week  abortion ban went into effect, essentially outlawing abortion before  many people even knew they are pregnant.\n\nThat law put the lives of millions of women in danger overnight. It  forced healthcare providers to choose between following their sworn  oath to care for patients or facing criminal charges. It caused trauma  and suffering that cannot…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692969/dobbs-decision-anniversary"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…hours, and here they are on the  floor with an emergency censure to soothe Donald Trump's fragile ego. I  have never seen them leap into action so fast in my life. It was  overnight.\n\nMeanwhile, their own voters are getting hurt by this administration,  and it is radio silence. They can't even be  bothered to lift a finger or do a townhall.\n\nMr. Speaker,…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688503/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…with the long and late committee hearings as we  move forward on our reconciliation package and deliver substantial wins  for the American people. Like I mentioned, they were overnight, so  anybody that might have got caught snoozing for a few seconds here or  there, we don't want to be too hard on them since it was an all- nighter, and we are not in college…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691166/events-this-week"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…GDP and how we are at World War II levels while we  have largely been in peacetime. We have to take advantage of this.\n\nThis is not going to be easy. This is not going to be overnight. Yet,  with progrowth tax policy, which keeps our economy strong and keeps our  GDP moving in the right direction, we have an opportunity to limit some  of this spending.…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689152/advancing-america-first-policies"}, {"senator": "John Hoeven", "party": "Republican", "sentence": "…Governor of North Dakota in 2000, our State was producing  less than 100,000 barrels a day. We took that up to 1.5 million barrels  of oil a day. This doesn't just happen overnight. It is because we work  to provide the regulatory certainty to empower innovation and  entrepreneurial spirit to unlock the potential for energy development  in our State…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688157/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…bring up is that regarding DEI. DEI or Affirmative  Action has been a big part of America's landscape over the last 60  years, and it is not something that is going to go away overnight.\n\nPresident Trump can do what he can to wipe out this odious  philosophy, but nevertheless it is important for us to educate the  young people in this country as to why it…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689603/diversity-equity-and-inclusion"}, {"senator": "David Kustoff", "party": "Republican", "sentence": "…serving honorably as a  captain in the United States Marine Corps in Vietnam. After that  service, he returned home with a bold idea: a company that could  deliver packages overnight around the world.\n\nFred Smith turned that idea into a global enterprise, revolutionizing  international supply chains, transforming how businesses operate, and  changing…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692825/remarkable-life-and-legacy-of-frederick-w-smith"}, {"senator": "Morgan Luttrell", "party": "Republican", "sentence": "…gave terrorist groups a place to train,  organize, and plan attacks. You don't just swipe away the leadership  and make the terrorism go away. Those threats don't disappear  overnight, and we would be foolish to think otherwise.\n\nAlthough Syria's Government is in transition and terrorist  designations against its new leadership have been lifted, we must…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697014/syria-terrorism-threat-assessment-act"}, {"senator": "Vince Fong", "party": "Republican", "sentence": "…capacity per day, and refinery closures are projected to slash that  capacity by 20 percent over the next year. Twenty percent of our  refining capacity is going to disappear overnight.\n\nSince 2018, over 360 energy companies have left California. Oil  production has dropped by 47 million barrels over the past 5 years, and  foreign imports now account for…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697028/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…Rules. All classified documents or       materials removed from the Committee offices for such       authorized purposes must be returned to the Committee's SCIF       for overnight storage.\n\n9.3. ``Committee sensitive'' means information or material       that pertains to the confidential business or proceedings of       the Select Committee on Intelligence,…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688225/us-senate-select-committee-on-intelligence-rules-of-procedure"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…reductions at the island, I wrote  to Secretary of the Army Driscoll, made a site visit with him, and  spoke directly with the men and women whose skills cannot be replicated  overnight. This amendment cements their mission readiness. It prevents  talent loss, preserves irreplaceable know-how, and keeps our defense  industrial base resilient against any…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693676/department-of-defense-appropriations-act-2026"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…the door to real-time  surveillance of every financial transaction in America.\n\nExisting banking practices safeguard Americans' privacy. A CBDC could  undo that protection overnight, creating a tool ripe for abuse. Even  though the Constitution is clear, this bill restrains the Fed from even  considering a central bank digital currency, reinforces Congress'…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693733/anti-cbdc-surveillance-state-act"}, {"senator": "John Rose", "party": "Republican", "sentence": "…clubs that are  in many military installation youth centers. These programs include 4-H  positive youth development programming, engaging in hands-on learning  in day and overnight summer camps, including military team adventure  camps.\n\nWe, as a nation, ask so much of our military families. Frequent moves  can be especially difficult for children.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695237/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…short-term lodging, whether it is at hotels, motels,  inns, resorts, or rentals, make it harder for families to plan for a  trip.\n\nToo often, what looks like an affordable overnight stay online turns  out to be far more expensive once these deceptive charges are added.  Additionally, the way these prices are advertised are fragmented and  not uniform.…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690198/hotel-fees-transparency-act-of-2025"}, {"senator": "David Kustoff", "party": "Republican", "sentence": "…survey the damage and to meet with local  officials and residents. For the Rives community, recovering and  rebuilding is not going to be easy and is not going to happen  overnight.\n\nI am sure that my colleagues who have toured disaster areas in their  own districts know exactly what I mean.\n\nFor communities that have been impacted by disasters, it…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689382/filing-relief-for-natural-disasters-act"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…Project Funding is now coming home to southeast  Iowa, funding that has been signed into law and will soon begin making  a real difference on the ground.\n\nThis didn't happen overnight. It came after months of meetings with  local leaders, carefully reviewing community priorities, submitting  formal requests, and tirelessly advocating for these projects…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699896/delivering-for-iowa"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…has released  and said: We want to be able to move this.\n\nThis is recognition of a national monument for the Historic Greenwood  District in North Tulsa. In 1921, on May 31, overnight to June 1, there  was the worst race massacre in American history. It is a stain on our  American history, but it is also a moment to be able to look back to  and learn from.…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691662/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}]