[{"senator": "Angie Craig", "party": "Democrat", "sentence": "Ms. CRAIG. Mr. Chair, overdose deaths are preventable, and we should  be using all the tools at our disposal to save American families from  the pain of losing a loved one to opioids. It is past time we…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691877/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…already done in a temporary way.\n\nLet me read some of this pleading from Republican witnesses.\n\nRepublican witness Jaime Puerta, a courageous parent who lost his  child to an overdose, testified:\n\nIt is imperative that we educate our children on the       dangers of any kind of drug use due to the lethality that can       come with any kind of experimentation…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687971/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…Speaker, addiction is a public health  crisis from which no community is immune. We saw the worst of it in  2021, when, in a 12-month span, more than 110,000 people died of  overdose. That is 300 or more people a day, 365 days a year.\n\nHere is a small light. In 2024, overdose deaths fell by 27 percent.  We are finally seeing progress. That is a huge dent…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691500/gop-tax-scam-hurts-women-and-families"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…criminalize all FRS based solely on their  molecular structure. This would seriously hamper the medical community  from working on the development of treatments to fentanyl overdose or  other medically beneficial FRSs. The HALT Fentanyl Act also imposes  harmful mandatory minimum sentences. Decades of research shows that  mandatory minimum laws that focus…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692633/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…programs that the SUPPORT for Patients and Communities Act  reauthorizes.\n\nThanks to our efforts in recent years, significant improvements have  been made in combating the opioid overdose epidemic that has devastated  families in every community throughout our Nation, but those  improvements are now threatened as the Trump administration guts the  very programs…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691876/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Scott Peters", "party": "Democrat", "sentence": "…candidate studying biomedical sciences at UCSD. She  researches the neuroscience behind drug addiction so we can fight the  opioid crisis. Just as her field gained momentum--overdose deaths  declined in 2024 for the first time in over two decades--her lab was  threatened with funding cuts. Mari has watched her lifesaving research  be halted and had two…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695749/funding-cuts-to-science"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…claimed were carrying drugs. And, you know, that makes a little bit  more sense to the American people because there are thousands of  Americans that are dying every year due to overdose.\n\nBut those overdoses, as people know, are mainly from a drug called  fentanyl. Well, Venezuela doesn't produce any fentanyl. What Venezuela  produces and ships is cocaine.…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698610/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…journeyed here from a place where  there was no hope for a better future. Then, last week here in America,  very sadly, she attempted to take her own life with a fentanyl overdose  because she feared being arrested by Trump administration immigration  officials.\n\nShe could not imagine going back to the hell from which she had come.  Here with no help…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690052/trump-tariffs"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…communities I represent. They are essential for the  parents working two jobs while navigating recovery, for the young  people trying to build a future after surviving an overdose, and for  families trying to heal.\n\nLet's not kid ourselves. While Republicans bring this reauthorization  bill to the floor, they stand by as the Trump administration dismantles…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691873/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Sharice Davids", "party": "Democrat", "sentence": "…Intensity Drug Trafficking Area program, also  known as HIDTA.\n\nFar too many Americans have been tragically impacted by our nation's  opioid epidemic. Thankfully, there is hope. Overdose deaths dropped by  24 percent from September 2023 to September 2024, and while that's  something to celebrate, we have a long way to go.\n\nThe 33 regional HIDTAs across the…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693340/recognizing-the-crucial-work-of-the-high-intensity-drug-trafficking-area-program"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…alone, we treated 58,000 people with the care  that they needed in Colorado. This is 5 years with implementation. It  is the reason why we now have a 35 percent reduction in overdose deaths  in Colorado. It is overwhelmingly the reason.\n\nAddressing the Medicaid barrier is so important. Let me explain why.  People who struggle with the substance use disorder,…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691883/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…happened just last  night: President Trump canceled $2 billion in grants for the Substance  Abuse and Mental Health Services Administration. These were grants  intended to fund overdose prevention work in communities, to provide  lifesaving reversal drugs, and to fund treatment for people with opioid  addiction. These are the very programs that put people…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699116/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…created a fund to support statewide opioid treatment,  recovery, prevention, and education programs and shaped a law to ensure  that filling a prescription for lifesaving anti-overdose medication  would not create a barrier for Rhode Islanders getting life insurance.\n\nI am grateful, in particular, for Donny's leadership on climate. He  sponsored legislation…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691447/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…life upended.\n\nI start this letter again:\n\nIn the midst of our Nation's ongoing mental health crisis,       including its devastating impact on youth and our ongoing       overdose epidemic, it is paramount that access to lifesaving       MHSUD services is not reduced and the integrity of the       Medicaid Program to serve as a vital Federal and State…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Maggie Hassan", "party": "Democrat", "sentence": "…those, but today we will  advance, on a bipartisan basis, lifesaving legislation that we know is  working to combat fentanyl.\n\nNew data from earlier this summer found that drug overdose deaths  dropped 27 percent last year, compared to the prior year. Since the  advent of the opioid crisis, we now have a much better sense of what  works to prevent and treat…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695792/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Scott Fitzgerald", "party": "Republican", "sentence": "…are  delivering on a promise to stop the flow of deadly fentanyl that, for  years, has been flooding our communities and, tragically, tearing  families apart.\n\nToday, drug overdose is the leading cause of accidental death across  the country, and fentanyl-driven overdoses are the leading cause of  death for American adults between 18 and 45 years of…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692348/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…Cullen, who tragically lost their son,  Zach, to fentanyl poisoning. Unfortunately, they are not alone in this  pathway to pain. Last year, one Pennsylvanian died from an overdose  every 2 hours, with the overwhelming majority of these resulting from  fentanyl poisoning.\n\nWe owe it to our future generations to end this plague on our society  by passing…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692344/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Neal Dunn", "party": "Republican", "sentence": "…investments from the original SUPPORT for Patients and  Communities Act in 2018 and the efforts of the Trump administration, we  are finally starting to see a decrease in the overdose death rate.\n\nFlorida is a shining example of this progress. In Florida, pilot  programs have taken innovative steps, such as using long-acting  injectables to help fight opioid…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691878/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…addiction by  passing the SUPPORT Act. This legislation will ensure our brave first  responders can access and administer Narcan to save the lives of those  suffering from an overdose, as well as to continue the resources for  comprehensive opioid recovery centers to further support recovery.\n\nToo many of our Nation's citizens are stuck in the deadly cycle…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691745/nippon-steel-and-us-steel-merger"}, {"senator": "Carlos Gimenez", "party": "Republican", "sentence": "…either by al-Qaida, ISIS, and similar  ideologically linked terrorist groups.\n\nMeanwhile, since 2021--I am not talking about 2001--nearly 400,000  Americans have died from overdose poisoning, deaths fueled by foreign  terrorist organizations including the Venezuelan regime and violent  cartels operating in our own backyard. That 400,000 is about the…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698243/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Dave Joyce", "party": "Republican", "sentence": "…understand the importance of law enforcement  aggressively targeting traffickers and making sure that we are  addressing societal challenges of addiction.\n\nEach life lost to an overdose is a tragedy. We must declare war on  the drugs that are killing our kids in our community.\n\nMr. Speaker, I encourage my colleagues to support this bill and send  it to the…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692347/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…has more than a little to do with our national  security and our safety. I have heard from too many Arkansas mothers  and fathers whose children have died because of a  drug overdose. This operation was about protecting those families and  families like them, anyone who struggles with or who has lost a loved  one to addiction.\n\nAgain, Nicolas Maduro was…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698556/venezuela"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "Mr. STAUBER. Mr. Speaker, this is an important topic.\n\nAs a former police officer in Duluth, Minnesota, one of the worst  calls an officer can get is an overdose. When they go there, the  individual is deceased. They make sure that it was an overdose, that  nothing else took the life of that individual. Then, they have to  formulate…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691938/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "…support of S. 331, the  HALT Fentanyl Act.\n\nMr. Speaker, opioid overdoses have become an epidemic in this  country. Last year, over 100,000 Americans lost their lives to  overdose, and fentanyl poisoning is the driving force behind that.\n\nMr. Speaker, it is not just the country at large that has experienced  this problem. In my own district, we have…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692350/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Addison McDowell", "party": "Republican", "sentence": "…yielding.\n\nMr. Speaker, I rise today in support of my bill, H.R. 2351, which  will strengthen the ability of the United States Coast Guard to respond  effectively to opioid overdose situations.\n\nThe Coast Guard is on the front lines of the fight against fentanyl,  working to stop traffickers at sea and saving lives in the process.  This bill will ensure…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692171/controlled-substance-onboard-vessels"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…Commerce led the way on the original  SUPPORT for Patients and Communities Act 7 years ago under the  leadership of Chairman Greg Walden, the opioid crisis looked different.  Overdose deaths were largely driven by prescription and semisynthetic  opioids, like oxycodone and heroin.\n\nWhen the COVID-19 pandemic hit, government-enforced lockdowns hurt  patients…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691874/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…is critical legislation that will  increase penalties for the criminals who produce, traffic, and sell  this poison.\n\nIn 2023, one Pennsylvanian died every 2 hours from an overdose, with  the overwhelming majority of these resulting from fentanyl poisoning.  Our Nation has lost too many lives because of this deadly scourge on  our communities.\n\nIt is…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692145/doge-rescissions-package"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…President the authority to act.\n\nMr. MAST. Mr. Speaker, I would let the ranking member know that, just  in the last year in his district, he has lost at least 140 people to  overdose, which apparently he does not want to protect his community  from those like the President wants to protect his community.\n\nSalazar), the chairwoman of the Western Hemisphere…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698249/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "…responders, funding for prevention programs, funding for treatment  programs, funding for recovery services, and the efficacy of these  programs  is shown in the difference in overdose deaths that we have seen in this  country between when the program was first implemented in 2018 and last  year.\n\nWe have seen, Mr. Chair, a dramatic decline in overdose-related…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691879/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…He said, I am going to  err on the side of saving tens of thousands of American lives.\n\nMr. Speaker, I recently found out that I knew somebody whose son died  of a fentanyl overdose and how horrible that must be. The rest of their  life must be devastated. I am glad President Trump feels their pain,  and he is acting strongly in this situation.\n\nI thank…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698045/thanking-president-trump"}]