[{"senator": "Joe Courtney", "party": "Democrat", "sentence": "…associated structures.       Ms. Whitney Marsh,      ;rsted, Providence, RI.\n\nDear Ms. Marsh: Thank you for your participation in the       Mitigation Response Team to assess and overcome military       impacts from your proposed Revolution Wind project off the       coast of Squibnocket Beach in Chilmark, Massachusetts. In a       letter dated October 27,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695066/halt-work-orders"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize Eamon VanDyke  for earning the Arvada Wheat Ridge Service Ambassadors for Youth Award.\n\nEamon has overcome many challenges along his journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their education, like Eamon, develop crucial…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691744/recognizing-eamon-vandyke"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…Congress to be able to be the backstop at a moment when, for  whatever reason, a President made a decision that didn't serve the  American people properly or well.\n\nIf we can't overcome this veto, I think it would say that no bill is  safe and that the efforts of every single elected Member of Congress  would now be at risk to one person's view and one person's…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698766/9999"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize Pete Rapa for  earning the Arvada Wheat Ridge Service Ambassadors for Youth Award.\n\nPete has overcome many challenges along his journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their education, like Pete, develop crucial…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689458/recognizing-pete-rapa"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize Heyzel Perez  for earning the Arvada Wheat Ridge Service Ambassadors for Youth Award.\n\nHeyzel has overcome many challenges along her journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their education, like Heyzel, develop crucial…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691009/recognizing-heyzel-perez"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize Elijah Bertone  for earning the Arvada Wheat Ridge Service Ambassadors for Youth Award.\n\nElijah has overcome many challenges along his journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their education, like Elijah, develop crucial…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691148/recognizing-elijah-bertone"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize Nathan Angel  Perez for earning the Arvada Wheat Ridge Service Ambassadors for Youth  Award.\n\nNathan has overcome many challenges along his journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their education, like Nathan, develop crucial…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691983/recognizing-nathan-angel-perez"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize Omar Lautenbach  for earning the Arvada Wheat Ridge Service Ambassadors for Youth Award.\n\nOmar has overcome many challenges along their journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their education, like Omar, develop crucial…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689451/recognizing-omar-lautenbach"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize Alyssa Sayers  for earning the Arvada Wheat Ridge Service Ambassadors for Youth Award.\n\nAlyssa has overcome many challenges along her journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their education, like Alyssa, develop crucial…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691840/recognizing-alyssa-sayers"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize Thomas Dempster  for earning the Arvada Wheat Ridge Service Ambassadors for Youth Award.\n\nThomas has overcome many challenges along his journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their education, like Thomas, develop crucial…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691011/recognizing-thomas-dempster"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize Jayden Cordic  for earning the Arvada Wheat Ridge Service Ambassadors for Youth Award.\n\nJayden has overcome many challenges along his journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their education, like Jayden, develop crucial…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691472/recognizing-jayden-cordic"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize Jose Luis  Gonzalez Chacon for earning the Arvada Wheat Ridge Service Ambassadors  for Youth Award.\n\nJose has overcome many challenges along his journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their education, like Jose, develop crucial…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690363/recognizing-jose-luis-gonzalez-chacon"}, {"senator": "Rob Menendez", "party": "Democrat", "sentence": "…the call to 988. Yet this administration has eliminated funding for  those specialized services. These are blatant attempts to harm the  LGBTQ community that has already overcome so much and made incredible  strides towards equality.\n\nIt is here in this Chamber that we should be standing beside them and  fighting for them. When we are elected here…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693017/fighting-for-lgbtq-rights"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize Lili Pryor for  earning the Arvada Wheat Ridge Service Ambassadors for Youth Award.\n\nLili has overcome many challenges along her journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their education, like Lili, develop crucial…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691521/recognizing-lili-pryor"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…leave it in the ground--so many,  many challenges there. Despite Secretary Chu's Nobel Prize-winning  credentials and genuine commitment to scientific rigor, he failed to  overcome the systematic problems at Hanford.\n\nSecretary Moniz, a physicist Secretary, attempted to work around the  waste treatment plant's technical problems. His framework for tank…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695342/hanford-site-cleanup"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…embodies the true spirit of  cooperative values. The WREC team's journey inspires us all, proving  that with compassion and teamwork, even the most daunting challenges  can be overcome to light up lives and communities. I commend the entire  team for their efforts on this worthwhile endeavor and for their  ongoing service to our local community.", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692461/recognizing-alan-sowerby"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…embodies the true spirit of cooperative values. The WREC team's journey  inspires us all, proving that with compassion and teamwork, even the  most daunting challenges can be overcome to light up lives and  communities. I commend the entire team for their efforts on this  worthwhile endeavor and for their ongoing service to our local  community.", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692478/recognizing-michael-goodwin"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…feat in Ohio high school wrestling  history.\n\nJumping into the sport at just 4 years old, Makennah's passion for  wrestling grew over the years. She learned to persevere and overcome  any roadblocks or plateaus she hit during training. Makennah has said  that wrestling made her a tougher person, realizing that the harder she  pushed herself, the more she…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689346/joanna-sheaf-celebrates-100th-birthday"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…and Independents, favor keeping the commission.  This would seem to be a problem for Governor Newsom, as his plan to  push the commission aside requires voter approval.\n\nTo overcome this problem, to produce an artifact of voter approval  for a proposition our voters strongly oppose, the Governor has resorted  to two strategies: disenfranchising voters…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694777/protecting-representative-form-of-government"}, {"senator": "Ryan Mackenzie", "party": "Republican", "sentence": "…strategies, and ensure that critical information is  efficiently shared between agencies.\n\nInformation silos are not unique to the intelligence community, but  the need to overcome them is more acute. The consequences are far  greater if there are problems that arise. The intelligence community's  ability to detect and prevent attacks against our homeland…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696796/dhs-intelligence-rotational-assignment-program-and-law-enforcement-support-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…Mr. Speaker, when my friend and colleague, the  author of the amendment, Henry Hyde, first learned that about 1 million  children were alive because of his amendment. He was overcome with joy.  He had a tear in his eye. I was there when it happened, when he found  out that 1 million mothers were spared the agony of post-abortion pain,  and 1 million children…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698800/breaking-the-gridlock-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…lived out Kiwanis International's mission of  improving the world one child and one community at a time.\n\nChildren are our future, and too many face challenges they cannot  overcome alone. It is our responsibility as a community to step in, and  the State College Kiwanis has done just that.\n\nThrough initiatives like its annual blueberry sale, the club…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691117/recognizing-state-college-kiwanis-club"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…recruiting, licensing, and utilizing families who       reflect the racial and ethnic background of children in       foster care in the State, and the State's efforts to overcome       those challenges and barriers.\n\n``(6) The plan includes such other information relating to       foster and adoptive parent recruitment and retention as the       Secretary…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688405/recruiting-families-using-data-act-of-2025"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…Because when you look at the memorials here  in Washington, D.C., you have got the World War II Memorial, which is a  tremendous testament to our country coming together to overcome evil.  You have got the Korean War Memorial. For those of you who have been  there, the darkness of that memorial is evident in the expressions on  the faces of those soldiers…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692714/recognizing-national-post-traumatic-growth-day"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…embodies the true spirit of cooperative values. The WREC team's journey  inspires us all, proving that with compassion and teamwork, even the  most daunting challenges can be overcome to light up lives and  communities. I commend the entire team for their efforts on this  worthwhile endeavor and for their ongoing service to our local  community.", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692647/recognizing-jamen-monbarren"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…embodies the true spirit of cooperative values. The WREC team's journey  inspires us all, proving that with compassion and teamwork, even the  most daunting challenges can be overcome to light up lives and  communities. I commend the entire team for their efforts on this  worthwhile endeavor and for their ongoing service to our local  community.", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692614/9999"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…embodies the true spirit of cooperative values. The WREC team's journey  inspires us all, proving that with compassion and teamwork even the  most daunting challenges can be overcome to light up lives and  communities. I commend the entire team for their efforts on this  worthwhile endeavor and for their ongoing service to our local  community.", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692593/recognizing-patrick-sullivan"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…embodies the true spirit of cooperative values. The WREC team's journey  inspires us all, proving that with compassion and teamwork, even the  most daunting challenges can be overcome to light up lives and  communities. I commend the entire team for their efforts on this  worthwhile endeavor and for their ongoing service to our local  community.", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692444/recognizing-stephanie-wilson"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…served 22 years in the U.S. Army until an IED ended his  service and caused him to lose his vision. Despite this sacrifice, Mr.  Mittman made it a mission to move forward and overcome the challenges  his life presented.\n\nAs one of many accomplishments, in 2019, Mr. Mittman became the first  legally blind president and CEO of Bosma Enterprises, the largest…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695725/highlighting-the-work-of-jeff-mittman"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…embodies the true spirit of cooperative values.  The WREC team's journey inspires us all, proving that with compassion  and teamwork, even the most daunting challenges can be overcome to  light up lives and communities. I commend the entire team for their  efforts on this worthwhile endeavor and for their ongoing service to  our local community.", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692643/recognizing-travis-brown"}]