[{"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…likely vanish overnight.\n\nIn fact, the Urban Institute says that as many as 18.3 million  children will lose access to free school meals under these cuts.\n\nFood banks will be overwhelmed. Children will go hungry, and it will  have a domino effect: a domino effect on their education, a domino  effect on healthcare costs and healthcare outcomes, and a domino…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691770/151-days-without-a-vote-to-lower-costs"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…to make my departure. I traversed up to the doors and made my  exit as a means of protesting what the President was saying.\n\nHowever, Mr. Speaker, as I did this, I became overwhelmed with just  the notion that something was going to happen very ugly and it would be  something that would hurt people who are on Medicaid and Medicare. I  also brought up…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695807/censured-but-not-silenced"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…special needs won't get  the targeted resources that they need. If you are a kid or if you are  the parent of a kid who is getting help from a teacher who is not  otherwise overwhelmed by their workload, then you are a Medicaid  beneficiary.\n\nIf you cut Medicaid, a whole lot of hospitals will close. If you have  an operating hospital within driving distance…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691175/medicaid-benefits-all-of-us"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…will lose  coverage.\n\nThese cuts will make us less healthy and they will make us less  prosperous and less safe. Even if you are not on Medicaid, emergency  rooms will be overwhelmed with uninsured patients and your premiums and  healthcare costs will go up, as well.\n\nMr. Speaker, every American should speak out against these cuts to  Medicaid.", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690296/medicaid-is-americas-healthcare-safety-net"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…necessary trouble. I am going to try to honor the  legacy that I know I have inherited as an American, the legacy I think  about when I come to this floor and feel sometimes overwhelmed with all  of the sacrifice and struggle that had to get me here: good people who  caused good trouble in the face of slavery; good people who caused good  trouble in the…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…my home. I constantly worry about       losing my house and being unable to drive or work because my       driver's license and work permit are at risk of expiring.\n\nI am overwhelmed by the thought of not being able to work.       I have many bills to pay and two children who depend on me. I       respectfully pray that those in authority will take our…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699638/expert-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…who has  two beautiful children, Wylie and June.\n\nWylie, her youngest, was diagnosed with a rare genetic disorder at 18  months. Very quickly, Tiffany and her husband were overwhelmed with  medical bills, doctor visits, therapies, medical equipment, and  hospital visits.\n\nMr. Speaker, 10 hospital visits almost put them into bankruptcy.  Medicaid was a…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691477/gop-tax-scam-hurts-women-and-families"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…Gaza.  And she says:\n\nI am pregnant, but I have not eaten anything since       yesterday.\n\nDr. Mohammed Fadlalla of Doctors Without Borders says the Gaza  ``health  system is overwhelmed, and it's collapsing.'' And a Doctors Without  Borders report says that doctors and nurses are doing their best with  dwindling supplies amidst ``near-daily mass casualty…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694437/providing-for-congressional-disapproval-of-the-proposed-export-of"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…computer  company he just bought, is going to try to be paid by the government to  manage those accounts.\n\nDOGE has created serious tech problems, gutted the staff, and  overwhelmed call centers, creating much confusion in their wake.\n\nAmericans should pay attention to their Social Security. They earned  these benefits, and nobody else has a right to…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689396/trump-administration-lies-about-social-security"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…of this letter damaged  the very thing they claim to be fighting for.\n\nI am confused, perplexed, flummoxed at what the heck is going on. It  is extraordinary.\n\nI am just overwhelmed by the amount of correspondence. I had to just  pick out the ones that were the most extraordinary to make sure they  were entered in the Record.\n\nThe most recent one on…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…will burden nearby offices and stretch resources very thin.  It will make it harder for businessowners to get the help they need  when they need it. Newark's office would be overwhelmed if the New York  City office closes.\n\nThis bill weaponizes Federal resources to hurt cities that have made  the choice to protect immigrant communities. This is unjust.…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692101/save-sba-from-sanctuary-cities-act-of-2025"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…CLEAN DC Act is essential to restoring public safety in our  Nation's Capital. For far too long, Washington, D.C., a city meant to  embody freedom and prosperity, has been overwhelmed by violent crime.  As millions of people visit D.C. every year, it is imperative that our  Nation's Capital is safe for all residents and visitors. Yet, in recent  years,…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696932/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…SCHMITT. Mr. President, I rise today to engage in this great  debate that is raging across our country. Turn on the TV, read the  newspapers, or open your phone, and you will be overwhelmed by the  back-and-forths over tariffs, trade deficits, prices, and markets.\n\nWe hear the talking heads say that America simply can't afford  President Trump's insistence…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690533/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…American  taxpayers an estimated $160 billion a year. It flooded classrooms with  non-English-speaking students, packed emergency rooms with illegals  demanding care, and overwhelmed homeless shelters and food banks meant  to help Americans. Worst of all, the most violent and dangerous  criminal gangs in the world accompanied this population into our…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694126/sorry-not-sorry-for-immigration-enforcement"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…Security. That is not, I think, what is normally meant by a  single parent.\n\nOverall, when we go down this path, we have more and more people in a  difficult situation who can be overwhelmed by this. It can hurt their  children. I think studies will show various measures of success or  failure, and it is much more difficult with a single-parent lifestyle.  Something…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700071/issues-of-the-day"}, {"senator": "Nicholas LaLota", "party": "Republican", "sentence": "…secure Federal contracts. Mr.  Speaker, 0.22 percent is just 1 in every 446 contracts. That is all.\n\nWhen small businesses are shut out from opportunities because they  are overwhelmed by the language, we don't just lose a bidder. We lose  innovation. We lose local job creation. Oftentimes, we lose a better  price.\n\nThe government should facilitate small…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691851/plain-language-in-contracting-act"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…tell part of the story. Joanne always helped  seniors with Social Security, families navigating economic assistance  during COVID, veterans, and countless others who felt overwhelmed and  unheard until Joanne stepped in.\n\nShe didn't just do what we call casework. She actually changed lives.  Joanne treated every constituent with dignity, persistence,…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698569/recognizing-and-thanking-joanne-horn"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…unvetted and largely impoverished population of nearly 8 million to  illegally enter our country--a population the size of Washington State.\n\nThis illegal mass migration has overwhelmed our public schools,  public hospitals, homeless shelters, food banks, and law enforcement,  and it is costing American taxpayers $160 billion a year to support.  Worst of…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688130/birthright-citizenship"}]