[{"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…bill. With this legislation, we ensure that NTIA has the  authorities it needs to continue connecting all Americans to high- speed, reliable, and affordable broadband and overseeing innovative  technology development.\n\nMrs. DINGELL.  Matsui), the ranking member of the Communications and  Technology Subcommittee and a leader in this field.\n\nMrs. McCLAIN…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690254/national-telecommunications-and-information-administration-reauthorization-act-of-2025"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…federal government under four administrations--both       Democrat and Republican.\n\nCurrently, I serve as the Acting Assistant Administrator       for Global Health at USAID, overseeing approximately $10       billion annually appropriated by Congress to strengthen       health systems to:\n\nPrevent and respond to infectious diseases,\n\nimprove maternal and…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691139/us-global-health-programs"}, {"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "…May 1996, earning promotions to Laborer Foreman and Crew  Supervisor. In these positions, he was responsible for managing job- site teams, ensuring safety compliance, and overseeing the timely and  effective completion of construction projects. In April 1999, Mr.  Thomas was appointed Secretary-Treasurer of Local 264, where he managed  financial operations,…", "date": "2025-06-20", "source_url": "https://justfacts.votesmart.org/public-statement/1692686/recognizing-reginald-l-thomas-for-his-distinguished-service-to-laborers-local-264-and-the-missouri-afl-cio"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…this one, I think the stakes are  particularly high. At the Department of Energy, the DOGE-Musk cuts led  to hundreds of employees being fired. They were responsible for  overseeing our nuclear weapons stockpile. That set of moves caused a  massive counterintelligence disaster and a logistical train wreck.  After realizing these employees were indispensable,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691398/motion-to-discharge-s-res-195"}, {"senator": "Adam Gray", "party": "Democrat", "sentence": "…to Madera and was elected to serve as the  Madera County Sheriff. In 2020, the Madera County Board of Supervisors  appointed Mr. Varney as County Administrative Officer, overseeing 25  county departments and a half-billion-dollar budget.\n\nCOVID hit almost as soon as he was hired, and Mr. Varney found  himself navigating Madera County through one of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694999/recognizing-jay-varneys-retirement"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…it, they were forced to  withdraw the nomination.\n\nMr. Speaker, imagine everyone's surprise when Donald Trump decided to  then make him the United States pardon attorney overseeing a large  office of people considering pardon applications from across the  country.\n\nIs that someone that I think can be trusted to deal fairly in terms  of minority groups,…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691194/calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism-and-educate-the-public-on-the-contributions-of-the-jewish-american-community"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…the St. Vincent de Paul Hope  Conference and the Interstate Faith Council of Contra Costa.\n\nGwen also served as the president of the League of Women Voters  Diablo Valley, overseeing the ``You Don't Need a Home Vote'' project.  In addition, in that position on the League of Women Voters, she  facilitated candidate forums. I remember many years ago when…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692306/recognizing-gwen-watson"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…stability, ensuring that every student has the opportunity to thrive.\n\nI want to especially recognize Superintendent Dr. Alejandro Ruvalcaba  for his outstanding leadership in overseeing this project. His  dedication, and the dedication of the entire district, has made this  Center a reality and reflects Moreno Valley Unifier's belief that  education is not…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695914/congratulating-the-moreno-valley-unified-school-district-health-and-wellness-center"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…Airman for  Space Base Delta 2 at Buckley Space Force Base in my home state of  Colorado. In this crucial role, she was the principal advisor to the  installation commander, overseeing the morale, welfare, training,  climate, readiness, and professional development of over 1,000  personnel. Her leadership was instrumental in ensuring the effective  execution…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692495/recognizing-the-service-of-chief-master-sergeant-sharma-j-haynes"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…effective shipping strategy in maintaining our Nation's presence and  economic viability in the international market.\n\nAs the Department of Transportation is responsible for overseeing the  majority of American maritime shipping, both domestically and globally,  there is no reason why the Department cannot and should not set an  example that is meaningful.…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692188/american-cargo-for-american-ships-act"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…funds unless an academic institution agrees to adopt his cultural  agenda or fire certain faculty or allow it to have some kind of a  monitor, some kind of a Big Brother overseeing what takes place in our  universities, it is a sign of a democracy in decline.\n\nNo. 3, when an administration, when a ruler goes after the right of  representation by attacking…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696336/trump-administration"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…organizing this group of Senators,  Senator Reed, who is not only the ranking member of the Armed Services  Committee but is the ranking member of the Appropriations subcommittee  overseeing funding for this space.\n\nI rise today, with my colleagues, out of grave concern for the future  of our democracy.\n\nI currently serve as the ranking member of the Senate Rules…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690535/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Chellie Pingree", "party": "Democrat", "sentence": "…New York Times reports that budget documents describe needed  maintenance, yes, but nothing that required shutting down the entire  institution. In fact, the very official overseeing facilities said that  just 2 months ago, there were no serious discussions about closing the  Center.\n\nWhat changed? What changed is that the Center could no longer sustain…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699704/changes-at-the-kennedy-center"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…upstanding immigration officials. No. These labels were applied by the  highest ranking officials of this operation in President Trump's White  House--the Cabinet Secretary overseeing these raids, Kristi Noem; the  architect of this campaign of fear and mass arrest and detention, the  ``racist in chief'' Stephen Miller.\n\nThis impunity that we see on our…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699422/9999"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…a 10 percent tax on  energy imported from Canada, hitting Midwestern States with higher gas  prices.\n\nIn April, the Trump administration abruptly fired the entire staff  overseeing the low-income Home Energy Assistance Program, which helps  working families afford their utility bills. Weeks later, the White  House proposed cutting it entirely.\n\nIn May,…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697027/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…appropriated to  DOE.\n\nMr. Speaker, this bill passed the House with unanimous support in the  118th Congress and is a prime example of the bipartisan backing for  Congress' role in overseeing transparent and efficient spending by  Federal agencies. I thank Representative Obernolte for leading this  legislation again in the 119th Congress and Representative Foster…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688929/cost-share-accountability-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…indicted for  interfering with law enforcement, and not just interfering with law  enforcement, interfering with ICE, the law enforcement personnel which  she is charged with overseeing in her service on the Committee on  Homeland Security.\n\nI know the gentleman rightfully brought that matter before the House.  My colleagues will continue to address that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695203/people-are-sick-and-tired"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…He  supported buoy tending and lighthouse operations throughout the Great  Lakes and later coordinated extensive search and rescue efforts across  large maritime regions, overseeing thousands of cases while leading and  mentoring Coast Guard personnel.\n\nUpon promotion to Chief Warrant Officer, Mr. McInnis assumed officer- level responsibilities across…", "date": "2025-12-19", "source_url": "https://justfacts.votesmart.org/public-statement/1698462/recognizing-united-states-coast-guard-cwo4-james-mcinnis-as-december-2025-veteran-of-the-month"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…for Medicare & Medicaid Services (CMS), within the Department       of Health and Human Services (HHS), is responsible for       maintaining the federal Marketplace and overseeing state-      based marketplaces. Under PPACA, states may elect to operate       their own state-based marketplace or to use the federal       Marketplace. These marketplaces…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698800/breaking-the-gridlock-act"}, {"senator": "Dave Joyce", "party": "Republican", "sentence": "…interdiction and  fentanyl tracking efforts.\n\nIn conclusion, this bill funds critical government agencies and  programs and preserves and protects Congress' responsibility of  overseeing how these funds are being used.\n\nMr. Chair, I urge my colleagues to vote ``yes.''", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699055/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…Texas stations, including as OIC Postmaster.\n\nIn 2022, Mrs. Maddalena was appointed Manager of Consumer Affairs for  the Southern Area, Texas One. In this role, she excels at overseeing  customer policies, managing interactions with government offices,  analyzing surveys and CRM systems, while fostering cooperative  relationships. Her ability to work seamlessly…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695488/recognizing-the-contributions-of-trellis-maddalena"}, {"senator": "Ronny Jackson", "party": "Republican", "sentence": "…audiences and was  responsible for testing and executing crisis communication plans and  procedures, serving as the base liaison with state and federal  legislators, and overseeing a $1.3 million audiovisual contract.\n\nDuring his tenure, Mr. George Woodward led public relations efforts  on critical developments at Sheppard Air Force base, such as the…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693070/recognizing-the-career-of-mr-george-woodward"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…member of the Honor Guard and an adult volunteer with the  Waco Young Marines.\n\nRecently, she made history as the first Native American female  Commander of VFW District 29, overseeing seven posts in Texas. Nola is  also a proud mother of four successful children, all of whom have  pursued higher education or military service. Nola Saldana exemplifies…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696264/recognizing-nola-jane-saldana-with-a-congressional-veteran-commendation"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…and three statewide  committees before retiring from active participation. During a hiatus  from real estate, he also served as a law firm area manager for eleven  years, overseeing operations across three West Texas counties.  Throughout his life, Tom has demonstrated a consistent dedication to  improving the communities he serves.\n\nIt is my honor to…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698289/recognizing-the-success-of-tom-crowley"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…Before the rally, a campaign  staffer asked Secret Service to modify the plan, and the advance team  did as the staffer requested.\n\nBut they didn't notify senior officials overseeing the rally of these  changes. If they had, the senior officials might have overruled them.\n\nWhile the report says the Secret Service has made changes to correct  some of these…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693512/one-year-anniversary-of-trump-assassination-attempt"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…qualification. In 2005, he reported to the Marine  Aviation Detachment at Naval Air Weapons Station China Lake,  California. There, he served as the Administrative Chief, overseeing  administrative operations for both China Lake and Point Mugu.\n\nTimothy continued his distinguished career as the Administrative  Chief for Marine Special Operations within…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693985/recognizing-united-states-marine-sergeant-major-timothy-babcock-as-august-2025-veteran-of-the-month"}, {"senator": "Rudy Yakym III", "party": "Republican", "sentence": "…running on time. While I may be biased, I truly believe that  Mariah is one of the very best.\n\nWhether it was fitting 47 meetings in 2 days, managing our intern  program, overseeing travel logistics, or simply keeping the office  running smoothly, Mariah did it all with excellence. Her calm under  pressure, strong organizational skills, and unwavering…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693053/commending-michael-kraan"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…for Medicare & Medicaid Services (CMS), within the Department       of Health and Human Services (HHS), is responsible for       maintaining the federal Marketplace and overseeing state-      based marketplaces. Under PPACA, states may elect to operate       their own state-based marketplace or to use the federal       Marketplace. These marketplaces…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698381/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…advancing from IT  Programmer to Senior Systems Analyst and ultimately Manager of IT  Operations. He later worked for Alcoa Inc. as Site Conversion and  Development Lead, overseeing software conversions, and for Cooper Tire  and Rubber Company as a Systems Analyst. Gary applied his expertise in  healthcare technology at the Collom & Carney Clinic in…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696861/recognizing-congressional-patriot-award-recipient-gary-singleton"}, {"senator": "Laurel Lee", "party": "Republican", "sentence": "…Cybersecurity and Infrastructure Security Agency with support from  the Federal Bureau of Investigation.\n\nThis task force will bring together the agencies responsible for  overseeing individual sectors, the intelligence community, and other  Federal partners. The purpose is to ensure that all relevant entities  are sharing information, planning together,…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696758/strengthening-cyber-resilience-against-state-sponsored-threats-act"}]