[{"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…facilities to  increase their toxic emissions up to just below the legal limit,  endangering the health of American communities.\n\nThe cruelty of the Republican majority cannot be overstated. Let me  be clear. The dangerous air pollution this rule protects us from can  cause cancer, birth defects, developmental disorders, and neurological  problems, even at small…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691591/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…neighbors walk side by side to honor loved ones and to break the stigma  that has for too long silenced conversations about mental health. The  impact of this work cannot be overstated: in Virginia, more lives are  lost to suicide each year than to car accidents, and the need for  accessible, compassionate support is urgent.\n\nThanks to the dedication of…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696049/recognizing-the-18th-annual-out-of-darkness-walk"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…broader goal to dismantle the VA  system itself, aligning with Project 2025's dangerous objective to  privatize veterans' healthcare. The consequences of this cannot be  overstated.\n\nEqually troubling is the underfunding of military construction,  particularly housing and childcare. These are not luxuries. They are  necessities. A stable home and quality…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692954/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…resolution. It would open up  ecologically sensitive, culturally important, and incredibly remote  regions of the Arctic to oil and gas drilling.\n\nDrilling proponents have grossly overstated how much oil industry  interest there is in drilling in the Coastal Plain of the Arctic  refuge. The Arctic is an extremely remote and harsh environment  requiring specialized…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696832/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…The Director of NSA has another job, that of Commander of U.S. Cyber  Command. The demands of this job are mind-boggling. The cyber threat to  the United States cannot be overstated. And, as SALT TYPHOON  demonstrated, our adversaries have succeeded in inflicting serious  damage to U.S. national security. The Commander of CYBERCOM needs to  have a sophisticated…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700213/nomination-of-ltg-joshua-m-rudd"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…acknowledged       that Musk's U.S. DOGE Service is really in charge, pushing a       single-minded mission to find benefits fraud despite vast       evidence that the problem is overstated. The turmoil is       leaving many retirees, disabled claimants, and legal       immigrants needing Social Security cards with less access or       shut out of the system…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689130/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…essential  for Arctic operations, brigade-level exercises, missile defense  testing, and joint training with our allied forces.\n\nThe importance of this legislation cannot be overstated. It is vital  that we continue to allow the Army to use these unique areas. Fort  Greely and Fort Wainwright in Alaska have the only Arctic training  environments in this…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697636/public-lands-military-readiness-act-of-2025"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…our country and get us back on  track is the beautiful reconciliation bill that Republicans have been  working on diligently to get to President Trump's desk. It cannot be  overstated. Our debt crisis is out of control.\n\nWhen I was first sworn into office in 2010, our Federal Government  had $9 trillion of debt. When I left temporarily in 2017, despite…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690786/big-beautiful-bill"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…by foreign sources or any  donation of foreign transactions between the school and a foreign  entity.\n\nThe dangers of foreign influence in American K-12 schools cannot be  overstated. They threaten our national security, compromise our  geopolitical interests, and erode our academic freedom.\n\nAmerican schools are not for sale, and they are for education,…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697439/transparency-in-reporting-of-adversarial-contributions-to-education-act"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "Mr. LAWLER. Mr. Speaker, I rise today to recognize and thank someone  whose impact on my office and on me personally cannot be overstated, my  chief of staff, Nate Soule, as he concludes his service to New York's  17th Congressional District.\n\nWhen I first ran for the New York State Assembly in 2020, before…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699118/recognizing-and-thanking-nate-soule"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…rules would incentivize much-needed investment  throughout the State or the entire North Slope.\n\nThe regional impacts of increased energy production in Alaska cannot  be overstated. Refineries in the region, including California and  Washington, are equipped to handle Alaskan oil, and the refinery in  Kenai produces most of the State of Alaska's gasoline.…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696834/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…eligible to donate, and only 3 percent of those eligible give blood  annually. The critical need for blood and the lifesaving potential that  comes with a donation cannot be overstated.\n\nMr. Speaker, I encourage all healthy Americans to consider giving  blood or plasma. A single act of generosity can make all the difference  for someone in need.", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688473/recognizing-red-cross-month"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…Mathematical and  Statistical Modeling Education Act, sponsored by my colleagues  Representatives Houlahan and Baird.\n\nThe importance of STEM education to our economy cannot be overstated.  The National Science Board's 2024 Science and Engineering Indicators  report estimates that our country's STEM workforce constitutes 24  percent of all U.S. jobs. Further…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688976/mathematical-and-statistical-modeling-education-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…inputs  for our manufacturers, and products imperative for the maintenance of  our defense systems.\n\nThe national security component of a viable refining industry cannot  be overstated, and we must not forfeit these essential supply chains.\n\nUnder the previous administration, we saw the impact of an energy  retreat: higher prices for families and businesses,…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697031/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Russ Fulcher", "party": "Republican", "sentence": "…engineers, electricians, mechanics, and more. 18 million women answered  the call of their Nation in its time of desperate need. The impact they  had on our country cannot be overstated. In Idaho, civilian women  worked and volunteered at the Farragut Naval Training Station located  in North Idaho, which was built shortly after the attack on Pearl  Harbor…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697728/world-war-ii-womens-memorial-location-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…dealing a severe blow to America's  energy security and threatening Montana jobs and economic growth.\n\nThe national security and economic importance of this region cannot  be overstated. Montana holds nearly 30 percent of our Nation's coal  reserves. In total, coal from the Powder River Basin produced in  Montana and Wyoming makes up about 85 percent of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694888/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…was on an  ObamaCare plan and couldn't go to the best cancer hospital in the world  because she was covered under ObamaCare.\n\nThe failure of our healthcare system cannot be overstated. Both  parties need to step to the table to get government out of the way and  to allow doctors and patients to be able to go get healthcare from a  provider of their choice--not…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690387/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…quite meet that threshold but know that they will be next, who have  already left or are looking at an exit strategy.\n\nThe consequences of this growing exodus cannot be overstated when it  comes to the future of our State. Number one, with all of these high- net-worth individuals leaving, they are, of course, taking all of the  taxes that they pay…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699151/misguided-policy-in-california"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…Speaker, I thank my colleagues on both sides of the aisle for  working to improve transparency and congressional oversight of U.S.  export controls. It is vital. That can't be overstated enough. It is  vital.\n\nI urge all Members to vote in favor of H.R. 1316, and I yield back  the balance of my time.", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690696/maintaining-american-superiority-by-improving-export-control-transparency-act"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "…Their contributions  are important to the legacy of this Nation.\n\nThe importance of showcasing women's achievements, sharing our  stories and teaching our history, cannot be overstated. Women's History  Museum offers young girls the opportunity to see themselves in history  as active agents of change. When we teach the history of women, we are  teaching…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689363/womens-history-month"}]