[{"senator": "George Latimer", "party": "Democrat", "sentence": "…Bronx--specifically, in Co-op City--we have a public debt of  gratitude that we owe to the Co-op City Times, which is serving the  40,000-plus people who reside there.\n\nOwned and operated by the Riverbay Corporation, the Co-op City Times,  led by Rozaan Boone, editor-in-chief, and her team of reporters, covers  the work of the Co-op Board of Directors…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698631/recognizing-co-op-city-times"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…conduct and take action, frankly, on Kimmel, or  there is going to be additional work for the FCC ahead.''\n\nGiven that the FCC licenses all ABC stations, both stations owned and  operated by Disney and third-party-owned  ABC affiliates, this threat carried real weight. Licenses can be  revoked by the agency, wrecking a company.\n\nThe threat sparked Nexstar…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695754/guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…and information systems and operational technology       systems, including either or both of such systems using       artificial intelligence, that are maintained, owned, or       operated by, or on behalf of, the eligible entity, or, if the       eligible entity is a State, local governments within the       jurisdiction of the eligible entity, and…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696787/protecting-information-by-local-leaders-for-agency-resilience-act"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…subsection; or\n\n(G) any other group, person, or entity as the Securities       and Exchange Commission may determine by rule;\n\n(2) that is not held in any facility that is owned or       operated by a religious organization, other than an       institution of higher education that is accredited and       operated primarily for post-secondary education;\n\n(3)…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692725/helping-angels-lead-our-startups-act-of-2025"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…Pennsylvania. Mr. Speaker, I rise today to recognize the  75th anniversary of the DeGol Organization, which is headquartered in  Altoona, Pennsylvania.\n\nThe origins of the family-owned and -operated enterprise date to 1950  when  Bruno and Lena DeGol produced a masonry plant in Cambria County.\n\nToday, the DeGol Organization includes Seven D Wholesale, DeGol  Carpet,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699740/confronting-the-disease-of-addiction"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…roll back burdensome regulations and lower costs. This  week, we have an opportunity to do so.\n\nThe small businesses that make up the Big First are often small,  family-owned and -operated mom-and-pop shops. They don't manage or run  their small businesses to be billionaires or to become ultrawealthy.  Their goals are to serve their communities, meet a…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697294/national-guard-shooting"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…retail options. It is not uncommon for a  convenience store to bridge that gap in providing food to American  families.\n\nThese same small businesses, which are often owned and operated by a  single family or an individual, cannot afford the new equipment  mandated by these unreasonable standards. In fact, 90 percent of food  and drink retailers are…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689265/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers"}, {"senator": "Tom Kean, Jr.", "party": "Republican", "sentence": "…provided lasting entertainment and fun in the Northern New Jersey area  for over seven decades. Since its founding in 1954 by Herman Maier, the  park has remained family-owned and operated, with the Maier family  upholding the same high standards of excellence and service that have  defined it from the beginning. These high standards also earned the  Land…", "date": "2025-08-19", "source_url": "https://justfacts.votesmart.org/public-statement/1694751/recognizing-the-land-of-make-believe-the-worlds-greatest-amusement-park"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…drop-down changing surfaces.\n\n``(3) Covered passenger rail train.--The term `covered       passenger rail train'--\n\n``(A) means a passenger rail train that--\n\n``(i) is owned and operated by the National Railroad       Passenger Corporation (commonly known as `Amtrak'); and\n\n``(ii) was solicited for purchase after the date of the       enactment of the…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692155/baby-changing-on-board-act"}, {"senator": "Tom Kean, Jr.", "party": "Republican", "sentence": "…provided lasting entertainment and fun  in the Northern New Jersey area for over seven decades. Since its  founding in 1954 by Herman Maier, the park has remained family-owned  and operated, with the Maier family upholding the same high standards  of excellence and service that have defined it from the beginning.  These high standards also earned the Land…", "date": "2025-08-26", "source_url": "https://justfacts.votesmart.org/public-statement/1694756/recognizing-the-land-of-make-believe-the-worlds-greatest-amusement-park"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…a Bronze Star and  the French Legion of Honor, as well as several other medals.\n\nAfter completing his military service, he started O.H. Mullen Sales  in the 1950s and owned and operated the business until the mid-1980s.  His company manufactured, sold, and distributed archery equipment. He  married Luella Conley on October 24, 1942, and they were together…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692278/special-recognition-of-the-life-and-service-of-orval-mullen"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…second oldest  in the United States.\n\nThe company attributes its longevity to its superior staffing. The  Talladega Insurance Agency is built on family, as it is a family-owned  and operated business and has had four generations leading the way. In  the 1920s, Turner Joel Jones acquired the Talladega Insurance Company  renaming it Talladega Insurance Agency…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700098/recognizing-the-170th-anniversary-of-talladega-insurance-company"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…can come to the U.S. the right way,  work hard, make an honest living, and succeed. That is what it is all  about.\n\nMany of the small businesses I represent are family owned and  operated. As the fifth generation to grow up on my family farm and  feedyard in western Kansas, I understand the immense sense of pride and  gratitude that comes with growing…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690715/help-small-businesses-thrive-again"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…records, including but not       limited to manifests, itineraries, pilot records, and customs       or immigration documentation, for any aircraft, vessel, or       vehicle owned, operated, or used by Jeffrey Epstein or any       related entity.\n\n(4) Individuals, including government officials, named or       referenced in connection with Epstein's criminal…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696818/epstein-files-transparency-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…wish to highlight a teacher from Placer  County, Tina Angell, who has dedicated the past 8 years of her career  to educating the students of her community.\n\nMiss Angel owned and operated her own business before going to work  for the Placer County Office of Education. She then obtained her Career  Technical Education credential, focusing on business and…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Mike Simpson", "party": "Republican", "sentence": "…Idaho and Oregon in  1942 and 1943, one of very few women in the Northwest to do so.\n\nMargaret and Art had three children: Robert, Ann, and Perry. After  the war, they owned and operated a drug store in Nampa, Idaho. Since  the drug store was open six days a week, there was no vacation time.  After three years they sold the drug store, and took a vacation…", "date": "2025-04-21", "source_url": "https://justfacts.votesmart.org/public-statement/1690129/recognizing-the-108th-birthday-of-margaret-elizabeth-mortensen"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…implementation and feasibility of       each such plan.\n\n(e) Definitions.--In this section:\n\n(1) Property concerned.--The term ``property concerned''       means any real property owned, operated, or leased by the       Coast Guard within a tsunami inundation zone.\n\n(2) Tsunamigenic event.--The term ``tsunamigenic event''       means any event, such as an earthquake,…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}]