[{"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…livestock and various crops, and he created Carter's Farm  Peanut Butter, which proudly sold in Walmart and Kroger stores--a  historic accomplishment for an African-American-owned agribusiness.\n\nPatriotically committed to public service, he became the first  African-American man to run for County Commissioner in Lee County,  Georgia. Although he won…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692741/in-memory-of-overseer-roosevelt-carter-i"}, {"senator": "Adam Gray", "party": "Democrat", "sentence": "…community of Merced in 1995 where she has resided for 30 years. She  earned her Associate of Arts degree in Criminal Justice from Merced  Community College in 2012. Ms. Fragoso has owned the Farmers Insurance  Agency in downtown Merced, with more than 20 years of insurance  expertise.\n\nDuring her tenure at the Merced County Hispanic Chamber of Commerce,  Ms.…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695992/recognizing-annissa-fragoso"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…election  comes, we are going to see what happens.\n\nMr. Speaker, the gentleman said something about what was happening in  New York with the mayor, and he mentioned government-owned grocery  stores. First of all, my colleague won't admit that groceries are too  high and that families cannot afford the cost of eggs and basic good  foods to have great nutrition…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697150/denouncing-the-horrors-of-socialism"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…purposely priced to keep working families out, and  covenants were later added to many of the property deeds in Chevy Chase  explicitly prohibiting the land from ever being owned by African  Americans or Jews. These covenants have since been declared void.  Newlands went further to keep Black and White Americans separate. In  the late 1800s, he and…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694054/francis-g-newlands-memorial-removal-act"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…landscapers, retailers, and more. Over  the past 60 years, Applewood Seed has emerged as a top flower seed  supplier in the Nation, all while staying true to its roots as an  employee-owned company.\n\nIn addition, Applewood Seed has evolved into a company dedicated to  innovation within its field with research and development gardens, an  extensive network of seed…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695842/recognizing-applewood-seed-company"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…Saudi Government, will host a tournament at Trump National Doral  resort later this year, and the Trump Organization has announced new  real estate developments on government-owned land in Serbia and  elsewhere.\n\nNow, there is a kind of fundamental principle here, and it goes back  to the Founders. The American President is supposed to work for the  American…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691071/9999"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…individuals  enter Heaven is a discussion for a more theological venue.\n\nUnlike prior iterations of this bill, the current bill prohibits demo  days from taking place at facilities owned by religious institutions.  That is what is prohibited. It allows both Native American Tribes and  startup incubators to host them.\n\nI am aware of several instances where bad…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692724/helping-angels-lead-our-startups-act-of-2025"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…With its rich history, the DACOR Bacon  House stands as a powerful symbol of our Nation's commitment to  diplomacy and the rule of law.\n\nThe House was built on land previously owned by David Burnes, a  Revolutionary War veteran whose other real estate holdings were used  for key national landmarks, including the White House and National  Mall.\n\nThe House's…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692065/recognizing-the-dacor-bacon-house-bicentennial-day"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…why, on its 39th birthday, Senator Grassley and I wanted to  highlight how important it is for all television providers, including  major streaming services like YouTube TV, owned by Google, and Hulu +  Live TV, owned by Disney, to provide the American public with C-SPAN  and the opportunity to see their government work on the Senate floor.\n\nIf you look…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691704/senate-resolution-259-recognizing-june-as-the-39th-anniversary-of-c-span-chronicling-democracy-in-the-senate"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…billion to 1,142 small businesses and startups across the country,  creating or sustaining more than 130,000 jobs. Importantly, financing  provided by SBIC-licensed funds to women-owned, minority-owned, and  veteran-owned small businesses totaled almost $670 million in 2023, a  25.7 percent increase from 2022.\n\nYet, we must do more to ensure the program continues…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687917/investing-in-main-street-act-of-2025"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…long recognized in  terms of its value, and we have protected it as part of our American  heritage.\n\nYet, the Boundary Waters have been under threat for years. Twin  Metals, owned by Antofagasta, a Chilean mining company with close ties  to China, has been lobbying for years to set up a mine just outside the  wilderness area, along the banks of waters…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699273/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…like rural, veteran, and low-income  small business owners.\n\nI will never forget visiting one of these businesses in Santa Monica,  California. It was a salad-based restaurant owned by two young Hispanic  men who had this dream of expanding their restaurant, but they were  turned away by every traditional bank due to a lack of assets and  credit history.…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692070/capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…capital for  underserved and under-networked entrepreneurs. This bill modernizes  outdated rules that have made it especially hard for Black and Brown  founders and minority-owned small businesses to meet investors, to  participate in community investment events, and raise early capital.\n\nThe INVEST Act broadens who can responsibly participate in private…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697829/increasing-investor-opportunities-act"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…people in my life, the little people in my world to be  able to go and visit a natural reserve or to go to one of our national  parks and monuments and see that it is still owned by the United  States, that we haven't sold it to some corporation or, God forbid,  some other country, someone with the highest bid.\n\nWe are selling that land, and the proceeds…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691088/big-backstabbing-bill"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "Ms. KAPTUR. Mr. Speaker, I rise with an urgent plea for small,  family-owned farms, especially across the American heartland and  communities I represent. Seven of the eight counties I represent in  northwest Ohio are predominantly rural and home to…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699499/a-plea-for-small-family-owned-farms"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…hardworking Utahns who brought home a world  title--Team Utah from Papa John's, winners of the 2025 Global Pizza  Games.\n\nOut of more than 6,000 locations worldwide, this locally owned and  operated franchise in West Jordan achieved something that's never been  done before in our state. Competing against teams from Peru, the UK,  South Korea, the UAE, and…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690075/recognizing-utah-global-pizza-champions"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Secure Space Act would prohibit the Federal  Communications Commission from granting a license for geostationary  orbit and nongeostationary orbit satellite systems if they are owned or  controlled by an entity that provides communications equipment that  pose an unacceptable risk to U.S. national security. That is common  sense.\n\nI thank Chairman Guthrie…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690259/secure-space-act-of-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…zoning frameworks--\n\n(I) the simplification and standardization of existing       zoning codes;\n\n(II) maximum review timelines;\n\n(III) best practices for the disposition of land owned by       local governments for affordable housing development;\n\n(IV) differentiations between best practices for rural,       suburban, and urban communities, and communities…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…what AI can do but  how to use it securely, safely, ethically, and effectively.\n\nThis is not about replacing people. It is about empowering people. It  is about giving a family-owned business the same opportunity to compete  and grow and innovate as a Fortune 500 company.\n\nI am proud of this legislation and how it advanced out of committee  with strong…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699180/ai-for-main-street-act"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…records, including but not       limited to manifests, itineraries, pilot records, and customs       or immigration documentation, for any aircraft, vessel, or       vehicle owned, operated, or used by Jeffrey Epstein or any       related entity.\n\n(4) Individuals, including government officials, named or       referenced in connection with Epstein's…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696818/epstein-files-transparency-act"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…the second oldest  in the United States.\n\nThe company attributes its longevity to its superior staffing. The  Talladega Insurance Agency is built on family, as it is a family-owned  and operated business and has had four generations leading the way. In  the 1920s, Turner Joel Jones acquired the Talladega Insurance Company  renaming it Talladega Insurance…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700098/recognizing-the-170th-anniversary-of-talladega-insurance-company"}, {"senator": "John Hoeven", "party": "Republican", "sentence": "…North Dakota.\n\nThis flawed plan, finalized during the closing days of the Biden  administration, undermines BLM's multiple-use mandate and restricts  access to vast, taxpayer-owned energy reserves in North Dakota. It is  yet another example of the Biden administration's overreaching Green  New Deal agenda intended to block access to domestic energy production.…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696141/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…anywhere, can come to the U.S. the right way,  work hard, make an honest living, and succeed. That is what it is all  about.\n\nMany of the small businesses I represent are family owned and  operated. As the fifth generation to grow up on my family farm and  feedyard in western Kansas, I understand the immense sense of pride and  gratitude that comes with…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690715/help-small-businesses-thrive-again"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…us to roll back burdensome regulations and lower costs. This  week, we have an opportunity to do so.\n\nThe small businesses that make up the Big First are often small,  family-owned and -operated mom-and-pop shops. They don't manage or run  their small businesses to be billionaires or to become ultrawealthy.  Their goals are to serve their communities,…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697294/national-guard-shooting"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…subsection; or\n\n(G) any other group, person, or entity as the Securities       and Exchange Commission may determine by rule;\n\n(2) that is not held in any facility that is owned or       operated by a religious organization, other than an       institution of higher education that is accredited and       operated primarily for post-secondary education;…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692725/helping-angels-lead-our-startups-act-of-2025"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "…Saturday, June 21, 2025.\n\nThe roots of Mascotte trace back to around 1885, when founder J.W.  Payne first settled the area. The city takes its name from the  Mascotte, a ship owned by Tampa civic leader Henry B. Plant. The  vessel, which played a role in transporting tobacco from Cuba during  the Spanish-American War, is proudly on the city's official…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692392/recognizing-the-100th-anniversary-of-the-city-of-mascotte-florida"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…transparency measures in this bill are critical to expose the  harmful actions taken by bureaucrats behind closed doors and to  highlight the harm done to hardworking small and family-owned  businesses across the United States.\n\nMr. Speaker, I urge my colleagues to vote ``yes'' on H.R. 2965, and I  reserve the balance of my time.\n\nMr. WILLIAMS of Texas.  Van Duyne).…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697330/small-business-regulatory-reduction-act-of-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…including data localization and infringement of       intellectual property rights must be further addressed; and\n\n(7) foreign direct investment by companies or other       entities owned, directed, supported, or influenced by the       Chinese Communist Party is a threat to U.S. security and       merits an aggressive policy framework to protect U.S.…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692697/global-investment-in-american-jobs-act-of-2025"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…Burney, California.\n\nOver the years, the Tribe repeatedly tried to regain the Four Corners  land from Federal ownership but has been unsuccessful. Although the  land is now owned by the U.S. Forest Service, it is ancestral to the  Pit River Tribe.\n\nThe Tribe wishes to reacquire its ancestral lands and eventually  build an interpretive center there.…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698137/pit-river-land-transfer-act-of-2025"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "…time  getting creative and stretching the dollars they have as far as they  can, and that includes working to get Congress to fund SRS. Kane County  is 87 percent federally owned. Garfield County is about 94 percent  federally owned, and Piute County is about 75 percent.\n\nSRS recognizes that the Federal Government has an obligation to be  part of the…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697663/secure-rural-schools-reauthorization-act-of-2025"}]