[{"senator": "Ed Case", "party": "Democrat", "sentence": "…Hawaii, we've seen firsthand the benefits of ESOPs. Hawaii is home  to the second-oldest ESOP chapter in the Nation, underscoring the  success and importance of employee-owned businesses in our state. From  that humble beginning, the Hawaii Chapter of the ESOP Association now  represents over 45 ESOP companies and professional service providers in  the…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690133/introduction-of-the-esop-funding-for-sba-position-act-of-2025"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…represent, to  recover from the four decades of outsourcing of U.S. production.\n\nI am really shocked at what they have done. This impulsive decision  is a direct blow to family-owned businesses and American entrepreneurs  competing against Communist China, Mexico, and every other low-wage  haven in the world.\n\nThis decision delays critical upgrades, injects uncertainty…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698082/funding-manufacturing-extension-partnership-offices"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "…universities invested over $23 million in DEI  programs that supported Black students, and now those programs are at  risk. Donald Trump has also removed protections for minority-owned  businesses, weakened civil rights enforcement, and cut funding for  public health research, all while costs rise. More than 664,000  Mississippians are at risk of losing Medicaid.…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690730/trumps-first-100-days"}, {"senator": "Steven Horsford", "party": "Democrat", "sentence": "…history against unfair labor conditions--six and a  half years.\n\nPlaces like West Las Vegas, which became the heart of the city's  Black community during segregation.\n\nBlack-owned businesses and venues along the Black Strip on Jackson  Avenue allowed culture to thrive . . .\n\n. . . while entrepreneurship and homeownership helped local community  members begin…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688004/black-history-month"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…this requirement and apply it to all federal agencies.\n\nIn 2007, the Government Accountability Office (GAO) examined spending  on advertising contracts with minority-owned businesses by five federal  agencies--the Department of Defense, the Department of the Treasury,  the Department of Health and Human Services, the Department of the  Interior and…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696333/introduction-of-the-federal-government-advertising-equity-accountability-act"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…preventive programs to keep young people  from being addicted to fentanyl.\n\nDr. Rivera Gomez has supported countless Mexican women entrepreneurs  and Mexican immigrant-owned businesses. She won Woman of the Year 2025  for her dedication to the immigrant community.\n\nMadam Speaker, we are going to miss her in Santa Ana, but we know at  her next post she…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693460/congratulating-kendall-pierson"}, {"senator": "John Mannion", "party": "Democrat", "sentence": "…in services to  Canada each year.\n\nThis is a longstanding trade relationship that supports more than  6,400 jobs locally and directly employs 1,400 people at Canadian-owned  businesses. Slap-shot tariff policy and volatile trade policy have put  those jobs at risk.\n\nOur manufacturers who rely on metals, equipment, and machinery are  watching the costs…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695609/devastating-harm-caused-by-trump-administration"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…financing they need at a time  they need it most.\n\nSBA loans are supposed to help creditworthy businesses that cannot  get loans elsewhere. That includes many immigrant-owned businesses,  businesses that follow the rules, pay taxes, and create jobs in our  communities.\n\nLet's set the record straight. First, the Small Business Act already  prohibits the use…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692125/american-entrepreneurs-first-act-of-2025"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…measures in this bill are critical to expose the  harmful actions taken by bureaucrats behind closed doors and to  highlight the harm done to hardworking small and family-owned  businesses across the United States.\n\nMr. Speaker, I urge my colleagues to vote ``yes'' on H.R. 2965, and I  reserve the balance of my time.\n\nMr. WILLIAMS of Texas.  Van Duyne).…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697330/small-business-regulatory-reduction-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…resources.\n\nOne thing that BOEM failed to analyze that often gets overlooked, it  is not just Big Oil in the Outer Continental Shelf, it is also small  producers, family-owned businesses, and thousands and thousands of  people who make a living working in the Outer Continental Shelf.\n\nThis burdensome regulation will be detrimental to those small  businesses.…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688630/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…America?  Do you want to cut down on overregulation? This is the bill to do it.  Let's all stand with America and our small businesses and our  entrepreneurs, our family-owned businesses, and support H.R. 2965.", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697329/small-business-regulatory-reduction-act-of-2025"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…refrigerators, is estimated by  the Department of Energy to have a payback period of almost 94 years  under the amended standards. For retailers, many of which are small or  family-owned businesses, it makes no sense to purchase equipment that  will take nearly 100 years to recoup the cost on, especially when the  average lifetime of this product is 14 years.\n\nThis…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689129/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…the destruction of family farms across my district and  around the country. I have always and will continue to oppose any  effort to impose new taxes on small, family-owned businesses, period.\n\nI have fought to protect similar exemptions for students from family  farms and small businesses. Last year, new FAFSA provisions altered the  Federal formula…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690715/help-small-businesses-thrive-again"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…Madam Speaker, during the month of August, I spent time  in Ohio's Second Congressional District, talking with countless Ohioans  about their priorities, touring family-owned businesses, and hearing  from local farmers, manufacturers, and defense companies about the  issues most important to them.\n\nThe thing I heard from constituents is how grateful they…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694798/promises-made-promises-kept"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…If you cut off our money--they sent them an email, and they  did it by phone. They told the State agency that failing to promptly  approve new applicants from minority-owned businesses would result in a  lawsuit--a lawsuit--feeding accusations of racism that would be  scrawled across the news--scrawled across the news. Feeding Our Future  went to the…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697400/welfare-fraud"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…low taxes for working families; provides additional tax relief  for seniors; and protects generational family farms, family-run oil and  gas companies, and other family-owned businesses with enhanced death  tax relief.\n\nIn Shackelford and Hockley Counties, folks said that it is about time  that we put a stop to Biden's war on energy so that we can lower…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694789/promises-made-promises-kept"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "…designate the  Historic Greenwood District, also known as Black Wall Street, as a  national monument.\n\nThe Greenwood District in Tulsa was once a thriving community of  Black-owned businesses, professionals, and families until the Tulsa  Race Massacre of 1921 tragically burned it to the ground.\n\nHundreds were killed, and thousands were left homeless. Designating…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691666/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}]