[{"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…contributions over 10 grand into a political race to  be disclosed by the actual donor. No more hiding behind a 501(c)(3)  that converts to a 501(c)(4) that sends it to a super Pac that sends it  to the election. No, you go all the way back to the actual, real donor.\n\nWe should pass that bill. Every time we brought it up, every  Republican has voted to…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699104/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "…to voters, not to the billionaires and not to the special interests.\n\nThat is why from day one I have approached this job differently. I  have never taken a dime of corporate PAC money, and I never will, and I  have introduced legislation to ban corporate PACs.\n\nI publish my schedule online so that everybody can see what I am  working on, who I am meeting…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699113/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…tell investors that if they ever  have a problem they are going to get bailed out. After all, crypto has  all the power in Congress because it is the number one source of super- PAC independent expenditures. Last year, crypto did more super-PAC  expenditures than Big Oil and Big Pharma times five.\n\nThis bill is designed to enrich President Donald Trump.…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693831/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Joshua Riley", "party": "Democrat", "sentence": "…foreign corporations to pad their  profits. They have been getting away with it for years because they  work the refs, hire lobbyists, and grease the politicians with  corporate PAC checks.\n\nWhen I say that the system is rigged against the working class and in  favor of special interests, this is what I am talking about, and it  ends today. My Keep the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695743/high-utility-rates-by-foreign-monopolies"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…some people, to give $25 to an election. If every single resident of my  State--every single resident--gave $25, that wouldn't equal the $100  million commitment that one super PAC has made to this next election.  That is stunning. That shows you how much power a handful of these  companies have.\n\nThe only way that this group Leading Our Future can put…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699117/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…us that that means  that the Federal Government should be stuck with 1776 technology while  the competitors of the dollar race forward in the 21st century.\n\nThe largest super-PAC expenditures in history occurred last year. The  crypto industry spent more on independent expenditures--look at this.  If you combine all of the expenditures from Big Oil plus…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693738/anti-cbdc-surveillance-state-act"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…allows for bailouts under section 13(3) of the Federal Reserve  Act. Jay Powell won't do it, but the next guy will.\n\nCongress won't stop him because crypto spends more in super-PAC than  any other industry by far, five times more than the combination of Big  Oil and Big Pharma.\n\nIt allows for the purchase of bitcoin and Trump coin, and Trump has  announced…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693774/digital-asset-market-clarity-act-of-2025"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…and a better ability to follow the  money so that the American people can understand who is paying for that  commercial that they keep seeing on TV, right? Is it actually the PAC?  Who paid for that ad and where is the money coming from? What do they  want and who received that money, right? It is very unclear right now  to a lot of people.\n\nThere are…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699239/restoring-election-integrity"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…so much of our economy  is also what we feel corrupts this place, our Nation's Capital.\n\nWe see it with the unlimited money that runs through our elections,  unlimited super-PAC spending that corporations can dump in to buy the  favors that they get from politicians.\n\nThe people who we represent--Democrat, Republican, Independent, you  name it--hate…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689080/economic-populism"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…large transfers to allied       super PACs--in amounts that far exceeded any previous direct       ad spending. These totals can only be tabulated by reviewing       each super PAC's campaign finance reports. Dark money groups       also increasingly run ads, including many online ads, that       are worded and timed such that they do not trigger FEC…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699084/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…and the powerful. That kind  of corporate power doesn't just happen. It is enabled by pliable  politicians and by a Supreme Court that opens the floodgates to  unlimited super-PAC money that corrupts our elections.\n\nWe should fight that. If you want to fight corruption, let's start  with getting that unlimited corporate money out of our politics.\n\nYou…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691217/stock-trading-ban-for-members-of-congress"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…get big money out of politics and get their corporate influence out of  our communities.\n\nThat is why last year, I filed the Campaign Transparency Act and the  Stop the Super PAC-Candidate Coordination Act and supported the  Abolishing Super PACs Act. And today, as we are here during Special  Order hour, I am proud to announce that I will also be introducing…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699241/restoring-election-integrity"}, {"senator": "James Risch", "party": "Republican", "sentence": "…following non-MDE items       will be included: spare and repair parts; storage and aging;       surveillance firing; stockpile reliability; shared and       country-unique PATRIOT PAC-3 Missile Support Center support;       operator and maintenance support; test program set       development process support; publications and technical       documentation;…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699127/arms-sales-notification"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…critical       minerals sector the following year. In 2023, a review was       undertaken of the effectiveness of the President's Advisory       Council on Doing Business in Africa (PAC-DBIA), an initiative       launched during the Obama administration with the mandate to       advise the U.S. president, through the commerce secretary, on       strategies…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698908/agoa-extension-act"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…Vice Chairman, and ultimately  Chairman of the Bowie County Republican Party. He served for over 15  years as a Board Member and Vice President of the Bowie County  Republicans PAC and held leadership roles with the National Management  Association--LSAAP Chapter. Among his proudest achievements, Gary was  honored as a Presidential Elector from Texas'…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696861/recognizing-congressional-patriot-award-recipient-gary-singleton"}]