[{"senator": "Andy Kim", "party": "Democrat", "sentence": "Mr. KIM. Mr. President, I rise today because since early September,  Donald Trump has ordered our military to engage in 16 strikes in the  Caribbean and in the eastern Pacific Ocean. Those strikes have killed  more than 65 people. Each one of those strikes--each person killed--was  done without the necessary legal basis or proper justification to…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696566/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…American, and  the Commissioners acknowledged as much. Nevertheless, the physicist who  just 9 years before had been heralded as a hero for his role in ending  the war in the Pacific had his security clearance revoked, and it  effectively ended his brilliant scientific career.\n\nThe flawed AEC decision remained in effect for 68 years until my  predecessor,…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694014/new-start-treaty"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "Mr. CASE. Mr. Speaker, I rise today in strong support of  Congresswoman Radewagen's South Pacific Tuna Treaty Act. I am an  original cosponsor of this bill because we urgently need this update to  U.S. law that will strengthen our national tuna fleet, restore  regulatory…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691007/south-pacific-tuna-treaty-act-of-2025"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…authorization of Congress, is another sign of the deterioration of our  democracy.\n\nWhen a President arrogates to himself the power to blow up ships in  the Caribbean or now in the Pacific without any authority, in violation  of law and Constitution, it is another sign of the President arrogating  the military power to himself--to the person of himself, not…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696336/trump-administration"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…then chairman of the Joint Chiefs of Staff. The words Trump used  to justify his firing were ``woke'' and ``DEI.'' CQ Brown was the Air  Force's first Black commander of the Pacific Air Forces and later the  first Black Chief of Staff.\n\nWhat is woke about being a commander of the Pacific Air Forces?\n\nNone of the other commanders before him were called…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699863/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Norma Torres", "party": "Democrat", "sentence": "…Petty Officer Second Class, participating  in several major campaigns, including the Atlantic Invasion of North  Africa and the pivotal battles of Iwo Jima and Okinawa in the Pacific  Theater.\n\nDuring the Okinawa campaign, Mr. Drake and his fellow sailors bravely  endured a deadly kamikaze attack while aboard the USS Hyman, a  Fletcher-class destroyer.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694839/recognizing-jesse-drake"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…and hurt marine mammals across vast swaths of the ocean.  What could go wrong when these projects are happening on the seafloor?\n\nWe can look at what Meta tried to do off the Pacific Northwest coast.  Their drilling operation collapsed, scattering pipes, toxic fluids, and  heavy equipment across the seafloor like an underwater junkyard. Then  the company…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699959/undersea-cable-protection-act-of-2025"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…improve partner nations' military readiness.\n\nThe SPP partnership between the Hawaii National Guard and the  Philippines, initiated in 2000, was one of the earliest in the Indo- Pacific under this program, and it remains the longest-standing such  partnership in the region. Over the past quarter century, the  partnership between Hawaii's citizen soldiers…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695815/recognizing-the-25th-anniversary-of-the-hawaii-national-guards-state-partnership-program"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "Mr. SUBRAMANYAM. Mr. Speaker, I rise to recognize the month of May as  Asian American, Native Hawaiian, and Pacific Islander Heritage Month.\n\nVirginia is home to a dynamic and growing AANHPI community, a  community that across the country and in Virginia contributes in every  field, including…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1690995/recognizing-aanhpi-month"}, {"senator": "Rick Larsen", "party": "Democrat", "sentence": "…one of the issues we had  to settle on the FAA Reauthorization Act occurred when I was in my  district on Whidbey Island, while Sam was on Midway Island in the  middle of the Pacific--I don't even know which day it was on Midway at  the time--but Jack helped facilitate the phone call that helped the  chair and me resolve a sticky wicket issue that we had…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692223/designating-the-house-press-gallery-in-the-united-states-capitol-as-the-frederick-douglass-press-gallery"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…consequences, lines on paper,  assumptions, and equations. They were real, and they are very real  still.\n\nThe United States and its allies conducted 318 nuclear tests in the  Pacific islands. The people who lived on the islands lost their  ancestral homes, now uninhabitable, and the people who were exposed to  fallout were immediately sickened with ongoing,…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694116/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Josh Harder", "party": "Democrat", "sentence": "…the tragic shooting at Cleveland Elementary School  in Stockton, Ms. Koeurt joined with 34 Southeast Asian refugee families  at Park Village Apartments to co-found the Asian Pacific Self- Development and Residential Association, or APSARA. The organization  was founded on the belief that communities must come together to  advocate for safer, more equitable…", "date": "2025-08-08", "source_url": "https://justfacts.votesmart.org/public-statement/1694721/recognizing-sovanna-koeurt"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…countries in Europe have much smaller populations, but when the United  States puts its population and our military strength together with our  NATO allies, with our allies in the Pacific, all of a sudden, you can  see liberty's umbrella, and it is armed to protect our people. To date,  we have been able to do that.\n\nI give credit to Members like Tom Lantos.…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690215/supporting-ukraines-independence"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…organizations.\n\nThis bill extends diplomatic privileges and immunities to five  multilateral organizations. I am grateful that Congressman Castro  included a section from my Pacific Partnership Act, which extends  diplomatic privileges and immunities to the Pacific Islands Forum  (PIF), the region's premier multilateral organization with eighteen  members…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694767/supporting-the-partner-act"}, {"senator": "Donald Norcross", "party": "Democrat", "sentence": "…defense program in the  history of our country, the F-35, and over $800 million to make sure  that we continue the E-7A aircraft which is needed so badly,  particularly in the Pacific.\n\nMadam Chair, this bill also addresses the risks and costs of military  modernization. It extends the review, the assessment, and the reporting  to Congress on the F-35 program…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695154/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "James Risch", "party": "Republican", "sentence": "…sale will support the       foreign policy and national security objectives of the United       States. Australia is one of the most important U.S. allies in       the Western Pacific. The strategic location of this political       and economic power contributes significantly to ensuring       peace and economic stability in the Western Pacific. It is…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695536/arms-sales-notification"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…safe and prosperous.\n\nSoon after moving to Long Island from Brooklyn as a child, Mr. Ellis  followed the example of service set by his father, who saw combat in  the South Pacific while serving in the Navy during World War II. Mr.  Ellis was first elected to be a State Committeeman at 21 years old and  worked alongside elected officials and stakeholders…", "date": "2025-03-18", "source_url": "https://justfacts.votesmart.org/public-statement/1688911/recognizing-mr-bill-ellis-for-his-contributions-to-long-island"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Americans served, including 195,000 from the  State of Arkansas.\n\nWe remain forever grateful to the Allied war effort leadership, to  the men and women who served down range in the Pacific, Europe, North  Africa, and beyond, and to those on the home front who taught our kids  and fueled the arsenal of democracy.\n\nOur generation salutes the Greatest Generation…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694812/marking-80th-anniversary-of-v-j-day"}, {"senator": "James Risch", "party": "Republican", "sentence": "…sale will support the       foreign policy and national security objectives of the United       States. Australia is one of the most important U.S. allies in       the Western Pacific. The strategic location of this political       and economic power contributes significantly to ensuring       peace and economic stability in the region. It is vital to…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696581/arms-sales-notification"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…anniversary.\n\nIncorporated in 1915, Delano was originally established as a railroad  town, serving as a hub for hundreds of workers building the southern  terminus of the Southern Pacific railroad. Over the years, Delano has  been the site of several historically significant events, particularly  during World War II. The Voice of America Delano even operated…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698436/recognizing-the-city-of-delano-california"}, {"senator": "Jake Ellzey", "party": "Republican", "sentence": "…accelerates the Army's investment in the Future Long-Range  Assault Aircraft, a platform essential for the Army to meet the fight  in the long distances between islands in the Pacific.\n\nThe Navy Reserve will finally get four more KC-130Js to provide  aerial refueling, spare engines, and contested logistics in the Pacific  Ocean.\n\nSome of the most important…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699327/consolidated-appropriations-act-2026"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "Mr. WESTERMAN. Mr. Speaker, I move to suspend the rules and pass the  bill (H.R. 531) to amend the South Pacific Tuna Act of 1988, and for  other purposes, as amended.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:                                  H.R. 531…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691006/south-pacific-tuna-treaty-act-of-2025"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…Representative from the State of  Michigan, a State that knows the value of manufacturing, trade, and  international stability, I know firsthand how vital peace in the Indo- Pacific is to American jobs and our economy.\n\nTaiwan is not only a democratic partner. It is also a key player in  the global supply chain, especially for semiconductors that power…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693874/taiwan-conflict-deterrence-act-of-2025"}, {"senator": "Barry Loudermilk", "party": "Republican", "sentence": "…parents both served in the United  States Navy during World War II, with his father serving as a naval  aviator on the USS Hornet during some of the most critical moments in  the Pacific theater.\n\nBart knew from an early age that he wanted to serve his country as a  naval aviator. So eager to learn to fly, Bart washed aircraft in  exchange for 1 hour of flight…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698432/republicans-have-delivered-in-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…covered       land in section 2 to a width of less than 50 feet on each       side of the center of the main track or tracks established       and maintained by the Southern Pacific Transportation Company       on the date of the enactment of this Act; or\n\n(2) validate or confirm any right or title to, or interest       in the land referred to in section…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691119/reversionary-interest-conveyance-act"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…missions. He led law  enforcement teams supporting international drug interdiction operations  aboard United States Navy and allied vessels, deploying to the  Caribbean, eastern Pacific, and the Middle East. He also served as an  Aids to Navigation Officer in several major ports, supervising cutters  and crews responsible for maintaining critical waterways…", "date": "2025-12-19", "source_url": "https://justfacts.votesmart.org/public-statement/1698462/recognizing-united-states-coast-guard-cwo4-james-mcinnis-as-december-2025-veteran-of-the-month"}, {"senator": "James Risch", "party": "Republican", "sentence": "…national security objectives of the United States by       improving the security of a major ally that is a force for       political stability and economic progress in the Indo-Pacific       region.\n\nThe proposed sale will improve Japan's capability to meet       current and future threats by providing stand-off capability       via advanced, long-range…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696967/arms-sales-notification"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…States has been overly reliant on the  communists in Beijing. It is in America's best national security  interest to maintain deterrence against the CCP, not only in the Indo- Pacific, but especially here at home in our supply chains and critical  industries. This is why I first introduced H.R. 3872, the MERICA Act,  which would allow for the expanded extraction…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698230/application-of-mineral-leasing-act-for-acquired-lands-to-hardrock-minerals"}, {"senator": "James Risch", "party": "Republican", "sentence": "…objectives of the United States by       improving the security of a major ally that is an important       force for political stability and economic progress in the       Indo-Pacific region.\n\nThis proposed sale will improve the Republic of Korea's       capability to meet current and future threats by increasing       its critical air defense capability…", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697584/arms-sales-notification"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…conflict, the relationship  between the United States and Vietnam has also progressed to remarkable  milestones. Vietnam has emerged to become one of our closest allies in  the Pacific and is a strategic partner in our efforts to account for  missing servicemembers.\n\nOn this occasion, I would also like to thank Captain Dave Carey for  his special keynote…", "date": "2025-03-18", "source_url": "https://justfacts.votesmart.org/public-statement/1688919/recognizing-the-service-of-our-vietnam-veterans"}]