[{"senator": "Brian Schatz", "party": "Democrat", "sentence": "…instance, it is  because of USAID's war legacy work in Vietnam that we share a strong  security partnership today. It is thanks to our disaster risk  mitigation programs in the Pacific islands that we have as much access  to the region as we do.\n\nSo it is not as if we just invest this money and hope for the best.  This is not charity. This is not charity. It…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699751/9999"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…colleagues.\n\nScattered across the three traditional Pacific subregions of  Melanesia, Micronesia and Polynesia are over two dozen jurisdictions  collectively known as the Pacific Islands, including twelve independent  states, countries in free association and territories. Though small in  land area and population, the land plus maritime exclusive economic…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693346/introduction-of-the-blue-pacific-act"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…consequences, lines on paper,  assumptions, and equations. They were real, and they are very real  still.\n\nThe United States and its allies conducted 318 nuclear tests in the  Pacific islands. The people who lived on the islands lost their  ancestral homes, now uninhabitable, and the people who were exposed to  fallout were immediately sickened with ongoing,…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694116/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…multilateral organizations. I am grateful that Congressman Castro  included a section from my Pacific Partnership Act, which extends  diplomatic privileges and immunities to the Pacific Islands Forum  (PIF), the region's premier multilateral organization with eighteen  members across Oceania, in the hopes that the PIF will establish a  mission to the U.S.\n\nScattered…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694767/supporting-the-partner-act"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…support of my Promoting  Regional Opportunities for Sustainable Prosperity and Economic  Resilience in the Pacific Act, or PROSPER in the Pacific Act, to  advance the U.S.-Pacific Islands relationship to include an economic  partnership built on shared values and principles.\n\nThe Pacific Islands, spread across the vast Pacific Ocean, have a  collective…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697950/supporting-the-prosper-in-the-pacific-act"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…of Iowa.\n\nScattered across the three traditional Pacific subregions of  Melanesia, Micronesia and Polynesia are over two dozen jurisdictions  collectively known as the Pacific Islands, including twelve independent  states, countries in free association and territories. Though small in  land area and population, the land plus maritime exclusive economic…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693376/introduction-of-the-pacific-partnership-act"}, {"senator": "Joaquin Castro", "party": "Democrat", "sentence": "…American scientists remain at the forefront of the discovery.\n\nFourth, our Pacific and African partners. This bill authorizes the  President to extend protections to the Pacific Islands Forum, a vital  regional body in the South Pacific where small island nations are on  the front lines of climate change and facing significant diplomatic  overtures by…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694823/providing-appropriate-recognition-and-treatment-needed-to-enhance-relations-act"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…3. Extension of privileges and immunities to the European                Organization For Nuclear Research (CERN). Sec. 4. Extension of privileges and immunities to the Pacific Islands                Forum. Sec. 5. Extension of privileges and immunities to the Caribbean                Community. Sec. 6. Extension of certain privileges and immunities…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694822/providing-appropriate-recognition-and-treatment-needed-to-enhance-relations-act"}]