[{"senator": "Joe Courtney", "party": "Democrat", "sentence": "…chance to listen to people in terms of  what they care about the most.\n\nI had a number of those events, in Mansfield, Colchester, and Old  Saybrook, Connecticut, with very packed rooms. The issue that was of  most concern was H.R. 1, what President Trump calls the one big,  beautiful bill.\n\nWhile Congress was away, the Congressional Budget Office had…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694776/congress-long-to-do-list"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…you take it and push the persons in those two districts together, but  in so doing, you eliminate a district. In this case, that is what they  did. So they cracked, and they packed. They stacked. They put the Ninth  and the 18th together.\n\nWhen they put the Ninth and the 18th together, they eliminated the  possibility for a person of color to be elected…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700075/black-history-stolen-legacies"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…a miracle treatment that can save the lives of malnourished children,  even in the most remote corners of the world. Ready-to-use therapeutic  food, or RUTF, is a nutrient-packed peanut butter paste.\n\nRUTF, also known as Plumpy'Nut, delivers the fat, sugar, and protein  that children with malnutrition need to survive and grow. It requires  no refrigeration,…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690379/edesia-nutrition-saves-malnourished-children"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…SUBRAMANYAM. Mr. Speaker, I rise today to recognize and  congratulate the Fauquier High School class of 2025.\n\nLast month, the 301 graduates and their families gathered at the  packed Jiffy Lube Live to celebrate this milestone.\n\nThis senior class has a lot to be proud of, including beating their  teachers in the students versus faculty basketball game.…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691978/recognizing-fauquier-high-school-class-of-2025"}, {"senator": "Brad Schneider", "party": "Democrat", "sentence": "…Drancy, she had volunteered to       accompany a trainload of children to Auschwitz, 1,000 miles       east, a horrific journey of several days and nights. They       were packed into freight cars like animals. No water. No       food. No sanitation. No windows. No place to sit let alone       room to lie down. All this was in the heat of August. Upon…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690804/rose-helene-spreiregen"}, {"senator": "Alma Adams", "party": "Democrat", "sentence": "…employees from being wrongfully targeted by these  Federal agents.\n\nCruelty was the point of their operation, but Charlotte never caved  in to their cruelty. Instead, citizens packed churches for training to  empower themselves to respond to Border Patrol agents. Parents band  together to safely get their children to school, and businessowners  patrolled…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697455/fighting-dhs-immigration-raids"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…constituents, many of whom are  reaching out to me for the very first time.\n\nI held a townhall at Albany High School and, like many of my  colleagues' in recent weeks, it was packed. The energy in the room was  palpable: fear, helplessness, and anger.\n\nWhy, Mr. Chairman, are we forcing through legislation that will hurt  the very people we represent?…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688070/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…supplement under section 201(ff).\n\n``(kkk) The introduction or delivery for introduction into       interstate commerce of a dietary supplement that has been       prepared, packed, or held using the assistance of, or at the       direction of, a person debarred under section 306.''.\n\n(b) New Import Exclusion.--Section 801(a) of the Federal       Food,…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699792/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…space on the       llth floor of an old building at 75 Varick Street. Over eight       hours one late-spring Saturday, its entire collection,       cocooned in bubble wrap and packed in more than 400 plastic       crates, was transported to the new location as quietly as can       be done with a police escort.\n\nBoth the appeals and challenges of the society's…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697235/priceless-coin-collection-heads-to-the-toledo-museum-of-art"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…incredible man, Mr. John Lewis, came  up to me on the House floor. It is very crowded on the House floor, Mr.  Speaker. You notice this when we are voting. It is 435 people packed  here on the House floor. There is staff. It is sometimes hard to move  around. You have to get your vote in, Mr. Speaker. You can't get too  entranced in the conversation,…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689752/reflecting-on-americas-history"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…Colorado, in the rural  communities that I represent, hosting townhalls, visiting with folks in  my community, constituents, ranchers, farmers, teachers, working  families, packed townhalls. At those townhalls, do you know the one  subject that no one brought up? Commercial refrigerators. It never came  up.\n\nAt a townhall that we held 3 days ago with…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689052/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers-providing-for-consideration-of-hr-defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…coincidence.\n\nSupporting this impoverished, illegal population costs American  taxpayers an estimated $160 billion a year. It flooded classrooms with  non-English-speaking students, packed emergency rooms with illegals  demanding care, and overwhelmed homeless shelters and food banks meant  to help Americans. Worst of all, the most violent and dangerous  criminal…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694126/sorry-not-sorry-for-immigration-enforcement"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…inducted that 2006 team into the Iola High School's Don  Bain Hall of Fame. Believe me, Mr. Speaker, the community has not  forgotten what they accomplished.\n\nThe auditorium was packed. Former classmates and teachers came home  to join in the celebration. Back in 2006, the student members of this  outstanding basketball team received statewide recognition…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699133/congratulating-2006-iola-fillies-on-don-bain-hall-of-fame-induction"}, {"senator": "John Thune", "party": "Republican", "sentence": "…Working  Families Tax Cut bill, which is currently putting more money in hard- working Americans' pockets. But we didn't just make the headlines  legislatively. In addition to a packed legislative schedule, we  considered and confirmed 417 civilian Presidential nominations--more  than were confirmed in the first year of President Trump's first term  or President…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699100/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…here whether we asked him or not. Most times, he was the  only one.\n\nYet tonight, when I asked my colleagues if they wanted to share a  message on Doug, the reverse: It is a packed house.\n\nThat is all I wanted to share, to think about the legacy that he has  left and the importance that he has to so many of our colleagues. He  was always here for me,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698737/9999"}, {"senator": "Roger Marshall", "party": "Republican", "sentence": "…a brighter future for our farmers.\n\nWhole milk delivers 13 essential nutrients and has enough fat content  to help students absorb vitamins like A, D, E, and K. It is also packed  with protein that helps keep the student full all the way through those  long afternoon math classes and then on through gym and on through  their sports activities, until…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697062/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…past, folks. This is the reality that  millions and millions of our fellow Americans in Missouri and across  the country live this very day.\n\nHaldex, a brake manufacturer, packed up and left for Mexico in 2020,  eliminating the last 154 jobs left at the facility in the suburbs of  Kansas City. Layoffs began 2 weeks before Christmas. They will save…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690533/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…performed.\n\nMaking his PBR World Finals debut in 1997, Flint became the  dedicated, exclusive in-arena entertainer for PBR's premier tour in  2006. For more than two decades, fans packed arenas not only to watch  world-class bull riding, but to be entertained by Flint's iconic  performances that became a hallmark of PBR events.\n\nIn recognition of his remarkable…", "date": "2026-01-27", "source_url": "https://justfacts.votesmart.org/public-statement/1699393/recognizing-rodeo-hall-of-fame-member-flint-rasmussen"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…the Nittany Lions men's  hockey team, as well as all of the talented athletes who have worked so  hard to accomplish this victory and the Penn State fans and students  who packed the Pegula Ice Arena for every game.\n\nNow I look forward to watching the Nittany Lions continue their  success against Boston University on April 10 as they look to advance…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689357/securing-our-elections"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…streak, at that time, the longest ever recorded in Upper  Peninsula high school basketball history. Even in the face of such an  arduous stretch, A.D. Johnston gymnasium remained packed on Friday  nights as the people of Bessemer cheered on their beloved high school  basketball team. Their loyalty and perseverance serve as a true  testament to the never-give-up…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699253/recognizing-mr-thomas-l-pelissero-for-authoring-bring-one-home"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…pro-life is about doing more than just talking about it. It  means standing up for life at every stage and backing it up with  actions. This Friday, this Mall out here will be packed with a powerful  demonstration of the sanctity of life. It is important that the  people's House meets that moment. We should be unafraid to say that  every life has value…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699218/providing-for-consideration-of-hr-supporting-pregnant-and-parenting-women-and-families-act-providing-for-consideration-of-hr-pregnant-students-rights-act-and-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}]