[{"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…during which students can  develop an understanding of waterfowl anatomy and habitats, culminating  in the Junior Duck Stamp art competition, where participants may draw  or paint a picture of an eligible North American waterfowl species.\n\nThe winning image of this contest then goes on to be featured on the  Junior Duck Stamp itself, with proceeds of…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698167/reauthorization-of-junior-duck-stamp-conservation-and-design-program-act-of-1994"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…Republicans once again prioritize appeasing a national anti- abortion group in town for its annual rally instead of addressing the  real crises facing American families.\n\nI want to paint a picture as to what happens to a young woman who  suspects that she may be pregnant. She has a mix of emotions. She may  have overwhelming fear and anxiety, especially if…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699223/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…any Democrats that would stand for that. It doesn't matter. We aren't  going to say the person shouldn't be punished.\n\nI speak in specificities. I don't come to the floor and paint with a  broad brush. I don't think all of my colleagues on the other side are  racist. I don't label all of them as rightwing nuts. If I see someone  do something, I am going…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695338/dark-days"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…deported.\n\nLet's be clear. This rule that the administration is attacking wasn't  about politics. It wasn't about gangs or drugs or any of the disgusting  tropes the other side will paint against hardworking immigrants. It was  about seatbelts in vans, safety on the job, and the simple human  dignity of not being punished for demanding better conditions.\n\nWhat…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695577/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Eric Sorensen", "party": "Democrat", "sentence": "…conditions continue to require complex, coordinated, and  long-term care.\n\nTo unite our community in this fight, OSF Children's Hospital of  Illinois has also recently launched Paint the Town Gold, an annual  community-wide awareness initiative that will  take place every September during Childhood Cancer Awareness Month. Now  an annual downstate tradition,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694928/recognizing-childhood-cancer-awareness-month"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…programs, active discussion groups, social gatherings,  and the necessary transportation.\n\nWhen I retire, not that long from now, I know exactly where I can go  to learn how to paint and play bridge, canasta, mahjong, and a host of  other recreations.\n\nAt Home on the Sound complements the already active senior recreation  programs offered by the Village…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691311/recognizing-at-home-on-the-sound"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…not accountability. That is the system protecting itself.  That is the fix being called in.\n\nMeanwhile, Napheesa Collier, the heart of the Lynx, an All-Star, a  force in the paint, didn't shoot a single free throw the entire game.  Now, tell me,  how does a player so dominant in the lane never draw contact? Because  she was erased from the whistle.…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693881/taking-on-wnba"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…fundamental misunderstanding, at a minimum, about what sanctuary  policies are and what sanctuary policies are not.\n\nNow, as I was listening to my colleague, he has tried to paint a  picture of sanctuary States or sanctuary cities as nothing but lawless,  and I get that it is maybe a favorite sound bite for rightwing media,  but the fact of the matter…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700066/9999"}, {"senator": "Lauren Underwood", "party": "Democrat", "sentence": "…at least one restroom per car, including ADA- compliant restrooms, because, let's be real, babies don't wait for  layovers when they need to be changed.\n\nMr. Speaker, I will paint the picture: You are holding your baby in  one arm, a diaper bag in the other, and probably some other stuff, too.  You make your way to the restroom with your kids and your…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692156/baby-changing-on-board-act"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…ongoing  Republican effort to undermine access to these very places.\n\nWhile we may be hearing how treasured our public lands are from my  colleagues today, some of their actions paint a different picture.\n\nRepublicans are slashing the already underfunded land management  agencies' budgets. Republicans are firing hardworking Americans who  keep our public…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697763/semiquincentennial-tourism-and-access-to-recreation-sites-act"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "Mr. LATIMER. Madam Speaker, allow me to paint a picture of a country:  threats to the media to control the flow of information to the  citizenry; cutting funds to childhood education, higher education, and  the arts to…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690906/congress-must-provide-checks-and-balances"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…roots.\n\nCollins' work has been displayed worldwide, from exhibitions in  Africa to murals honoring historical figures in the United States.\n\nHe was the first Black artist to paint a sitting President when he  painted President Gerald R. Ford.\n\nHis contributions to the art world also include designing the Martin  Luther King Jr. Nonviolent Peace Prize…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688206/highlighting-notable-black-leaders-from-michigans-third-congressional-district"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…supposed  savings, they then try to take them down because, as soon as they are  fact-checked, so many of them are not done. And I don't want to say all  of them. I don't want to paint that broad a brush. I know about having  Microsoft licenses, too many. Yes, there is waste. I wish we were doing  this in a bipartisan way. Those cuts would be bigger and probably…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Americans view the economy negatively. That is how truly out of touch  President Trump is with the alarming reality millions of American  families are facing.\n\nLet me help paint the picture for President Trump and his Republican  accomplices: Utility bills are skyrocketing across the country, grocery  prices are up, and the cost of buying a new home…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697896/electric-supply-chain-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…character, leadership, and service.\n\nJayden is a shining example of what hard work, humility, and  dedication to others can achieve. At Cass, she serves as the shop  foreman in the paint trade department, where she leads by example and  fosters excellence among her peers. Beyond her trade, Jayden is an  active member of campus leadership. She serves as Secretary…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692255/recognizing-ms-jayden-coffey"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…of any exposed hazard that does not       serve a training purpose;\n\n(G) an identification of the presence of hazardous or toxic       materials, including--\n\n(i) lead-based paint;\n\n(ii) asbestos or products that contain asbestos;\n\n(iii) black mold;\n\n(iv) radon; and\n\n(v) contaminated drinking water; and\n\n(H) an assessment of the need for, and estimated…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Anna Luna", "party": "Republican", "sentence": "…election integrity and also to call out rogue judges,  and yet they chose at this point in time to tie this discharge petition  killer to this rule that would also permanently paint me and the  Members supporting it, and I would like to also share that I am one of  the most conservative Members of this body, I would like to hold up my  voting record to…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689415/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…thought we are all in this together. They know dang well this wasn't a  racist attack, but it was just something that they wanted to use, but  they never miss an opportunity to paint somebody a racist, you know,  when it comes to the Democrats.\n\nSo January 6 had nothing to do with racism. Let's be clear what  happened that day. Democrats and the Deep State…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698541/9999"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…sheriffs in my district need to respond to crime and to  keep people alive? They need rural hospitals. When Republicans strip  $715 billion from Medicaid, no matter how they try to paint that pig,  they will be eliminating rural hospitals and emergency rooms.\n\nWhen they do that, police officers in rural areas in places like  Chama, New Mexico, in my district…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691169/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…am  guessing that in Fond du Lac, Wisconsin, there are maybe 400 different  landlords. The landlords compete for the rental dollar.\n\nI have the ability to buy my own house, paint my house whatever color  I want, and maintain my lawn in whatever fashion I want. That is  something we do in a free-market economy.\n\nIn a socialist economy, the government…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695628/breakdown-of-traditional-families"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…purposes and  toward getting back to the church, getting back to faith, getting  married, having children. That is the type of conservatism that I  represent, and I am trying to paint a picture of virtue, of lifting  people up. . . .''\n\nIn another exchange with Bill Maher: ``It defies reason to think that  this is just a roll of the dice. When you see a…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695719/highlighting-flawed-policies"}, {"senator": "Scott Fitzgerald", "party": "Republican", "sentence": "…be.\n\nThere are no firearm magazines involved with these weapons at all,  and they do not have high-velocity projectiles.\n\nThere are a lot of scare tactics being used to try to paint this as  if it is being extended to other firearms. It is not.\n\nThis would also prevent these ideas from taking hold amongst  discussions about ghost guns, which is something…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700039/law-enforcement-innovate-to-de-escalate-act"}]