[{"senator": "Adam Smith", "party": "Democrat", "sentence": "…expanded opportunities  for homeownership in Seattle.\n\nMcKinney was a friend to many, including the noted fellow pastor and  civil rights leader, Dr. Martin Luther King, Jr. The pair had known  each other from childhood but grew closer friends at Morehouse College.  Dr. King visited Seattle only once, after his old friend requested that  he come to give…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698261/recognizing-reverend-dr-sammuel-mckinney"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…was told that he gave away thousands of dollars of his own  personal Trump swag. What is that--hats? signed bags? pens? I don't  know what else was in there--watches? maybe a pair of his shoes?  Instead of working to end this shutdown that they started, they decided  to have a picnic.\n\nIt is my understanding that President Trump may even be leaving the…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696347/trump-administration"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…passed the Senate; it passed the House; and it  was signed into law by President Trump on September 28--just days short  of the expiration of fiscal year 2018. It wasn't the only pair of  bills. Several other appropriations bills were enacted prior to October  1 also.\n\nMy Republican colleagues knew then that passing partisan rescissions  packages would make…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693591/rescissions-act-of-2025"}, {"senator": "Brad Schneider", "party": "Democrat", "sentence": "…was privileged to host Rabbi Yehoram Ulman and Ahmed al- Ahmed, of Sydney, Australia, and survivors of the terrorist attack at  Bondi Beach last month.\n\nWhen a father-and-son pair of ISIS-inspired gunmen began massacring  Jews during a Hanukkah celebration on the beach--murdering 15 people,  including Rabbi Ulman's son-in-law--Ahmed, a Muslim who was…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699026/the-light-will-win"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…families. While there  is $230 million for the President to pay himself from the Department of  Justice, $8 million for some of his closest Senate allies, $200 million  for a pair of private jets for the Department of Homeland Security  Secretary, and $40 billion to Argentina, the American people are left  with nothing but higher costs.\n\nThis bill also…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696741/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…materials that make up the sneakers.\n\nNow these products become more expensive to make, and the way that  companies make up for that is passing that cost on to the consumer. A  pair of sneakers that cost $30 might now cost $50 after tariffs are  imposed. You now have to work more to get more money and then pay more  for the same exact pair of sneakers.…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689098/understanding-tariffs"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…Speaker, H.R. 1550 redesignates Saratoga  National Historical Park as the Saratoga National Battlefield Park.\n\nThe site in Stillwater, New York, marks the location of a critical  pair of battles known as the turning point of the American  Revolutionary War.\n\nAmerican forces defeated the British in the Battle of Saratoga in  October 1777, which the National…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691017/strengthening-americas-turning-point-act"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…selected by the Speaker of the House, House minority leader, and the  majority and minority leaders in the United States Senate. Maybe we can  even ask Speaker Johnson to include a pair of his glasses.\n\nThe capsule will remain sealed until July 2, 2276, the Nation's 500th  anniversary.\n\nThe gentlewoman from New Jersey (Mrs. Watson Coleman) introduced H.R.…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688200/semiquincentennial-congressional-time-capsule-act"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "Mr. GRASSLEY. Mr. President, if I may continue, I want to speak about  a couple of judges that will be before us this week. We will be voting  on a pair of highly qualified circuit court nominations.\n\nDespite the ongoing Democratic government shutdown, the Senate  Judiciary Committee remains hard at work. We are continuing to…", "date": "2025-11-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696500/nominations-of-joshua-d-dunlap-and-eric-chunyee-tung"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…outrageous foreign  propaganda.\n\nMr. Speaker, $9 billion comes to about $70 for an average American  family.\n\nMr. Speaker, do you think they prefer to spend that $70 on a new pair  of shoes for their child or for ``girl-centric climate change  programs'' in Brazil?\n\nThat is the choice.\n\nCongress squanders hundreds of billions of dollars annually on  destructive…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693724/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…a little disappointed here on this one because, you know, it is  a little bit of a delay tactic, but he certainly has my commitment to  work with him, if they need to try to pair this. But I will say this:  The 5 years of this bill expires at the end of this year, and we  cannot--regardless if there is pairing or not pairing--we cannot let  this bill…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696137/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "…to the stuff that is sharply partisan,  impossible.\n\nIf you have a bill that you know can't pass on its own, well then,  what do you do?\n\nWell, perhaps what you want to do is pair it with a bunch of other  bills that are themselves noncontroversial, hoping that it won't get  noticed or hoping that there will be enough other Senators who will  say: I guess…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698423/unanimous-consent-requests-the-calendar"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…the floor and said: Let us work with you, Dan,  because we know this is important to you. We know this is important to  your heroic constituents. Let us work with you. If you pair this with a  Democrat bill that is important, we will work to pass it.\n\nSo Senator Padilla objected when I tried to pass it last time.  Democrats even suggested to me what bill…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696959/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-extension-of-deadlines-in-standards-of-performance-for-new-reconstructed-and-modified-sources-and-emissions-guidelines-for-existing-sources-oil-and-natural-gas-sector-climate"}]