[{"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…con.\n\nLet's get to the real waste. The real waste is incinerating 500  metric tons of expired aid sitting in warehouses meant to feed  suffering children in Afghanistan and Pakistan.\n\nThe real fraud is telling the American people that these cuts will  help them, and they won't.\n\nThe real fraud is letting Elon Musk and his DOGE minions wreak havoc  at…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693706/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…Virginians also add to the cultural richness of our  Commonwealth through art, music, literature, and food. They bring  languages and stories from across the world--from Sudan to Pakistan,  Somalia to Afghanistan, Morocco to Palestine. They also bring the  uniquely American experience of growing up, learning, working, and  building a life in our Commonwealth…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698866/commerce-justice-science-energy-and-water-development-and-interior"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…reported that the  Trump administration is planning to incinerate $800,000 worth of high- nutrition biscuits, food that was meant for starving children in  Afghanistan and Pakistan.\n\nThese are not snacks. These are fortified, lifesaving meals. It gets  worse. The administration will spend $130,000 just to destroy them.  These are resources that could…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693656/foreign-food-aid-incinerated"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…dollars--apart from the $350 million I mentioned  earlier--hundreds of millions more from this foreign government.\n\nHis sons are traveling around the world getting VIP treatment in  Pakistan and elsewhere, using the President and the White House to  strike deals for World Liberty Financial. We simply cannot accept this  kind of practice as normal or legal. We…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691548/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Ilhan Omar", "party": "Democrat", "sentence": "…last few years, we have seen multiple situations that remind  us of the extent of this fragility and of the danger. Nuclear-armed  India exchanged fire with nuclear-armed Pakistan just this year. Cooler  heads prevailed, this time.\n\nNuclear-armed Israel conducted unilateral strikes on facilities in  Iran. That war didn't go nuclear this time.\n\nNuclear-armed…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694118/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…nuclear weapons in the world today. Some 90  percent of these are in the arsenals of the United States and Russia.  The rest belong to the U.K., France, China, Israel, India, Pakistan,  and North Korea.\n\nRussia has threatened to use nuclear weapons against Ukraine and even  against NATO nations. North Korea uses its nuclear weapons program to  intimidate…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694117/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…happening to gay people right now in Putin's Russia and in  Orban's Hungary. It is happening to Uyghurs and Tibetans in China. It  is happening to Christians and free-thinkers in Pakistan. It is  happening to Muslims in India. Now, it is happening to trans people in  America when they are happy to attack them, vilify them, and try to  destroy their community.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698345/protect-childrens-innocence-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…due to its low costs and faster permitting       processes.\n\n``In addition to growth in established markets, solar is       set to surge in economies such as Saudi Arabia, Pakistan and       several Southeast Asian countries,'' Executive Director Fatih       Birol said. ``As renewables' role in electricity systems       rises in many countries, policymakers…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696127/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…Middle Eastern trips supporting our Nation's Cold War  military exercises. He also flew into other various conflicts such as  the Israel-Jordan Crisis, and across the world to Pakistan, Ethiopia,  Panama, Greenland, and Libya. Danny had the privilege of flying the  last C-133 to the Boneyard at Davis Monthan AFB, Arizona. He received  the Air Force Commendation…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696328/recognizing-danny-charles-masur-with-a-congressional-veteran-commendation"}, {"senator": "Anna Luna", "party": "Republican", "sentence": "Mrs. LUNA. The National Endowment for Democracy needs to change its  name to the National Endowment for Censorship.\n\nI hear if we defund programs in Pakistan, Congo, and the Ukraine, all  of which--Pakistan has election fraud, Congo has 40,000 child slaves in  cobalt mines, and Ukraine is jailing Christians--then we are simply…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699060/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…overseas and the respect the United  States enjoys once again. Peace is on the horizon, both in Ukraine and,  of course, now that we have negotiated a deal with India and Pakistan.\n\nThis is about promises kept and about leadership met. That is why I  am so excited to see America back again.\n\nWhen we look at a lot of these things, one of the things that…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691176/president-trumps-delivery-on-his-promises"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…has not been the case.\n\nIn 2024, D.C.'s homicide rate exceeded 27 homicides per 100,000  residents, higher than that of any State and nearly three times that of  Islamabad, Pakistan, and 18 times that of communist-run Havana, Cuba.  That same year, the city recorded nearly 30,000 crimes, including  thousands of violent offenses, robberies, and car thefts.…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696932/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…the Greater Middle East is  particularly abysmal, with dozens of campaigns costing thousands of  American lives and trillions of dollars. Afghanistan, Iraq, Syria,  Lebanon, Pakistan, Yemen, Sudan, Somalia, and now Iran--all countries  in the region that the United States has bombed or is bombing. In each  case, the hawks in Washington were adamant that…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693121/motion-to-discharge-sj-res-59"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…a mosque of  Ahmadiyya Muslims. Ahmadiyya Muslims have a little bit different  theology than Muslims in general. They are persecuted by those members  of Islam who live in Pakistan, and many of them have had to flee  Pakistan even with regards to their own personal safety.\n\nNevertheless, when I met with the Ahmadiyya Muslims, there were two  things that…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689133/educating-young-people"}, {"senator": "James Risch", "party": "Republican", "sentence": "…and  nothing more.\n\nPresident Trump's foreign policy successes have been several and  should be celebrated not denigrated. For instance, recently his work  when India and Pakistan started fighting, he got involved, and he had  that shut down pretty quickly.\n\nThis morning, I had the good fortune to attend, with Secretary Rubio,  an event at the State…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693132/motion-to-discharge-sj-res-59"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…spitting out or  this horrible ideology our young people are educated into is--as I was  reminded again going back to my district, I met with a group of  Ahmadiyya Muslims from Pakistan. Here is a group that didn't come from  Europe. They aren't Christian, but nevertheless, they have a mosque in  Oshkosh, Wisconsin, in my district, and they are obviously…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689603/diversity-equity-and-inclusion"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…to its website, PACEM Solutions is currently registered and/ or partnered  with trusted local firms to work in the following countries: United  States, Iraq, Afghanistan, Pakistan, UAE, Australia, Kenya, Malaysia,  and Kuwait. Public reports indicate companies owned by Representative  Mills sought or entered into contracts to sell munitions to foreign…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697012/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}]