[{"senator": "Martin Heinrich", "party": "Democrat", "sentence": "\"The coronavirus pandemic is having a severe and disproportionate impact on Indian Country."}, {"senator": "Debbie Stabenow", "party": "Democrat", "sentence": "Senators Debbie Stabenow and Gary Peters joined their colleagues to introduce legislation to establish an interagency task force charged with identifying and addressing disparities that are disproportionately affecting minority communities in Michigan during the Coronavirus pandemic."}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "Earlier today, Senators Shaheen and Hassan held calls with community health centers in New Hampshire to discuss the response to the COVID-19 pandemic and areas of urgent need."}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "This sweeping agreement represents a historic step, and I worked hard to provide additional help for Rhode Islanders who are feeling the pain of this pandemic."}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "Thank you for your efforts to support the specialty crop industry, and for your continued efforts in response to the COVID-19 pandemic."}, {"senator": "Dianne Feinstein", "party": "Democrat", "sentence": "The legislation passed by Congress includes direct payments -- up to $1,200 per adult and $500 per child -- to help them get by during this pandemic."}, {"senator": "Gary C. Peters", "party": "Democrat", "sentence": "Senator Gary Peters (MI) today announced a proposal to establish a federal grant program to support local organizations that will provide resources and information to communities of color during public health emergencies like the Coronavirus pandemic."}, {"senator": "Tom Udall", "party": "Democrat", "sentence": "The call follows BLM's April 29 announcement that it would proceed with \"virtual\" public meetings and failed to grant more time to participate to Northwest New Mexico communities that often lack adequate broadband and are being hard hit by the COVID-19 pandemic."}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "Dear Secretary Esper, Acting Secretary Wolf, and Attorney General Barr:\n\nWhile our country fights to combat the novel coronavirus (COVID-19) pandemic, continuing border wall construction places local communities at unnecessary risk."}, {"senator": "Cory A. Booker", "party": "Democrat", "sentence": "As the seriousness of the coronavirus disease 2019(COVID-19) pandemic deepens, medical deferred action is as important as ever."}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "Treasury Department will allow Oregon to use funding from its Hardest Hit fund to assist Oregonians facing housing challenges during the coronavirus pandemic."}, {"senator": "Cory A. Booker", "party": "Democrat", "sentence": "No worker should be forced to choosebetween their paycheck on one hand and the health and health of their colleagues and yourcustomers on the other--a choice that many Walmart employees find themselves having tomake.We recognize the fast-moving nature of this pandemic, and we appreciate Walmart's attemptsto implement certain necessary workplace protections."}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "Dear Secretary Perdue:\n\nWe write to express concerns about how a lack of access to healthy, affordable food is hurting low-income communities and communities of color during the coronavirus (COVID-19) pandemic."}, {"senator": "Cory A. Booker", "party": "Democrat", "sentence": "Our hospitals arenow telling us they will need additional capacity in the morgue as the pandemic continues."}, {"senator": "Gary C. Peters", "party": "Democrat", "sentence": "Senator Gary Peters (MI) today welcomed the State of Michigan's announcement today that it will expand unemployment assistance to Michigan workers impacted by the Coronavirus pandemic."}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "The programs established by the CARES Act are helping to support America's small businesses as they work to maintain operations during the COVID-19 pandemic."}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "Ted Cruz\n\nThe COVID-19 pandemic has taken more than 63,000 American lives."}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "Q: How might scammers exploit the pandemic to steal Iowans' recovery payments?"}, {"senator": "Tim Scott", "party": "Republican", "sentence": "Fortunately, as the United States begins to reopen due to the coronavirus pandemic, there is a new tool to help the most economically distressed communities: Opportunity Zones."}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "That's why, as we continue efforts to curb the spread of this pandemic, we must focus on getting our economy back on its feet and helping the American people safely return to work."}, {"senator": "Lamar Alexander", "party": "Republican", "sentence": "How it can be especially deadly among certain segments of the population, including the elderly, those with pre-existing conditions, and minority populations.\"\n\nAlexander concluded, \"My preacher once said: \"I'm not worried about you on Sunday, it's what you do during the rest of the week.' I'm afraid that during the rest of the week -- between pandemics -- we relax our focus on preparedness."}, {"senator": "Susan M. Collins", "party": "Republican", "sentence": "Department of Transportation's Federal Transit Administration (FTA) has awarded $83,372,447 to help Maine's public transportation systems respond to the COVID-19 pandemic."}, {"senator": "Mitch McConnell", "party": "Republican", "sentence": "The Treasury, of course, is wrestling with all this complicated effort to speed checks to individuals and small businesses to get us through this period until the health care pandemic begins to subside."}, {"senator": "John Kennedy", "party": "Republican", "sentence": "\"Louisiana residents have Secretary Perdue and his team to thank for filling up our food banks, especially in areas hit hardest by the coronavirus pandemic."}, {"senator": "Martha McSally", "party": "Republican", "sentence": "Here is what they mean: if we do nothing, the pandemic will spread fast and spike high, overwhelming our health care system."}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "Bill Benefits.\"\n\n\"NAVPA is pleased with the immediate response from our nation's leadership to protect student veterans as education institutions across the country take action with preventive measures to address the present pandemic crisis of COVID-19,\" said National Association of Veterans' Program Administrators (NAVPA) President Dr."}, {"senator": "James M. Inhofe", "party": "Republican", "sentence": "Jim Inhofe (R-Okla.), chairman of the Senate Armed Services Committee, praised the Coronavirus Aid, Relief, and Economic Security (CARES) Act for prioritizing critical funding and much-needed authorities to protect Department of Defense personnel and bolster national defense throughout the coronavirus pandemic."}, {"senator": "Marco Rubio", "party": "Republican", "sentence": "The Small Business Administration (SBA) Paycheck Protection Program (PPP) is a new program, established by the CARES Act that helps small business owners affected by the COVID-19 pandemic between February 15, 2020, and June 30, 2020."}, {"senator": "Mitch McConnell", "party": "Republican", "sentence": "Senate Majority Leader Mitch McConnell (R-KY) announced today Kentucky is receiving nearly $130 million to assist 347 skilled nursing facilities across the Commonwealth to combat the coronavirus pandemic."}, {"senator": "Josh Hawley", "party": "Republican", "sentence": "The resolution calls on China to pay damages for its criminal conduct to the United States and other nations impacted by the pandemic."}]