[{"senator": "Jimmy Panetta", "party": "Democrat", "sentence": "…individuals  in disaster zones who file early but wait to pay often get confusing  notices and demands for payment. These notices are sent long before  payment is due and also cause panic and confusion during the difficult  task of disaster recovery.\n\nThis bill, again, would fix that issue by requiring the IRS to take  into account tax deadlines postponed because…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689313/disaster-related-extension-of-deadlines-act"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…prevent a  further run on banks in this country. Institutional knowledge should  never be undervalued. We must maintain and keep our institutional  knowledge.\n\nTo prevent further panic in the financial system following the  collapse of Silicon Valley Bank and Signature Bank, the FDIC chose not  to follow the typical resolution process for failed banks, in…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697285/systemic-risk-authority-transparency-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…but our  lives, literally. Each of us had a memory of that moment.\n\nAnd I will never forget, I am sure most of my colleagues won't  either, how we left this Chamber, without panic, but certainly in a  surge of emotion as we heard the pounding at the doors as we were told  to move quickly.\n\nSenators were ordered to move out of harm's way, and we saw through…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698494/9999"}, {"senator": "Ruben Gallego", "party": "Democrat", "sentence": "…colleagues chose  to protect, again, the powerful elites.\n\nIf there is truly nothing to hide in those files, then what are they  so afraid of? What are they hiding? Why the panic? Why the  backpedaling? Why all the objections?\n\nCongress should work for the people, not the powerful elites and  definitely not for one man or one administration. Today's…", "date": "2025-07-24", "source_url": "https://justfacts.votesmart.org/public-statement/1694235/9999"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…Another constituent asked our office, ``Do you think I       should remove my money from the bank?''\n\nThese are only a few samples that showcase the widespread       fear, panic, and instability being experienced by families       who have spent years building safe and productive lives in       Boston. Ending TPS will result in the breaking apart of…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699703/community-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…taking action to stop it.\n\nWe need an adult in the room, and I cannot find a single one on the  other side of the aisle. This President's tantrums are causing economic  global panic. The House must be able to debate and vote on these  tariffs. You have the same farmers I do coming through your offices  right now to tell you it is not just the tariffs;…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689863/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…health. These centers rely on us to make sure we keep  that Federal funding to provide the care for our children.\n\nAgain, I know earlier this year we were all thrown into a panic when  the Trump administration recklessly decided to cut off the Federal  funding. I led 23 of my colleagues with the Congressional Mamas Caucus  in a letter to President Trump.…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691869/job-corps-cuts"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "…their groceries. This is a simple question of our  values.\n\nTaxpayer dollars should be used to care for people, not to fund  masked agents terrorizing our communities, spreading panic, making us  less safe, and killing people.\n\nInstead of lowering costs, Republicans poured billions into DHS, an  agency spreading chaos and making choices with deadly consequences,…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699592/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Mike Levin", "party": "Democrat", "sentence": "…China, rather than handing them the supply chain of the  future. Clean energy is how we reduce volatility, because sunshine and  wind do not spike in price when global markets panic.\n\nThat is why the question is not whether clean energy wins. It is  already winning in every market that allows fair competition to  function. The question is whether America…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700230/winners-of-the-global-energy-race-are-being-decided"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…racism both abroad and in the United States. TPS has       been one of the few stabilizing forces in their lives. The       threat of its removal has triggered intense fear, panic,       despair, and retraumatization. We are seeing clients unravel       emotionally. Individuals who had made progress in therapy are       now regressing under the weight…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699638/expert-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "Mr. FROST. Mr. Speaker, Americans are in a state of total  desperation. For weeks, Floridians have been calling my office in  tears. They are looking at their budgets with panic while President  Trump rips away their healthcare, sends ICE to neighborhoods, deploys  soldiers to new global conflicts, and floods billionaire and  megacorporations with…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698835/americans-in-state-of-desperation"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…By enabling stronger, well-managed institutions  to acquire weaker ones, especially those struggling due to local  economic conditions, we can prevent bank failures and the panic that  they cause.\n\nInstead of making it harder for banks to merge, we should be  eliminating outside obstacles to mergers, enhancing competition and  innovation, and ensuring…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691498/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…with the conclusion we shouldn't do it at all.\n\nOnce again, for every dollar we take in of tax receipts, we are going  to spend $1.43. Why doesn't that almost create a sense of panic, of  agita, for the left or the right?\n\nIs it just that we run into the problem of telling the truth to our  voters after maybe we have lied to them? It is rich people that…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697051/facing-fiscal-reality"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…on  the matter saying: Hey, wait a minute here. It shouldn't be a cause for  celebration when someone gets pregnant out of wedlock. It should be a  cause for a little bit of panic and what are we going to do now; but it  wasn't in the late 1970s as George Gilder documented.\n\nHere we are today. We did do a little bit of looking at the welfare  programs…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699038/reshaping-the-american-family"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…It is 2.3 percent. $86 trillion is the baseline spending for the next  10 years. We are trying in the House reconciliation budget to cut $2  trillion. That caused absolute panic because Washington, D.C., is about  one thing. It is about money. When so much of America makes its money  off D.C. policy, this has caused absolute panic, but it is a fraction.…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693062/stop-bathing-in-folklore-and-start-bathing-in-math"}, {"senator": "French Hill", "party": "Republican", "sentence": "…challenges. They were  challenges before the financial crisis, but it continues today.\n\nThis bill allows banks to keep credit flowing through the economy  while reducing risks that a panic-induced bank run would lead to  unnecessary bank failures.\n\nThe discount window has been underused and burdened by operational  difficulties and stigma. We have seen that on…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699861/bringing-the-discount-window-into-the-21st-century-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…last couple of years. There is a great article. I did  a whole speech on it a couple of years ago.\n\nAI discovered a whole new categories of antibiotics. Remember we were  all panic-stricken that we had diseases and bacterial infections that  we didn't have antibiotics for. The antibiotics weren't working. AI  discovered a whole new category of antibiotics…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694131/dismantling-californias-citizens-redistricting-commission"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…specifically from the  poorer parts of Albany, New York. At the time a woman got pregnant, if  the family was not a married group, they began to collect benefits, and  it was not a panic situation in which, how are we going to support the  child? What are we going to do? Are we going to have to live with your  parents? What are we going to do? It was kind of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695628/breakdown-of-traditional-families"}]