[{"senator": "Joe Morelle", "party": "Democrat", "sentence": "…register to vote.\n\nThink about it, Mr. Speaker. Just to exercise your fundamental,  inalienable rights as a citizen of this country, Republicans would  force Americans into a paperwork nightmare, burying voter registration  under a mountain of bureaucracy and red tape.\n\nSo what exactly would the SAVE Act do?\n\nIt would create enormous burdens for every American…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690001/safeguard-american-voter-eligibility-act"}, {"senator": "Greg Landsman", "party": "Democrat", "sentence": "…can't vote. They  can't register to vote. If they do, they will be deported.\n\nAmerican citizens are being denied their right to vote by requiring,  in this bill, all kinds of paperwork to register, all kinds of  paperwork to vote.\n\nThree examples: For married women, there are 70 million women with an  ID that does not match their birth certificate. It will…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700021/making-it-harder-for-us-citizens-to-vote"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…including 9 million people on Medicaid, will lose healthcare coverage  in about 18 months' time. To keep their coverage, people will have to  complete hours and hours of paperwork just to prove they are working.  That is in spite of the fact that the number of nondisabled adults on  Medicaid who don't work is very low--about 8 percent.\n\nHow do these…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693485/one-big-beautiful-bill-act"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…high percentages of uninsured populations.\n\nThe Georgia Budget and Policy Institute also found that Georgia's  Pathways to Coverage program created burdensome red tape and paperwork  for state agencies and Medicaid recipients.\n\nGeorgia's experience offers a stark warning for the Nation as  Republicans consider steep Medicaid cuts and work requirements…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689905/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…moonlighting in some area where they can make just  enough to afford to buy health insurance on the exchange, if we don't  crush them with high premiums and if we don't make the paperwork  burdens so substantial.\n\nThe CRA that my colleagues are offering will be directly responsive  to the needs of this very, very important group of American innovators  and…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698982/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…harder to enroll in a Marketplace  plan, harder to stay on a Marketplace plan, and harder and more  expensive for States to run a Marketplace.\n\nThe rule requires increased paperwork for families, reduces open and  special enrollment periods, and allows insurers to push more healthcare  costs on Americans by allowing plans to cover less care. That also…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698976/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…days after the       date on which interim regulations are published under this       section, the Secretary shall publish final regulations       implementing this Act.\n\n(d) Paperwork Reduction Act.--The requirements under       chapter 35 of title 44, United States Code (commonly known as       the ``Paperwork Reduction Act''), shall not apply to any…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697541/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…ballot box for nearly 70 million American women. That isn't just a  number; it is personal. It is the working mom in Sandy who can't afford  to take time off work to go get paperwork. It is the woman in Portland  whose name no longer matches her birth certificate and doesn't have  $160 for a passport.\n\nIn the year 2025, I cannot believe I have to come…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690040/voter-suppression-bill-cloaked-in-lies-about-election-integrity"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…of his  passing.\n\nWe have already asked so much of our veterans and their families. It  is entirely unconscionable that while in the fog of grief, we ask them  to navigate paperwork and uncertainty regarding benefits that were  rightly earned just because the day their loved one died doesn't align  well with VA's direct deposit schedule.\n\nThe Ernest…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699468/ernest-peltz-accrued-veterans-benefits-act"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…have this goal of making sure as many people stay       insured as possible and that compliance with federal rules is       not so onerous that people fall off because of paperwork,''       Kidwell said. ``I don't think that's the same in other states       where they might have a different motivation.''\n\nMr. COURTNEY. Madam Speaker, again, this journalist…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694776/congress-long-to-do-list"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…night that doesn't just  support these cuts but makes them actually worse, and their changes  would make it harder for people to stay on their insurance. It would  create more paperwork for patients to fill out. It would make it more  difficult for States to fund their healthcare programs, and it would  leave less people with access to healthcare across…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692644/one-big-beautiful-bill"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…do, which is to  force the Epstein files to be released, which must be backed up by the  force of law because we know that the administration failed to release  half of the paperwork--some 3 million pages. We know that they blocked  out whole pages in order to disguise, apparently, the protection of  powerful men they don't want drawn into this discussion.…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699772/9999"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…so-called Venezuelan  violent gang members deported to the gulag in El Salvador. As it turns  out, according to the Cato Institute, 50 of those men were not  criminals. Their paperwork was in order. They were in the United States  legally, and they hadn't committed any kind of crimes in El Salvador or  Venezuela.\n\nInstead of focusing on criminals, they…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693662/weaponization-of-ice"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…systems that are  already facing a workforce crisis.\n\nLet's talk about what is actually in the Republican proposal. The  majority party wants to impose needless and excessive paperwork  requirements that serve no purpose but to push people off the rolls.  They are importing the worst parts of the private health insurance  industry, needless bureaucratic…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691329/nearly-one-in-four-delawareans-rely-on-medicaid"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…additional       information and stated that it believed the withdrawal of the       Reporting Requirements involves a change to an information       collection under the Paperwork Reduction Act (PRA), and       therefore is not a rule subject to review under CRA. As       explained below, we conclude that the scope of CRA does not       automatically…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699835/government-accountability-office-opinion-letter"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…encourages new public companies to issue more shares without  burdensome regulations so they can focus on hiring and expanding  instead of diverting limited resources to filing paperwork with the  SEC.\n\nThanks to Representative Huizenga's leadership, investors can now  access important disclosure forms electronically for the first time  instead of only on…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697823/increasing-investor-opportunities-act"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…family with his  wife, Patricia Delgado de Suarez, and set his dream in motion.\n\nThe path was anything but easy. The process of immigrating took 7  years of perseverance, paperwork, and determination. In 1990, Jaime was  able to bring Patricia and their four children, Jaime Jr., Adrian,  Lorena, and Paulina, to Omaha, Nebraska.\n\nLife in America demanded…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695647/recognizing-the-suarez-delgado-family"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…from $71 billion in 2019 to $268 billion last  year.\n\nAt the same time, the Biden administration's love of excessive  regulations imposed an additional 4.2 million hours of paperwork  burdens on schools pulling teachers and administrators away from what  matters most--the students.\n\nPresident Reagan said back in 1982, and President Trump has recently…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689153/advancing-america-first-policies"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…women and hand over our hard-won  victories to men. This amendment ensures the Department of War  recognizes these biological realities.\n\nThis is more than about forms and paperwork. It is about whether we  will defend women or whether we will erase them. It is about whether  the strongest military on Earth will be grounded in reality or captured  by…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695260/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…Department of Energy acknowledges that this  rule will increase annual costs for individual manufacturers by  $213,000 and require an additional 2,905 hours of compliance paperwork,  just paperwork, a major burden, particularly for small businesses. As a  small business owner myself, I understand how crushing regulations like  these harm the small businesses…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688545/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…modernization? How  many businesses still run themselves as if it is still the 1990s?  Government does.\n\nI had someone bring me, just the other day, a piece of healthcare  paperwork. I think it might have been from the Indian Health Service.  It was a three-part NCR paper for a purchase order for a healthcare  procedure that you fill out and, I think,…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690586/economic-anxiety"}, {"senator": "Keith Self", "party": "Republican", "sentence": "…decide for themselves whether they want to buy into a  multi-class structure.\n\nMy amendment keeps this package focused on capital formation and  avoids turning it into another paperwork bill.\n\nMr. SELF. I say, again, Mr. Chairman, the information that she is  referencing is already readily discoverable by investors, and they have  the choice whether or not…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697825/increasing-investor-opportunities-act"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…AI revolution is not just coming. It  is already here.\n\nWhether it is managing inventory, scheduling workers, marketing  products, improving cybersecurity, or streamlining paperwork,  artificial intelligence is rapidly becoming how business gets done in  America.\n\nIf small businesses do not have the tools and guidance to adapt to  that, if they are fearful…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699180/ai-for-main-street-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…cartridge, and you have 10  percent on the unit itself. You collect the excise tax. Then you have  to go back to the tax-exempt government agency, have them fill out  their paperwork, submit it over, and then turn back to refund it. We  are just trying to clean up the bureaucracies that are 100 years out of  date.\n\nIt is not that hard. Make up your mind.…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700037/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "…there. And he said a  waitress came by, and he said: She was beautiful; she was beautiful-- which I believe him. And he said she was complaining about the burden  and the paperwork of paying taxes on tips and how challenging it was.\n\nAnd he said he pulled out a pad of paper, and he just wrote on the  pad of paper: No tax on tips.\n\nHe said: What do you…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691422/no-tax-on-tips-act"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…FACA.--Chapter 10 of title 5, United       States Code (commonly referred to as the ``Federal Advisory       Committee Act''), shall not apply to the task force.\n\n(j) Exemption From Paperwork Reduction Act.--Chapter 35 of       title 44, United States Code (commonly known as the       ``Paperwork Reduction Act''), shall not apply to the task       force.\n\n(k)…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696755/strengthening-cyber-resilience-against-state-sponsored-threats-act"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…permanent policy, meaning that  families will pay no taxes on the first $31,500 of what they make.\n\nIt will also save Americans an estimated 210 million hours per year  in paperwork and $13 billion in compliance costs annually.\n\nWe talk all the time about simplifying the tax code. Everybody talks  about it, and we have done it. Since 2017, we decided…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699706/historic-tax-relief-for-families"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…whether cannabis  is or is not right for them. They have access to it in their State.  They need to be able to talk to their medical provider about what they  fill out on the paperwork, what the right dosage amount is, how that is  going to interact with any other medications that they might be on, and  how it might affect their blood pressure or other…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692956/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…regulatory tailoring for those community financial  institutions--cutting red tape; streamlining bank exams and outdated  thresholds so well-run banks can focus on lending, not paperwork;  expanding community and rural banks' access to stable deposits so that  they can lend locally and support small businesses and households;  supporting rural banks; encouraging…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699809/lowering-housing-costs-and-advancing-main-street-community-banks"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…issues the rules required by paragraph (1), the       Commission shall place each entity described in such       paragraph on the list published under subsection (a).\n\n(c) Paperwork Reduction Act Exemption.--A collection of       information conducted or sponsored by the Commission to       implement this section does not constitute a collection of…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690265/foreign-adversary-communications-transparency-act"}]