[{"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…the torture they are experiencing layered with  the daily uncertainty that they are navigating as they try to do right  by their daughter and lay her to rest peacefully.\n\nHer parents are by her bedside. Her 5-year-old asked: When will Mommy  wake up?\n\nAdriana should be here today, her blood clots treated, her voice  trusted, and her pain believed. She…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692035/adriana-smith"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…expertise as National  Teacher of the Year to the Congress and to the Education Committee.\n\nMr. Speaker, I have been an education advocate for decades, and I  speak with students, parents, and educators in Congress and at home in  Oregon, and I can't count the number of times where parents have said  to me: Please, please fully fund IDEA.\n\nAccording to the…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698934/protecting-education-for-children-with-disabilities"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…their homes.\n\nI have seen it firsthand in Chicago. I go into the Hispanic areas of  that great city, and the people are living in fear. They are afraid to  leave their homes. Parents and school administrators are struggling to  explain ICE attacks to children, and Americans are desperately trying  to protect their neighbors.\n\nThe American people support…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699485/department-of-homeland-security"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…tell the American people  exactly what their tax dollars are being used for: imprisoning  children, even infants.\n\nLast month, DHS agents detained a sick 7-year-old and her parents in  an urgent care parking lot while they were trying to get her medical  attention.\n\nThen they sent that child to the Nation's largest family detention  facility, recently…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700028/your-tax-dollars-are-funding-this"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…High School\n\nMr. DAVIS of Illinois. Mr. Speaker, I take this opportunity to pay  tribute to the Whitney M. Young Magnet High School and its  administrators, teachers, staff, parents, and especially students.\n\nWhitney M. Young Magnet High School, located in Chicago, Illinois, is  a public, 4-year magnet high school known for its academic excellence  and…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692107/in-honor-of-charles-rangel"}, {"senator": "Joshua Riley", "party": "Democrat", "sentence": "Mr. RILEY. Mr. Speaker, utility bills are crushing upstate New  Yorkers. I have seniors on fixed incomes who are cutting back on  groceries and working parents who are cutting back on school clothes  for their kids just to keep the lights on.\n\nNow the utility monopolies, which are owned by foreign corporations,  are raising rates…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695743/high-utility-rates-by-foreign-monopolies"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…to reach their full potential.\n\nBeyond his public work, Al Hutchins is a devoted family man and  active member of his faith community. He and his wife, Alice Hutchins,  are parents to Machelle (Joyce) Hutchins, Allison (Andrea) Harrison,  and Tre Hutchins, and proud grandparents of TiGeronika Lindsey, Bryson  Hutchins, and Jru Harrison. He is a member…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698107/recognizing-the-honorable-al-hutchins"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…President Trump and the Republicans' big, ugly bill will cut  Pennsylvania's Medicaid program, known as Pennie, by about $53 million  over the next decade.\n\nWhat will happen to our parents and to our grandparents?\n\nSome facilities may be forced to make impossible decisions like  reducing staff or raising prices for those who don't qualify for  Medicaid. Others…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694077/nursing-homes"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…Childhood Arrivals, or DACA, which for  the last 13 years has benefited countless young people who have come to  this country as infants or young children, brought by their parents  before they could even speak any language, some of them, and many of  them here knowing only English, only the neighborhoods where they live  now, only this country as their…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692242/daca"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…incarcerated prisoners at the California Institute for Women  in Chino, California. She also co-directed the Get on the Bus program  that connected children with their incarcerated parents.\n\nMr. Speaker, I thank Sister Teresa for showing us all what it means  to care for the community. I thank her for her friendship.\n\nI congratulate Sister Teresa on her retirement.…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693061/recognizing-sister-teresa-lynch"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…insurance plans cover comprehensive  benefits, hospitalizations, prescription drugs, and even mental health  and addiction treatment, and we allowed children to stay on their  parents' health insurance until the kids reached--no longer kids, young  men and women reached the age of 26.\n\nWhat was the result? It worked. For 15 years, it worked.\n\nWe achieved…", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697576/department-of-defense"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…birthright of every American.''\n\nI wonder if Governor, future-President Reagan and President Nixon  would recognize their own party today.\n\nI also want to take a moment to speak to parents of young children,  not just in California but across the country, because parents are  rightfully concerned about the safety of what our children eat, what  medications they…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691454/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…Holcombe, WI, who reached out to me  about her 17-year-old daughter Chloe. Chloe was diagnosed with leukemia  last October. Chloe receives chemotherapy 5 days a week, and her  parents drive her almost an hour each way to Eau Claire, WI, so that  she can get the treatments that she needs. Without Medicaid, the cost  of Chloe's treatment would force Shelley…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689511/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…patrolling, and  ICE agents are dramatically ramping up raids across the city, citizens  are starting Instagram pages and Facebook groups to inform fellow  citizens of their rights. Parents are patrolling schoolyards to protect  the rights of students and other parents. Around the country  journalists are investigating and relentlessly searching for and  reporting…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695733/why-i-came-to-congress"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…to ask, Really? Are schools and teachers crying out to repeal  this rule? Really? No, they are not. How does this proposal make any  sense for them or for families? for the parents? for the community? It  makes no sense.\n\nThis resolution would undo, in fact, all of the hard work in closing  the digital divide in States like Connecticut, where people…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690726/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-federal-communications-commission-relating-to-addressing-the-homework-gap-through-the-e-rate-program"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…$2.78 million in community project funding I secured for  the Newton YMCA childcare expansion.\n\nThis funding will allow the Y to open 50 new childcare slots, giving  working parents in Jasper County the reliability and support they  urgently need.\n\nAccess to childcare is not just a family issue. It is a workforce  issue. When parents can't find childcare,…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696794/highlighting-critical-investments"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…consequences are truly tragic for our  kids.\n\nEarlier this month--and I thought this was such an amazing stat--the  Federal Trade Commission revealed that in 2019, Instagram--many parents  and grandparents know their kids and grandkids like to show them  pictures on Instagram. Well, get this. Instagram encouraged  ``groomers'' to connect with children on its…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691286/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…idea that the American taxpayer will have to bail out an industry  to dull the pain of tariffs is not a novel one. We have seen this one.  We have seen this story.\n\nWhat our parents told us when we were kids is still true today:  Actions speak louder than words. The supporters of tariffs know that  their policies impose suffering, and they are willing…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689478/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…housing programs; the  healthcare programs; the food stamp programs; the Pell grants. There is  program after program you get, but you would lose these programs if you  had both parents in a home.\n\nNobody takes advantage of all 90 programs, but I think it is probably  not unusual to have people take advantage of 6 or 7 programs. Then, it  would not be unusual…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689603/diversity-equity-and-inclusion"}, {"senator": "Jon Husted", "party": "Republican", "sentence": "…the path of  adoption for me, which was just an amazing blessing.\n\nAfter a brief stay in foster care, I received the greatest blessing  of my life. I was adopted by my loving parents, Jim and Judy Husted.\n\nI spoke with my mom and dad last night. My dad is amazing, and he is  about to turn 88 years old. He and my mom have always given me the gift  of unconditional…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699107/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…Federal interference.''\n\nFortunately, President Trump and Secretary McMahon are committed to  returning control of education back to the States where it belongs and  empowering parents, local leaders, and definitely teachers, but putting  funding and decisionmaking back in the hands of States is just one  piece of the puzzle.\n\nIf we truly want to improve…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689153/advancing-america-first-policies"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…great  teachers often make many sacrifices as they fulfill their countless  responsibilities. They have earned, and truly deserve, the utmost  gratitude and esteem of students, parents, and community members.''\n\nIt is in that spirit that I rise today and recognize 15 individual  teachers from throughout California's Third Congressional District for  their…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…housing, which I think is maybe the worst program of the  bunch because you are given housing if you are a young person, allowing  you to get out from having to live with your parents as a benefit for  having a low income.\n\nMedicaid; TANF, a cash benefit; childcare; Pell grants; payments for  children with some disabilities, all of these programs are conditioned…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688328/destruction-of-the-nuclear-family"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Governor's words.\n\nNow, this was surprising because his policies have been the 180- degree opposite. For example, he has signed legislation that has taken  away the right of parents to be notified about decisions that their  kids make at school with respect to how they identify, or on this issue  of sports.\n\nIn June 2022, not that long ago, the Governor…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688626/finding-common-ground"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…changed forever.\n\nI will never forget getting that phone call. I remember walking the  school halls a week after the shooting and seeing the pain etched on  the faces of the parents, the students, and the first responders.\n\nI attended the funerals. I wept with the families. Those were our  kids. These were our teachers. These were our neighbors.\n\nYet,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691383/anniversary-of-santa-fe-shooting"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…I rise today to honor the life of  Mr. Joseph Rylon Wills, Jr., a man of faith, service, and dedication.\n\nBorn in 1957 in Plant City, Florida, Joe was raised by his loving  parents, Rylon and Gail. He was active in church and sports,  demonstrating a commitment to faith and teamwork from a young age.\n\nIn 1982, he married Stacy, his lifelong partner,…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687985/mourning-the-loss-of-john-reginald-murphy"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…cuts are not extended, we will see  a multitrillion-dollar tax hike, the largest in history, and 62 percent  of American taxpayers will see a tax increase in 2026. Working parents  will see the child tax credit cut in half, and the average family of  four that earns $80,000 a year will face a $1,700 tax increase. Back  home in Texas, my constituents…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689668/government-funding"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…Fritsch.\n\nReese was born on October 7, 2025 at 2:45 P.M. at Luminis Health Anne  Arundel Medical Center weighing seven pounds, two ounces and measuring  21 inches long to loving parents Taylor and Kristin Flukey Fritsch, who  serves as a valuable member of my team on the Subcommittee on Health  for the House Committee on Energy and Commerce.\n\nI'm grateful…", "date": "2025-10-24", "source_url": "https://justfacts.votesmart.org/public-statement/1696399/recognizing-reese-patricia-fritsch"}, {"senator": "James Risch", "party": "Republican", "sentence": "…flow of these drugs to the United  States.\n\nI have told the President face to face: Thank you, Mr. President, for  what you are doing, and I want to thank you on behalf of the parents  who will not have to early bury one of their children because of the  drugs that were coming into this country. Instead those drugs are lying  at the bottom of the ocean.…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697780/9999"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…I told my Committee on Rules colleagues last night in  committee, in my time in treatment at MD Anderson, going through chemo  seemed trivial to me compared to watching the parents at MD Anderson  who were watching their children go through treatment.\n\nMolly went to Heaven last week while visiting a friend in Italy, and  I think I speak for everybody…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690387/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}]