[{"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…Americans who get coverage through Medicare, Medicaid--which is so many  of our seniors when they are in assisted living with their long-term  care, and people's parents and grandparents--as well as coverage under  the Affordable Care Act, including over 2 million Minnesotans. In fact,  Medicaid actually provides healthcare for 20 percent of my rural…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688282/department-of-health-and-human-services"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…solidarity with their union brothers and sisters. That is part of our  DNA. That is part of why we fight so hard. We can all trace a similar  story, an inheritance from our parents and grandparents, all of us have  that kind of story to tell.\n\nWhy am I so thankful that my parents made what I believe was a tough  personal decision, but, of course, the right decision?…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…massive and huge tax breaks to billionaires paid for by stealing from  working Americans. That is not hyperbole. That is just the truth. It  rips away Medicaid from parents and grandparents. It slashes food  assistance for children. The biggest cut in food assistance in history  is contained in this bill. It drains resources from the moms and dads  all…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691512/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…Medicaid. It is not maybe the first word on  everyone's minds when they wake up in the morning because sometimes  people don't know that Medicaid is helping their parents and their  grandparents pay for their assisted living.\n\nIn my case, I knew that my dad was in assisted living that was paid  for by his savings--he had late-onset Alzheimer's--and I knew…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689542/h-con-res-14"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…community because the State of Alabama did not provide a good  education to Black children. As explained in his autobiography, he  wanted to teach children, whose parents and grandparents had been  enslaved on plantations nearby, to be of better service to themselves,  their employers, and the community in which they lived.\n\nIn the 1930s, my father…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689639/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Richard Neal", "party": "Democrat", "sentence": "…evolution of media and the challenges facing traditional  broadcast television, ASMW remains a beloved and enduring institution.  It is now a generational program, with parents and grandparents proudly  watching their children and grandchildren compete on the same stage  where they once stood. Each year, the championship match becomes a  regional event, covered…", "date": "2026-01-23", "source_url": "https://justfacts.votesmart.org/public-statement/1699382/recognizing-the-65th-anniversary-season-of-as-schools-match-wits"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…that their grandparents also  crossed borders and shores to get here, but let me say to you, you may  have forgotten your roots, you may have forgotten that your parents or  your grandparents or your great-grandparents were immigrants, but I  haven't.\n\nI am the proud daughter of Guatemalan immigrants, the wife of Boris,  who until recently, was a DACA…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689781/defending-social-services-and-programs"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…remarks and for coming here this  evening to talk with us.\n\nMr. Speaker, home health aides are some of the most essential workers  in our economy, taking care of our parents and grandparents as they age  and ensuring that sick and disabled people can live with dignity.\n\nIt is downright despicable that this administration has proposed to  reverse the rule…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695577/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…War II stands as one of those  uncomfortable chapters that Trump and his administration are attempting  to erase. More than 125,000 Japanese Americans, including my parents  and grandparents, were rounded up and placed in desolate camps at the  hands of their own government.\n\nThere are dozens of these camps memorialized around the country for  people…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699716/rewriting-history"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…conversations 9 years ago, when I  first asked my neighbors to place their trust in me to represent them,  to even just this weekend at the grocery store, I have heard from  parents, grandparents, and small businesses alike that the childcare  crisis is suppressing our economy and forcing families to make  impossible decisions.\n\nIt is more expensive to send…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699582/stop-the-republican-affordability-crisis"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…necessary healthcare.\n\nWe see a spike in no-shows and cancelations at health clinics as  patients would rather miss critical care than risk detainment. We see  young parents and grandparents alike attending their immigration court  hearings, eager to officially call this country their home, only to be  met with handcuffs and shoved into cars by masked…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692413/protecting-our-immigrant-communities"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…because the State of Alabama did not think it important to educate  Black children. As he explained in his autobiography, he wanted to  teach the children, whose parents and grandparents had been enslaved on  the plantations nearby, to be of better service to themselves, to their  employers, and to the community in which they lived.\n\nIn the 1930s,…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698124/dismantling-the-department-of-education"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…talking about elite Ivy League institutions. I am  talking about community colleges; I am talking about state colleges. I  am talking about legacy institutions where parents and grandparents  went to, and it means something to be able to get into that school and  graduate.\n\nI have talked to young people who don't know if there will be any  money for them…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691088/big-backstabbing-bill"}, {"senator": "Doris Matsui", "party": "Democrat", "sentence": "…it is being erased.\n\nIn 1942, President Roosevelt signed Executive Order 9066, approving  the removal of American citizens of Japanese descent to remote camps.  My parents and grandparents were among the 120,000 forced to leave  their homes and their businesses.\n\nThey were sent by their own government, our government, to a camp in  Poston, Arizona. They…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699717/rewriting-history"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…the day, no matter what my Republican friends say,  because of this budget, more kids will go without food. More kids will  be malnourished. Because of this budget, parents and grandparents will  have to sell their houses to afford medical care. Because of this  budget, more consumers will get ripped off. Because of this budget, our  air and water will…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689864/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…emotional,  financial, or neglect. For every elder abuse case that is reported, as  many as 24 go unreported, it is estimated.\n\nThese aren't just numbers. They are our parents, our grandparents,  our neighbors, and our veterans. Elder abuse isn't limited by geography  or income. It occurs in nursing homes and private residences, the very  places meant to…", "date": "2025-06-16", "source_url": "https://justfacts.votesmart.org/public-statement/1692579/national-elder-abuse-awareness-month"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "Mrs. FISCHER. Mr. President, across America, 1.3 million people live  in nursing homes. Many of us have parents, grandparents, or other loved  ones who rely on these homes for care and community in their golden  years. We understand just how vital nursing homes are--whether it is in  urban,…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688195/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…truly tragic for our  kids.\n\nEarlier this month--and I thought this was such an amazing stat--the  Federal Trade Commission revealed that in 2019, Instagram--many parents  and grandparents know their kids and grandkids like to show them  pictures on Instagram. Well, get this. Instagram encouraged  ``groomers'' to connect with children on its platform.…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691286/statements-on-introduced-bills-and-joint-resolutions"}]