[{"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…foreign mission with respect to the location,  expansion or replacement of a chancery, the Board consists of the  Executive Director of NCPC, the Director of the National Park Service  (or, if the President so designates, the Secretary of Defense, the  Secretary of the Interior or the Administrator of General Services) and  the three mayoral appointees.…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693426/introduction-of-the-district-of-columbia-board-of-zoning-adjustment-home-rule-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Woodbrook Superfund  Site, and associated conservation efforts throughout the area. Dorothy  played a pivotal role in securing grants from Sustainable Jersey and  the National Park Service, including twenty-five thousand dollars to  provide composters to residents. In 2015, Dorothy was named a  Sustainability Hero by Sustainable Jersey. I am confident that…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698050/recognizing-dorothy-giamboi-for-nearly-fifteen-years-of-public-service"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Commission (Commission). Currently, the membership of the Commission  consists of two federal officials the (the Architect of the Capitol  (AOC) and the Director of the National Park Service (NPS)) and three  members appointed by the D.C. mayor, subject to D.C. Council approval.  Federal officials are members of the Commission even though the  Commission has…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692763/introduction-of-the-district-of-columbia-zoning-commission-home-rule-act"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…one  of us.\n\nThat story should be told in its totality, but we have a regime that  fears diversity and is trying to erase it from our history. From  directing the National Park Service to remove aspects of American  history from exhibits, such as slavery, to targeting immigrant  communities across the country, to its all-out war on diversity and  inclusion,…", "date": "2026-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1700306/hawaiian-language-month"}, {"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…of the Coalition to Protect America's National  Parks is so critical. This nonpartisan organization is made up of more  than 4,800 current, former, and retired National Park Service  professionals, people who have devoted over 50,000 years of combined  service to caring for our most valuable, natural, and cultural  resources. These are experts. These…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699714/rewriting-history"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "Mr. Speaker, in 2012, the National Park Service conveyed this 3.62- acre parcel of land in Kentucky to the city of Paducah through the  Federal Lands to Parks Program.\n\nThis program allows States, counties, and local…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697650/removing-restrictions-from-a-parcel-of-land-in-paducah-kentucky"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…cost savings, but the reality is there are no meaningful savings or  other benefits for average taxpayers.\n\nReal people's lives are being turned upside down: our National Park  Service and workers at a number of Federal agencies, farmers, and  firefighters. Everyone who depends on Federal services is feeling the  squeeze of this reckless agenda. Meanwhile,…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688067/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…is something that went through the special use  permit process. It was for one of these undersea cable landings. Things  got very complicated.\n\nThankfully, the National Park Service was able to charge market rent  for the rights to go through this area, and it turns out that that was  a good thing because there were all sorts of complications. In fact,…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699959/undersea-cable-protection-act-of-2025"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…next year our Nation will celebrate its 250th birthday.  H.R. 4285, the STARS Act, would mark that milestone on September 17,  2026, by providing free entrance to National Park Service sites and  waiving standard amenity recreation fees to sites managed by the Bureau  of Land Management, the Fish and Wildlife Service, the Bureau of  Reclamation, and the…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697763/semiquincentennial-tourism-and-access-to-recreation-sites-act"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…year.\n\nThe bill before us today would redesignate the site to more  accurately reflect the scope, scale, and significance of the resources  managed there by the National Park Service.\n\nMr. Speaker, this is an important update to an important historical  resource, and I thank Representative Moulton for his leadership on this  bill. I urge my colleagues…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691014/salem-maritime-national-historical-park-redesignation-and-boundary-study-act"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "Mr. PADILLA. Mr. President, I rise to introduce the Ackerson Meadow  Land Exchange Act. This legislation will facilitate a simple land  exchange between the National Park Service and the U.S. Forest Service  in the Sierra Nevada.\n\nThis bill would transfer 160 acres of Stanislaus National Forest land  to the National Park Service to be managed as…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695778/by-mr-padilla"}, {"senator": "Chellie Pingree", "party": "Democrat", "sentence": "…binding  spending requirements that constrain executive overreach.\n\nThis will provide much-needed funding and certainty to public land  management agencies, like the National Park Service, that have suffered  tremendous disruption over the past year.\n\nThe bill also protects funding for programs important to combating  and adapting to climate change. It rejects…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698754/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Doris Matsui", "party": "Democrat", "sentence": "…soldiers. It began with fear, with racist, incendiary rhetoric, and  with leaders who decided unjustly to single out an entire community as  a threat.\n\nThat is why the National Park Service's decision to remove references  to the incarceration of Japanese Americans, along with other hard  truths about our history, is not benign. It is deeply reckless.\n\nHistory…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699717/rewriting-history"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…development team at the Senate Sergeant at Arms--so staff and  volunteers would have real-time access to the most up-to-date plan.\n\nMaggie Tyler, detailed from the National Park Service, worked  tirelessly with the Capitol Police, Tyler Pumphrey and Liz Aduso from  the Office of Congressional Accessibility Services, and other Capitol  Hill and DC partners…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691709/recognizing-the-joint-congressional-committee-on-the-inauguration"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "Mr. WALKINSHAW. Mr. Speaker, I rise to recognize the honorees of the  2025 Elly Doyle Park Service Awards. These awards, sponsored by the  Fairfax County Park Authority Board in cooperation with the Fairfax  County Park Foundation Board, recognize individuals and organizations…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696038/recognizing-the-2025-elly-doyle-park-service-awardees"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…current  building and surrounding land from the city of Paducah. However, these  plans are stalled by an outdated Federal deed restriction put in place  by the National Park Service on the land where the Boys & Girls Club  currently operates.\n\nH.R. 1276 removes that restriction, which would, in turn, allow the  city of Paducah to transfer the parcel…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697651/removing-restrictions-from-a-parcel-of-land-in-paducah-kentucky"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "…Recreation Sites Act, which  doesn't exactly roll off the tongue, so we call it the STARS Act,  designates Constitution Day, September 17, 2026, as a fee-free day at  National Park Service sites and extends fee waivers to Federal lands  managed by the Bureau of Land Management, the Fish and Wildlife  Service, the Bureau of Reclamation, and the United States…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697764/semiquincentennial-tourism-and-access-to-recreation-sites-act"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…Club. There is no time to waste in  making this commonsense fix to enable this project to move forward.\n\nI was proud to collaborate with the city of Paducah, the National  Park  Service, and local stakeholders to develop a legislative solution to  this issue. It ensures that the Federal Government's unnecessary  involvement no longer stands in the way…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697652/removing-restrictions-from-a-parcel-of-land-in-paducah-kentucky"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…hope the redesignation will  lead to more visitors by highlighting the various attractions.\n\nIn addition to the redesignation, this legislation also requires the  National Park Service to conduct a boundary study of related sites to  assess their feasibility for future inclusion in the historical park.\n\nMr. WESTERMAN. Mr. Speaker, I have no further requests…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691015/salem-maritime-national-historical-park-redesignation-and-boundary-study-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…that we as Members of Congress vote on is borrowed?\n\nIf you told me today that I have to balance the budget, I can do it.  Every part of government has to be shut down--no Park Service, no  Congress, no EPA, no FDA. Everything that is discretionary is gone.  Today, my math is that several hundred billion dollars of mandatory  spending have to be gone.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698698/congress-is-a-math-free-zone"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "…action by Congress.       Both Congress and the President have designated monuments to       be overseen by federal land agencies including, for example,       the National Park Service and BLM.      Grand Staircase-Escalante Resource Management Plan\n\nBLM issued the Grand Staircase RMP to establish a       management plan consistent with Presidential Proclamation…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700255/us-government-accountability-office-decision"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Mr. Speaker, I move to suspend the rules and pass the  bill (H.R. 4285) to direct the Secretary of the Interior to designate  an entrance-fee free date in 2026 at National Park Service sites in  order to celebrate the 250th anniversary of the United States of  America, as amended.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697765/semiquincentennial-tourism-and-access-to-recreation-sites-act"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…bought  the land from local residents and donated it back to the Federal  Government in 1937.\n\nToday, it is recognized as the Fort Laramie National Historic Site.  National Park Service employees and volunteers keep the site open year- round for visitors. Through displays and tours, they document and  explain the incredible history of people in the area…", "date": "2025-07-31", "source_url": "https://justfacts.votesmart.org/public-statement/1694485/100th-anniversary-of-fort-laramie-wyoming"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "…designates the George C. Marshall  House in Virginia as an affiliated area within the National Park  System. It is simply allowing them to be affiliated with the National  Park Service. This bill also passed with unanimous support.\n\nWhat do these bills have in common? Well, they are bipartisan. They  all passed the body unanimously, without a single ``no''…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698423/unanimous-consent-requests-the-calendar"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…tomorrow, June 6, marks the 81st  anniversary of D-day, June 6, 1944.\n\nIn my district, Bedford County, Virginia, is designated as a World  War II Heritage City by the National Park Service, the only such World  War II Heritage City in Virginia.\n\nBedford County is home to the National D-day Memorial. This memorial  commemorates the soldiers who courageously…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692106/national-d-day-memorial-in-bedford-county-virginia"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…call  up the joint resolution (H.J. Res. 60) providing for congressional  disapproval under chapter 8 of title 5, United States Code, of the rule  submitted by the National Park Service relating to ``Glen Canyon  National Recreation Area: Motor Vehicles'', and ask for its immediate  consideration in the House.\n\nThe Clerk read the title of the joint resolution.…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690405/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…actually look at it, it is a lot of money.\n\nDid I mention that we are borrowing $6 billion a day? We went from  $662 billion--this is nondefense discretionary, this is the Park  Service, this is the IRS, this is the State Department, all of the  things we think of as the government--it went up to $960 billion.\n\nYet, why this is important to understand--I…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690748/the-math"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…have to find out.\n\nHow many of Yosemite's employees are working from home? We don't know  because the park management won't tell us. We do know that 34 percent  of National Park Service employees across the country were still  working from home in 2023. Need to find the nearest unlocked restroom?  Just email them.\n\nIndeed, the employees who provide most…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688585/yosemite-belongs-to-the-people"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "…I rise in support of this resolution, H.J.  Res. 60, which provides congressional disapproval under the  Congressional Review Act of the rules submitted by the National Park  Service on the Glen Canyon National Recreation Area pertaining to motor  vehicles.\n\nThe National Park Service finalized a rule that restricts off-road  vehicles and all-terrain…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690403/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…H.R. 2388, the Lower Elwha Klallam  Tribe Project Lands Restoration Act, sponsored by Congresswoman  Randall. H.R. 2388 would take approximately 1,083 acres of National  Park Service land into trust for the Lower Elwha Klallam Tribe.\n\nThe Tribe is located within the Olympic Peninsula in northwest  Washington and has approximately 984 enrolled members.…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697609/lower-elwha-klallam-tribe-project-lands-restoration-act"}]