[{"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…Oregonians.\n\nIn Portland, ICE wrongfully separated a young, loving mom from her  four little children for 4 months.\n\nIn Hillsboro, multiple unmarked SUVs circled a man in a parking lot.  He was simply going to pick up groceries. In Beaverton, ICE was parked  on the street, randomly scanning license plates of cars, and then  checking names. They wrongfully…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696911/aggressive-immigration-enforcement-tactics-in-oregon"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…an open and public-private  building with public access, public accommodations, and the public  coming into the building for eating. It has a big cafeteria. It has a  big parking lot that the public uses and is used by city hall, which is  located right in the middle--or not in the middle, but surrounded by  the Reagan Building.\n\nThe amendment that I…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699075/providing-for-consideration-of-hr-financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…must abide by. This means  Federal immigration officials must stop racial profiling and random  arrests.\n\nYou have seen the videotapes, and I have as well. In a Home Depot  parking lot, a Latina--Hispanic woman--gets out of the car and starts  to walk into the store and is stopped by ICE agents who want her to  show proof of her citizenship. That kind…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699485/department-of-homeland-security"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…sudden closing of these centers has left students  devastated. I wish my colleagues would see the images of the young  people dragging their black trash bags through the parking lot with  nowhere to go.\n\nIt is heartbreaking for these students, who have worked so hard to  join the workforce, to have the rug pulled out right from underneath  them with…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691869/job-corps-cuts"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…insurance and we have a serious problem, well, we can go to  the emergency room and just get in the back of the line that is going  all the way around the block and through the parking lot and everyplace  else because these hundreds of thousands of people without healthcare,  that is where they will have to go when it is so painful they can't go  to work.…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689546/h-con-res-14"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…these very things were going on in their own towns, in their own  States, in their own communities.\n\nImagine being pulled over and asked for your papers as you pull into  the parking lot at Target. Imagine Federal agents waiting at the top of  off-ramps from the highway where you have to stop, determining by  looking at you if you might be an illegal alien…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699401/9999"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…to expand the use of security cameras at postal  facilities in the District of Columbia and across the country after  learning that a D.C. resident had been robbed in the parking lot of a  post office in D.C. The parking lot was not monitored by a security  camera. USPS responded that it was not financially feasible to install  and maintain security…", "date": "2025-12-30", "source_url": "https://justfacts.votesmart.org/public-statement/1698472/introduction-of-the-postal-facilities-security-camera-act"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…the music video  contained these lyrics: ``Bomb bomb Iran; bomb bomb bomb bomb bomb Iran  . . . ; went to a mosque, gonna throw some rocks . . . ; time to turn  Iran into a parking lot.''\n\nWe shouldn't premise a decision to send our sons and daughters into  war on the judgment of a single person.\n\nThe President patted himself on the back, and he compared…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693124/motion-to-discharge-sj-res-59"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…justice according to State law.\n\nJudge Dugan allegedly ushered the migrant out a side door. A week  later, FBI agents show up at her courthouse. When she pulls up to the  parking lot, they take her out of the car and put her in handcuffs.  They perp walked her in a public manner that was meant to send a  message to any other judge who stood up for the…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690393/attacks-and-threats-on-democracy-and-rule-of-law"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…exactly what their tax dollars are being used for: imprisoning  children, even infants.\n\nLast month, DHS agents detained a sick 7-year-old and her parents in  an urgent care parking lot while they were trying to get her medical  attention.\n\nThen they sent that child to the Nation's largest family detention  facility, recently reopened by Trump, a facility…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700028/your-tax-dollars-are-funding-this"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "…and  for good reason. They don't want human beings held in a makeshift jail  down the street from their child's high school. They don't want masked  agents in their church parking lot. None of this makes Arizonans safer.\n\nCongress has a duty to rein in the Department of Homeland Security  that is absolutely out of control. I won't stop until that happens.", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699702/chaos-at-department-of-homeland-security"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…colleagues from New  York, Mr. Kennedy and Mr. Garbarino, would require TSA to study the  possibility of allowing employees' shifts to start upon arrival at the  airport's parking lot and bus and transit stops.\n\nThese employees often face long commutes to get to the airport from  the parking lot and then must travel long distances from the airport  parking…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688740/tsa-commuting-fairness-act"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…Hell. They  blocked the stairs to the childcare area so that the parents couldn't  reach their kids, and as parishioners tried to flee the chaos, they  followed them into the parking lot, surrounded their cars, and  attempted to trap families inside.\n\nOne child told his father:\n\nDaddy, I thought you were going to die.\n\nWhen the ringleader of this invasion…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699689/immigration"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…Despite these centers having pulled in tens of millions of taxpayer  dollars, the childcare centers were actually empty. There were no  children; there were no cars in the parking lot. Usually--not even any  staff to come answer the door. These were visits that were made during  the day when one would assume that children and their caretakers would  be…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698560/fraud-accountability-act"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…Murrah Federal Building. Across  the street was  the Journal Record Building; it just demolished a big section of that  as well, blew out all the windows, destroyed it. In the parking lot  there in front of that building was an American elm tree. It was a  scrubby tree growing in a parking lot. If you have seen a tree in the  parking lot, you know it is not…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690112/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…our  local police officers, but we really should be committing to do this  throughout the year.\n\nI started a little tradition. I actually did it on the walk over from  the parking lot to the University of Utah Huntsman Center basketball  game. There are always a few police officers there directing traffic  for the few hours of that. I had four boys under…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691166/events-this-week"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…ground and said when Molotov  cocktails are thrown at officers, when a commercial dumpster is used as  a battering ram in order to break into a Federal office building's  parking lot, when roadways are shut down, this looks a lot like there  is a disruption of the ability to carry out Federal law.\n\nAgain, it is not me saying this. This is a unanimous…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693143/condemning-the-violent-june-2025-riots-in-los-angeles-california"}]