[{"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…our country. She worked tirelessly to  ensure veterans received the benefits and services they earned,  providing both in-person and virtual benefits counseling. She also  partnered closely with veteran service organizations and nonprofit  groups to help veterans navigate and access the support available to  them.\n\nEven in retirement, Rebecca continues…", "date": "2026-02-17", "source_url": "https://justfacts.votesmart.org/public-statement/1700085/recognizing-rebecca-sawyer-smith"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "…Kyla       Guerrero said. ``And working with a local farm has been super       fun.'' Guerrero is one of two local Girl Scouts working on a       Gold Award Project. She's partnered with Around the Bend       Farms to get youth involved and make farming a little more       eco-friendly.\n\n``We're creating this food scrap to compost system where…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695344/recognizing-kyla-guerrero-for-her-impressive-gold-award-project"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…addiction--will not       have the same direct impact on HHS proposals and will not be       elevated as a resource and partner for other components of       HHS. SAMHSA has partnered with HRSA on workforce, CDC on the       impact of infectious diseases on people with mental illness,       NIH on early psychosis programs and CMS on health homes and…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692341/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…eliminating honest conversations about race is  not about education, it is about control. We must ensure that  Juneteenth is not just a day off but a day of truth.\n\nIn 2005, I partnered with then-Senator Barack Obama to introduce  legislation recognizing Juneteenth. And now that it has become law, we  must defend it and the history it represents from being…", "date": "2025-06-20", "source_url": "https://justfacts.votesmart.org/public-statement/1692688/commemoration-of-juneteenth-amid-the-erosion-of-black-history"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…possible to improve access to healthier foods.\n\nIn New York City, local nonprofits, the Centers for Disease Control  and Prevention, and the online grocery platform Mercato have partnered  to help thousands of low-income New Yorkers with diet-driven chronic  diseases purchase more nutritious food. The United Way of New York City  is anchoring one produce prescription…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689401/end-hunger-now-with-innovative-ways-to-feed-hungry-people"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…negotiations.\n\nThe Fiscal Responsibility Act directed the Biden administration to  study the possibility of improving digital tools for permitting.  Representatives Johnson and Peters partnered to turn those Biden  administration recommendations into good legislation. The current  administration has helped finalize the bill with further input from  both Democrats…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697678/epermit-act"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…highlight the extraordinary work of an  organization from Los Angeles that has lessons for every community in  America.\n\nNearly two decades ago, then-Mayor Antonio Villaraigosa partnered  with my good friends, philanthropists Melanie and Richard Lundquist, to  launch the Partnership for Los Angeles Schools. Dr. Lundquist is with  us today.\n\nTheir nonprofit…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695654/partnership-for-la-schools"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…profound sense of joy from helping those in need and has  organized an annual Thanksgiving food drive for over twenty years. The  food drive started two decades ago when Terri partnered with her  daughters' Girl Scout troop to create 19 food baskets to deliver to  families in need. Driven by Terri's enthusiasm and hard work, the food  drive blossomed over…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699949/recognizing-terri-judah"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…resilience challenges in remote and Tribal areas  are the focus of the U.S. Department of Energy's Energy Transitions  Initiative Program. Since its inception, this program has partnered  with over 25 Tribal, coastal, remote and island communities across the  Nation to help them secure reliable and affordable energy.\n\nThe Energy Transitions Initiative Partnership…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692645/introduction-of-the-energy-transitions-initiative-authorization-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…machine to       protect its profits. The American Bail Coalition, its chief       lobbying group, spends millions to oppose reform efforts       across the country. It has partnered with well-funded       conservative organizations to push legislation that       criminalizes charitable bail funds--programs that help       families avoid these predatory…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696985/opposition-letter-by-the-southern-poverty-law-center-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "…the U.S. Navy, Air Force, Army,  Marine Corps, and now Space Force. And I will include the Coast Guard,  too, because we like to count the Coast Guard, especially when they  partnered with us on things that really mattered to the United States.\n\nYou know, one of those that I would like to discuss, where we should  see more involvement from the Coast Guard,…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696346/trump-administration"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "…emergency response, so as the ranking member of the  Transportation and Infrastructure's Economic Development, Public  Buildings, and Emergency Management Subcommittee, I partnered with  Congresswoman Dina Titus on the Extreme Weather and Heat Response  Modernization Act, which, among many other things, will study the  unexpected impacts of heat on…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695656/extreme-heat-caucus"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…First Class Hanf makes this  bill all the more important.\n\nI have been honored by all the wide-ranging organizational support  for the bill and for my colleagues who have partnered with me on this  mission.\n\nMadam Speaker, I thank Congressman Max Miller for being my co-lead  and Senators Moran and Rosen for championing this bill in the Senate.\n\nAs the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695467/fallen-servicemembers-religious-heritage-restoration-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…realistic images in video platforms.\n\nKia's app will be honored here in our Nation's Capital later this  year.\n\nI also paid tribute to the school's robotics club that has partnered  with NASA. They were the only high school in the United States of  America selected alongside other higher education institutions like  MIT.\n\nBravo Perkins.\n\nAfter 4 school…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699254/perkins-high-school-stem-achievement"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…homeless. That hospital realized they could save money and better treat  these patients, by paying for supportive housing.\n\nJoliet is applying a similar lesson. They have partnered with the  local hospital and a mental health company to offer free mental health  services with a clinician, usually within 24 hours. Whatever insurance  won't cover, the…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688330/recognizing-the-joliet-emsfire-department-program"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…Salvation Army of Harrisonburg and  Rockingham County was established on June 27, 1925.\n\nSince its founding, the Salvation Army of Harrisonburg and Rockingham  County has partnered with the local community to efficiently and  effectively assist individuals and families facing poverty. It has made  a positive difference in countless lives, offering a…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689009/recognizing-salvation-army-of-harrisonburg-and-rockingham-countys-100th-anniversary"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…communities--warmth, structure,  and shelter. When they learned that 17 Navajo men had tragically passed  away due to inadequate shelter, Connie and Bill jumped into action.  Now, partnered with numerous organizations, they have been committed to  helping and improving the lives of Native Americans in the American  Southwest.\n\nOne facet of ANA's outreach efforts…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694745/recognizing-bucks-county-americans-for-native-americans"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…$15 million reward for his capture.\n\nThe 2020 indictment described how Maduro and his top lieutenants  served as leaders of the Cartel de los Soles for over two decades and  partnered with known designated foreign terrorist organizations to  move, at the time, over 250 tons of cocaine through Venezuela--cocaine  that was cultivated, manufactured, and moved…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698885/successful-operation-to-arrest-nicolas-maduro"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…waste, and ensuring that every  taxpayer dollar delivers immeasurable results.\n\nBeyond tackling bloat, inefficiencies, and burdensome regulations,  the administration has partnered with us to deliver real results for  the American people.\n\nToday, congressional Republicans are partnering with them through my  bill, the American Entrepreneurs First Act.…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692123/american-entrepreneurs-first-act-of-2025"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…County.  These are not abstract policies. They are practical, meaningful  improvements that directly serve Iowans.\n\nI am deeply grateful to the city and county officials who partnered  with me on these efforts. I came to Congress to deliver for Iowa, and I  will continue fighting to make sure our communities get the support  they have earned.…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699896/delivering-for-iowa"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…For over 30 years, Mac has been the trusted voice of the Brainerd  Lakes Area. He began on the Power Loon in 1992, advanced to morning co- host in 1997, and for 25 years partnered with his friend Danny Wild-- until Danny's passing in 2025.\n\nSince 1994, Mac called play-by-play for Brainerd Warriors sports,  covering over 2,000 games in football, basketball,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699726/9999"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…message to the CCP that we will not  allow foreign powers to erode national security, steal intellectual  property, or threaten our immigrant population.\n\nThis Congress, I have partnered with my colleagues on other  legislation in this area. My bill, the bipartisan Countering  Transnational Repression Act, continues this important work by stopping  Chinese…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690825/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…Measurement, or ARM, user facility, which gathers  data pertaining to clouds and radiation processes in cold environments  and high altitudes.\n\nGiven its strengths, NASA has partnered with this DOE facility to  conduct research in areas such as aerosols. In addition, any  atmospheric data from ARM stands to benefit the Pacific Spaceport  Complex on Kodiak…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688986/doe-and-nasa-interagency-research-coordination-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…program has provided thousands of nutritious meals  and vital daily contact with elderly, homebound adults.\n\nThis year, to celebrate the milestone, Senior Citizens, Inc.  partnered with local chefs, including James Beard Award winner Chef  Bailey. Chef Bailey assisted in crafting special gourmet meals as a  tribute to the people they serve.\n\nMeals on…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692062/meals-on-wheels-65th-anniversary"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…with patient  intake and front desk duties, while at BayCare, they recruit  participants for the Health Buddies program to enhance senior well- being. Recently, RSVP Pasco partnered with Solo Moms to empower single  mothers and with the American Cancer Society to help patients access  life-saving treatments. Each partnership reflects the program's  commitment…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690139/recognizing-ann-wilkinson"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…his commitment to repealing excessive  regulations. However, we must take further steps to prevent future  administrations from issuing similar mandates.\n\nThat is why I have partnered with Representative Fulcher to introduce  the Choice in Automobile Retail Sales, or CARS, Act, which will prevent  similar EV mandates and safeguard Americans' freedom to…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689285/put-consumers-back-in-the-drivers-seat"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…beings  and drugs into our country. In 2021, 2022, 2023, and 2024, the  executive branch of our government--the prior President and Secretary  of Homeland Security--effectively partnered with the criminal cartels  to traffic human beings and drugs into the heart of our country.\n\nThe impact that we had to bear was immeasurable. It delivered  generational trauma…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695204/people-are-sick-and-tired"}, {"senator": "Elise Stefanik", "party": "Republican", "sentence": "…Saratoga Flag  Company.\n\nTo pay for all 78 flags and the necessary hardware the Troys raised  money through neighbors and local businesses. To install the flags, the  Troys partnered with Veteran Mike Savage, the Middle Falls Fire  Department, and local leaders so that the flags are all up by Memorial  Day. Marie and David Troy are an  example to New…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694912/recognizing-marie-and-david-troy"}, {"senator": "John McGuire III", "party": "Republican", "sentence": "…Hyperbarics has become a  frontline in the fight for veterans suffering from the invisible wounds  of war.\n\nThey recently launched the Hyperbaric Wellness Foundation and have  partnered with the HOW Foundation to provide hyperbaric oxygen therapy  to veterans battling PTSD or other traumatic brain injury.\n\nAdditionally, generous grants from the Department…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700045/hyperbaric-oxygen-therapy-for-veterans"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…of conduct, and Federal law;\n\nWhereas in August 2024, the Office of Congressional Conduct noted:  According to its website, PACEM Solutions is currently registered and/ or partnered  with trusted local firms to work in the following countries: United  States, Iraq, Afghanistan, Pakistan, UAE, Australia, Kenya, Malaysia,  and Kuwait. Public reports indicate…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697012/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}]