[{"senator": "Sean Casten", "party": "Democrat", "sentence": "…of our  market-based economy, I am going to keep standing up for it.\n\nLet's be clear: ERISA already requires fiduciaries to act solely in  the financial interests of plan participants and beneficiaries. H.R.  2988 does not strengthen that standard. It simply assumes that a  handful of paternalistic legislators know more about the interests of  America's…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699153/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…curriculum is a program during which students can  develop an understanding of waterfowl anatomy and habitats, culminating  in the Junior Duck Stamp art competition, where participants may draw  or paint a picture of an eligible North American waterfowl species.\n\nThe winning image of this contest then goes on to be featured on the  Junior Duck Stamp itself,…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698167/reauthorization-of-junior-duck-stamp-conservation-and-design-program-act-of-1994"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…the behavior of       Eligible Entities and subgrantees, rather than with the       internal operations of NTIA itself. The Policy Notice       prescribes actions program participants should and should not       take in carrying out the BEAD Program. Therefore, it is not a       rule of agency organization, procedure, or practice.\n\nMoreover, the Policy…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698437/us-government-accountability-office-opinion-letter"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…enforcement.\n\nThe plot to overturn the 2020 Presidential election led multiple  grand juries, both State and Federal, to bring felony charges against  its organizers and participants. These charges were based on actions  like promoting fake elector slates, urging State officials to find  votes to change the election outcome, and urging Vice President…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696924/repeal-of-senate-notification-requirements-relating-to-legal-process-on-disclosures-of-senate-data"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…to live in each other's country for one academic  year. During their year abroad, students will foster meaningful  relationships between America and Germany, while giving participants  new perspectives on peoples and cultures beyond their own. Many CBYX  alumni go on to distinguished careers in foreign affairs and public  service using the language skills…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693199/recognizing-avi-bender"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…interested       entities would receive funding under the programs, and, for       certain programs, imposed additional implementation and       reporting requirements on program participants.\n\nThe ROD's adoption of the Barred Owl Management Strategy       establishes a new voluntary program for interested       governmental and non-governmental entities. Like…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693338/us-government-accountability-office-legal-opinion"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…decide what is material and  what is not.\n\nHow about we trust the investors? How about we trust the people who  are actually doing the work? How about we trust the plan participants,  the workers, and the retirees? Anyone who has a 401(k) or an IRA will  tell you that they can go on the website and pick from a range of  different plans based on what…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699159/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…ready for the challenges ahead.\n\nDavid embodies the spirit of hospitality that Kentuckians everywhere  extend to our neighbors. David has opened his farm to more than 450  participants in the U.S. Department of State's International Visitor  Leadership Program from over 100 countries to learn from his practices  and spark ideas they can carry back home.…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699894/recognizing-david-neville"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…Development (HUD)       promulgated a 2015 rule, which, among other things, announced       that HUD would be rolling out Assessment Tools for certain       block grant program participants to use to demonstrate       compliance with a statutory requirement to ``affirmatively       further fair housing'' (AFFH requirement).\n\nOne of these Assessment Tools, for…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699835/government-accountability-office-opinion-letter"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…is the ability of all of these actors to do this and  commit any Federal crime with impunity. As a matter of fact, we could  say it is with immunity.\n\nThese actors, these participants, they all have the blessings of the  President of the United States of America. The President of the United  States of America is now under the impression that he has absolute…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689201/and-still-i-rise-censured-but-not-silenced"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…recently  produced movie called ``A House of Dynamite.'' It is a recent one that  actually talks about what a modern nuclear war would look like from the  point of view of the participants who have to make those decisions and  the equipment and provisions they have to aid those decisions.\n\nMr. FOSTER. Mr. Speaker, I thank the gentleman for the many excellent…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699037/expiration-of-new-start"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…literacy advancement, professional development, and  contributing significantly to the well-being and growth of families in  our community. By focusing on these initiatives, participants can  develop the necessary skills needed to thrive today.\n\nFounded in 2001 by Baldwin and Crystal Hamilton, It's About the Kids  Mentor Program began outreach in Marietta,…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692965/recognizing-the-work-of-the-its-about-the-kids-mentor-program"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…investing workers' retirement savings.\n\nUnder the present law, the retirement plan fiduciary is required to  make prudent investment decisions in the best interests of plan  participants and beneficiaries. The bill codifies two rules from the  first Trump administration that impose first-of-their-kind restrictions  on plan fiduciaries' abilities to consider…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699154/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…Led by 13 elders in the community, AROPI, as it is also known, is an  African-centered organization established for the purpose of educating,  training, and empowering its participants in African-centered rites of  passage, process, rituals, customs, and practices.\n\nIts further purpose is to promote all aspects of healthy growth and  development of individuals,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699619/recognizing-akron-rites-of-passage-institute"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…implement key  acquisition management practices . . . [which] significantly increased  the risk of a problematic rollout of the new system.''\n\nTSP has approximately 7.2 million participants and $937 billion in  assets, making it the world's largest defined contribution plan.  Federal employees dedicate their careers to serving our country, and  they deserve…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691138/introduction-of-the-federal-retirement-thrift-investment-board-inspector-general-act-of-2025"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…not what ERISA was created to promote. ERISA, the  Employee Retirement Income Security Act, was established to ensure that  fiduciaries act in the best interests of plan participants. It requires  loyalty, prudence, and a clear focus on financial outcomes that workers  rely on.\n\nMr. Speaker, the problem with the Biden-Harris rule is that it  created…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699160/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…SEC. 2. ALIENS WHO CARRIED OUT, PARTICIPATED IN, PLANNED,                     FINANCED, SUPPORTED, OR OTHERWISE FACILITATED                     ATTACKS AGAINST ISRAEL.\n\n(a) Participants in Hamas Terrorism Against Israel.--      Section 212(a)(3) of the Immigration and Nationality Act (8       U.S.C. 1182(a)(3)) is amended--\n\n(1) in subparagraph (B)(i),…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697237/no-immigration-benefits-for-hamas-terrorists-act-of-2025"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…participant in a fellowship       program, or a detailee from another office of the Federal       Government shall be considered an employee of the House.\n\n(3) Exception for participants in new member orientation       programs.--If an individual completed a program of training       required under paragraph (1) during the new       Member orientation program…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692190/mandatory-completion-of-program-of-training-in-workplace-rights-and-responsibilities"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…proud to support the  CBYX program and will continue working to strengthen the relationship  between our two great nations.\n\nThe CBYX program is a great opportunity for participants to gain a  new perspective on global affairs and politics and immerse themselves  in new cultures.\n\nMax, a native of Berlin, Germany, began interning on Capitol Hill  earlier…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700248/recognizing-congress-bundestag-youth-exchange-program"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…the scorecard system measures whether agencies are meeting  their small business contracting goals, but it fails to consider how  many of those contracts go to first-time participants. Without this  data, we don't know if new small businesses are successfully entering  the marketplace or if the same firms are winning contracts year after  year.\n\nIf small…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687941/small-business-procurement-and-utilization-reform-act-of-2025"}, {"senator": "Mike Johnson", "party": "Republican", "sentence": "…relations within the context of recent  world events.\n\nPlease note that there is a significant time commitment aspect for  those selected for the program. In addition, U.S. participants are  expected to plan and implement the meetings and programs for the  Bundestag/Bundesrat staff members when they visit the United States.\n\nMembers of the House and Senate…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699719/announcement-of-the-2026-congress-bundestagbundesrat-exchange"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "Mr. GRASSLEY. Madam President, on July 13, 2024, an assassin nearly  killed President Trump. The gunman injured him and two rally  participants and killed Corey Comperatore. We keep him and his family  in our prayers as well as everyone affected that day. Today, 1 year and  1 day later, I come to the floor to provide…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693512/one-year-anniversary-of-trump-assassination-attempt"}, {"senator": "Mike Johnson", "party": "Republican", "sentence": "…relations within the context of recent  world events.\n\nPlease note that there is a significant time commitment aspect for  those selected for the program. In addition, U.S. participants are  expected to plan and implement the meetings and programs for the  Bundestag/Bundesrat staff members when they visit the United States.\n\nMembers of the House and Senate…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693345/announcement-of-the-2025-congress-bundestagbundesrat-exchange"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…the rules and pass the bill  (H.R. 3767) to amend title 38, United States Code, to provide for a  time frame for the employment in the Department of Veterans Affairs of  participants in the Health Professionals Scholarship Program, and for  other purposes, as amended.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695434/health-professionals-scholarship-program-improvement-act-of-2025"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…Scouts  have completed. All of them demonstrated the important values of  service, community, and character.\n\nScouting demands physicality, innovation, curiosity, and for  participants to enjoy the outdoors. It gives Scouts the opportunity to  try new recreational activities like mountain biking, kayaking, and  camping. All of these activities are an ode…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699723/national-scouting-day"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…technology'' means a distributed digital       database where data is--\n\n(A) shared across a network of computers to create a ledger       of verified information among network participants;\n\n(B) linked using cryptography to maintain the integrity of       the ledger and to execute other functions; and\n\n(C) distributed among network participants in an automated…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692733/deploying-american-blockchains-act-of-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…to geek out, probably about 5 years ago the  University of Chicago did an amazing study on what work requirements do  in benefit programs. At the end of the decade, the participants are  wealthier because they may get the benefit, but the work requirements  changed their participation in the economy. It raised their skill set.  They moved up in the…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691811/actual-solutions"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…technology is critical for both our  economic and national security.\n\nThis bill would direct the FCC to establish a 6G Task Force made up  of both public and private-sector participants to develop a report on  the standards development process and possible uses of sixth-generation  technology. This task force will ensure that the United States has a  unified…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690229/future-uses-of-technology-upholding-reliable-and-enhanced-networks-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…financial       products and services;\n\n``(F) an analysis with regard to existing policies and       procedures of brokers, dealers, investment advisers, and       other market participants related to senior investors and       senior investor-related topics and whether these policies and       procedures need to be further developed or refined;\n\n``(G) recommendations…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693935/national-senior-investor-initiative-act-of-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…high-need areas receive essential resources.  At Good Samaritan Health Clinic, RSVP volunteers assist with patient  intake and front desk duties, while at BayCare, they recruit  participants for the Health Buddies program to enhance senior well- being. Recently, RSVP Pasco partnered with Solo Moms to empower single  mothers and with the American Cancer Society…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690139/recognizing-ann-wilkinson"}]