[{"senator": "Jim McGovern", "party": "Democrat", "sentence": "…the big, ugly bill will make their lives more  difficult.\n\nWe heard from hungry moms, grandmothers, food pantry leaders, and  local officials. Each and every person who participated in the  roundtables spoke about how the big, ugly bill will increase hunger. If  Trump and Republicans in Congress would spend 5 minutes listening to  anyone living paycheck…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694156/impacts-of-the-big-ugly-bill-on-massachusetts"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…with providers, they also offer trainings on chronic  disease, chronic pain and diabetes self-management to patients in the  community. More than 3,000 individuals have participated in these  programs since 2010.\n\nThe New Hampshire AHEC team were pioneers in identifying the need for  a workforce that bridges healthcare and community. Over the past 27…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689246/national-ahec-week"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…violent assault on the Capitol in the history of the United  States. We have never seen anything like it.\n\nThis administration not only pardoned more than 1,500 people who  participated in that brutality, in that attempt to overthrow an  election, which Joe Biden won by more than 7 million votes, 306-232 in  the electoral college, not only did they pardon…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691349/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…national security, all so millionaires and billionaires can get  an extra buck. It is horrifying, immoral, and un-American.\n\nUnlike many of my Republican colleagues, I have participated in  multiple townhalls this year to hear from my constituents. One message  that I hear consistently is that people are scared. These are good,  honest, hardworking Americans…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690745/providing-for-consideration-of-hr-gulf-of-america-act-and-providing-for-consideration-of-hr-dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Bill Keating", "party": "Democrat", "sentence": "…acted to release the files and all the information regarding the  criminal activities of Jeffrey Epstein and all who enabled, all who  knew and did nothing, and all who participated in some of the worst  sexual abuse and trafficking crimes our country has experienced.\n\nThis will expose the rich, the powerful, and the self-entitled who  were involved…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696954/release-of-epstein-files"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…had no prosecutorial experience and no  administrative experience running a prosecutor's office.\n\nSecondly, he had shown an extraordinary devotion to the extremists  who participated in the violent insurrection against the Capitol and  against Congress on January 6, 2021. He represented many of them as a  defense lawyer, but he championed the cause of…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691194/calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism-and-educate-the-public-on-the-contributions-of-the-jewish-american-community"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…December 2024 letter, just 10 months  ago, that the Revolution Wind project would not have adverse impacts on  DOD missions in the area. The Air Force, NORAD, and the Navy all  participated in the review of Revolution Wind.\n\nIn fact, if you read the BOEM record of decision, if you actually  read the record of decision, there is a whole section on radar where…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695152/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…Nicole Good was the mother of three, had a daughter and a son  aged 15 and 12, and a 6-year-old with her husband who tragically died  in 2023. She was a devout Christian who participated in youth mission  trips to Northern Ireland when she was younger. According to multiple  reports, she was a poet, a writer, a wife, and a mother.\n\nShe had lived most of…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698835/americans-in-state-of-desperation"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "…father and his son sacrifice for our country, and we  should all be ashamed that this is how their service is repaid.\n\nThe Trump administration officials who set up and participated in  this Signal chat debacle should have taken responsibility for their  egregious mistake and instantly offered their resignation for having  violated the law, contravened…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689418/reckless-incompetence-of-signal-chat-put-servicemembers-at-risk"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…know this  poetry competition was different than all the other poetry competitions  we have had with pages. First of all, they were recalcitrant. Very few  of them even participated, to begin.\n\nSo we did something we never, ever did before. We extended the  deadline, and then I bullied and badgered--I admit this on the Senate  floor. I bullied and badgered…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699130/senate-pages"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…blocked a vote on the bipartisan Massie-Khanna bill to  release the Epstein files. Covering up the files just protects the  criminal activity of pedophiles and the people who participated in  those heinous acts.\n\nEpstein told the young girls and women: I have the banks and I have  the government. You have no power.\n\nLet's prove him wrong. I am asking that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695109/providing-for-consideration-of-hr-streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-and-providing-for-consideration-of-hr-stop-illegal-entry-act-of-2025"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…could not provide that list.\n\nNow, don't get me wrong. I am a CIA officer. I am a former Pentagon  official. I did three tours in Iraq--armed--alongside the military. I  participated in the targeting of terrorist groups. I actually have no  real problem going against cartels, given what they have done in their  inserting drugs in our community and with…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696126/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…I know what the United  States Congress does, and we never defunded the police, and we never  tried to defund the police.\n\nOn the other hand, my good friend, I believe, participated in--and if  he didn't, I am happy to stand corrected, but I know a bunch of his  colleagues said they wanted to defund the FBI, just like those who want  to defund the ATF…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691030/expressing-support-for-local-law-enforcement-officers"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "…House, we will vote to release all the Epstein  files.\n\nTo be clear, there is no protection for pedophiles, no protection for  the rich and powerful men of either party who participated, who turned  a blind eye, and who winked and grinned while witnessing the horrific  abuses of young children. Release all the damn files now.", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696817/epstein-files-transparency-act"}, {"senator": "Richard Neal", "party": "Democrat", "sentence": "…years how the ACA has not only become more popular, but the  American people have come to expect the benefits of the ACA.\n\nThis argument for those of us who were here and participated at the  time was not really complex at all. The argument was that we would  proceed on the basis of the notion of universal access and that you  wouldn't have to worry that…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698788/breaking-the-gridlock-act"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…Mark attained the positions of Fire Chief, Chief of  Police, and Director of Public Safety, before retiring in November  2023.\n\nIn addition to his public service, Mark has participated in many  community service initiatives throughout North Texas. He previously  served as a member of Collin College's Fire Science Program steering  committee and the North…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690240/recognizing-congressional-patriot-award-recipient-mark-metdker"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…pulled off such an operation and brought  someone so despicable as Nicolas Maduro to justice in a Federal court  in Manhattan.\n\nI wanted to thank all of our personnel who participated in the  operation. I hope and wish and pray for the speedy recovery of the  handful who were injured, and I think it is a proud day for the United  States.\n\nIt was a challenging…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698578/trump-administration"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…is a fact that these $1 billion schemes were cooked up by  leaders in the Somali community in Minneapolis and in Minnesota. It is  a fact that most of the businesses that participated in this fraud--in  this thievery--were run by people of Somali ancestry. I am not saying  that is a good thing. I am not saying that is a bad thing. That is just  a fact.…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697400/welfare-fraud"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…dedicated himself to faithfully serving our community and  country.\n\nRalph is a veteran of the Second World War and served with the United  States Army from 1943 to 1946. He participated in the South Pacific  campaign, and after being honorably discharged, he joined the Army  Reserves in 1948 where he remained until 1985. For his distinguished  service,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690225/recognizing-congressional-patriot-award-recipient-ralph-odell"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…to be in our districts for the  past month, and I had the privilege of meeting with my constituents in  Utah's Third District. At the end of this district work period, I  participated in a business-focused event with members of the Salt Lake  Chamber to discuss the One Big Beautiful Bill Act and other industry- related issues.\n\nDuring this event, I was…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694796/promises-made-promises-kept"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…serving for 25 years.\n\nDuring his time in the Air Force, he developed an impressive  background, which includes experience at varying levels in the Security  Forces. He has participated in operations in Africa, Europe, the Middle  East, South Asia, and the Pacific region. He is now retiring after all  of that time.\n\nBeing a servicemember is tough. It is…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694125/recognizing-usaf-chief-master-sergeant-jason-q-shaffer"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…undermining the safety and  security of the American people.\n\nHow about the $160 million we can save by not giving more money to  UNRWA, the organization whose own employees participated in Hamas'  slaughter of Israeli citizens on October 7, which we now know to be  verifiably and completely true?\n\nWhy would we continue to shovel money to an organization…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692388/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…D. Boyce. The mission of  the organization is to prepare children for lives of impact and  purpose. Since it was founded, more than 130 million young men and  women have participated in Scouting America's programs.\n\nMr. Speaker, at its core, Scouting encourages its members to leave  our country and the world a little better than they found it. Scouting…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699723/national-scouting-day"}, {"senator": "David Kustoff", "party": "Republican", "sentence": "…was a great read and  could be a good movie that could benefit the company.\n\nAs FedEx's lead attorney, Chris told Fred that there had never been  an airline that willingly participated in a movie where they gave  permission to crash their plane. Chris advised against all of it.\n\nYet, Fred wanted to think outside the box, and he signed off on the  idea.…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692825/remarkable-life-and-legacy-of-frederick-w-smith"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…educator, and  pillar in the Savannah community, who passed away last month.\n\nMs. Pryor was an activist, joining the civil rights movement at a  young age where she proudly participated in organized sit-ins, marches,  and peaceful protests in the city of Savannah.\n\nAfter graduating from Savannah State College and Georgia Southern  University, Ms. Pryor…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687985/mourning-the-loss-of-john-reginald-murphy"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…this.\n\nAmericans should think about this. Democrats are pushing back on this  because they don't want the citizens of America to know what special  interest aliens, who participated in suspicious travel patterns, came  into our country illegally in 2021, '22, '23, and '24. Because you know  how many are coming in in 2025? Zero are coming in. That is…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693077/special-interest-alien-reporting-act-of-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…over the years in many  ways. I have judged the Constitution Bowl at their school. I have been  to their ceremonies for veterans. I have met with their student council  and participated and helped judge debates that they were a part of. It  is truly a special place. This Servant Leadership Award really embodies  the spirit of the institution.\n\nJohn Adams…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690562/gas-prices-are-lower-for-everyone-except-californians"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…willing to stand up for themselves  and others. As an American, I am fortunate enough to live in a free  country, and I stand for what freedom means.''\n\nI thank everyone who participated in this year's congressional speech  competition, and I congratulate our winners.                      Recognizing Alewel's Country Meats\n\nMr. ALFORD. Mr. Speaker, I rise…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691505/recognizing-winners-of-2025-fourth-district-congressional-speech-competition"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…Church, The Navigators,  Victory Life Church, New Life Midtown, Iglesia Nueva Vida, Heart of the  Springs Church, Story Church, Youth With a Mission, and Decision Point,  who participated in the National Day of Prayer events in Colorado  Springs.\n\nCelebrating National Day of Remembrance for Aborted Children\n\nMr. CRANK. Mr. Speaker, I rise today to recognize…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695195/recognizing-pastor-stewart-mcwilliams"}, {"senator": "James Risch", "party": "Republican", "sentence": "…under S. Res. 474 if:\n\n(A) the chairman originates such action, with the       concurrence of the ranking member;\n\n(B) the other current members of the committee who       participated in such meeting or report have been notified of       the proposed declassification, and have not objected thereto,       except that the committee by majority vote may…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691700/us-senate-committee-on-foreign-relations-rules-of-procedure"}]