[{"senator": "Dick Durbin", "party": "Democrat", "sentence": "…DURBIN. Mr. President, it is a heady experience to go through a  classified briefing at the highest levels of our government, and  virtually every U.S. Senator of both political parties had that  opportunity this morning. I took advantage of it. It is rare and  important. It was an explanation by our leaders in the Cabinet and the  administration of what…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698599/venezuela"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…adversaries. Oil prices were rising, and U.S. energy could not meet  demand.\n\nYet, even in that context, in those challenging years, for decades  and across both political parties, Congress recognized the  irreplaceable, ecological, and cultural importance of the Arctic  Refuge.\n\nLawmakers on both sides of the aisle understood that some places are…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697413/9999"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…due for relicensing at the  end of 2028.\n\nThe relicensing process is typically very lengthy, in part for good  reason. The public comment period needs to be robust for all parties to  weigh in. Without that input, we risk potentially devastating  environmental consequences on regional ecosystems.\n\nWith relicensing activity set to double in the coming…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693476/hydropower-licensing-transparency-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…speaker just mobilized  against the Democrats in Congress. He accuses us of not taking DUIs  seriously, and nothing he said could provide a more striking contrast  between the parties.\n\nI am afraid I have to go there. I was hoping not to have to go there.  I seem to remember when we met in joint session at what would have been  the State of a Union address…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693082/jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…energy  efficiency advocates.\n\nIn fact, many of the efficiency standards that were finalized over  the last few years are the result of a consensus agreement between  these parties.\n\nRather than recognizing that the current process is successful at  bringing everyone to the table, House Republicans have chosen to  villainize it. Rather than celebrating…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700165/dont-mess-with-my-home-appliances-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…the Electronic Signatures in Global  and National Commerce Act, which was enacted into law more than 20  years ago, with respect to any interstate transaction in which the  parties consent, ``a signature, contract, or other record relating to  such transaction may not be denied legal effect, validity, or  enforceability solely because it is in electronic…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689607/introduction-of-the-district-of-columbia-electronic-transmittal-of-legislation-act"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "…President is working  for us? He is working for us if we make over $4 million and are about  to pocket a new tax cut of $300,000.\n\nHe is working for us if we attend Great Gatsby parties at his club or  plan to sip cocktails in his new White House ballroom.\n\nHe is working for us if we bankroll his crypto schemes or pony up for  Presidential pardons.\n\nHe is…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696771/working-people-pay-the-price"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…southern California.\n\nIn 1992, Congress, led by the Science, Space, and Technology  Committee, authorized the Secretary of Commerce to license and regulate  private-sector parties to operate commercial remote sensing space  systems. Since that time, the commercial remote sensing industry has  changed quite dramatically.\n\nToday, companies from across…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688973/commercial-remote-sensing-amendment-act-of-2025"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…protection laws in  the negotiated rule of construction in section 7(f)(4). This was always  the intent of the bill, as evidenced by the public discussion between  Senators of both parties during the March 13, 2025, markup in the  Committee on Banking, Housing, and Urban Affairs. The amended, final  version of the bill includes this negotiated rule of construction…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692635/genius-act"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…Parliamentarian has reaffirmed and which  the majority now wants to strike down.\n\nBut let's be clear. Going to the GAO was nothing out of the ordinary.  In fact, it was exactly what both parties have done when adjudicating  this issue for decades. There are Senators serving in this Chamber,  Republicans and Democrats, who have made use of the exact same process  by…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691452/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…where we  keep guns out of the hands of people who are a danger to themselves or  others, working together on bipartisan solutions that are  overwhelmingly supported by both parties and by our voters in our  districts.\n\nLet's choose a future where our kids come home safe from school and  where we don't continue to lose countless innocent lives.\n\nWhen…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695732/charlie-kirk"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…American democracy and American security are inextricably       linked; weaken one and the other inevitably begins to fail.       As patriots and public servants from both parties who worked       to protect America over many decades, we see that link       unraveling at lightning speed. Many of us have served in       countries where democratically…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691413/recognizing-assault-on-american-diplomacy"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "Mr. Speaker, H.R. 331 would amend the Aquifer Recharge Flexibility  Act to allow third parties to utilize an existing right-of-way,  easement, permit, or other authorization for aquifer recharge without  further authorization from the Secretary of the Interior.\n\nUnderground…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691130/conveyance-for-aquifer-recharge-purposes"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…budget by $500 billion  which he just posted today, but they don't have the money to fund  healthcare for the American people. They have the money for ballrooms  and lavish parties.\n\nHere is an idea. How about we invest in providing relief to the  American people who are being crushed by out-of-control healthcare  costs. We have an opportunity now to…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698586/providing-for-consideration-of-hr-breaking-the-gridlock-act"}, {"senator": "Richard Neal", "party": "Democrat", "sentence": "…off veterans at veteran services offices, and then providing a tax cut  to those in billionaire heaven down in the Cabinet.\n\nLet's have an honest discussion between the two parties about fiscal  policy.", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689892/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…Americans, use  the doubled standard deduction.\n\nThat is real tax relief. It goes unsaid a lot. It is such a standard  piece. Nobody truly disagrees with it--``nobody'' meaning both parties.  It is something that we have now established as the norm, and it will  give immediate relief to the vast majority of American families.\n\nBecause the historic tax cuts are…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699706/historic-tax-relief-for-families"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…member of the  Appropriations Committee, you know well that these are fiscally  responsible bills that reflect many months of hard work and  deliberation from Members from both parties and from both sides of the  Capitol. They reflect input from nearly every Senator. Our  subcommittees received more than 31,000--31,000--requests from Senators  for these…", "date": "2026-01-26", "source_url": "https://justfacts.votesmart.org/public-statement/1699384/appropriations"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…medical products that are regulated by the Food       and Drug Administration; and\n\n``(B) facilitate interactions between the Food and Drug       Administration and interested parties in Abraham Accords       countries, including by sharing relevant information       regarding United States regulatory pathways with such       parties, and facilitate feedback…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697276/mikaela-naylon-give-kids-a-chance-act"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…Chip Roy from Texas,  Representative McBath, who is the ranking member on our Subcommittee of  Crime and Federal Government Surveillance, and supported by Members of  both parties who understand that freedom collapses when the law becomes  unknowable.\n\nThis bill is co-led by staunch conservatives like Representative Roy  and myself and our colleagues,…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697204/count-the-crimes-to-cut-act"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "…management or       personnel; and (3) rules of agency organization, procedure,       or practice that do not substantially affect the rights or       obligations of non-agency parties.\\22\\\n\nInterior did not submit a CRA report to Congress or the       Comptroller General on the North Dakota RMP.\\23\\ In its       response to us, Interior provided additional…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693059/us-government-accountability-office-legal-opinion"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…celebration of liberty and independence. Amidst our  toughest challenges of the day, this legislation reminds us that we can  all work together.\n\nUnder this bill, leaders from both parties will work alongside the  Architect of the Capitol to compile the capsule's contents. This will  include a letter from congressional leadership, books, manuscripts,  relics,…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699840/semiquincentennial-congressional-time-capsule-act"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…Speaker, I will admit to being pretty excited that the ePermit  Act is on the floor today, not just because it is my bill but because  America needs this.\n\nFor years, both parties have agreed that our permitting system is too  slow. It is too complicated. Frankly, it is too stuck in the past. That  is too bad because, really, the story of America has…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697679/epermit-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…my colleagues love to ignore the slave labor in China to  produce the batteries that they drive around in their EVs while they  pat themselves on the back and go to cocktail parties talking about how  fantastic it is that they drive their EVs and how enlightened they are.\n\nsays Chinese  lithium-ion batteries are made with child labour as trade war spills…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690387/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…law, and the President is elected to  enforce it. The judiciary is appointed for the sole purpose of  resolving cases and controversies brought to it by individual injured  parties. Traditionally, that means an injured party seeks redress  through his local district court. This simple process ensures decisions  are limited to the unique circumstances…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689722/no-rogue-rulings-act-of-2025"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…that they put into getting us to this wonderful  achievement. These are fiscally responsible bills that reflect months  of hard work and deliberation from Members from both parties and both  sides of the Capitol.\n\nEnacting this package will represent a major milestone and show that  Congress can work together in a bipartisan manner to carry out our…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699433/consolidated-appropriations-act-2026"}, {"senator": "John Thune", "party": "Republican", "sentence": "…now  considered 11 of the 12 individual bills on the Senate floor.\n\nThe advantages of a Member-driven process are myriad. First and  foremost, it empowers Senators of both parties to make their voices and  the voices of their constituents heard, and it provides for genuinely  serious consideration of spending priorities.\n\nThis year's appropriations…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699507/government-funding"}, {"senator": "Mike Crapo", "party": "Republican", "sentence": "…partners.\n\nWe should, however, take care before we say that all options are  completely off the table. In fact, all of our free-trade agreements  provide exceptions for when parties can remove economic benefits,  including on national security grounds.\n\nI don't recall anyone suggesting that the Biden administration could  not impose sanctions on Nicaragua…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688256/unanimous-consent-request-s-348"}, {"senator": "Nathaniel Moran", "party": "Republican", "sentence": "…volunteers of all ages, Love Thy City is a day of service to others,  rooted in the great command to love our neighbors. That is a principle  that transcends politics and parties, race and gender, and every other  perceived difference between us.\n\nIt is our shared responsibility to care for everyone around us just  as the Good Samaritan did, not because…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693760/love-thy-city-initiative"}, {"senator": "Darrell Issa", "party": "Republican", "sentence": "…halt executive actions and  executive orders not just for plaintiffs before the court but across  the entire country, including individuals and entities that are not  even parties to the litigation and, in many cases, may not favor the  outcome and would not have been willing plaintiffs.\n\nThis undermines the system of government. It empowers individual,…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689711/no-rogue-rulings-act-of-2025"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…of humor. Over the next four decades, Susan Mason  Catering became synonymous with silver service, culinary perfection,  and timeless Southern style. Whether planning wrap parties for A-list  celebrities or elegant weddings for local families, she made sure every  detail was flawless.\n\nShe is now 85 years young and still very much at the center of the…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693702/susan-mason-savannahs-style-and-service-icon"}]