[{"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Danielle Bierman has made through her work with the  Pasco County Human Services Team. The Pasco County Human Services Team  has proven itself to be a cornerstone of resilience, innovation, and  unwavering commitment to the community. Amidst…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690238/recognizing-danielle-bierman"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Kyle Smith has made through his work with the Pasco  County Human Services Team. The Pasco County Human Services Team has  proven itself to be a cornerstone of resilience, innovation, and  unwavering commitment to the community. Amidst…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691008/recognizing-kyle-smith"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Fernando Serrano has made through his work with the  Pasco County Human Services Team. The Pasco County Human Services Team  has proven itself to be a comerstone of resilience, innovation, and  unwavering commitment to the community. Amidst…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690698/recognizing-fernando-serrano"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Maria Wilkinson has made through her work with the  Pasco County Human Services Team. The Pasco County Human Services Team  has proven itself to be a cornerstone of resilience, innovation, and  unwavering commitment to the community. Amidst…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691174/recognizing-maria-wilkinson"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Jordan French has made through his work with the  Pasco County Human Services Team. The Pasco County Human Services Team  has proven itself to be a cornerstone of resilience, innovation, and  unwavering commitment to the community. Amidst…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690850/recognizing-jordan-french"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Rebecca Seils has made through her work with the  Pasco County Human Services Team. The Pasco County Human Services Team  has proven itself to be a cornerstone of resilience, innovation, and  unwavering commitment to the community. Amidst…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691971/recognizing-rebecca-seils"}]