[{"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…cooperation  with the local governments. The Congress of the United States does not  need to be making decisions about restaurants in Charleston, South  Carolina, or bars in El Paso, Texas, or what have you. Why don't we let  the people of the States and the localities make those decisions.\n\nMr. Speaker, I thank my colleague for his excellent presentation…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691242/leosa-reform-act"}, {"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…to influence elections and policy, all while people die in their  facilities. Mr. Speaker, three people have died in just the last 6  weeks at a privately run tent camp in El Paso.\n\nFossil fuel and mining companies pour enormous sums into elections to  block climate action while communities like mine in Arizona face record  heat, drought, and wildfires…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699240/restoring-election-integrity"}, {"senator": "Veronica Escobar", "party": "Democrat", "sentence": "Ms. ESCOBAR. Mr. Speaker, I rise today to recognize the 30th  anniversary of the Paso Del Norte Health Foundation in El Paso, Texas.\n\nEstablished in 1995, the Paso Del Norte Health Foundation has worked  to ensure our binational tri-state community has the knowledge,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695206/recognizing-the-30th-anniversary-of-the-paso-del-norte-health-foundation"}, {"senator": "Veronica Escobar", "party": "Democrat", "sentence": "Ms. ESCOBAR. Mr. Speaker, I rise today to recognize and celebrate the  grand opening of the Endeavors Health & Wellness Center in El Paso,  Texas. Endeavors is a distinguished Texas-based nonprofit organization  dedicated to serving veterans, active-duty service members, first  responders, caregivers, and their…", "date": "2025-11-04", "source_url": "https://justfacts.votesmart.org/public-statement/1696519/recognizing-the-grand-opening-of-the-endeavors-health-wellness-center-in-el-paso"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…proves  otherwise.\n\nAs his family was scrambling to find details about where he was,  where he had been taken, DHS quickly whisked Javier out of Los Angeles,  all the way to El Paso, TX. His family feared that he could be deported  or he had been deported, not only to a country he doesn't know but to a  country whose language he doesn't speak.\n\nBut as tragic…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694421/daca"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…they  give them sort of the benefit of the doubt as it were, and they go on  to allow us to litigate. We have been litigating against the last maps  for more than 2 years. El Paso, Texas, I have been there to testify. As  such, litigating against it, I can tell you, Mr. Speaker, that if  things go as they have gone, and I pray that they won't, it will…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694943/bloody-sunday-and-voting-rights-act"}, {"senator": "Veronica Escobar", "party": "Democrat", "sentence": "Ms. ESCOBAR. Mr. Speaker, I rise today to recognize Jennifer and  Stephanie Han, two remarkably accomplished sisters from El Paso whose  dedication and success in women's boxing has inspired all of us.\n\nJennifer Han, former IBF world featherweight champion and soon-to-be  member of the International Women's…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688664/recognizing-jennifer-and-stephanie-han"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…which will redraw the Veterans Integrated Service Network  lines. This change will allow veterans in Otero County and Eddy County  to receive care at a closer VA facility in El Paso rather than have to  travel 4 hours to Albuquerque.\n\nAccess to care means little if veterans can't get there. That is why  I am also introducing the Rural Veterans Transportation…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688352/ensuring-veterans-receive-care-they-earned"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…with worms. These  are all documented facts. It is not a political argument. This is what  is happening. Many places have toilets that don't flush.\n\nIn a detention center in El Paso, a man named Geraldo Lunas Campos  was choked by an officer, and he died. A teen was beat up by officers  and now has hearing loss. Just this week, NBC reported that an 18-…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700023/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Ami Bera", "party": "Democrat", "sentence": "…He came on as a staff assistant and has been  working his way up. Anthony has shown grit and perseverance,  representing the Sacramento communities of North Sacramento, Del Paso  Heights, and Natomas. He is a great extension of what we do.\n\nAnthony is innovative. One of the best Anthony stories is that, as a  staff assistant, you have to pick the Member…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699299/anthony-uribe-recognized-as-young-professional-of-the-year"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…Department\n\nClarksville Police Department\n\nMonterey Police Department\n\nLoudon County Sheriff's Office                                    TEXAS\n\nAustin Police Department\n\nEl Paso Police Department\n\nEnnis Police Department\n\nPlano Police Department\n\nFredericksburg City Police Department\n\nLeague City Police Department\n\nAnother article on procurement\n\nGuadalupe…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700033/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "Mr. CRANK. Mr. Speaker, over the weekend, the Colorado Springs Police  Department, the El Paso County Sheriff's Office, and the Drug  Enforcement Administration worked hard to do a raid in my hometown of  Colorado Springs, Colorado. They arrested over 100 folks who are…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690282/raid-in-colorado-springs"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…law enforcement, Colorado lawmakers gave him a sanctuary pass. In  fact, they even went a step further and gave this terrorist a driver's  license.\n\nI am proud to be from El Paso County, a county in Colorado that  stands for commonsense immigration policies and a community that works  with our law enforcement to give them every tool to protect our  community.…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692193/denouncing-the-antisemitic-terrorist-attack-in-boulder-colorado"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "…PEARL Act.\n\nWith over 800 miles of the Texas-Mexico border, I represent the  largest border district in the country. From Eagle Pass to Del Rio to  the Big Bend region to El Paso, many of America's hardworking Border  Patrol agents call Texas 23 home.\n\nProtecting our Nation's border is no easy feat. It is long hours,  late nights, and time away from…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696972/providing-emotional-assistance-with-relief-and-love-act"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…introducing  this important piece of legislation. I am also grateful to Chairman  Williams of the Committee on Small Business for working with me to  ensure that my community, El Paso County and Colorado Springs, isn't  swept up in the radical sanctuary policies coming out of Denver,  Colorado.\n\nSpecifically, I thank the gentleman for accepting our amendment…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692103/save-sba-from-sanctuary-cities-act-of-2025"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "…NJROTC cadets from Cienega High School, Andrada High School, Empire  High School, and Mica Mountain High School who competed at the Area 20  Stars and Stripes field meet in El Paso, Texas, under the leadership of  Commander Micah Brewer.\n\nThese cadets did an amazing job and brought home a number of  impressive awards. They placed number one overall, as…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697431/congratulating-salpointe-catholic-high-schools-girls-flag-football-team"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…Police Week  to honor the great men and women who protect us every single day, who  wear the badge, and who protect our communities.\n\nMr. Speaker, I thank specifically our El Paso County Sheriff's Office  and our Colorado Springs Police Department and all of the local law  enforcement in Colorado. They put themselves on the front lines every  single day.…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691164/events-this-week"}]