[{"senator": "Darren Soto", "party": "Democrat", "sentence": "…it was the deadliest mass shooting in U.S. history.\n\nI was proud to work on both sides of the aisle in June 2019 to  introduce the National Pulse Memorial. In June 2020, it passed the  House but did not pass the Senate. Finally, in June 2021, it was  introduced, passed into law, and signed by President Biden.\n\nWe know that the National Pulse Memorial…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692469/moment-of-silence-in-memory-of-pulse-nightclub-victims"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…a renowned physician,  military veteran, and health activist.\n\nI also express and convey condolences to the family of my good friend  Reverend Charles Bowers, who recently passed away last week at the age  of 95.\n\nOn a happier note, I extend congratulations to my dear cousin and  high school classmate, Cora Henderson, and her husband Floyd, on the…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698272/expressing-condolences-and-congratulations"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…have a long way to go, because what diversity, equity, and  inclusion recognizes is that when the Civil Rights Act and the Voting  Rights Act and all of the laws that were passed because of the work of  Dr. King, they weren't a magic wand that erased over 300 years of the  impact of slavery and Jim Crow. That requires intention, intentional  unwinding…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699197/building-a-beloved-community"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…me, they have  already gotten enough from the people in charge. The Trump  administration and Republicans gave them $1 trillion in new tax breaks  in the budget megabill they passed in July. Somehow, that wasn't  enough.\n\nThe Trump administration junked an effort to crack down on another  partisanship abuse, something known as basis shifting. That is when…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699925/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…cleaner energy sources.\n\nEver since President Trump took office earlier this year, Republicans  have been obsessed with crusading against wind and solar whenever they  can. They passed the big, ugly bill, which slashed tax incentives for  clean energy and made electricity more expensive for everyone. They  have tried to kill every wind or solar project on…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697886/state-planning-for-reliability-and-affordability-act"}, {"senator": "Veronica Escobar", "party": "Democrat", "sentence": "…the House Homeland Security  Appropriations Subcommittee, I stand today in opposition to this  Homeland Security appropriations bill.\n\nI want to be very clear. The bill that passed out of committee had  protections for U.S. citizens against what we are seeing playing out in  Minnesota and other American cities. During our debate in the House  Appropriations…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699352/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…have a  connection to the residents they serve and in-depth knowledge of the  unique issues and challenges these residents face. The House Committee  on Oversight and Reform passed this bill in the 117th Congress.\n\nCSOSA and PSA are federal agencies that focus exclusively on D.C.  CSOSA supervises individuals on probation, parole or supervised release…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690239/introduction-of-the-requirement-of-the-director-of-the-court-services-and-offender-supervision-agency-for-the-district-of-columbia-and-the-director-of-the-district-of-columbia-pretrial-services-agency-to-reside-in-the-district-of-columbia"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…is we have found an increasing  number of Republicans who are publicly admitting now that they didn't  realize that this provision was in the big, beautiful bill that they  passed. Of course, we all remember a couple weeks back this bill was  pushed through in the dark of night, after 1 a.m. It was clear that it  was rushed through so quickly that most…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692038/consequences-of-doge"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…conduct a study on federal law enforcement officers'  training, vehicle pursuits, use of force and interaction with the  public. In the 116th and 117th Congresses, the House passed this bill  as part of the George Floyd Justice in Policing Act.\n\nCameras can increase transparency, strengthen public trust and even  deter criminal behavior. With the surge…", "date": "2025-08-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694762/introduction-of-the-federal-police-camera-and-accountability-act-of-2025"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…as our Founding Fathers and the Constitution imagined  it. He said it should be more partisan and that he would continue to  send rescissions packages like the one that they passed on the Senate  floor last night.\n\nLet us be clear. The White House and an unelected bureaucrat are  trying to steal the power of the purse and to steal the power of the  people.…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693677/department-of-defense-appropriations-act-2026"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…infrastructure needs,  such as housing, health care and restoring the environment.\n\nIn 1993, District of Columbia peace activists were successful in  getting a ballot initiative in D.C. passed that called for nuclear  disarmament. Since then, I have introduced a bill each Congress based  on that initiative, including this bill. In March 2019, the D.C.  Council passed…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688575/introduction-the-nuclear-weapons-abolition-and-conversion-act-of-2025"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…administration's move  to limit these protections undermines employee trust and could harm the  DOD's ability to maintain a skilled workforce. The bill before us  strips out a House-passed bipartisan amendment to restore collective  bargaining rights of DOD employees.\n\nI appreciate that the NDAA process each year gives us the opportunity  to conduct oversight,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698254/nominations"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…is paid with local D.C. funds.  D.C. should have authority to set the pay of all its employees. In the  117th Congress, the House Committee on Oversight and Accountability  passed this bill.\n\nUnder the D.C. Home Rule Act, Congress established a maximum rate of  pay of the CFO, and the D.C. Council does not have authority to  increase that rate. Congress…", "date": "2025-12-23", "source_url": "https://justfacts.votesmart.org/public-statement/1698470/introduction-of-the-district-of-columbia-chief-financial-officer-salary-home-rule-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…Depression,       the memory of the suffering it caused is deep and searing.       And today many economic analysts and historians argue that       high tariff legislation passed back in that period called the       Smoot-Hawley tariff greatly deepened the depression and       prevented economic recovery.\n\nYou see, at first, when someone says, ``Let's…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696451/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…today  and tomorrow for their children.\n\nWe are all familiar with the effective advocacy of the NAACP,  including the lifetime achievement of Dr. Hazel Dukes, who recently  passed away, but there are local heroes, too, who do exceptional work  in our hometown neighborhoods.\n\nLet me recognize some of these key branch leaders:\n\nIn Co-Op City, Leslie Peterson…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693011/recognizing-local-naacp-leaders"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…and USDA, conducting research, so it only makes sense that we ensure  they are both at the table to coordinate on a wide range of topics.\n\nMr. BABIN. Mr. Speaker, this bill passed the House with unanimous  support last Congress. That is because smart, bipartisan legislation  rarely faces opposition.\n\nI thank former Science, Space, and Technology Committee…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688980/doe-and-usda-interagency-research-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…veterans land allotment program for an  additional 5 years, to end on December 29, 2030.\n\nAlaska Natives have long experienced land-related hardships.  Recognizing this, Congress passed the Alaska Native Claims Settlement  Act in 1971 to settle the aboriginal land claims of Alaska Natives.\n\nUnfortunately, this congressional action coincided with the Vietnam…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693474/alaska-native-vietnam-era-veterans-land-allotment-extension-act-of-2025"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…to recognize and remember the  life and service of a dedicated American veteran, Mr. Orval Mullens of  Oakwood, Ohio. Orval, who celebrated his 103rd birthday in February,  passed away on May 15, 2025. Orval led a long, productive life, and I  am honored to have the opportunity to recognize his many  accomplishments in life, especially his service to…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692278/special-recognition-of-the-life-and-service-of-orval-mullen"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…that they would vote  against ending this shutdown. That is the epitome of hypocrisy, and the  American people deserve better than that.\n\nHouse Republicans did our job. We passed a clean continuing  resolution weeks ago, the same kind of straightforward measure that  should have been agreed to immediately to keep this government open.  Senate Democrats…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696699/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "John Hoeven", "party": "Republican", "sentence": "…country, many  of which already operate on thin margins and cannot afford the high  costs to comply with this onerous rule.\n\nSimply put, this is a punitive tax that will be passed along to  consumers and will force energy developers to shut in production. That  means higher prices to heat your homes. That means higher prices to  cook your food. That…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688157/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…it is blatantly untrue. The initial version of  this said that it would only take effect if Texas moved forward. That  language was deleted. This is taking effect, if it is passed,  regardless of anything that has happened in Texas or any other State.  At this point, it is completely inaccurate and is an attempt to simply  smuggle some sort of argument…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…these programs  provide to American businesses, including those in North Carolina that  have built reliable partnerships in Haiti.\n\nLast month, the Ways and Means Committee passed this bill  unanimously, 41-0, a strong bipartisan signal that these programs work.\n\nMr. SMITH of Missouri. Madam Speaker, I yield such time as he may  consume to the gentleman…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698853/haiti-economic-lift-program-extension-act"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…President with a backbone to secure our border; and that President is  Donald Trump.\n\nAt the same time, President Trump rebuilt an economy that works for  all Americans. Congress passed the largest tax cut in American history,  delivering relief directly to families and workers. No taxes on tips,  overtime, and Social Security, but in my district, I will share…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699277/highlighting-republican-successes-in-2025"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…MEUSER. Mr. Speaker, I rise in support of the Housing for the  21st Century Act, introduced by Chairman Hill and Subcommittee on  Housing and Insurance Chairman Flood, which passed the House with  overwhelming bipartisan support.\n\nHousing affordability is a supply problem, and for too long, Federal  policy has made it slow and expensive to build new homes.…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699948/housing-for-the-21st-century"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…motorized recreation  trails, the National Park Service is shutting down a main engine of  economic growth in some of the poorest, most rural counties.\n\nEarlier this year, Congress passed the first-ever bipartisan,  comprehensive recreation package aimed at growing, not restricting, our  Nation's $1.1 trillion outdoor recreation economy. The EXPLORE Act  passed…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690405/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…the Osceola Camp in the Miccosukee Reserved Area and formalize a  partnership between the Tribe and the Federal Government to address  flooding risk in the area.\n\nH.R. 504 passed the House Committee on Natural Resources in June 2025  and the House of Representatives in July 2025.\n\nHowever, I respect the President's views on this legislation and his…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698658/miccosukee-reserved-area-amendments-act-veto-message-from-the-president-of-the-united-states"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "Mr. GROTHMAN. Mr. Speaker, we just got done with a very interesting  week in which this House passed a budget bill, and now we proceed  actually to the more difficult process in which, sometime over the next  4 months, we plan on passing both the reconciliation bill and  appropriations…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688328/destruction-of-the-nuclear-family"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…Lauren, the very best.               Honoring the Life of Anthony ``Tony'' DeFeciani\n\nMr. LAWLER. Mr. Speaker, I rise today to honor the life of Anthony  ``Tony'' DeFeciani, who passed away peacefully on December 23, 2025.\n\nBorn and raised in Haverstraw, Tony was a proud New Yorker, attending  Haverstraw High School and participating in the marching band,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699118/recognizing-and-thanking-nate-soule"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…with Disabilities Education  Act, IDEA, which mandated that every child with a disability in America  should have access to a high-quality public education.\n\nWhen Congress passed IDEA in 1975, it was a landmark step toward  educational equity. It opened classroom doors to ensure that every  child with a disability could grow, learn, and succeed at school.…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697493/9999"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…2026, such material as he may deem explanatory of H.R. 7148       and H.R. 7147.\n\nSec. 4.  The Clerk shall not transmit to the Senate a       message that the House has passed H.R. 7148 until H.R. 7147       is passed by the House.\n\nSec. 5.  In the engrossment of H.R. 7148, the Clerk shall--\n\n(a) add the text of Divisions A, B, and C of H.R. 7006,…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699311/providing-for-consideration-of-hr-consolidated-appropriations-act-and-providing-for-consideration-of-hr-department-of-homeland-security-appropriations-act-and-for-other-purposes"}]