[{"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…loved his family deeply and held his faith close to his heart.  He began serving God early in life at Nichols Chapel AME Church, where  his musical talents flourished. His passion for music led him to serve  as Minister of Music at the church and as a member of the Board of  Trustees.\n\nNone of Cliff's achievements would have been possible without the…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688153/in-memory-of-clifford-odell-rutledge"}, {"senator": "Ted Lieu", "party": "Democrat", "sentence": "…Carol started her career at L'Oreal in 1984, joining the Consumer  Products Division as Marketing Director for L'Oreal Paris in the United  States. She continued to foster her passion and built the L'Oreal  flagship brand from a small indie brand in the 80's into the No. 1  global beauty brand worldwide, behind the iconic phrase ``Because I'm  Worth It.''…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690596/congratulating-the-work-and-dedication-of-carol-hamilton"}, {"senator": "Adam Gray", "party": "Democrat", "sentence": "…recently the Minerva Empresaria Award 2022 from the  California State Hispanic Chamber of Commerce which recognizes  businesswomen who empower others by leading with wisdom and passion.\n\nPlease join me in honoring Annissa Fragoso for her dedication,  commitment and selfless service to the people of Merced County.", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695992/recognizing-annissa-fragoso"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…fact that  he will continue to play a policy role will be important for both of  our nations and for all of us who care about maintaining democratic  values. I know that his passion for public service, his commitment to  internationalism, and his insightful analysis are ending here after his  time in Washington.\n\nIn closing, on behalf of my colleagues…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699544/9999"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…Front Range to ensure those in rural communities could access care.\n\nDr. Kuenzler earned this honor because of her dedication to expanding  mental health care services and her passion for helping people overcome  obstacles in their lives. She'll be remembered as an important part of  the Jefferson Center's legacy.\n\nOn behalf of the people of Colorado's…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692052/recognizing-dr-kiara-kuenzler"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…took her life 8 short weeks after her  diagnosis. It was a shock to our entire family, the lingering effects  of which I feel every day.\n\nIn an effort to turn my pain into passion, I made a commitment to do  all that I could to prevent other families from experiencing such a  painful loss. That is why I am proud to be leading legislation  alongside…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695554/american-cancer-society-fly-in"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…Jerry has always put the people of our community first, and his deep  desire to serve his community is an inspiration to all who have had the  opportunity to experience his passion for  protecting our community's most vulnerable.\n\nIn addition to his law enforcement career, Detective Gachett is an  ordained minister and a devoted follower of Jesus Christ.…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687992/congratulating-jerry-gachett-on-his-retirement"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…like and building power  and coalition to realize those dreams for people in Wheaton.\n\nI had the pleasure of meeting Deborah at one of my townhalls, where I  saw firsthand her passion to fight for herself, her family, her  community, and our district.\n\nMr. Speaker, on behalf of Illinois' Third Congressional District, it  is my honor to recognize Deborah…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690325/national-fair-housing-month-amisha-patel"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…sometimes impels to war the  government, contrary to the best calculations of policy. The government  sometimes participates in the national propensity and adopts through  passion what reason would reject; at other times, it makes the  animosity of the nation subservient to projects of hostility instigated  by pride, ambition and other sinister and…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700163/reading-of-washingtons-farewell-address"}, {"senator": "Jim Costa", "party": "Democrat", "sentence": "…leader who was well respected throughout  the country. John shaped the Harris Ranch and turned it into one of the  Nation's largest beef producers in America.\n\nIn addition, his passion was as a leader in the horseracing industry  in which his horses were successful and won on numerous occasions.\n\nJohn always understood the importance of education and gave…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693899/denouncing-cuts-to-k-12-schools"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…amplifying  underrepresented voices and advancing policies that create a lasting  impact. Whether championing local initiatives or supporting statewide  policy efforts, she brings passion and dedication to every role she  undertakes.\n\nRose is known for her unwavering commitment to uplifting her  constituents, addressing systemic disparities, and building a…", "date": "2025-06-13", "source_url": "https://justfacts.votesmart.org/public-statement/1692570/recognizing-rose-bonnick"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…we       all conspired in our decline, either by deliberate actions or       neglect. We have all played some role in it. Certainly, I       have. Sometimes, I have let my passion rule my reason.       Sometimes I made it harder to find common ground because of       something harsh I said to a colleague. Sometimes I wanted to       win more for the…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…Victoria  Rosas, a DACA recipient in my home county, Orange County. Victoria was  raised in Fullerton, California, and thanks to her DACA status, she was  able to pursue her passion for healthcare and helping others.\n\nToday, Victoria is a nurse, and in her spare time, she has written a  book and founded a non-profit group called Empower Moms California.…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689385/daca-and-the-american-dream"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…Educators Rising is a community-based, Career and Technical Student  Organization that supports middle and high school students in rural,  urban, and suburban communities with a passion for teaching in their  communities.\n\nWith over 60 percent of K-12 educators in the United States teaching  within 20 miles of the high school they attended, creating pathways…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688150/recognizing-the-10th-anniversary-of-phi-delta-kappa-internationals-educators-rising"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…communities of color.\n\nJerome's leadership extends far beyond boardrooms and policy tables.  He is also a powerful role model for our youth. Merging his love of  soccer with a deep passion for mentorship and ``peaceful'' demeanor, he  has served as Director of Coaching for the River Flow Soccer Club and  President of the Flower City Soccer League.\n\nIt is with…", "date": "2025-06-13", "source_url": "https://justfacts.votesmart.org/public-statement/1692565/recognizing-jerome-h-underwood"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…lead.\n\nMr. Speaker, it is an honor to celebrate the past successes of FFA  while also looking ahead to the incredible contributions that future  FFA leaders will make. Their passion, knowledge, and dedication give us  confidence in the future of American agriculture and the prosperity of  our Nation.", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687891/national-future-farmers-of-america-week"}, {"senator": "John Thune", "party": "Republican", "sentence": "…Administration, where  she was known for listening to small businesses to make the SBA a more  effective Agency.\n\nShe will bring valuable experience, an incredible work ethic, and a  passion for education to her new role leading the Department of  Education. And she has a big task ahead of her. Let's acknowledge that.  In January, the Nation's report card revealed…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688343/nomination-of-linda-mcmahon"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…didn't know the story of my friend from Colorado's mother.  Certainly, when someone is touched by an issue, they certainly become  passionate about it. I greatly appreciate her passion on the issue.\n\nThe section 1115 waivers are important to the Medicaid program.  States are the laboratories for democracy. Section 1115 waivers provide  key State flexibility…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691874/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…outreach, and event planning. When the  CARES Senior Center closure displaced 25 volunteers, RSVP Pasco worked  diligently to connect them with new opportunities, ensuring their  passion for service was not lost. Similarly, at Grace's Food Pantry,  Ambassadors stepped in to address staffing shortages, ensuring  continuity in service. Their proactive approach…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690139/recognizing-ann-wilkinson"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…exemplifies what it means to be a Local  Hero--not for accolades or recognition, but because he truly cares  about his hometown and its people. His selfless dedication, unwavering  passion, and boundless generosity have made an enduring difference in  Brooksville. For these reasons, Casey is a deserving recipient of the  Local Hero Award, and it is with great…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690159/recognizing-casey-thieryung"}, {"senator": "Kat Cammack", "party": "Republican", "sentence": "…Hopkins Vocational School, the  U.S. Army Signal School, and the U.S. Army Command and General Staff  College, he combined technical skill with a lifelong love of learning.  His passion for electronics led to a successful career in broadcasting,  where he worked with WTVJ in Miami, co-founded Omni Video, and later  served as Engineering Manager at Telemundo.…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697024/recognizing-alfred-thomas-lewerenz"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "…Workers of America for over 20 years. Representing an area of Florida  that stretched from Jacksonville to Tampa, it was through this  opportunity that Bobby first developed his passion for the political  arena, an opportunity he contributed to his later years of service to  Florida's agricultuie industry.\n\nFrom 1993 to 2000, Bobby served as President, Vice…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688335/in-memory-of-mr-bobby-beagles"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…and owning a successful small business, Jenya sets  a powerful example for others in the beauty industry--especially  through her professionalism, attention to detail, and passion for her  craft. Her salon attracts clients from diverse backgrounds, notably the  large Eastern European community in Bucks County. Through her ability  to blend American…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691903/recognizing-beauty-moods-one-year-anniversary"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…the past decade, he has  volunteered as a docent for Cranbury Historic Home Tours. Throughout  his entire professional journey, Principal Kern has seamlessly combined  his passion for music, arts, and culture with his work in educational  administration.\n\nBeyond his professional achievements, Principal Kern is a devoted  husband and father. His wife,…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694739/recognizing-neshaminy-school-district-core-creek-elementary-school-principal-brian-kern-for-32-years-of-service"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Brooksville Main Street. Andrea embodies the true spirit of a Local  Hero through her unwavering dedication to historic preservation,  volunteerism, and community service. Her passion for preserving the  cultural and architectural heritage of our town has left an indelible  mark, ensuring that future generations can appreciate and learn from  the past.…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690145/recognizing-andrea-read"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…knew him for going above and beyond by holding extra weekly  office hours, meeting with study groups in the library before midterms,  and helping however he could. His true passion for teaching that was  ignited in that role has continued to this day.\n\nHis current high school students know him similarly as the teacher  who is always willing to help,…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "…research.\n\nBarbara embodies the very best of our community's values through not  only her consistent dedication to better understanding the world around  her, but also through her passion for preparing future generations of  researchers as a professor within the University of California,  Irvine's Department of Chemistry.\n\nBarbara holds a bachelor's degree…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692467/recognizing-the-achievements-of-dr-barbara-j-finlayson-pitts"}, {"senator": "Kat Cammack", "party": "Republican", "sentence": "Mrs. CAMMACK. Mr. Speaker, today we recognize and cerebrate the  legacy of a group of individuals whose passion for the game of baseball  helped lay the foundation for college athletics at Santa Fe College in  Gainesville, Florida.\n\nIn the 1970-71 academic year, at what was then known…", "date": "2025-05-23", "source_url": "https://justfacts.votesmart.org/public-statement/1691678/recognizing-the-gainesville-nine"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…servant who has made a lasting impact on Lamar State College Orange and  the community of Southeast Texas.\n\nFor seven years, Dr. Johnson has led Lamar State College Orange with  passion, determination, and a hands-on approach. He rolled up his  sleeves every day to deliver real results, record-breaking enrollment  and graduation rates, new vocational programs,…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694750/recognizing-the-retirement-of-dr-tom-johnson"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…many others in Congress, this was moved with Mach, with  airspeed, and I appreciate that.\n\nI am also deeply grateful to the dedicated volunteers of the MACH  Coalition, whose passion and persistence helped carry this effort  forward.\n\nMy heartfelt thanks go to Senator Mark Kelly, himself a combat  veteran, a pilot, and an astronaut, and Senator Cotton…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693896/aces-act-of-2025"}]