[{"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…and big heart. Elected to our respective seats, myself to  Congress and Steve to the General  Assembly, in the same year, we have developed a special kinship, rooted  in our passion for service and desire to make a difference in the lives  of others. I am so proud to stand today to extend my heartfelt  congratulations to Steve Dargan on this very special…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689392/recognizing-the-honorable-steven-steve-dargan-west-havens-2025-irish-person-of-the-year"}, {"senator": "Susie Lee", "party": "Democrat", "sentence": "…partners with marginalized communities to expand equitable solar  access around the world.\n\nNevada's Third District is honored to have such an accomplished  athlete with a passion for outdoor recreation and making the world a  better place. We are all looking forward to seeing what Alex will  accomplish next.\n\nI congratulate Alex.", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699610/recognizing-alex-honnold"}, {"senator": "Adam Gray", "party": "Democrat", "sentence": "…recently the Minerva Empresaria Award 2022 from the  California State Hispanic Chamber of Commerce which recognizes  businesswomen who empower others by leading with wisdom and passion.\n\nPlease join me in honoring Annissa Fragoso for her dedication,  commitment and selfless service to the people of Merced County.", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695992/recognizing-annissa-fragoso"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…fact that  he will continue to play a policy role will be important for both of  our nations and for all of us who care about maintaining democratic  values. I know that his passion for public service, his commitment to  internationalism, and his insightful analysis are ending here after his  time in Washington.\n\nIn closing, on behalf of my colleagues…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699544/9999"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…Coloradans. She spearheaded programming for school groups and  established internships and apprenticeships at the park. The AHRA and  the Salida community are lucky to have Corrine's passion and dedication  as she helps to inspire an appreciation for public lands in the next  generation of Coloradans.\n\nOn behalf of the people of Colorado's Seventh Congressional…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687996/recognizing-corrine-servis"}, {"senator": "Suzan DelBene", "party": "Democrat", "sentence": "…State at the 2025 Regeneron International Science and Engineering Fair.  For more than 70 years, thousands of students from various science fair  networks have explored their passion for scientific research at the  world's largest pre-college science competition. Students from more  than 75 countries, regions and territories competed across 21 different…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693893/recognizing-anusha-arora-for-scientific-excellence"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…Jerry has always put the people of our community first, and his deep  desire to serve his community is an inspiration to all who have had the  opportunity to experience his passion for  protecting our community's most vulnerable.\n\nIn addition to his law enforcement career, Detective Gachett is an  ordained minister and a devoted follower of Jesus Christ.…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687992/congratulating-jerry-gachett-on-his-retirement"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…community  agencies.\n\nWhether she is coordinating drop-off sites, recruiting volunteers, or  searching for donated warehouse space, Rita's logistical skill set  matches her passion and her dedication.\n\nRita has described her late hours and working weekends with the  Marine Corps Reserve DuPage County Toys for Tots program as an  obsession, one she pursues…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697836/commending-omar-martinez-gonzalez"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…to be a partisan thing where the  White House just notifies those of the same party?\n\nI have tried to be consistent about this. When I came to the Senate  in 2013 with this passion that I am going to do anything I can to stop  an unnecessary war, within a few months of arriving here, President  Obama, who is a personal friend, was contemplating military…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693124/motion-to-discharge-sj-res-59"}, {"senator": "Jim Costa", "party": "Democrat", "sentence": "…leader who was well respected throughout  the country. John shaped the Harris Ranch and turned it into one of the  Nation's largest beef producers in America.\n\nIn addition, his passion was as a leader in the horseracing industry  in which his horses were successful and won on numerous occasions.\n\nJohn always understood the importance of education and gave…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693899/denouncing-cuts-to-k-12-schools"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…REOC as a security guard, he steadily  rose through the ranks to become Executive Director. His life story is  a testament to his perseverance and dedication.\n\nRoosevelt's passion for service extends far beyond Rochester. Deeply  connected to his Haitian roots, he founded Elevate Haiti Ministries, an  organization dedicated to building an orphanage…", "date": "2025-06-13", "source_url": "https://justfacts.votesmart.org/public-statement/1692566/recognizing-roosevelt-mareus"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…we       all conspired in our decline, either by deliberate actions or       neglect. We have all played some role in it. Certainly, I       have. Sometimes, I have let my passion rule my reason.       Sometimes I made it harder to find common ground because of       something harsh I said to a colleague. Sometimes I wanted to       win more for the…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…graduated  with high honors from Godinez Fundamental High School in Santa Ana and  then went on to earn a bachelor's degree in public health from UC  Merced in 2019.\n\nMartha's passion for innovation led her to University Lab Partners,  where she helps startup companies develop groundbreaking medical  devices and diagnostic devices. She helps bridge the…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688313/daca-recipients-need-pathway-to-citizenship"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…Educators Rising is a community-based, Career and Technical Student  Organization that supports middle and high school students in rural,  urban, and suburban communities with a passion for teaching in their  communities.\n\nWith over 60 percent of K-12 educators in the United States teaching  within 20 miles of the high school they attended, creating pathways…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688150/recognizing-the-10th-anniversary-of-phi-delta-kappa-internationals-educators-rising"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…a remarkable leader and educator in our  Rochester Jewish community: Monica Gurell.\n\nMonica Gurell serves as the President of Temple B'rith Kodesh, where  she has led with passion, humility, and inclusiveness. She began her  journey at TBK by nurturing young minds--teaching a class of four-year- olds--and later, with her husband Dan, advising the youth…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691572/recognizing-monica-gurell"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…York FFA Chapter and a  graduate of Eastern York High School.\n\nAgriculture is crucial to Lancaster and York Counties, and the newly  elected officers have demonstrated both passion for and knowledge of  our local community.\n\nI commend Sarah Firestone, Sally Bollinger, and Leah Flinchbaugh for  their leadership in the Pennsylvania FFA. As they settle…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698569/recognizing-and-thanking-joanne-horn"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…and owning a successful small business, Jenya sets  a powerful example for others in the beauty industry--especially  through her professionalism, attention to detail, and passion for her  craft. Her salon attracts clients from diverse backgrounds, notably the  large Eastern European community in Bucks County. Through her ability  to blend American…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691903/recognizing-beauty-moods-one-year-anniversary"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…Austin has left an indelible mark  on the lives of countless Soldiers, Army civilians, and their families.\n\nEven after retiring as a Colonel in the U.S. Army, Mr. Austin's  passion to serve endured. In June 2015, he returned to the Army Reserve  as a member of the Senior Executive Service, where he represented the  Army Reserve in the formulation and…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696046/recognizing-mr-stephen-d-austin-assistant-chief-of-us-army-reserve"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…professionals reveal that many are  hesitant to seek mental health treatment due to fears of professional  consequences. For example, pilots often speak about their careers with  deep passion, and the prospect of losing their wings is seen as one of  the worst possible outcomes. As a result, many choose not to self- report mental health concerns, fearing they might…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692308/recognizing-aviation-professionals"}, {"senator": "John Thune", "party": "Republican", "sentence": "…Administration, where  she was known for listening to small businesses to make the SBA a more  effective Agency.\n\nShe will bring valuable experience, an incredible work ethic, and a  passion for education to her new role leading the Department of  Education. And she has a big task ahead of her. Let's acknowledge that.  In January, the Nation's report card revealed…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688343/nomination-of-linda-mcmahon"}, {"senator": "Kat Cammack", "party": "Republican", "sentence": "…Hopkins Vocational School, the  U.S. Army Signal School, and the U.S. Army Command and General Staff  College, he combined technical skill with a lifelong love of learning.  His passion for electronics led to a successful career in broadcasting,  where he worked with WTVJ in Miami, co-founded Omni Video, and later  served as Engineering Manager at Telemundo.…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697024/recognizing-alfred-thomas-lewerenz"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…time  to close. I know it is painful to listen to an idiot like me for 5  minutes, but let's have some fun here.\n\nFirst, I want to say to everyone who has spoken, I love the passion  and I love the caring. I just, once again, have to come back. This is a  reconciliation budget. It basically builds boxes. This box here is for  your authorization. You can…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688035/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Wirt has made to our community through her  volunteer work at Veterans Elementary School. Cheryl comes to volunteer  at the school almost every day. She has a big heart and a passion for  helping students and staff. Cheryl is very involved with the community  group that heads up all fundraising for the school. She helps with  ideas, calls, and follow-through…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690177/recognizing-cheryl-wirt"}, {"senator": "Rick Crawford", "party": "Republican", "sentence": "…have led to lowered office referrals,  boosted teacher effectiveness, and 20 percent growth in enrollment.\n\nDr. Morris exemplifies commitment, hard work, and an unwavering  passion for academic success. His recognition as Superintendent of the  Year is not only an incredible personal milestone, but a reflection of  the great community we have throughout…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695857/recognizing-nathan-morris-2026-arkansas-superintendent-of-the-year"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…to  support and uplift fellow Veterans and their families, constantly  working to grow membership and expand community outreach.\n\nIn addition to his work in the VFW, Walt's passion for supporting  Veterans continued in his role as a Veterans Affairs Caseworker for the  United States House of Representatives. In this capacity, Walt worked  tirelessly…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692464/recognizing-the-life-and-service-of-united-states-army-veteran-walt-hartnett"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…fitting contest at the 2024 World Dairy Expo.\n\nDairy farming is not an easy profession, but Kyle approached every  task--from washing animals to packing their bedding--with passion,  drive, and humility. These same qualities have made him stand out as  one of the very best in fitting, raising, and breeding cattle.\n\nAgriculture is the backbone of Pennsylvania's…", "date": "2025-10-28", "source_url": "https://justfacts.votesmart.org/public-statement/1696415/congratulating-kyle-welk-on-being-named-the-2025-merle-howard-award-winner"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…extraordinary young Iowan, 8-year-old Marley Morris, whose kindness and  compassion are making a meaningful difference in the lives of children  battling cancer.\n\nMarley has turned her passion for crafting handmade bracelets into a  mission of hope and joy, donating 100 of her creations to young  patients at the University of Iowa Stead Family Children's Hospital.…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697377/recognizing-pella-marching-dutch"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…many others in Congress, this was moved with Mach, with  airspeed, and I appreciate that.\n\nI am also deeply grateful to the dedicated volunteers of the MACH  Coalition, whose passion and persistence helped carry this effort  forward.\n\nMy heartfelt thanks go to Senator Mark Kelly, himself a combat  veteran, a pilot, and an astronaut, and Senator Cotton…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693896/aces-act-of-2025"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "Mr. ALFORD. Mr. Speaker, I thank the chairman for this important  piece of legislation. I thank the ranking member for her passion and  her concern for small businesses in America.\n\nMr. Speaker, I rise today in strong support of H.R. 2931, the Save  SBA from Sanctuary Cities Act of 2025, championed by…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692100/save-sba-from-sanctuary-cities-act-of-2025"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…services and secretary for the Georgia Perinatal  Association, and she worked diligently in reducing morbidity and  mortality in pregnant mothers and infants.\n\nMs. Daniels' passion and dedication for her profession are truly  inspirational. This recognition speaks not only to her skill, but also  to her compassion and commitment to healing and serving…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699261/recognizing-wayne-barth"}]