[{"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…Congress' power of the purse. Some will admit that. Some will say it  silently.\n\nIf there were ever a time for this Congress to exercise that power,  it is now. Let us pass five bills on which we have agreement and  substantially restrain and stop the funding of DHS a week from this  Friday. Then, let us come to an agreement on honoring the Constitution,…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699570/consolidated-appropriations-act-2026"}, {"senator": "Rick Larsen", "party": "Democrat", "sentence": "…loopholes, legal shields, and limited oversight of  polluters.\n\nThird, this bill will end up slowing projects by increasing  regulatory uncertainty and delay. Democrats want to pass bills that  invest in infrastructure and get projects done faster. That is why we  passed the bipartisan infrastructure law. It invested in all types of  infrastructure for communities…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698022/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…by a vote of 88 to 12. In 1990, the landmark Clean Air  Act amendment passed the Senate 89 to 11--overwhelming bipartisan  support. But today, Republicans are trying to pass these bills to gut  California's Clean Air Act authority under a simple 50-vote threshold.  They are plotting to overturn the Senate Parliamentarian's  determination, plain and simple.…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691542/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…bills that specify exactly how funds are to be spent,  just as we had always done until last year.\n\nSo with the next funding deadline coming up, it is crucial that we  pass these bills, protect the funding that our families count on,  reject Trump's heartless cuts, and put power back in the hands of the  American people and their elected representatives…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698874/commerce-justice-science-energy-and-water-development-and-interior"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…decided to spend their time and their majority here in  Washington, D.C.\n\nMr. Speaker, I am sure we will proceed with a few more days of  debate. I am sure Republicans will pass their bills on commercial  freezers and walk-in refrigerators, and then we will be back next week.  One can only hope that Republicans will have seen the light by then and  that we…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689052/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers-providing-for-consideration-of-hr-defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…for nearly 50 percent of all of the United States' consumer spending,  so obviously something is out of whack. Despite this reality, House  Republicans are attempting to pass three bills this afternoon that  would cut workers' wages.\n\nThis bill, H.R. 2262, would relieve employers of the obligation to  pay employees for training outside of their regular…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698955/flexibility-for-workers-education-act"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…a vote of  88-12 in 1967. The Landmark Clean Air Act amendments passed the Senate  89-11 in 1990 by overwhelming bipartisan support.\n\nBut now Republicans are trying to pass these bills that strike at the  heart of the Clean Air Act's provision for California on a simple  majority 50-vote threshold, bypassing the filibuster.\n\nRepublicans certainly must…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691454/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…someone who has dedicated years of my  career to education striving to create a better future for children, I  find it disturbing and ironic that my colleagues in the majority pass  bills that they say are to protect students but, in fact, do nothing to  address the real challenges children are facing in schools today.\n\nThe majority is willing to pass a bill…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689733/challenges-facing-our-students"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…legislation on quantum and on reauthorizing NSF and NIST that I am so  proud to see making its way through the Committee on Science. I hope  that my colleagues will join in to pass those bills.\n\nToday, we use our voices to call out the harms of an antiscience  agenda, the setbacks it means for equity, the setbacks it means for  disadvantaged students, women,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691394/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…bills like this?\n\nWhat I find particularly offensive is that in a week that we should  be working to address the healthcare crisis in a bipartisan manner, you  are trying to pass bills today that would undo local police reforms  that our Nation's Capital put into place after George Floyd's murder to  ensure that the people of this city are safe and that…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696976/district-of-columbia-cash-bail-reform-act-of-2025"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…are responsible for investigating wage theft and safety and health  hazards in high-risk areas.\n\nThat is just a small smattering of the impact of the failure to pass  these five bipartisan bills, where we had 341 ``yes'' votes in this  Chamber not 3 weeks ago.\n\nNow, some might say: Well, what do you think about what ICE and the  CBP are doing? I am not…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699573/consolidated-appropriations-act-2026"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…picking out some departments and not others.\n\nThis is just simply making sure that this is a bipartisan effort to  fund local police officers.\n\nSo I ask my colleagues to pass these bills as I amend them so that we  can refocus on the urgent work of reopening the government and then  providing all law enforcement agencies with the resources they need,…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696004/unanimous-consent-requests"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…it had been paired with. Both  bills are bipartisan; both even have a budget score, and yet the  Democratic bill sits with no plan to get it signed into law.\n\nWe need to pass bills over here in a way that ensures that both  Republican and Democratic priorities and bills become law.\n\nIn addition, I do have substantive concerns with S. 1084. I was not…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698420/unanimous-consent-requests-the-calendar"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…They also update, refine, and change language in some cases that  is 2 and 3 years old and is simply out of date with the current  circumstances.\n\nIf we were to fail to pass these bills in these respective areas,  then that language would remain intact. I think it is important to  recognize that we were able to come to agreements in this way simply  because…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699054/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…$37 trillion in debt. You may hear from  your local Congressman that all sorts of things can't be done because  we have a 60-vote rule in the U.S. Senate, and we can't pass many bills  without the 60 votes, including the big appropriation bills that have  to pass every year.\n\nHowever, once a year, and due to a quirk, three times in the 2 years  that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694922/passing-bills-with-51-votes-in-senate"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…you work with us on some bills that you can move in a pairing,  then we will pass this.\n\nSo I have done that, and I will talk about that. I am actually going  to try to pass two bills.\n\nI see that the senior Senator from New Mexico is on the floor, which  doesn't bode well for the passage of this bill, which is disappointing,  and I am going to get to…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696959/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-extension-of-deadlines-in-standards-of-performance-for-new-reconstructed-and-modified-sources-and-emissions-guidelines-for-existing-sources-oil-and-natural-gas-sector-climate"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…remains a threat to American interests. I have no doubt that  they would still like to indoctrinate American children and teachers,  and that is why we must be vigilant and pass these bills.\n\nH.R. 1049, the TRACE Act, sends a clear message: Parents have a right  to know what their children are learning, especially when curricula are  funded by authoritarian…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697438/transparency-in-reporting-of-adversarial-contributions-to-education-act"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "Ms. MURKOWSKI. Mr. President, I am really very glad we were able to  reach agreement today to pass these four bills by unanimous consent and  will send them to the President to be signed into law.\n\nI want to acknowledge and thank my colleague and friend from Nevada  Senator Cortez…", "date": "2025-06-18", "source_url": "https://justfacts.votesmart.org/public-statement/1692655/salem-maritime-national-historical-park-redesignation-and-boundary-study-act"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…and the Senate  struck a bipartisan and bicameral deal to move forward on these  remaining appropriations bills for fiscal year 2026.\n\nThe House acted expeditiously to pass these bills, marking historic  progress for our appropriations process and the return to regular order  that every Member of this Chamber wants to see.\n\nI share the frustrations of…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699575/consolidated-appropriations-act-2026"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "…substantive objection.\n\nThe American people understand that there will be opposition to a lot  of pieces of legislation, but they also, justifiably, expect us to  consider and pass bills on their merits. As to this category of bills  that are important to some, unknown to most, and controversial to no  one, well, they expect us to get those passed in a timely…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698423/unanimous-consent-requests-the-calendar"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…bars.\n\nWe should get all of these bills across the finish line and ensure  that President Trump has the tools he needs to restore law and order in  this country. We should pass these bills so that our law enforcement,  our judges, our DAs have every tool they need to get these career  criminals, these gang leaders off the streets in Memphis, TN.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695666/cloture-motion"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…the Senate. We are relying on Democrats to join us in order to  get it over the finish line.\n\nA deal was cut, apparently, where we made a deal that we said we will  pass all of these bills as one package. Republicans voted for things  they didn't like because, allegedly, Democrats in the Senate would go  along at the end. As sometimes happens, people…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699594/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}]