[{"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…passed away from a medical event  while under the careless and unconcerned watch of ICE.\n\nThe title of ICE's press release following the tragedy?\n\n``Criminal illegal alien passes away at University Hospital following  medical emergency at Delaney Hall Detention Facility.''\n\nHow callous. How sick.\n\nIn one sentence, these twisted individuals reveal the…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699655/horrific-ice-abuses"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…fails to recognize  the premature and escalatory deployment of the National Guard and  active-duty Marines by President Trump to Los Angeles.\n\nWhen the House of Representatives passes a resolution regarding  current events, it should do its due diligence to cite the facts.  Unfortunately, it is clear the Republican majority had no interest in  accurately…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693150/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…of interest to some of our listeners here today that  Social Security is the number one insurance program for a Nation who  relies on their government to make sure that it passes on savings to  them that they have paid for. This is no entitlement. All one has to do  is go to their pay stub where it says FICA, Federal insurance  contribution. Whose money…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687913/social-security-is-an-earned-benefit"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…activity in crypto currency. The  same should be true for the Presidency. Why are we having two different  standards? I think the answer is obvious.\n\nThat means, if the Senate passes this legislation tomorrow, it would  give Congress's blessing for President Trump and his family to further  enrich themselves, with very little protection for consumers.…", "date": "2025-06-16", "source_url": "https://justfacts.votesmart.org/public-statement/1692590/genius-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…here is that while NHTSA has not finalized the rule, they  would not be able to do any work related to the rule or advanced  alcohol monitoring technology if this amendment passes. That is going  to just cause more deaths from drunk driving.\n\nI would implore everybody: Please, privacy can be addressed, but we  should not stop this work from continuing.…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699286/amendment-no-1-offered-by-mr-massie"}, {"senator": "Sylvia Garcia", "party": "Democrat", "sentence": "…fight isn't over.\n\nThis week, I stood with powerful women in Congress to introduce a  resolution that removes our final barrier: the arbitrary deadline set  decades ago. If it passes, the ERA becomes the 28th Amendment.\n\nWe must pass this resolution. We must remove all barriers to women  because our rights don't have deadlines. Our rights are human rights.", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689199/fighting-to-guarantee-equal-rights-for-all-women-under-the-constitution"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…Speaker, remember too that 22,000 outdoor recreation jobs and the  $13.5 billion outdoor recreation economy in Minnesota will all be in  serious jeopardy if this resolution passes. The Boundary Waters is a  national treasure, the most visited wilderness area in the United  States. There is no place like it on Earth, and once it is destroyed,  it will…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699272/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…Review Act to cover waivers. And then you simply craft a bill.  Republicans being in charge of the Senate and the House, they bring it  to the floor; we debate it; it either passes or it doesn't pass.\n\nIt has the advantage of going through committee and being considered  and having people weigh in on whether it is a good idea or not. But to  simply reinvent…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691625/congressional-review-act"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…separation of powers. That is why I have called for  Senators to be notified about surveillance in response to overreach by  Trump in the past. Once Senator Heinrich's bill passes, I am committed  to working with colleagues on both sides of the aisle to address the  threat of surveillance by the executive branch.\n\nIt is deeply regrettable that my colleagues…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697046/unanimous-consent-requests"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…which I introduced and would  like to ask for passage today. There will be a unanimous consent  request made at the end of my statement. If that unanimous consent  request passes, and I hope it does with bipartisan support, it will go  to the House of Representatives for their consideration. It will be  miraculous. We just might pass a bill. We just…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698999/disrupt-explicit-forged-images-and-non-consensual-edits-act-of-2025"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "Ms. HOYLE of Oregon. Madam Speaker, H.R. 183 would amend the Federal  Lands Recreation Enhancement Act to provide free America the Beautiful  passes to law enforcement officers and firefighters.\n\nExpanding outdoor recreation and ensuring Americans can access and  enjoy our public lands is a shared bipartisan priority on…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693929/law-enforcement-officer-and-firefighter-recreation-pass-act"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…Affordable Care Act subsidies are about to expire.  Oh, that was part of President Trump's One Big Beautiful Bill Act.\n\nMr. Speaker, I want to ensure that the funding Congress passes is  actually delivered to the people in our communities, and I don't want  it to be illegally cut or withheld by the Trump administration. We are  seeing cuts in CDC, NIH,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695715/ensuring-funding-for-communities"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…fragile global supply chains can be and how the closing of  narrow physical chokepoints can lead to shortages and inflation. More  than 30 percent of global container trade passes through the Red Sea.  If these waters cannot be navigated because of pirates and terrorism,  Americans will continue to feel the costs here at home.\n\nUnfortunately, we are…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692721/sanction-sea-pirates-act-of-2025"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…insurance. As soon as next year, people could start  losing coverage. That is what we are being told might be coming down  the way.\n\nIf the rule that we are talking about right now passes, my Republican  colleagues will be able to rush that newly changed bill to the floor  just hours later, giving Members and the American public zero time to  read it or to review…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691512/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…SEIU       represents tens of thousands of workers, including janitors,       security guards, and healthcare workers, who would have their       rights weakened if this bill passes.\n\nH.R. 2312, the Tipped Employee Protection Act, would amend       federal minimum wage and overtime law by broadening the       definition of tipped employee and increasing…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698964/tipped-employee-protection-act"}, {"senator": "Mario Diaz-Balart", "party": "Republican", "sentence": "…so many other  communities that this bill will help, including Miami Lakes, which I  have the privilege to represent.\n\nMr. Speaker, this is going to be the third time if it passes--and I  hope it will--that we pass this bill out of the House. This bill has a  Senate companion, and, Mr. Speaker, it is a bipartisan Senate  companion. I want to mention…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693863/establishing-new-zip-codes"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…American people, Kansans, deserve something different  from the U.S. Senate.\n\nEvery city council or commission, every school board, every local  government office in my State passes a budget and then lives within  that budget every year. Every local unit of government can figure this  out, and the U.S. Senate is failing one more time.\n\nA shutdown means…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695918/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…suspend the rules and pass the  bill (H.R. 1682) to amend the Federal Lands Recreation Enhancement Act  to provide for lifetime National Parks and Federal Recreational Lands  Passes for family members of members of the Armed Forces who lost their  lives while serving their country.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691053/benefits-that-endure-for-lifetimes-of-service-act"}, {"senator": "Richard McCormick", "party": "Republican", "sentence": "…program to preserve  peace in a critically important region.\n\nTrade in the Indo-Pacific accounts for about 40 percent of the  world's GDP. Around 21 percent of the global trade passes through the  Taiwan Straits, including 40 percent of the world's container fleet.  The Taiwan Semiconductor Manufacturing Company produces 90 percent of  the world's AI chips,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695256/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Thomas Massie", "party": "Republican", "sentence": "…a billionaire or buying politicians keeps you out of the  judicial system, lets you rape young women, lets you traffic women, you  have another thing coming when this bill passes.\n\nDo not let the Senate muck this up. There have already been efforts  to derail our discharge petition. The Oversight Committee has released  thousands, tens of thousands…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696903/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision-providing-for-consideration-of-h-con-res-denouncing-the-horrors-of-socialism-providing-for-consideration-of-hr-unlocking-our-domestic-lng-potential-act-of-providing-for-consideration-of-hr-researching-efficient-federal-improvements-for-necessary-energy-refining-act-providing-for-consideration-of-hr-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-providing-for-consideration-of-hr-district-of-columbia-cash-bail-reform-act-of-and-for-other-purposes"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…Horizon Lateral pipeline to ensure a resilient and reliable water  supply for families and businesses across the Las Vegas Valley. The  preferred southern route of this pipeline passes under the Sloan Canyon  National Conservation Area. Compared to other alternatives, this  alignment minimizes impacts on neighborhoods and is estimated to save  taxpayers nearly…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698162/sloan-canyon-conservation-and-lateral-pipeline-act"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…education.\n\nI also expect that she understands the difference between the  executive and legislative branches when it comes to the serious  policymaking of education. Congress passes the laws and holds the power  of the purse. We have also the responsibility to make sure that laws  are faithfully executed by the executive branch of government. I expect…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688387/nomination-of-linda-mcmahon"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…assembled,       SECTION 1. SHORT TITLE.\n\nThis Act may be cited as the ``Law Enforcement Officer and       Firefighter Recreation Pass Act''.       SEC. 2. NATIONAL RECREATIONAL PASSES FOR LAW ENFORCEMENT                     OFFICERS AND FIREFIGHTERS.\n\nSection 805(b) of the Federal Lands Recreation Enhancement       Act (16 U.S.C. 6804(b)) is amended--\n\n(1)…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693931/law-enforcement-officer-and-firefighter-recreation-pass-act"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…the same.\n\nAccordingly, I would submit to you that we have jurisdiction. I would  submit, further, Madam Speaker, that while CRAs can't be reviewed by  the courts, when this passes--and I think it will, notwithstanding  outside objectors--CRAs technically can't be reviewed by the courts.\n\nIt will be interesting to see when it gets to the Supreme Court…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690434/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-nox-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "Mr. GRAHAM.  I didn't mean to butcher your name.  I ask that all the staff on the list from Senator Merkley's staff be  given all-access floor passes to the Senate floor during consideration  of H. Con. Res. 14.", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689534/privileges-of-the-floor"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…year in December, I came down to the Senate floor,  and I passed this unanimously. It passed. So the Senate passed it last  year. The House has already passed it. If this bill passes tonight, it  is going to go to the President, and he is going to sign it.\n\nWhy would anyone block this?\n\nSo I tried to do this a month ago, and Senator Padilla was on the…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696959/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-extension-of-deadlines-in-standards-of-performance-for-new-reconstructed-and-modified-sources-and-emissions-guidelines-for-existing-sources-oil-and-natural-gas-sector-climate"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…took place in the Gulf of Oman near the strategic  Strait of Hormuz, the narrow mouth of the Persian Gulf through which  nearly a fifth of all crude oil traded in the world passes. This is an  ominous sign. We know they are strengthening their cooperation together  in a way to undermine and challenge the West, including the United  States. The last thing…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688824/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…fall? Does anybody think our education would improve if we had kids who  are doing a better job of focusing at school?\n\nIt is high time, in the second bill that this Congress passes, that  we begin to address this problem. We can't address it by giving every  married couple $25,000 a year because we don't have that kind of money  and would probably only…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695628/breakdown-of-traditional-families"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…struggling. She maybe wants to put together  a college fund for her kid. Maybe she wants to take her family on a  vacation. She is going to have that opportunity when this bill passes.\n\nMr. Speaker, do you know who else we are going to give opportunity to  in this bill? Sorry, it is not a billionaire again. It is that shift  worker working overtime. The…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693191/one-big-beautiful-bill-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…country we were moving to  LLCs, professional partnerships, pass-through entities, so much of what  you would have seen back in the early 1980s, 1970s, 1960s as corporate  now passes through, so some of it was a corporate structure. You always  have to be careful when you say: Why are corporate taxes down so much?  It is now because it flows through on…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695567/we-are-borrowing-a-second"}]