[{"senator": "Mazie Hirono", "party": "Democrat", "sentence": "Ms. HIRONO. Mr. President, I want to thank my colleague from Maryland  for his passionate advocacy for IDEA. IDEA is a critical program of the  U.S. Department of Education.\n\nLet me tell you what is happening to the U.S. Department of Education  under President…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697008/9999"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…networks. I am honored to recognize Rev. Dr. Della  J. Owens-Barber on her fourth anniversary as Senior Pastor at the Saint  James Christian Church and salute her for her passionate service to her  community and our country.", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697322/recognizing-the-dedicated-public-service-of-reverend-dr-della-j-owens-barber"}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "…Senator Padilla was outrageous. It was  violent. It is a scary thing to see happen in the United States of  America.\n\nAlex Padilla is a great guy. He is thoughtful. He is passionate. He  is just trying to serve his constituents in the best way he knows how  by doing the thing that is in our Constitution--freedom of speech,  article I--by exercising his…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692559/alex-padilla"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…and  probably more in Mr. Green's, are at risk of losing their care as seen  in our Children's Hospital. Medicaid is a lifeline to individuals with  disabilities.\n\nHe was passionate. He was emotional. He is deeply committed to  protecting the vulnerable. He should not be censured for the way in  which he expressed his passion and his concern and his…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688501/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…first 10  years; and, third, honest numbers about what each provision costs.  Those are the three things.\n\nWell, that was in 1974. You can picture Robert Byrd, who was a  passionate defender of the 60-vote requirement, but he voted for this  special, fast-track, filibuster-free lane for that one purpose:  reducing deficits.\n\nThat was 1974. Well, 22 years…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693102/one-big-beautiful-bill"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…Great Lakes Water Authority voted to increase water  rates by 5.9 percent and sewage rates by 4.5 percent. They approved  these unaffordable increases despite unanimous and passionate public  opposition, Mr. Speaker.\n\nI want folks to imagine how it feels for many of our residents in  Detroit who have been living out of hotels for weeks after a massive…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688948/water-rate-increase"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…right  to have your voices heard. It threatens who will be willing to run for  office. As someone who was a doctor for almost two decades before I got  into politics, I am passionate about recruiting people from different  backgrounds to run because we need more diversity in who represents us.\n\nOur democracy depends on good people running for office,…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692862/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…General Motors and Chrysler hadn't done that. They were tragically  and frighteningly staring bankruptcy in the face. So, Mr. Speaker, what  I was able to do was, being the passionate 20-something-year-old I was  for my State grappling with this Presidential election that I was a  part of and saw go to victory, I thought: Should I go back to Michigan…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689752/reflecting-on-americas-history"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…PACT Act  signed into law. This landmark law expands VA health care and benefits  for veterans exposed to burn pits, Agent Orange, and other toxic  substances.\n\nTim is also passionate about veteran suicide prevention, and even  helped advocate for September 22 to be recognized as Veteran Suicide  Awareness and Prevention Day in Ohio.\n\nWith this award,…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696713/recognizing-tim-hauser-as-the-champion-of-the-week-for-ohios-13th-congressional-district"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…Department of Education, there is going to be a little  girl  somewhere in this country as brilliant as my mother was, as dedicated  as my father was to public education, as passionate about it as I am  now, who will not be able to succeed because their school lacks a  quality teacher or a principal who knows what he is doing or the school  lacks the resources…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689639/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…for a cure. As an American Cancer Society Cancer Action Network  volunteer for the past six years, Vince has worked tirelessly alongside  some of the most dedicated and passionate advocates to ensure everyone  has a fair and just opportunity to prevent, detect, treat, and survive  cancer.\n\nSpecifically, he has worked to advocate for better screening…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696703/recognizing-vince-marchetta-as-the-champion-of-the-week-for-ohios-13th-congressional-district"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…being a great  partner on this and a great leader on this issue for many years.\n\nMr. MAGAZINER. Mr. Speaker, I now recognize someone who is new to  Congress but who I know is passionate about this issue and I believe  campaigned on it, the gentleman from Pennsylvania (Mr. Bresnahan).\n\nMr. MAGAZINER.  Stansbury), a good friend and a leader on the Oversight…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691216/stock-trading-ban-for-members-of-congress"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…SMITH of Washington. Mr. Chair, I yield myself the balance of my  time.\n\nMr. Chair, there are two aspects. One is a budget debate, and it is  fascinating. We are having this passionate debate about $115 million,  and we didn't, apparently, have that debate when we passed the budget  resolution that the sponsor of this amendment voted for that added $4…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695253/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…eldest  member and nearly its only grandmother.\n\nShe put what she learned at Point Park to work for the benefit of her  community, Quaker Valley, and beyond.\n\nMrs. Cole was passionate about the history of her family and the  community in her hometowns.\n\nFor 20 years, she conducted countless hours of historic research,  including interviewing more than…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697614/mary-elizabeth-bettie-cole-post-office-building"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…Conservancy and a former Assistant Attorney General, she  has shaped major policies on environmental justice, clean air, coastal  resilience, and community revitalization. A passionate volunteer and  advocate, Gray has received accolades like the Greater Richmond Bar  Foundation's Volunteer of the Year and the Sierra Club's Green Giant  Award. Through her…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690568/virginias-fourth-district-women-in-excellence-awards"}, {"senator": "Rob Wittman", "party": "Republican", "sentence": "…Virginia.\n\nIn his 25 years of service, Joe has proven to be an indispensable  member of my team. His pride for the 1st District extends into  everything he does. Not only is Joe passionate about his work, his  commitment to bettering  the lives of Virginians and Americans alike is unparalleled. Joe is  unwavering in his effort to go above and beyond to serve…", "date": "2026-02-20", "source_url": "https://justfacts.votesmart.org/public-statement/1700090/recognizing-joe-schumachers-25-years-of-dedicated-public-service"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…are presented with  this award, which is the highest level of FFA achievement. The  selection of Alexis for this award is a reflection of her exceptional  dedication and passionate engagement in agriculture.\n\nA 2023 graduate of Mifflin County High School, Alexis is a junior at  Penn State majoring in animal science with a minor in livestock  production.…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698173/lowering-healthcare-costs-for-all-americans"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…Consulting, in which he focuses on enhancing our operational  capabilities to defend against cyber and unmanned threats. In addition  to protecting our national security, Mark is passionate about giving  back to his community and supporting our veterans. He is the Commander  of the Rockwall Terry Fisher American Legion Post, where he created  college scholarships…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696968/recognizing-congressional-patriot-award-recipient-mark-kipphut"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…the Western Placer Unified School District, Mr. Chris  Wardlaw, who has dedicated 25 years of his career to educating the  students of his community.\n\nMr. Wardlaw became passionate about teaching when he had the  opportunity to be a teaching assistant in graduate school when he was  studying to become a research biologist. In that capacity, university…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…does this not scare the crap out of people? Why do we not have  people coming behind these microphones? But we are better off getting  behind these microphones and telling passionate stories, anecdotes, and  those things, because that is what gets us on social media. That is  what gets people's dopamine hitting. But at some point the math is  going to…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690586/economic-anxiety"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…proud to support this bipartisan legislation, and I  urge my colleagues to support its final passage.\n\nMr. Speaker, I thank the gentlewoman from Kansas (Ms. Davids) for her  passionate work on behalf of America's number one industry,  agriculture, and on this specific piece of legislation.\n\nI thank my good friend from Georgia (Mr. Austin Scott) for his…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695054/united-states-grain-standards-reauthorization-act-of-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…However, he stayed busy in the  last several years supporting political campaigns, keeping an eye on  local politics, and working to improve his adopted country.\n\nHe was very passionate about the candidates he supported and has  traveled with friends to support those candidates wherever he could. He  continued to pursue his passions right up until he passed…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697101/highlighting-the-state-of-california"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…again in 2024. Additionally, Anthony served as an AFSCME delegate  and vice president of the New York State AFL-CIO.\n\nAnthony embodied the very spirit of union leadership: passionate,  hardworking, and unwavering in his commitment to others. His legacy  will live on through the countless lives he touched and the workers he  proudly fought for. He was…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698769/recognizing-jim-monaghan"}, {"senator": "Hal Rogers", "party": "Republican", "sentence": "…preserving  Rowena's story and bringing it back to life through photographs and a  timeline, now displayed along the walls of the new marina.\n\nYou could not find anyone more passionate about lake life than Tony  Sloan. He enjoyed inviting families and friends to the dock for a good  fish fry and ice cream, while watching folks water ski and jump waves…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689657/tribute-in-memory-of-tony-sloan"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…distressed communities or  both.\n\nWe are investing in education and creating new tax credits for  individuals who contribute to scholarship organizations. I am also very  passionate about teaching the next generation about the power and value  of compounding interest and capitalism and how it can help them get  ahead.\n\nThe money accounts for growth and…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691166/events-this-week"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…musical talent,  often playing intricate pieces by ear on multiple instruments.\n\nDick was an Eagle Scout, God and Country, and Order of the Arrow in  Boy Scouts.\n\nHe was passionate about educating students about the Federal  Government, playing an instrumental role in implementing the  Presidential Classroom, a program teaching high school students…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691783/recognition-of-richard-dick-wallace"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…aspects of VCI's mission.\n\nAs we pause to remember Tina, we also keep her husband, David, and  her entire family in our prayers. We also express a nation's gratitude  for her passionate commitment that advocates like Tina Pelesky and Tom  Caulfield make each and every day for all of those who served this  great country.", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698913/significant-strides-to-strengthen-united-states-warfighters"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…with us tonight. He brought this  idea forward, and I thank Matt very, very much for a great idea and for  helping us see it through.\n\nMr. Speaker, Matt is a veteran and a passionate advocate for those  who serve. He saw firsthand the need to give proper recognition to the  families of fallen first responders, especially those who had once  served our…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691021/calling-upon-local-communities-to-support-organizations-that-provide-resources-and-aid-gold-shield-families-in-their-time-of-need"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…Thanks to Lauren, Brunton International is now, once again, an  American-owned company. It is a beacon of resilience and prominence, in  no small part due to the company's passionate leaders, who are willing  to take on new opportunities with enthusiasm and trudge through  challenges with tenacity.\n\nWyoming businessmen and -women are a special kind of…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690788/big-beautiful-bill"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…and the  value of working for your food. In addition to leading students, Bob  recruits and manages his Garden Crew; a handful of additional dedicated  volunteers that are passionate about the art of gardening and promoting  fresh and healthy eating. Where Bob primarily works with 4th grade  students, all students in the school benefit from his efforts.…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691924/recognizing-robert-obrien"}]