[{"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…have a way to fix it. So I urge my Republican colleagues to join  us to stop Americans' healthcare premiums from skyrocketing, and simply  bring to the Senate floor and pass the bipartisan House-passed bill to  extend the healthcare tax credits that Americans rely on, and, of  course, to vote for S.J. Res. 84, which is in front of us today. And we  thank…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698975/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…DeLAURO. Madam Speaker, I yield an additional 1 minute to the  gentleman from Hawaii.\n\nMr. Speaker, I just would outline for a moment the impacts of the  failure to pass the five bipartisan, House-passed spending measures and  what that would do.\n\nFor military personnel, an extended shutdown will harm both military  and civilian personnel at DOD who could…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699573/consolidated-appropriations-act-2026"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…something that has never happened before.\n\nA 1-year extension does not mean that the work ends. We will continue  to be at the table, ready to negotiate and ultimately pass a  bipartisan, bicameral comprehensive reauthorization.\n\nMr. Speaker, I urge my colleagues to vote ``yes,'' and I reserve the  balance of my time.\n\nMr. Speaker, I would like to close…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695450/extension-of-sbir-and-sttr-authority"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…invaluable feedback to my work on agriculture policy as I've  fought to ensure family farmers have a strong farm safety net. I look  forward to our continued collaboration to pass a bipartisan farm bill.\n\nI congratulate Linda on her graduation and thank her for her service  to our community.", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690447/congratulating-linda-larson-on-her-graduation-from-inver-hills-community-college"}, {"senator": "Jacky Rosen", "party": "Democrat", "sentence": "…politics, without taking away  healthcare and food assistance from families who need it the most.  Let's pass it by itself.\n\nThat is why I am calling on the Senate to pass the bipartisan No Tax  on Tips Act right here, right now, as a stand-alone bill. We are going  to cut taxes for real hard-working Americans, for Nevadans, for  everyone, not just for…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691423/no-tax-on-tips-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…China  are hidden ticking time bombs waiting to detonate in American homes and  neighborhoods. The danger has become too great to ignore.\n\nToday, the House is poised to pass bipartisan legislation that will  finally empower the Consumer Product Safety Commission to establish  mandatory safety standards for the manufacture of lithium-ion batteries  in…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690260/setting-consumer-standards-for-lithium-ion-batteries-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…release the damn Epstein files. The  victims of Jeffrey Epstein and Ghislaine Maxwell's horrific crimes were  outside the Capitol Building this morning to demand that we pass the  bipartisan Khanna-Massie bill to release these files.\n\nMr. Speaker, we have a bill to do it. Stop delaying, stop  obstructing, stop protecting the powerful perpetrators of these…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694886/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…program and others that are included in  this bill actually reach the communities that desperately need the  assistance. That is why I urge my colleagues to not only pass this  bipartisan legislation but also to continue to advocate for its  implementation.\n\nJust a few weeks ago, I visited a federally qualified health center  in my district. It is called…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691943/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Sara Jacobs", "party": "Democrat", "sentence": "…body should not sit idly by while the President makes a mockery  of our Constitution and our laws. We--only we--have the power to  declare war. I urge my colleagues to pass our bipartisan amendment and  repeal these outdated AUMFs.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695241/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…a discussion about inconveniencing House Members because they  have to get on a plane and come back if we act to do something that  every American knows we should do: Pass the bipartisan bills where we  have five bills done, and take on the burden of responsibility that we  have as a U.S. Senate to put reforms in an Agency that needs reform.\n\nFolks in…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699407/9999"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…university systems in this country. This rule gives  us a vote on kicking them the rest of the way out of this country. I  think, Mr. Speaker, that that is going to pass in a very bipartisan  manner.\n\nWith all of the antics, yelling, screaming, and pointing of fingers,  I just remind you, there is a very serious piece of legislation to deal  with the…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690745/providing-for-consideration-of-hr-gulf-of-america-act-and-providing-for-consideration-of-hr-dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…already done on a temporary basis. I  support classwide scheduling for fentanyl analogues, but here we have  this bill, the HALT bill, that my colleague pointed out did pass in a  bipartisan way and now is in the Judiciary Committee.\n\nThe reason I am down here is not to drag my dear friend down here  because he is a busy man, and I wanted to go over to…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687971/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…since coming to Congress, particularly in the 119th.\n\nWe stand here today, 22 days before government funding expires. We  stand here, House and Senate Democrats, ready to pass a bipartisan  funding bill that will improve the health of Americans, that will  improve access to quality, affordable healthcare, that will improve the  safety and economic well-being…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695041/better-is-possible"}, {"senator": "Scott Peters", "party": "Democrat", "sentence": "…apparent that the viability of  exporting U.S. liquefied natural gas depends on American policies to  address methane pollution.\n\nIf we don't do this, we are going to have to pass bipartisan  legislation to do the same thing to ensure that the industry standards  provide for the cleanest, most efficient natural gas production.\n\nIndustry and ratepayers have…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688174/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…people in jail and throw away the key.\n\nMr. Speaker, I think House Republicans know that we can't simply  schedule our way out of this crisis, but they have refused to pass  bipartisan solutions that address prevention, treatment, and recovery  to help stop overdose deaths.\n\nI know that they passed reauthorizing the SUPPORT for Patients and  Communities…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692341/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "…House that we should take up  No Tax on Tips in the House and pass it. And I said: Look, if the House  passes it, I think there is a very real chance the Senate will pass it.  It is bipartisan legislation.\n\nAnd what we just saw is the Senate passing No Tax on Tips 100 to 0.  Every Democrat voted yes. Every Republican voted yes. And, by the way,  the backstory--just…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691422/no-tax-on-tips-act"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…administration proved what Washington refused to admit for  years: that border security works when the law is enforced. President  Biden used to say that Congress needed to pass bipartisan legislation.  No, actually, as it turns out, Mr. Speaker, all we needed was a  President with a backbone to secure our border; and that President is  Donald Trump.\n\nAt…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699277/highlighting-republican-successes-in-2025"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…them, believe me, he can sustain any veto he cares to  cast. He has used his influence and his power constructively to bring  us together across partisan lines and to pass what are bipartisan,  bicameral bills. I am eternally grateful for that.\n\nMr. Speaker, I thank my own leadership. I don't know where Speaker  Johnson got his patience from, but it must…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699575/consolidated-appropriations-act-2026"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…most vulnerable among us have become even more vulnerable.  None of these accusations are true.\n\nOf course, again, our Democratic colleagues could have worked with us  to pass a bipartisan piece of legislation but chose not to do so. They  have no positive policy proposals or vision for what America should be  doing. At a time when we are confronting a…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693491/one-big-beautiful-bill-act"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…to  choose winners and losers. They tried to do it, but here in the House,  we are going to follow the Senate's bipartisan passing of the CRA.\n\nToday, it is going to pass in a bipartisan fashion in the House and  very soon the President of the United States will sign this into law.  It will change one of the many disasters of the prior administration,…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688634/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…criticism right now is more well deserved than ever.\n\nWe have in the past seen measures come to the floor that divided the  Republican Conference but that were able to pass with bipartisan  support on continuing resolutions or on foreign aid bills. There is no  reason that cannot be done here, and let the House work its will. That,  after all, is the best…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698374/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…very close to Steve. Even  though our political allegiances are about as far apart as they can  get, he is still my good friend.\n\nMr. Speaker, I urge my colleagues to pass this bipartisan bill and  restore public trust in TVA.", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692212/tennessee-valley-authority-transparency-act-of-2025"}]