[{"senator": "Becca Balint", "party": "Democrat", "sentence": "…I rise in strong opposition to the  Republican budget.\n\nLet's lay out where we are. Republicans control the House, the  Senate, and the White House, and they could be passing legislation  right now to actually lower costs for families on groceries,  prescription drugs, and housing.\n\nInstead, they are attacking the very programs that working people and…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689916/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…National Coal Council is so important that  it demands floor time in the House of Representatives, even though the  President has already reestablished it. We could be passing legislation  to lower energy costs or avoid a spike in health insurance premiums  instead.\n\nIf Republicans believed that the National Coal Council is such a  priority, then surely…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695765/national-coal-council-reestablishment-act"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…our Nation's small businesses. The lack of  courage to stand up for our Nation's small businesses, and to stand by  and watch their downfall, is shameful. We should be passing legislation  to end this tariff war and save our small businesses.", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692067/capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…chairwoman, ensuring that corporate loopholes were closed while still  protecting small businesses. Representative Bird has been a champion  for affordable housing, passing legislation to lower the cost of  housing and offer more Coloradans the ability to own a home.\n\nThough Representative Bird and I held different positions during my  time in the…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698814/recognizing-colorado-state-representative-shannon-bird"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…because our Nation judged them by the color of their  skin and not the content of their character. However, we can do our  best to make it right, and that begins with us passing my legislation  that I co-led with Congressman Seth Moulton, the Sgt. Isaac Woodard,  Jr. and Sgt. Joseph H. Maddox GI Bill Restoration Act.\n\nWe didn't stop with World War II. Just…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699863/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…caregivers  face. We have worked together over many years to advance legislation to  support the essential role that caregivers play in our communities. We  were successful in passing legislation that establishes a national  strategy to support family caregivers, the RAISE Family Caregivers Act,  and we are committed to reauthorizing the Lifespan Respite Care…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688456/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…will fail.\n\nThe real way to make drug price reform happen is to do what Democrats  do and what Donald Trump is loath to do: Roll up your sleeves and do  the hard work of passing legislation. That is what we did. That is why  insulin is $35 for senior citizens. That is why 20 of the most widely  used drugs' prices have plummeted, because we negotiated with…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690954/prescription-drugs"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…assets because of the risks associated with       them, the bills provide the facade of regulation that may       make these assets more mainstream in portfolios. Passing this       legislation will allow the proliferation of assets that       investors will wrongly perceive as safe.\n\nBut the problem with these bills is more significant than       they…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693839/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "…will also take a moment to recognize the late Congressman Connolly,  who worked tirelessly on this legislation and who had introduced the  SAMOSA Act prior to his passing.\n\nThis is legislation that will improve the acquisition process for  Federal agencies, help the government better manage software needs, and  ultimately save taxpayer dollars.\n\nAgencies…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698152/strengthening-agency-management-and-oversight-of-software-assets-act"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…nothing uncommon or unreasonable about  expecting a fair shot, swift resolution, and procedures that reflect  modern realities. That is exactly what H.R. 5349 delivers.\n\nPassing this legislation is a statement that we believe in a tax  system where accountability, transparency, and due process matter, not  just for the wealthy or well-connected, but for all…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697271/tax-court-improvement-act"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…the floor today. I  thank him for his determined leadership on this issue and hope that we  can get all of our colleagues on board later today with a strong vote  in passing this legislation over to the Senate and seeing it signed  into law.\n\nMr. Speaker, this is the right thing to do by our veterans and by our  Medal of Honor recipients, and I urge all…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688214/medal-of-honor-act"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "Mr. HIMES. Mr. Speaker, in this Chamber, as early as today, we may be  passing legislation that is explicitly designed to maintain  historically low tax rates on the Nation's wealthiest people.\n\nThe richest people in America will be served by this institution…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689793/defending-medicaid-for-families-like-the-currans"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…Congress, this bill passed the House and the Senate's Homeland  Security and Governmental Affairs Committee, and I hope it will be  signed into law this Congress.\n\nPassing this legislation is a proactive step toward safeguarding our  citizens from the unimaginable. By enhancing our detection and response  capabilities, we deter adversaries from contemplating…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688698/securing-the-cities-improvement-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…consideration of S. 1837 and the Senate proceed to its  immediate consideration.\n\nMr. DURBIN. Mr. President, it feels good. It feels good to see the  Senate actually passing legislation. It is rare. It doesn't happen a  lot. With a measure of this importance, it is critically important that  we come together, both political parties.\n\nI want to thank…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698999/disrupt-explicit-forged-images-and-non-consensual-edits-act-of-2025"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…corporations are able to spend unlimited  amounts to influence the results of our elections, our elected  officials are, in turn, unfortunately, more likely to respond by  passing legislation that benefits corporations and the richest  Americans while making life more expensive for middle-class Americans.  If you are surprised about affordability, Mr. President,…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699234/restoring-election-integrity"}, {"senator": "Troy Balderson", "party": "Republican", "sentence": "…Emma; his sons-in-law; and  his grandchildren.\n\nMichael's untimely death underscores the importance of ensuring the  safety of household products like awnings, and by passing this  legislation today, we can prevent further tragedies.", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692746/awning-safety-act-of-2025"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…and more secure.\n\nI thank the President and his administration for doing that. I think  we should rally around them and show our support for what they have  done by passing this legislation.\n\nMr. Speaker, I urge my colleagues to support this bill, and I yield  back the balance of my time.", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699354/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…4758 builds on the important work of the Working  Families Tax Cut law by officially putting an end to these egregious  authorities so future abuses cannot occur.\n\nBy passing this legislation, House Republicans are continuing to  address the affordability for hardworking American households and  responsibly protecting finite taxpayer resources.\n\nMr. Speaker,…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700222/homeowner-energy-freedom-act"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…of our Nation's servicemen and -women.\n\nI was glad the Committee on Transportation and Infrastructure  favorably reported this measure and look forward to the House passing  this legislation.\n\nH.R. 3055 is one small step that we can take to ensure we provide our  servicemembers with the resources they need as they transition back to  the civilian workforce,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695018/transitioning-retiring-and-new-service-members-to-port-ocean-rail-and-truck-jobs-act"}, {"senator": "Mark Messmer", "party": "Republican", "sentence": "…Empowering Employer Child and Elder Care Solutions Act lowers  costs, cuts red tape, and better serves American companies by making  profamily benefits achievable. Passing this legislation contributes to  our goal of returning affordability to the American people and the U.S.  workforce.\n\nThe American taxpayer needs our help now more than ever to get…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699003/empowering-employer-child-and-elder-care-solutions-act"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…is certainly something that we don't want to see in our Nation's  Capital, in Washington, D.C., which is exactly the type of thing that  we are trying to prevent by passing this legislation.\n\nMr. Speaker, one of the things that my colleague mentioned was the  people who are food insecure. I note something that we should be  ashamed of is the inflationary…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692263/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…will ensure  that DHS is utilizing all available resources and tools to do just  that.\n\nIn the 118th Congress, I was proud to have the support of my  colleagues in passing this legislation in the House. I urge my  colleagues to join me once again in supporting this commonsense bill to  ensure the security of our communities against biological threats.", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688731/dhs-biodetection-improvement-act"}, {"senator": "Vince Fong", "party": "Republican", "sentence": "…firefighters.\n\nThere are not enough thanks to give to our selfless firefighters and  first responders in times of natural disaster. We should help them  fight these fires by passing legislation to give them additional tools.\n\nThe aerospace industry does so much for our country, from assisting  in national defense to helping in natural disasters to improving…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687922/space-dominance"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…transmissibility. I could not  think of a more jarring threat to public health in the United States.\n\nMr. Speaker, the U.S. Congress needs to act with urgency in  considering and passing this legislation that we have introduced. After  the first lab was discovered, I said that we don't know how many others  are out there. That concern was echoed by a report by the…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700217/prices-in-california-are-too-high"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…acknowledged that abortion is a serious and  difficult decision and supported efforts to ensure women were not  forced into it by a lack of resources or support. They joined in  passing legislation to help women who choose to continue their  pregnancies. Yet, today, some of those efforts are being undermined  unless amendments that explicitly promote abortion are…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699316/pregnant-students-rights-act"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…individual appropriations bill, and this  is what we have to do to be able to pass the Trump agenda with respect  to renewing the Trump tax cuts, with respect to creating and passing  legislation to prohibit tax on tips and tax on overtime, and all the  new blue-collar, working-class tax cuts that President Trump campaigned  on and received a mandate to do.…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688348/draining-the-swamp-in-order-to-put-america-first"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…and will make those decisions public to  ensure transparency.\n\nIt is important to note that SBA services to small businesses  nationwide will not be interrupted by passing this legislation.\n\nWhen a small business in any jurisdiction needs assistance, they can  still go to their local small business development center or their  community lender.\n\nThe…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692097/save-sba-from-sanctuary-cities-act-of-2025"}]