[{"senator": "Veronica Escobar", "party": "Democrat", "sentence": "The bill that passed out of committee had  protections for U.S.", "title": "Department of Homeland Security Appropriations Act, 2026", "date": "2026-01-22"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "While it passed  the House on a strong bipartisan vote, I was disappointed that the bill  did not become law.", "title": "Recruiting Families Using Data Act of 2025", "date": "2025-03-04"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "In order to pay for that, they passed a  honking series of cuts to all the services that you need to help you  survive and thrive.", "title": "Better is Possible", "date": null}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "When the Congress  passed the Energy Policy and Conservation Act, we said to the  Department of Energy: Work with manufacturers and advocates and do  everything you can to help with innovation to help consumers save more  money.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the Department of Energy Relating to ``Energy Conservation Program for Appliance Standards: Certification Requirements, Labeling Requirements, and Enforcement Provisions for Certain Consumer Products and Commercial Equipment''", "date": "2025-03-05"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "passed that called for nuclear  disarmament.", "title": "Introduction the Nuclear Weapons Abolition and Conversion Act of 2025", "date": "2025-03-05"}, {"senator": "Laura Gillen", "party": "Democrat", "sentence": "Speaker, I rise today to address the cruel rescission  package that passed the House strictly on partisan lines.", "title": "Rescission Package", "date": "2025-06-12"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "That extension passed the House just hours ago,  but the fight isn't over to secure these benefits and meaningfully  lower costs for Americans.", "title": "Protecting Healthcare for Millions of Americans", "date": "2026-01-08"}, {"senator": "Marilyn Strickland", "party": "Democrat", "sentence": "Ernest Charles Tanner passed away in 1956 at the age of 66.", "title": "Ill-Conceived Budget Resolution", "date": "2025-02-25"}, {"senator": "Darren Soto", "party": "Democrat", "sentence": "In June 2020, it passed the  House but did not pass the Senate.", "title": "Moment of Silence in Memory of Pulse Nightclub Victims", "date": "2025-06-12"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "That study was wrapped into a larger FEMA reform package, and it  passed our committee on a huge bipartisan  margin.", "title": "Extreme Heat Caucus", "date": null}, {"senator": "Greg Landsman", "party": "Democrat", "sentence": "Just weeks after this bill passed, two Planned Parenthood clinics in  southwest Ohio are closing.", "title": "Planned Parenthood", "date": "2025-07-22"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "The  budget passed last night only gives billionaires tax cuts and funds  indiscriminate raids in our city, all paid for by working-class  families.", "title": "Republican Budget Betrayal", "date": "2025-02-26"}, {"senator": "Darren Soto", "party": "Democrat", "sentence": "Significant  legislation that she initiated and passed included bills to exonerate  the Groveland Four, provide compensation to James Joseph Richardson,  who was wrongfully incarcerated for 22 years, outlaw discrimination  against pregnant women in the workplace, and a Specialty License Plate  to benefit organizations that comprise the Divine Nine with 85 percent  of the proceeds from the sale of the plate benefitting the  organizations to support scholarships.", "title": "Recognizing Geraldine F. Thompson's Service to the Great State of Florida", "date": "2025-04-03"}, {"senator": "Joshua Gottheimer", "party": "Democrat", "sentence": "The bill has already passed the Senate in a strong bipartisan way.", "title": "Guiding and Establishing National Innovation for U.S. Stablecoins Act", "date": "2025-07-17"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "We almost passed a resolution to remove a  Member from committees for the sin of exercising free speech.", "title": "First Amendment is Keystone of Our Liberties", "date": null}, {"senator": "Ron Johnson", "party": "Republican", "sentence": "I further ask  that the Johnson substitute amendment at the desk be considered and  agreed to; that the bill, as amended, be considered read a third time  and passed; and that the motion to reconsider be considered made and  laid upon the table.", "title": "-9999", "date": "2025-11-07"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "Here is the truth: There are no programmatic cuts or assumptions in  the House-passed budget resolution.", "title": "Providing for Consideration of Senate Amendment to H. Con. Res. Concurrent Resolution on the Budget for Fiscal Year 2025", "date": "2025-04-09"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "Speaker, I am proud of the forestry title that passed out of the  Agriculture Committee last year which was crafted to expand those tools  and authorities and encourage the Forest Service to do more productive  management.", "title": "Recognition of May As Wildfire Awareness Month", "date": "2025-05-20"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "Senator McCormick, you wouldn't necessarily know this, but we passed  the first voter ID when I was speaker.", "title": "-9999", "date": "2026-02-12"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "This bill, of course, makes technical changes to Representative  Watson Coleman's bipartisan House-passed bill, H.R.", "title": "Semiquincentennial Congressional Time Capsule Act", "date": "2026-02-09"}, {"senator": "David Kustoff", "party": "Republican", "sentence": "Sometimes they report  being passed from representative to representative and from department  to department.", "title": "Improving Social Security's Service to Victims of Identity Theft Act", "date": "2025-12-01"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "1919) to amend the       Federal Reserve Act to prohibit the Federal reserve banks       from offering certain products or services directly to an       individual, to prohibit the use of central bank digital       currency for monetary policy, and for other purposes, as       passed by the House, as new matter at the end of H.R.", "title": "Providing for Consideration of H.R. DC Criminal Reforms to Immediately Make Everyone Safe Act; Providing for Consideration of H.R. District of Columbia Policing Protection Act; Providing for Consideration of H.R. Lowering Age At Which A Minor May Be Tried As Adult for Certain Criminal Offenses in District of Columbia; Providing for Consideration of H.R. District of Columbia Judicial Nominations Reform Act; Providing for Consideration of H.R. Guaranteeing Reliability Through the Interconnection of Dispatchable Power Act; Providing for Consideration of H.R. National Coal Council Reestablishment Act; Providing for Consideration of H.R. Promoting Cross-Border Energy Infrastructure Act; and for Other Purposes", "date": null}, {"senator": "Michael Guest", "party": "Republican", "sentence": "Bailey passed away  in 2015, and Mrs.", "title": "Recognizing the Decatur Telephone Company", "date": "2025-11-12"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "When that was first passed in the early 1970s, it was $10,000.", "title": "Central Bank Digital Currency", "date": "2025-06-26"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "Our aviation system is fragile,  and over the last year, Congress has passed significant legislation  investing in that airspace to increase the safety and to make sure that  all who fly can be and are safe and feel safe.", "title": "Rotorcraft Operations Transparency and Oversight Reform Act", "date": "2025-12-17"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "Congress passed the largest tax cut in American history,  delivering relief directly to families and workers.", "title": "Highlighting Republican Successes in 2025", "date": "2026-01-21"}, {"senator": "French Hill", "party": "Republican", "sentence": "It passed out of my committee, the Financial Services Committee, by a  vote of 53-1.", "title": "Greater Sanction Pressure on Russia", "date": null}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "Just a few short weeks ago, we passed the One Big Beautiful  Bill Act.", "title": "Providing for Consideration of H.R. Rescissions Act of 2025", "date": "2025-06-11"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "In fact, in Iowa, every single time we  have passed election integrity laws, the percentage of people voting  has increased.", "title": "Supporting American Elections", "date": "2025-04-01"}, {"senator": "James Risch", "party": "Republican", "sentence": "Many of those sanctions were created by the laws passed by  Senators voting here today, and the War Powers Act has no binding  authority to constrain the President's Commander in Chief powers before  U.S.", "title": "Commerce, Justice, Science; Energy and Water Development; and Interior and Environment Appropriations Act, 2026", "date": "2026-01-14"}]