[{"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…for Lithium-Ion       Batteries Act, HR 973--a badly needed step in solving the       problem of lithium-ion battery fires. Lives and property are       at stake, and we urge passage of this legislation when it is       before you on the floor.\n\nLithium-ion batteries present a major challenge due to       their range of sizes, construction, frequently…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690260/setting-consumer-standards-for-lithium-ion-batteries-act"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "Mrs. SYKES. Mr. Speaker, I rise today to recognize the Akron Rites of  Passage as the Ohio's 13th Congressional District Champions of the  Week.\n\nLed by 13 elders in the community, AROPI, as it is also known, is an  African-centered organization established…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699619/recognizing-akron-rites-of-passage-institute"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…of a tenant advocacy clinic, Eric uses  litigation advocacy to advance housing equity in Illinois and beyond.  His work with the Illinois Fair Housing Coalition led to the passage of  a State law prohibiting discrimination against housing choice voucher  holders.\n\nEric co-led the Partnership of Just Housing, a national coalition  that improved housing…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699030/recognizing-eric-sirota"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…floor and missed Roll  Call Nos. 75 and 76. Had I been present, I would have voted YEA  on Roll Call No. 75, the motion to recommit H.R. 4626 and NAY on Roll  Call No. 76, passage of H.R. 4626.                             personal explanation", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700143/dont-mess-with-my-home-appliances-act"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…domestically and globally,  there is no reason why the Department cannot and should not set an  example that is meaningful.\n\nMr. Speaker, I encourage my colleagues to support passage of H.R.  2035, the American Cargo for American Ships Act, and I yield back the  balance of my time.", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692188/american-cargo-for-american-ships-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…dangerously reliant on other countries to manufacture these  chips, which are vital to both our national economic and security  interests.\n\nThat is why I was proud to help lead the passage of the CHIPS and  Science Act, a transformational law passed in 2022 that strengthens our  manufacturing base and helps create good-paying jobs for American  workers, unleashes…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690161/securing-semiconductor-supply-chains-act-of-2025"}, {"senator": "Jan Schakowsky", "party": "Democrat", "sentence": "…society--the right to transportation, health services, shopping,  entertainment, education, employment, public accommodations, and  voting.\n\nThose who fought so hard to win its passage--including my friend and  mentor Marca Bristo, the founder and head of Access Living--deserve to  celebrate its enactment and deserve our thanks. But as we celebrate  today,…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694026/recognizing-the-22nd-annual-disability-pride-parade"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…decisions we can.\n\nWhile we have heard arguments that this could be added to the NDAA,  the timeline simply does not make sense. The programs will expire long  before final passage of the NDAA, and doing so will result in a lapse  in the program, something that has never happened before.\n\nA 1-year extension does not mean that the work ends. We will continue…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695450/extension-of-sbir-and-sttr-authority"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…potentially devastating       impacts of President Donald J. Trump's One Big Beautiful Bill       Act on access to care for millions of Americans.\n\nNearly two months after the law's passage, hospital       executives here say there are critical details still unknown       that make it difficult to determine exactly how it will       impact providers and patients.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694776/congress-long-to-do-list"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…in the year 2020 to 24 million this year, including my waitress  friend at Lou Mitchell's.\n\nIn Florida, the number of residents with healthcare coverage has  doubled since passage of the Affordable Care Act. In Alabama, tens of  thousands of children and older Americans have obtained health  insurance for the very first time because of the Affordable…", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697576/department-of-defense"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…fishing fleets that are stealing American  fishing jobs. The issues in the Arctic are real, and we have  highlighted them many times, and this bill will help address that.\n\nPassage of this measure now will enable us to further provide the  Coast Guard additional assets like icebreakers, hopefully in the  upcoming reconciliation bill, and the Coast Guard…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688520/coast-guard-authorization-act-of-2025"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…by decades of efforts to break down lingering racial barriers.  Those efforts continue to this day.\n\nAnd our struggle to enfranchise and empower women did not end with  the  passage of the 19th Amendment. It continues to this day, as we strive  to give our daughters the same opportunities as our sons.\n\nThe confirmation of Justice Ketanji Brown Jackson…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689666/justice-ketanji-brown-jackson"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…President, last week, this body advanced a War Powers  Resolution to rein in President Trump's unauthorized military actions  in Venezuela. This week, we will vote on final passage. I urge my  colleagues to support it.\n\nIt is important to recall how we arrived here. What happened on  January 3--the military raid in Caracas, the capture of Nicolas Maduro,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699116/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…Justice. The Justice Department was founded in 1870 with the very  purpose to enforce civil rights. This includes voting rights guaranteed  by the 15th Amendment. And since the passage of the Voting Rights Act,  the Civil Rights Division has been responsible for enforcing that law.\n\nToday, the work to protect voting rights is as urgent as ever. In  2023…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690545/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…Disability Assistance and Memorial Affairs  Subcommittee.\n\nMr. TAKANO. Madam Speaker, I want to congratulate my good friend from  the State of Oregon on what will become the passage of her first bill.\n\nMadam Speaker, I have no further speakers. In closing, I ask my  colleagues to join me in passing H.R. 4446, the FAST VETS Act, and I  yield back the balance…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695411/focused-assistance-and-skills-training-for-veterans-employment-and-transition-success-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…specifically set aside by Congress for its  oil and gas potential and is estimated to hold anywhere between 4.25  and 11.8 billion barrels of recoverable oil.\n\nPrior to the passage of the Working Families Tax Cut law, which  requires four lease sales to be held over a 10-year period, Congress  had previously mandated energy leasing in the area, an action…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696830/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…the things that small  businesses do, but as people in this town have decided. That is what is  at stake here. That is why we have to take this action.\n\nMr. Speaker, I urge passage of this measure because it is one step  toward peaking that mountain of regulation, making small businesses  freer to do what they do, making life more affordable to all the…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697331/small-business-regulatory-reduction-act-of-2025"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…residents recall how  that precious water saved the town from destruction during a massive  forest fire in 1985.\n\nIn addition to structural repairs, the dam needed a new fish passage.  The Orange River is designated as Critical Habitat for Atlantic Salmon  and supports herring and other important fish species and wildlife  important to the economy and…", "date": "2025-07-08", "source_url": "https://justfacts.votesmart.org/public-statement/1693257/town-of-whiting-200th-anniversary"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…prescription drugs. Americans were promised lower costs, more choices,  and better care. More than a decade later, too many families are asking  what happened.\n\nSince its passage, the unaffordable care act has created a subsidy- fueled illusion with spiraling costs hidden by taxpayer dollars and  deficit spending.\n\nToday, many Americans have insurance…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698804/breaking-the-gridlock-act"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…``Energy  Conservation Program: Energy Conservation Standards for Walk-In Coolers\n\nand Walk-in Freezers''--Rep. Bice, R-OK, and 10 cosponsors\n\nThe Administration strongly supports passage of H.J. Res.       24, a joint resolution to disapprove the rule submitted by       the Department of Energy relating to ``Energy Conservation       Program: Energy Conservation…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689262/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…Committee on Oversight and Government       Reform or their respective designees. The previous question       shall be considered as ordered on the joint resolution to       final passage without intervening motion except one motion to       recommit (if otherwise in order).\n\nSec. 3.  Upon adoption of this resolution it shall be in       order to consider in…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699590/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…other disasters.\n\nThis bill will save family forestry in America, and I urge my  colleagues to cosponsor this bipartisan, bicameral piece of  legislation. I urge its immediate passage.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694913/americas-foresters-are-in-need-of-help"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…taxpayers  to request a replacement check through direct deposit.\n\nThis bill is a simple solution to a serious and costly problem. I  encourage all of my colleagues to support its passage, and I yield back  the balance of my time.", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689291/recovery-of-stolen-checks-act"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…House floor with a vote  of 312-108 in February. The bill has the support of many law  enforcement agencies and other entities calling for the need to pass  the bill.\n\nWith passage of this version of the bill, it will be sent to the  President's desk. I am hopeful the President will sign this bill into  law quickly so that we can continue to combat this…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692345/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…is not a smart policy. House Republicans are fighting to make  housing affordable again. They are putting families first. The first  step is this bill.\n\nMr. Speaker, I urge passage of the rule. I urge passage of this act.  Let's make homes affordable in America again and save the American  Dream.", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698635/providing-for-consideration-of-hr-saving-homeowners-from-overregulation-with-exceptional-rinsing-act-providing-for-consideration-of-hr-affordable-housing-over-mandating-efficiency-standards-act-and-providing-for-consideration-of-hr-commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…committee, as well. I have  never worked this hard in my life, but I have never been more proud of  what I am able to do in this body and on this committee.\n\nMr. Speaker, I urge passage of this bill.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698747/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…have to worry about getting paid until September 30 of next year.\n\nObviously, military construction and, more importantly, veterans rely  on benefit commitments we have made. Passage of this bill makes sure  that we fulfill those commitments between now and September 30 of next  year, and we buy the time to sit down to rationally and responsibly  negotiate…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696725/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…Parents need certainty that their guaranteed deduction of $30,000  won't be cut in half and that their child tax credit won't be slashed  from $2,000 to $1,000.\n\nFollowing passage of the Trump tax cuts, wages increased by 4.9  percent, the fastest 2-year growth in real wages in 20 years. Mr.  Chair, 5 million new jobs were created. More than 6 million…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688028/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…of order       against provisions in the bill are waived. The previous       question shall be considered as ordered on the bill and on       any amendment thereto to final passage without intervening       motion except: (1) one hour of debate equally divided and       controlled by the Majority Leader and the Minority Leader or       their respective…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692391/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…contribute to.\n\nThese bills ensure that we remain a leader in the digital asset  ecosystem and will strengthen the U.S. dollar as a global currency.\n\nMr. Speaker, I urge the passage of this rule and all of these bills.\n\nFinally, to our friends on the other side of the aisle regarding the  amendment that was offered in our Rules Committee last night that…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693549/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}]