[{"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…areas: health awareness, educational services, humanitarian  relief, environmental protection and preservation, and community  empowerment. Events and walks like the one this past week happen all  over the country and make a huge difference.\n\nMr. Speaker, I congratulate BAPS Charities on a great event and all  of its great work.", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691837/congratulating-baps-charities-and-baps-temple-walkathons"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…that every voice is  heard, even when they are overseas.\n\nPresident Trump has stated that he wants to ``lead a movement'' to  get rid of mail-in voting, and he posted this past week on social  media: ``No mail-in or `Early' Voting.'' He has assigned lawyers to  craft another Executive order to stop it.\n\nThe irony is not lost on anyone that President…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696440/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…raising tariffs on Canada to 35 percent as of August 1, with a threat  of more, we are back on the floor today, and we will be back on the  floor until this passes.\n\nJust this past week, the President announced, as I noted, yet another  10 percent tariff hike on Canada--this time in retaliation for an  Ontario ad--Ontario, one province. This would be as…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696446/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…families there. Babies and children are starving to death right now-- right now--in Gaza.\n\nI have behind me the picture of an infant girl in Gaza who starved to  death this past week. Her parents could not get the lactose-free  formula that she needed to keep her alive. That formula was on one side  of the Gaza gate; that starving child was on the other.…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691093/senate-resolution-224-calling-for-the-urgent-delivery-of-humanitarian-aid-to-address-the-needs-of-civilians-in-gaza"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…markets around the globe. Reckless and cavalier economic  policy could lead us into a Trump recession.\n\nA record of trillions of dollars in U.S. wealth was just lost this  past week due to chaotic moves on tariffs arbitrarily imposed by the  Trump administration. This week, the hole was being dug deeper as  markets continued to free-fall. There was a…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690052/trump-tariffs"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…programs serving more than 300,000 children of low-income       families. The subsidies come in the form of vouchers that       families use to pay child care providers.\n\nIn the past week, conservative activists have been posting       on social media the names and phone numbers of child care       providers, including in San Diego County, suggesting without…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699222/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…done, otherwise taxes will go up on the  American people. Apparently, the President said that today while he was  here in this building. It is completely false.\n\nJust this past week, Democrats introduced an amendment that would  ensure the extension of the tax cuts for every American making under a  billion dollars. Every Democrat voted yes. Every Republican…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691513/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…through education.\n\nThe teens said that singing helped them to create a climate where  they would have world peace and understanding.\n\nI have been thinking about that a lot this past week, especially in  the context of education. This is National Arts in Education Week. It  is a time to celebrate and recognize the importance of arts education.\n\nMaybe you wonder…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695492/national-arts-in-education-week-2025"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "Mr. CORREA. Mr. Speaker, this past week, I had the honor to visit a  number of senior centers in my district. I saw seniors having a meal at  lunchtime paid for by SNAP, seniors that have relied on Social  Security,…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690388/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…abuse and humiliation.\n\nThey sent uniformed military troops to the streets of American  cities, damaging the relationship between our citizens and our Armed  Forces.\n\nThis past week may have seen the most egregious and violent misuse of  military force yet that we know of. Last week, President Trump ordered  the extrajudicial execution by the U.S. military…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695109/providing-for-consideration-of-hr-streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-and-providing-for-consideration-of-hr-stop-illegal-entry-act-of-2025"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…kinds of consequences can be avoided I think is fundamental  to the effort today.\n\nWe know that more than 50 patient appointments were canceled at a VA  facility just this past week because they can't hire staff needed to  care for those veterans.\n\nWe know that in the first round of terminations, Secretary Collins  terminated nine Veterans Crisis Line…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688443/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…small  businesses across the country are ringing the alarm bells saying that  the tariff wars are going to put them out of business in a matter of  weeks or months.\n\nJust this past week, we heard from Minnesota's Small Business Person  of the Year, given the award by the Trump administration, who said she  has 6 weeks until she goes out of business.\n\nThese…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692067/capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…this legislation is vastly different than the last time the  bill was considered by the House just under 7 months ago.\n\nIn fact, under Secretary Kennedy's leadership in the past week, the  CDC, or Centers for Disease Control, has cut 18 percent of its  workforce. Many of these roles have been in global and environmental  health roles, which means the…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689624/vietnam-veterans-liver-fluke-cancer-study-act"}, {"senator": "Brad Finstad", "party": "Republican", "sentence": "…Member of the Minnesota delegation on both  sides of the aisle to call out this act of hatred, and we will continue  to do so together.\n\nMr. FINSTAD. Mr. Speaker, over the past week, I have been reminding  myself that hope, faith, and resilience are the enemy of evil. I remind  my fellow Minnesotans--not just the Republicans and not just the  Democrats…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692856/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…why today I introduced a bill that would implement a Somalia  immigration moratorium.\n\nMr. Speaker, we have seen the multibillion dollar Somali fraud  scandal just in the past week, and Americans are furious. The reality  is that Somali immigration makes America less prosperous, less safe,  and less culturally cohesive.\n\nMr. Speaker, 78 percent of Somali…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699749/somalia-immigration-moratorium"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…own. She speaks powerfully, still, about forgiveness  over bitterness.\n\nThey were some of those miracle babies that survived. Many of the  children around them did not.\n\nThis past week, it was really a remarkable moment that a lot of  people in this town probably missed, and I understand. There is a lot  of things going on right now. But on the south side…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690112/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…unprecedented success with young voters in this past  election.\n\nBut he didn't just reach out to conservative students. He was a  champion of free speech for everybody.\n\nOver the past week, I have enjoyed seeing many, many, many videos of  Charlie's debates with college students all over our great country.\n\nThe first thing you notice when you watch these videos…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695705/expressing-support-for-the-designation-of-october-as-the-national-day-of-remembrance-for-charlie-kirk"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…HARIDOPOLOS. Mr. Speaker, I offer good news today. I rise to  honor the extraordinary bravery of Judie Kent, a young woman and nurse  from my district in Vero Beach, Florida.\n\nThis past week, Judie's quick thinking and courageous actions saved  the life of a motorcyclist and father of five who was struck by a car  on his way to work.\n\nAs she drove past the scene,…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688226/recognizing-judie-kent"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…say that anyone who thinks that President Trump adopting Elizabeth  Warren's idea on capping credit card interest rates--it is literally  what the President said over the past week. They are not the  conservatives that I thought they were. Anybody that thinks this is a  good idea will not speak truth to this President to say: You can't do  that. If…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699082/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…in the past--but in  the very, very distant past--until just recently, when, again, we have  seen comments coming out of the administration and really stepped up in  this past week or so.\n\nIt is one thing to have a discussion. It is one thing to have a  conversation. But, instead, what we are hearing is some pretty  aggressive rhetoric from the Trump…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698821/9999"}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "…nothing  more than an oppressive tyranny.\n\nPastor Jin's daughter and her husband Bill, a native Houstonian,  wrote about the CCP's persecution in the Washington Post this past  week. In their column, they made a piercing observation, and I want to  share it here in full:\n\nThere were few more obvious ways to showcase the bankruptcy       of an ideology--and…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696588/expressing-condemnation-of-the-chinese-communist-partys-persecution-of-religious-minority-groups"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…pieces of land, hundreds of acres, they are building up Muslim-only  cities. This is purposeful.\n\nWe had Nigel Farage and others testifying in the Judiciary Committee  this past week.\n\nI asked Mr. Farage if the advance of Islam and the importation of  sharia law are consistent with Western civilization, the Western  civilization responsible for providing…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695203/people-are-sick-and-tired"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…health- related executive orders, one of which addresses the same harmful food  dyes and artificial ingredients that President Trump and the  administration banned just this past week. This was accomplished while  the House literally saved lives by securing medical protection for  babies who survived attempted abortions.\n\nFinally, the three have worked…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690592/first-100-days-are-just-the-beginning"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…is not  up for debate.\n\nPresident Trump is restoring America's leadership on the world stage  and fighting tirelessly to keep Americans safe, both at home and  abroad. This past week, President Trump showed that he is not willing  to let America be strung along or taken advantage of.\n\nAfter Iran refused to accept a deal and continued to wreak havoc in…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692936/peace-through-strength"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "Mr. STEUBE. Mr. Speaker, I thank the Chairman.\n\nMr. Speaker, I rise today in support of the Trump administration's  actions in capturing Nicolas Maduro.\n\nOver the past week, Democrats have claimed that Maduro's capture was  unconstitutional, illegal, and violated international norms. Democrats  argue that Congress must declare war or give explicit…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698883/successful-operation-to-arrest-nicolas-maduro"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…Speaker, I rise today to honor a true west Texas  giant and American hero, Mr. J.L. Stevens of Big Spring, USA, a World  War II veteran who just turned 100 years old this past week. He is a  living monument to the grit, courage, quiet humility, and service that  define both west Texas and America's Greatest Generation.\n\nIn 1943, at just 17 years old,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699730/9999"}, {"senator": "Mary Miller", "party": "Republican", "sentence": "…elections. We must  aggressively push back against the left's attempts to change the  electorate and dilute the voices of actual Americans in our democratic  process.\n\nThis past week and today, all we hear are the Democrats sharing their  concerns that rural Americans, women, and people of color are not  capable of getting an ID. This is insulting and…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1689996/safeguard-american-voter-eligibility-act"}, {"senator": "Rick Crawford", "party": "Republican", "sentence": "…fear of what is going to  happen here.''\n\nLet me tell you something. The world is a safer place because of what  Donald Trump ordered and what our military carried out this past week.  The Western Hemisphere cannot be a safe space for China, Russia, Iran,  Hamas, Hezbollah, or the other terrorists that were being given safe  haven in Venezuela.\n\nSpeaker…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698882/successful-operation-to-arrest-nicolas-maduro"}]