[{"senator": "Lucy McBath", "party": "Democrat", "sentence": "…survivors  vulnerable to even further exploitation.\n\nMany States, including my State of Georgia, have already passed laws  like the Trafficking Survivors Relief Act. It is past time that we take  similar steps to do this on the Federal level. By allowing survivors to  expunge arrests or vacate nonviolent convictions connected to their  trafficking, we…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697180/trafficking-survivors-relief-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…settler violence in the West Bank.\n\nGetting to a just and lasting peace in the region will require the  creative leadership and hard work of statesmen and stateswomen. It is  past time to break out of the brutal and circular logic of terrorism  and violence and war and instead address the underlying political  problems destabilizing the region. We must…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697236/no-immigration-benefits-for-hamas-terrorists-act-of-2025"}, {"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…clearer.\n\nMr. Speaker, 16 years after Citizens United, we need to shift the  power back to everyday Americans and away from those who can write the  biggest checks.\n\nIt is past time that we reverse course on Citizens United. It is time  to act and end Citizens United.", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699240/restoring-election-integrity"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Trump's stall tactics are allowing China to continue to collect  massive amounts of information on Americans. There are American  companies that want to buy TikTok. It is long past time for Trump to  get this done.\n\nThere is also still work to be done because network security does not  end at the water's edge. For decades, China and other adversaries have…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692700/assessment-of-trans-atlantic-submarine-fiber-optic-cable"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…example, the  U.S. gun homicide rate is 26 times that of other high-income countries.  House Republicans continue to block all legislation to address this  crisis.\n\nIt is past time that we put the safety of our children before the  profits of the gun lobby and finally pass laws to protect our  communities and young Americans from gun violence particularly…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695281/gun-violence-in-schools"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…States, whose voices are being drowned out.\n\nFifteen years later, the verdict is in: Citizens United has sold out  our democracy and all Americans across the country. It is past time to  end the era when billionaires buy access, buy silence, and buy power.\n\nCongress must act to close the coordination loopholes, rein in the  super-PACs, and restore the…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699235/restoring-election-integrity"}, {"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…them for being here.\n\nJust this morning, House Democrats released more emails showing that  Trump knew more about Epstein's abuses than he previously acknowledged.  It is past time for Congress to restore its role as a check and balance  on this administration and fight for we, the American people.\n\nWe need to fight for our immigrant communities and…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696711/welcoming-the-honorable-adelita-s-grijalva-to-the-house-of-representatives"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Republicans' 20th  opportunity to vote to prevent the health insurance costs of millions  of Americans, their constituents, my constituents, from rising  significantly.\n\nIt is past time for them to do the right thing. For the sake of  millions of Americans and their healthcare, I urge my Republican  colleagues to support this extension and to vote on the…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697303/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…content.\n\nI am proud to have collaborated with survivor advocates on this bill.  Their lived experience and leadership have shaped this legislation.  Congress needs to act. It is past time to give victims of  nonconsensual, sexually explicit deepfakes the tools they need to fight  back.\n\nI am going to make a unanimous consent request on this bipartisan  legislation.…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698999/disrupt-explicit-forged-images-and-non-consensual-edits-act-of-2025"}, {"senator": "André Carson", "party": "Democrat", "sentence": "…reconstruction, including developments on the 13th, 14th and 15th  Amendments to the Constitution.\n\nThere is a plaque and a painting of Douglass in the Press Gallery.  But it's past time for a permanent recognition of his groundbreaking  and legendary work by renaming the House Press Gallery the Frederick  Douglass Press Gallery.\n\nMr. Speaker, I urge all…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692225/designating-the-house-press-gallery-in-the-united-states-capitol-as-the-frederick-douglass-press-gallery"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…law in 2022 directing the  placement of a plaque at the Capitol.\n\nThe plaque is complete. It is done. It has been sitting somewhere in  storage in the Capitol, and it is way past time that we display this  for America to see.\n\nThis Police Week let's honor the men and women who bravely risked  everything to do their duty to protect this House and to protect…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691167/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…first place. It is immoral to  jail children. It should enrage every American that their tax dollars  are being used to do so.\n\nCongress controls the power of the purse. It is past time to reassert  that authority and end this horrific practice. We must draw a bright  red line: Taxpayer dollars cannot be used to imprison children. That is  the bare minimum.", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700028/your-tax-dollars-are-funding-this"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…Chair, overdose deaths are preventable, and we should  be using all the tools at our disposal to save American families from  the pain of losing a loved one to opioids. It is past time we treat the  opioid crisis like the public health crisis that it is.\n\nMy bipartisan RECONNECTIONS Act will do that by helping get overdose  education and prevention tools…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691877/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…veterans  are financially secure when their military service is over.\n\nMedal of Honor awardees receive a monthly pension that has not been  raised in 23 years. It is well past time to do the right thing and  increase the pension for these distinguished American warriors. This  bill ensures their extraordinary acts of bravery are not forgotten  and that…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688214/medal-of-honor-act"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…experiencing record levels of income  inequality, and the impacts of Citizens United and other handouts to  the obscenely rich and powerful are only making it worse.\n\nIt is past time that we change course and correct what has created  this inequality. Compare it to the years of another Republican  President, Dwight David Eisenhower, when we had the largest…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699234/restoring-election-integrity"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…intelligence  counterparts will be better able to deploy a unified and focused  strategy on how to appropriately dismantle and remove these threats  from our country.\n\nIt is past time that we return to a posture of strength to defend  America and our citizens. We must clearly and effectively send a  message that the  United States will no longer be a safe…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696955/tren-de-aragua-border-security-threat-assessment-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…segment.\n\nNothing in this legislation alters additional permitting requirements  of other statutes, like the National Environmental Policy Act or Clean  Water Act.\n\nIt is past time for Congress to assert its authority and establish a  modern and transparent process for cross-border energy infrastructure.\n\nMr. Speaker, I thank Representative Fedorchak…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695688/promoting-cross-border-energy-infrastructure-act"}, {"senator": "David Kustoff", "party": "Republican", "sentence": "…mail-theft-related check fraud.\n\nNow, this has been a problem in my district in west Tennessee, and we  have heard it has been a problem throughout the country. It is well  past time that we get mail theft in the United States under control.  That does start with giving Federal law enforcement officers the tools  and the resources that they need to detect,…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689290/recovery-of-stolen-checks-act"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…prices, expanding crop insurance, and  saving millions of family farms from the death tax. The relief was long  overdue. We are grateful, but the work doesn't stop there.\n\nIt is past time for Congress to pass a fiscally conservative 5-year  farm bill, including support for agricultural research and development.  We have seen the devastating impact disease…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693761/getting-animal-health-research-right-in-farm-bill"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…citizens.\n\nMr. Speaker, I am very pleased to see this bill passed out of the  Oversight and Government Reform Committee unanimously last year by a  vote of 42-0. It is long past time we get this done. Until these  vulnerability disclosure policies are adopted across the entire Federal  digital ecosystem, our Nation's data and security are at risk.\n\nMr.…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688359/federal-contractor-cybersecurity-vulnerability-reduction-act-of-2025"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…America's leading financial minds have already sounded the alarm. The  Chairman of the Federal Reserve said that Federal spending is on an  unsustainable path, and it is past time for Congress to correct it.\n\nThe CEO of JPMorgan Chase, America's largest bank, warned that the  Federal Government must reduce its deficits before lenders finally say  enough…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695544/setting-forth-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2026-and-setting-forth-the-appropriate-budgetary-levels"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…trafficking and also if we are going to bring justice for the women and  children that were abused and trafficked during these human trafficking  and sex trafficking rings.\n\nIt is past time to bring this practice to an end. With these efforts,  we can provide this administration with the tools they need in order to  bring an end to this practice.", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688161/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…better. New  Yorkers deserve better. People in Washington, D.C., deserve better, and  President Trump has already stepped in to end cashless bail here in  Washington. It is long past time for New York to follow that lead.\n\nThe rule also provides for consideration of H.R. 5140, the District  of Columbia juvenile sentencing reform act. Since the pandemic,  juvenile…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695524/providing-for-consideration-of-hr-dc-criminal-reforms-to-immediately-make-everyone-safe-act-providing-for-consideration-of-hr-district-of-columbia-policing-protection-act-providing-for-consideration-of-hr-lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia-providing-for-consideration-of-hr-district-of-columbia-judicial-nominations-reform-act-providing-for-consideration-of-hr-guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act-providing-for-consideration-of-hr-national-coal-council-reestablishment-act-providing-for-consideration-of-hr-promoting-cross-border-energy-infrastructure-act-and-for-other-purposes"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…of oil and  natural gas and also the top exporter of LNG. A whole lot of that  energy comes straight out of my district in the great State of Texas.\n\nThat is why it is long past time that we repeal the harmful,  politically motivated Biden-era restrictions that have shackled and  locked down our LNG industry. These restrictions did nothing but  threaten…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697084/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…Speaker, I am one of those who represent a lot of Federal  employees, and they have been without a check for a long time. This is  very simple. It is very simple. It is way past time to open the  government up. There are going to be a lot of excuses about could have,  should have, would have, and that we need to take this provision or  that provision…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696682/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…should study this at length and try to come up with a  cure. It is a serious affliction, as was evidenced numerous times over  in our Rules Committee meeting.\n\nIt is well past time to reopen the government and end the Democrat- concocted nightmare that Americans have been living through for over 40  straight days.\n\nThe CR before us will end that nightmare.…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696692/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…before us today is about more than just one  project. There are two options, Mr. Speaker: mineral dominance or  mineral dependence. There isn't a third option, and it is long past  time for the Federal Government to act like it.\n\nOur global allies rely on America's leadership. If we are to remain a  leader in the global economy, then domestic mineral abundance…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699275/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "…able to pass this single- subject legislation all the way through with unanimous support in this  body and in the Senate. It is something I am very, very proud of, and  it is past time that we finally fulfill the promise that the Federal  Government made to the communities I represent in Colorado. I urge my  colleagues to support this override to finish…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698700/finish-the-arkansas-valley-conduit-act-veto-message-from-the-president-of-the-united-states"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…the  Southeast have been weighed down by burdensome permits and processes  created by people too far removed from the realities of everyday,  working-class Americans.\n\nIt is past time we restore a commonsense approach to this and ensure  that our farmers can finally defend their ponds without any Federal red  tape in the way.\n\nMr. Speaker, I thank Chairman…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697639/cormorant-relief-act-of-2025"}, {"senator": "Nathaniel Moran", "party": "Republican", "sentence": "…push back on China not only in our words but  through our actions. Failing to do so enables the CCP to grow in  strength and exert its malign influence over the world. It is past time  we enforce accountability against our greatest adversary. The U.S. must  act decisively against the companies that profit from these abuses and  take a firm stand against…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690655/no-dollars-to-uyghur-forced-labor-act"}]