[{"senator": "Lou Correa", "party": "Democrat", "sentence": "Mr. CORREA. Mr. Speaker, I rise today to recognize Mr. Bharat Patel  for his incredible career and contributions to our community.\n\nIn 1976, the Patel Family acquired the original Peter Pan Motor  Lodge, located right across the street from…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688533/recognizing-mr-bharat-patel-for-his-contributions-to-our-orange-county-community"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…President and most  House Republicans have blocked the release of the Epstein files.\n\nDuring the 2024 campaign, the President and his inner circle,  particularly Pam Bondi, Kash Patel, and Dan Bongino, all repeatedly  promised that they would release the Epstein files, but once they came  into office and found the President to be frequently mentioned in…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695109/providing-for-consideration-of-hr-streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-and-providing-for-consideration-of-hr-stop-illegal-entry-act-of-2025"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…Capitol Facilities; Ray Woeller and Jim Green, who  managed the credentialing contract; and the entire PILLARS development  team of Casey Bishop, Jason Blum, Roger Masse, Atul Patel, Silvino Da  Sul, Mehmet Yuksel, Brad Nathan, Claudette Archambault, and Jason  Tongarm.\n\nOn January 20, 2025, the world witnessed the 60th inaugural  ceremonies, as they have…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691709/recognizing-the-joint-congressional-committee-on-the-inauguration"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "…letters, they have posted, and they have demanded disclosure. Donald  Trump, Jr., the President's own son, has tweeted dozens of times about  this case.\n\nFBI Director Kash Patel swore under oath in front of the Senate that  he would be transparent with the American public and release the  Epstein files. He said: ``Make sure the American public knows…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693624/release-the-epstein-files"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…Speaker, I include in the Record the following  essay from Virginia's Fourth District Black History Month Essay  Contest--1st Place middle school contest winner, Augustus Rezba-Patel.\n\nWomen are 17 percent of active-duty U.S. military members       today. They serve in combat and leadership roles and are       vital to the function of the U.S. military.…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688375/recognizing-virginias-fourth-district-black-history-month-essay-contest-1st-place-middle-school-winner-augustus-rezba-patel"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…international stage.\n\nJoin me in celebrating these remarkable young students as they  prepare for the world championship in robotics.                           Recognizing Bharat Patel\n\nMr. CORREA. Mr. Speaker, I rise today to recognize my very good  friend, Mr. Bharat Patel, for his incredible career and contributions  to our community.\n\nIn 1976, the Patel…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691173/congratulating-loris-griset-academy"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…manifest has not been shared, from the names that  have been shared publicly, I want to specifically mention those who  lived in the Eighth District of Virginia. They are Vikesh Patel; Staff  Sergeant Ryan O'Hara; Olesya Taylor and her daughter, Olivia Ter; Yu  ``Joe'' Zhou, Kaiyan Mao, and their son, Eddie Zhou; and members of the  Haynos family, Stephanie,…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688368/expressing-condolences-to-the-families-friends-and-loved-ones-of-the-victims-of-the-crash-of-american-eagle-flight-5342-and-pat-25"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "Mrs. RAMIREZ. Mr. Speaker, I rise today to celebrate longtime Chicago  leader, organizer, and my dear friend, Amisha Patel, for her nearly  three decades of civic engagement and community organizing.\n\nFrom leading environmental justice efforts at just 19 years of age to  organizing Chicago care…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690325/national-fair-housing-month-amisha-patel"}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "…transparency and       accountability.\n\nFor these reasons, the ACLU strongly urges you to vote       ``NO'' on H.R. 2096. If you have any questions, please       contact Nina Patel, Senior Policy Counsel, Justice Division.            Sincerely,                                            Cynthia W. Rosebery,                                         Director,…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692304/protecting-our-nations-capital-emergency-act"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…personal  vendettas, punish his enemies, and award his friends.\n\nHe has installed to do his bidding banana republic cronies like  Attorney General Pam Bondi and FBI Director Kash Patel, who are more  than willing to carry out Trump's abuse of the justice system. Under  their reign, dozens of prosecutors were targeted, identified, and fired  simply because…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690393/attacks-and-threats-on-democracy-and-rule-of-law"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…the record. In June of 2024, Trump said he would  declassify the Epstein files. His campaign even celebrated that promise  online. On January 30, Trump's FBI Director, Kash Patel, vowed to  release everything. On February 21, Attorney General Pam Bondi said the  client list was literally on her desk. As of today, none of that has  materialized.\n\nHowever,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695278/jeffrey-epsteins-abuse"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…offender and financier with whom the President often socialized.\n\nFor years, the President and those in his orbit, including Attorney  General Pam Bondi and FBI Director Kash Patel, alleged that prior  administrations had covered up the identities of the rich and powerful  people to whom Epstein had trafficked the girls and the facts  surrounding his…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693551/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…and other means around the globe, certainly around our country.\n\nAnd these baseless and harmful conspiracy theories are, by now, in a  book by the current FBI Director, Kash Patel, who claims that the  January 6 attack was ``the insurrection that never was'' and was  encouraged by ``deep state'' agitators as a pretext to persecute Trump  supporters.…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698494/9999"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Cash Bail Reform Act, and vote NO on       H.R. 5107, the Common Sense Law Enforcement and       Accountability in D.C. If you have any questions, please       contact Nina Patel, Senior Policy Counsel ACLU Justice       Division.            Sincerely,\n\nAmerican Civil Liberties Union, American Civil Liberties       Union of the District of Columbia,…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696949/opposition-letter-led-by-the-american-civil-liberties-union-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…look in the mirror.\n\nPeople are losing faith because Donald Trump, the election denier in  chief, can't admit he lost. People are losing faith because Tulsi  Gabbard and Kash Patel's FBI raided an election office in Fulton  County, Georgia, based on recycled conspiracy theories. They seized  2020 election results, even though it was Donald Trump who asked…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699941/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…High-Speed Rail. I was  with Secretary Duffy when he announced an investigation into where the  recent Federal funding has actually gone and I have called upon the FBI  Director Kash Patel to launch an investigation into what happened to  the $17 billion that has already been spent.\n\nAt this point, the cost of the project is estimated to be about $100  billion…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690562/gas-prices-are-lower-for-everyone-except-californians"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…authority to fingerprint noncitizens under  the age of 14 to combat the horrific practice called child recycling.\n\nJust this week, I also sent a letter to FBI Director Kash Patel and  Attorney General Pam Bondi requesting that they release the complete,  unredacted flight logs from Jeffery Epstein's private jet.\n\nIn addition, I also requested Ghislaine…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688161/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…Yavuz Er, Connor Gerrish, Aidan Hennessy, Marcel Hill, Keith       Jackson, Ava Jurek, Grace Kim, Laura Krowiak, Nailah Mansury,       Avi Narepalem, Reyhan Onder, Shreemann Patel, Natalie       Rasmussen\n\nIN: Annamaria Ebersole, Trenton Qualls, Emma Smith, Alisa       Yarling\n\nKS: Shayan Ahmed, Sanjana Akkulugari, Leonard Bertels,       Janis Curit,…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692400/congratulating-the-2025-congressional-award-gold-medalists"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…that has taken place in Memphis,  and this marks the next phase of what is a multipronged, multi-Agency  strategy to fight this crime.\n\nThis summer, the FBI, under Director Patel, conducted Operation Viper  in Memphis, and the FBI worked with the Memphis Police Department and  Chief Davis. And what they did was to surge Federal resources from the  FBI…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695666/cloture-motion"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…and, secondly, to pass an America First agenda.\n\nWith respect to draining the swamp, President Trump nominated  disrupters to lead his Cabinet and agencies, people like Kash Patel at  the FBI; John Ratcliffe at the CIA; and RFK, Jr., at HHS.\n\nI was proud to support every single nominee, and I am pretty  confident that every single nominee will win Senate…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688348/draining-the-swamp-in-order-to-put-america-first"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…very unfortunate  thing.                          California's High-Speed Rail\n\nMr. KILEY of California. Mr. Speaker, yesterday, I formally requested  that FBI Director Kash Patel open an investigation into California's  High-Speed Rail.\n\nMy letter to Director Patel reads as follows: ``While I know that  many issues are competing for your time, one issue…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688626/finding-common-ground"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…the Jewish community in the  last 2 months. This sort of hate is completely unacceptable in our  society, and, of course, we all know it needs to stop.\n\nI commend FBI Director Patel for quickly responding and launching a  full investigation into this targeted attack. I trust that the FBI and  law enforcement will do their job and swiftly find justice for…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691714/boulder-colorado-attack"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…the Times would  like to create. The Justice Department and the FBI have an obligation  to respond to congressional inquiries.\n\nTo Attorney General Bondi's and FBI Director Patel's credit, they  have done better in that regard than any of their predecessors of  Republican Presidents and Democrat Presidents. Now, am I fully  satisfied? Of course not,…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699769/whistleblowers"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…Pergentino Noble Malabed Jr.,       Grace Maxwell, Charles Douglas McDaniel, Dustin Michael       Miller, Melissa Jane Nicandri, Staff Sergeant Ryan Austin       O'Hara, Vikesh Patel, Jesse Jameson Pitcher, Robert ``Rob''       Alan Prewitt, Lori Ann Girard Schrock, Robert ``Bob'' Ryan       Schrock, Wendy Jo Shaffer, Evgenia Shishkova, Vadim Naumov,…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688371/expressing-condolences-to-the-families-friends-and-loved-ones-of-the-victims-of-the-crash-of-american-eagle-flight-5342-and-pat-25"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…reason I am doing this is, we added the President's Gold Card,  but it is skills based. I get people saying: I don't know how I feel  about that. How many of you have a Dr. Patel? It was meant to be funny.  I am from Scottsdale. It is one of the greatest medical communities in  America, and a bunch of our great, amazing talent has come in from all…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693062/stop-bathing-in-folklore-and-start-bathing-in-math"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…has been launched by the  Department of Transportation to claw back billions of dollars that have  been granted.\n\nI have also asked for an investigation by FBI Director Kash Patel to  figure out how it is exactly that they have already spent $17 billion,  that the overall cost has grown to in excess of $130 billion, yet no  track has been laid after…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689211/protecting-medicaid-for-californians"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…come. It is not going to come. There is currently an investigation  by the Department of Transportation as well, and I have asked for an  investigation by FBI Director Kash Patel to look into exactly where all  of this money went.\n\nIt is time to end this irresponsible failure of a project--the  biggest public infrastructure failure in U.S. history--once…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691353/governor-newsom-backs-down"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…homicide. They also have located more than 120 missing children and  have recovered 970 illegal firearms and 560 stolen vehicles.\n\nWith President Trump and AG Bondi and Kash Patel, and the commitment  that they have made to Memphis, this is what you are seeing. Criminals  are being apprehended, and the citizens in Memphis feel safe to go out  and about.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698427/unanimous-consent-requests-the-calendar"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…American people about the program's vetting vulnerabilities.\n\nI asked then-Director Wray about the program's national security, and  I asked the same, this year, of Director Patel of the FBI.\n\nThis year, Director of National Intelligence Gabbard told my office  an important data point: Of the more than 100,000 Afghan evacuees, as  of August 2022, 1.6…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697333/national-security"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…nationals voting in our elections threaten the bedrock of our  democratic Republic. All of us should be thankful to the Department of  Justice, Attorney General Bondi, FBI Director Patel, and DOGE that they  identified and eliminated this violation of the sanctity of our  elections process.\n\nThe Department of Labor and the Department of Agriculture are working…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690662/department-of-government-efficiency"}]