[{"senator": "Mark Takano", "party": "Democrat", "sentence": "…House Office Building basement, Ben  proved there was no challenge he could not face.\n\nBen's unique abilities, professionalism, and dedication are apparent  to all who across paths him. Throughout the nearly four years Ben was  in my office he continued to exceed expectations in every role he was  assigned. As a part of my legislative staff, he continuously…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692875/recognizing-departing-staff-member-benjamin-hong-starr"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…Fisher has continued to give back to our  community. He currently serves as a mentor at the veterans court system  in Redford Township, helping fellow veterans navigate their own paths  and helping them heal.\n\nHe is a devoted husband to Kathryn and a proud father to stepson,  Bankston, and also Sophia.\n\nPlease, Mr. Speaker, let's honor Matthew Fisher for…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693028/surveillance-pricing-in-grocery-stores"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…public mobilization, we could be saved.\n\nBut I didn't breathe a sigh of relief. It was the opposite.\n\nI am deeply worried that we have really spent little time studying  the paths that democracies take when they collapse. Most of the time,  there is not a singular moment when the Executive dramatically seizes  power. There is not normally a brazen attempt…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690111/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…2018. Prior to that, we were  both in the clean energy industry. I think it is safe to say that prior  to the election of Donald Trump in 2016, neither of us thought that our  paths involved eventually getting to Congress or certainly being in  this moment here right now.\n\nI say that because both of us spent our careers, before getting into  Congress,…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700229/winners-of-the-global-energy-race-are-being-decided"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…This kind of change did not happen by accident. It happened because  our mothers, grandmothers, great-grandmothers, aunties, sisters, and  cousins dared greatly and forged new paths for us to walk on. The  freedoms and privileges we enjoy today are because of those who came  before us. These are their stories.\n\nOver the next hour, we will hear from women…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689165/womens-history-month"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…down the names of Medgar Evers and Harriet Tubman? That is  shameful and hypocritical.\n\nDiversity makes the Nation stronger. Being committed to truth and  justice about our paths only serves as a benefit. It doesn't take  anything away. The false narrative that people are unqualified simply  is not true. We know from these Halls of Congress right here…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690321/ending-of-dei-programs-through-executive-order"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…the GSPM board, Ms. Manatt has provided strategic  counsel to ensure that students benefited from a strong, bipartisan  academic environment and were exposed to diverse career paths. Through  her family's philanthropy, she has also supported other parts of The  George Washington University, including the law school, the Graduate  School of Education and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695835/recognizing-michele-manatt-for-her-service-to-the-george-washington-university-graduate-school-of-political-management"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…than any sign.      To serve, to lead, to stand where choices rise,      To guide the course that others will pursue.      The page life opens my eager eyes,      Revealing paths I once but faintly knew.      What once was dream now feels like destiny,      This place, this work, shapes who I'm meant to be.                                 BY EMMA ROSS…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699130/senate-pages"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…every day to  learn and invest in their futures.\n\nNontraditional high school programs are becoming increasingly common.  They have all been a shining light on the different paths to success  and education.\n\nThey have left their mark on William O. Robey High School, and I look  forward to watching all that they accomplish in the future.\n\nMr. Speaker,…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692320/congratulating-john-champe-high-school-class-of-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…celebrated  the love between two remarkable individuals and marked the beautiful  journey they have shared together. This union is a testament to the  driven, thoughtful, and vibrant paths they have led to this important  moment. Emily, native to New Jersey, is the daughter of John and  Deborah Wisniewski. Born and raised in La Plata, Maryland, Branden is  the…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690468/recognizing-the-marriage-of-emily-mclaughlin-wisniewski-and-branden-anton-ehrenreich"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…essential but that it  is effective. In 2015, the United States helped negotiate the Joint  Comprehensive Plan of Action, better known as the Iran nuclear deal,  which blocked all paths for Iran to acquire a nuclear weapon. It  blocked the plutonium path; it blocked the uranium path; it blocked the  covert path.\n\nThat deal was so important for global security…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693126/motion-to-discharge-sj-res-59"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…than originally  projected. This was largely because of higher than expected carryover  and extreme belt-tightening at local VA clinics and hospitals.\n\nHowever, here is where paths diverge. In the wake of the passage of  H.R. 9468, both VA's Office of Inspector General and the Government  Accountability Office conducted and released their respective reports…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693968/protecting-regular-order-for-veterans-act-of-2025"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "Ms. DeLAURO. Madam Speaker, I yield myself such time as I may  consume.\n\nThere are two paths before us today: one if this bill passes and  another if it fails. If we take the first path, if the bill passes,  here is what will happen: The Departments of Defense, Labor,…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699573/consolidated-appropriations-act-2026"}, {"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "…community.  Introduced to public service at an early age as an Eagle Scout, Jim  dedicated the rest of his life to serving the City of Grandview and  caring for anyone he crossed paths with. Jim showed endless love for  his community, and the impact he had will be remembered forever.\n\nBorn on October 3, 1945, in Kansas City, Missouri, Jim spent his  early…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696936/recognizing-the-life-and-memory-of-james-jim-neil-crain"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…may have much in common, our States are often considered the most  ``independent-minded'' states. At one time, this tendency may have  predisposed our States to chart our own paths forward and work  fervently to protect our individual interests. Indeed, this history of  self-governance and independence led directly to the events that  founded the United…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696048/100th-anniversary-of-the-new-england-council"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…Kyiv. Russian  paratroopers from the 234th Guards Air Assault Regiment interrogated  and executed unarmed men of fighting age and killed people who  unwittingly crossed their paths, whether it was children fleeing with  their families or locals hoping to find groceries or people simply  trying to get back home on their bicycles. The victims of this massacre…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690955/ukraine"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…these sanctions continue to  provide much-needed leverage to address the full range of Iran's malign  activity. They are a vital and necessary tool not only to deny Iran all  paths to a nuclear weapon and to cut off its enrichment capabilities  but also to counter Iran's malign influence abroad, including its  ongoing support to terrorist proxies like…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690688/solidify-iran-sanctions-act-of-2025"}, {"senator": "Rob Wittman", "party": "Republican", "sentence": "…led.      Now, proving only the good die young with tear in eye, now in             heaven in The Army of our Lord an angel on high.      And in the coming years, as I walk the paths of all             magnificent patriots of the past so here.      All have met Darin will remember him and all those patriots             and shed a tear.      All one in the…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690449/poem-to-honor-darin-coward"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…watch America join with Israel  to devastate Iran's nuclear program on President Trump's watch.\n\nOne of the great benefits of my work as a Senator is the opportunity  to cross paths with great men like Norman Podhoretz. After learning  from his writing for so many years, I have had the occasion to meet him  and share a modest correspondence. I can share…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698421/unanimous-consent-requests-the-calendar"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "…These roads we are talking about are important to those residing in  Wayne and Garfield Counties and the tourists who come here from all  over the world. They have used these paths to get to places that are  part of their history and part of their recreation for generations.  These road restrictions reflect a pattern of access loss that  characterizes…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690403/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Island, the largest barrier  island on Georgia's Golden Isles, offers low-hanging Spanish moss,  salty air, and warm ocean water. It is home to pristine beaches, miles  of walking paths and trails, ice cream shops, and award-winning  restaurants. Despite this, St. Simons has still managed to keep a low  profile and is often overlooked by out-of-State beachgoers.…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692260/recognizing-st-simons-island"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…Thompson, Sergeant Jeff  William Patterson, Specialist Pascuale F. Coniglio, and Sergeant Lloyd  Lasenby each served our country with honor and unwavering commitment.\n\nThough their paths and ranks differed, all shared a common purpose,  to defend our freedoms and protect the values that define the United  States of America.\n\nTheir careers reflect decades of…", "date": "2025-08-01", "source_url": "https://justfacts.votesmart.org/public-statement/1694579/recognizing-floridas-eighth-congressional-district-veterans"}, {"senator": "Greg Murphy", "party": "Republican", "sentence": "…anesthetists. Eastern North Carolina needs more dedicated and more  diligent individuals in medicine.\n\nServing patients is one of the most rewarding and meaningful career  paths one can pursue, and I am glad that Angela is pursuing medicine.  As a physician of 35 years, I derived great joy from treating patients  and helping them in times of great…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699463/recognizing-angela-flores"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…leadership conferences, career development events,  and community service projects. The skills that these students develop  serve them well when they embark on their future career paths.\n\nNot only are the students who participate in FFA future farmers, but  they are also future business leaders, entrepreneurs, teachers,  bankers, veterinarians, public servants,…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700169/congratulating-chris-tungseth"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…conferences, ensuring that opportunity extended beyond his  own family and to a broader community.\n\nFrom Jaime's example of faith and sacrifice, the Suarez children  forged remarkable paths of their own.\n\nSon Jaime Jr., a Creighton Prep and UNO alumnus, stayed in Omaha to  continue the family's entrepreneurial tradition. Today, he operates 13  restaurants and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695647/recognizing-the-suarez-delgado-family"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…Madam Speaker, I call on all the parents of eastern Washington and  all the teachers and principals to have a conversation with our fine  recruiters and talk about what career paths their young people in their  homes and their schools may have in protecting our country with our  military.    Recognizing Spokane Chinese Association and Spokane Chinese Christian…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700140/recognizing-joshua-elliott"}]