[{"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…detain or deport  U.S. citizens, a commonsense measure. They refused to commit to that.\n\nWe proposed prohibiting interior enforcement by non-ICE personnel,  like the Border Patrol. That was rejected, as well.\n\nWe put forward a provision to ensure that Members of Congress can  continue to conduct our lawful oversight of all ICE facilities,  uninhibited.…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699345/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Josh Harder", "party": "Democrat", "sentence": "…Department of Forestry and  Fire Protection, Alameda County Fire Department, South San Joaquin  County Fire Authority, San Joaquin County Sheriffs Office, California  Highway Patrol, Tracy Police Department, Manteca Fire Department,  Lathrop-Manteca Fire District, Defense Logistics Agency, and more.\n\nNot only did the emergency response effort quickly and…", "date": "2025-05-23", "source_url": "https://justfacts.votesmart.org/public-statement/1691677/recognizing-the-1st-anniversary-of-corral-fire-in-san-joaquin-county-california"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…and the 275th class of the  FBI National Academy, Chief Tholen exemplified Minnesotan excellence  throughout his law enforcement career. His tenure included a decade in  the patrol division, where he served as a field training officer, a  defensive tactics instructor, and a member of the Southwest Metro SWAT  Team Consortium.\n\nIn the past 12 years, Chief…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691813/recognizing-chief-brian-tholen-on-his-career-as-a-law-enforcement-officer-and-service-to-minnesota"}, {"senator": "Rick Larsen", "party": "Democrat", "sentence": "…current funding levels. These  new resources should enable the Coast Guard to maintain its ongoing  recapitalization programs, including Polar Security Cutters and  Offshore Patrol Cutters.\n\nLast Congress, we enacted substantial improvements to safety for  mariners and passengers aboard vessels. This legislation builds upon  that work by addressing additional…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694197/coast-guard-authorization-act-of-2025"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "…largest act of  congressional immigration oversight since Donald Trump took office.\n\nWhat we heard was alarming, and I have worked in this space for a  very  long time. Border Patrol Commander Gregory Bovino and his rogue  immigration agents are terrorizing everyone regardless of immigration  status.\n\nWe heard from an Active-Duty servicemember, someone…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697449/fighting-dhs-immigration-raids"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…culture of safety and connection in  our schools, one relationship at a time. I thank him and the Cape  Henlopen School District.                      Honoring North Shores Beach Patrol\n\nMs. McBRIDE. Mr. Speaker, I rise today to honor the extraordinary  heroism of the North Shores Beach Patrol lifeguards who, while off  duty, sprang into action to save a swimmer…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693522/thanking-officer-robert-scisco"}, {"senator": "Alma Adams", "party": "Democrat", "sentence": "…Speaker, my community of Charlotte was under siege by the  Department of Homeland Security's campaign of terror last month. They  called it Operation Charlotte's Web.\n\nBorder Patrol agents engaged in extreme racial profiling, excessive  force, and brutal tactics, spreading fear in our community.\n\nIt was fear that shattered the car window of a U.S. citizen…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697455/fighting-dhs-immigration-raids"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…should be able to wear  masks--police officers don't wear masks all across the country. And if  anyone needs to be identified, it is these abusive thugs who are in the  Border Patrol, who are in ICE.\n\nIf Republicans can't come to the table on these very sensible  changes, then the violence we see happening around the country is going  to continue.", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699481/department-of-homeland-security"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "Ms. McCOLLUM. Mr. Speaker, I voted today not to continue funding for  the Department of Homeland Security without real oversight and  constraints on ICE and Border Patrol.\n\nMinnesotans are being racially profiled on a mass scale, assaulted on  their streets, and kidnapped from their homes. Peaceful demonstrators  are being threatened and detained…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699551/no-funding-for-dhs"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…in ICE and CBP  custody, ban military-grade equipment, strengthen civil rights, and the  inspector general's oversight.\n\nWe want to protect whistleblowers and return Border Patrol where they  should be, at the border. These are the proposals that have been  adopted by the Congressional Hispanic Caucus.\n\nAgain, Mr. Speaker, the country is alarmed. Our…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699655/horrific-ice-abuses"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…and detained. As I said, we knew that  this is how it would end.\n\nThere are people of color across this country afraid to leave their  homes because right now ICE and Border Patrol will detain anyone who  they think they can use to meet a quota based on the color of their  skin or the accent that they are using.\n\nThis didn't have to go like this. I remind…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699663/horrific-ice-abuses"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…congratulate Lieutenant John  Swandrak on 30 years of service to the Cranford Police Department and  wish Lieutenant Swandrak the best on his retirement.\n\nHis decades of service in patrol, community policing, and the  detective bureau allowed him to build invaluable relationships and  strengthen the bond between the police department and the Cranford  community.…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699515/congratulating-lieutenant-john-swandrak"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…have to be a U.S. citizen,  and then you have people at the voting place--every signature is  checked. Every signature is checked.\n\nIn fact, in our State, the Washington State Patrol basically advises  the election officials how to compare the signatures. And while they  are comparing the signatures, there are Republicans and Democrats and  League of Women…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700198/save-america-act"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…Captain Wiltrout, dedicated her career to serving and  protecting the people of Summit County in a wide range of roles. Her  work has spanned the corrections division, the patrol division and  special operations, the detective bureau, and more.\n\nIn 2021, Captain Wiltrout earned the Taskforce Director position for  a State of Ohio Narcotics Taskforce,…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691913/captain-michelle-wiltrout-named-ohios-13th-district-champion-of-the-week"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Virginia, after a vehicle pursuit on the George Washington  Memorial Parkway. Video of this shooting only became available through  a camera in a Fairfax County Police Department patrol car that was  providing backup. Had it not been for that footage, which was recorded  and released by that local police department, the public would not have  had access to…", "date": "2025-08-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694762/introduction-of-the-federal-police-camera-and-accountability-act-of-2025"}, {"senator": "Andy Harris", "party": "Republican", "sentence": "…shutdown.\n\nMillions of Americans have suffered because Democrats have refused to  reopen the government, harming those who depend on SNAP benefits,  Federal workers, Border Patrol agents, and our troops, who were  uncertain about their next paycheck.\n\nThis legislation extends government funding to the end of January  2026, thereby blocking attempts to…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696739/continuing-appropriations-and-extensions-act-2026"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…the  Ferguson Township, Pennsylvania, Police Department, where he spent 26  years on the force.\n\nDuring his time in Ferguson Township, Chief Glenny held roles that  included patrol officer, traffic enforcement, and police sergeant.\n\nThen, after a brief stop in Colorado to serve as the police chief  there, Chief Glenny returned to Pennsylvania to proudly…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1690998/delivering-on-president-trumps-agenda"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…consequential policy achievement under President Trump has been  securing our border. With the leadership of Tom Homan, Secretary Noem,  Stephen Miller, the President himself, Border Patrol, ICE, all of these  great law enforcement officials, despite the criticisms of leftists and  Marxist mayors and cities that refused to work with them, they have  brought down…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697130/congress-is-back"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…the helm-- because leadership doesn't come with an `abort mission' button.\n\nI rise today to congratulate Commander Daniel Russell on his  promotion to Commanding Officer of Patrol Squadron VP-10 of the United  States Navy, also known as the Red Lancers.\n\nWhen it comes to leadership in the Navy, it's more than just a title.  It is a calling, a duty, and…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690861/change-of-command-daniel-russell"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…Lancaster and a graduate of McCaskey High  School, Chief Mendez joined his hometown police department in 2000.  Over the course of his distinguished career, he served as a patrol  officer, K-9 officer, member of the Selective Enforcement Unit, member  of the Lancaster County Special Emergency Response Team, and platoon  leader. Demonstrating an unparalleled…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696839/congratulating-lancaster-city-police-chief-richard-mendez-on-his-retirement"}, {"senator": "Mark Amodei", "party": "Republican", "sentence": "…effort.\n\nI also remind everybody, because we get tied up in a lot of stuff,  that, essentially, the Homeland Security bill is the Coast Guard, FEMA,  TSA, Secret Service, Border Patrol, and ICE. There are other parts in  there, but that is the majority of what we are talking about. Homeland,  what is that? That is the agencies that take up the lion's share…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699349/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…this country. This includes countless numbers of murderers,  rapists, child traffickers, smugglers, and individuals from countries  that support terrorism. Customs and Border Patrol caught 400  individuals on the terrorist watch list, leaving us the question of who  else was allowed to enter this country undetected.\n\nThat is why the Stop Illegal Entry…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695364/stop-illegal-entry-act-of-2025"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…Lomell  received the Distinguished Service Cross. As we all know, that is the  second highest military decoration. The citation said in part: ``First  Sergeant Lomell led a patrol of men through the heaviest kind of  automatic weapons fire to destroy an enemy machine gun nest. Later on  the same day, while leading another patrol, he penetrated through…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693923/leonard-g-bud-lomell-va-clinic"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…happen by accident. It takes planning,  trust, and exceptional teamwork. I commend the U.S. Marshals, Spokane  County Sheriff's Office, Spokane Valley Police, Washington State  Patrol, the FBI, ATF, Homeland Security, Department of Corrections, the  U.S. Attorney's Office, Spokane County Prosecuting Attorney's Office,  and many other local, State, and Federal…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695071/operation-rolling-thunder"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…times. That is 14 votes against  paying our troops, 14 votes against paying our Federal workers, 14  votes against paying our air traffic controllers, 14 times against  Border Patrol agents, and 14 times against paying our TSA agents.\n\nThe Democratic Party has been hijacked by socialists, and now they  are holding the American people hostage. Why? Well,…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696537/government-funding"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…policies?\n\nNow you want to go on TV and act outraged about Abrego Garcia being  deported? Give me a break.\n\nHere are the facts. He was pulled over by the Tennessee Highway  Patrol for speeding with an expired license. He was detained. He had  folks in his vehicle that were apparently not American citizens. Then  he was ordered by Biden's FBI to be released.…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690313/abrego-garcia"}, {"senator": "Tony Wied", "party": "Republican", "sentence": "…enforcement with the Manawa  Police Department in 1991 and became a corrections officer in 1995 with  the  Waupaca County Sheriff's Office. Given his leadership, he was promoted  to patrol sergeant in 2007, where he also served as a training  coordinator.\n\nIn 2018, he was elected to serve as the sheriff of Waupaca County due  to his wide-ranging skill set, ample…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691410/recognizing-sheriff-timothy-wilz"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…country's history.\n\nIt delivers no tax on tips and no tax on overtime.\n\nIt provides historic tax relief for seniors.\n\nIt finishes President Trump's border wall. It boosts Border Patrol  and ICE agents on the front line, with the largest border security  investment in history.\n\nIt increases the child tax credit to $2,500 per family.\n\nIt protects Medicaid for…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692263/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Cindy Hyde-Smith", "party": "Republican", "sentence": "…after encountering a car accident involving a partially overturned  vehicle, which unfortunately shifted and fell on top of him. After  retiring from the Mississippi Highway Patrol with 34 years of service,  he served as a sworn officer with the Mississippi Department of Public  Safety for 2 years until he passed away. He is survived by his wife and…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690972/national-police-week-2025"}, {"senator": "Patrick Harrigan", "party": "Republican", "sentence": "…after more than 30 years of dedicated service.\n\nChief Baer spent his entire career serving the entire community that  he grew up in. He started with the department in 1997 as a patrol  officer and worked his way all the way up, from sergeant, to captain,  to deputy chief, and eventually to chief in 2023.\n\nUnder his leadership, the department focused on officer…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692830/recognizing-chief-reed-baer-on-his-retirement"}]