[{"senator": "Pat Fallon", "party": "Republican", "sentence": "Mr. FALLON. Mr. Speaker, I rise today to recognize Pastor lsiah  Moore, Jr., of Celina, Texas, and present him with the Congressional  Patriot Award. Pastor Moore has dedicated himself to faithfully serving  our community and country.\n\nBorn in Shreveport, Louisiana, Pastor Moore attended Booker T.  Washington High School…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690155/recognizing-congressional-patriot-award-recipient-pastor-isiah-moore-jr"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "Mr. FALLON. Mr. Speaker, I rise today to recognize Mr. Mark Kipphut  of McLendon-Chisholm, Texas, and present him with the Congressional  Patriot Award. Mark has dedicated himself to faithfully serving our  community and country.\n\nAfter graduating from The Citadel with a political science degree in  May 1979, Mark commissioned…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696968/recognizing-congressional-patriot-award-recipient-mark-kipphut"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "Mr. FALLON. Mr. Speaker, I rise today to recognize and celebrate Mr.  Steve Ledwell of Texarkana, Texas, and to present him with the  Congressional Patriot Award. Steve has dedicated his life to faithfully  serving his community and country.\n\nBorn and raised in Texarkana, Steve has spent his life building up  others and strengthening…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696827/recognizing-congressional-patriot-award-recipient-steve-ledwell"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "Mr. FALLON. Mr. Speaker, I rise today to recognize Mrs. Kay Akin of  Decatur, Texas, and present her with the Congressional Patriot Award.  Kay has dedicated herself to faithfully serving our community.\n\nKay is originally from Brownwood, Texas, and she earned her  bachelor's degree in education from East…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690286/recognizing-congressional-patriot-award-recipient-kay-akin"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "Mr. FALLON. Mr. Speaker, I rise today to recognize and celebrate Mrs.  Lisa Singleton of Bowie County, Texas, and to present her with the  Congressional Patriot Award. Lisa has dedicated her life to faithfully  serving her community and country.\n\nBorn in Hope, Arkansas, Lisa attended Hope High School, graduating in  1986, and later completed…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696870/recognizing-congressional-patriot-award-recipient-lisa-singleton"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "Mr. FALLON. Mr. Speaker, I rise today to recognize Mr. Mark Metdker  of Celina, Texas, and present him with the Congressional Patriot Award.  Mark has dedicated himself to faithfully serving our community.\n\nA native of Dallas, Mark graduated from Lewisville High School in  1975 as a star football and track…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690240/recognizing-congressional-patriot-award-recipient-mark-metdker"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "Mr. FALLON. Mr. Speaker, I rise today to recognize Mr. Thomas McCall  of Frisco, Texas, and present him with the Congressional Patriot Award.  He has served and uplifted our community through his leadership and  dedication.\n\nTom was born and raised in Yonkers, New York. Due to life hardships,  he was quickly…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695482/recognizing-congressional-patriot-award-recipient-thomas-mccall"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "Mr. FALLON. Mr. Speaker, I rise today to recognize Mr. Nate Pike of  Prosper, Texas, and present him with the Congressional Patriot Award.  Nate has dedicated himself to faithfully serving our community.\n\nA native of Denison, Texas, Nate attended Denison High School and  graduated from Baylor University in…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690209/recognizing-congressional-patriot-award-recipient-nate-pike"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "Mr. FALLON. Mr. Speaker, I rise today to recognize Mr. Ralph O'Dell  of Celina, Texas, and present him with the Congressional Patriot Award.  Ralph has dedicated himself to faithfully serving our community and  country.\n\nRalph is a veteran of the Second World War and served with the United  States Army from…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690225/recognizing-congressional-patriot-award-recipient-ralph-odell"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "Mr. FALLON. Mr. Speaker, I rise today to recognize Mr. John  ``Johnny'' Rothfus of Prosper, Texas, and present him with the  Congressional Patriot Award. Johnny has dedicated himself to faithfully  serving our community and country.\n\nJohnny was born in Sachse, Texas, and moved with his family to  Prosper at a young age.…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690292/recognizing-congressional-patriot-award-recipient-john-johnny-rothfus"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "Mr. FALLON. Mr. Speaker, I rise today to recognize Mr. Andy ``Hop''  Hopkins of Celina, Texas, and present him with the Congressional  Patriot Award. Andy has dedicated himself to faithfully serving our  community and country.\n\nAndy was born in Columbus, Ohio, and he attended Plano Senior High  School. After graduating…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690707/recognizing-congressional-patriot-award-recipient-andy-hopkins"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "Mr. FALLON. Mr. Speaker, I rise today to recognize Ms. Catherine  ``Trinka'' Taylor of Dallas, Texas and present her with the  Congressional Patriot Award. Trinka has dedicated herself to faithfully  serving our community.\n\nA sixth-generation Texan, Trinka was born in Dallas, Texas, and grew  up in Houston. She attended Rice…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690291/recognizing-congressional-patriot-award-recipient-catherine-trinka-taylor"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "Mr. FALLON. Mr. Speaker, I rise today to recognize Ms. Carmen Roberts  of Celina, Texas, and present her with the Congressional Patriot Award.  Carmen has dedicated herself to faithfully serving our community.\n\nCarmen was born in Chihuahua, Mexico, and immigrated to the United  States at a young age. She attended…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690747/recognizing-congressional-patriot-award-recipient-carmen-roberts"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "Mr. FALLON. Mr. Speaker, I rise today to recognize and celebrate Mr.  Gary Singleton of Bowie County, Texas, and to present him with the  Congressional Patriot Award. Gary has dedicated his life to faithfully  serving his community and country.\n\nBorn in Texarkana, Texas, Gary attended school in the Texarkana and  Liberty-Eylau districts…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696861/recognizing-congressional-patriot-award-recipient-gary-singleton"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "Mr. FALLON. Mr. Speaker, I rise today to recognize Mr. Corbett Howard  of Celina, Texas, and present him with the Congressional Patriot Award.  Corbett has dedicated himself to faithfully serving our community.\n\nCorbett was born in Roswell, New Mexico. He received his Bachelor of  Arts in History and Political…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690167/recognizing-congressional-patriot-award-recipient-corbett-howard"}]