[{"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…must reflect the values of equity and  justice.\n\nToday, her legacy stands tall in Grand Rapids, both figuratively and  literally, with her statue near GRCC's campus.\n\nDr. Patricia Pulliam, Publisher: As an educator, Dr. Pulliam worked  tirelessly to uplift students in Grand Rapids, serving as an adviser,  mentor, and leader in higher education.\n\nBeyond…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688206/highlighting-notable-black-leaders-from-michigans-third-congressional-district"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "Mr. PAPPAS. Mr. Speaker, I rise today in recognition of Patricia Ann  Miller's outstanding service as a Surviving Spouse Liaison at the  Military Officers Association of America. Pat has approached her work  as a liaison with immense passion…", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691686/recognizing-patricia-ann-miller-for-her-service-as-surviving-spouse-liaison"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…manufacture and produce in the  United States of America.\n\nI don't like reading that factories are being closed, Mr. Speaker. I  don't like reading another headline written by Patricia Cohen on April  3 that says that the trade war that we are in risks forfeiting  America's economic primacy.\n\nNow, this is just one article. There is another one by Oren Cass.…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689752/reflecting-on-americas-history"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…Jillian Cantrell, Molly Carpenter, Luke Catanzaro, Paloma       Chacon, Christy Charbonnet, Daniela Chirinos Vasquez, Peter       Chong, William Christian, Madelon Clark, Patricia Clarke,       Matthew Clemence, Adam Cloch, Sarah Coffman, Rachel Coll,       Katherine Covington, Caleb Crosswhite, Peter Crumpler,       Candace Cunningham, Jacob Custer,…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691709/recognizing-the-joint-congressional-committee-on-the-inauguration"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…Bishop Williams was born in Dougherty County, Albany, Georgia, to the  late Roosevelt Williams and Evangelist Katie Mae Anderson. The youngest  of seven children--Johnny Bell, Patricia, Gloria Jean, Roosevelt, Jr.,  Larry, and Barbara--he was reared in a home firmly rooted in faith,  discipline, and service. Those foundational values shaped a life that…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699461/in-memory-of-bishop-dr-frederick-williams-sr"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Officer, retired; Anne Gruner, Senior       Intelligence Officer, CIA, retired; Sheila Gwaltney, US       Ambassador, retired; Brent Hartley, US Ambassador, retired;       Patricia Haslach, US Ambassador, retired; William Haugh,       Senior Foreign Service Officer, retired.\n\nJohn Heffern, US Ambassador, retired; Robert Herman, Former       Policy Planning…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691413/recognizing-assault-on-american-diplomacy"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…DC Voter since 1972; Meghan Briggs; Michael Williams; Michael       Young; Misty Thomas Zaleski; Nancy Liebermann; Nashrah Ahmed;       Nikisha Gordon; Nina F. Simon; Patricia Harlow; Paul Ashton;       Professor Emily Cassometus; Rachel Gilliam; Rachel N.; Ralph       P. Albrecht, Past President, Bar Association of DC.\n\nRebecca Lindhurst; Ren Newport;…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696958/opposition-letter-led-by-tzedek-dc-on-the-district-of-columbia-cash-bail-reform-act-of-2025-hr-november-2025"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Victor       Reese, Mystelle Ruble, Naike Savain (Former DC Police Reform       Commissioner), Nashrah Ahmed, Nathan Brenner Sr., Nicola,       Noam Stopak.\n\nNorah Renken, Patricia Harlow, Phil Klein, Rachel Neurohr,       Rafaella Zabot-Hall, Rebbie Davis, Regina Coates, Renaud       De'Aundre Brown, Robert Burks, Ron Mittan, Ronald Hampton       (Washington…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696988/opposition-letter-led-by-the-dc-justice-lab-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…Englander, Esq., LLC; Law Office of Mary Ellen Sach; Law       Office of Michele A. Santucci.\n\nLaw Office of Nancy Grim; Law Office of Patavee Vanadilok,       P.C.; Law Office of Patricia M. Corrales; Law Office of Paul       L. Spaulding, PC; Law Office of Paul O'Dwyer P.C.; Law Office       of Peter W. Hill; Law Office of Sandra Gillies; Law Office of…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689713/no-rogue-rulings-act-of-2025"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Cruser, Olivia:       CNN; CRUZ, CAROLINA: WRC-TV/NBC-4; CRUZ, JESSICA: BBC; Csapo,       Jonathan: BBC; Cuccia, Gabrielle: ONE AMERICA; Cuddy,       Matthew: CNBC; Culhane, Patricia: AL JAZEERA ENGLISH; Cullen,       Ryan: NBC NEWS; Cullerton, Brendan: GRAY TELEVISION; Cumber,       Erika: CTV-COMMUNITY TV OF PG COUNTY; Cunanan, Rene: NBC       NEWS;…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698150/members-entitled-to-admission-to-the-119th-congress-radio-and-television-correspondents-gallery"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…typically, almost  always, aligns with Democrats on elections and voting issues. Its  executive director said: ``Point blank, it is a dangerous move.''\n\nOr take the word of Patricia Sinay, a Democrat sitting on the  Citizens Redistricting Commission, who said: ``The very purpose of the  State's independent redistricting commission is to protect voters…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694130/dismantling-californias-citizens-redistricting-commission"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…stakeholders to reach a fair  contract for Correctional Officers. Mr. Ellis's years of hard work have  made Smithtown a great place to live, work, and raise a family.  Alongside Patricia, his wife of 51 years and a State Committeewoman,  Mr. Ellis has shown an unwavering commitment to doing what is best for  his community\n\nDuring his 25 years serving as Chairman…", "date": "2025-03-18", "source_url": "https://justfacts.votesmart.org/public-statement/1688911/recognizing-mr-bill-ellis-for-his-contributions-to-long-island"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…Hillibush,  human resources director; and Renate Pullen, compliance director.\n\nMembers of the CDC Board of Directors are: Bryce Row, president;  Michelle Larsen, vice president; Patricia Cloud, treasurer; Anna Birch  DeWitt; Tayla Trujillo; Ally Orr; Nikki Hawley; Scott Wells; Tony  Hager; Bobby Pickle; Brad Diller; and Fleur Tremel.\n\nThose serving on the…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690065/recognizing-natrona-county-cdcs-art-a-la-carte-gala"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…visited Disneyland as a  child, and it lit a spark in his heart. He decided then and there that  America would be his home. In 1981, he began raising a family with his  wife, Patricia Delgado de Suarez, and set his dream in motion.\n\nThe path was anything but easy. The process of immigrating took 7  years of perseverance, paperwork, and determination. In…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695647/recognizing-the-suarez-delgado-family"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "Mr. GUTHRIE. Mr. Speaker, I rise today to celebrate the birth of  Reese Patricia Fritsch.\n\nReese was born on October 7, 2025 at 2:45 P.M. at Luminis Health Anne  Arundel Medical Center weighing seven pounds, two ounces and measuring  21 inches long to…", "date": "2025-10-24", "source_url": "https://justfacts.votesmart.org/public-statement/1696399/recognizing-reese-patricia-fritsch"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…recovered until 2001, and he has  been memorialized on the Courts of the Missing at the National Memorial  Cemetery of the Pacific.\n\nCommander Olson was married to his wife, Patricia, and had two  children, Dana and Eric.\n\nMr. Speaker, I encourage my colleagues to support this bill, and I  reserve the balance of my time.\n\nMr. GILL of Texas. Mr. Speaker,…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697598/commander-delbert-austin-olson-post-office"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Minho: New York Times; Kim, Seung Min: Associated Press; Kim,       Suyeong: Mainichi Shimbun; Kim, Wonchul: Hankyoreh Daily;       Kim, Eunjoong: Chosun Ilbo; Kime, Patricia: Military.com;       Kinashi, Kosuke: Kyodo News; Kindy, Kimberly: Associated       Press; Kinery, Emma: American Banker; King, Ledyard: National       Journal; King, Ryan:…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698132/members-entitled-to-admission-to-the-119th-congress-daily-press-gallery"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…Pennsylvania is home to a  champion horse known as Smarty Jones.\n\nI rise today to celebrate one of the great horses our Commonwealth  has ever produced. Born and bred at Roy and Patricia Chapman's Someday  Farm in Chester County, Smarty Jones was not just a racehorse. He was a  Pennsylvania champion horse.\n\nIn 2004, he captivated the Nation, winning the Kentucky…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694960/recognizing-smarty-jones"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Ms. Patricia Schneider has made to our community  through her volunteerism with the Pregnancy & Family Life Center. Ms.  Schneider is part of a team of selfless and dedicated women who…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691836/recognizing-patricia-schneider"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…a sister.\n\nGertrude met Bill Milburn while he was serving in the Navy during  World War II, and they married in December 1945 after his discharge.  They had two children, Patricia Milburn Link and Randolph Lee Milburn,  and lived in Lincolnton, North Carolina, until 1967, when they moved to  Lake Norman.\n\nGertrude spent her entire career in the textile…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688681/congratulating-gertrude-pauline-whitener-milburn-on-her-100th-birthday"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Ms. Patricia Furlong has made to our community  through her volunteerism with the Pregnancy & Family Life Center. Ms.  Furlong is part of a team of selfless and dedicated women who have…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691825/recognizing-patricia-furlong"}]