[{"senator": "Pat Fallon", "party": "Republican", "sentence": "Ralph O'Dell  of Celina, Texas, and present him with the Congressional Patriot Award.", "title": "Recognizing Congressional Patriot Award Recipient Ralph O'dell", "date": "2025-04-28"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "Punk Carter of  Celina, Texas, and present him with the Congressional Patriot Award.", "title": "Recognizing Congressional Patriot Award Recipient Punk Carter", "date": "2025-05-06"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "Mark Metdker  of Celina, Texas, and present him with the Congressional Patriot Award.", "title": "Recognizing Congressional Patriot Award Recipient Mark Metdker", "date": "2025-04-28"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "Patrick  ``Pat'' Terrell of Burr Ridge, Illinois, and present him with the  Congressional Patriot Award.", "title": "Recognizing Congressional Patriot Award Recipient Pat Terrell", "date": "2025-07-23"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "Mark Kipphut  of McLendon-Chisholm, Texas, and present him with the Congressional  Patriot Award.", "title": "Recognizing Congressional Patriot Award Recipient Mark Kipphut", "date": "2025-11-19"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "Nate Pike of  Prosper, Texas, and present him with the Congressional Patriot Award.", "title": "Recognizing Congressional Patriot Award Recipient Nate Pike", "date": "2025-04-28"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "Dennis Lewis of Texarkana, Texas, and to present him with the  Congressional Patriot Award.", "title": "Recognizing Congressional Patriot Award Recipient Dennis Lewis", "date": "2025-11-18"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "Speaker, I rise today to recognize Sheriff Lane Akin  of Decatur, Texas, and present him with the Congressional Patriot  Award.", "title": "Recognizing Congressional Patriot Award Recipient Sheriff Lane Akin", "date": "2025-04-28"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "Catherine  ``Trinka'' Taylor of Dallas, Texas and present her with the  Congressional Patriot Award.", "title": "Recognizing Congressional Patriot Award Recipient Catherine ``trinka'' Taylor", "date": "2025-04-28"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "Lisa Singleton of Bowie County, Texas, and to present her with the  Congressional Patriot Award.", "title": "Recognizing Congressional Patriot Award Recipient Lisa Singleton", "date": "2025-11-18"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "Carmen Roberts  of Celina, Texas, and present her with the Congressional Patriot Award.", "title": "Recognizing Congressional Patriot Award Recipient Carmen Roberts", "date": "2025-05-06"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "Gary Singleton of Bowie County, Texas, and to present him with the  Congressional Patriot Award.", "title": "Recognizing Congressional Patriot Award Recipient Gary Singleton", "date": "2025-11-18"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "Walter Eugene  Hunter of Celina, Texas, and present him with the Congressional Patriot  Award.", "title": "Recognizing Congressional Patriot Award Recipient Walter Hunter", "date": "2025-05-06"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "Elizabeth  ``Beth'' Terrell of Burr Ridge, Illinois, and present her with the  Congressional Patriot Award.", "title": "Recognizing Congressional Patriot Award Recipient Beth Terrell", "date": "2025-07-23"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "Speaker, I rise today to recognize Pastor lsiah  Moore, Jr., of Celina, Texas, and present him with the Congressional  Patriot Award.", "title": "Recognizing Congressional Patriot Award Recipient Pastor Isiah Moore, Jr.", "date": "2025-04-28"}]