[{"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "Mr. DOGGETT. Mr. Speaker, today, I rise to recognize Archbishop of  Constantinople-New Rome and Ecumenical Patriarch, His All-Holiness  Bartholomew.\n\nBorn Demetrios Arhondonis in 1940 on the island of Imvros (today,  Gokceada, Turkey), His All-Holiness Bartholomew was elected in October  1991 as the 270th…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695051/recognizing-his-all-holiness-bartholomew"}, {"senator": "Herb Conaway, Jr.", "party": "Democrat", "sentence": "Mr. CONAWAY. Mr. Speaker, I rise today to welcome His All-Holiness  Ecumenical Patriarch Bartholomew to Washington, D.C.\n\nKnown as the ``Patriarch of Peace'' by the Eastern Orthodox Church,  he guides millions of faithful around the world in their spiritual  journey…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695506/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "Mr. PALLONE. Mr. Speaker, I rise today to recognize His All-Holiness  Ecumenical Patriarch Bartholomew, the Spiritual Head and leader of the  second largest Christian Church in the world. His All-Holiness is  visiting Washington, D.C. in conjunction with his acceptance…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695586/recognizing-the-spiritual-head-ecumenical-patriarch-bartholomew"}, {"senator": "Maggie Goodlander", "party": "Democrat", "sentence": "…million  people, including more than 4,800 Orthodox Christians living in New  Hampshire. Ordained to the Diaconate in 1961 and to the Priesthood in  1969, Ecumenical Patriarch Bartholomew served as Assistant Dean  at the Theological School of Halki before he was appointed Personal  Secretary to the late Ecumenical Patriarch Demetrios, Metropolitan of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695371/recognizing-the-ecumenical-patriarch-of-constantinople-his-all-holiness-bartholomew"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "Mr. DELUZIO. Mr. Speaker, I rise today to welcome His All-Holiness  Ecumenical Patriarch Bartholomew to Washington, D.C.\n\nAs the Ecumenical Patriarch of Constantinople, His All-Holiness  Bartholomew, is the spiritual leader of 300 million Orthodox Christians  worldwide,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695410/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "Mr. CARTER of Louisiana. Mr. Speaker, I rise today to extend a warm  welcome to His All-Holiness Ecumenical Patriarch Bartholomew, the  spiritual leader of the world's Orthodox Christians and the head of the  Ecumenical Patriarchate of Constantinople.\n\nAs the spiritual leader of the second-largest…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695495/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "Mr. HIMES. Mr. Speaker, I rise today to welcome His All-Holiness  Ecumenical Patriarch Bartholomew to the United States.\n\nHis first visit since 2021, he joins us on his eighth Apostolic trip  to our country during which he will receive the prestigious Templeton…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695502/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Thomas Suozzi", "party": "Democrat", "sentence": "…leader and the Primus inter Pares (First among Equals) of  Orthodox Christianity worldwide, a Church of 300 million people. This  September, His All-Holiness Ecumenical Patriarch Bartholomew visited  our Nation's capital, continuing his longstanding practice of meeting  with the President and engaging with Members of Congress from both  political sides.…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697433/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew-of-constantinople"}, {"senator": "Nelida Pou", "party": "Democrat", "sentence": "Ms. POU. Mr. Speaker, I rise to welcome His All-Holiness Ecumenical  Patriarch Bartholomew to the United States. On behalf of the many  Eastern Orthodox Christians who call New Jersey home, including my  constituents at St. George Greek Orthodox Church in…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695843/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…the riots erupted to less than 2,000 today.\n\nAt a time when hostility and misunderstanding between the Christian  and Muslim worlds have reached a deadly standoff, Patriarch  Bartholomew, who speaks seven languages including Turkish, has made a  deliberate effort to reach out to Muslims throughout the Middle East.  ``It is our strong belief that Orthodox…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695407/welcoming-his-all-holiness-bartholomew-i-ecumenical-patriarch-of-constantinople"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "Ms. KAPTUR. Mr. Speaker, I rise today with great honor to welcome to  our Nation's Capital His All-Holiness Ecumenical Patriarch Bartholomew,  Archbishop of Constantinople-New Rome and Ecumenical Patriarch. He is  the Spiritual Head of the Orthodox Christian Church worldwide and  shepherd to over 300 million…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695409/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew-archbishop-of-constantinople-new-rome-and-ecumenical-patriarch"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "Ms. STEVENS. Mr. Speaker, I rise today to express my gratitude  towards His All-Holiness Ecumenical Patriarch Bartholomew, the  Archbishop of Constantinople and spiritual leader of Orthodox  Christianity worldwide, for his time spent in our Nation's Capital last  week. On behalf of the…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696019/appreciating-the-presence-and-contributions-of-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…including those at the St. Nicholas Greek Orthodox  Church of Manchester and the St. Nicholas Greek Orthodox Church of  Portsmouth, in welcoming His All-Holiness Ecumenical Patriarch  Bartholomew on the occasion of his visit to the United States from  September 15 to 17, 2025.\n\nOn behalf of the State of New Hampshire, I recognize His All- Holiness' efforts to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695442/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "Mr. PETERS. Mr. President, I rise to offer remarks to welcome His  All-Holiness Ecumenical Patriarch Bartholomew to the United States. He  is the spiritual head of the second largest Christian Church in the  world and the leader of over 1 million Greek Orthodox in the United…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695682/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Jacky Rosen", "party": "Democrat", "sentence": "Ms. ROSEN. Mr. President, today I rise to welcome His All-Holiness  Ecumenical Patriarch Bartholomew to our Nation's Capital. Visiting from  Greece, Ecumenical Patriarch Bartholomew was elected in October 1991 as  the 270th archbishop of the 2000-year-old church founded…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694986/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Abraham Hamadeh", "party": "Republican", "sentence": "Mr. HAMADEH of Arizona. Mr. Speaker, I rise today to offer a warm  welcome to His All-Holiness Ecumenical Patriarch Bartholomew, the  spiritual leader of 300 million Orthodox Christians throughout the  world and the current Archbishop of Constantinople, serving in one of  the oldest sees in…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695076/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew-to-the-united-states"}, {"senator": "Roger Marshall", "party": "Republican", "sentence": "Mr. MARSHALL. Mr. President, I rise today to welcome to our Nation's  capital His All-Holiness Ecumenical Patriarch Bartholomew, the  Spiritual Head of the second-largest Christian Church in the world. His  All-Holiness serves as the current Archbishop of Constantinople and  leads over 300 million…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695589/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Rick Scott", "party": "Republican", "sentence": "…to recognize the meaningful visit of Ecumenical Patriarch  of Constantinople, His All-Holiness Bartholomew of the Orthodox Church  to our Nation's Capital. Ecumenical Patriarch Bartholomew has been on  the forefront of religious freedom for his entire ministry, and now as  the longest serving Archbishop of Constantinople in the two millennia  history…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695570/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Barry Moore", "party": "Republican", "sentence": "Mr. MOORE of Alabama. Mr. Speaker, today, I rise to recognize the  remarkable accomplishments of His All-Holiness Ecumenical Patriarch  Bartholomew. His All-Holiness is not only a recipient of the  Congressional Gold Medal, but he is also soon to be the recipient of  the Templeton Award, the world's foremost award…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696715/recognizing-the-accomplishments-of-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…Speaker, I rise today on behalf of the Greek  Orthodox community in Florida and also across the United States to  extend a heartfelt welcome to his All-Holiness Ecumenical Patriarch  Bartholomew who will visit Washington, D.C., from September 15 through  September 17.\n\nFor many Greek Orthodox faithful in my district, His All-Holiness is  more than a religious…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695267/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…religious freedom and bringing together others from  many faiths to work towards better cooperation and understanding.  Through dialogue and visitations, the Ecumenical Patriarch Bartholomew  has significantly advanced Orthodox relations with the Roman Catholics,  Lutherans, Baptists, and others through visitations and open dialogues.\n\nIn addition, His…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695924/welcoming-the-ecumenical-patriarch-of-constantinople-his-all-holiness-bartholomew"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…was a wonderful husband, father, and  grandfather and committed to the betterment of Iowa, Bettendorf, and  our Nation.        Recognizing His All-Holiness Ecumenical Patriarch Bartholomew\n\nMrs. MILLER-MEEKS. Mr. Speaker, I rise today to recognize His All- Holiness Ecumenical Patriarch Bartholomew, who is the spiritual leader  and the ``primus inter pares'';…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695074/raising-awareness-of-world-suicide-prevention-day"}, {"senator": "Chuck Fleischmann", "party": "Republican", "sentence": "…has earned global respect for his spiritual leadership and  commitment to peace. Guided by his belief that ``war in the name of  religion is war against religion,'' Patriarch Bartholomew has built  strong relationships with religious and political leaders in every  continent to promote unity among faiths.\n\nIn 1997, Patriarch Bartholomew became the first…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694769/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Scott Fitzgerald", "party": "Republican", "sentence": "Mr. FITZGERALD. Mr. Speaker, I rise today to ask my colleagues to  join me in welcoming His All-Holiness Ecumenical Patriarch Bartholomew  to our Nation's Capital. As the Head of the second largest Christian  Church in the world, Ecumenical Patriarch Bartholomew leads a Church of  300 million people,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695466/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "…Archbishop of Constantinople-New Rome,  His All-Holiness serves as the spiritual head of the second largest  Christian Church in the world.\n\nHis All-Holiness Ecumenical Patriarch Bartholomew was elected in  October 1991 as the 270th Archbishop of the 2,000-year-old Church  founded by the Apostle Andrew. For more than three decades, he has  stood at the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695424/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Neal Dunn", "party": "Republican", "sentence": "Mr. DUNN of Florida. Mr. Speaker, I rise today to welcome his All- Holiness Ecumenical Patriarch Bartholomew to the United States this  week. My colleagues and I are honored to host him here in the House of  Representatives and I know my Greek-Orthodox constituents are excited…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695798/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "Mr. CASSIDY. Mr. President, I rise today to welcome to America His  All-Holiness Ecumenical Patriarch Bartholomew, the spiritual leader of  the world's second-largest Christian Church--Orthodox Christianity-- which encompasses over 250 million faithful worldwide.\n\nWe in Louisiana…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695653/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Jon Husted", "party": "Republican", "sentence": "Mr. HUSTED. Mr. President, today I would like to recognize His All- Holiness Ecumenical Patriarch Bartholomew's visit to Washington, DC.  His All-Holiness is visiting our Nation's Capital in conjunction with  his acceptance of the prestigious Templeton Prize, an award which…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695552/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "Mr. NUNN of Iowa. Mr. Speaker, I rise today to welcome his All- Holiness Ecumenical Patriarch Bartholomew to the United States this  week. My colleagues and I are honored to host him here in the House of  Representatives and I know my Greek-Orthodox constituents are excited…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695624/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Darrell Issa", "party": "Republican", "sentence": "…worldwide. During this historic visit to  the United States, His All-Holiness will receive the Templeton Prize-- the world's most prestigious award in Religion and Science.\n\nPatriarch Bartholomew's efforts to promote religious freedom and  human rights and his initiatives to advance religious tolerance among  the world's religions, together with his work toward…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695541/welcoming-ecumenical-patriarch-of-constantinople-his-all-holiness-bartholomews-2025-visit-to-the-united-states"}]