[{"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…published to the benefit of both the Congress and the  public, who deserve access to information about the use of taxpayer  dollars.\n\nFinally, I must speak out against the pattern of unlawful impoundment  that is being led by OMB Director Russ Vought, who insists that there  is somehow a loophole in the Impoundment Control Act that permits the  Executive…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694158/senate-amendment-to-hr-4"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…their chance at education, and the nation's  progress was stunted.\n\nMr. Speaker, if we do not learn from our history, we are doomed to  repeat it. We are witnessing the same pattern repeating in our own  lifetime.\n\nIn Hungary, Viktor Orban has taken over universities, closed  independent institutions, and forced academic programs to shut down  when they…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695652/respect-for-science-and-pursuit-of-truth"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…rise today to introduce the  Qualified Immunity Accountability Act because no one is above the law  or the Constitution.\n\nAcross this country, we are witnessing a dangerous pattern: Federal  law enforcement officers--specifically, ICE agents--operating with near  total impunity. We have seen constitutional rights violated, and we  have seen communities…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699645/upholding-rule-of-law-for-federal-officers"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…had no right to refuse to  answer our questions about what he has done in his role during the  first 6 months of this administration.\n\nThe fact is, he has been involved in a pattern of lawlessness and  recklessness, a violation of individual rights and liberties, a pattern  of corruption unprecedented in the history of the U.S. Department of  Justice.…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694062/9999"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…22 individuals we  interviewed who themselves were only a subset of hundreds of American  citizens who were physically assaulted, detained, and many of them  injured.\n\nThis pattern and practice is not coincidental. It is the result of an  apparent policy on the part of this government Agency that involves  agents who are masked, unidentifiable, who turn…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699087/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…and demanded pro  bono services from the law firms in exchange for the discontinuation of  the punitive executive orders.\n\nAdditionally, Donald John Trump has engaged in a pattern of  unconstitutional, unlawful, and corrupt retaliation against critics and  political opponents, a flagrant violation of constitutional rights  protected by the First Amendment.…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691079/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…infinitely without  repeating. If you were to try to write down the exact number for pi,  there would be infinite numbers to the right of the decimal point and  there would be no pattern. This means we're down to a mere infinity  digits yet to be found. To date, it has been calculated to over 202  trillion digits. But there is still new math to be discovered.…", "date": "2025-03-14", "source_url": "https://justfacts.votesmart.org/public-statement/1688887/recognizing-pi-day"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…a government regulator, the Chairman of the Federal  Communications Commission, flexed his authority.\n\nThis is not an isolated slip of the tongue; it is part of a broader  pattern by the Federal Communications Commission under Brendan Carr's  leadership. Over and over again, he has used his office to attack and  undermine journalists and broadcasters…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695700/authorizing-the-en-bloc-consideration-in-executive-session-of-certain-nominations-on-the-executive-calendar"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…tries to hide  the truth. That is his MO--putting himself first and then hiding the  truth.\n\nThis new report, just like the boat strikes in the Caribbean, points  to a growing pattern: When Hegseth has the chance to make himself look  good, look tough, he will talk a big game--try to seem tough. He will  go on TV and make big speeches. But when he makes…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697514/signalgate"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…ago in committee, during the  confirmation hearing, he deflected. He showed no reflection or evolved  thinking, because the truth is Mr. Tung's record and writings reveal a  pattern of ideological extremism that calls into question his ability  to apply the law fully and fairly.\n\nNow, let me also make it clear that I am not setting out with the  goal…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696538/government-funding"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…talks about a lot of things that may sound nice,  but he never follows through or delivers on any of his promises.  Whether it is costs or Epstein or ending forever wars, the pattern is  the same. Donald Trump talks about credit cards one day, food prices  the next, housing the day after, but never actually follows through on  getting his Republican colleagues…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699088/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…how the bill will actually lower grocery prices, improve the GDP, lower  unemployment, and create jobs. Of course, Republicans rejected my  amendment.\n\nThat seems to be the pattern that we are all seeing, and that is why  we are here today to share the stories on how the affordability crisis  is affecting our constituents.\n\nDexter).\n\nMs. RIVAS. Mr. Speaker,…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699584/stop-the-republican-affordability-crisis"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "Ms. STANSBURY. Mr. Speaker, it is like the changing of the seasons.  There is a consistent pattern across our economy year after year.  Democrats rescue and build an economy that empowers workers, that  invests in American-made jobs, that invests in our infrastructure and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695608/devastating-harm-caused-by-trump-administration"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Speaker, I am not interested in business as usual, not for 2 more  weeks, not for 2 more seconds.\n\nA Federal judge recently described ICE's conduct in January as an  extraordinary pattern of defiance of court orders. They said ICE ``has  likely violated more court orders in January 2026 than some Federal  agencies have violated in their entire existence.''…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699593/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…worked at great personal risk to defend those  basic rights. Their fight is part of a larger global struggle.\n\nFrom Eastern Europe to Latin American and Southeast Asia, the pattern  is the same: When authoritarian leaders feel threatened, they silence  critics, shut down independent groups and dismantle the checks meant to  hold them accountable. And…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697939/international-human-rights-day"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…and the Federal Bureau of Investigation, and they did so in  an effort to intimidate, to smear, and to discredit brave and patriotic  whistleblowers. This has now become a pattern of conduct by the New  York Times, dating back to articles starting in 2023.\n\nOn January 30, 2025, Alan Feuer and Adam Goldman mischaracterized my  and Senator Johnson's Arctic…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699769/whistleblowers"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…and that the company is working on it-- as if this harmful defamation is merely a technical glitch. And they  refer to it as a hallucination.\n\nIn fact, there seems to be a pattern of malicious lying and fiction  when it comes to conservatives. So I asked the AI model ``Has Marsha  Blackburn been accused of rape?'' The answer to this question, of  course,…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696539/government-funding"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…States Senate, against Federal law,  Mr. Chair. It was against Federal law.\n\nJudge Boasberg issued nondisclosure orders.\n\nMr. BIGGS of Arizona. Mr. Chair, when we see this pattern and we know  that he has displayed and said that he has bias against President  Trump, he no longer is a fair arbiter, and he must be reckoned with.\n\nMr. BIGGS of Arizona.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699047/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Rick Crawford", "party": "Republican", "sentence": "…is another Democratic hit, H.R. 8741 of the 118th Congress,  pointing to the threat to our homeland, defining Maduro as a person of  concern who has engaged in a ``long-term pattern or serious instances  of activity adverse to the national security of the United States, the  security of critical infrastructure of the United States, or the safety  and…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699371/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…equipment.  This equipment spans across our country and finds its home in most of  our cellular devices. Over a decade ago, our intelligence Agencies  began noticing a peculiar pattern of Huawei equipment on cell towers  across my home State of Nebraska as well as nearby Colorado and  Montana. That Chinese gear was clustered near sensitive military  assets,…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690666/fact-act"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…has been enforcing  American law since January 20 of 2025.\n\nWe, the people, demand to know what is the data of so-called special  interest aliens. These are suspicious-travel-pattern, illegal  immigrants coming into our country. We want to know: Where did they  come from? How did they get here? Where were they before? We want to  know all the data that…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693077/special-interest-alien-reporting-act-of-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…program to award grants to eligible entities to review       designs of covered structures of mixed-income housing and       designate such reviewed designs to be included in pattern       books for use in the jurisdiction of the eligible entity.\n\n(b) Restriction.--Amounts awarded under this section may       not be used for construction, alteration, or…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Ashley Moody", "party": "Republican", "sentence": "…is an attack on the people's law. Indeed,  it is an attack on the rule of law.\n\nOver the last 10 months, our Federal officers and agents have faced a  dangerously escalating pattern of violence, ranging from hitting,  spitting, kicking, and biting during arrests to vehicle-ramming, open  gunfire, and throwing Molotov cocktails--all because they are doing…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697550/halo-act"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…approvals, agencies can still demand  additional authorizations, slowing installation, maintenance, and  repair work that is critical to keeping these systems secure.\n\nWe see this pattern far too often in Washington. Projects are  approved, but delays pile up anyway. Timelines slip. Responsibility  gets passed around. Bureaucracy grows, while real-world risks…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699905/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…cybersecurity updates.\n\nIn another example, union bosses threatened to block the Office of  Personnel Management from implementing basic IT security controls.\n\nThere is a troubling pattern where union bosses block measures that  they don't like, forgetting that they work for the American people and  not the other way around.\n\nThe President's executive order…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697995/protect-americas-workforce-act"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…administration and has nothing to  do with one administration or another. It was bipartisan, and those  entities of concern are named in and are labeled within the DOD. We do  have a pattern of history of Confucius Institutes switching names but  remaining the same for the purpose of malign influence.\n\nMr. Speaker, I thank the ranking member and the gentleman…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690828/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…skilled craftsman in places like southeast Missouri,  but for decades, our political class has rigged the rules to punish  rather than help companies that put America first. This pattern repeats  again and again and in every industry.\n\nUp until the end of the 20th century, Missouri still had a major  electronics assembly operation. Zenith Electronics--the…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690533/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Laurel Lee", "party": "Republican", "sentence": "…power, water, communications, transportation  services, and other foundational systems relied upon by millions of  Americans every day.\n\nTheir operations have shown a clear pattern. They look for ways to  enter sensitive environments. They work to remain there as long as  possible. They study the systems they infiltrate so that their presence  blends…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696758/strengthening-cyber-resilience-against-state-sponsored-threats-act"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…any unauthorized hacker or other intruder into a mobile       service network; and\n\n(B) any foreign government or foreign nongovernment person       engaged in a long-term pattern or serious instances of       conduct significantly adverse to the national security of the       United States or security and safety of United States       persons.\n\n(2)…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693423/understanding-cybersecurity-of-mobile-networks-act"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…Speaker, I rise today alongside four of my esteemed  colleagues to both highlight and condemn the misuse of taxpayer dollars  funneled to illegal immigrants.\n\nAn outrageous pattern of perverse and intentional incentives reveal  deliberate efforts to worsen the border crisis and to allow tens of  millions of illegal aliens to invade our Nation at direct…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690711/outrageous-government-funded-incentives"}]