[{"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…research? So that people like Elon Musk don't have to pay their  fair share. Why are they withholding funding to find a cure for  Alzheimer's disease? So big corporations can pay less in taxes than the  average American family. The cuts we are seeing right now will damage  Americans' lives for the next generation--all so the wealthiest  Americans can get wealthier.…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688264/national-institutes-of-health"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…leadership of Hakeem Jeffries, that is what you  will see, an across-the-board increase, a tax cut proposal for people  who have to work out of necessity who would end up having to pay taxes  on their Social Security. We pay for it to make sure that it doesn't  impact the trust fund.\n\nWe also pay for the repeal of WEP and GPO because that is vitally  important…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690206/republicans-plan-to-cut-social-security"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…make them work better for our families. Instead of gutting healthcare  and Medicaid and food assistance in our public school system, Congress  should make the ultrarich pay more taxes and make these programs work  better for the people.\n\nMr. Speaker, 60 percent of working families are living paycheck to  paycheck. Working families are worried about paying…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690549/dte-rate-increase"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…including an immune disorder, a blood disorder, and a spinal  condition.\n\nAlicia and her family didn't ask for this. Nothing they did caused  this. They work hard. They pay their taxes. They love their daughter  fiercely. They simply cannot afford the care that she needs without  Medicaid.\n\nMedicaid is what allows Alicia's daughter to go to school, to…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691465/gop-tax-scam-hurts-women-and-families"}, {"senator": "Greg Landsman", "party": "Democrat", "sentence": "…overhaul our tax code so that hard work pays off for every American.\n\nFixing the tax code does two things. One, it will ensure that the  superwealthy and big corporations pay all their taxes just like the  rest of us, and two, it will generate trillions of dollars that will be  invested back in the American people. There will be trillions to help  people…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699242/restoring-election-integrity"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…chapter 7 bankruptcy, an individual debtor who has  fallen on hard times, rather than go to debtor prison, which was the  old-school method, can settle his or her debts, pay off back taxes,  stop further collection actions, and secure a fresh start.\n\nThe process is means-tested, so it is available only for those who  really need it, and it often comes with…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698846/bankruptcy-administration-improvement-act-of-2025"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…campaign  promise to help tipped workers. What good is no tax on tips if you have  to give those tips directly to your boss so that they can take it out  of your base pay?\n\nWhen someone pays taxes, they at least get something in return. Like  many Americans, I do not think that the average person sees the benefit  that they really should for what they pay…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698963/tipped-employee-protection-act"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…Trump's inauguration. You  saw those billionaires accompanying him. Why are all the billionaires  getting together? They are getting together because they don't want to  pay more taxes. They want to get rid of employees who are providing all  kinds of services to the constituents of this country in order for the  richest people in the country to pay less…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689953/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…principled leader on this issue with  respect to tariffs.\n\nMr. Speaker, again, I am not going to dispute my colleague from  Wisconsin's sentiment here. If people are looking to not pay taxes on  tasers, he has them covered. The Republican Conference has them  covered.\n\nIf people are struggling to pay for their groceries or their rent,  they are out of luck as…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699903/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…unlawful.\n\nThough undocumented families and small businesses were explicitly  encouraged for decades by government and legal counsel to come forward  out of the darkness and pay their taxes through their ITIN number, the  Trump administration is now trying to target this data to carry out his  mass deportation plan.\n\nThis is not just an immigration issue;…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690851/opposing-illegal-power-grabs"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…healthcare will come up for those least  able to afford it. Healthcare workers would lose their jobs. Millions  could lose coverage. And for what? So billionaires can pay less in  taxes. It is a revolting--thoroughly revolting--agenda.\n\nDemocrats will vehemently oppose this bill and all the harmful  elements of the Republican agenda at every opportunity.…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690192/business-before-the-senate"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…eligible citizens when the world is evolving around us?\n\nWe live in modern times, and so many of our lives happen online for  daily activities. We can pay our bills and we can pay our taxes online.  You can apply for college, a car, a home, and everything else online.\n\nFor this reason, at the appropriate time, I will offer a motion to  recommit  this bill…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690011/safeguard-american-voter-eligibility-act"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…know their spin is a lie, and the truth is they have no       problem taking health care away from millions of Americans so       that the rich can get richer and pay less in taxes than they       already do.''\n\nYou see--stepping away from this--they are saying we are going to  make these cuts to balance the budget, but their budget blows a bigger…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…the summer programs in our national parks.\n\nMy Republican colleagues will give $3.5 trillion in tax breaks to the  superwealthy and to very large corporations, who often pay no taxes at  all. In all of this, the majority will add trillions to our national  debt.\n\nDemocrats have a different vision. It is a vision rooted in fairness  and rooted in the…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688233/democratic-proposals"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…Carolina, who walked 9.5 miles to school every  day, no bus. The White kids had buses and they had to walk. Why?  Because the superintendent of education said that yours don't pay  enough taxes for buses. That is what we have been trying to get over in  this country. That is why we had Brown v. Board of Education, which  started in that little town of Summerton,…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689638/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…only at the rate  that Republicans established in 2017. We actually boosted it for this  new approach. It is now considered permanent policy, meaning that  families will pay no taxes on the first $31,500 of what they make.\n\nIt will also save Americans an estimated 210 million hours per year  in paperwork and $13 billion in compliance costs annually.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699706/historic-tax-relief-for-families"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…cuts and built upon it.\n\nLet's talk about individuals. The individual who lives on their  Social Security will have more money in their pocket because they won't  have to pay taxes on that--we exempt taxes--or the waitress in Glasgow,  Kentucky, who won't have to pay taxes on her tips; or the farmers in  Owensboro who will be able to pass their family…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694788/promises-made-promises-kept"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…are not required to explain the error or notify taxpayers  of their right to appeal within 60 days. What is worse, if taxpayers  don't comply, they could be forced to pay more in taxes.\n\nThis bill before us, H.R. 998, the Internal Revenue Service Math and  Taxpayer Help Act, will level the playing field for taxpayers by  requiring the IRS to explain…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689359/internal-revenue-service-math-and-taxpayer-help-act"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…government, is it worth  being away from my family?\n\nWe say, you know what? Yeah, normal tax rates apply on everything  else, but if you work overtime, you are not going to pay taxes on that  overtime. This is somebody making $60,000 a year, not the billionaire.  If you say ``billionaire'' enough, maybe that shift worker won't know  what you are doing,…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693191/one-big-beautiful-bill-act"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…my son, who is 18, and  who is now getting tips. He is working tables at Mac and Bob's  Restaurant, and he is getting tips.\n\nGuess what, Mr. Speaker?\n\nHe won't have to pay income taxes on that. Now, maybe he is at a  point where his money wouldn't be high enough that he would pay those  taxes anyway, but for those families who rely on that tip money…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697302/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…finally start--not to finish, just the beginning--getting control over  spending and respecting those families who are working hard, who are  working two shifts at the diner to pay taxes on tips that will soon go  away if our One Big Beautiful Bill Act passes, or somebody who is  working overtime because you want to send your kid to college and you  find…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692544/rescissions-act-of-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…taxes. There are only a few States right now that have over 50 cent gas  taxes, so I figured that that is a good maximum, that no State should  be able to force its citizens to pay taxes of more than 50 cents a  gallon for gasoline. This will immediately save California drivers 21  cents a gallon and will prevent the tax from continuing to be raised by  State…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700046/legislative-calendar-days"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…hundred years before our Revolutionary War, in the English Civil  War, there was a debate over parliamentary supremacy versus supremacy  of the King. They did not want to pay taxes that weren't approved by  the Parliament.\n\nIn 1683, the New York Charter on Liberties, the beginning charter for  the colony of New York stated:\n\nNo taxation without representation.…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689478/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…$150 million out of the  police budget, leaving the Austin Police stranded, unable to do their  job and the people of Austin unable to get the services that they  deserve and pay taxes for, while their streets are made more violent  and while criminals are allowed to roam free under the very  aforementioned Soros DAs that refused to prosecute the criminals.…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691169/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…communities, and the heartbeat of Main Street America.\n\nFar too often, as we have seen, they have been overlooked,  underserved, and, frankly, undermined by the very government they pay  taxes to support. Federal agencies are simply not doing enough to open  the door for small businesses to compete. Mr. Speaker, this must  change.\n\nTo do that, I am proud to co-lead…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691762/transparency-and-predictability-in-small-business-opportunities-act"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…Washington Post, hardly a conservative enclave, for their clearly false  facts about the Trump tax cuts.\n\nDemocrats said they were targeted toward the rich and corporations  that pay no taxes, but we factually know that the share of taxes paid  by the top 1 percent of earners actually reached new heights, Mr.  Speaker, after President Trump's tax cuts went into…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689862/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…there is a difference here.\n\nWhat the President is trying to do is make government more efficient.  The argument I am hearing here, and I think the people who work hard  and pay taxes are hearing, there is not a single government agency that  is at any time inefficient. Every single Federal employee is at 100  percent efficiency and doesn't need to be…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697996/protect-americas-workforce-act"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…very  people in our Nation who are building and producing everything that we  need. They are strangling the people who create jobs, who produce the  products, the food, who pay taxes, who employ people. People make our  communities strong. We need to stop doing that. We need to correct  course in our approach for government and regulations.\n\nOur Republican…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689195/work-highlights-of-western-caucus"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…illegally.  That is a substantial amount of money, and we  will never get it back. Again, it rewards bad behavior.\n\nHow the system works is very frustrating. Mr. Speaker, if you pay  taxes in America, you are paying for illegal immigrants to get  healthcare, whether you like it or not. Federal law requires Medicaid  to cover emergency healthcare, period. That…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690712/outrageous-government-funded-incentives"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…find a job and provide for your family  because the deals made in the Halls of Congress always stick the  taxpayers with the bill. You either are going to have to pay for it  through taxes--the debt will always be paid either through taxes or  through inflation and high prices at the grocery store.\n\nGovernment spending and fiscal malfeasance have not…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695544/setting-forth-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2026-and-setting-forth-the-appropriate-budgetary-levels"}]