[{"senator": "Jacky Rosen", "party": "Democrat", "sentence": "…taxes on tipped wages.\n\nFor so many service and hospitality workers, tips aren't extra; it is  part of their income that they use to make ends meet. Tips are how  Nevadans pay their rent, cover their groceries, take care of their  families, their kids.\n\nAnd Nevada has more tipped workers per capita than any other State.  So this bill would mean immediate…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691423/no-tax-on-tips-act"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…their housing costs  increase, whether it is rent or mortgage, their energy bills increase,  childcare increase. A lot of folks are facing the prospect that they  cannot pay their rent and their health insurance, so they are playing  the lottery, figuratively: The lottery that they won't get sick or the  lottery they won't get injured. When they do, whether…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698225/healthcare-affordability-crisis"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…about preferential treatment for oligarchs like  Meta and Amazon.\n\nConsider this: When telecom companies want to access our national  forests for one of these projects, they pay rent. When they cross  national parks, they pay fees, but somehow marine sanctuaries are  supposed to be free. That is nothing more than a corporate giveaway and  a terrible precedent…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699959/undersea-cable-protection-act-of-2025"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…American history. While  House Republicans gave themselves a paid, 2-month vacation, hundreds of  thousands of Federal employees were left wondering how they were going  to pay their rent or mortgage, and 42 million Americans nearly lost  their food assistance.\n\nWhat was the Trump administration doing? Instead of working with  Congress to end the shutdown…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697150/denouncing-the-horrors-of-socialism"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…people who we are talking about tonight in every  congressional district who cannot handle these cuts. It is as simple as  that.\n\nThe reality is that Americans can't pay for their rent right now.  They can't pay for their groceries. They are too high. Prescription  drug prices are too high. Costs for consumers and small businesses are  just going to…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691416/gop-tax-scam-hurts-everyone"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…can tell them if there is going to be a new 30- or  even 50-percent tax on their materials come Friday?\n\nHow can a family already struggling with high costs continue to pay  the rent and put food on the table if their household expenses are  going up $2,400 this year? And now, on Friday, the administration is  planning to make the goods businesses and…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694454/9999"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…those families are sitting around their kitchen tables  trying to figure out how to pay for childcare so they can get to work.  They are trying to figure out how they can pay their rent so their kids  have a safe place to grow up. They are trying to figure out how they  can afford groceries amid skyrocketing costs.\n\nBecause of the stalling and hesitation…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698593/providing-for-consideration-of-hr-breaking-the-gridlock-act"}, {"senator": "Joaquin Castro", "party": "Democrat", "sentence": "…against Greenland, Colombia, Cuba, Mexico,  and Panama; and he has threatened to keep sidestepping Congress if you  will let him.\n\nAt a time when Americans are struggling to pay for rent, groceries,  and childcare, they don't want us to spend billions in Venezuela. They  would rather we spend that money here.\n\nBut somebody is getting rich.\n\nMr. CASTRO of…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699362/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…King. The people need a President for  all of the people--not a $20 billion bailout for Argentina, not a new  White House gold ballroom when people can't even afford to pay their  rent or to buy a home on their own--and not a Justice Department  bailout--all while November 1 is fast approaching and tens of millions  of Americans face this healthcare…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…to see the dentist. She reached out to me to share  that without Medicaid, her entire paycheck would go to just keeping her  children healthy--with nothing left over to pay for rent or keep food  on the table.\n\nI heard from Shelley in Lake Holcombe, WI, who reached out to me  about her 17-year-old daughter Chloe. Chloe was diagnosed with leukemia  last…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689511/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…it by calling it all a  giant hoax. But Americans know affordability is not a hoax. They see it  as very real every time they go to the grocery store, pay their bills,  pay their rent. And Donald Trump just doesn't get it.\n\nWhat was Donald Trump's solution to affordability? Well, last night,  Trump said parents should buy their kids fewer dolls for Christmas.…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697816/affordability"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…not getting a check [that] I stayed up to the early morning       hours, to make sure it was in my account. Thanks to Trump and       Musk, I worry if I will be able to pay my rent every month.       Since Trump has been in office, it's been extremely       stressful.\n\nYes, that is the stress people are feeling about whether or not they  will have…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690633/nomination-of-frank-bisignano"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…take on America's energy bills. A recent analysis found that  Trump's tariffs will cost your average American family $2,300 each  year. That is $2,300 that families need to pay rent, to buy groceries,  and to afford clothes and school supplies for their kids. Trump decided  to make everything more expensive, even the energy we buy.\n\nThe inconvenient truth…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695693/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…living with them who might  have dementia demands care. So the family member who is caring for them  has to decide, Oh, my God. Am I going to give up my job, which I need  to pay the rent? Am I going to stay home to take care of them or go to  the job and let really difficult things happen? This is the thing that  the leader is pointing out that, I think,…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…credits that have made quality health insurance something she could  actually afford.\n\nThose credits lowered her monthly premium enough so that she could  manage her health, pay her rent, and keep her small business going.  However, now she is being told that if these enhanced credits expire,  her premium could double.\n\nWhen she found out that her healthcare…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697649/restoring-enhanced-premium-tax-credits"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…Americans.  It is seniors who rely on Social Security; they are going to be  impacted. People living on a fixed income; they budget down to the last  dollar. They need to pay for rent; they need to pay for groceries; they  need to pay for prescriptions. Democrats don't seem to worry about  that. Oh, they say they can wait.\n\nBecause a Democrat shutdown…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695529/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…operators outside the door of  houses. The one ring to rule them all, the massive amount of power, was  your access to your own money. You can't even buy groceries. You can't  pay rent. You have no means of payment.\n\nThat is why it is essential that we protect the power to transact and  protect privacy so that it really has the same kind of characteristics…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693006/central-bank-digital-currency"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…all the property is owned by the government. Right  now, my office is in a place called Fond du Lac, Wisconsin. If I want  to live in Fond du Lac, Wisconsin, first of all, I pay rent. I am  guessing that in Fond du Lac, Wisconsin, there are maybe 400 different  landlords. The landlords compete for the rental dollar.\n\nI have the ability to buy my own house,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695628/breakdown-of-traditional-families"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…sessions  between April 2021 and March 2023.\n\nThis wasn't emergency aid. It was five-star treatment funded by  hardworking American families, families that are struggling to pay  their own rent and put food on their own table, much less providing  themselves with music, plant, and pet therapy.\n\nI know many taxpaying American families who would love to be able…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690710/outrageous-government-funded-incentives"}]