[{"senator": "Al Green", "party": "Democrat", "sentence": "…fearful of what can happen to them  and they are fearful that if they are not careful, they can be picked  up, taken away to another country without due process.\n\nPeople are paying attention. If you can do this to one person, why  can't you do it to another? It looks like you are trying to get a  certain group of people out of the country.\n\nIf you need some…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690560/a-message-to-the-cabinet"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…with more rural areas and  already more vulnerable rural hospitals, chances are their constituents  are going to hurt even more.\n\nI sure hope that people out there are paying attention. Call the  people who represent you. Tell them what your fears are. I know people  are calling me, and I am standing up here to appeal to my Republican  colleagues and…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691419/gop-tax-scam-hurts-everyone"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…threat.  Only they will decide who can speak and who will be silenced.\n\nIf anyone thinks they are safe just because it is happening to  someone else this time, they are not paying attention to history.  Donald Trump and his cronies have attacked anyone, including rightwing  media and politicians, simply for questioning them.\n\nThe point for Trump is not to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695733/why-i-came-to-congress"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…Musk, President Trump, and their billionaire buddies.\n\nI am joining every Democrat in the House and Senate in opposing this  resolution.\n\nApparently, Republicans weren't paying attention when Americans  across the country took to the streets last weekend to tell them to  keep their hands off our healthcare, our education, and food assistance  for our children,…", "date": "2025-04-14", "source_url": "https://justfacts.votesmart.org/public-statement/1690119/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…are other parts of the United  States that are seeing the same thing.\n\nHopefully, all of this data is being released to individuals, and  hopefully, our colleagues are paying attention to this because it is  showing what premium increases look like, but a couple in the State of  Alabama--I am sorry, a single woman in Alabama making $65,000 a year  could…", "date": "2025-10-30", "source_url": "https://justfacts.votesmart.org/public-statement/1696494/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…costs. On the campaign trail, they repeatedly promised to lower  costs and lower inflation, but, again, none of their actions line up  with their promises.\n\nIf you are paying attention to energy load growth in this country,  you know that, in addition to increasing generation, we have to  incorporate ways of reducing energy demand. Energy conservation…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688293/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…the floor  of this body right before a midterm election. The debate and vote  occurred in October of 2022.\n\nI remember--at the time, I was Lieutenant Governor, and I was paying  attention to this, and I thought, what is the urgency about this debate  in October of 2022 right before a midterm election?\n\nYou might remember that the United States didn't even…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693124/motion-to-discharge-sj-res-59"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…major pieces  of that, the Affordable Care Act enhanced premium tax credits. It is up  to the Senate Republicans now.\n\nHello, where are you, Senate Republicans? Are you paying attention?  It is in your House. You have the opportunity to save this system,  Senate Republicans. I know that Senate Democrats are already on board.  They want to do this. Let's…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698666/protecting-healthcare-for-millions-of-americans"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…idea of reducing costs on day one,  which Donald Trump promised in the campaign and many people voted for  because of that promise, is out the window. No one is even paying any  attention to it. Donald Trump really is not paying attention to it.\n\nPeople don't believe it anymore. They don't believe any of the  promises that Donald Trump has made. Donald…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698199/new-york"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…passed last December but  for Elon Musk.\n\nThis bill is important. I know that back in Asbury Park, in  particular, they will be very happy to know that our Congress is paying  so much attention to American music tourism.\n\nMr. Speaker, I ask for support on both sides of the aisle for the  legislation, and I yield back the balance of my time.", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690270/american-music-tourism-act-of-2025"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…on the nonbinding resolution in case Donald Trump  gets slightly offended. They don't even want the vote on the nonbinding  resolution tonight.\n\nNow, the President is paying attention--not just because his favorite  Congressman   Thomas Massie is involved--and he directs the Attorney  General Pam Bondi to ask the courts to release the grand jury  testimony.…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693720/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…shameful that they are moving forward at 1 a.m. in the morning,  tonight, in the dead of night.\n\nWhy? They are doing that because they hope we are asleep. They don't  want us paying attention. They don't want us to know what they are, in  fact, truly doing. They hope we are not watching, and they hope no one  notices until it is too late.\n\nTexans are paying…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691436/republican-budget-bill"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…America's response to this known danger. This web of denial, of fraud,  of corruption costs American lives, and it costs Americans money, too.\n\nBy the way, voters are paying attention. A December poll found that  65 percent of American voters understand that climate change is  increasing their cost of living. And we know that to be true. As  chairman…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698993/unanimous-consent-request-s-res-550"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…Currency rescinded this very rule last week when it issued an interim  final rule that took effect on May 15.\n\nI am not surprised that my Republican colleagues weren't paying  attention to this development, or maybe they were. Maybe they think  that it was something that Trump had said to Elon Musk: Go get it done,  an executive order. Maybe they felt…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691499/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…imagine that, Democrats and Republicans in this Chamber,  in this town, wanting to do something about corruption. That is a good  thing. I hope the American people are paying attention.\n\nI will tell you it is clear from conversations with my constituents  in western Pennsylvania, and I know from people all over this country,  they think our system is…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691217/stock-trading-ban-for-members-of-congress"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…then-Presidential candidate Donald Trump came  down and spent time in Livingston Parish after this flood to call  attention to it because he felt as if President Obama was not paying  attention. President Trump came with Vice President nominee Pence,  spent time there, brought hope to the people, and that is when, in  2018--I am sure part of his motivation was…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690105/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…receipts  just covered interest. If interest rates went up 1 percent, Mr.  Speaker, 1 percent, in 2034, then 45 percent of all U.S. tax receipts  pay interest.\n\nAre we paying attention?\n\nYet, the first words I will get from my brothers and sisters on the  left are: Well, just raise taxes.\n\nI will show over and over here, Mr. Speaker, that if you look…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693062/stop-bathing-in-folklore-and-start-bathing-in-math"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…up in armed conflict with  horrific opponents like Hamas, but for psychological reasons they side  with Hamas.\n\nThose are some of the issues that I think we ought to be paying  attention to over the weekend. I think I have used up enough of my  time.", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690921/big-beautiful-bill"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…done?\n\nDe facto, this is a regulation on the Nation as a whole. De facto,  this decision by the EPA is a regulation on the entire Nation.\n\nThat is why this Congress is paying attention to its own  responsibilities and not listening to the bureaucrats and other  unelected officials. We must make a decision and vote to pass H.J. Res.  87.\n\nIt is important…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690474/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…of Congress has read every word  of it because it is really important. There is a chart in here that if  you actually read the footnotes--now, look, for anyone that is paying  attention, I am trying to bring Medicare Advantage back where the  incentives actually are about helping populations be healthier and not  about risk scoring them that--it is a…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694131/dismantling-californias-citizens-redistricting-commission"}, {"senator": "Steve Daines", "party": "Republican", "sentence": "…is absolutely not true. What we are doing today is  righting a wrong--something the Biden administration slipped in after  the election.\n\nWe are grateful that we were paying attention, and we are going to  right this wrong--a midnight Biden rule that was issued without the  support from the State of Montana. Talk about Federal bureaucratic  overreach.…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696095/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…either 12 or 13 countries can sell a 10-year  bond cheaper than the United States. Greece today can sell a 10-year  bond cheaper than the United States.\n\nIf any of you are paying attention, remember there is this concept of  interest fragility. One of our greatest threats to this country is our  ability to finance this debt. Today, both the 20-year and 30-year…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691518/truth-telling-with-math-and-facts"}, {"senator": "Michael McCaul", "party": "Republican", "sentence": "…founded the Childhood Cancer Caucus  because I saw that children with cancer did not have a voice here in  Washington. We cared about adult treatments, but no one was paying  attention to the precious children who are battling this heartbreaking  disease. In fact, they called it rare orphan diseases.\n\nSince then, we have made a change for the better,…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697274/mikaela-naylon-give-kids-a-chance-act"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…know  about other States--in charges if they have to deal with a criminal  penalty. $50 from the merchant, and they are worrying about a $5 to $35  fee. Yet, they are not paying attention to the real harm. That is it.\n\nWe have heard lots of arguments on all the issues included in this  rule, and so I think it is important that we pass it. I urge everyone…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689405/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…curse enough and if they say ``billionaires'' enough, those  families will forget what is actually happening. Those families are not  going to forget because they are paying attention.\n\nDo you know what the average pay for a worker in America who makes  tip money is under this bill? It is $32,000 a year. That is right.  Billionaires aren't even allowed…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693191/one-big-beautiful-bill-act"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…President claims is punishable by  death.\n\nMany of my colleagues have said: Pay no attention to what the  President says; pay attention to what he does.\n\nI will say: I am paying attention to what he is doing because, in  addition to a steady stream of late-night rants on social media, we  have seen actions--actions--by Federal Agencies: investigations,…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699917/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Eric Burlison", "party": "Republican", "sentence": "…the core engine, we are not getting  anywhere.\n\nMr. BURLISON. Absolutely. I mean, when you give the choice back to  the people, suddenly the doctors are going to start paying attention,  as well.\n\nMr. BURLISON. They are going to--when people ask, what does this  cost? They are going to have to answer for it right then and there.\n\nIf they can't answer…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698105/bringing-america-back-to-its-roots"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…it says is no crime got committed.\n\nNow, can we talk about whether or not there was an overrun in the  building? There may have been. But I don't know if everybody is paying  attention, but that happens a lot in government. If we are going to  actually accuse someone of criminal behavior because of a project  overrun in Federal Government, we had better…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700062/9999"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…similar.\n\nI am sure all the committees, all the leadership, all the folks who  are helping us watch the bond market and the liquidity and our ability  to borrow are all paying attention to the bleed rate, but it is math.  It is real.\n\nMr. Speaker, our debt to GDP when we closed the '25 fiscal year  actually got slightly better, but we also rolled some…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697051/facing-fiscal-reality"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…of crooks.\n\nNow let's talk about me and enrichment. The Democratic majority  leader, Senator Schumer, signed off on this. I want the world to know-- and the world is paying no attention because it is blowing up right  now--that this provision was coordinated between Senators Thune and  Schumer because a lot of people worried that if they can do it to…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699105/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}]