[{"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…will shut down rural television and radio stations, cutting  off coverage of local news, eliminating emergency information like  severe weather alerts, jeopardizing access to PBS KIDS, children's  programs like Sesame Street--yes, Sesame Street.\n\nThis bill rips lifesaving support away from hungry, displaced, and  sick people in developing countries and…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693721/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Laura Gillen", "party": "Democrat", "sentence": "…2003, PEPFAR has saved 26 million lives  and enabled 8 million babies to be born without HIV infection.\n\nThis package also threatens funding to public broadcasting like NPR  and PBS which educate, inform, and enrich the lives of Americans.\n\nThe American people have been clear that they want Congress to lower  costs and make life easier for working families.…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692564/rescission-package"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…failures at  the Pentagon. What Hegseth did there was horrible. It means pushing  back against attacks on Social Security. It means resisting the  defunding of public resources like PBS. It means exposing the chilling  arrests of Americans without due process.\n\nDay after day after day, we will hammer home the Republican agenda,  and Americans will see the difference…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690192/business-before-the-senate"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…the arts, culture, and public knowledge in America by Trump  and Republicans in this Congress.\n\nThe administration has made it clear: They are not just trying to  defund NPR, PBS, or make changes to the Library of Congress, they are  trying to dismantle every institution that informs, educates, and  inspires the American people.\n\nFrom Sesame Street to…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691316/republicans-assault-on-american-arts-culture-and-public-knowledge"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…money for tax cuts for their billionaire  donors.\n\nIt is important for people to understand that television is changing.  More and more content is being put behind paywalls, and PBS is one of  the only sources of children's educational television that is still  accessible to every child for free.\n\nStudies show that kids who grow up watching PBS get better…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692007/cuts-to-public-broadcasting"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…employees and dismantling Federal agencies, and they are here running a  resolution on refrigerators.\n\nMeanwhile, tomorrow, Republicans are going to hold a hearing and haul  NPR and PBS in front of Congress to try to undermine the media just  like they did here on this floor just a few moments ago as they are  kicking the media out of the Pentagon and the White…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689053/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers-providing-for-consideration-of-hr-defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…unravels. Why, they ask, why? They plead for help. They ask  us to do something.\n\nI want to read some articles, coming from a variety of backgrounds-- but perhaps this one from PBS, ``A closer look at who relies on  Medicaid.''\n\nThis is what PBS wrote:\n\nAs congressional Republicans seek about $4.5 trillion to       extend expiring tax cuts, the Federal…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…over $7.6 million in funding-- with a disproportionate effect for rural and Tribal communities across  the State. News organizations like Colorado Public Radio, Rocky  Mountains PBS, and smaller stations like KRZA in Alamosa and KVNF in  Paonia are at risk. Not only does CPB funding provide needed resources  for local outlets--the lifeblood of our democracy,…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693642/hr-4"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…fraud,  and abuse. This isn't trimming around the edges. This isn't the  teardrop in an ocean. This is all Federal funding for the Corporation  for Public Broadcasting, which is PBS, NPR, and local public television  and radio.\n\nThis is not just an attack, though, on PBS and NPR, as so many of my  Republican colleagues have said. The majority knows full…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692385/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…unethical, and  much of it is illegal.\n\nAt the same time, Ms. Greene's DOGE subcommittee, following the  example of Elon Musk in February, is calling for the defunding of NPR  and PBS. Yes, Elon and Marjorie Taylor Greene are trying to kill Elmo.  However, here is the thing: Public broadcasting receives just a tiny  fraction of funding compared to the government…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689221/pure-bait-and-switch"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…democracy and to accountability.\n\nHowever, we have seen attack after attack, threats on the media and  communications companies, outlets replaced in the Pentagon, an order  attacking PBS and NPR just this very week, and an attempt to throw the  AP out of the White House for daring to tell the truth.\n\nThese attacks are not just an outrage, they are an attack…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690908/a-free-press-is-vital-to-democracy"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…the  administration's efforts to dismantle a cornerstone of American speech,  our public media system.\n\nThe administration is calling on Congress to rescind appropriations  for PBS and NPR, two public media institutions that have served  Americans for nearly 60 years.\n\nEach month, 36 million people watch their local PBS stations. PBS  KIDS averages 15.5…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690520/election-integrity"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…include a $9 million cut to the President's Emergency Plan for  AIDS Relief, which has saved over 26 million lives. Additionally, cuts  at home include gutting $1.1 billion from PBS and NPR, silencing  trusted voices and educational content like Sesame Street.\n\nThese cuts are being celebrated as savings at the same time that the  majority is pushing their…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692398/rescissions-package"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…Speaker, you have the Corporation for Public Broadcasting  to thank.\n\nHowever, now Republicans are trying to take them down. Yes,  Republicans are trying to get rid of your favorite PBS stations, Mr.  Speaker. They are coming for Big Bird again.\n\nOur youngest constituents, our babies, have so much to lose if PBS is  gutted. PBS provides educational programs…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692233/corporation-for-public-broadcasting"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…Republicans are doing this at the same time they are  giving trillions of tax cuts to the rich. While they are at it, they  are also cutting educational programming for children, like PBS.\n\nWhy are they doing this? It is not to reduce the deficit because this  $9 billion is a fraction of a fraction of the tax cuts they are trying  to pass for billionaires. These…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692518/rescissions-act-of-2025"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…either understand that you are biased and need help,  apparently in the form of taxpayer grants, or you haven't witnessed any  bias. You can't have it both ways.\n\nThen there is PBS. Again, I honestly don't know where to begin. On  top of the concrete, statistically proven bias against conservatives,  Republicans, and the Trump administration, this is the…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692391/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…to roast marshmallows.\n\nThe fact of the matter is, if we can't make these cuts, which are as  simple and as easy as you would think--$6 million to fund media in  Gaza, funding PBS and NPR--even if it was a good idea, you can't do it  when you are borrowing trillions of dollars a year.\n\nIf we can't make these cuts, which should be the easiest imaginable…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692521/rescissions-act-of-2025"}, {"senator": "Ashley Hinson", "party": "Republican", "sentence": "…this package. Imagine being  able to redirect those dollars to veterans' care or specialty crop  programs in a State like mine.\n\nThis package also rescinds funds for NPR and PBS. For decades, public  broadcasting has not adhered to objectivity standards enshrined in law.  It has pushed biased narratives and forced inappropriate content on  children,…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692520/rescissions-act-of-2025"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…programs--some  which I just read--$1.1 billion from the Corporation of Public  Broadcasting. Taxpayers should not be forced to subsidize a leftwing  media operation like NPR and PBS. These cuts are more than symbolic.  Mr. Speaker, they are structural. They target woke U.N. handouts,  failing to keep the peacekeeping efforts, and Biden's DEI and climate…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692389/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…under the guise of necessary  foreign aid.\n\nIn addition to this, Congress continues to prop up the Corporation  for Public Broadcasting to promote public media stations like PBS and  NPR. Taxpayer dollars should not be used to promote a narrative that  demonizes one side of the aisle or another. Yet, that is exactly what  these media stations continue…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692496/rescissions-package-is-first-step"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…rescissions that the OMB Director, Russ Vought,  has been able to carry out, as well as impoundments.\n\nWe delivered on cutting the Federal spending that went to the badly  broken PBS and NPR. I would point out, for those who want to apologize,  NPR didn't utter a word. In my district, in Kerrville, Texas, on the  morning when the floods were underway, they…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697130/congress-is-back"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…States does not need  taxpayer-funded propaganda.\n\nMr. Speaker, we have the opportunity this week to rescind a billion  dollars that is in the pipeline right now for NPR and PBS, two outlets  that routinely spew anti-American and anti-Christian propaganda. They  sow racial division in this country, and they promote weird, woke  values that most Americans…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692310/ending-taxpayer-funded-propaganda"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…dollars should not be tolerated.\n\nI commend the $1 billion rescission to the Corporation for Public  Broadcasting. Taxpayer funding for woke media entities is absurd. NPR  and PBS already have a business model that doesn't need to rely on 150  million Americans' taxed income. It does not need to promote any  agenda, including their radical agenda, with…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692522/rescissions-act-of-2025"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…and say no to funding pet projects that put  America last, then what is the point of being called a Republican?\n\nMr. Speaker, I rise today to urge my colleagues to defund NPR, PBS,  and USAID. For decades, Republicans have campaigned on being fiscal  conservatives, but all we have to show for it is a national debt  skyrocketing toward $37 trillion.\n\nLet…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692534/rescissions-act-of-2025"}, {"senator": "Patrick Harrigan", "party": "Republican", "sentence": "…work for here in  Washington.\n\nWe are cutting $2.5 million for electric vehicles in Vietnam, $47,000  for transgender surgeries in Colombia, and nearly $10 billion for NPR,  PBS, and other bloated liberal pet projects that have no place in a  responsible budget.\n\nWashington acts like taxpayer dollars are theirs to waste, but they  are not. Every cent…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692549/rescissions-act-of-2025"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…say absolutely nothing.\n\nHere is the truth. If this rescissions package was not put forth and  passed by Congress, taxpayer dollars would still be funneled to  ideologues at PBS and NPR and taxpayer dollars would continue to be  funneled to all manner of foreign aid repositories that do not align  with the fiscal sensibilities and values of the American…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693717/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "…and equity  nonsense that mocks American values. Why are we bankrolling wokeism  abroad when ranchers and small business owners in my district are  struggling?\n\nH.R. 4 defunds PBS and NPR's biased media circus. For years,  taxpayers have been forced to subsidize a public media system that is  less about informing and more about indoctrinating.\n\nTo my…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692529/rescissions-act-of-2025"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "Adams, Douglas: PBS NewsHour; Adams, Jacob: THE DAILY       SIGNAL; Adams, Jonas: NATIONAL PUBLIC RADIO (NPR); Adams,       Kimberly: MARKETPLACE RADIO; Adams, Lori: FOX NEWS; Adkinson,       Nicholas:…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698150/members-entitled-to-admission-to-the-119th-congress-radio-and-television-correspondents-gallery"}]