[{"senator": "Al Green", "party": "Democrat", "sentence": "…refuse to allow coverups to go unnoticed. You are  going to see more protests, but I say to everybody: Make it a peaceful  protest. Do not protest in any way other than with peace in your mind  and your head and your heart.\n\nPeaceful protests. Peaceful protests can make a difference.\n\nIt made a difference for the farmers when they came here with  Tractorcade…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689201/and-still-i-rise-censured-but-not-silenced"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…local Democratic politics and community service.  John's legacy lives in all of the lives and communities that he  touched.\n\nMy heart goes out to his family, and may he rest in peace.                   Corruption and Controversy at Fannie Mae\n\nMr. SUBRAMANYAM. Madam Speaker, for decades, Fannie Mae has played a  critical role in supporting home buyers and…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697218/recognizing-bishop-michelle-c-thomas"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Faiths--Judaism, Christianity, and Islam--and his presence in our  Nation's capital is an opportunity to highlight the positive role  religious leaders of his stature bring to the cause of peace and  religious liberty.\n\nThe true peacemakers of history not only sought to reduce conflict  but also showed compassion toward those who persecuted them. Patriarch  Bartholomew…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695586/recognizing-the-spiritual-head-ecumenical-patriarch-bartholomew"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…brought us       to the light. For in every child who plants a tree, in every       soul who cares, In every word of hope and faith, we find you       standing there.\n\nRest now in peace, dear Jane Goodall, in earth you loved       and knew, You showed us how to live with grace, with courage       strong and true. And when the wind sings through the Gombe…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696844/the-ballad-of-jane-goodall"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…1997, Ecumenical Patriarch Batholomew was awarded the  Congressional Gold Medal ``in recognition of his outstanding and  enduring contributions to religious understanding and peace.'' That  same year, he decried pollution, deforestation, and climate change as  ``ecological sins.'' His All-Holiness' dedication to preserving our  planet for future generations…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695851/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…for  global health, clean water, food security, and democracy programs;  funding for UNICEF and the World Food Program; funding for diplomacy,  humanitarian aid, and for world peace, for Christ's sake.\n\nPeople think our foreign budget is some huge, massive thing. We are  talking about something that is 1 percent of our budget. So, please, do  not come…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692385/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…(first among  equals) in 1991, he has worked tirelessly to promote religious freedom  and human rights, foster cooperation and understanding among all people  of faith, convene peace conferences around the globe, and call all of  us to care for and preserve the environment we all share and will pass  to our children and our children's children. His personal…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695860/recognizing-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…the President's article II powers as  Commander in Chief, but article II is not a blank check. The Framers of  our Constitution deliberately separated the powers of war and peace  between the branches.\n\nJames Madison warned:\n\nThe executive is the branch most prone to war; therefore       the Constitution has, with studied care, vested that power in…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696129/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "…worldwide and the  longest-serving Archbishop of Constantinople in the Church's two- thousand-year history, His All-Holiness distinguishes himself as a  global advocate for peace, reconciliation, and religious freedom.\n\nElected in 1991, Bartholomew leads efforts to unify the Orthodox  Church and other faiths across national and cultural boundaries.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695503/welcoming-ecumenical-patriarch-bartholomew-to-washington-dc"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…to come. She was always present. She always cared. She  took her family's experience and moved it into the highest levels of  lawmaking in the State of Ohio.\n\nMay she rest in peace, and may her courage, her grit, and her fierce  dedication inspire us all. We miss her, and we know that her work in  Ohio has made a difference in the lives of our 12 million…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694099/trumps-reckless-tariff-policies"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…of Sheriff John Bowens be a beacon to those who follow:  a call to serve without expectation of fame, to lead with humility, and  to love without reservation. May he rest in peace, and may his memory  be a blessing to us all.", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699826/in-memory-of-sheriff-john-bowens"}, {"senator": "Raja Krishnamoorthi", "party": "Democrat", "sentence": "…2025, as World Meditation Day, which has been designated  by the United Nations to celebrate the growing recognition of  meditation as a practical tool for mental well-being and peace.\n\nThis observance will culminate in a global moment of stillness at  10:00 a.m. Eastern Time, when events across Illinois, throughout the  United States, and around the world…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698204/recognizing-december-2025-as-world-meditation-day"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…and intelligence sharing that Ukraine relies on  to defend itself from Russia's onslaught. Such a pause undoubtedly cost  Ukrainian lives.\n\nTrump has stated that Putin wants peace in Ukraine. Surely he can't  believe this. Putin has failed to uphold any cease-fire agreement,  including those struck with the United States of America. Dictator  Putin doesn't…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691084/liberty-versus-dictatorship"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…here, and it breaks my heart that  their lives were cut so short from this disgusting act of cruelty.\n\nLet us keep them and their families in our thoughts. May they rest in  peace.", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692058/in-memory-of-officers-samuel-riveros-and-darius-wong"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…sooner than later, members of Congress will       need to face up to the horrendous realities about       intercontinental ballistic missiles. They won't do that       unless peace, arms-control, and disarmament groups go far       beyond the current limits of congressional discourse--and       start emphasizing, on Capitol Hill and at the grassroots,…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693757/marking-80-years-after-trinity-the-dangers-of-nuclear-war-have-never-been-higher"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…distinguished leaders, and  representatives from various faith communities. These meetings provide  a wonderful opportunity to discuss ways to promote our shared values of  faith, peace, and understanding. I hope these meetings will prove to be  productive and insightful for all involved.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695423/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…worth  of semiconductors to Russia, including for use in missiles and drones.\n\nThe CCP's actions are blatant violations of U.S. export controls and  detrimental to our ongoing peace efforts. China's economic and  industrial support for Russia is a critical lifeline for the Russian  military.\n\nThis is why it is critical that Congress pass the Economic Espionage…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690679/economic-espionage-prevention-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…against that aggression and stood for  freedom and as a beacon of hope around the world. I think we can learn  from that era, as I learned from Diana, about doing things with peace  through strength.\n\nI will miss Diana, and she will be remembered for her fierce  patriotism and her strong convictions. She was feisty. She was  committed. She loved her country.…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690594/fiscal-responsibility"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…The Hispanic American Police Command Officers Association,  the Federal Law Enforcement Officers Association, the Fraternal Order  of Police, Major County Sheriffs of America, Peace Officers Research  Association of California, and so many others.\n\nYou can ask every law enforcement officer on the streets of America  whether they want this to move forward…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700031/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…The National Security-Department of State measures  champion an America-first policy agenda. We replaced the weakness of  prior administrations by restoring President Trump's Peace Through  Strength agenda. National Security, Department of State, and Related  Programs Subcommittee Chairman Mario Diaz-Balart took decisive action  to reprioritize funding…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699054/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…that got it wrong. Israel is not going to  get it wrong the second time.\n\nDonald Trump. God bless President Donald J. Trump. I am so glad he  won. What has he tried to do? Make peace, not war. He gave the  Ayatollah 60 days to find a peaceful settlement regarding their  enrichment program. They could have nuclear power, but they can't  enrich. There are…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692780/iran"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…American Theater Medal, the Asiatic-Pacific Medal, the Philippine  Liberation Ribbon, and the Victory Medal. These honors reflect his  direct contribution to the global fight for peace and liberty during  one of the most defining conflicts of the 20th century.\n\nFollowing his military service, Lewis continued to embody the values  of duty, service, and community.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694998/recognizing-lewis-m-unterman"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "…on around the world today  is Vladimir Putin's war against freedom and the West in Ukraine.\n\nI would point out that for the past year, Vladimir Putin has mocked  the Ukraine peace process by steadily escalating his attacks on his  neighboring country. He has recently launched the  biggest air attack the conflict has ever seen and shown repeatedly that…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699095/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…the  legislature.''\n\nMadison would further state that ``in no part of the Constitution is  more wisdom to be found than in the clause which confides the question  of war and peace to the legislature, and not to the executive  [branch].''\n\nHamilton, who didn't always agree with Madison or Jefferson, wrote  that ``the Legislature can alone declare war,…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693121/motion-to-discharge-sj-res-59"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…are living in a time of growing  global unrest. China is accelerating its military buildup in the Indo- Pacific. While I remain hopeful that President Trump can help broker  peace between Presidents Putin and Zelenskyy, Russia's brutal war  against Ukraine grinds on. That is why it is more important than ever  that we invest in our servicemembers, protect…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695027/9999"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…partnerships with  25 local Pasco County organizations, RSVP Pasco connects volunteers to  critical areas of need. Volunteers support food pantries, like Our Lady  Queen of Peace, St. Vincent DePaul and Shady Hills Mission Chapel. They  work to ensure families in high-need areas receive essential resources.  At Good Samaritan Health Clinic, RSVP volunteers…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690139/recognizing-ann-wilkinson"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…States should do whatever it is able to do  to assist in the return of normal economic health in the world, without  which there can be no political stability and no assured peace.''\n\nAmerican security and stability depended on European security and  stability, not least because conflict with Nazi Germany was succeeded  immediately by the threat of conflict…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699111/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…environment, which has  been absolutely massacred under the mullahs.\n\nFinally, 10 of her 10-point plan, a nonnuclear Iran that is also  devoid of weapons of mass destruction: peace, coexistence, and  international and regional cooperation.\n\nMr. Speaker, I can't say it any better than what Maryam Rajavi has  said. This matters for even our security. It…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697723/free-iran"}, {"senator": "James Risch", "party": "Republican", "sentence": "…is one of our most important allies in the Western Pacific.       The strategic location of this political and economic power       contributes significantly to ensuring peace and economic       stability in the Western Pacific. It is vital to the U.S.       national interest to assist our ally in developing and       maintaining a strong and ready…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699396/arms-sales-notification"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…commitment to Israel or the  protection of the humanity of our Jewish neighbors here and around the  world. Now is the time to rededicate ourselves to the God-given right  to live in peace and safety of Jewish people both in Israel and across  the globe. We must condemn terrorism. We must condemn anti-Semitism,  and we must call it out for what it is: pure evil.…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692073/condemning-anti-semitism"}]