[{"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "Ms. TLAIB. Mr. Speaker, Republicans have to decide if they are going  to protect pedophiles or seek justice for survivors of sex trafficking  and abuse.\n\nI sat across from survivors--some of them were as young as 13 and 14  at the time--and they told us over and…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696833/epstein-remarks"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "…illegally canceled flights,  throwing the country into chaos.\n\nTrump and Republicans want to make Americans poorer and sicker, while  Trump builds his gilded ballrooms, protects pedophiles, pardons those  who buy his memecoins, and lets Americans starve. Shame on them. I am a  ``hell-no'' on this bill.", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696690/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…people deserve the  truth.\n\nTo every survivor watching, their courage is inspiring. They are the  reason why this vote is happening today. Protecting women and children  from pedophiles should not be a Democratic issue. It should not be a  Republican issue. It should be a human rights issue and a matter of  justice.\n\nMr. Speaker, I urge my colleagues to…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696813/epstein-files-transparency-act"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "Ms. JAYAPAL. Mr. Speaker, thousands of girls, children, were abused  by Jeffrey Epstein and his massive and powerful ring of pedophiles and  protectors of pedophiles. We can't say all their names here. We don't  have time. Let's at least bring a few of the courageous survivors and  their names onto the House…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696817/epstein-files-transparency-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…to sign on: Time is up,  you need to figure out where you stand on this because you are about to  go on record. Is your loyalty to Trump more important than going after  pedophiles? Make no mistake, these files will come out. It is no longer  a question of if, only when, and whether the White House chooses to  stand with the survivors or throw them…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696693/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…sure that one day, should they lose their hold on power, which  they will, they can be pardoned for their corruption.\n\nIt seems like Republicans love Trump and protecting pedophiles more  than they love America and children. It is shameful, and it is pitiful.  It is filthy, and we have to put an end to it.\n\nMr. Speaker, I urge my colleagues to vote ``yes''…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698443/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…of having Trump derangement syndrome. They suffer from  something much worse, which is pedophile protection syndrome.\n\nMr. Speaker, I ask my colleagues to stop protecting pedophiles.  Release the Epstein files. The victims deserve justice.", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696816/epstein-files-transparency-act"}, {"senator": "Ruben Gallego", "party": "Democrat", "sentence": "…of  people across this country, a conspiracy theory that caused people to  start doing shootings at pizza places, that accused other people and  other politicians of being pedophiles and then said and campaigned that  ``If you elect me, I will release the files.'' That was only one  campaign, and that was the Trump campaign.\n\nSo now, as he is in power,…", "date": "2025-07-24", "source_url": "https://justfacts.votesmart.org/public-statement/1694235/9999"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Republican Party that spent a  year propping up Trump's tariffs, which have driven costs through the  roof. We don't want to be saved by the people who continue covering up  for pedophiles in the Epstein files. America certainly doesn't want to  be saved by the same people who still can't get over losing the 2020  election so they are going to try to rig the…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699941/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…Republicans on the  Rules Committee blocked a vote on the bipartisan Massie-Khanna bill to  release the Epstein files. Covering up the files just protects the  criminal activity of pedophiles and the people who participated in  those heinous acts.\n\nEpstein told the young girls and women: I have the banks and I have  the government. You have no power.\n\nLet's prove…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695109/providing-for-consideration-of-hr-streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-and-providing-for-consideration-of-hr-stop-illegal-entry-act-of-2025"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "Ms. CROCKETT. Mr. Speaker, this is a distraction to take away from  the fact that the guardians of pedophiles is literally trying to  protect pedophiles. The President is a convicted felon and an accused  sex offender.\n\nStacey Plaskett hasn't been accused of either.\n\nWhat are we…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696889/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Katherine Clark", "party": "Democrat", "sentence": "…Speaker Johnson is calling this a show vote. He is calling it  dangerous. He is signaling the U.S. Senate to block it.\n\nRepublicans continue to use their power to shield rich pedophiles  from justice. If you can't stand up for these survivors, how can anyone  trust you to stand up for them?", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696821/epstein-files-transparency-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…pass--it is  impossible, however, to avoid problems with its politicization. One  colleague has offensively gone so far as to say that to oppose this  bill means you support pedophiles. Yet, I know good public servants,  former law enforcement, and former prosecutors who never knew Epstein  and never knew any visitors to his criminal enterprise who have…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696812/epstein-files-transparency-act"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…Speaker, today I want to talk about hypocrisy. Let  me be clear. I was a cosponsor of this very bill from the beginning,  from jump start, because we should never protect pedophiles.\n\nFor months, my Democratic colleagues have done what they think is  politically convenient through all the yelling, through all the tears,  and through all the sadness.…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696818/epstein-files-transparency-act"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…convictions was allowed to use the women's changing room by claiming he  was a woman. For 6 months, he exposed himself to women and kids. This  is who the left is defending today, pedophiles and men that want to go  in women's spaces and rape them, assault them, and expose themselves to  little girls and our daughters.\n\nIn California, a 17-year-old girl was terrorized…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695260/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…some aliens are convicted multiple  times but never removed from the United States.\n\nAs recently as last month, ICE arrested 118 illegal aliens in  California, including pedophiles, burglars, domestic abusers, and  serial drunk drivers. One of these offenders had four separate DUI  convictions, including one that caused bodily injury. He was also  convicted…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698979/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…increasing rate.\n\nDrugs, lethal drugs, fentanyl--more children meet their drug dealers  online.\n\nSexual exploitation, where our kids are meeting traffickers and  predators and pedophiles online.\n\nHuman trafficking; and the list goes on and on.\n\nThe reason for this negligence is simple. It is reprehensible.  Investing in children's safety would cut into the…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691286/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…focus on those who have a criminal  record and who pose a risk to the public. That is precisely what ICE  was doing in Los Angeles. Among those targeted were murderers,  pedophiles, and drug traffickers.\n\nIt should also be recognized that one of the reasons that some of  these people had to be sought out in the community is that the city of  Los Angeles…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693143/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Thomas Massie", "party": "Republican", "sentence": "…released  thousands, tens of thousands of documents. That is fine. Keep working.  How many names have they released? Zero.\n\nThey are still protecting, or the DOJ is protecting, pedophiles and  sex traffickers. The time for that to stop is now.\n\nOur Speaker says: Oh, this bill needs to be amended in the Senate,  and specifically, he is trying to create a loophole.…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696903/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision-providing-for-consideration-of-h-con-res-denouncing-the-horrors-of-socialism-providing-for-consideration-of-hr-unlocking-our-domestic-lng-potential-act-of-providing-for-consideration-of-hr-researching-efficient-federal-improvements-for-necessary-energy-refining-act-providing-for-consideration-of-hr-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-providing-for-consideration-of-hr-district-of-columbia-cash-bail-reform-act-of-and-for-other-purposes"}]