[{"senator": "Patty Murray", "party": "Democrat", "sentence": "…with disabilities who could see the IDEA Program upended,  cutting off support that State and local taxpayers will need to  provide.\n\nThere are 6.6 million students who get Pell grants to help them  afford college or enter the workforce or further their careers who  would be impacted by the chaos of abolishing the Department. And there  are 8.1 million…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688363/nomination-of-linda-mcmahon"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…intend to cut Medicare while making healthcare for the Americans more  expensive.\n\nMy Republican colleagues intend to cut student loan relief programs.  They intend to cut Pell grants that are crucial for keeping not only  students in schools but schools open all across communities of America,  particularly low-income communities.\n\nRepublicans will…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688233/democratic-proposals"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…education; ensuring protections and support for students with special  needs; defending the civil rights of tens of millions of students; and,  yes, managing the student loans and Pell grants that students need to  afford an education, just like I did when I was graduating from San  Fernando High School, trying to figure out how I was going to be able  to…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688250/nomination-of-linda-mcmahon"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…funding title I, increasing  funding for the Comprehensive Literacy Development State Grant Program  and for Innovative Approaches to Literacy grants.\n\nWe should double the Pell grant and restore its purchasing power so  students do not have to rely mostly on loans to pay for college.\n\nSadly, none of this is on Mrs. McMahon's agenda.\n\nI urge my colleagues…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688311/nomination-of-linda-mcmahon"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…even said that he hopes that Mrs. McMahon ``puts  herself out of a job.''\n\nThe Department of Education is responsible for distributing funds to  K-12 schools and administering Pell grants, the Federal Student Loan  Program, and programs that help support students with disabilities.  Already, the Trump administration has cut funding contracts within the…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688592/confirmation-of-linda-mcmahon"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…the 18th Congressional District by two military  parents who taught him about the values of hard work, of loyalty, and  of standing up for what is right.\n\nWith the help of a Pell grant, he was the first member in his family  to graduate from college. He graduated from UT San Antonio and then  went on to St. Louis to get a law degree from Washington University.…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699521/welcoming-the-honorable-christian-d-menefee-to-the-house-of-representatives"}, {"senator": "Alma Adams", "party": "Democrat", "sentence": "…because dismantling the Department of Education  is not just bad policy. It is dangerous for North Carolina's children.  In my State, more than 60 percent of students rely on Pell grants and  Federal aid to afford college. Nearly 1.5 million K-12 students depend  on title I IDEA school nutrition and other Federal supports.\n\nIn Charlotte-Mecklenburg, over…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698938/protecting-education-for-children-with-disabilities"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "Mr. DeSAULNIER. Mr. Speaker, on May 22, House Republicans passed  their budget bill, which would make major cuts to the Pell Grant  program in order to finance tax breaks for the ultra-wealthy. This will  be one of the largest transfers of multigenerational wealth in the  history of the country.…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693064/cuts-to-pell-grants"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…was greatly impressed with their knowledge of many important issues  and their sincere advocacy.\n\nWe discussed a variety of topics, including the significant cuts to  Federal Pell grants, the programs designed to help first-generation  college students.\n\nThey also shared their concern that Congress is not fulfilling its  constitutional responsibilities…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695393/recognizing-more-action-for-students-organization"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…low-income students, racial minorities, dealing with  achievement gaps, English as a Second Language, and students with  disabilities. On higher education, they deal with access, Pell grants,  and student loans. Some of the proponents of the elimination of the  Department of Education campaign on the slogan of `states' rights.' We  remember that campaign…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689643/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…retire.\n\nHowever, I know better, because I have seen what happens when we  invest in our kids. I have seen how a great teacher can change the  course of a life. I have seen how a Pell grant can lift up a family. I  have seen young people go from classrooms with broken chairs to  boardrooms and executive suites because someone believed in them.\n\nI have often…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689640/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…there is going to  be a country left, who don't even know if there will be educational  institutions left because this proposal includes $330 billion in cuts  that will impact Pell grants, Head Start, school lunches, and more.\n\nWe are talking about a $1 billion freeze for school-based mental  health. I don't know about you, but it seems like every single…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691088/big-backstabbing-bill"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…courses are.\n\nWith higher education, Title IX talks about equality of the  activities of men and women. We don't tell colleges what to teach, but  we just make sure we have Pell grants and student loans so that people  can go.\n\nWhen we dismantle the Department of Education, we are not returning  anything to the States. We are just eliminating civil…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698125/dismantling-the-department-of-education"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…promoting a greater divide between  the haves and have nots. This Trump Administration seeks to slash key  federal programs that improve access to higher education, including  Pell Grants, loans, work-study, TRIO, GEAR UP, and CCAMPIS.  Approximately 45 percent of full-time Black students graduate from  public four-year colleges and universities within…", "date": "2025-04-21", "source_url": "https://justfacts.votesmart.org/public-statement/1690128/alarm-at-the-trump-administrations-dangerous-attack-on-education"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…Americans who  benefit from Medicaid and SNAP will be left to suffer.\n\nStudent loan borrowers could be in debt until they die because of  this big, bad bill. Many students who get Pell grants will be harmed.  The bill will raise monthly student loan payments for working- and  middle-class borrowers, affecting 15 million people across the country.  That includes…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691580/big-bad-bill-is-cruel"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…not to get married is not the way to go about doing things.\n\nPrograms like food stamps; low-income housing; earned income tax  credit; Women, Infants, and Children; Medicaid; Pell grants; and  government daycare all are generous programs. You would lose those  benefits if you had another parent in the house with an income.\n\nOf course, this changes behavior,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699038/reshaping-the-american-family"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…programs  including the Workforce Empowerment Initiative, the Information  Technology Workforce Accelerator, and the first prison education  program in the Nation funded by federal Pell grants. The Workforce  Empowerment Initiative alone has helped lift more than 1,200  individuals out of poverty, with participants seeing an average  increase of nearly thirty-three…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697402/congratulating-dr-sheila-quirk-bailey-on-her-retirement"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…familiar to all of us: earned income tax credit; what I  think is the most damaging, the low-income housing programs; the  healthcare programs; the food stamp programs; the Pell grants. There is  program after program you get, but you would lose these programs if you  had both parents in a home.\n\nNobody takes advantage of all 90 programs, but I think…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689603/diversity-equity-and-inclusion"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…and having children.\n\nRight now, there are many Federal programs. They used to be called  food stamps, low-income housing, Medicaid, which is healthcare for the  poor, and Pell grants. All of these programs are designed to penalize  young couples who get married.\n\nMadam Speaker, if you are a single parent, then you may be eligible  for all of these…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691328/the-big-beautiful-bill"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…Reauthorization Act. I secured numerous provisions in the  Working Families Tax Cuts Act, which benefited American agriculture, as  well as a provision authorizing Workforce Pell Grants.\n\nThe Whole Milk for Healthy Kids Act will soon be signed into law, and  the House approved both my Digital Asset Market Clarity Act of 2025 and  the U.S. Grain Standards…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698682/recognizing-the-honorable-steny-hoyer"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…drive  down tuition costs and simplify repayment plans.\n\nIt strengthens accountability for students and taxpayers on Federal  student loans and implements critical reforms to Pell grants to make  sure they prioritize students who truly need financial assistance while  promoting completion.\n\nIt increases timber sales on Federal lands.\n\nIt authorizes the…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692263/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…if you are a young person, allowing  you to get out from having to live with your parents as a benefit for  having a low income.\n\nMedicaid; TANF, a cash benefit; childcare; Pell grants; payments for  children with some disabilities, all of these programs are conditioned  upon not making too much money and, of our primary concern today, not  marrying…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688328/destruction-of-the-nuclear-family"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…endure if, say, a  single mom marries a husband with an income, and we look at the food  stamps, the low-income housing, the earned income tax credit, the TANF  check, and the Pell grants, you can easily wind up in a situation in  which you are penalized $25,000 a year if you get married.\n\nThis is the primary reason why, in the 1950s, we only had about…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698433/republicans-have-delivered-in-2025"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…parent in the household.\n\nWe have our child credit, which is, again, something that is phased  out and appears to be designed to discourage people from getting  married.\n\nWe have Pell grants--and I will tell you a story about that in a  minute--a program that gives free college to a family without a working  person.\n\nNot surprising, if you spend some time…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695628/breakdown-of-traditional-families"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…Earned income tax credit can easily be, if you don't work too hard,  getting $7,000 or $8,000 and getting nothing if you are married to a  person with an income.\n\nThere are Pell grants. As one young gal about 22 years old told me,  she and her husband got married before they had a child; but she knew  lots of friends who weren't getting married because…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700071/issues-of-the-day"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…programs that you would  lose eligibility for if both parents were working and had a child are  the food-share programs, the Medicaid programs, the earned income tax  credit, the Pell grants. Indeed, I could go on. There are about 90  different programs in America which are designed to go to a single- parent family, but if you have a two-parent family making…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689133/educating-young-people"}]