[{"senator": "Wesley Bell", "party": "Democrat", "sentence": "…voted as follows: YEA on Roll  Call No. 49, H.R. 980--Veterans Readiness and Employment Improvement  Act of 2025, as amended, and YEA on Roll Call No. 50, H.R. 3123--Ernest  Peltz Accrued Veterans Benefits Act, as amended.                             personal explanation", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699470/ernest-peltz-accrued-veterans-benefits-act"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "Mr. TAKANO. Madam Speaker, I yield myself such time as I may consume.\n\nMadam Speaker, I rise to express my support for H.R. 3123, the Ernest  Peltz Accrued Veterans Benefits Act, as amended.\n\nIt is no secret that our offices get a lot of calls about casework on  veterans' benefits. Sometimes these calls are a simple matter…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699468/ernest-peltz-accrued-veterans-benefits-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…by the Senate and House of Representatives of       the United States of America in Congress assembled,       SECTION 1. SHORT TITLE.\n\nThis Act may be cited as the ``Ernest Peltz Accrued       Veterans Benefits Act''.       SEC. 2. PAYMENT BY SECRETARY OF VETERANS AFFAIRS OF PENSION                     AFTER DEATH OF A VETERAN IN CERTAIN…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699467/ernest-peltz-accrued-veterans-benefits-act"}, {"senator": "Elise Stefanik", "party": "Republican", "sentence": "Ms. STEFANIK. Madam Speaker, I thank Chairman Bost for yielding me  the time.\n\nMadam Speaker, I rise today in support of my legislation, the Ernest  Peltz Accrued Veterans Benefits Act, H.R. 3123. I also thank Ranking  Member Takano for his comments and support.\n\nI have represented the Peltz family for well over a decade, and…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699466/ernest-peltz-accrued-veterans-benefits-act"}]