[{"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…will be the largest cut to the Food Stamp Program in our  Nation's history. In the middle of the night, Republicans will cut  Medicaid and will cut food stamps when people are not watching. This is  nothing more than a GOP tax scam that gives billions of dollars in tax  breaks to millionaires and gives nothing back to working-class families  but empty…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691482/medicaid-and-social-security-cuts"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…immigration agents.\n\nLet me just say this: These policies that my Republican colleagues  are determined to attack are not the reason for the chaos that the  American people have been watching in horror unfold in the cities of  Los Angeles, in Chicago, in Minneapolis, and so many others. Sanctuary  policies aren't the reason why American cities and citizens…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700066/9999"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…claim to  believe in.\n\nCrazy as it sounds, they don't have to hurt people to keep Trump  happy. Find a spine. Find a conscience, for God's sake, because the  American people are watching. They know the difference between real  leadership and bootlicking.\n\nA vote for this bill is a vote for cruelty. It is a vote for fiscal  irresponsibility and a vote…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693225/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…costs were going to go up for everybody else in the  country, but they didn't want to hear it. They were so desperate to  give away tax cuts to the rich, and now those people watching at home  are going to be paying the bill in the form of higher healthcare costs.\n\nHowever, it is not too late. We can still restore funding for  healthcare so that everyone…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695636/government-funding-and-healthcare"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "…provisions in this House bill, this is our last chance to stand up for  our values.\n\nMr. Speaker, I urge my colleagues to vote ``no'' on this big BS bill.  The American people are watching.", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693237/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…cannot honestly stand for people's need to  access treatment while kneecapping the agency that is accountable for  providing it.\n\nLives are at stake, and the American people are watching. They do  know what it means when elected leaders say one thing and do another,  and they deserve honesty and real action.\n\nMr. Chair, I thank my colleague from New…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691873/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…babies who are relying  on Medicaid.\n\nMs. SCHRIER. Mr. Speaker, I thank the gentleman for his comments and  putting this in a very personal way.\n\nI am wondering for people out there watching if they are thinking,  gosh, I wonder is this really true? Are hospitals really going to  close? Are we really going to lose labor and delivery and have to drive…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691419/gop-tax-scam-hurts-everyone"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…thing. Why  would we not honor them? We can't say one thing and do another, that we  want to serve and protect them. We want to make their lives better. The  American people are watching us. They are depending on us.\n\nMr. Speaker, let's do the right thing. Simply just put this plaque  out for all of us, for their service to us and to this Nation.\n\nMr.…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691321/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…then-Senate Minority Leader Byrd as the ``Speaker of  the House'' on a trip back home in West Virginia but gave him the wrong  title--``Speaker of the House'' because people were watching C-SPAN in  the House, and they had no access in the Senate--that then-Senator Byrd  started to think, Hmm, maybe we should have TV coverage in the Senate  as well to…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691704/senate-resolution-259-recognizing-june-as-the-39th-anniversary-of-c-span-chronicling-democracy-in-the-senate"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "…accountability because we have a President who doesn't think that the  rules apply to him.\n\nHere we are tonight to talk about Trump's first 100 days.\n\nMr. Speaker, I encourage people watching--shout out to my mom and  dad. I know we have at least two viewers tonight. For the others, I  encourage them to check out Congresswoman Kamlager-Dove's social media…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690635/trumps-first-100-days"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…the United States House of Representatives, the  subject line was: ``Protecting American Communities in the Budget  Reconciliation Process.''\n\nFor all the American people who may be watching the floor of the  House of Representatives right now, that is the process that we are in  with this one big, ugly bill.\n\nMr. Speaker, Republicans chose to go down…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…218 bipartisan  signatures for a clean bill to extend these tax credits. Speaker  Johnson must put this bill on the floor now. The consequences are real.  The American people are watching.", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698371/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Mark Pocan", "party": "Democrat", "sentence": "…congressional districts in Wisconsin. We have had record turnout.\n\nIn Belmont, Wisconsin, population 1,000, we had over 200 people show  up; and we had to turn people away. People were watching the townhall  through the windows. In Viroqua, a town of 4,500 people, 300 to 400  people showed up to voice their displeasure with the Republican agenda.  When…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689813/listening-to-our-constituents"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…community. They have a sense of urgency. They have a commitment to  the well-being of the people they represent in that community. They  have the pressure of local community people watching to see if they are  making progress on that recovery.\n\nBut what has happened with FEMA, where everything is centralized, is  you don't get an answer. Can we replace an…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693402/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…stand with Donald Trump and my Republican colleagues  who are just taking care of those for whom the economy is booming, the  billionaires of our country?\n\nThe American people are watching. This is very simple. Why did we  take a year to get this vote? It is because Trump's tariffs are  unpopular--the majority of Americans know it--and a majority of my…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699971/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…talking over  them.  We are talking about them. But we are not talking to them. That is what  you do with your friends. That is what you do with your allies.\n\nThe people of Greenland are watching us, and the United States is not  exactly winning them over by treating them like serfs in a feudal  estate. The administration's approach is not improving relationships.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698821/9999"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "…Americans' pockets, and reduce our deficit. They  ensure that government funding works efficiently to deliver services  that make life better for Americans.\n\nThe American people are watching us. They want to see Congress do our  most basic, essential function, which is spending government dollars  and controlling the power of the purse. Through bipartisan,…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698632/providing-for-consideration-of-hr-saving-homeowners-from-overregulation-with-exceptional-rinsing-act-providing-for-consideration-of-hr-affordable-housing-over-mandating-efficiency-standards-act-and-providing-for-consideration-of-hr-commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…body, but it is who we are as God's creatures that will enable us  to move forward with continuing to grow.\n\nI am honored tonight to just call this to the attention of the people  watching and especially to my colleagues who--again, not Democrat or  Republican--have chosen to make the world a better place by helping  people be their best selves, to continue…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692714/recognizing-national-post-traumatic-growth-day"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…this back-and-forth guidance has not allowed  businesses to plan for the future or make new investments.\n\nMr. Speaker, why does a SIFI designation actually matter? Many people  watching might ask themselves that. Well, as history has taught us, it  is a broad-reaching issue that can have some very negative  consequences. Excessive regulatory scrutiny…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699824/financial-stability-oversight-council-improvement-act-of-2025"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…to support a rescission of $2.5 billion in the development of  assistance programs, which bankrolled corrupt leaders in foreign  countries.\n\nMr. Speaker, the American people are watching their Representatives  today, emphasis on ``their Representatives.'' They are watching to see  if their Representatives have the courage to actually fight for them or…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692534/rescissions-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Medicaid could actually be solvent. It has gone up another $1 trillion  just under the Biden administration in terms of overall baseline costs.\n\nThat is all in the weeds. People watching this at home don't know  what is going on. They are going about their lives. All they know is  that there a big bill, there is some tax stuff in it, there is some  spending…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693110/tax-cuts-and-spending"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…and not government control is a source of human  achievement. They understood that when the government owns the economy,  they soon seek to own the people.\n\nI hope people who are watching right now on C-SPAN or on the news get  what is going on in this body today. This side is against socialism.  That side is for socialism. I am disgusted with what…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697153/denouncing-the-horrors-of-socialism"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…minority leader says.\n\nMr. SULLIVAN. This Senator yields the floor to answer that inquiry  that I asked about.\n\nMr. SULLIVAN. Mr. President, I just want the American people who are  watching this that care about our national security--the chairman of  the Armed Services Committee just had a colloquy here on the floor  talking about why we needed to move…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690106/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Speaker, I thank the chairwoman, my friend from North  Carolina, for yielding me time.\n\nMr. Speaker, I support this rule, and I rise in support of the rule.\n\nFor the American people watching back home, we are here because, on  June 3, the House of Representatives received a rescissions request  from the White House to eliminate $9 billion in unobligated spending.…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692388/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…of the taxpayers' pockets, away from the  vulnerable, and enriching insurance companies.\n\nThere are millions of ineligible people, billions of dollars of  fraud, and people are watching what is going on in the country,  especially in Minnesota. How could my colleagues across the aisle, in  good faith, call this affordable healthcare and stewardship…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698812/breaking-the-gridlock-act"}]