[{"senator": "Al Green", "party": "Democrat", "sentence": "…history. He is the person  who has decided that Black history is going to be minimized because we  talk too much about slavery. He wants slavery to be whitewashed. There  are people in Texas who call it involuntary relocation.\n\nMurder, rape, and 240 years of working without a paycheck is  involuntary relocation?\n\nThis dastard supports these kinds of things,…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700075/black-history-stolen-legacies"}, {"senator": "Joaquin Castro", "party": "Democrat", "sentence": "…your choice.\n\nWe choose to keep people alive. We choose to have healthcare in this  country. We refuse to cut healthcare for 17 million people nationwide  and 1.6 million people in Texas because it is wrong and it is immoral  and we can take a different course.", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693230/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…monthly costs go from $10 to $1,140.\n\nI mean, we could do this all day. Yet Republicans can't be bothered  to do it at all. These are their constituents. Nearly 4 million people  in Texas rely on these tax credits. Republicans don't want to save over  4 million in Florida.\n\nThe increases they are going to face are unthinkable. In five  States--all red States--families…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696460/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-record-of-decision-for-the-barred-owl"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…responsibly cutting spending, or  making government more efficient. This is about trying to balance the  books on the backs of working families, children, seniors, and people  with disabilities.\n\nIn Texas, these healthcare cuts will be catastrophic. We already have  the highest uninsured rate in the country, with nearly 5 million people  in Texas lacking health…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691316/republicans-assault-on-american-arts-culture-and-public-knowledge"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…year. Families cannot afford that.\n\nMr. Speaker, I am all for cutting waste and finding fraud and abuse,  but taking away healthcare and making it unaffordable for the people of  Texas is not the way to do it.\n\nTexas Medicaid, Medicare, and Social Security programs must be  protected. They represent our commitment to the American people that  their government…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688235/democratic-proposals"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…rainstorm that produced horrific floods and  tragic loss of life.\n\nWhat happened in this policy is that Republicans at every level of  government in our State failed the people of Texas. At the local level,  they refused to have support grants from the Biden administration that  would have put in place critical sirens and warning equipment that  would…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693655/tragic-storms-in-texas"}, {"senator": "Ronny Jackson", "party": "Republican", "sentence": "…sincere gratitude to my former Director of Operations, Kathy  Zhu of Kissimmee, Florida, for her exceptional service, tireless  dedication, and unwavering commitment to the people of Texas' 13th  Congressional District. Over the years, Kathy proved to be an  invaluable asset to my office, where her attention to detail was  crucial in my ability to represent…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697542/recognizing-and-expressing-gratitude-to-former-director-of-operations-kathy-zhu"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…were all  affected by it. We had so many loved ones who were impacted, but the  faith of that community and the faith of the people in this Nation and  the faith of the people in Texas who have come together under the cross  that stands up on that hill in Kerrville and the people who have  generously contributed now $150 million and counting that are…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695203/people-are-sick-and-tired"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…future generations.\n\nI commend the Wilkerson family for their century of stewardship, and  I thank them for their continued commitment to delivering trustworthy  news to the people of Texas.\n\nIn God We Trust.", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693641/congratulating-aledo-bearcats"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…and to commend my colleague, the gentleman from Texas (Mr. Roy). There  is no greater advocate for law and order and election integrity than  Mr. Roy, and the incredible people of Texas are well-served by his  leadership and stewardship of our Constitution.\n\nMr. Speaker, the rule before us enables us to debate and vote on one  of the most consequential…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699936/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Ronny Jackson", "party": "Republican", "sentence": "…deepest gratitude to my former Chief of Staff, Jeffery  Ronald Billman of Irving, Texas, for his dedicated service, steadfast  leadership, and unwavering commitment to the people of Texas'  Thirteenth Congressional District. As my first Chief of Staff, Jeff  played an instrumental role in helping me to become a better Member of  Congress, advancing the…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690377/recognizing-the-career-of-jeffery-ronald-billman"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…State have been destroyed, but we will rebuild.\n\nHere is the thing that I want to say. When people talk about  destruction, what will not be destroyed is the spirit of the people of  Texas; the spirit of the people that those camps represent; the spirit  of the little girls who are already talking about wanting to go back;  the spirit of the people associated…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693607/mourning-the-loss-of-life-in-the-state-of-texas"}, {"senator": "Ronny Jackson", "party": "Republican", "sentence": "…express my gratitude to my former Chief of Staff, Bryan Brody of  Highland Village, Texas, for his exceptional service, tireless  dedication, and unwavering commitment to the people of Texas' 13th  Congressional District. Bryan has been with my office since the  beginning. As a trusted advisor, he helped build and lead Team Jackson  from the ground up. His…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697548/recognizing-and-expressing-gratitude-to-former-chief-of-staff-bryan-brody"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…of  selfless service, from the battlefield to public safety leadership,  education, and community policing. His enduring contributions have had  a lasting impact on the people of Texas and the broader law enforcement  community.\n\nIt is with great honor and respect that I present Danny Wallace Smith  with a Congressional Veteran Commendation from the…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696284/recognizing-danny-wallace-smith-with-a-congressional-veteran-commendation"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…make sure we are saving that money instead  of having $6 million to fund tourism in Egypt or $2 million for sex  changes and LGBT activism in Guatemala.\n\nWhy should the people of Texas be paying for that instead of paying  to clean up the flood in Texas?\n\nThe fact of the matter is the people of Texas want their money to be  used for the things they care…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693712/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Ronny Jackson", "party": "Republican", "sentence": "…recognize and  express my sincere gratitude to my Defense Fellow, Major Evan Hanson of  the United States Air Force, for his outstanding work in my office and  service to the people of Texas' 13th Congressional District during  2025. Since being assigned to my office, Major Hanson has made a  profound impact, bringing professionalism, insight, and dedication…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697563/recognizing-and-expressing-gratitude-to-defense-fellow-major-evan-hanson"}]