[{"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…numbers of agents is a hollow and disingenuous attempt  to nullify the intense criticism that DHS is seeing--a criticism and an  explosion of outrage in the American people who have seen these videos,  who have heard these stories--because it so violates our sense of  decency, not to mention our adherence to the Constitution.\n\nThe hearing that we held…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699650/9999"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…next NASA Administrator, but  first, I want to make a few comments about the unbelievable weather  events that are impacting the Pacific Northwest.\n\nWe have had, as many people have seen from national news, atmospheric  rivers and unbelievable rain impacting many of our rivers in the  western part of Washington--reaching record levels and above record…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698254/nominations"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…mean, you have got to have a sense of humor.\n\nBut what you lacked in humor, I was blown away by just how good  people you are, and this world is yearning for more good people.\n\nYou have seen this place split along the aisle. You have seen the  tribalism grow in our country. You are going to return to your phones  very soon, which I think this is probably…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699130/senate-pages"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…happened in my career? The President of  the United States coming before a joint session of Congress and  insulting Members by name individually, shouting slurs at people.\n\nI have never seen that before. Would the gentleman agree with me that  Trump deserves a censure for calling my Senator from Massachusetts a  slur? Would that be appropriate?\n\nAgain,…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688503/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…to the community and posting  these missing person posters on social media to try to find Mr.  Cisneros. This is the photograph that they were advertising, asking  people: Have they seen this man? Can you help us find our member of our  family?\n\nThey finally did find him, 2 weeks--2 weeks--after the masked Federal  agents wrongfully arrested him. Where…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696536/government-funding"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Indiscriminate violent roundup of American citizens, legal residents,  and people with no criminal record erodes civil liberties and threatens  the rule of law.\n\nThe American people have seen this play out with their own eyes, and  they have had enough. This is the time to rein in this lawlessness now.  Congress has 2 weeks to act. With the support of the American…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699485/department-of-homeland-security"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…implementation of  this rule could lead up to 1.8 million people to lose health insurance  just this year, 2026. That would be devastating.\n\nOn top of the premium increases that people have seen because the  Affordable Care Act extended tax credits were not extended when tax  cuts for the wealthiest were extended, this additional burden on this  1.8 million-person…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698982/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…rebellion,  then the standard set in law means nothing. You are just throwing open  the doors to an authoritarian President who is deploying troops against  the American people.\n\nWe have already seen, with the provocative actions of assaults on  peaceful protesters, how dangerous that is. And, then, of course, the  Insurrection Act, as an exception to Posse…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…hardship for Americans from  California to New Hampshire, Washington, and everywhere in between.\n\nIn my district, the San Fernando Valley in Los Angeles, nearly 31,000  people would have seen their healthcare costs rise if the ACA tax  credits expired, and nearly 11,000 people would have lost access to  healthcare entirely.\n\nAdditionally, a 60-year-old couple…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698671/protecting-healthcare-for-millions-of-americans"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…a new  President's term. I think it is safe to say that Trump's first 100 days  have been a disaster. His tariff policies are likely to cause a  recession. Millions of people have seen their retirement savings  evaporate. Families don't know if they are going to be able to afford  basic goods, much less Christmas dolls. Businesses, big and small, are…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690745/providing-for-consideration-of-hr-gulf-of-america-act-and-providing-for-consideration-of-hr-dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…red tape just to get the benefits he earned serving our country. This  isn't about accountability. It is about taking food and healthcare from  people who need it most.\n\nPeople have seen how these policies fail. In Georgia, red tape and  paperwork errors have already kicked thousands off their healthcare  coverage, even when they are eligible.\n\nThis isn't…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691502/gop-tax-scam-hurts-women-and-families"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…these charts and you see our interest  coverage and how fragile we are, the bond market basically may be the  greatest influence on this government.\n\nHowever, how many people have you seen come behind these microphones  and talk about debt?\n\nYet, the one thing we are not allowed to tell our voters, our public,  our staff, each other, is the truth about…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689025/tell-the-truth-about-math"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "Mr. McCONNELL. Mr. President, I know that many of our colleagues and  the American people have seen the tragic news out of my hometown just  yesterday. And I am grateful for their thoughts and their prayers this  morning directed toward the people of Louisville.\n\nFolks…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696544/9999"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…Whether you like him or not, you know what he stands for  exactly, and he will act on that.\n\nIt is the type of leadership that has delivered real results for the  American people. We have seen real results on our southern border as  illegal crossings and the flow of illicit drugs has dropped  significantly.\n\nFamilies are feeling real relief at the gas pump…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699279/highlighting-republican-successes-in-2025"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…again, and to get these  violent gangs and criminals off our streets.\n\nNow, even though these efforts have been very successful and are  widely supported by the American people, we have seen some powerful  institutions in our country try to block the will of the people and  what they wanted to see done. This includes some of our Nation's social  media companies.…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690548/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…our office and the emails that we are  getting show that this is an issue that has really grabbed the  attention of Tennesseans. I think that one of the reasons is that  people have seen fraud play out in their local communities. They have  seen title theft, where forgers go in and steal properties. Then  someone finds out their property is going to be…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699102/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…mandate all offshore oil and gas exploration and development projects  complete costly and burdensome archeological surveys and reports. Over  the past 4 years, the American people have seen the most anti-oil,  antigas, anti-traditional energy, and antimining administration in this  Nation's history.\n\nWhen energy here in the United States and around the world…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688634/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}]