[{"senator": "Adam Smith", "party": "Democrat", "sentence": "…discrimination against the transgender  community.\n\nOn all five of these amendments--just put a little exclamation point  on that--it encourages the dehumanization of transgender people in a  way that is very, very dangerous. That is number one.\n\nNumber two is transgender people exist. That is just a fact. Gender  dysphoria is a medical fact. No serious medical…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695253/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…costs and  more expensive healthcare, but that is what the Republicans and Donald  Trump have given them in just 1 year in office.\n\nSo Democrats will show the American people another way forward, a way  focused on lower costs, more prosperity, and an agenda focused on the  working- and middle-class families of America--not the billionaires,  not the special…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698255/nominations"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…too bad.  As the phrase goes, let them eat cake. If they don't have bread, oh,  let them eat cake.\n\nSo there we are. And our responsibility is to say to the American  people that the way to stop this authoritarian takeover is to have very  significant, robust demonstrations across America, like we had on  Saturday. The citizens have to make a big deal.…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…night saying you are out of a job on Monday morning.\n\nThere are better ways to run a country. There are better ways to run  a business. It is not necessary to mistreat people that way. You can  incentivize people who are close to retirement to retire early. You can  freeze hiring. You can give people a 6-month, a 9-month, a 12-month  heads-up that we…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688514/people-not-statistics"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…a  solution today? It is not that hard. We can extend these tax credits.  We can have affordable health insurance in the market. We can talk as  an organization of people who--by the way, Finance Committee is charged  with looking at this issue and discussing it. That is why we fought so  hard in the Affordable Care Act for something called the Basic…", "date": "2025-10-01", "source_url": "https://justfacts.votesmart.org/public-statement/1695964/en-bloc-nominations"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…thought to be working.\n\nIn this country, now, decades after that time in the 1930s, in the  pinnacle of democracy, what we are seeing is a paramilitary force  stopping people in this same way, searching them and assaulting them.  And the parallels are unmistakable and frightening. We cannot, in this  body or anywhere in our great country, stand idly while…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699087/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…There is no way that any mayor in Georgia or any mayor in Colorado,  whatever party they are in, Democrat or Republican, would put a budget  like this in front of their people. There is no way they would come to  them and say: We are going to make life even harder for people who are  even hanging on by their fingernails just to get the healthcare they  get…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689543/h-con-res-14"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…jeopardize the Arctic Refuge--the greatest  intact wildlife refuge in our Nation. It would jeopardize our chance at  a livable future, and it would jeopardize the Gwich'in people's way of  life.\n\nOur public lands belong in public hands. Yesterday, the President of  the United States, with the auto industry of our country standing  behind him, signed a…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697516/hj-res-131"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Federal agencies in direct violation of those negotiations?\n\nI don't trust these guys to tell me the correct time, let alone trust  them to do what is right for the American people.\n\nThe way to restore trust is simple: Hang the January 6 plaque  honoring the officers who defended our democracy on that day, stop the  giveaways for those at the top, and release…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694886/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…as ``generous with his  time, welcoming by nature, and the kind of person who made you feel  included without trying. He deserved to grow older, to keep showing up  for people the way he did for me.''\n\nAnd Alex did show up for people. He went on to become a nurse,  serving veterans at the VA Hospital in Minneapolis. His coworkers,  friends, and patients…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699406/9999"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…authoritarians through history  have done. They do things like call for parades on their own birthday,  or rename things, or do other stunts to distract the American people  from the way they are lining their own pockets and taking away  fundamental rights.\n\nThis Republican Congress appears to be perfectly fine with that.\n\nA new CNN national poll shows…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690937/gulf-of-america-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…somehow pretending like it isn't going  to hurt people is just insane. It is simply not possible mathematically  to cut Medicaid by almost a trillion dollars and not hurt people.\n\nBy the way, for the record, that is not fear-mongering. It is what is  in the text of this resolution.\n\nI just want to say that this budget directs the Committee on Energy  and…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689864/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…away from a  vote, and yet they are still not coming together to show us how they  are going to reduce healthcare costs.\n\nWe need to keep covering people because covering people is a way to  help reduce costs. As I mentioned, the expansion of the Basic Health  Program is one way to lower those costs. But I know that in this last  big bill passed by my…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697783/healthcare"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…Displaying Pride flags is a way for servicemembers and DOD  civilian employees to show that they are committed to creating and  affirming an inclusive environment for LGBTQI+ people or a way to  celebrate their own identity. It does not indicate to exclude anybody  else for what they may believe in.\n\nAt a time when the LGBTQI+ community is under attack, displaying…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695261/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…change course, to reclaim its legislative authority,  to actually drive policy in the right way, and to become the people's  House again by actually serving the American people in a way that will  make a profound difference in the lives of many of them throughout the  country.                           Calling for Accountability\n\nMr. KILEY of California.…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697549/congratulating-eco-clean-solutions"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…said, who among us doesn't have to justify our  work? Why should government be any different?\n\nDOGE understands something fundamental: Washington should work for  the people, not the other way around. That means questioning contracts,  finding and cutting waste, and making sure that when the government  spends a dollar of your money, it delivers value.…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688492/demanding-transparency-efficiency-and-accountability-from-our-government-is-not-extreme"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…had more deaths than  births. Okay. You want us to finance pay-as-you-go systems, which is  Social Security and Medicare, at a time when we have a shortage of  young people. There is a way to make it work.\n\nAre you going to allow people like me, people who are here willing to  think to be able to refine the process, to modernize?\n\nLook, we will try to…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689025/tell-the-truth-about-math"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…side but on the mandatory side,  so we can fund our Nation's priorities.\n\nAnd our top priority as the Federal Government has to be to defend  and protect the American people and our way of life. But we can do this  without tampering with essential programs like Social Security, as I  said, and programs like Medicare that our seniors rely on.\n\nNow, one…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689668/government-funding"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…on the Committee on House Administration.\n\nToday, Mr. Speaker, we have an opportunity to move forward with  election integrity and to regain the trust of the American people in  the way that we operate our elections.\n\nThe SAVE America Act has two key principles, both of which are common  sense. The individuals who want to vote in U.S. elections should…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700014/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…Interior Doug Burgum, as Deputy Solicitor for  Energy and Mineral Resources. I know Jake will be a valuable asset to  Secretary Burgum, President Trump, and the American people, the same  way he was for me and the members of the House Committee on Energy and  Commerce. I thank him, congratulate him on his new role, and wish him  the best in his future.", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689859/recognizing-jake-tyner"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…idea of something bigger than themselves. It usually  involves bringing a lot of other people along with them. It involves  creating a lot of wealth for a lot of other people along the way, too.\n\nI guess the people on the other side of the aisle want to crush that  ability. Mr. Speaker, go to Marxist countries, which is the utopia of  some of the people…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689896/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…wearing a hijab.  Almost a third think that Islam promotes violence.\n\nParallel legal systems are not keys to a thriving society. There must  be one rule of law for all the people.\n\nAll the way back in 1991--a lot of people won't know this--the Muslim  Brotherhood issued a memorandum about North America, detailing a plan  for the ``enablement of Islam in North…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698106/bringing-america-back-to-its-roots"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…child advocacy  centers, and prosecuting criminal cases under State law against  offenders who committed terrible crimes against children.\n\nI have often described it to people this way: It is not like on TV in  the crime shows.\n\nWhen the victim is an 8-year-old child or a 7-year-old child, and  when what happened to them was some form of sexual abuse,…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698842/crime-victims-fund-stabilization-act-of-2025"}, {"senator": "Mario Diaz-Balart", "party": "Republican", "sentence": "…They have seized seven oil tankers attempting to evade sanctions.\n\nIt is very simple. Let's not protect those drug dealers, those  cartels. Let's protect the American people. The way to do that is to  vote ``no'' on this resolution.", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699368/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…failures now.\n\nThese provisions are not the right path to address the concerns, true  concerns, over the separation of powers. Remember, Congress serves the  American people, not the other way around.\n\nToday, we have an opportunity to take a good bill that reopened the  Federal Government and make it better by repealing the provisions that  were slid into…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696929/repeal-of-senate-notification-requirements-relating-to-legal-process-on-disclosures-of-senate-data"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…is called inflation. The biggest tax in modern history was those  3, 4 years of inflation because we now get to pay back our debt with  inflated dollars. We are crushing people. The way you make wages go up  is two things: You raise people's wages because of inflation. That just  means you are treading water, or productivity.\n\nNow some of the things we…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694915/facts-and-math"}]