[{"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "Now, it is also not lost on me that I am standing in this Chamber, in  this seat of power from which wars have been launched and the fates of  millions have hung, a Chamber where in the nearly 250 years of this  great Nation, only 3 percent of the people who have ever stood here on  this floor have been women.", "title": "Standing with Truth and Justice", "date": "2025-11-18"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "But the side effect of the fossil fuel industry having ownership and  control over the Trump administration and all of its policies and  decisions is that people's electricity rates are going to go up.", "title": "Terminating the National Emergency Declared with Respect to Energy", "date": "2025-10-08"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "Known for his  passionate delivery and his ability to interpret Scripture in ways that  are both accessible and applicable, he has a deep love for teaching the  Word of God to people of all ages and backgrounds.", "title": "Recognizing Pastor Christopher ``chris'' K. Wesley on Six Years of Servant Leadership-", "date": "2026-02-09"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "On behalf of my constituents in New Hampshire's First Congressional  District, I wish Chief McLin well in his retirement, thank him for his  commitment to the people of Somersworth, and congratulate him on a job  very well done.", "title": "RecognizingMc the Achievements and Retirement of Somersworth Police Chief Timothy J. Lin", "date": "2025-02-26"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "If this bill passes, 16 million people are going to lose their health  insurance.", "title": "Providing for Consideration of Senate Amendment to H.R. One Big Beautiful Bill Act", "date": "2025-07-02"}, {"senator": "Andrea Salinas", "party": "Democrat", "sentence": "In addition to coaching her award winning team, she recently  published a book titled ``When Girls Win,'' which delves into the  personal challenges Coach MJ has faced as a woman in a male-dominated  field while illustrating how people like you and me can build a winning  mindset.", "title": "Congratulating Maryjo McCloskey", "date": "2025-12-12"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "You know, it is too late, it is too late for the 60,000-plus people  that have been killed in Gaza.", "title": "Providing for Congressional Disapproval of the Proposed Export of", "date": "2025-07-30"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "And what is of concern, I think, to all of us--and I really want to  emphasize I think it is all of us, not the Democrats versus the  Republicans--is wanting to have a healthcare system that is going to be  there when people need it, that people are not denied access to  healthcare because they are poor kids, that they are not denied access  to nursing home care because they have run out of their lifesavings.", "title": "H. Con. Res. 14", "date": "2025-04-03"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "The Agency  often gives a notice of proposed rulemaking so the world will know what  they are considering doing and then solicit comment from affected  stakeholders, the public, a wide variety of people.", "title": "Guiding and Establishing National Innovation for U.S. Stablecoins Act--", "date": "2025-05-20"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "He is trying to  avoid Republicans going on record against supporting Trump's chaos  because he knows the American people are sick and tired of this.", "title": "Enough of Trump's Chaos", "date": "2025-04-09"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "On behalf of the people of Colorado's 7th Congressional District, it  is my honor to congratulate Foothills Regional Housing on their 50th  anniversary and thank them for all they do for our community.", "title": "Recognizing Foothills Regional Housing", "date": null}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "Nearly 2 million  people in my State of New Jersey rely on Medicaid for healthcare.", "title": "Concurrent Resolution on the Budget for Fiscal Year 2025", "date": "2025-04-09"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "On behalf of the people of New Mexico's 2nd Congressional District, I  would like to extend my deepest appreciation to the Isleta Police  Department and local law enforcement for their nonstop efforts to  protect our communities.", "title": "Commending the Isleta Police Department and Local Law Enforcement", "date": "2025-12-04"}, {"senator": "Wesley Bell", "party": "Democrat", "sentence": "Speaker, the State legislature may have forced through  their partisan map, but in Missouri, the final word belongs to the  people.", "title": "Petitioning to Check Partisan Map", "date": null}, {"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "``Thank you for your support and your love.''\n\n``Muchas gracias por su apoyo y tu amor.''\n\nThank you to ``the people,'' ``la gente'' of southern Arizona for  making history, electing me as the first Latina, the first Chicana from  Arizona to ever go to Congress.", "title": "Welcoming the Honorable Adelita S. Grijalva to the House of Representatives", "date": "2025-11-12"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "These people did not know if they were going to survive this war.", "title": "Promoting Cross-Border Energy Infrastructure Act", "date": null}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "Across the country, thousands of schools, libraries, and community  centers bring young people together to experience the magic of books.", "title": "Recognizing Read Across America", "date": "2025-03-03"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "The people in Minnesota, many of them, not only can't afford  an EV, these vehicles are not compatible with our daily lives.", "title": "Providing Congressional Disapproval of the Rule Submitted By the Environmental Protection Agency Relating to ``California State Motor Vehicle and Engine Pollution Control Standards; Heavy-Duty Vehicle and Engine Emission Warranty and Maintenance Provisions; Advanced Clean Trucks; Zero Emission Airport Shuttle; Zero-Emission Power Train Certification; Waiver of Preemption; Notice of Decision''", "date": "2025-04-30"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "The chart here and the bar here I  want people to pay attention to is Moody's, who has this whole thing  where they do analytics on debt and spending.", "title": "The Math", "date": "2025-05-06"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "President, on this day in 1949, the Russian-Soviet  regime occupying the Baltic countries rounded up 95,000 people, mostly  women and children, and sent them to Siberia.", "title": "Russia", "date": "2025-03-25"}, {"senator": "Carlos Gimenez", "party": "Republican", "sentence": "Speaker, I rise today to recognize and honor the  former President of the Republic of Colombia, Alvaro Uribe Velez, for  his extraordinary leadership, steadfast defense of democracy, and  unwavering commitment to the safety and prosperity of the Colombian  people.", "title": "Recognizing President Alvaro Uribe Velez", "date": "2025-11-12"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "Simply put:  Gary's impact on the people of Nebraska will endure long after his  final sign-off.", "title": "Recognizing Gary Sadlemyer", "date": "2026-01-27"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "Speaker, waste, fraud, and abuse fundamentally  undermine the American people's trust in the government.", "title": "Sba Fraud Enforcement Extension Act", "date": "2025-12-01"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "When the leader of the Democratic Party at that time, Nancy Pelosi,  and the Deep State learned of Trump supporters coming to Washington,  DC--which, by the way, was hundreds of thousands of people--they  started and got an idea.", "title": "-9999", "date": "2026-01-06"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "It is an honor to recognize his exceptional contributions and  to present him with the Congressional Patriot Award in appreciation of  his steadfast service to the people of Bowie County and the United  States of America.", "title": "Recognizing Congressional Patriot Award Recipient Gary Singleton", "date": "2025-11-18"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "This inspiring group of young people is known as the Rebel Robotics FTC  team.", "title": "Recognizing First National Bank of Omaha", "date": "2025-05-06"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "And what we know is that children  were more than a quarter of their follow recommendations for people  that they suspected were child predators.", "title": "Statements on Introduced Bills and Joint Resolutions", "date": "2025-05-14"}, {"senator": "David Rouzer", "party": "Republican", "sentence": "Madam Speaker, I thank them all, for the Lumbee are a great and  honorable people who deserve Federal recognition with all the rights  and benefits that come with it.", "title": "Federal Recognition for Lumbee Tribe", "date": "2025-12-17"}, {"senator": "Keith Self", "party": "Republican", "sentence": "This district of Texas is home to some of the best and brightest  young people, and it is always an honor to recommend such fine students  to our Nation's service academies.", "title": "Saluting Our Soldiers of Tomorrow", "date": "2025-06-25"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "I thank him for his  continued dedication to the people of Michigan through his service with  the Michigan State Police, and I commend him for embodying the very  best of public service.", "title": "Recognizing Michigan State Police Sergeant Dennis Wagner", "date": "2026-02-09"}]