[{"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…people and their health and well-being would do  or should do.\n\nIf I were his mother, I would scold him.\n\nOur office is receiving numerous inquiries from retirees, working  people who worked hard and are deeply concerned about the drop in value  of their 401(k) retirement plans that they worked for.\n\nThose just lost enormous value in the financial markets…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690052/trump-tariffs"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…replace it and to help families afford  health insurance. Allowing these tax credits to expire is going to harm  the record enrollment in the ACA Marketplace that so many people have  worked so hard to achieve, and this past year there has been record  enrollment in the ACA.\n\nNow, what does it mean for Americans if we allow these tax credits to  expire?…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695663/cloture-motion"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…the floor, and they did not. I am troubled by that. We will see how the  amendment process goes.\n\nAgain, beneath all of that is a really good bill that a lot of very  good people worked very hard to produce. I hope that when we get  through the end of this process and actually pass the bill and send it  off to the President, we get that bill back, because…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695253/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…perseverance, excellence, and  resilience in the face of adversity. They remind us that history is not  just something written in textbooks, but it is alive in the people who  have worked tirelessly to break barriers and uplift their communities.  I want to first tell you about Lyman Parks first.\n\nLyman Parks, Grand Rapids Mayor: After moving to Grand…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688206/highlighting-notable-black-leaders-from-michigans-third-congressional-district"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…businesspeople like Thomas, some of whom have  gone out of business. A chocolatier who just loved making her  chocolates but who can no longer afford it had to fire the people who  had worked so hard in her company.\n\nI met with another New Yorker, a man named Jeremy. He lives in the  Hudson Valley, in Kingston, NY, who relies on the ACA tax credits to  pay…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698199/new-york"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…read three times and passed; and that the motion to  reconsider be considered made and laid upon the table.\n\nMr. LUJAN.  I see some of his staff in  the room as well, people that I have worked with. They know when I work  with them and when others don't. But I understand the words that were  being used today to spin an argument as to why there should be…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696457/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-record-of-decision-for-the-barred-owl"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…contributed to awful flooding problems for decades. The  city of Crisfield was depending on a Federal grant to finally help fix  the problem. It was a funding plan that people had worked on for years  and for such a long time, but this administration's rash decisions have  now eliminated that plan.\n\nThese are the kinds of decisions that can leave you…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690300/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…dismissal.\n\nInstead of confronting the housing affordability crisis, Fannie Mae  has turned to advancing the political interests of this administration,  turned against the people who worked for them and served them for so  many years, and turned against the American people.                    Good and Bad News for Social Security\n\nMr. SUBRAMANYAM. Madam…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697218/recognizing-bishop-michelle-c-thomas"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…Tiffany is just one of  many USDA employees fired with no notice despite years of service,  leaving farmers across America wondering who is left to help.\n\nIt is amazing. These people worked hard. There was nothing against  them. They didn't get a notice saying: You didn't do this, this, this;  you can improve this way, this way, that way. They were just fired.…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688408/joint-session-of-congress"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…laying people off.\n\nMr. Speaker, 445,000 Federal employees lost their collective  bargaining rights. As the Senate report pointed out, in forcing out  tens of thousands of people who worked for the government--many of them  doing the science and tech work that I just talked about--the  Democratic staff report calls it: The $21 billion blunder, analyzing…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695606/devastating-harm-caused-by-trump-administration"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…families are told to tighten their belts. We should be expanding care,  not slashing it. We should be protecting retirement security, not  playing games with the futures of people who worked their entire lives.\n\nTexas families are watching and we will not let this administration  destroy the programs that protect our health, our security, and our  basic dignity.…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689782/defending-social-services-and-programs"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…labor, the weakest labor rules, and nonexistent  environmental rules. They made them citizens of nowhere. They didn't  care about this country or the communities and the people who worked  hard to make them rich, whether they made the steel or anything else as  we did in America.\n\nIt is a stain on our story in this country, and, frankly, it is not  too…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689080/economic-populism"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…coming out of people's mouths who don't care about  seniors and say things like it is just a complicated Ponzi scheme. It  is abuse by the Federal Government, abuse of people who worked hard  their entire lives to support themselves and paid into a system that  promised to one day support them.\n\nOur seniors rely on Social Security to pay their bills,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690424/social-security-administration-is-there-to-help-not-hurt-americans"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…binds residents together.\n\nBrooksville's history is reflected not only in its historic landmarks  and longstanding neighborhoods, but also in the character of its  people--those who have worked to build local businesses, serve in  public office, educate future generations, and contribute to the  cultural and economic vitality of the region. The city's…", "date": "2026-02-20", "source_url": "https://justfacts.votesmart.org/public-statement/1700091/recognizing-the-city-of-brooksville"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…of Rockland for over 30 years, 15 of them as  county clerk. He was responsible for numerous innovative services in  the county clerk's office, and his passion for the people who he worked  with was evident in the quality of his work.\n\nMr. Speaker, I encourage my colleagues to support this bill, and I  reserve the balance of my time.\n\nMr. GILL of Texas.…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697699/paul-piperato-post-office-building"}, {"senator": "Roger Marshall", "party": "Republican", "sentence": "…to Secretary Kennedy, to Secretary Rollins, to FDA Director Dr. Makary,  Dr. Oz at CMS, and Dr. Jay Bhattacharya at NIH for providing the real  science--and all the people that worked so hard to put together these  nutritional guidelines.\n\nAnd for all you naysayers out here, the science is never settled. I  don't absolutely agree with everything on…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698680/9999"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…I share the frustrations of many that the Senate altered our deal at  the last minute. However, our obligation is not to these emotions. It  is to the American people.\n\nWhile we all worked hard, especially our cardinals, to ensure that  all 12 bills would be signed into law before the January 30 deadline,  the Senate has put us on a different path.…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699575/consolidated-appropriations-act-2026"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…being  laid off, two-thirds of them with worse benefits. Even the workers who  enrolled in job retraining programs fared no better than the ones who  didn't.\n\n``Those people had worked there for 20 or 25 years,'' one laid-off  worker recalled. ``They were at the top end of the pay scales, and  there weren't any more TV repairman jobs out there.''\n\nToastmaster…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690533/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…It doesn't make you  popular telling the truth, but we all knew this.\n\nShould we have bailed out Blockbuster Video 15 years ago because  there were tens of thousands of people who worked for Blockbuster?  Should we have put Netflix out of business? Should we have slowed down  the internet? Should we have stopped the revolution of technology where  you…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694915/facts-and-math"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…The rule was improper  and it was invalidated by the Supreme Court, but they are not going to  come back in and reopen the plant.\n\nThose jobs are lost. The jobs of the people who worked there, who  then ate lunch at the local lunch facilities, or who might have bought  a car, or might have bought something else there in the very small town  of Glen Lyn,…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688523/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…where a sitting U.S. Congressman  handpicks his successor. Of all successors, he picks a staffer. There  is such contempt for the average people. I am sure these are people who  have worked for years in the Democratic Party or years in various,  different local elections. They are being shoved aside so that an  insider can grab the slot.\n\nMr. Speaker,…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696764/political-contempt-for-the-average-american"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…Program to the Best of Red Rock  Awards and the Red Rock StartUP! pitch contest, Carla's leadership left  a lasting mark.\n\nWhat stands out most is her deep love for the people she worked with,  the partners across Iowa, and the local citizens who showed up, rolled  up their sleeves, and believed in the future of their community.\n\nMr. Speaker, on behalf…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692297/recognizing-davenport-assumption-girls-soccer-team"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…a school  district that was hostile to Republicans. They felt they would be  discriminated against if they knew they gave money to a Republican  politician.\n\nThere are people who worked for the Department of Natural Resources  in Wisconsin, which is the equivalent of the EPA in Washington, who  tell me about problems in their department but caution me…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695628/breakdown-of-traditional-families"}, {"senator": "John Carter", "party": "Republican", "sentence": "…it very clear that the Secretary of the VA actually  did a YouTube video specifically denying firing anyone from the  Veterans Crisis Line when, in reality, he fired 24 people who worked on  the Veterans Crisis Line.\n\nIf there was any improvement to the Veterans Crisis Line in this  bill, it is thanks to my colleagues on the Appropriations Committee,…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692945/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}]