[{"senator": "Richard Neal", "party": "Democrat", "sentence": "…millions of Americans.\n\nMr. Speaker, I call attention to this because I have watched over  these years how the ACA has not only become more popular, but the  American people have come to expect the benefits of the ACA.\n\nThis argument for those of us who were here and participated at the  time was not really complex at all. The argument was that we would…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698788/breaking-the-gridlock-act"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…have shaped this  Nation. Yet, we know that honoring this history isn't just about  reflection. It is about action because that is what we owe people. That  is what we owe people.\n\nI come from Alabama, the birthplace of the civil rights movement, a  place at a time when this Nation and this world was experiencing  injustices that we cannot fathom today;…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687900/black-history-month"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…Presidents of both parties, including our conservative chief judge of  the Federal District Court of Minnesota issued opinions, and strongly  worded opinions, demanding that people come into court unless their  orders were followed.\n\nToday, the administration's top border official Tom Homan announced  the end of Operation Surge and the drawdown of the 3,000…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700059/9999"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…have their kids stay on their  family insurance plans until they turned 26.\n\nThe efforts to repeal it not only failed, but it has gotten stronger  over the years because people have come to realize that without it,  they might not be able to afford healthcare at all.\n\nI have decided to bring in a couple of comments from people in my  district. There are…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697216/medical-bills-are-too-high"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…and handcuffed? Our democracy is lost.\n\nI have been here for more than 32 years. I have come to this floor  often to speak out, to be angry, to be a voice for my people. I have  never come this close to having tears in my eyes as I speak to both  sides of this aisle about this horrendous incident that occurred.\n\nWe are a democracy, but we can lose that…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692471/alex-padilla"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…there suppresses free religious expression. They  force any church there, if they even allow it in, to speak in Russian,  not the native language, let's say, of where the people might come who  would want to have that ceremony in multilingual or even translated and  be able to listen to that. Russia doesn't do that. She is very inward.\n\nThe birthrate is…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690215/supporting-ukraines-independence"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…absolutely  capable of doing my job, but because I am a woman and because I chose  to have a baby, I have been prevented from doing so.\n\nMr. Speaker, I thank all of the people who have come forward on both  sides of the aisle in support of this effort, and I know that our fight  is far from over. We are not going to back down. We stand with the  people…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689709/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…development.\n\nDiane from Taos writes:\n\nPlease vote to stop the plan to rescind the Roadless Rule.       I lead herb identification walks in the Taos area . . . so       many people come to this state to enjoy the beauty of       untrammeled forest. We need to . . . stop Trump and his abuse       of our public lands.\n\nHannah writes from Santa Fe:\n\nOur forests…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695667/cloture-motion"}, {"senator": "Kweisi Mfume", "party": "Democrat", "sentence": "…were murdered that day, 150 or so were taken to the hospital, 18 of  which had to stay there.\n\nThese walls, these doors, these hallowed venues that we have walked  in and people have come to and thought of as being a symbol of  democracy were shattered unnecessarily.\n\nIt is important to find a way to commemorate this day. It is  important to remind the…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698547/january-6-attack"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…lower the high cost of living in  the United States of America, and then all of last year ran away from  Project 2025, and acted like it didn't exist.\n\nThen, Mr. Speaker, people come to town in the majority now and every  single part of the extremism that we have seen unleashed on the  American people is connected to Project 2025, every single part.…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…often called--many of us--the ``Big Ugly Betrayal.''\n\nOnly an authoritarian President who believes that the people answer  to him rather than him being accountable to the people would come up  with a strategy of decimating the healthcare through the ACA to fund  tax breaks for billionaires.\n\nOnly an authoritarian President would say: Let's demolish Medicaid…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "Mr. BOOKER. Mr. President, there is something extraordinary that  happens when we are here in the Senate. Every cycle, we see numerous  young people who come here to--one might call them indentured servants.  They are the pages.\n\nI have come to have a lot of respect for Katie Britt, but my work  with her every year in getting…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699130/senate-pages"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…appreciate and am grateful for the time to be able to do so, Mr.  Speaker, on this House floor.\n\nWe know that we are a Nation of great passion, of great debate, and  of people who come from all over to pay witness to our lawmaking.  People come from all over to get their ideas and their thoughts across.  They look up at a Capitol that inspires them,…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689752/reflecting-on-americas-history"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…it, using it for themselves, and those who are selling it--maybe those  who have a huge ring of selling it.\n\nMy point is that when there are mandatory minimums, all those people  come under the same rubric. The legislation, because it now makes  permanent fentanyl on the schedule I, the mandatory minimums apply, and  the harsh penalties do not consider…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692341/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…tourism. When  I came to Congress, the two big things in South Carolina were tobacco  and textiles. Today, it is transportation and tourism.\n\nTourism is big for my State. People are going to come to South  Carolina because of legislation on that southern campaign of the  American Revolution. They will come to South Carolina to visit the  South Carolina National…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689638/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…American citizens. No one is  denying that. That is a fact. But there is a process they are being  taken through. The law is being followed. I watched it personally.\n\nWhen people come across our border illegally, here is what is  actually happening along our border. They are arrested. They are being  instructed by law enforcement that they violated American…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690878/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…8 years from now, the Social Security trust fund is empty.  The law says you cut benefits. That is a 21 percent cut. We double  senior poverty in America. How many people do you think come behind  these microphones are willing to have a conversation of how we are  going to save it?\n\nThe first year, my math, actually the Joint Economic economists'  math,…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689381/us-borrows-billion-a-day"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…about 22, 23 years  old, so 20-some years from now, every tax in America, every tax, needs  to be doubled just to maintain baseline spending.\n\nMr. Speaker, how many people have you had come behind this mike and  who have just said: Look, is this moral? Is this really what America is  all about? Yes.\n\nI am going to show the slides that show what the Democrats…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697051/facing-fiscal-reality"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "…was  deeply passionate about issues that affected his constituents in  northern California.\n\nAs most of the Members of this Chamber know, we all have little silos  where people come to us for advice. I always could count on Doug to  give me the straight scoop on anything related to water, agriculture,  or rural America. That is why we elected him as…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698729/9999"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…about a lot of great words: ``equal  justice under the law,'' ``liberty,'' ``rights,'' ``freedom,'' but if  you don't have the rule of law, none of it matters.\n\nThe reason people come to the United States, the reason they flock to  our country from around the world, is because of the rule of law.  Enforcing our constitutional rights, given to us by God,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695203/people-are-sick-and-tired"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…hope for me. The camaraderie and  fellowship of seeking to follow Jesus together with colleagues kept me  grounded. There, I met Father Charles whose love for Jesus and people  come together in his own ministry.\n\nFather Charles provided patient counsel, consistent prayer, and  ongoing friendship--things he does naturally and always for God's  glory.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695909/recognizing-father-charles-trullols"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…are  sneaking into this country. We don't talk about the fact that over  800,000 people every year become new citizens.\n\nIn addition to that 800,000 new citizens, 500,000 people come here on  work visas. Another 500,000 come here on student visas. People being  what they are, many of these people on visas stay in the United States  anyway.\n\nIn addition…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699344/fundamentally-changing-immigration"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…immigrants from these Islamist  countries: If you hate this country, refuse to go by our laws, and  chant ``Death to America,'' it is time to go home.\n\nThere are a lot of good people that come from Middle Eastern  countries and go by our laws and assimilate with our culture, but if  you come here otherwise, it is time to go home.\n\nThe Trump administration is…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697927/immigration"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…year-over-year cost  given, A, the rising cost of healthcare; and, B, increased enrollment.  When you are the only State that is offering this most generous  benefit, it entices people to come to your State. Indeed, that is why  it went up 46 percent this year.\n\nThat is why, last year, the San Diego border sector had the most  illegal border crossings of any…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688154/protect-medicaid-benefits-for-american-citizens"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…our State. Iowans can be very proud that teachers like  Stephanie call our State their home.\n\nI visit about 10 to 12 high schools a year to have a Q&A with young  people because they never come to my open town meetings. One of the  surprises that happens at a high school is meeting Iowa's ``Teacher of  the Year.'' This year, that was Stephanie Pritts,…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697231/2026-iowa-teacher-of-the-year"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…colleagues, Mr. Speaker, that if you haven't stood in their shoes,  don't be critical of the job that they do because if you take the time  to go do it--and many times we have people who come and want to shadow  a Member of Congress for a day--it is a great opportunity to do that.  Take a minute and shadow a police officer for a day. Go on a ride-along  and…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691164/events-this-week"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…receipts go just to interest. Heaven forbid, if we had a 1 point  movement in interest rates, my math is 45 percent of all tax receipts  would go to interest.\n\nWhen you see people come behind these microphones, how many people  are saying: Hey, how do we convince the bond markets? The bond markets  are basically on the edge of running this country now…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694131/dismantling-californias-citizens-redistricting-commission"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…that they are probably doing  better than the average American who was born here and, indeed, larger  minorities for which we have statistics.\n\nI remind everybody that people who come here from India, who are the  most successful minority, Philippines, China, Japan, Cuba, the coast of  western Africa all are succeeding wildly in America. All it takes…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689133/educating-young-people"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…things here, they have no understanding of the math, the mechanics, but  somehow there were Medicaid providers in your State that had plenty of  cash lying around to fly people out to come lobby. So we did this, we  pulled open another Wall Street Journal article from a week or two ago  talking about how many people in the Medicaid systems in the United…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690586/economic-anxiety"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…just  arbitrary lines on a map. That is where the modern Democrat Party is.  They don't actually believe that America, as a sovereign country,  should be able to tell people who can come and who has to leave.\n\nSo that is what this whole thing is about. It isn't about Minnesota  or some recent event; this is about the Democrats failing to accept the…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700065/9999"}]