[{"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "One  of those policies has been Medicaid, and ensuring that more people have  health insurance, not just as a safety net when they get sick, but so  that they can get the preventative care, the screenings, the regular  checkups that will identify early risk factors or worse.", "title": "Raising Awareness About Men's Health", "date": "2025-06-09"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "For the State of Connecticut, where I am from, it is  actually about a $9 billion cut over the next 10 years in terms of the  Medicaid program, as well as eliminating the premium tax subsidies for  people who get their health insurance through the Affordable Care Act.", "title": "Stop This Insane Attack on Healthcare That Affects Every Single American", "date": "2025-06-24"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "At a  time when people are about to have their health insurance premiums  double or triple and when food programs are getting taken away, this  President says that his priority is to build a $250 million party room.", "title": "Trump Administration", "date": "2025-10-21"}, {"senator": "Thomas Suozzi", "party": "Democrat", "sentence": "Speaker, there are so many issues in our country  right now that are affecting our people, but one of the biggest  concerns is an urgent matter that on December 31 of this year, premiums  for people's health insurance are going to be skyrocketing because of  the expiration of the premium tax credits.", "title": "Healthcare Crisis", "date": "2025-12-11"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "Instead, they are pushing a bill that will throw people off of health  insurance.", "title": "Providing for Consideration of H.R. Military Construction, Veterans Affairs, and Related Agencies Appropriations Act, Providing for Consideration of H.R. Special Interest Alien Reporting Act of Providing for Consideration of H.R. Jeremy and Angel Seay and Sergeant Brandon Mendoza Protect Our Communities From Duis Act of and Providing for Consideration of H. Res. Condemning the Violent June 2025 Riots in Los Angeles, California", "date": "2025-06-24"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "For the past 3 weeks, the Congressional Black Caucus has brought  stories of the 22 million people who will see their health insurance  premiums double or even triple and, for some, spike beyond their  ability to pay when enhanced premium tax credits expire in 22 days.", "title": "Restoring Enhanced Premium Tax Credits", "date": "2025-12-09"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "It will be one that could dramatically change the bill,  including accelerating the timeline for kicking millions of people off  of their health insurance.", "title": "Providing for Consideration of S.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Office of the Comptroller of the Currency of the Department of the Treasury Relating to the Review of Applications Under the Bank Merger Act; Providing for Consideration of S.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Environmental Protection Agency Relating to ``Review of Final Rule Reclassification of Major Sources As Area Sources Under Section 112 of the Clean Air Act''; and Waiving A Requirement of Clause 6(A) of Rule Xiii with Respect to Consideration of Certain Resolutions Reported From the Committee on Rules", "date": "2025-05-20"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "They are going to find  themselves in a terrible situation when these same sick people, with no  health insurance, come to the hospital.", "title": "Government Funding", "date": "2025-11-05"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "It can only come from kicking people off of their health insurance so  that Elon Musk and the billionaires can get another tax cut that they  don't need.", "title": "Providing for Consideration of Senate Amendment to H. Con. Res. Concurrent Resolution on the Budget for Fiscal Year 2025", "date": "2025-04-09"}, {"senator": "Eric Sorensen", "party": "Democrat", "sentence": "Their bill would take away food from hungry families and kick people  off their health insurance, all so the richest people who walk the face  of the Earth get a bigger tax break.", "title": "Gop Tax Scam Hurts Women and Families", "date": "2025-05-20"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "Let's do  something to help these people keep their health insurance.", "title": "Healthcare", "date": "2026-01-07"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "People's health insurance  premiums are doubling and tripling because this majority has failed to  act.", "title": "Providing for Consideration of S.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Bureau of Land Management Relating to ``National Petroleum Reserve in Alaska Integrated Activity Plan Record of Decision''; Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Bureau of Land Management Relating to ``Buffalo Field Office Record of Decision and Approved Resource Management Plan Amendment''; Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Bureau of Land Management Relating to ``Coastal Plain Oil and Gas Leasing Program Record of Decision''; Providing for Consideration of H. Con. Res. Denouncing the Horrors of Socialism; Providing for Consideration of H.R. Unlocking Our Domestic Lng Potential Act of Providing for Consideration of H.R. Researching Efficient Federal Improvements for Necessary Energy Refining Act; Providing for Consideration of H.R. Common-Sense Law Enforcement and Accountability Now in DC Act of Providing for Consideration of H.R. District of Columbia Cash Bail Reform Act of and for Other Purposes", "date": "2025-11-18"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "People have figured out enough in  terms of deficit impact, taking away people's health insurance  coverage, and the impact on services, particularly in the hospital  sector, which they warned us about before the bill was passed.", "title": "Congress' Long To-Do List", "date": null}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "If we cut people off their health insurance and less money goes  to hospitals, nursing homes, health clinics, people will not be able to  get healthcare.", "title": "One Big Beautiful Bill", "date": "2025-06-17"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "Can we have that  conversation over the next year, but not, in some cases, have people's  health insurance go up by 600 percent?", "title": "Continuing Appropriations and Extensions Act, 2026", "date": "2025-11-10"}, {"senator": "John Thune", "party": "Republican", "sentence": "Now, I am going to show you here, first off, where most people get  their health insurance coverage in this country.", "title": "Healthcare", "date": "2025-12-10"}]