[{"senator": "Luz Rivas", "party": "Democrat", "sentence": "…Ms. RIVAS. Mr. Speaker, the work we do in Congress should improve the  lives of our constituents, not focus on vanity projects for an  egomaniac or line the pockets of people who don't need it.\n\nWe heard from several talented and dedicated Democratic freshmen  tonight about the work that they are doing to make life more affordable  for their constituents.…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699584/stop-the-republican-affordability-crisis"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…need to know about Republican  leadership priorities.\n\nPresident Trump says that he has concepts of a plan and has been  making empty promises for a decade, but the American people don't need  concepts. We need affordable healthcare now.\n\nI am very glad that 17 of my Republican colleagues joined Democrats  today in doing the right thing by voting to extend…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698673/protecting-healthcare-for-millions-of-americans"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…going to be very costly because hungry kids don't learn when  they go to school. Senior citizens who take their medication on an  empty stomach end up in an emergency room. People who don't have access  to decent nutrition end up with chronic illnesses that last a lifetime.  Workers who are hungry are less productive in the workforce. That is  what my friends…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692265/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…would desire to know  what is contained herein.\n\nI will call for a vote to impeach authoritarian Donald John Trump at  a time to be determined, knowing that the American people don't expect  me to always win. I am going to elaborate on this before I finish this  sentence.\n\nThe American people don't expect me--I don't speak for anybody else.  This is…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691346/proud-to-be-an-unbought-unbossed-liberated-democrat"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…have been waiting. I have been asking  everybody. Not only the chairman but any Republican that wants to make  a statement, if they could just explain to the American people. They  don't have to explain it to me. Explain it to the American people. Just  give me some explanation of why the President of the United States  would pardon convicted drug traffickers.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698456/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…While they sat on their couch for 8 weeks, we were working. We  listened to people who told us their health insurance premiums are  doubling and tripling. We heard from people who don't understand why  you guys moved at the speed of light to give tax breaks to billionaires  but won't lift a damn finger to extend the tax credits that help ensure  people's…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696693/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Treasury secretary, a  billionaire; his education secretary, a billionaire; his entire  Cabinet, Health and Human Services, Energy, Interior, all led by  billionaires.\n\nThese people don't shop for themselves or they don't worry about  paying rent. They don't care about us. Trump said he would drain the  swamp. What a bunch of BS. He moved the swamp into…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699220/providing-for-consideration-of-hr-supporting-pregnant-and-parenting-women-and-families-act-providing-for-consideration-of-hr-pregnant-students-rights-act-and-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…``gotchas'' that will stand between millions of  voters and the ballot box.\n\nAccording to the Brennan Center, more than 9 percent of voting-age  American citizens, 21 million people, don't have proof of citizenship-- typically a birth certificate or a passport--readily available to show  as they try to vote.\n\nAnd 4 million Americans don't have these documents…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690531/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…though I walk through the valley of the shadow of  death, I will fear no evil . . . Thy rod and Thy staff they comfort  me.''\n\nThis is my comfort.\n\nMr. Speaker, there are people who don't believe that I should have  the free speech that the Constitution affords me, and I am not always  in the company of people who can protect me. So my cane has become…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689201/and-still-i-rise-censured-but-not-silenced"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…impacts for everyone who  seeks healthcare and tries to buy insurance to pay for it.\n\nThe Republican proposal is an abject failure when it comes to  ensuring that the American people don't pay more for healthcare. And I  heard from constituents just over this past weekend as I went to the  Durham Fair, as I went to the mum parade in Bristol, as I went to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695873/9999"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…as a people. You know, I think the thing that he said right after Alex  Pretti was killed was that not only was he a domestic terrorist, but he  was an assassin.\n\nThese people don't understand who we are, and they certainly don't  understand that the American public does not tolerate this kind of  authoritarianism.\n\nSo what do we need to do? We need…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699401/9999"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…treatment  will be left out in the cold. We literally will see an increase in  overdose deaths, law enforcement run-ins, and incarceration rates.  Where do you think these people go when they don't have behavioral  health treatment for fentanyl?\n\nAll this costs taxpayers more, actually, a lot more, a lot more than  just covering Medicaid. It would be better…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692972/one-big-beautiful-bill"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…rehabilitate the bill in  the eyes of the public, but Americans aren't stupid. They don't want  their healthcare taken away. They don't want us taking food away from  hungry people. They don't want our rural hospitals to close. They don't  want to add trillions of dollars to the debt, and they sure as hell do  not want the wealthy to continue to get rich off…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693089/what-americans-want"}, {"senator": "Ron Johnson", "party": "Republican", "sentence": "…speak to this issue. We should give them time to  speak--hopefully, to convince our colleagues on the other side to,  again, be fair: Think about what your vote means to people that don't  want to be used as pawns.\n\nI believe, again, that the Senator from Texas, our chairman of the  Commerce Committee, he has got some pretty, as I said, chilling  information…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696605/9999"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…of the floor, I would be here every single day introducing bills. I see  Senator Reed here. He would be doing the same thing, introducing bills  to help the American people. But I don't have control of the floor.\n\nI am not criticizing the people who do. That is above my pay grade. I  am labor. They are management. But I know this, first, if we will…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697423/the-economy"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…Members of Congress ought to be treated like  everybody else or you don't. You either think that we are more  important and smarter and more virtuous than the American people or you  don't, and I think we ought to be treated the same.\n\nNow, having said that, I said I agreed with what Senator Paul said. I  am just worried his name on the bill is going…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696561/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…So let's make it very clear. The Afghan terrorist attacked these two  soldiers because that is what Islam teaches. The Quran says to kill all  infidels. That means all people who don't believe in Islam.\n\nSo let's not mince words about this. Islamists want every single  American, and especially Christian Americans, they want them dead.\n\nIn 2021, Joe…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697927/immigration"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…economy and have a job. What this regulation would do is  to take that away.\n\nAs I talked about with Glen Lyn, if you start shutting down  factories, you shut down towns, and people don't have jobs. Then you  will have people who are clearly going to have more issues with their  health than they currently have.\n\nFurther, in regard to the various things that…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688523/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…close--I said: Mr. President, if I prove anything  else to you in the next year and a half, I hope that I can prove to you  that I care about your legacy, and you have people around you who  don't.\n\nThere are people who are surfing his wave until they go to the next  one. They are young people who have never served in office and don't  understand the consequences…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699082/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Speaker and my  colleagues, we each represent three-quarters of a million people, give  or take, but we also try to be a voice for everybody. We try to be a  voice for the people who don't have a voice.\n\nThe people that I represent and the people across this country that I  talk to are sick and tired. They are sick and tired of being put in  danger because…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695203/people-are-sick-and-tired"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…work that way. You actually didn't get anything  from it. You did a suppression of working people's wages, and this one  takes us out about a decade.\n\nI don't know why people don't think, don't understand, these almost  basic economic--we all went to our high school economics class, right?  Here is what is coming. You have the 23 percent cut coming in 2033.…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693062/stop-bathing-in-folklore-and-start-bathing-in-math"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…and  warnings about how immigrant children called unaccompanied children are  handled by Republican and Democrat Departments of Health and Human  Services. When immigration people don't have the capabilities or  probably the legal right to determine where unaccompanied children  should be handled, they are turned over to a division in the Department  of…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699108/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…floor this evening and to give that opportunity to some of  my colleagues also, if their schedule permits.\n\nWe don't get enough opportunities to speak to the American people,  and I don't get enough chances to speak to my constituents back home,  particularly from the House floor. I think it is a unique opportunity  that I will get to address a few things…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691960/supporting-the-big-beautiful-bill"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…insurance  companies for people who didn't even use their plan.\n\nI want to say this, and then I am going to yield to my friend from  Missouri: We have solutions. When people say that Republicans don't  have a plan, it is false. We put out plans. We have put out solutions.  We have solutions.\n\nWe believe in expanding people's access to care by empowering them…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698106/bringing-america-back-to-its-roots"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…zoning laws and controls, for rules and regulations,  housing starts.\n\nA lot of the people--I am not just picking on Colorado; this is true  in every State--a lot of the people don't want more houses built. Why?  Because they already own a house, and it is worth a lot of money, and  it is a big part of their nest egg. They know that if, in their area,…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699012/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Mike Simpson", "party": "Republican", "sentence": "…Agencies Appropriations Act.\n\nFirst, I commend Chairman Cole for his leadership over the  Appropriations Committee and his continued support of the Interior  bill. A lot of people don't realize how hard it is to get all these  bills done. We had them all marked up through the committee by the end  of September, on time. That is an amazing task by the chairman…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698758/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…the mother of these classes, said: The complete  destruction of the traditional marriage and the nuclear family is the  utopian goal of feminism.\n\nI have a feeling a lot of people don't realize that the utopian goal  of feminism was to get rid of the nuclear family. Obviously, Kate  Millett's successors are probably thrilled that we penalize married  couples…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695628/breakdown-of-traditional-families"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…$800,000 or almost $900,000 per unit.\n\nThat is not the norm, but think of it. The government pays somebody  70 percent of the cost of a building. Is it surprising that these  people don't put marble countertops in? Is it even surprising that it  costs $800,000 or $900,000 per unit?\n\nHow in the world under any circumstances in a budget in which the  government…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692064/monitoring-big-beautiful-bill-provisions"}]