[{"senator": "Janelle Bynum", "party": "Democrat", "sentence": "…colleagues in telling Speaker  Johnson that we are fed up and that it is time to work on costs.\n\nI will keep sounding the alarm until we start helping the American  people.\n\nMr. Speaker, it is time for us to get serious.", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690692/time-to-focus-on-costs"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…the cost of childcare,  expanding health coverage, creating new pathways to  homeownership, raising the minimum wage, and expanding tax deductions  for working-class people.\n\nMr. Speaker, after Thanksgiving season, where so many families felt  the strain, the message from Delaware is clear: We need solutions, not  tariffs and cuts to healthcare but policies…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697421/delaware-day"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…not supersede the rule of law or  loyalty to uphold the Constitution. This bill doesn't just take power  away from judges, but it takes power away from the American people.\n\nMr. Speaker, I urge my colleagues to vote against this legislation.", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689723/no-rogue-rulings-act-of-2025"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…billionaires and big corporations.\n\nI strongly oppose this bill. It forfeits our global leadership,  undermines our national security, and steals from the American people.\n\nMr. Speaker, I urge my colleagues to vote ``no.''", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693721/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Jim Costa", "party": "Democrat", "sentence": "…deliver on the promises  to ensure that no one has to choose between healthcare and their basic  needs of the safety net that is a contract that we have with the  American people.\n\nMr. Speaker, our constituents are counting on us. Let us not fail  them. Americans deserve affordable healthcare, and we have until the  end of this month to make that happen.", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697385/healthcare-crisis"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…of increasingly hostile words and  actions from China and predictably flimsy support from the President,  it is important that Congress stand strong for the Taiwanese people.\n\nMr. Speaker, I again urge my colleagues to support this bill, and I  yield back the balance of my time.", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699847/pressure-regulatory-organizations-to-end-chinese-threats-to-taiwan-act"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…sanctions and restricting  Burma's access to support from the International Monetary Fund. These  are sensible steps to demonstrate Congress' continuing support for the  people of Burma.\n\nMr. Speaker, I urge my colleagues to support this bill, and I reserve  the balance of my time.\n\nMr. Speaker, in closing, this bill aims to address the ongoing  humanitarian…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699833/bringing-real-accountability-via-enforcement-in-burma-act"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…stand alone. We want to be able to tell them that we  really believe that we can make a difference, that we can provide  affordable, quality healthcare for everyday people.\n\nMr. Speaker, Democrats stood united, as you know, for more than 40  days during the Republican-caused shutdown to prevent this, but here we  are. Republicans refuse to negotiate.…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697648/restoring-enhanced-premium-tax-credits"}, {"senator": "Maggie Goodlander", "party": "Democrat", "sentence": "…we are  united by things that are really powerful. We are united by a love of  our country, by a belief in our country, and by a belief fundamentally  in the American people.\n\nMr. Speaker, I was born and raised in the greatest State in the  Nation, the State of New Hampshire, the State that made the Nation. We  were the ninth to ratify the Constitution.…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689083/economic-populism"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…these closed processes that don't allow you--even  you--to be able to offer amendments, and stand up for policies that are  going to make life easier for all people in this country.\n\nMr. Speaker, I have to tell you, I love my Republican friends. They  just reach back. Now, we are going back to Obama.\n\nWhat they don't tell you is that Donald Trump has…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697303/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…employee, one of Elon Musk's junior lieutenants who  spent his career at Tesla, and then he decided he was going to wipe out  hundreds of millions of dollars going to our people.\n\nMr. Speaker, are our colleagues going to allow DOGE to get away with  this critical destruction of law enforcement in rural communities,  urban communities, and suburban communities…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691349/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…concerns of the  public, and we strongly urge our Republican colleagues to come to the  table to pass commonsense legislation that brings prices down for the  American people.\n\nMr. Speaker, I stress again that the President promised to cut  Americans' power bills in half. Instead, he and his Republican  accomplices in the House are causing those prices…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698275/reliable-power-act"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…gut our  public health agencies, silence our scientists, and roll back critical  environmental protections. It proves just how out of touch they are  with the American people.\n\nMr. Speaker, my message to the Oregonians watching is simple: I will  stand on this floor time and again to raise their voices and make sure  they are heard because, as a doctor,…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688525/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…Department of Justice weaponized not to go after the  criminals but to go after career FBI agents who have done nothing but  serve the public and fight crime for the American people.\n\nMr. Speaker, let me be clear. As we move past 100 days, I will never  stop fighting for those I represent against the abuses of this  administration. We are not just battling over…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690639/trumps-first-100-days"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…foremost leaders in raising  environmental awareness. And Time Magazine, in its category of Leaders  and Revolutionaries, named him one of the world's most influential  people.\n\nMr. Speaker, as we welcome His All-Holiness Ecumenical Patriarch  Bartholomew to Washington, D.C., let us also celebrate his unwavering  commitment to interfaith dialogue, peace,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695586/recognizing-the-spiritual-head-ecumenical-patriarch-bartholomew"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…President's desk so we do not put American  Federal workers and American soldiers and American public servants out  of work. We let them do their job on behalf of the American people.\n\nMr. Speaker, I urge all of my colleagues on both sides of the aisle  to support what is genuinely a bicameral and bipartisan product and one  that the President will sign and has…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699575/consolidated-appropriations-act-2026"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…budget resolution is  how we get it done. Once adopted, our committees and the entire House  will begin detailed work to achieve these important goals for the  American people.\n\nMr. Speaker, I warned everybody that this is what we were going to  hear. We were going to hear these outrageous claims that are simply not  true.\n\nThe fact is that the rhetoric…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689862/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…racist. She has written about how:  ``I do wish Hillary''--meaning Hillary Clinton--``wouldn't use the  language of `boy and girl'--it's erasing language for non-binary  people.''\n\nMr. Speaker, this is the person running the outlet the other side of  the aisle wants our tax dollars to subsidize.\n\nOf course, she has written extensively about race, about how…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693722/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…that the  use of facts has absolutely crashed. If you actually read it, it has  crashed. We now talk about our feelings and intuition because that is  how we manipulate people.\n\nMr. Speaker, it is in Nature publication right now. Go pull up the  academic article. That is what goes on behind these microphones day  after day after day, is we have people who…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691811/actual-solutions"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…evolving needs of Members and other users. Passing  H.R. 1234 is a logical next step in maintaining CONAN's relevancy and  usefulness, both to Congress and to the American people.\n\nMr. Speaker, I urge my colleagues to join me in supporting H.R. 1234.  I urge quick action in the Senate, and I reserve the balance of my  time.\n\nI thank the ranking member, Mr.…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689324/repeal-requirement-for-congressional-research-service-to-prepare-annotated-constitution-and-supplements-in-hardbound-version"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…regulations, we have no choice in Congress but  to address the onslaught of these policies before they destroy  businesses and make life more expensive for the American people.\n\nMr. Speaker, let us be pragmatic and use common sense in our  policymaking, and I urge my colleagues to join me in supporting H.J.  Res. 61.", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688524/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…manufacturing facilities, we are going to need the energy to do that.  Now, we have an administration that understands it and will not be  politically driven by just a few people.\n\nMr. Speaker, with my comments, I will say one last thing. Energy  independence and critical mineral dominance is a Trump administration  agenda. That is the America First agenda…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688634/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…that was over a decade ago, but the Democrats on the  committee insisted that the witnesses were wrong and that Republicans  were merely trying to scare the American people.\n\nMr. Speaker, unfortunately for the American people, the witnesses  were right. The so-called Affordable Care Act has, in fact, negatively  impacted the price of health insurance…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698304/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…process and  allows our work to begin. Once adopted, our committees and the entire  House will begin detailed work to achieve these important goals for the  American people.\n\nMr. Speaker, this rule also provides for consideration of two  Congressional Review Act measures: H.J. Res. 20 and H.J. Res. 35.\n\nH.J. Res. 20 provides for congressional disapproval…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688089/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions-and-providing-for-consideration-of-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…solution . .  .'' here. Democrats all have proven that. ``Government is the  problem,'' and we have the solution that actually delivers the  affordability to the American people.\n\nMr. Speaker, I urge my colleagues to support it.", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698366/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…good news is, Mr. Speaker, by passage of the underlying  legislation that we are going to be discussing today, the government is  open and operational for the American people.\n\nMr. Speaker, no bill is perfect, and the bill we passed to reopen the  government is just that. It had a provision that needs repair, which we  need to go in and remove out from…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696929/repeal-of-senate-notification-requirements-relating-to-legal-process-on-disclosures-of-senate-data"}, {"senator": "French Hill", "party": "Republican", "sentence": "…options.\n\nLet's deliver this real solution and return the housing market back  to working for the very people that it should serve, the very people we  do serve in the people's House.\n\nMr. Speaker, I urge my colleagues to support this bill, and I reserve  the balance of my time.\n\nMr. HILL of Arkansas.  I include in the Record the CBO estimate for this bill.…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…these beautiful  speeches about defending the working class.\n\nThis is coming to us. This is part of the battle. Understand those  tax hikes aren't just going on rich people. Mr. Speaker, 62 percent of  the tax-paying population actually see their taxes go up. I am going to  show some distributional charts later.\n\nAfter 2017, remember we actually made…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688651/a-real-math-problem"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…legislation I have offered can be a first step  in saying we need to find more common ground. We need to get back to  the issues that actually matter to the American people.\n\nMr. Speaker, one of the worst consequences of this redistricting war  we see breaking out across the country is that it has provided a  pretext for the Governor of California to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}]