[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…of law was so well entrenched in this country as to be sacrosanct,  beyond reproach or repeal. We were wrong. It depends on norms; on  shame, even; on the willingness of people in power to accept limits on  that power. When those restraints disappear, when corruption becomes  routine and impunity becomes expected, the Republic is in deep danger.\n\nThe…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700133/climate-change"}, {"senator": "Andrea Salinas", "party": "Democrat", "sentence": "…introduced legislation to support clinicians who  commit to practicing in rural areas and to expand telemental health  services tailored to farmers, fishers, and foresters, the people who  power our rural economies.\n\nAccess to quality care should not depend on your ZIP Code. I urge my  colleagues to join me in ensuring rural Americans are no longer  overlooked…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696908/rural-mental-healthcare"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…unchecked,  this campaign will not stop with ABC or with Disney. Every newsroom,  every broadcaster, every local affiliate will hear the message loud and  clear: Criticize the people in power, and you risk your license, your  livelihood, your very ability to operate.\n\nThat conversation is taking place in newsrooms all across our country  today. Look what happened…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695700/authorizing-the-en-bloc-consideration-in-executive-session-of-certain-nominations-on-the-executive-calendar"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…on the phone. I wasn't  saying: Hey, who did you vote for? I said: Hey, can you help my dad?\n\nThat is what Americans across this country are asking, like, are you,  the people in power, the people with the gavel, are you going to help  me?\n\nMake me drop my notes.\n\nI want the party in power to say: Yeah, I am going to help you. I am  going to prioritize…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695040/better-is-possible"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…50 to 60 miles  per hour winds that ultimately, in some places in the State, were  recorded at 90 miles per hour winds. So, this morning, we are facing  350,000 people who are without power and a blizzard on the way.\n\nAnd, while I think that some people think, well, it is a very  mountainous area and you should probably have severe winter weather,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698254/nominations"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…my right is signing a discharge petition to release the  Epstein files.\n\nThey need to be released because the American public wants to see  them. The fact that so many people in power don't want them released  says there is something there that smells.\n\nWhat smells is the fact that children, girls, were raped and sexually  abused. The people who did…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694814/release-epstein-files"}, {"senator": "Jan Schakowsky", "party": "Democrat", "sentence": "…in the fight to protect all Americans' health care. While we  did not win this battle, the fight is not over. The power of the people  is always greater than that of the people in power.\n\nAs long as discrimination still exists and as long as there are those  who seek to undermine existing law, the purpose of the ADA will not  have been completely met.…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694026/recognizing-the-22nd-annual-disability-pride-parade"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…sides of the aisle and  coming to the floor and reaching out to the American people. Just as we  threw off the yoke of monarchy 2\\1/2\\ centuries ago, the American  people still have the power to determine their own future. They still  have the courage to make ``good trouble,'' as John Lewis, the historic  voting champion, famously said. Most of all, the…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696440/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…Presidential power grab because that  was envisioned by our Constitution. That is why it was written the way  it was. It was written to prevent power grabs. There are people with  power right now allowing this to happen.\n\nAs Trump tramples on the Constitution, some of our most elite and  powerful individuals and institutions are  failing to defend our…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695733/why-i-came-to-congress"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…you catch it, document it, and risk retaliation by  demanding the pay that you have earned. To put it another way, the law  puts the burden of enforcement on the people with the least power.\n\nH.R. 2312 makes this even worse. It would massively expand employers'  power to treat far more workers and far more hours as tipped wages.\n\nOregon does this differently.…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698948/providing-for-consideration-of-hr-protecting-prudent-investment-of-retirement-savings-act-providing-for-consideration-of-hr-flexibility-for-workers-education-act-providing-for-consideration-of-hr-empowering-employer-child-and-elder-care-solutions-act-providing-for-consideration-of-hr-tipped-employee-protection-act-and-providing-for-consideration-of-hr-save-local-business-act"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…stronger.\n\nOn behalf of Illinois' Third Congressional District, it is my honor  to commend Juliet De Jesus Alejandre for her bold, loving, and creative  leadership that builds people power to shape our future because we know  ``el pueblo unido jamas sera vencido''; ``the people united shall never  be defeated.''\n\nMr. Speaker, I thank and congratulate Juliet…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698984/recognizing-frank-chapman"}, {"senator": "Jacky Rosen", "party": "Democrat", "sentence": "…help working people. Let's pass it today.\n\nNevadans sent me here to fight for them, and so I am going to keep  working to lower costs, to raise wages, and to make sure people who  power our economy--our working families--can keep more of what they  earn. And through this bipartisan bill, it shows that I am not going to  allow Washington gridlock and…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691423/no-tax-on-tips-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…just all get  along?''--after he had been badly, badly beaten.\n\nThe fact is, it seems like we have a long ways to go to erase  prejudice from our hearts, and when people gain positions of power who  carry that prejudice in their hearts, it often becomes open hatred and  amplifies the ability of others to more openly discriminate or engage  in provocative…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…It will  undermine our national security. It will threaten lives across the  world and kill children.\n\nOn top of that, it undermines our Constitution, the power of the  people, the power of the purse, and the separation of powers in our  Constitution, as Russell Vought, OMB, and the architects of Project  2025 are trying to use this rescission bill to…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693707/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…It is because Democrats are on the defensive to protect the Big  Government that they have created over time, while Republicans want to  put government closer to the people, take power out of Washington,  D.C., and truly put America first.\n\nMr. WESTERMAN.  Greene).\n\nMr. Speaker, as we wrap up this so-called debate today, I want to  remind everyone of…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690939/gulf-of-america-act"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…assembly lines that built modern  civilization. Even the things we didn't invent, we perfected.  Everything that mattered happened here.\n\nBut, over the last few decades, the people in power squandered that  inheritance. They sent our children and our wealth overseas to defend  the borders of distant nations while throwing open our own borders to a  tidal…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690533/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…program.  He had been arrested in New York for endangering a child and released;  arrested again for shoplifting and released again without citation.\n\nTime and time again, the people in power in this country were given  the chance to stop them as if God Himself was begging them to do  something. Time and time again, they refused. And now, another American…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699689/immigration"}]