[{"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…other 76  applicants. Our community is fortunate to have an incoming Chief with  the years of experience and education that John brings to this role.\n\nOn behalf of the people of Colorado's Seventh Congressional District,  it is my honor to congratulate John Curtis on his promotion to Chief of  South Metro Fire Rescue. We thank him for his continued commitment…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692026/recognizing-john-curtis"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…Chaffee County residents in their time of need. The  Chaffee County community will remember Annette's role in keeping them  and their loved ones safe.\n\nOn behalf of the people of Colorado's Seventh Congressional District,  it is my honor to thank Annette Stolba for her four decades of service  to the citizens of Chaffee County.", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688126/recognizing-annette-stolba"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…has championed the physical and  mental well-being of his team through workplace wellness programs, and  we are incredibly grateful for his hard work.\n\nOn behalf of the people of Colorado's Seventh Congressional District,  I am honored to congratulate Chief Bob Baker on his retirement.", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692015/recognizing-chief-bob-baker"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…Throughout his career, he was a visionary leader who  always put people first, and his lifesaving leadership across Colorado  will not be forgotten.\n\nOn behalf of the people of Colorado's 7th Congressional District, it  is my honor to congratulate Fire Chief David Ramos for his more than  four decades of service with the North Metro Fire Rescue District…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695834/recognizing-fire-chief-david-ramos"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…and her passion for helping people overcome  obstacles in their lives. She'll be remembered as an important part of  the Jefferson Center's legacy.\n\nOn behalf of the people of Colorado's Seventh Congressional District,  it is my honor to congratulate Dr. Kiara Kuenzler for being recognized  as the ``2025 Remarkable Woman of Denver.''", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692052/recognizing-dr-kiara-kuenzler"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…credit  and the earned income tax credit for working people here?\n\nMr. President, I am going to finish. I do want to read some letters  that have been written to me from people in Colorado who are deeply  concerned about these cuts to Medicaid.\n\nI want to also say a word of thank-you to the people that have come  to my townhalls--sometimes with their children,…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689543/h-con-res-14"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…Chamber has hosted a variety of events, which bring the community  closer together and has paved the way for the town to foster a thriving  economy.\n\nOn behalf of the people of Colorado's Seventh Congressional District,  it is my honor to congratulate the Conifer Area of Commerce for 50  years of service and thank them for their contribution to our…", "date": "2025-08-08", "source_url": "https://justfacts.votesmart.org/public-statement/1694715/recognizing-the-conifer-area-chamber-of-commerce"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…the richest country in the world.\n\nYet the inability of us to be able to finish this project--this joint  project--has made it impossible for the hard-working people in  southeastern Colorado to have the benefit--a benefit that other people  just take for granted because they live maybe closer to a city or in a  wealthier area than where the people…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698766/9999"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…national model of  public education through its commitment to offer concurrent enrollment,  industry-recognized credentials, and work-based learning.\n\nOn behalf of the people of Colorado's 7th Congressional District, it  is my honor to congratulate this school, staff, administration, and  board members for this accomplishment and thank them for their…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695848/recognizing-canon-city-high-school"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…changing economy. Joe is a true public  servant, and generations of students will remember his dedication to  higher education long after his retirement.\n\nOn behalf of the people of Colorado's Seventh Congressional District,  it is my honor to congratulate Joe Garcia and thank him for his  commitment to the people of Colorado.", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689302/recognizing-chancellor-joe-garcia"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…school, live with a  host family, and collaborate with the Department of State to promote  cultural exchange between Americans and the German people.\n\nOn behalf of the people of Colorado's Seventh Congressional District,  it is my honor to congratulate Avi Bender for this impressive  accomplishment and wish Avi all the best for this upcoming year in…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693199/recognizing-avi-bender"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…Poncha Springs, Elevation Beer Company provides excellent  service and beers, contributing to Colorado's leadership in producing  outstanding craft brew.\n\nOn behalf of the people of Colorado's Seventh Congressional District,  it is my honor to congratulate Elevation Beer Company for this  accomplishment.", "date": "2025-08-08", "source_url": "https://justfacts.votesmart.org/public-statement/1694717/recognizing-elevation-beer-company"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…benefited from his hard work and commitment  to creating a better future for all, and his absence will be felt by  the community he served so well.\n\nOn behalf of the people of Colorado's 7th Congressional District, it  is my honor to thank President Buchanan for his hard work and  dedication to serving his country and his community.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695840/recognizing-morgan-jay-buchanan"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…World Championships to be held in Pontevedra, Spain next  year. We are incredibly proud that he'll represent the United States at  this global event.\n\nOn behalf of the people of Colorado's Seventh Congressional District,  it is my honor to congratulate Alex Willis for his win at the 2025  Winter Triathlon National Championships, and join his friends and…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692077/recognizing-alex-willis"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…back to the legal community by serving as a guest  lecturer at law schools such as the University of Denver and helps  clients in his private practice.\n\nOn behalf of the people of Colorado's 7th Congressional District, it  is my honor to congratulate Tom Downey for his awards and thank him for  his contributions to our community.", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696277/recognizing-tom-downey"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…Management Resource  Management Plan for North Dakota.\n\nFirst, let me respond briefly to my colleague from Colorado's  comments about energy costs. His constituents, the dear people of  Colorado, and many other constituents in blue States, like New York and  California, probably are paying record prices for electricity and other  energy products. That is because…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694907/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…but in many States and many cities, they are being stopped by  local government.\n\nAnd you say: Whoa. Why? Why would a councilwoman or a councilman in a  city of 100,000 people in Colorado not want to see more houses built?\n\nI will tell you why: because that city councilperson--man or woman-- controls the zoning laws and controls, for rules and regulations,…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699012/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}]