[{"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…special connection to Latin America  and the Caribbean. Hence, we have crafted a series of recommendations,  a roadmap if you will, for democracy and prosperity for the people of  Venezuela.\n\nOur first priorities will support a free and democratic Venezuela.  That means rejecting authoritarian governance, whether the orders come  from the Miraflores Palace…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698765/venezuela"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…what we are doing in Venezuela.\n\nAnd, then, it doesn't have anything to do, apparently, with the  restoration of democracy in Venezuela or the best interests of the  people of Venezuela, because immediately after the action was taken  against Maduro, the Trump administration lined up behind Maduro's  second in command, who is, as we speak, ramping up…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698610/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…he could distract  from the lousy economy and the fact that he is still covering up the  Epstein files. I think it is about theft because the oil being taken  from the people of Venezuela is being sold off and used to finance a  slush fund in Qatar controlled by, you guessed it, Donald Trump.\n\nI don't think I have ever seen such a brazen example of corruption…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699359/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…We were bringing the opposition and at that  time the Chavistas together.\n\nMr. MEEKS. Mr. Speaker, we were diplomatically working together. We  were trying to help the people of Venezuela.\n\nIn fact, we can also see how long ago that was. I had all-black hair  at the time. I think I looked good. I got gray. I had all-black hair  because that was back in…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698456/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…States, take control of your oil. Sorry,  Venezuela.\n\nWell, this certainly wasn't about the future of a better Venezuela  for Venezuelans. You know, just 18 months ago, the people of Venezuela  voted in a Presidential election, and they voted for a man named  Gonzalez, who was a stand-in for the champion of democracy, Maria  Machado, who just received the…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698617/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…than 100 people in its strikes on alleged  drug boats. In the President's own words, this campaign is simply about  seizing Venezuela's oil and profiting from it.\n\nThe people of Venezuela have suffered extraordinary hardship under  the Maduro regime. They have voted in multiple elections for new  leadership and have been denied their choice through fraud…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698780/venezuela"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…cut the staffing back so much? Do you  have any idea what is actually happening at the local level in this  country? No one in this Chamber is a fan of Maduro, and the people of  Venezuela have a humongous, difficult task of building their country  forward now, but why behave deceitfully when you swore an oath to the  Constitution of the United States.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698837/reflecting-on-impact-of-illegal-action-in-venezuela"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…their heads around that  something can be about more than one thing at a time. It can be about  Maduro and his lawlessness. It can be about drugs. It can be about the  people of Venezuela. It can also be about making sure sanctioned oil  doesn't flow around the globe. It can be about more than one thing.\n\nMr. MAST. Mr. Speaker, again, my Democrat colleagues…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699364/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…administration's willingness to brief Senators on  the sensitive details of a tactical victory. But they owe it to the  American people--and, frankly, the long-suffering people of Venezuela-- to lay out the path to strategic success in much greater detail.\n\nIf the aim is to reestablish American primacy in its near abroad,  great. If the idea is to evict…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698662/venezuela"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…tyrants around the world that America is back; the triumph of American  arms; and most of all, setting the stage for the return of liberty,  justice, and prosperity to the people of Venezuela.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698660/lessons-from-caracas"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…sponsored socialism. In fact, I wrote a book, ``The Case Against  Socialism,'' describing the historic link between socialism and state- sponsored violence.\n\nI wish the people of Venezuela well and sincerely hope that they will  not repeat the mistake of electing socialists that have plagued the  nation since the 1970s.\n\nWhether or not socialism is evil,…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698611/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…actions led to the addiction and deaths of many Americans. He was  an illegitimate dictator who held power through stolen elections and  horrific violence against the people of Venezuela. The Biden  administration imposed a $25 million bounty for his arrest and  extradition to the United States. He was indicted twice in Federal  court and should stand…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698694/venezuela"}, {"senator": "Rick Crawford", "party": "Republican", "sentence": "…introduced today.\n\nExamples include H.R. 328, a Democratic-sponsored bill that  excoriates the Maduro regime which ``has refused to respect the  overwhelming choice of  the people of Venezuela and subsequently arrested and abused thousands  of innocent citizens of Venezuela, including children, for peaceful  political participation.''\n\nMr. Speaker, consider…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698882/successful-operation-to-arrest-nicolas-maduro"}]