[{"senator": "Maxine Waters", "party": "Democrat", "sentence": "…indicated  by making more money by laying off more people, having less services,  and charging larger interest rates. I am not on the side of big banks.  I am on the side of the people.\n\nLet me continue. The Republicans may claim this resolution also  prevents the OCC from updating its merger review procedures in the  future. Why would they want to do that with…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691499/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Thomas Suozzi", "party": "Democrat", "sentence": "…both here in the House and the Senate, to find  bipartisan solutions to this very real affordability crisis.\n\nMr. Speaker, let's deliver a huge victory for the American people.  Let's overcome the partisan toxicity of Washington, D.C. Let's get  Democrats and Republicans, Members of the House and the Senate, to work  together to serve the needs of the…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698794/breaking-the-gridlock-act"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…rise today in strong opposition to this  amendment.\n\nIf passed, this amendment would immediately prohibit TRICARE coverage  of mental health counseling for transgender young people. Let me repeat  that. This amendment would take away mental health care services for  transgender kids of servicemembers. That is what we are talking about.\n\nThis amendment is…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695248/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…families are now threatening Americans' benefits in order to pay for  giant tax cuts for billionaires, and since those two cannot begin to  imagine what it means for working people, let's tell them what Social  Security does.\n\nA few weeks ago, I posted a video explaining what Trump and Musk were  doing to Social Security, and I asked people: Just tell your…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690633/nomination-of-frank-bisignano"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…survivor to serve  in the United States Congress, I have spent years documenting and  standing up to human rights abuses carried out by authoritarian regimes  against their own people.\n\nLet me say this plainly: A functioning democracy does not execute  people in the street. That is the kind of thing you see in North Korea,  Mr. Speaker, or Iran; not in the…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699593/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…border  security, what we pay. But there are many pieces that will never get  solved unless people are sitting down, like you did with your Gang of  8, bringing people together, and saying: Let's iron this out. So that  is my hope and prayer.\n\nMr. MERKLEY. I was not aware of that, no, and that is insanity.\n\nMr. MERKLEY. I yield in the nature of a question.…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…Republicans are raising your costs so  they can cut taxes for billionaires. It is unbelievable. I don't think  this is going to be seen very positively by the American people.\n\nNow let's talk about 1 month into the Trump administration. So, on  his first day in office, Donald Trump promised a golden age was coming  over the horizon. But when Donald Trump…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688408/joint-session-of-congress"}, {"senator": "Jim Costa", "party": "Democrat", "sentence": "…floods in Lake  Oroville and Yuba areas. He was there. He reminds us why we serve: not  only the passion, but the desire always to put our constituents first  and to help people. Let that be a role model for all of us.\n\nDoug, we miss you. Doug had a life well lived. He was a person who  cared passionately about our country and about the people's House.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698716/9999"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…thousands of U.S. forces, ships, and aircraft to  conduct  these operations--all without congressional authorization and without  any credible explanation to the American people.\n\nLet me be clear. The drug cartels that traffic poison across our  borders are violent and reprehensible. They have devastated families  and communities across our country. We…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696129/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…are not  waiting for the future to arrive. They are shaping it. They labor to  build a society that is more just, more inclusive, and more responsive  to the needs of all people.\n\nLet us take the inspiration from their dedication. The strength of  our Nation rests in the courage and the vision of its youth.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695393/recognizing-more-action-for-students-organization"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…Wrestling  Federation rules allow you to hit your opponent over the head with a  chair.\n\nThis is a desperate power grab by a President whose agenda has failed  the American people. We cannot let gerrymandering silence voters.  Democracy demands fairness, and we must fight for it.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694768/redistricting"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…wasn't left or  right, that Americans were saying in the course of conviction that this  is about right or wrong, and it is wrong to take away healthcare for  millions of people.\n\nLet me explain, if I can, or speak to a few points from a recent  report by Protect Our Care to explain what the administration is trying  to do to our healthcare system. They…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…veterans waiting longer for care.\n\nVA employees have come forward anonymously, warning that these job  cuts are affecting veterans' care and leading to many errors. Some of  the people let go were even working on the veterans suicide crisis  hotline.\n\nVA services are already stretched thin. These job losses are making  it worse. That is why I am proud to introduce…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688352/ensuring-veterans-receive-care-they-earned"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…on the market.\n\nTrump is doing his fossil fuel donors' dirty work and keeping  American-made competition off of the grid. These are Trump energy taxes  on the American people.\n\nSo let's shine a spotlight on this fossil fuel gaslighting. Trump's  declaration is the energy emergency. Trump's declaration is the energy  emergency. He is stopping the future…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696132/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…emergency.\n\nHe shouted about the Epstein files, and now his administration is  saying there are no such files.\n\nThis all, once again, is to serve as a con to the American people.\n\nLet's be clear about what the Republicans are voting to defund today:  programs that help educate women and girls, programs that fight deadly  diseases.\n\nFood, clean water,…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693706/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Mario Diaz-Balart", "party": "Republican", "sentence": "…has taken over by force and by terror a great country, the country of  Venezuela. This is man who is under indictment.\n\nLet's vote this down, and let's protect the American people. Let's  not defend the narcocartel's drugs that are poisoning our people.", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698239/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…dime--well, the vast  majority of the debt increase over the next decade is interest. God  forbid, we tell the truth. It is Medicare. We got older. We have a  shortage of young people.\n\nLet's actually sort of walk through some of the reality of what our  brothers and sisters say on the other side.\n\nI have used this article before. It is one of the best in explaining…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692327/math-always-wins"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…critical conversation, but it starts  here.\n\nIn the last 100 years, Republicans have had just four chances to do a  reconciliation bill. We were given a mandate by the American people.  Let's not waste it. I urge my colleagues to support it.", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689887/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…people expect results. They want a government that works  for them, not against them. With this legislation, we have the chance  to make real, lasting change for the American people. Let's get it  done.", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689009/recognizing-salvation-army-of-harrisonburg-and-rockingham-countys-100th-anniversary"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…have expected the upper chamber, the Senate,  to let the novel use of a statute traditionally used to sanction  adversaries to become used for tariffs to tax American people and to  let it go unchallenged. This is not constitutionalism; this is  cowardice.\n\nOur system of government cannot work when Congress abdicates its  legislative authority. Madison…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690543/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "French Hill", "party": "Republican", "sentence": "…evaluate their rulemakings, and what is a reasonable amount of time to  get public input.\n\nWe have the right, on behalf of the elected Representatives of the  American people, to let our voices be known when a nonelected, to quote  my good friend, the gentlewoman from California (Ms. Waters), unelected  bureaucrat chooses to step beyond the bounds of…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689950/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…times what it was when I was a child in the 1960s. Again, we have  nobody to apologize to as we are not letting people into the country.  There are four times as many people being let into the country as when  I was a child.\n\nWe just got done with President Joe Biden, and, of course, we don't  keep track of the exact numbers, but he was allowing about…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699344/fundamentally-changing-immigration"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…broken a horrible law  but broke the law just by coming here.\n\nIt is a complete kick in the teeth to anybody who wants to come here  legally to allow the 10 million people who Joe Biden let in during the  last 4 years stay here.\n\nThere is one more thing I will address as we begin to work on Donald  Trump's big, beautiful bill. I remind people in this…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690195/wisconsin-in-the-news"}]