[{"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…years because people have come to realize that without it,  they might not be able to afford healthcare at all.\n\nI have decided to bring in a couple of comments from people in my  district. There are too many to read all of them, but this one is from  Beth, who lives in Greenbelt, Maryland, which is in my district. She is  looking at her premiums going…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697216/medical-bills-are-too-high"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…gentleman for yielding.\n\nMadam Chair, I rise today in strong opposition to this Republican  rip-off. This budget slashes $880 billion from Medicaid, putting  286,000 people in my district, including nearly 100,000 children, at  risk of losing healthcare.\n\nMadam Chair, cruelty is the point.\n\nIt also targets food assistance, leaving over 147,000 New Yorkers…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688073/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "…If Trump has his way, there are going to be a lot  more holes in the net and a lot more people without healthcare-- millions more, to be exact.\n\nMr. Speaker, 38,000 people in my district are facing huge healthcare  cost increases because of Trump's ACA cuts. The average cost increase  is $700 per person per year. A lot of families will have to pay…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696766/stories-from-home-the-human-cost-of-expiring-healthcare-tax-credits"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…another word from Republicans about people not wanting to  work when they are sending them to the unemployment line.\n\nMr. Speaker, this is a bad bill. Do not allow the people in my  district to be unemployed, hungry, and without the ability to live  their American Dream.", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693216/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…million  children like that is simply disgusting, but that same moral bankruptcy  is embedded in this bill.\n\nThis bill unleashes huge health insurance hikes on 203,000 people in  my district alone. Mr. Speaker, 82,000 people will lose coverage  altogether due to the impact of the big, ugly law and soaring ACA  prices.\n\nWorse, this bill also reneges on our…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696741/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…Congress has already allocated. I implore you to use your       power as my Senator and a key member of our government to       stand up for what is important to the people of your       district. We want to go to work, take care of our families,       and ensure all citizens have the health services they       deserve. These latest orders are inappropriate,…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "Mr. LATIMER. Mr. Speaker, I thank Mr. Morelle for yielding me the  time.\n\nMr. Speaker, the American people in my district and in my State have  spoken clearly. This bill is voter suppression, pure and simple.\n\nIt is brought to us under the guise of stopping illegal voting. When  we analyze…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690010/safeguard-american-voter-eligibility-act"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…$87 a month. She now will have to pay over $1,000 a month, and she  can't afford her medication or the treatment that keeps her alive. I  have people, small business people in my district, that are calling to  say this is the first time they have ever had to go without insurance.\n\nThe fact of the matter is this is the right policy.\n\nNow, if people want…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698665/protecting-healthcare-for-millions-of-americans"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…Congressional District.\n\nAs the House prepares to vote on a truly horrifying Republican budget  resolution, one void of empathy or common sense, I am thinking of the  people in my district who stand to be harmed the most: families in  Mattapan who receive their healthcare through MassHealth, the Medicaid  program for Massachusetts; mothers in Chelsea,…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688079/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…the guise of DOGE, the  Department of Government Efficiency, let me be clear that we all want  our tax dollars to be spent wisely.\n\nLet me also be clear that the people in the Eighth District of  Washington State think it is a super wise investment to invest in our  Forest Service that will thin the forest, prevent catastrophic  wildfires, and then fight…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689811/cuts-to-forest-service-endanger-millions"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…AultCare,  a regional insurer tied to Aultman Hospital, stopped offering some  individual family and small business ACA plans before December 31. That  affects 6,000 people in my district. These are working families and  small business employees losing coverage because Republicans refuse to  act.\n\nI have fought to protect these credits by cosponsoring…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698555/rising-healthcare-costs"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…bills are only the most imminent threats facing       DC in the House. Many more bills and appropriations riders       are in the pipeline. In solidarity with the people of the       District of Columbia and our national democracy, we, the       undersigned, call on you to side with DC and oppose every       bill and rider that seeks to prohibit, restrict,…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696946/opposition-letter-led-by-free-dc-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…this bill, 5,800 people would lose coverage under the  Affordable Care Act in her district alone; 15,367 in her district alone  would lose Medicaid coverage; 21,167 people in her district alone would  lose their health insurance outright.\n\nI mean, really? Is that what representation is all about? Please.  That is what is in this bill that most of you…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691944/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…President, to the executive branch, has  rolled over and played dead rather than holding anybody accountable.\n\nToday, we heard another oversight hearing about something that people  in my district just don't care about: trans athletes who are fencing in  different types of competitive atmospheres. That may be something for  local sporting bodies to take up. It…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690818/gross-violations-of-law-by-trump-administration"}, {"senator": "Laura Friedman", "party": "Democrat", "sentence": "…want to know that if our child  can get into a college that we can afford to send them there.\n\nSo many Americans worry, can I pay for my child's education? So many  people in my district and other districts worry whether or not their  child is getting a quality education at their public schools.\n\nI was at a school this week that has Head Start, where…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688232/democratic-proposals"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…all of us to hear, we know this isn't the  end of the story. Ben has a lot of fight left in him, and as he has  joked himself: ``He is not dead yet.''\n\nFrom the people of the First District and across Nebraska, Mr.  Speaker, may Ben know that we are praying for him. We are with him,  with Melissa, and his kids. I know he won't back down from this fight.", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698932/recognizing-mayor-david-black"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…the larger producers of tires, et cetera, at some  point, they are going to look at doing it at the medium-sized  producers.\n\nThe Yokohama plant that employs a lot of people in my district, in my  hometown of Salem, Virginia, could be affected long term, but currently  it affects Danville. Now, that is about 16 miles from the edge of my  district. In…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688523/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "Addison McDowell", "party": "Republican", "sentence": "…taxes for the  average American family of four. Mr. Speaker, that might not be a big  deal to the elites in Manhattan or San Francisco, but it does mean a  lot to the people of my district in North Carolina.\n\nNot passing this bill means our Border Patrol officers and our Coast  Guard won't have what they need to secure the border and stop the flow  of…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693240/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…the start of the  session, when he would come in here wearing some tattered clothes. He  was a little bit disheveled, but he had had a long day.\n\nHe was here for the people of his district, and he left a legacy that  we all should cherish, honor, and remember.\n\nThat is why we are here today, Mr. Speaker. We are honoring Doug. He  always had a nickname…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698719/9999"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…this is not only an incredible injustice to the ICE agent who  lost his finger, it is a danger sign for America. Every country has  immigration laws. When I talk to people in my district, even people who  think we ought to let more people in this country, they don't think we  should have no immigration laws. Nevertheless, this is where we stand.\n\nAs…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700071/issues-of-the-day"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…district as an example.\n\nIn my district, in the Seventh District of Minnesota, the  reconciliation bill that he opposes would prevent a 25 percent tax hike  for most people in my district where the average income is $70,000, not  billionaires, $70,000.\n\nIt also increases the standard deduction. It increases the child tax  credit. It helps small businesses…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691940/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…growth.\n\nCongress is within its right to deny this legislation pursuant to the  D.C. Home Rule Act, and it should do so because it is the right thing  to do for the people of this District.\n\nThe people and businesses of this town deserve the tax relief these  provisions grant, not just at the Federal level, but also at the local  level. It is time we…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699678/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…Energy's rules in  the grave. They won't be missed.\n\nMr. Speaker, I spent time last week in my district, too, talking to  people. I spend time every weekend talking to the people in my  district. Do you know what they complain about the most? Unnecessary  rules and regulations.\n\nI met today with folks from the homebuilding industry. They can  document that…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689054/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers-providing-for-consideration-of-hr-defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…should be implementing a technologically neutral broadband  approach and the inclusion of this new technology will provide  additional avenues to provide broadband to people in my district and  across the Appalachian region and finally give them access to the  modern economy.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694869/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…California. Mr. Speaker, I feel compelled to call  attention to an outrageous action that has just been undertaken by the  State of California to deprive many, many young people in my district  of athletic opportunities.\n\nTruckee Unified School District, which is in my district, competes  when it comes to athletics in a neighboring school district in Nevada.…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698014/state-of-california-decision-affects-student-athletes"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…became a bad idea. Even natural gas, oh,  my gosh, we can't use it, and the electric rates keep going up and up  and up. My district is not a wealthy district, and the people in my  district are complaining because their electricity rates are going up.\n\nOne of the major drivers are prior Democratic policies, Mr. Speaker,  that said we are not going to be…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694880/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…design.\n\nDo we remember our high school economics class? Creative destruction  is what brings us to that next level of productivity, which raises  wages.\n\nFor working people in my district, who are not making about 27 or 28  percent more than the first year of the Biden administration, they are  poor today. I think at the end we came in number two. Yet,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695567/we-are-borrowing-a-second"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…a long way to correcting the broken,  soft-on-crime policies here in Washington, D.C., that coddle criminals  and place at risk the good, honest, and hardworking people who call the  District home.\n\nMr. Speaker, I thank Representative Donalds for sponsoring this  important legislation and applaud Chairman Comer for his steadfast  leadership on this critically…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695563/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}]