[{"senator": "Al Green", "party": "Democrat", "sentence": "…They are already experiencing this. That is why many of them  are not having their townhall meetings.\n\nThey are going to experience it also when we have an election because  people aren't going to forget this. They are not going to forget how  the President desperately tried to tax them so that he could then  return money, some to them if they were qualified…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690093/protecting-the-american-dream"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…When I approached the aisle, I wanted him to see a sign that I had that  simply said--but it was truthful; I believe it was powerful--that Black  people are not apes. Black people aren't apes.\n\nI flashed that for the President to see. Based upon the way he turned  away and tried to move briskly, it appears that he got the message but  did not want to embrace…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700250/peaceful-silent-protest"}, {"senator": "Katherine Clark", "party": "Democrat", "sentence": "…every State turn over their voter  rolls to DHS and Kristi Noem.\n\nMr. Speaker, this bill is an outrage. This is election rigging. This  is voter suppression.\n\nThe American people aren't going to stand for it, and nobody should  vote for it.", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700018/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…weeks later, but that entire 6 weeks I didn't have to worry about how I  was going to pay that bill. All I had to worry about was her and my  recovery. There are a lot of people that aren't that lucky.\n\nThere are a lot of people trying to decide right now whether to start  a family. There are people right now who are in the process of starting  a family…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697213/medical-bills-are-too-high"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…health  of their employees by providing better access to food.\n\nThere are so many good ideas that I learned when I was mayor, from  Republicans, from private sector people, but those aren't the ideas  coming forward. The ideas coming forward are: Hey, let's just send to  the Energy and Commerce Committee the mandate to cut $808 billion.  Let's rush now.…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…want 10 years.\n\nThen what are they cutting? They are cutting $750 billion in Medicaid  benefits. That is just a fact. Go Google it. You will see the cuts.  They claim that people aren't going to lose their healthcare, but the  independent CBO says that up to 14 million Americans may lose their  healthcare. Up to a million of American children, kids born…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691530/tax-cuts"}, {"senator": "Tina Smith", "party": "Democrat", "sentence": "…diapers to families; but  smalltown folks that hate to see this happen to their neighbors; and  local mayors and farmers and small businesses; Democrats, Republicans,  people who aren't political at all; law enforcement officers, faith  leaders, Second Amendment supporters, and civil libertarians.\n\nAnd there is the man in the truck that I saw when I…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699416/9999"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…year, and we can pass a  budget that restores funding for healthcare, that extends the  Affordable Care Act tax premiums, that restores funding for Medicaid so  that working people aren't stuck with higher costs for their health  insurance. Not only can we do this, we must.\n\nI want to vote for a bipartisan budget that funds the government and  protects…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695636/government-funding-and-healthcare"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…they are a  U.S. citizen, when they can read right here that it says, I do solemnly  swear under perjury and these fines that I am a U.S. citizen, I don't  think so. These people aren't even going to the grocery store right  now. They are not even going to the doctor's office. They are scared to  pick their kids up from school.\n\nAnd somehow, somebody…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700198/save-america-act"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…I would have been more aggressive about how many drugs we  could negotiate because I understand they start with a group of drugs,  and pretty soon that is going to help people who aren't seniors, as we  did with the insulin cap. That insulin cap, at 35 bucks a month, was  only for seniors, but Merck and other companies offered it to  nonseniors, as well,…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688282/department-of-health-and-human-services"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…years of       telework, rapid policy changes, and frustration with how the       Trump administration is treating federal employees have hurt       morale to the point that people aren't giving their all to       the job.\n\n``When you're facing threats yourself, it kind of prevents       you from being totally there for the public you're       servicing,''…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689130/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…Affordable Care Act tax credits. Now, we are just days  away from the deadline, and Republicans are scrambling to push through  an unserious proposal at the eleventh hour. People aren't stupid. They  can see this.\n\nTheir so-called Lower Health Care Premiums for All Americans Act  would have the exact opposite effect than what it claims to do.\n\nMost importantly,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698377/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "Mr. DURBIN. Mr. President, last week, both the House and the Senate  voted to pass what is known as a rescissions bill. That is a term which  a lot of people aren't familiar with. What it basically means is that  Congress appropriates money, the President signs that appropriations  request into law, and it is the policy which is supposed…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693932/rescissions"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…not why Donald Trump signed an executive order on this issue.\n\nNo, Donald Trump likes his big, fancy showers with multiple heads. We  are talking about showers for rich people. These aren't even everyday  showers.\n\nMr. Speaker, my question is: Why on God's green Earth on the first  full day that this Congress is back in 2026 are the Republicans using…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698563/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…American people by taking away their healthcare.\n\nMr. Speaker, let's be honest about what is happening here because  this really is not that complicated, and the American people aren't  stupid.\n\nThis Republican bill does not fix the healthcare crisis facing this  country. It doesn't even try. Instead, Republicans are going to raise  costs, weaken coverage,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698312/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…to vote. If somebody votes illegally, Mr. Speaker, they are  stealing that veteran's vote. They are stealing your vote. They are  stealing everybody's votes if we allow people who aren't legally  eligible to vote to participate in elections.\n\nHow can you best preserve that? One way is that, when you are  registering to vote, you have to prove citizenship.…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700016/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…manufacturers keeping the lights on, and  border communities shouldering a burden Washington created are who the  one big, beautiful bill is going to help.\n\nWho are these people? These aren't the millionaires and billionaires.  These are everyday Americans. Despite what we hear from the Democrats  and the media over and over again, this bill isn't tax cuts…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691959/supporting-the-big-beautiful-bill"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…we are dealing with it and trying  to get it right for the American people.\n\nWhen you say that wind and solar is cheaper and then complain because  you took away the tax--people aren't doing it because you take away the  tax credits and subsidies. If it is cheaper and more reliable, then you  don't have to subsidize it.\n\nThose are the kind of frustrating…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697890/electric-supply-chain-act"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…country, ineligible, or who are able-bodied adults  who just simply refuse to work. That is all. I mean, I think that is,  as we say, an 80-20 issue in this country.\n\nNo, people aren't starving and being thrown into the streets with no  support who need it. We are protecting and preserving not only the tax  dollar, but these important critical safety…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699637/supporting-safety-net-services"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…Maybe USAID has done some good things, but they have also done many  things that were totally inappropriate. Agencies like this need to be  defunded or reformed. The American people aren't going to put up with  it anymore.\n\nTo that end, why is the government still funding public television  and radio when most people have hundreds of channels to get their…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692539/rescissions-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…fiscal mess we are in, the outer part of that curve,  which is what sets our mortgage rates, our long-term borrowing rates,  that is still going to be a mess, and the American people aren't going  to be able to afford homes.\n\nThe average age of the American homeowner today is as high as it has  ever been. It is up about 10 years. Now you are in your upper…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693110/tax-cuts-and-spending"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…those of us who  have stood up to fight and expose this are seeing to it that we are  removing people from this country who should be removed, securing the  border so that people aren't flowing across it, standing with law  enforcement, securing our communities, backing the blue, restoring  safety and security, not just in our Nation's Capital but around…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695719/highlighting-flawed-policies"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…country the way we run it too much, and they will do  whatever it takes to try to make the Republican Party and President  Trump look bad. Unfortunately, for them, the American people aren't  buying it. Mr. President, 77 million people came to the rescue of our  country a year ago in November--77 million people. And that is why  President Trump is back in…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698541/9999"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…pockets, and trying to deliver on the spending cuts, reversal and  termination of the green new scam, and the application of Medicaid work  requirements to make sure that people aren't getting benefits when they  should be working.\n\nMr. Speaker, I believe it is a good bill.\n\nMr. ROY. Mr. Speaker, I believe it is a good bill, and I will say it  again:…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692388/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…had a sister who  is married to a husband with a salary, you would get free childcare,  childcare not available to a couple with two incomes.\n\nThere is a TANF program for people who aren't employed, giving free  cash away. Again, it is much easier to get if you don't have a working  parent in the household.\n\nWe have our child credit, which is, again, something…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695628/breakdown-of-traditional-families"}, {"senator": "Roger Marshall", "party": "Republican", "sentence": "…needs to be reliable and clean. It has to be all those things. And we  can do that. But if you have energy production that is not affordable,  that is not reliable, then people aren't going to use it, and countries  aren't going to use it.\n\nSo we need this bridge. We need this bridge, and I think the solution  long term is probably some form of nuclear…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698992/unanimous-consent-request-s-res-550"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…the world aren't making those things  economically viable for them. Whether you are talking about wind farms  or EVs without the mandates, what is clear is the American people  aren't buying these things because they are still not able to function  and carry out their livelihoods effectively under the mandates.\n\nHigher costs and fewer choices for consumers…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690387/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…things that  were an enormous waste, totally inappropriate, and, in fact, they lost  the trust of the American people. Agencies like this need to be  reformed. The American people aren't going to put up with it anymore.\n\nWhy is the government still funding public television when most  people have hundreds of channels, as has been mentioned, to watch their…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693710/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}]