[{"senator": "Jacky Rosen", "party": "Democrat", "sentence": "…bow to Trump than  pass legislation to lower at least one section of grocery prices and  make food more affordable for their constituents.\n\nAgain, this isn't partisan. People in my State and yours are being  crushed by rising costs. Washington Republicans have the power to do a  little something about it, but they choose not to. So if you really  want…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698816/9999"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…No, we  will not risk the healthcare for millions of Americans as bargaining  chips for billionaire tax breaks.\n\nMedicaid provides health insurance for 1 out of every 4 people in my  State of Illinois--3.4 million people, including 1.5 million children.  Medicaid pays to deliver half of all the babies in my State--half of  them. Two-thirds of the seniors…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690984/medicaid"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…food. We are not going to go to their  restaurants. We are not going to stay at their hotels. We are not going  to fish in their lakes.\n\nYou name it, that is what the people in my State are seeing. And  everything from manufactured parts to whiskey have dropped sharply. And  small businesses, farmers, and manufacturers are losing business.\n\nThis is not…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696446/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Nikki Budzinski", "party": "Democrat", "sentence": "…and helping us discover common ground on even  the most difficult issues.\n\nGovernor Edgar led Illinois with integrity, compassion, and an  unwavering commitment to the people of our State.\n\nGovernor Edgar was a voice of reason, a champion of civility, and an  unwavering advocate for collaboration.\n\nIn today's era of division and political turmoil, his…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695630/in-memory-of-the-honorable-jim-edgar"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…much as  22 percent next year, costing working people thousands of dollars more  per year to pay for their health insurance. This is money that people  don't have. Most people in my State, most people in this country are  just barely getting by. They can't afford to pay thousands of dollars  more for their health insurance.\n\nIt is not just in Rhode Island…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695636/government-funding-and-healthcare"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…Care Act, but when he became Governor of  Indiana, everybody in Indiana, the healthcare providers and others  convinced him--oh, it is a good idea, you should get people covered in  your State. And they did. So this is about a smart way of providing  healthcare, and we have done it.\n\nSo States who were smart about this realized that their economy was…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692972/one-big-beautiful-bill"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…President, I rise today in the middle of a whole  lot going on, concerned about the reconciliation bill that will be  considered in the Senate and what it means to the people of my State  and in the country. But one of the ways that people find out what is  going on here, whether they agree with us or not, is by watching us and  listening to speeches.…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691704/senate-resolution-259-recognizing-june-as-the-39th-anniversary-of-c-span-chronicling-democracy-in-the-senate"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…the voice of Alex  Padilla. They are afraid of Alex Padilla's presence in a room.\n\nNow, how can that be in the United States of America that a Senator  elected by the people of his State, who simply wants to go to a public  meeting and have his voice heard on behalf of his constituents, is  handcuffed and thrown to the ground?\n\nIt is not acceptable.…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692451/alex-padilla"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…means to be a Californian.\n\nI am a proud Californian from the San Fernando Valley raised by an  immigrant mother, lifted by my community, and inspired every day by the  people of this State.\n\nFor 175 years, immigrants, workers, dreamers, and innovators made  California a leader in the country. As we celebrate California's 175th  birthday, let's recommit…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695175/happy-birthday-to-california"}, {"senator": "Jacky Rosen", "party": "Democrat", "sentence": "…deductible is going to be so high they are never going  to meet it, and they are still going to be paying out of pocket in ways  they can't afford.\n\nYou know, more than 38,000 people in my State alone are probably  going to lose their coverage right away, all because Washington  Republicans just refuse to extend this tax credit allowing them to  purchase their…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695919/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…on and gives that money to the  very wealthiest Americans in the form of $7 trillion in tax breaks.\n\nIt slashes funding for programs like Medicaid. Nearly 2 million  people in my State of New Jersey rely on Medicaid for healthcare. It  raises the healthcare costs for folks who get their coverage through  the Affordable Care Act. In my district, folks…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689914/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…health, and  stability, economic growth, improved outcomes for kids, and more  respect for our elders and care for the disabled. Nearly 2 million New  Jerseyans, 2 million people in my State rely on Medicaid, and yet our  State is slated to see cuts of up to $5.2 billion.\n\nMedicaid accounts for a quarter--more than a quarter--of New Jersey's  State budget.…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Raphael Warnock", "party": "Democrat", "sentence": "…have  the zero-dollar premium plans, they would have zero dollars if they  were in an expansion State.\n\nSo for me, it is a matter of fairness. I am standing up for the  people in my State of Georgia. There are 500,000 Georgians in the  healthcare coverage cap. If they lived in California, if they lived in  New York, if they lived in North Carolina, they…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697898/9999"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…terribly  relevant for the people I represent, who are worried about an economy  that seems to be stagnant; healthcare premiums that are doubling,  tripling for many people in my State; prices that are going up on all  the stuff that you need to afford to live. And, all of a sudden, the  President is talking only about Venezuela.\n\nSo why did we invade…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698610/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…because the administration had the  stones to put economic pressure on them, but my colleagues want to take  that pressure off because they don't worry about their people dying in  their State.\n\nIt is simple. Whether you are a Republican or a Democrat, if you care  about the U.S. Government responding to millions of Americans being  killed by fentanyl,…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699965/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "Mr. ROY. Mr. Speaker, I thank the gentleman from Arizona for his  steadfast devotion to highlighting for the American people the state of  our fiscal health, which is not good, and the extent to which we are  complicit in it.\n\nI would just point out that this thing that the gentleman from  Arizona is…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690587/economic-anxiety"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…Kansas about why we care about this issue. This is just one example. In  March of 2016, Pablo Antonio Serrano-Vitorino, an illegal alien from  Mexico, shot and killed four people in my State. Then, while fleeing  from law enforcement, he killed another person in Missouri.\n\nHere is the kicker: It wasn't his first time in the country. It  wasn't his first crime…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695358/stop-illegal-entry-act-of-2025"}, {"senator": "Rick Scott", "party": "Republican", "sentence": "…citizenship to take  office. Yes, even my colleague from Massachusetts had to prove he was  an American citizen to take his seat in the U.S. Senate and represent  the good people of his State.\n\nSo are the requirements for being elected to the U.S. Congress  racist? I cannot imagine the Senator from Massachusetts believes that  to be true. We are all here…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700025/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…system  because they need to start over from square A.\n\nThis, Mr. Speaker, is an example of how the failures in Sacramento  that have degraded the quality of life for people throughout our State  are not a matter of Democrat versus Republican, but simply a matter of  competence, of basic government performance, and of serving the people  of our State as…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697549/congratulating-eco-clean-solutions"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…Minnesota, which, of course, was administering Federal  taxpayer money, and Feeding Our Future said: We want to feed hungry  children in the Somali community.\n\nThe welfare people and State government in Minnesota gave them the  money to do that. It started out very small. The idea was that Feeding  Our Future, the Somali nonprofit organization, would take…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697400/welfare-fraud"}, {"senator": "Cindy Hyde-Smith", "party": "Republican", "sentence": "…Governor  Reeves' request for a major disaster declaration, and we encourage  President Trump to approve it swiftly.\n\nI ask my colleagues and the American people to keep the people of my  State and everyone harmed by Winter Storm Fern in your prayers.", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699701/9999"}, {"senator": "John Thune", "party": "Republican", "sentence": "…a substantial part of the  Tax Cuts and Jobs Act would have expired this year, and that would have  meant a huge tax hike for hard-working Americans--some $2,500 for  people in my State of South Dakota.\n\nWe were determined not to let that happen--not next year, not ever-- and I am proud that our bill permanently extends all of the individual  tax relief…", "date": "2025-07-08", "source_url": "https://justfacts.votesmart.org/public-statement/1693279/one-big-beautiful-bill-act"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…Additionally, with promises made, promises kept by Donald Trump, I  have lived it. I led the delegation to move the Embassy from Tel Aviv  to Jerusalem. He did that. People at the State Department said that we  shouldn't do it because it leads to dislocation. No, it led to the  Embassy being in Jerusalem, and it led to the Abraham Accords.\n\nWe know…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693234/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…already passed the House. This bill passed the  Senate unanimously in December, and I am really hoping that my  Democratic colleagues--respecting the indigenous Native people of my  State and their valiant Vietnam service--will join with me in just  passing it, like we did in December, and it will go right to the  President's desk, and they will have…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696137/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…Chairman of the Joint Chiefs of  Staff. It is the kind of stuff that drives people crazy back home for  an individual that is the Chairman of the Joint Chiefs. Most people  back in my State of Oklahoma think this has already been done. But to  not be able to move on this, to literally have my Democratic colleagues  block it and say we are not going to…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690112/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…to rein in  Washington's out-of-control spending, makes historic investments in  border security and national defense, and restores the kind of  commonsense priorities people in my State of North Dakota live by every  single day.\n\nThere are so many wins in this bill that we need to break them apart  and highlight them separately.\n\nToday, I will focus…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694173/benefits-of-one-big-beautiful-bill"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…including a  high-powered lobbyist, including another well-known consultant, as well  as a number of other un-named co-conspirators. In other words, these  are the people running our State government in California. These are  the people who control our politics in California.\n\nNow, I have spoken about a culture of corruption that exists in  Sacramento,…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697101/highlighting-the-state-of-california"}]