[{"senator": "Al Green", "party": "Democrat", "sentence": "…are fearful of what can happen to them  and they are fearful that if they are not careful, they can be picked  up, taken away to another country without due process.\n\nPeople are paying attention. If you can do this to one person, why  can't you do it to another? It looks like you are trying to get a  certain group of people out of the country.\n\nIf you…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690560/a-message-to-the-cabinet"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "…for us. No, he is  driving up our costs by imposing reckless tariffs and cutting SNAP,  Medicaid, and ACA subsidies. This President works for the wealthy, and  working people are paying the price.", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696771/working-people-pay-the-price"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…it does is it raises prices. It raises prices because the money that  the Federal Government takes in has to be recovered, and it gets  recovered from families, from people who are paying higher prices for  imported goods or higher prices for the domestic freeloaders who are  going to raise their prices to match the imported goods just the way  the fossil…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689472/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…it actually says: Hey, this sweetheart deal that  pharma had with Medicare, in which they can't negotiate at all and that  the prices are locked in and so our country--people are paying twice as  much as they do in places like Canada, for the drug. Yet it is our  taxpayers that put in the money for the research or the VA, which works  so well for our…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688282/department-of-health-and-human-services"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…would replace  ObamaCare with something better. Instead of something better,  Republicans let the enhanced ACA tax credits expire at the end of 2025,  which means that now people are paying more. Tens of thousands of  people in Massachusetts alone have now dropped coverage, meaning they  have no insurance at all.\n\nRepublicans don't have a plan to replace…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699220/providing-for-consideration-of-hr-supporting-pregnant-and-parenting-women-and-families-act-providing-for-consideration-of-hr-pregnant-students-rights-act-and-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…to the people who make the most money off this system and these  cuts because the tax cuts they will get will be billionaires.\n\nAnd working families in America, the people who are paying insurance  rates--hurts; it is hard; it is difficult. The people who have high  premiums, copays--it is the rest of us that pay.\n\nSo I want to talk about the people…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…statistically, with more rural areas and  already more vulnerable rural hospitals, chances are their constituents  are going to hurt even more.\n\nI sure hope that people out there are paying attention. Call the  people who represent you. Tell them what your fears are. I know people  are calling me, and I am standing up here to appeal to my Republican…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691419/gop-tax-scam-hurts-everyone"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…grocery store by 20 percent.  That is an F. Today, Americans pay 40 percent more for a single cup of  coffee on their way to work than they did last year. That is an F.  People are paying more in electricity bills while Donald Trump has cut  domestic energy jobs. That is a massive F. People are paying more for  clothing, more for produce. And this week,…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697816/affordability"}, {"senator": "Steven Horsford", "party": "Democrat", "sentence": "…HORSFORD. Mr. Speaker, President Trump loves tariffs. He calls  them beautiful. He says they protect American workers, but here is the  cold, hard truth: The American people are paying them.\n\nJust today, the nonpartisan Congressional Budget Office confirmed  what families already feel--American consumers are paying 95 percent of  these tariffs. They…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699977/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…We have seen cheering at the downfall of people, cheering as if these  people are somehow just invisible numbers and invisible things,  cheering as if these are not people who are paying mortgages, cheering  as if these are not people who are paying student loans, and cheering  as if these are people who are not paying car notes or putting their  kids…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688514/people-not-statistics"}, {"senator": "Mark Pocan", "party": "Democrat", "sentence": "Mr. POCAN. Mr. Speaker, yes, the Federal Government will officially  reopen with the House vote today, but here is what won't happen. We  won't protect the 22 million people paying more for the ACA or the 15  million people losing their healthcare outright due to Republican  actions in the big, ugly law, nor will we stop the healthcare rate  increases…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696684/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…Mr. Speaker, imagine that, Democrats and Republicans in this Chamber,  in this town, wanting to do something about corruption. That is a good  thing. I hope the American people are paying attention.\n\nI will tell you it is clear from conversations with my constituents  in western Pennsylvania, and I know from people all over this country,  they think our…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691217/stock-trading-ban-for-members-of-congress"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…``scam,'' he said.\n\nReally? Anybody who is watching these proceedings, do you really  think that the issue of affordability is a ``scam''? Prices are higher  than ever. People will be paying more for their healthcare because of  the inaction of the Republicans in the House, the Senate, and this  White House. They will be paying so much that many of them…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697303/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Sylvia Garcia", "party": "Democrat", "sentence": "…administration is  doing with ICE is not enforcement. It is lawlessness. It is cruelty.  They have turned ICE into a force of masked thugs. In my community in  the Houston area, people are paying the price.\n\nLuis Gustavo Nunez Caceres died in ICE custody near Houston. DHS  claims it was heart failure, but this administration has shown such  contempt for the truth…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699665/horrific-ice-abuses"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…groan and grimace  and ache and fear? When America has tried to do this kind of nation  building, these kinds of regime replacements in the past, it has led to  the American people paying the price in treasure and in blood.\n\nSo now we have the opportunity to stop. We are very close. We urge  our Republican colleagues to join us. Tell the American people…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698818/venezuela"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…different States and the rising price  of energy. It showed certain States and certain areas--he colored them  blue and red States on his poster--and the difference in what people  are paying for electric rates.\n\nYou can tie it directly to State and local governments that are  making decisions to shut down generation of energy. When you  overregulate--why…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698566/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…was never about budgets or priorities. It was about power. It is  not about turning government on. For them, it was about turning  government into performance, where the people paying the highest price  are the ones furthest from Washington.\n\nFor more than 40 days, families were used as political pawns and  props while those responsible stood in front…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696699/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…grow our U.S. tax revenue. That is not adding deficit.  When you see people actually grasp that concept, it is fascinating to  be able to say, of course, I would rather people be paying taxes in the  U.S. as opposed to a foreign nation. Now, the foreign country doesn't  love that when we do it.\n\nIf we put things on par, companies will almost, in every…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694786/promises-made-promises-kept"}, {"senator": "Troy Balderson", "party": "Republican", "sentence": "…less  accountability. Instead of listening to grid operators, they raced to  advance extreme policies that threaten our most dependable power  sources with the American people paying the price.\n\nThe Reliable Power Act puts an end to this by preventing Federal  rules from moving forward if they threaten the ability of the grid to  keep the lights on.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698277/reliable-power-act"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…were the nicest apartments in  Madison, Wisconsin, were the low-income apartments. Not only do you get  a free apartment, but it is superior to the apartments that other  people are paying for.\n\nWith regard to childcare, I have heard a childcare provider say that  she preferred to get the vouchers--and I don't know if this is always  true; I have heard…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695628/breakdown-of-traditional-families"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…continue to be the world's leader when it comes to  energy production, instead of handcuffing our capabilities.\n\nWe have gone over a lot of serious issues. The American people who  are paying attention to this have already heard all of those arguments.\n\nMr. Speaker, I will simply say that I hope that all the Members of  this House will support the passage…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694880/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…absolutely nothing for it--zero.  Some of them may not even know they got it, but the money went to the  insurance companies directly from the government. The American people  are paying the price.\n\nThe fraud has gotten so bad that last year, 200,000 people-- Americans--filed complaints with the Federal Government about their  health insurance. And they…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697878/healthcare"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…labeling, certifying, and reporting requirements for  various appliances and commercial equipment. This is part of a broken  system that needs major reforms. The American people are done paying  for it with higher costs, created by government bureaucrats, for at- home appliances.\n\nUnder the Biden administration alone, the DOE implemented more than  30 appliance…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688546/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}]