[{"senator": "Val Hoyle", "party": "Democrat", "sentence": "…constitutional First Amendment right to speech and assembly, and  in the case of Mr. Pretti, his Second Amendment right to carry arms. I  also stand in honor of the 38 people who have died in ICE custody since  Kristi Noem became the head of DHS. Although they are not household  names, their lives are no less valuable, and we cannot forget them just  because…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699660/horrific-ice-abuses"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…they succeeded in  bloodying, wounding, injuring, and hospitalizing more than 140 police  officers on January 6. Several officers died in the subsequent weeks,  and several people died on that day.\n\nNow, we have passed a law, not a recommendation, not an idle promise,  and not a suggestion in a suggestion box, we passed a law to post this  plaque in the…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691242/leosa-reform-act"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…rushed to a hospital  and treated for pneumonia, COVID-19, and RSV in serious and severe  respiratory distress. She was described as being at the brink of dying.\n\nThirty-five people died in custody last year, and at least 6 died in  detention centers in January of this year alone.\n\nICE is in such a hurry that many of the officers don't get adequate  training.…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700023/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "…of why D.C. needs self-rule. We  should be clear. High-speed chases are deadly. They often end in  needless deaths, injuries, and devastating property damage.\n\nOver 3,000 people died in police car chases in the U.S. between 2017  and 2022. Half of those deaths were innocent bystanders not involved in  the chase. I will repeat. Half of the people who…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695640/district-of-columbia-policing-protection-act"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…months later the school year abruptly  came to an end when Shawn Jackson was shot and killed minutes after  receiving his high school diploma.\n\nThese are 2 of the 46,728 people who died from gun-related injuries  in 2023 alone. They were among the average 13,300 Black Americans who  die of gun violence every single year.\n\nSierra Jenkins, Jahiem Dickerson,…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691754/national-gun-violence-awareness-month"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…me to be able to  stand here today. There are names like James Reeb, Jimmie Lee Jackson,  Viola Liuzzo, Andrew Goodman, James Chaney, and Michael Schwerner.  These are people who died for me to be here today. Congressman John  Lewis, who most of you served with, died for me to be here today.\n\nThis bill would make it tougher than it has ever been in…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690003/safeguard-american-voter-eligibility-act"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…Amendment rights.\n\nTwo journalists have been arrested. Children have been taken from  their homes. U.S. citizens have been unjustly detained. At this point,  more than 35 people have died in ICE custody, and 15 have been shot.\n\nIf we allow this to continue, then what does that say about our  Nation?", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699729/violating-core-tenets-of-our-united-states"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…an accident near  where his hospital was located. If they hadn't had the hospital there  and been able to provide the emergency treatment that they provided,  those people would have died. He is talking about closing these  hospitals down.\n\nMake sure you understand, too, for many areas, this is the only  access to medical care that those communities…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690639/trumps-first-100-days"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…they need.\n\nAfter hearing her story, we were able to implement this waiver to  really increase our capacity as a State to address the opioid crisis.  We know that more people have died from the opioid crisis than all  world wars combined, and these are people that we didn't have to lose  if we actually had the system to support them.\n\nMr. Chairman, by…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691883/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…bill makes life less affordable and more painful. Instead of  uplifting lives, it will end them.\n\nWhen history looks back on this bill, its legacy will be: Trump lied,  and people died.\n\nVote ``no.''\n\nMr. KENNEDY of New York. Mr. Speaker, I am an occupational therapist.  I helped people live the fullest life they could given the cards they  were dealt.…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693225/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…witnessing in this country is not law enforcement. It is  violence followed by lies. It is authority without accountability.\n\nSince Trump returned to power, at least 36 people have died in ICE  custody, and 2 have been shot and killed by ICE agents. These are not  just numbers. They are lives, people with families. We must say their  names, tell their…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699041/authority-without-accountability"}, {"senator": "Tina Smith", "party": "Democrat", "sentence": "…they going to even get home?  That is happening in this country right now. And if they are not  released, because not everyone is released--if they are not released,  people have died in custody. People with no criminal record have been  deported to countries that they have never even known.\n\nSo this is happening in Minnesota, but this is not just Minnesota.…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699416/9999"}, {"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…else. Private prison and immigrant detention contractors spend millions  to influence elections and policy, all while people die in their  facilities. Mr. Speaker, three people have died in just the last 6  weeks at a privately run tent camp in El Paso.\n\nFossil fuel and mining companies pour enormous sums into elections to  block climate action while communities…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699240/restoring-election-integrity"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…the President was sworn in. This is when he signed the  pardon for these people who came into the Capitol in a very  rambunctious way and in a very demeaning way, in fact.\n\nPeople died as a result of this. He instigated this. What causes  people to think that he won't do it again? I believe that he will. I  believe that he will find great difficulty in…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697472/president-trump-is-a-threat-to-our-republic"}, {"senator": "Rob Menendez", "party": "Democrat", "sentence": "…administration's dangerous escalation of  immigration enforcement is a threat not just to Minnesota but to every  community and every American.\n\nSince Trump took office, at least six people have died during  enforcement activities by Federal agents. People are not just dying in  our streets. They are also dying in immigration detention centers run  by ICE and private…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699662/horrific-ice-abuses"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…illicit fentanyl and its related substances that are  pouring over our borders and into our communities.\n\nIn 2023, under the Biden-Harris administration, more than 107,000  people died of drug overdoses, roughly 75,000 of whom died from  synthetic opioids, largely illicit fentanyl, or fentanyl-related  substances.\n\nIncluded in that number is a family from…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692349/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…American, to embrace Western civilization, and to embrace the greatest  country the world has ever known that has bled around the world not for  conquest but to liberate people, that has died for people around the  globe to make it a safer and secure place.\n\nPeople want to come here to be a part of that, God bless them, but  the people who come here who…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…though, is the Constitution gives us the  power to initiate war, to declare war. But if we don't know if it is a  war until after all the people die and we add up how many people died  and they call it a constitutional war because a lot of people died,  wouldn't it then be a little bit late to vote on initiating a war?\n\nSee, this is an enormous debate.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699091/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…100,000 people nationwide, including 2,190 from my  home State of Indiana, died from a drug overdose. National numbers from  the same year indicate that approximately 75,000 people died an  overdose death related to synthetic opioids. Fentanyl deaths account  for as much as 77 percent of adolescent overdose deaths, and it is the  leading cause of death…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692263/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…fall under his Nazi regime.  He was nuts. And it took a bunch of people from all over the world,  particularly America, to destroy the Third Reich, and about 60 million  people died because we got it wrong in the thirties--6 million Jews.\n\nWe are not going to let that happen again as long as I am around, the  Presiding Officer, or President Trump and…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692780/iran"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…around the California coast.\n\nJust this week, we had a smuggler that was smuggling folks in a Panga  boat just on that exact route that capsized in the Pacific, and  multiple people died. Our Coast Guard went and responded and rescued  multiple people as well. Those folks will be processed, and they will  be returned right back to Mexico again.\n\nBut that…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690878/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Ron Johnson", "party": "Republican", "sentence": "…staffer said: We are going to  cling to this until planes fall out of the sky.\n\nThink about how you would feel if, God forbid, a plane--another  plane--fell out of the sky and people died. How could you live with  yourself?\n\nNow, again, you can continue the shutdown. I mean, that is your  political choice. You can continue to vote against the very reasonable…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696605/9999"}]