[{"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…them to resign or to leave, mostly  because of ideology, not because of the work they are doing.\n\nWe have to continue to tell the truth, which is that government is  people. Government works because of people. When you have a healthcare  claim, when you are trying to get your insurance, when you are trying  to apply for FEMA, when you are trying to…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690637/trumps-first-100-days"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…plan to keep our people secure.\n\nThe gentlewoman, my friend from North Carolina, said, and I believe  she is accurate, that we are all concerned about the lives of people,  be they government employees or not. This amendment says: Present us  the information, GSA and FBI, that shows us that, in fact, you can make  the Reagan Building safe for a security…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699075/providing-for-consideration-of-hr-financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…people of  Texas is not the way to do it.\n\nTexas Medicaid, Medicare, and Social Security programs must be  protected. They represent our commitment to the American people that  their government will be there to help them when they are at their most  vulnerable.\n\nThe fact is that these cuts will mean life-altering changes for  families across America and…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688235/democratic-proposals"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…episode, they are filling the government with unqualified sycophants,  who are running around firing meteorologists, health experts, and  emergency responders, people who keep our government running.\n\nToday, in the face of all of that, all of this chaos that our  Republican colleagues don't want to talk about, at least we are hearing  them engage in…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690937/gulf-of-america-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…insurrectionists should be  compensated, not the police officers, but rather the people who  perpetrated this assault on America.\n\nPresident Trump said: A lot of the people in the government really  like that group of people. He is creating a compensation fund not for  the officers  and their families who fought and suffered and several died to save our…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691030/expressing-support-for-local-law-enforcement-officers"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…this Trump shutdown continues, it appears more likely that  our Republican colleagues will totally give up Congress's power, which,  of course, is the power of the people in the government-funding  process.\n\nIn fact, this morning, reporters are circulating the Capitol,  speculating that Congress will give up on passing fiscal year 2026  appropriations…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696335/trump-administration"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…but, wow, we got  that new jet, that jet you talked about, for Noem--I hadn't heard about  that one. We got the new ballroom. We got the tax breaks for the  richest people.\n\nThis government by and for the billionaires ties into the  authoritarian perspective, because if you are a regular leader of a  democracy, you feel you are accountable to the people,…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…detention. That is an increase of 75 percent from the  previous year. Not surprisingly, the conditions are deplorable. There  was no preplanning of how to accommodate the people that the government  was taking into custody. Detainees are fed food laced with worms. These  are all documented facts. It is not a political argument. This is what  is happening. Many…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700023/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…public can't weigh in about the drilling rigs and the leaky  pipelines and the export terminals polluting their communities. This is  not government of, by, and for the people; it is government of, by, and  for the oil and gas companies. Families lose; billionaires win.\n\nThis emergency declaration is certainly a sham because renewable  energy costs less than…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688159/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "…immigrants. It  is about whether any of us can count on being treated fairly when  accused of something. It is about whether there are still rules that  protect people, or whether the government can just say: Trust us. We  don't have to follow the law.\n\nIt is about power unchecked and principles abandoned.\n\nJust yesterday, we also learned of a woman from…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690420/put-hardworking-american-families-first"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…public servants, many of them veterans, who show up every single  day to serve our country. Every American deserves a voice in the  workplace, and that includes the people who keep our government running  and open.\n\nEnsuring collective bargaining rights strengthens our Federal  workforce and helps deliver more effective, accountable service to the  American…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697983/protect-americas-workforce-act"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…yesterday, Senator  Thune will immediately put the bill on the floor, so we can immediately  get this to the President's desk and get back to doing the business of  the people now that the government is open.\n\nMr. STEIL.  Hageman).\n\nMr. Speaker, before we close, I just want to wrap up a few things  that have been discussed today.\n\nWe were closed as a Federal…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696929/repeal-of-senate-notification-requirements-relating-to-legal-process-on-disclosures-of-senate-data"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "Mr. ARRINGTON. Mr. Speaker, the era of woke and wasteful spending in  the people's government is over, and it is sad to watch this last-ditch  effort by my Democratic colleagues to fight for status quo. The status  quo is a cesspool of these leftist ideological…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693716/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "Mr. McCLINTOCK. Mr. Speaker, Zohran Mamdani's winning message was  affordability, that the necessities of life are increasingly out of  reach for most people, and that government is the answer.\n\nHe said on election night: ``There is no problem too large for  government to solve.''\n\nMr. Speaker, he is right about the problem, but he is completely…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697036/government-is-still-the-problem"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…GRASSLEY. Mr. President, I want to thank Chaplain Black for his  reminding all of us about the government shutdown and how irregular it  is and how we aren't helping people that government would normally be  helping.\n\nToday, we will vote on Ms. Rebecca Taibleson, the nomination to the  U.S. Court of Appeals for the Seventh Circuit, so I want to take a…", "date": "2025-10-27", "source_url": "https://justfacts.votesmart.org/public-statement/1696407/nomination-of-rebecca-l-taibleson"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…report documenting evidence of widespread fraud, with  billions of dollars going to fraudulent enrollees, including as many as  58,000 dead people.                                                    U.S. Government                                           Accountability Office,                                   Washington, DC, December 3, 2025.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698800/breaking-the-gridlock-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…craziness actually wasn't coming from  them. It was coming from people in the bureaucracy trying to throw out  stuff to make it more difficult and just really anger people. Then, the  government unions have to try to light things on fire, so disharmony.\n\nWe have five major databases in the Federal Government. Is it  Republican or Democrat to just build…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689381/us-borrows-billion-a-day"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…money  collected comes from an American who worked hard for it. That is why  waste, fraud, and abuse are not abstract problems. They are real  problems that hurt real people.\n\nWhen government programs pay twice for the same service, fund  projects that never get built, or lose track of billions, taxpayers  suffer and confidence in government weakens.\n\nWe…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699247/epidemic-of-waste-fraud-and-abuse"}]