[{"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "On behalf of the people of Colorado's Seventh Congressional District,  it is my honor to congratulate John Curtis on his promotion to Chief of  South Metro Fire Rescue.", "title": "Recognizing John Curtis", "date": "2025-06-05"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "On behalf of the people of Colorado's Seventh Congressional District,  it is my honor to thank Annette Stolba for her four decades of service  to the citizens of Chaffee County.", "title": "Recognizing Annette Stolba", "date": "2025-02-25"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "On behalf of the people of Colorado's Seventh Congressional District,  I am honored to congratulate Chief Bob Baker on his retirement.", "title": "Recognizing Chief Bob Baker", "date": "2025-06-05"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "On behalf of the people of Colorado's 7th Congressional District, it  is my honor to congratulate Fire Chief David Ramos for his more than  four decades of service with the North Metro Fire Rescue District and  sincerely thank him for his contributions to the Colorado community.", "title": "Recognizing Fire Chief David Ramos", "date": null}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "On behalf of the people of Colorado's Seventh Congressional District,  it is my honor to congratulate Dr.", "title": "Recognizing Dr. Kiara Kuenzler", "date": "2025-06-05"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "I do want to read some letters  that have been written to me from people in Colorado who are deeply  concerned about these cuts to Medicaid.", "title": "H. Con. Res. 14", "date": "2025-04-03"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "On behalf of the people of Colorado's Seventh Congressional District,  it is my honor to congratulate the Conifer Area of Commerce for 50  years of service and thank them for their contribution to our  community.", "title": "Recognizing the Conifer Area Chamber of Commerce", "date": "2025-08-08"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "It is absolutely critical for  the people of Colorado that Congress act, that we support, once again,  the Arkansas Valley Conduit, which we have unanimously.", "title": "-9999", "date": "2026-01-08"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "On behalf of the people of Colorado's 7th Congressional District, it  is my honor to congratulate this school, staff, administration, and  board members for this accomplishment and thank them for their  commitment to our kids and our community.", "title": "Recognizing Canon City High School", "date": null}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "On behalf of the people of Colorado's Seventh Congressional District,  it is my honor to congratulate Joe Garcia and thank him for his  commitment to the people of Colorado.", "title": "Recognizing Chancellor Joe Garcia", "date": "2025-03-31"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "On behalf of the people of Colorado's Seventh Congressional District,  it is my honor to congratulate Avi Bender for this impressive  accomplishment and wish Avi all the best for this upcoming year in  Germany.", "title": "Recognizing Avi Bender", "date": "2025-07-02"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "On behalf of the people of Colorado's Seventh Congressional District,  it is my honor to congratulate Elevation Beer Company for this  accomplishment.", "title": "Recognizing Elevation Beer Company", "date": "2025-08-08"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "On behalf of the people of Colorado's 7th Congressional District, it  is my honor to thank President Buchanan for his hard work and  dedication to serving his country and his community.", "title": "Recognizing Morgan Jay Buchanan", "date": null}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "On behalf of the people of Colorado's Seventh Congressional District,  it is my honor to congratulate Alex Willis for his win at the 2025  Winter Triathlon National Championships, and join his friends and  family in rooting for his success at the World Championships.", "title": "Recognizing Alex Willis", "date": "2025-06-05"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "On behalf of the people of Colorado's 7th Congressional District, it  is my honor to congratulate Tom Downey for his awards and thank him for  his contributions to our community.", "title": "Recognizing Tom Downey", "date": "2025-10-17"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "His constituents, the dear people of  Colorado, and many other constituents in blue States, like New York and  California, probably are paying record prices for electricity and other  energy products.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the Bureau of Land Management Relating to ``North Dakota Field Office Record of Decision and Approved Resource Management Plan''", "date": null}, {"senator": "John Kennedy", "party": "Republican", "sentence": "Why would a councilwoman or a councilman in a  city of 100,000 people in Colorado not want to see more houses built?", "title": "Providing for Congressional Disapproval Under Chapter 8 of Title United States Code, of the Rule Submitted By the Centers for Medicare Medicaid Services Relating to ``Patient Protection and Affordable Care", "date": "2026-01-13"}]