[{"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…us to do,  fight for them.\n\nThat is why I will sign the discharge petition right now to release  the Epstein files, because justice cannot wait another day.\n\n``Forward my people. Thank you very much.''\n\n``Adelante mi gente. Muchas gracias.''", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696711/welcoming-the-honorable-adelita-s-grijalva-to-the-house-of-representatives"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…right. It is dangerous  to be right when the establishment in this country refuses to  acknowledge what is taking place.\n\nThank God for people associated with free speech for people. Thank  God for the impeach and removal coalition, people who are willing to be  a part of the avant-garde, who are willing to take the proper stand  when they see democracy at…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699134/where-do-you-stand"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…wants to spend money on and what the American people need,  does the President have his priorities straight? Are his priorities  right on behalf of the American people?\n\nMr. MERKLEY. Well, thank you so much to my colleague from Delaware.\n\nThat question rather answers itself after listening to all the points  you were making, which were right on.\n\nHow…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…protected and remain as robust as       possible. We oppose modifications that would have the effect       of reducing important benefits or excluding vulnerable people       from participating.\n\nThank you, the Jesuit Conference.\n\nWhy? I mean, we have just read dozens and dozens of letters from real  people who are relying on these programs to take care of…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…constituents who have elected us. Let's get back to the people's  business.\n\nKamlager-Dove).\n\nMrs. McIVER. Mr. Speaker, I am telling you, it is time for us to work  for the people.\n\nI thank the fine gentlewoman from California for those remarks. It is  time for us to work for people. That is what we are here for. That is  what your constituents voted for…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695039/better-is-possible"}, {"senator": "Nikema Williams", "party": "Democrat", "sentence": "…and new financing commitments to  the government, incentivizing the Burmese Government to give power back  to the most important piece of any thriving free country: the people.\n\nI thank Congresswoman Young Kim for co-leading this important  legislation with me. I also thank Chairman Hill and Ranking Member  Waters for their support of this priority. I…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697197/no-new-burma-funds-act"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…their ambitions for our country. We should find a better way of  supporting them, and we should shelve this budget, which is going to do  nothing but harm the American people.\n\nI thank the Presiding Officer for his patience. I thank the staff for  being here so late tonight even though tonight's lateness is going to  be nothing compared to tomorrow night's…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689543/h-con-res-14"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…knowledge  is a supreme exemplar of what can occur when we have these  circumstances that require bold action, but you can't have bold action,  Mr. Speaker, without bold people. I thank the ranking member for her  bold action.", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697285/systemic-risk-authority-transparency-act"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…during the primary and  helped me secure the New York Times endorsement.\n\nI wish Daniel the best of luck as he continues to fight for the  rights and liberties of all people and I thank him for his service.", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693365/recognizing-daniel-rubin-and-his-service-to-the-house-of-representatives"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…Mr. President, before he leaves the floor, I just want to  thank Leader Schumer for all the help. We are going to be focused today  on something that really matters to people, and I thank him.\n\nMr. President, we are beginning, as you can tell, to discuss the  resolution to repeal the global tariff emergency.\n\nAs is becoming routine under this President,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690532/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…Republicans know deep down that Donald Trump's tariffs are  awful for their States. So today they have to choose: Stick with Trump,  or stand with your States and the people of America.\n\nI thank my colleague and yield to the Senator from Oregon, the  ranking member of Finance, who has done such a great job on this issue.\n\nMr. SCHUMER. Mr. President, first,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690523/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Katherine Clark", "party": "Democrat", "sentence": "…smile, with pride, and  always with helpful information, because above all, she is driven by a  love of country, a love of justice, and a love of this institution and  its people.\n\nWe thank Allison for her hard work, and we wish her all the best on  her next chapter.\n\nWe will not forget Allison, and we hope she will not forget us.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695729/farewell-allison-blankenship"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…is what this is really all about.\n\nMr. MEEKS. Mr. Speaker, I just say that the President said yesterday  that  that oil was the United States' oil, not the Venezuelan people.\n\nI thank the gentlewoman for her passion, though. I only wish she had  the same passion to speak out against the Trump administration's mass  deportation of Venezuelans legally…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698248/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Steve Womack", "party": "Republican", "sentence": "…among us have  lived the American Dream like he has, and what a difference he has  made.\n\nMr. Speaker, I say to Doug and Shelley: Well done. I know I speak for  a lot of people. I thank him for his example of selfless service and  his commitment to helping his fellow man. Godspeed and may he enjoy a  well-earned retirement.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698690/recognizing-doug-mcmillon"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…shepherded  more than 40 bills through the House and got more than 15 bills signed  into law.\n\nThese are real results that have made a difference in the lives of  the American people.\n\nSo I thank Alex, and I hope that he knows how proud we all are of  what he has accomplished.\n\nWe will miss Alex, but he will always be a part of our family.", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688120/thanking-alex-cisneros-legislative-director"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "…million.\n\nAs we look to prevent waste, fraud, and abuse, this legislation has  increased transparency requirements to ensure maximum accountability to  the American people.\n\nAgain, I thank Mr. Thanedar for his work on this important  legislation, and I appreciate Chairman Green and the committee staff  for their work on this issue. I urge all Members…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688704/producing-advanced-technologies-for-homeland-security-act"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…good friend.\n\nMr. COLE. Mr. Speaker, I am prepared to close, and I reserve the  balance of my time.\n\nMr. Speaker, when you reach a point like this, there are a lot of  people to thank. I will begin by thanking the President of the United  States. He supported each and every one of these tranches of bills that  have been brought to the floor during this…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699575/consolidated-appropriations-act-2026"}]