[{"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…Instead, House Republicans passed a  blueprint to slash up to $2.5 trillion from Medicaid.\n\nIn my State of Pennsylvania alone, that jeopardizes care for nearly 3  million people, including 100,000 people struggling with addiction.\n\nIn my district, that means risking medical care for more than 45,000  people under the age of 21 and more than 15,000 people…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688326/funding-medicaid-is-not-negotiable"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Republicans are successful in repealing this rebate program, they  are not just scrapping some hypothetical program. They are removing  real dollars from real States, real people, including the States that  they represent.\n\nAgain, we have this affordability crisis. Why eliminate a rebate that  puts money back in Americans' pockets?\n\nMr. Speaker, I urge my…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700221/homeowner-energy-freedom-act"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…of the people being apprehended by ICE have had no convictions  for violent crime.\n\nICE is not going after MS-13 or murderers or rapists. They are going  after innocent people, including a woman in Tennessee who was 5 months  pregnant and engaged to a U.S. citizen.\n\nIris Dayana Monterroso-Lemus was transferred to a detention center in  Louisiana. She…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692896/condemning-violence-by-ice"}, {"senator": "Maggie Goodlander", "party": "Democrat", "sentence": "…All-Holiness Bartholomew, the longest- serving Archbishop of Constantinople in the two-thousand-year history  of Christianity and the spiritual leader of a church of 300 million  people, including more than 4,800 Orthodox Christians living in New  Hampshire. Ordained to the Diaconate in 1961 and to the Priesthood in  1969, Ecumenical Patriarch Bartholomew served…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695371/recognizing-the-ecumenical-patriarch-of-constantinople-his-all-holiness-bartholomew"}, {"senator": "Brad Schneider", "party": "Democrat", "sentence": "…attack at  Bondi Beach last month.\n\nWhen a father-and-son pair of ISIS-inspired gunmen began massacring  Jews during a Hanukkah celebration on the beach--murdering 15 people,  including Rabbi Ulman's son-in-law--Ahmed, a Muslim who was at the  event by serendipity, rushed for cover. As one of the terrorists  approached his position, Ahmed heroically…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699026/the-light-will-win"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "…the Trump administration  continues to defy a Supreme Court ruling to return this man to his  family. In fact, it is a full-blown constitutional crisis.\n\nThere are other people--including Andry Jose Hernandez Romero, a  makeup artist and legal asylum seeker, and Merwil Gutierrez, a teenager  who was mistakenly picked up by immigration enforcement--languishing…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690509/trump-immigration-policies"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…affected by the expiration of the enhanced premium  tax credits.\n\nThe Centers for Medicare and Medicaid Services reported earlier this  week that more than 1.4 million people, including tens of thousands in  New Hampshire, have already lost their healthcare coverage because of  the unaffordable cost increases of healthcare premiums without the  enhanced…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699085/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…``other.'' His efforts to round  up thousands and thousands of people he views as ``the other'' on  spurious charges and without due process are sweeping up all kinds of  people, including children, and they are hurting our country, hurting  our economy, and hurting my Commonwealth.\n\nI would like to start with what the President has said. These  policies…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699611/9999"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…hurting the American taxpayer. It is inexcusable. It  is inexcusable that my Republican colleagues are looking to enact these  tax cuts at the expense of the American people, including cutting up to  $880 billion from Medicaid over the next 10 years.\n\nNearly 1 in 4 Americans, or 80 million American people, are covered  by Medicaid. These cuts that the…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690628/republican-tax-cuts"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…the ACA premiums by 3 years--the ACA tax credits by 3 years. But  Republicans blew it by voting our bill down, and now they have all but  guaranteed that millions of people, including countless New Yorkers,  will see their premiums go up.\n\nIn fact, sadly, today is the last day for Americans to sign up for  January Marketplace coverage. And over the…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698199/new-york"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…investing  more in weather forecasting, not less?\n\nAnd when you look at NOAA workers who support our commercial and  recreation and Tribal fisheries--they employ 1.7 million people,  including thousands in the State of Washington. Why would you cut  specialized workforce that are helping support the growth of GDP?  Because you want to basically cut those technical…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688430/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…of how it is going to change lives.\n\nYou can imagine my disappointment as the Social Security  Administration has taken recent actions to hurt, not help, the American  people, including those in Ohio's 13th. From cutting phone helplines,  to requiring certain services be conducted in person, to slowing down  processing times, and closing offices, the…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690424/social-security-administration-is-there-to-help-not-hurt-americans"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…Department of  Education apart from the inside, Republicans in Congress have passed  punitive blueprints that will cut trillions from government services to  the American people, including education, all to pay for tax cuts for  the richest Americans and Big Business.\n\nIn the Senate, the Republicans are calling for an unspecified $9  trillion in cuts. In…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688311/nomination-of-linda-mcmahon"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…mentoring at New Life Centers, Mario understands that  building community and building relationships are the recipe for safer  neighborhoods. Through his mentorship of young people, including those  in my own community of Humboldt Park, he sees, values, and affirms  young people and supports their journey to find their confidence and  purpose.\n\nMario's work…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697836/commending-omar-martinez-gonzalez"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…their life better, they  have been focusing on a variety of other things that relate simply to  jamming their extreme rightwing ideology down the throats of the  American people, including by targeting organized labor, hardworking  men and women, including those who are part of the Federal workforce.\n\nWhat is it that Federal employees do each and every…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697994/protect-americas-workforce-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…North Korea.\n\nFortunately, this proposal was swiftly and nearly unanimously  rejected by the House of Representatives. Look at the vote total. A  grand total of three people, including the author, voted ``yes.'' Every  single other Member, Democrat or Republican, over 400 Members, voted  ``no.''\n\nThis sent a very important message regarding what was…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689211/protecting-medicaid-for-californians"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…house in Dripping  Springs, Texas, 47 individuals who are affiliated with the gang Tren de  Aragua were found by ICE. Right down the road in suburban Austin,  Texas, 47 people, including 9 children, were found in what was a stash  house, moving narcotics through it.\n\nThis is the same gang that killed Jocelyn Nungaray last summer. This  is the same gang…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689708/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Rick Scott", "party": "Republican", "sentence": "…Jewish  people.\n\nThese terrorists murder babies and women in cold blood, take and  murder innocent people, and brag about their acts with no remorse. They  took innocent people, including Americans, hostage and tortured them.  They still hold the bodies of American hostages to deprive their  families of closure.\n\nIsrael is the United States' greatest democratic…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691647/recognizing-the-significance-of-jewish-american-heritage-month-and-calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism"}, {"senator": "Scott Fitzgerald", "party": "Republican", "sentence": "…Bartholomew  to our Nation's Capital. As the Head of the second largest Christian  Church in the world, Ecumenical Patriarch Bartholomew leads a Church of  300 million people, including a large community in Southeastern  Wisconsin.\n\nHis work towards the cause of peace should be commended, and on  behalf of Wisconsin's 5th Congressional District, I congratulate…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695466/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…kill over a million people with pride, not even embarrassingly and  hiding it, but taking pictures of it, and their sympathy goes towards  the people killing the thousand people, including young children, one  has to wonder if something psychological is going on here.\n\nMy belief is that anybody who is hostile to Israel in this conflict  and is demonstrating…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690921/big-beautiful-bill"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…whistleblower disclosures of violating grand  jury secrecy rules when I obtained 197 of Jack Smith's subpoenas--wide- ranging subpoenas--that violated the privacy of a lot of people,  including a lot of Members of the Senate and Congress.\n\nSenator Johnson and I then made these subpoenas public--almost 2,000  pages of information. That information exposed that…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699769/whistleblowers"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…paraded them out on  the news day after day after day until President Reagan secured their  release.\n\nIn 1983, a suicide bomb in Beirut, paid for by the Iranians, killed  63 people, including 17 Americans. In 1983, later that year, we all  know they blew up our barracks with our marines, killing 241 people.  Between 2003 and 2011, more than 600 American soldiers…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692703/thanking-president-trump-for-saving-the-world"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…Russia then proceeded to launch  attacks into Ukraine that killed innocent civilians. More recently,  Russia launched two ballistic missiles and 165 drones, wounding 11  people, including 2 children.\n\nOne 54-year-old Kyiv resident, whose car caught fire during the  attack, expressed frustration at the lack of progress for peace,  saying:\n\nThey can't agree…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690955/ukraine"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…are two young people who had very bright and  promising futures in front of them.\n\nIn Australia, two terrorists opened fire on a Hanukkah celebration.  They murdered 15 people, including a 10-year old girl and a Holocaust  survivor.\n\nWe know that anti-Semitism is a sickness. It is spreading across the  globe, and world leaders must do more to protect…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698427/unanimous-consent-requests-the-calendar"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…with diesel fuel and with  ammonia nitrate, lit fuses, walked away, got in his car and drove away.\n\nAs he drove away, behind him, the explosion went off that killed 168  people, including 19 children who were in the daycare center on the  ground floor. And our Nation was forever changed.\n\nWe pause every year still in Oklahoma. We have never forgotten.…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690112/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…Democrats to  oppose this resolution, and here is the reason why: We have a New York  Times Ipsos poll that tells the story on this. Seventy-nine percent of  the American people, including 67 percent of Democrats, want to make  certain that female sports are for girls and women. Those numbers--67  percent of Democrats, 79 percent of all Americans--say they…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688449/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}]