[{"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…colleagues are ready to explain why they gave  the ultrawealthy a $250,000 tax break--you heard that right, a $250,000  tax break--while gutting Medicaid--a gut punch to people who depend on  Medicaid to be able to get the care they need for themselves or for  their kids, maybe some other loved ones; the same Medicaid which helps  cover the births of nearly…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694383/9999"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "Mr. DAVIS of Illinois. Mr. Speaker, in Illinois, there are 465,000  people who depend on the Affordable Care Act to acquire health  insurance. For the past several years, the majority of them have used  enhanced Federal tax credits to lower the cost.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698790/breaking-the-gridlock-act"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…depend on.\n\nIt is so important, and it requires a broad ecological balance to  sustain the farms, fisheries, entire ecosystems, and so many  communities and millions of people that depend on it. You can't destroy  an ecosystem and expect farms, cities, and wildlife to just thrive.  These things rise or fall together.\n\nThis resolution takes us in the wrong…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690601/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt"}, {"senator": "Sheila Cherfilus-McCormick", "party": "Democrat", "sentence": "…Mr. Speaker, that is not a choice any mother should have to face.  That is not freedom. That is fear.\n\nMaria is not alone. In Florida's 20th District, more than 200,000  people depend on these tax credits, and many are already dealing with  serious gaps in their healthcare.\n\nThis is not a policy debate. This is not a question of who we choose  to value.…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697212/medical-bills-are-too-high"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…Bowens was a man of convictions. He was outspoken when  injustice threatened the vulnerable, and he was steady when storms-- literal and figurative--tested Terrell County. People could depend upon  him. When difficult choices had to be made, neighbors sought his  counsel because they knew his word was his bond. He earned the respect  of fellow law enforcement…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699826/in-memory-of-sheriff-john-bowens"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…country and the largest cut to  Medicaid in the history of our country.\n\nMany are actually denying that they are even cutting them. That is a  slap in the face of so many people who depend on it.\n\nDon't take it from me, Mr. Speaker, but take it from the  Congressional Budget Office and many others who continue to say that  nearly 14 million Americans will…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691614/budget-cuts-will-harm-families"}, {"senator": "Katherine Clark", "party": "Democrat", "sentence": "…strength and unity of our Democratic Caucus, the  House will vote to restore the ACA tax credits, and I will vote to  restore the affordable marketplace plans that working people depend on  to stay healthy, to live, to survive.\n\nToday, I will vote to prioritize the lives of regular people over the  greed of billionaires and start bringing the Republican…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698792/breaking-the-gridlock-act"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…programs.\n\nMr. Speaker, we must and will oppose attempts to slash those  services, and we won't support a partisan, poisonous bill that hurts  the people we serve and the people who depend on us, the people who  have elected us to work on their behalf and their behalf only. That is  as simple as that. We will not support it, point-blank, period.\n\nBetter…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695039/better-is-possible"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…not just talking about Medicaid. There  is a real risk of Medicare Part D being touched--the prescription drug  piece of that--and the Affordable Care Act, which so many people depend  on, the many, many people being cut off from that at the end of the  year. The math just doesn't work.\n\nSo what we are really talking about is, in the State of Michigan…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689544/h-con-res-14"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…seniors, working parents, and  people with disabilities. These are neighbors. These are people who I  grew up with in church. These are people I went to school with. These  people depend on these programs to survive, not because they want to  but because they have to.\n\nCutting these benefits would force impossible choices amongst some of  these people between…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692812/providing-for-consideration-of-hr-military-construction-veterans-affairs-and-related-agencies-appropriations-act-providing-for-consideration-of-hr-special-interest-alien-reporting-act-of-providing-for-consideration-of-hr-jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-and-providing-for-consideration-of-h-res-condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…Just like every other action before us, the Republicans' budget is a  betrayal of the American people. The majority is choosing billionaires  over programs that everyday people depend on.\n\nIn my district alone, hundreds of thousands of people will lose  Medicaid. Tens of thousands will lose SNAP benefits that help put food  on the table. The Natural…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688067/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…watching, and they hope no one  notices until it is too late.\n\nTexans are paying attention, and I am here to sound the alarm on this  outrageous bill. In Texas, over 5 million people depend on Medicaid.  They are children with disabilities, working moms, and aging parents in  nursing homes. These cuts will lead to fewer doctors, longer wait  times, and hospitals…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691436/republican-budget-bill"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…raise them.\n\nMr. Speaker, I urge all Members to join Senate bipartisan opposition  to this resolution and vote ``no.'' Stand up for our constituents.  Stand up for the people who depend on us every day to make sure they  too can have a decent quality of life.\n\nWe are watching what Trump and Musk are doing, aligned with the  billionaires who want more…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689845/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…unable to verify their  cards or perhaps receive payments that they have been denied, and  others--millions of other Americans--who unnecessarily will be hurt,  perhaps people who depend on the social safety net that we have  established and may be torn by this shutdown.\n\nAnd I am thinking about the millions of Americans--about 24 million  in total, 139,000…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695920/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…continuum of care dollars support nearly 2,700 beds in my district for  families, veterans, and young people who need a safe place to sleep.  Any cut could disrupt services that people depend on and, most  importantly, keep them without a roof over their head.\n\nWe also have to confront the root causes of this crisis. Large  corporate investors are buying up…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699021/rising-housing-costs"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…issued by BLM has imposed sweeping       restrictions that curtail responsible development, undermine       congressional intent, and disregard the well-being of the       people who depend on these lands for both subsistence and       livelihoods.\n\nThe impacts of the 2022 ROD are especially severe for the       North Slope. Oil and gas development in the…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696834/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…Despite that, the 2022 plan ``imposed sweeping restrictions that  curtail responsible development, undermine congressional intent, and  disregard the well-being of the people who depend on these lands for  both subsistence and livelihoods.''\n\nThe letter then goes on to explain how the impacts of the 2022 plan  ``are especially severe for the North Slope.…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696449/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…tragedy demands a full and thorough investigation to ensure that  no family endures this kind of heartbreak again. The safety of our  skies and the trust of the American people depend on accountability,  transparency, and action.\n\nMr. Speaker, let us honor the memory of those we lost by ensuring  that such a catastrophe never happens again. I urge my…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688370/expressing-condolences-to-the-families-friends-and-loved-ones-of-the-victims-of-the-crash-of-american-eagle-flight-5342-and-pat-25"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…administration's 2022 plan imposed ``sweeping restrictions that curtail  responsible development, undermine congressional intent, and disregard  the well-being of the people who depend on these lands for both  subsistence and livelihoods.''\n\nThese communities are located in an area nearly the size of Minnesota  with no highway connections, extreme transportation…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696835/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision"}, {"senator": "Dan Newhouse", "party": "Republican", "sentence": "…people who they  represent.\n\nThe most important thing right now is that we get back to work,  making sure that the Federal Government can provide the essential  services that people depend on and that Congress can continue working  to pass full-year funding legislation, providing responsible Federal  spending and funding those essential services.\n\nMr. Speaker,…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696734/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…across the globe. He  and his neighbors were the ones building their homes, growing their own  food, and when necessary, taking up arms to provide for their own  defense. People who depend on others for essential things cannot rule  themselves, and if they cannot rule themselves, they cannot keep a  republic.\n\nYes, times have changed. The economy of today…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690533/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…by the Biden administration imposes ``sweeping restrictions that  curtail responsible development, undermine congressional intent, and  disregard the well-being of the people who depend on these lands for  both subsistence and livelihoods'' and ``disregards the economic needs  of North Slope communities, and creates unnecessary obstacles to  infrastructure,…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…but to  those who would refuse commonsense changes today and instead allow this  critical safety net program to become fiscally unsustainable, leaving  behind the very people that depend on it every single day.\n\nIf we want Medicaid to be there in its entirety for the next  generation, for those that truly need us, who we need to be working for  every…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691514/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}]