[{"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…graph, it goes from no change--that is the tan; that is most of  it--all the way to--how about that one? You can't read it; so I will  tell you what it says: minus 100 percent--a total wipeout of your  home's value because it is uninsurable and unmortgageable.\n\nThat is the future we are looking at. This is the energy emergency.  This is the real energy…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696122/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…for Connecticut. Friends in Connecticut, listen to what these haphazard  tariffs will do. Canada is Connecticut's single largest trading  partner, accounting for 20 percent of our total trade in 2024,  including 13 percent of our exports and 25 percent of our imports.\n\nConsumers in Connecticut already face some of the highest electricity  prices in…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689487/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…copays and coinsurance to get a diagnosis and  receive treatment.\n\nAnother constituent, a schoolbus driver named David, saw his premiums  double. He is now spending 12 percent of his total pretax income on  health insurance. David wrote:\n\nIt's difficult and frustrating to see life crumble before       your eyes. Just trying to get ahead and just to find…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698975/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…largest export market and the  largest source of imports. Trade with Canada accounted for 35 percent  of our State exports and 67 percent of Vermont's imports and 56 percent  of its total trade.\n\nWe have small businesses now that are really struggling to keep their  lights on. We have farmers across the country but also farmers in  Vermont who are incredibly…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696453/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…21 percent of Army soldiers, Black or African American,  while represented in the enlisted ranks, are underrepresented in the  highest leadership levels, although 40 percent of the total Active-Duty  Force consists of people of color.\n\nYou have heard about Robert Smalls becoming the first Black captain  in the United States Navy during the Civil War.…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699864/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…provides funding for  sport fish restoration, aquatic education, wetlands restoration and  boat-related activities. Under this Act, each state receives a minimum  of one percent of the total amount apportioned, while D.C. is capped at  one-third of one percent.\n\nI urge my colleagues to support this bill.", "date": "2026-02-20", "source_url": "https://justfacts.votesmart.org/public-statement/1700089/introduction-of-the-pittman-robertson-wildlife-restoration-act-and-dingell-johnson-sport-fish-restoration-act-district-of-columbia-equality-act"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…he was raising money from  individuals, folks who were spending $25, $100, maybe a couple hundred  dollars on campaign contributions. Individuals today make up just 16  percent of total spending in elections--16 percent. Eighty-four percent  of all the spending in elections today is not done by citizens; 84  percent of spending is by corporations and…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699117/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…else is doing the same thing? The regional Head  Start office serving my district closed, and Head Start funding at  roughly $12 billion annually represents less than .2 percent of total  Federal spending.\n\nEliminating Head Start would cut childcare and supportive services  for about 80,000 young children in California.\n\nThen let's talk about ag. This…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691088/big-backstabbing-bill"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…facts. The price of beef has risen 16.4 percent since last  year. The price of coffee is up 19.8 percent. The price of lettuce is  up 7.3 percent. Frozen fish is up 8.6 percent. In total, families paid  $310 more for groceries during President Trump's first year in office  compared to 2024, so spare us these ruminations about Joe Biden.\n\nIf they want…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699903/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…and everyone benefits.\n\n``The Office of the U.S. Trade Representative says that in 2023 the  industry added more than $809 billion to the U.S. economy, or about  11.2 percent of total U.S. manufacturing output, supporting `9.7  million direct and indirect jobs.' In 2022, the U.S. exported $75.4  billion in vehicles and parts to Canada and Mexico. That…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…Security, and I asked people: Just tell your stories.  And the stories came flooding in, and here are just a few:\n\nI'm on Social Security disability--it's about 95 percent of       my total income. Every month since Trump took office this       year, I've worried about whether or not my [Social Security]       payment will come as usual.\n\nYes, there…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690633/nomination-of-frank-bisignano"}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "…stay open and thrive.  Instead, these fraudsters took advantage of the lax application  screenings, which we believe may have resulted in them receiving at  least 17 percent of the total Small Business Administration assistance.\n\nMs. SIMON. Mr. Speaker, the Biden administration has created new  safeguards to reduce the potential for this fraud, but this…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687934/assisting-small-businesses-not-fraudsters-act"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…predictability and  transparency.\n\nAs the name suggests, this is focused on the entirety of the  individuals on healthcare. This isn't just targeted toward a small 7  percent of the total population that is that narrow margin in  ObamaCare. This is touching every single person, and that is the only  way to actually lower health premium costs over time.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698435/republicans-have-delivered-in-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…years ago to promote a return to core Islamic values.\n\nThey said that the FMF controlled 139 places of worship in France and  a further 68 affiliated--in all, around 7 percent of the total. The  organization ran some 280 associations.\n\nMr. Speaker, 7 out of 10 French voters would back a ban on the  Islamic veil in public because of what is happening in…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698106/bringing-america-back-to-its-roots"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…development.\n\nSchool nutrition programs provide critical access to the nutrients  growing children need, including those provided by milk. In fact,  school meals provide 77 percent of the total daily milk consumption for  low-income children ages 5 to 18.\n\nIn addition, it is also important to remember that this legislation  does not require any student to drink…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698178/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Yet, 2025 total receipts--receipts are tax collections. It is just  Ways and Means speak. We don't call them taxes. We call them receipts.  For this year, we gained 3.7 percent of our total receipts from customs  duties. Wonderful.\n\nWe can have a whole other presentation, debate, on its effect on the  economy, who actually pays it, whether is it paid by…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695567/we-are-borrowing-a-second"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…the Federal Government.  Yay. The punch line here, get to the bottom 20 percent, we actually pay  them. Take the bottom 40 percent, it is actually less than 5\\1/2\\  percent of the total Federal income tax. I don't know how much more  progressive you can make the tax system.\n\nIf you want to do a super progressivity, great. When the people keep  lying…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688651/a-real-math-problem"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…in California because of the unusual extent to  which our State relies on the highest earners.\n\nIn some years, our State budget, our State income tax revenue gets 50  percent of its total revenues from the top 1 percent of earners. When  you see those people leaving the State, it means that the house of  cards that is our State's finances will come tumbling…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699151/misguided-policy-in-california"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…affordable financing for the acquisition of fixed  assets, such as land, buildings, and heavy machinery.\n\nTo obtain a 504 loan, a small business owner must contribute 10  percent of the total project cost as a form of downpayment. However, if  a small business is seeking financing to build something like a surgery  center or a nursing home, the SBA imposes…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699166/main-street-parity-act"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…spending.\n\nIn 2024, the Federal Government spent over $1.8 trillion, and that is  just in discretionary spending. The rescissions are only addressing  one-half of 1 percent of that total. Democrats would consider this a  rounding error.\n\nThis administration has spent months combing through our Federal  budget, line by line, identifying waste, fraud,…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692534/rescissions-act-of-2025"}, {"senator": "Keith Self", "party": "Republican", "sentence": "…multi-class  structure.\n\nI will tell you, Mr. Chair, this section 307 specifically targets  directors, director nominees, named executive officers, and any holder  with 5 percent or more of total combined voting power. It requires  their share ownership and voter power to be expressed as percentages.\n\nMr. Chairman, investors are not children. The Federal Government…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697825/increasing-investor-opportunities-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…reconciliation process, and then interest is off of the table because  you have to pay it. You can't just magically not pay the interest. That  adds up to what? It is about 47 percent of the total fricking budget.  It is half the budget.\n\nMr. ROY. Correct.\n\nMr. ROY. I have done it before.\n\nMr. ROY. Right.\n\nMr. ROY. Right.\n\nMr. ROY. Yes.\n\nMr. ROY. If the gentleman…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690587/economic-anxiety"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…enrollment and exploitation of the 2018 farm bill by the Biden  administration ballooned the annual spending on the Supplemental  Nutrition Assistance Program by 66 percent at a total cost of $256  billion, leaving workers on the sidelines while small businesses paying  record wages struggle to find help.\n\nThis egregious executive overreach not only…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688080/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Troy Balderson", "party": "Republican", "sentence": "…legislation  will bring much-needed reforms to the Federal permitting process.\n\nNatural gas has become the foundation of America's energy mix,  accounting for almost 40 percent of our total energy production and 43  percent of electricity generation.\n\nThe shale revolution has ushered in a new era of American energy  independence and revitalized communities…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698070/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…and I get to vote on. As Members of  Congress, we only vote on the discretionary portion, and this was a  2025 chart. Today, it is  probably only 25 percent, not 26 percent, of the total spending. Every  dime of that is borrowed.\n\nMr. Speaker, the math for last year, for every dollar we took in, in  tax receipts, we spent $1.43.\n\nWe were just in the…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699257/debt-deficits-and-demographics"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…repeated efforts by the Biden  administration to hold back that progress and to specifically target  SpaceX.\n\nNow, it needs to be noted that SpaceX accounts for over 90 percent of  the total payload brought into orbit in the entire world, and so  targeting SpaceX is truly weakening our own country given how important  our global dominance in space is. So…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689211/protecting-medicaid-for-californians"}, {"senator": "French Hill", "party": "Republican", "sentence": "…directly or indirectly, by or through a deposit broker to the       extent that the total amount of such custodial deposits does       not exceed an amount equal to 20 percent of the total       liabilities of the eligible institution.\n\n``(2) Definitions.--In this subsection:\n\n``(A) Custodial deposit.--The term `custodial deposit'       means a deposit…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}]