[{"senator": "Lucy McBath", "party": "Democrat", "sentence": "…the FBI has released warnings on the growing risk this poses to  our kids, and the National Center for Missing & Exploited Children  (NCMEC) has reported a nearly 200 percent increase in attempts. As our  social landscape continues to evolve, placing our most vulnerable  population online more often, we must be prepared with the laws to  deter and punish…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699202/supporting-hr-the-combating-online-predators-act"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…course, Loudoun Hunger Relief. They did so much: fresh produce,  sweet treats, pantry essentials, and even Thanksgiving meals coming up  next week.\n\nSome saw up to a 500 percent increase in new families asking for  food, and this is still going to be a big issue. We saw the SNAP cuts  over the summer. All of them told me that that is going to be a big…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696984/recognizing-food-pantries"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…travesty.\n\nThe Senate took an ugly bill, went out and whipped it with an ugly  stick, and made it even uglier with 17 million Americans going without  health insurance; a 17 percent increase in electric rates; and the  largest nutritional assistance cut in American history, leaving  Americans hungry.\n\nThe independent Committee for a Responsible Federal Budget…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693175/one-big-beautiful-bill-act"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…standing up for the most vulnerable in our community, and I  thank this gentleman from Wilcox County for sharing his rate letter,  for showing us that, in fact, a 700 percent increase is simply  unacceptable. It is outrageous. He will have to choose between  affording healthcare insurance and simply affording his rent. It is  unacceptable.\n\nWe in the…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696765/stories-from-home-the-human-cost-of-expiring-healthcare-tax-credits"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…retain their insurance will face a  staggering cost increase. A family of four earning just $90,000  annually could see their premiums escalate by as much as 69 percent.  That is an increase of over $3,000 per year, and that is crushing for a  working family.\n\nThe expiration of these subsidies will also inflict substantial harm  on entrepreneurs and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695661/healthcare-subsidies-and-rescissions"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…Ms. DeLAURO. Mr. Speaker, I remind the majority leader that for a 60- year-old couple earning $82,800 per year, their premiums will rise by  over $17,000. This is a 255 percent increase.\n\nMs. DeLAURO.  Wasserman Schultz), who is the distinguished ranking  member of the Military Construction and Veterans Affairs Subcommittee.\n\nMs. WASSERMAN SCHULTZ. Mr.…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696741/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…specific. The cost per pedal that currently  costs $0.02 would increase to $12.80 by the end of the year, according  to an article in the Akron Beacon Journal. That is a 640 percent  increase in costs.\n\nWith no relief in sight, they are being forced to raise prices, cut  staff, and halt domestic innovation, all because of a policy that was  supposed to help…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691573/earthquaker-devices-sounds-the-alarm"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…already explosive prior to October 7,  with an absolute explosion of online hate.\n\nIn 2024, the ADL tracked 9,354 anti-Semitic incidents across America.  That marked a 344 percent increase over the past 5 years, and it was  the highest number on record since these instances of hate were first  tracked in 1979.\n\nIt is so disheartening that every year a new…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691194/calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism-and-educate-the-public-on-the-contributions-of-the-jewish-american-community"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…no  consequences.\n\nICE acts first and then lies. The lie sets the frame. The truth is  forced to play defense.\n\nIn 2025, Republicans gave ICE $75 billion, a nearly 300 percent  increase in its annual budget, at the same time that they stripped  millions of Americans of their healthcare. Republicans now want to give  ICE and Border Patrol even more money.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699041/authority-without-accountability"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…consequences. In Texas-32, a  60-year-old couple with a household income of $85,000 would see their  health insurance premiums increase by $13,000 a year. That is a 181  percent increase in just 1 year. Families cannot afford that.\n\nMr. Speaker, I am all for cutting waste and finding fraud and abuse,  but taking away healthcare and making it unaffordable…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688235/democratic-proposals"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Institutes of Health, the world's premium biomedical  research agency. I admired his work so much that I asked him what I  could do to help.\n\nHe said:\n\nIf you can provide a 5-percent increase to NIH's medical       research budget, year after year, we'll light up the       scoreboard.\n\nSo I took that message and went back to Congress. With the help of  colleagues…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698206/nih-funding"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…capital  that they then put into small- and medium-sized businesses.  Calculations are that $120 billion more will be available to invest by  BDCs because we expect a 30 percent increase in total investment. That  is because this bill opens the door to mutual fund investments in BDCs.\n\nDespite the success of BDCs, in 2006, the SEC adopted a rule that…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692711/access-to-small-business-investor-capital-act"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…could be losing them.\n\nI stand here for the 28,000 people who receive coverage under the  Affordable Care Act and may see their average premium go up by $820 a  year, a 40 percent increase.\n\nMr. Speaker, the working people of my district rely on Federal  programs and services, and they also rely on the essential  organizations in Illinois-03 that provide…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689781/defending-social-services-and-programs"}, {"senator": "Suzan DelBene", "party": "Democrat", "sentence": "…vote is later than it should have  been, it is not too late to do what is right for the American people  and for my constituents like Gerry, who has already seen a 60-percent  increase in his premiums; Steve, whose plan went up by over 40 percent;  and Mitch, who is looking at a 420-percent increase for him and his  wife.\n\nRepublicans and the Trump…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698803/breaking-the-gridlock-act"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…$82,000 a year--and that is tough to get by if you  have a family on that amount of money--but the premium increase is  going to be $23,000. That is a fact. That is a 335-percent increase,  but that is like $2,000 a month.\n\nSo what that says to that family is you are on your own, no  healthcare.\n\nIn Nebraska, 112,000 folks rely on the Affordable Care monthly…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695678/cloture-motion"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…administration  inherited near-record lows in inflation and an agricultural trade  surplus of $6 billion. After 4 years of failed Democratic policies, we  were left with a 21.5 percent increase in prices and an agricultural  trade deficit of $40 billion.\n\nWhen a ship runs into an iceberg, it takes time to turn the ship  around, Mr. Speaker. You need to bail the…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698651/following-through-on-americans-priorities"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "…is the driving force behind that.\n\nMr. Speaker, it is not just the country at large that has experienced  this problem. In my own district, we have seen an over 1,000 percent  increase in the rate of fentanyl poisoning and deaths.\n\nMr. Speaker, I had the most difficult day in my over 20 years in  public office recently when I had to console one of my…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692350/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…high-quality medical care at the VA; not  privatized care that takes longer to receive.\n\nBy transferring record funding from VA medical services to community  care, which is a 67 percent increase of $14 billion, this bill pushes  veterans into private care, even though veteran polls and studies show  that when given the option, veterans prefer to receive their…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692959/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…give tools and resources to our Commander in Chief to provide  for a common defense. We bend the curve on mandatory spending, which is  75 percent of the budget, 90 percent of the increase in spending, and  it is the spending that is bankrupting the United States of America.\n\nFor the next hour, the Democrats will have rhetorical arguments that  are tired,…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689910/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…people that we are going to be fiscally  disciplined. As soon as it is uncomfortable, then we will just waive  it.\n\nWhy this is important is we will say that there is a 45 percent  increase in discretionary spending since 2019, and it is. Yet, when my  colleagues actually look at it, it is a lot of money.\n\nDid I mention that we are borrowing $6 billion a…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690748/the-math"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…percent of  every dollar we take in, in tax receipts will just cover interest.\n\nI didn't bring the chart. Maybe I should have because they have been  mixed up. If we had a 1 percent increase from what we expect baseline  interest rates to be, Mr. Speaker, would you dare in your head guess  that, in 2034-2035, 30 percent of all of our tax receipts is just…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692327/math-always-wins"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…imaginable, including a 20-year-old citizen of Guatemala who was  filming a child being raped.\n\nMr. Speaker, despite all of this, ICE law enforcement is facing a  1,300 percent increase in assaults against them, a 3,200 percent  increase in vehicle attacks, and an 8,000 percent increase in death  threats.\n\nIf Democrats want to debate the new Supreme Court…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699311/providing-for-consideration-of-hr-consolidated-appropriations-act-and-providing-for-consideration-of-hr-department-of-homeland-security-appropriations-act-and-for-other-purposes"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…In 2026, the  same exact plan costs $625 a month. The benchmark ACA silver plan  deductible was $2,425 in 2014. In 2026, the average deductible will be  $5,304, a 119 percent increase. That means that before your health  insurance even kicks in, you have to incur $5,304 in out-of-pocket  costs.\n\nSuch deductibles leave families effectively self-funding…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698804/breaking-the-gridlock-act"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…This war is organized. It is coordinated and actively aided and  abetted by local and State authorities across this country.\n\nSince January 2025, there has been a 1,347-percent increase in  assaults on ICE officers, a 3,200-percent increase in vehicular  attacks, and an 8,000-percent increase in death threats against them  and their families.\n\nThis is…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699689/immigration"}, {"senator": "Andy Harris", "party": "Republican", "sentence": "…much. The average American thinks that is pretty reasonable.\n\nIf we eliminate all the fraud, waste, and abuse--and there is plenty  of it--we are left with at least a 25 percent increase in Medicaid over  the next 10 years from the current spending level. Only in Washington  could anyone claim that is a cut.\n\nMr. Speaker, who are you going to believe,…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690807/medicaid-rumors"}, {"senator": "David Kustoff", "party": "Republican", "sentence": "…number of government  checks stolen from the mail has increased dramatically.\n\nIf I could, I will share just a few statistics:\n\nBetween 2019 and 2022, there was an 87 percent increase in theft from  mailboxes, according to the U.S. Postal Inspection Service.\n\nAccording to the Financial Crimes Enforcement Network, FinCEN,  reports of check fraud doubled…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689290/recovery-of-stolen-checks-act"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…country.\n\nThe food, fuel, and fiber capital of the world, west Texas, I can  tell you, appreciates what is in this big and beautiful bill. It is  more than just stopping a 22 percent increase in taxes for hardworking  Americans who suffered an inflation tax of about 20 percent over the  last 4 years. It is beyond sustainable.\n\nWe could go through the list of…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692295/stop-defending-lawlessness"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Mr. Speaker, you do realize when you start looking at this stuff, you  are talking about 140, 150-plus percent of debt to GDP. It goes from a  100 today to almost a 50 percent increase in the next 10 years. It is  uncomfortable. The primary driver of U.S. sovereign debt is interest  and healthcare costs.\n\nThe people who run around here and just want…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688651/a-real-math-problem"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…status, the nine sanctuary jurisdictions in this  country. In them, ICE agents are 590 times more likely to be assaulted.  Since January of last year, there has been a 1,347-percent increase in  assaults against ICE officers, a 3,200-percent increase in vehicular  attacks. And don't tell me Tim Walz doesn't have something to do with  that, and don't tell me…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700065/9999"}, {"senator": "Eli Crane", "party": "Republican", "sentence": "…the resources needed to  acquire counter-tunnel technology.\n\nSince 1990, officials have discovered more than 140 tunnels that have  breached the U.S. border, with an 80 percent increase in tunnel  activity occurring since 2008.\n\nOver the years, CBP has worked to combat these tunnels as part of  their overall strategy. In fact, the United States conducts…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688707/subterranean-border-defense-act"}]