[{"senator": "Alex Padilla", "party": "Democrat", "sentence": "…As a side note, by the way, the two ports referenced in this, the  ports of Long Beach and Los Angeles--sister ports in the San Pedro  Sports Complex--account for 40 percent of our Nation's imports, those  two ports alone. So you can imagine the intensity of the pollution in  that specific region, let alone the air quality and health impacts for  Californians.…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691583/hj-res-88"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…a digital era, into a  broadband era, and it happened pretty much in the blink of an eye for  about 80 percent of our country. We are still working on the final 10  percent of our Nation, but for the most part, it happened by the year  2000, 2001. It was done. People had it. Broadband was deployed.\n\nBut what we did was we said to ourselves: We have…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690803/addressing-the-homework-gap-through-the-e-rate-program"}, {"senator": "Raul Ruiz", "party": "Democrat", "sentence": "…energy bills and underinvestment in infrastructure. They simply cannot  afford this bill.\n\nUnder Trump, in the last 9 months, electricity prices have gone up by  11 percent across the Nation. Trump's one big, beautiful bill, better  known as the big, ugly law, will simply make matters much, much worse  by delivering higher energy costs. It will raise…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697083/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…struggling to  make ends meet. President Trump promised to cut energy bills in half in  his first year, but that has not happened. In fact, electricity prices  are up by 13 percent across the Nation and 80 million Americans are  struggling to pay their utility bills.\n\nThese increases did not just happen. They were a direct result of the  Trump administration's…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700165/dont-mess-with-my-home-appliances-act"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…disabilities in the United States. In  my home State of Kentucky, approximately 18 percent of people have a  disability. Yet, people with disabilities make up just 6 percent of our  Nation's small business owners. We have to change that.\n\nFar too often, entrepreneurs with disabilities encounter significant  barriers, both physical and intangible, when…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691755/entrepreneurs-with-disabilities-reporting-act-of-2025"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…Tax, and Capital Access, I know firsthand the challenges  businessowners face. Small businesses contribute so much to our  communities. In fact, they make up over 40 percent of our Nation's GDP,  and it is time we give back to our hardworking businessowners.\n\nThese additional investments will create more jobs, allow existing  businesses to expand and…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687918/investing-in-main-street-act-of-2025"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…Washington's Eighth District.\n\nHydropower is critical to our Nation's energy mix, supplying power to  approximately 30 million homes and businesses and accounting for 40  percent of the Nation's black start capacity.\n\nHowever, the average age of a hydropower facility in the United  States is 60 years. Therefore, hundreds of projects will be up for  relicensing…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693478/hydropower-licensing-transparency-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…security and threatening Montana jobs and economic growth.\n\nThe national security and economic importance of this region cannot  be overstated. Montana holds nearly 30 percent of our Nation's coal  reserves. In total, coal from the Powder River Basin produced in  Montana and Wyoming makes up about 85 percent of Federal coal  production and 40 percent of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694888/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…relief, supporting military families, and offering health and safety  training. They run one of the world's largest blood donation networks,  supplying more than 40 percent of our Nation's blood products.\n\nEvery 2 seconds, someone in the U.S. needs blood. Yet only a small  percentage of eligible donors give. That is why on this founder's day,  I encourage…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691605/american-red-cross-founding-day"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…a b, annually by reducing flood damage  and improving over 6,000 acres of coastal marsh and land to help  mitigate storm surges.\n\nJust as importantly, it protects 30 percent of the Nation's refining  capacity, 42 percent of specialty chemical feedstock, and 80 percent of  our military-grade fuel supply.\n\nThe bill also provides over $9 million to upgrade…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698638/providing-for-consideration-of-hr-saving-homeowners-from-overregulation-with-exceptional-rinsing-act-providing-for-consideration-of-hr-affordable-housing-over-mandating-efficiency-standards-act-and-providing-for-consideration-of-hr-commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…Chair, I will talk about Texas for just a minute. The Texas Gulf  Coast boasts 23 commercial seaports, 7 of America's largest petroleum  refineries, 3 LNG plants, and 60 percent of the Nation's strategic  petroleum reserve.\n\nAs the energy capital of the world, we understand the critical  importance of this very important, very good bill. Our hardworking…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694854/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…considered for  hardrock mineral leasing.\n\nI thank my colleague Representative Fallon for his work on the  bipartisan piece of legislation.\n\nAcquired lands comprise 10 percent of the Nation's Federal lands, or  64 million acres. The Mineral Leasing Act for Acquired Lands governs  mineral leasing for a wide range of resources on these lands. However,  the…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698229/application-of-mineral-leasing-act-for-acquired-lands-to-hardrock-minerals"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…that we have. It is imperative that we increase domestic production in  order to meet our ever-increasing demand.\n\nMy home State of Wyoming is responsible for about 40 percent of the  Nation's coal, producing 191 million tons of coal and shipping 171  million tons to 26 different States in 2024.\n\nIt is estimated that Wyoming has more than 165 billion tons…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695769/national-coal-council-reestablishment-act"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…pounds of milk  annually from the nearly 465,000 dairy cows that reside in  Pennsylvania. The 4,850 dairy farms located throughout Pennsylvania  represent nearly 20 percent of our Nation's dairy farms. These farms  provide 52,000 jobs across the Commonwealth and bring in more than $10  billion in annual revenue.\n\nPennsylvania's dairy industry is not…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692145/doge-rescissions-package"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Buffalo Field Office in Wyoming, which  was finalized in the twilight hours of the Biden-Harris administration.\n\nWyoming's Powder River Basin currently supplies 40 percent of the  Nation's coal. The RMP amendment in question effectively halted future  Federal coal leasing across a region in Wyoming larger than New Jersey  and located in the heart of…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696879/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…and the communities  they support were pushed to the brink of collapse.\n\nThe 2024 amendment to the Miles City Resource Management Plan would  have cut off access to 30 percent of the Nation's coal reserves.\n\nThe vast majority of Americans rely on coal for at least part of  their electricity every single day, and at no point did Biden's Bureau  of Land…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694891/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…Red Cross' most essential initiatives is its nationwide  blood donation program. Today, this program remains a cornerstone of  public health, supplying more than 40 percent of the Nation's blood  products, yet the need for donation remains urgent.\n\nEvery 2 seconds, someone in the United States requires a blood  transfusion. However, less than 38 percent…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688473/recognizing-red-cross-month"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…mineral estate.\n\nNotably, this land encompasses Wyoming's share of the Powder River  Basin, North America's largest coal deposit responsible for the  production of 40 percent of our Nation's coal.\n\nWyoming is the largest coal producer in the Nation. We, in other  words, are responsible for ensuring that you can turn on your lights  and heat your home.…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696878/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…innovation, creating jobs, and keeping  the American Dream alive.\n\nAccording to the Small Business Administration, firms with fewer than  500 employees account for 43.5 percent of our Nation's GDP. Since 2019,  they have been responsible for over 70 percent of net new job creation.  Just last year, we saw more than 430,000 new business applications each…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692723/helping-angels-lead-our-startups-act-of-2025"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…labor standards  and the best environmental standards in the world. We have been mining  in Minnesota for 145 years. We have mined the iron ore that makes over  80 percent of this Nation's steel.\n\nThe cleanest water in the State of Minnesota, Mr. Speaker, is in the  heart of mining country in Buhl, Minnesota. We know how to do it.\n\nLet's stop exporting…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699694/critical-mineral-dominance-act"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…the intelligence Agencies; they are keeping us safe now, like all  Federal employees, not knowing when they will get another paycheck.\n\nOur military is less than 1 percent of our Nation. That is how many  people sign on the dotted line up to and including their lives to keep  us safe. They put their lives on the line to secure liberty and  security,…", "date": "2025-10-30", "source_url": "https://justfacts.votesmart.org/public-statement/1696488/terminating-the-national-emergency-declared-to-impose-global-tariffs"}]