[{"senator": "Ed Case", "party": "Democrat", "sentence": "…days to work with us all  to do the right thing. Unless the right thing is done, we should not  fund the Department of Homeland Security\n\nThis measure also funds 70 percent of our Federal Government, rather  than shut it down again. I will focus on just a few areas where this is  critical. Let's start with defense, half of our total budget.\n\nIt is a…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699571/consolidated-appropriations-act-2026"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…stay is $70,000 a day. That is more than a single person who  qualifies for the enhanced premium tax credits under the Affordable  Care Act at the maximum rate of 400 percent of the Federal poverty line  makes in a year. That person makes $62,600. The average NICU stay is  $70,000.\n\nI was lucky not only because I was able to take my daughter home 6  weeks…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697213/medical-bills-are-too-high"}, {"senator": "André Carson", "party": "Democrat", "sentence": "…tragedies. The Gun Safety  Incentive Act takes meaningful, practical steps to promote responsible  firearm storage and protect our children.\n\nFirst, the bill provides a 10 percent federal tax credit through 2030  for individuals who purchase certified firearm safes and secure storage  devices. This incentive directly supports gun owners who take steps to…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693800/introduction-of-the-gun-safety-incentive-act"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…percent of our budget. That is a quote from Marco Rubio before he  worked for Donald Trump. This is not how we solve our budget problem. A  fraction of a fraction of a percent of the Federal budget goes to  lifesaving global food aid.\n\nThe Trump administration has said they will restore it. They need to  follow their own words and do so immediately before…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692117/lifesaving-foreign-aid"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…uncertainty  about their futures. These patriots, who once defended our freedoms,  now work to uphold the very institutions they once served in uniform.  Nearly 30 percent of the Federal workforce is made up of veterans.  Cutting staff just doesn't jeopardize care. It threatens the jobs and  livelihoods of those who have already sacrificed so much for…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692946/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…best-fit school placements out of  district. In turn, her school receives $1.7 million from IDEA funding  and $500,000 in Medicaid funds to offset those costs--around 10  percent. If this Federal funding is jeopardized, the school, Natalie,  and her peers, their educators, and their families will have no idea  how to continue providing the level of education…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697522/50th-anniversary-of-individuals-with-disabilities-education-act"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…that Congress made earlier  this year to maintain our global leadership and protect U.S. national  security interests.\n\nWhile foreign assistance represents less than 1 percent of the  Federal Government, it provides critical benefits to our Nation. These  strategic investments help save American lives, reinforce our global  leadership, and support economic…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693590/rescissions-act-of-2025"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…every state,  regardless of which party controls the White House. These airwaves  belong to every American--and they're a bargain: public media receives  less than 0.01 percent of federal spending, and yet it provides  essential services to every citizen in every part of this country.  That's roughly $1.60 per taxpayer. Public media is the country's only…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692634/rescissions-act-of-2025"}, {"senator": "Raja Krishnamoorthi", "party": "Democrat", "sentence": "…I rise today in strong support of  H.R. 2550.\n\nThis bipartisan bill reverses an illegal executive order that  stripped collective bargaining rights from roughly 67 percent of the  Federal workforce, so more than two-thirds of the Federal workforce.\n\nRemoving their limited bargaining rights does not improve efficiency.  It threatens the integrity of…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697979/protect-americas-workforce-act"}, {"senator": "Derek Tran", "party": "Democrat", "sentence": "…and hold the executive  branch accountable for any future terminations that may occur.\n\nThis isn't about politics. This is about basic decency.\n\nVeterans make up 30 percent of the Federal workplace, and when they  are unjustly removed, it impacts all of us. From delays in healthcare  and disability claims to staffing shortages at the VA, the consequences…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688234/democratic-proposals"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…coverage and lifesaving care for  people living with HIV--       providing coverage for more than 40 percent of the people       living with HIV and contributing 45 percent of all Federal       funding for domestic HIV care and treatment.\n\nThe next letter starts:\n\nTo be clear, the cuts outlined above are being proposed for       one simple reason: to…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…a smart business  decision. That is why the Federal Government has long taken advantage  of this absolutely remarkable talent pool.\n\nVeterans now make up roughly 30 percent of our Federal workforce--or  more than 640,000 veterans in the civil service--and I rise today to  express my absolute outrage over the indiscriminate firings of nearly  6,000 of…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688440/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Jahana Hayes", "party": "Democrat", "sentence": "…to dismantle the Department of Education. Only Congress has  that authority. An agency created by Congress can only be dismantled by  Congress. However, by firing 50 percent of Federal workers at the  Department of Education and terminating funding for ongoing Federal  education research, the Trump administration is making it difficult for  the Department…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689644/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…billion in State, local, and  Federal taxes in 2022. Mr. Speaker, $96.7 billion is what they paid.\n\nOn top of that, undocumented immigrants pay an average rate of 5.27  percent in Federal taxes. That is a rate higher than most of the United  States' wealthiest billionaires or megacorporations. Yet, while  Republicans give another billion-dollar company…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689781/defending-social-services-and-programs"}, {"senator": "Derek Tran", "party": "Democrat", "sentence": "…that may occur.\n\nThis isn't about politics. This is about basic decency. This is about  treating our veterans with the dignity they deserve. Veterans make up  over 30 percent of the Federal workforce, and when they are unjustly  removed, it impacts all of us. From delays in healthcare services and  disability claims to staffing shortages at the VA, the…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688466/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing-and-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…Affordable Care Act or ObamaCare  altogether. That is simply not the case.\n\nThe premium tax credits were developed during COVID to subsidize  Americans making more than 400 percent of the Federal poverty level,  including those making up to $600,000. People making up to $600,000 are  getting subsidized by the American taxpayers. In northeast Florida, we  call…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698784/breaking-the-gridlock-act"}, {"senator": "Michael Cloud", "party": "Republican", "sentence": "…unions are not neutral public servants. In the  2023 to 2024 election cycle, the four largest Federal employee unions  spent nearly $1 billion on politics, with 98.8 percent of their Federal  contributions going to the Democratic Party.\n\nUnions like the American Federation of Government Employees, the  National Treasury Employees Union, AFSCME, SEIU, and…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697985/protect-americas-workforce-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "…issue.\n\nIt was deeply disappointing the Democrat leader threatened to shut  down the government if Republicans dared to pass legislation to trim  just one-tenth of 1 percent of the Federal budget, but I am hopeful  that is not the position of the Democratic Party.\n\nTime will tell.\n\nThe Senate also has important work to do to confirm the President's  nominees.…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693870/trump-administration"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…of the GAO study will explain, they were getting  signed up.\n\nThe last final piece that I will highlight here are the income caps.  People could still be making 400 percent above the Federal poverty  level the insurance companies that they were getting signed up for were  still receiving these subsidies.\n\nOriginally, when we talk about ObamaCare, it was…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698435/republicans-have-delivered-in-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…percent if you  blow up everything, you maximize every tax policy you have ever  promoted. You are borrowing 7\\1/4\\ this year.\n\nRemember, today, half the taxpayers--97 percent of the Federal income  tax is paid by the top half, meaning the bottom half of those who are  out there working their hearts out but don't make a great income pay  almost no Federal…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688651/a-real-math-problem"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…it  facially, but even if you were going to do it, would you then say, as  it does, that that population, the healthier, able-bodied population,  should get a 90 percent match from the Federal Government? Because that  is what is happening. They get a 90 percent rate for that expanded  population, then layer on top of that, and this is what you are now…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690587/economic-anxiety"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…premium tax credit amounts for eligible       individuals and families, resulting in access to plans with       no premium contributions for those earning 100 to 150 percent       of the federal poverty level. It also expanded eligibility       for premium tax credits to include certain individuals and       families with incomes at or above 400 percent…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698381/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…in  North Dakota.\n\nAstonishingly, this RMP blocked coal leasing on 99 percent of coal  deposits in North Dakota and prohibited oil and gas leasing on an  additional 44 percent of Federal land.\n\nNorth Dakota is a top 10 coal-producing State and the number 3 oil  and gas producer in the Nation. According to State estimates, North  Dakota produces 400 million…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694908/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Rick Scott", "party": "Republican", "sentence": "…bring accountability for the American  people.\n\nOur Nation is nearly $39 trillion in debt, running $2 trillion  deficits, and spending billions of dollars--up to 10 percent of our  Federal spending--on fraud and abuse.\n\nThis waste is fueled, in part, by billions upon billions of wasteful  earmark spending by Democrats who treat taxpayers' cash like candy.…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699432/consolidated-appropriations-act-2026"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…original ObamaCare subsidies--which, by the way, do not  expire. These are permanent. They are in law. The original subsidies  continue for people who are at 100 to 400 percent of the Federal  poverty level.\n\nOur colleagues across the aisle claim that the Biden COVID credits  are needed to keep the cost of health insurance premiums down. In  reality, ObamaCare…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696539/government-funding"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…Government spends.\n\nThe Federal Government spends about, I think, roughly $6.7 trillion a  year, but it is crazy to acknowledge that we only typically look at  about 28 percent of what the Federal Government spends--so-called  discretionary spending. So we have to find a way to reduce our  spending, not only on the discretionary side but on the mandatory side,…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689668/government-funding"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…overstated. Montana holds nearly 30 percent of our Nation's coal  reserves. In total, coal from the Powder River Basin produced in  Montana and Wyoming makes up about 85 percent of Federal coal  production and 40 percent of overall coal production in the entire  United States.\n\nCoal is reliable and affordable, and we know we are going to need  this critical…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694888/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Steve Womack", "party": "Republican", "sentence": "…consolidated  appropriations package before the House today.\n\nPassage of this legislation means that Congress will have provided  full-year funding to more than 90 percent of the Federal Government.  This marks an important departure from the unfortunate norm in which  Congress too often fails to meet its Article I responsibility.\n\nThere are many highlights…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699577/consolidated-appropriations-act-2026"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Medicaid expansion was a big reason why we opposed it. Why can  we now not demand reforms to the broken pieces of ObamaCare that  expanded Medicaid such that we are giving 90 percent Federal match to  the able-bodied, the people who are not the most vulnerable, compared  to the vulnerable population who only get 50 to 60 to 70 percent? Why  would we do that?…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690594/fiscal-responsibility"}]