[{"senator": "Cory Booker", "party": "Democrat", "sentence": "…things. For example, currently these tax  credits, they are set to expire at the end of this year. If these tax  credits were taken away, families will pay up to 90 percent more for  their healthcare, and 5 million Americans could lose their healthcare  altogether. All, again, if this goes through in 2025, billionaires and  CEOs will get a huge tax break while…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…are out of control.  Their water bills are out of control. Don't get me started about their  auto and home insurance. It is all out of control. Grocery costs are up  28 percent, healthcare costs are up and out of control, and it is even  worse for those family members who are sick.\n\nOur families can't afford the basics. Everyone in this Chamber can  agree…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697023/economic-dignity-for-all"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…the state's economy.\n\nHaitian TPS holders are disproportionately represented in       essential sectors. In Massachusetts, immigrants comprise       nearly 30 percent of the healthcare workforce, including home       health aides, nursing assistants, and support staff in       hospitals and long-term care facilities. Haitian and other       TPS…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699720/witness-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…a month in 2025. Next year, they are  going to have to pay $3,035. That is a $22,000 increase. A family of  four making about $64,000 a year is going to pay 920 percent more for  healthcare premiums. Obviously, that is going to mean they have to  decide whether they are going to go without or somehow, some way, try  to find a way to pay that, which…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696453/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…nutritional support, how we deliver healthcare? Maybe the  concept of helping our brothers and sisters live healthier when 31  percent of Medicare spending is diabetes--33 percent of all healthcare  overall is just diabetes.\n\nIs that Republican or Democrat? It is just trying to get your policy  alignment to the fact we are buried in debt and getting older as…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689381/us-borrows-billion-a-day"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…percent we believe is uninsured, veterans are about 3 percent,  Medicare is 18 percent, and Medicaid is 22 percent. Now over the next  couple years that flips. Only 7 percent of the healthcare population is  actually in the ACA.\n\nThat is the entire population that is receiving the enhanced  subsidies, so the subsidies on top of the subsidies, is a fraction…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697051/facing-fiscal-reality"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…isn't education. It  turns out it is health.\n\nWhen you think about it, the cascade of costs of someone with severe  diabetes, when we already know diabetes is 33 percent of U.S.  healthcare. What if things like this actually could help our brothers  and sisters? Is this Republican or Democrat? It is just good policy. It  has just always been uncomfortable…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694131/dismantling-californias-citizens-redistricting-commission"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…the basic subsidies, the growth of the subsidies  since the pandemic, is another $75 billion. On top of the base  subsidies, they are $80 billion. This is only 7 percent of the  healthcare market.\n\nLet's take a look at that. This is so hard for people to understand.  I was listening to one of my Democrat colleagues speak the other day.  It was a complete…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697873/turning-healthcare-into-financial-engineering"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…soul to the insurance companies? Remember,  the ACA model is an insurance company model. You promised them rates of  return, you promised them a market, so this is 7 percent of the  healthcare market, and 94 percent of that 7 percent gets a subsidy.\n\nLet's actually do math because you have been listening to--oh, yeah,  there has been actually no math today…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698698/congress-is-a-math-free-zone"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…potential of generic manufacturers  producing it from $60 to $120 a month.\n\nThis is a crazy thought. We know Milken researchers a couple of years  ago said obesity is 40 percent of U.S. healthcare. Diabetes is 33  percent of U.S. healthcare. It is 31 percent of Medicare. How many  lives are lost right now because of multiple chronic conditions?\n\nWhat would…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695567/we-are-borrowing-a-second"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…the  deals the President made is the tablet version is going to go to $149  sometime next year. We know from the Milken study a few years ago that  obesity is 47 percent of U.S. healthcare spending. Wouldn't it help if  we could help our brothers and sisters get healthier? Yes, obesity is  complex. Diabetes is complex, autoimmune. There are all sorts…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698412/fun-with-math"}]