[{"senator": "Emily Randall", "party": "Democrat", "sentence": "…County, ages 60 and 55, with a household income of $85,000,  for them the least expensive plan available would jump from $127 per  month to $1,485 per month. That is a 1,062 percent increase.\n\nThat same couple in Kitsap County, where I grew up, would go from  paying $56 to almost $1,500 a month under the least expensive plan.  That is an annual insurance bill…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697420/republican-healthcare-crisis"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…standing up for the most vulnerable in our community, and I  thank this gentleman from Wilcox County for sharing his rate letter,  for showing us that, in fact, a 700 percent increase is simply  unacceptable. It is outrageous. He will have to choose between  affording healthcare insurance and simply affording his rent. It is  unacceptable.\n\nWe in the…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696765/stories-from-home-the-human-cost-of-expiring-healthcare-tax-credits"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…next decade to modernize our  nuclear arsenal.\n\nThe cost of the Sentinel ICBM missile program alone has exploded,  pushing the cost per missile to $161 million, an 81 percent increase  from its original projections. The cost of nuclear acquisition programs  will be 11.8 percent of the Department of Defense's planned acquisition  costs over the next…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699034/expiration-of-new-start"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…housing, groceries, childcare,  utilities, and more.\n\nDavid from Tillamook, Oregon, said premiums for him and his wife  increased from $415 a month to $2,384 a month, a 474 percent increase.\n\nFor Stacy in St. Helens and her husband, their premiums went from  $539 a month to $2,396, a 344 percent increase.\n\nIt is unconscionable, it is unacceptable, and it…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698591/providing-for-consideration-of-hr-breaking-the-gridlock-act"}, {"senator": "Henry Cuellar", "party": "Democrat", "sentence": "…other departments or other agencies under DHS, especially when we talk  about FEMA. FEMA gets $5.7 billion, including $3.8 billion for Federal  assistance, which is a 20-percent increase above fiscal year 2025.  Again, that money goes back to help firefighters and disasters.\n\nAgain, it also provides money to CISA. As you know, there were cuts,  but we…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699346/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…the FBI has released warnings on the growing risk this poses to  our kids, and the National Center for Missing & Exploited Children  (NCMEC) has reported a nearly 200 percent increase in attempts. As our  social landscape continues to evolve, placing our most vulnerable  population online more often, we must be prepared with the laws to  deter and punish…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699202/supporting-hr-the-combating-online-predators-act"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…travesty.\n\nThe Senate took an ugly bill, went out and whipped it with an ugly  stick, and made it even uglier with 17 million Americans going without  health insurance; a 17 percent increase in electric rates; and the  largest nutritional assistance cut in American history, leaving  Americans hungry.\n\nThe independent Committee for a Responsible Federal Budget…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693175/one-big-beautiful-bill-act"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…consequences. In Texas-32, a  60-year-old couple with a household income of $85,000 would see their  health insurance premiums increase by $13,000 a year. That is a 181  percent increase in just 1 year. Families cannot afford that.\n\nMr. Speaker, I am all for cutting waste and finding fraud and abuse,  but taking away healthcare and making it unaffordable…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688235/democratic-proposals"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…California receive Pell grants. A study by the Center for Economic and  Policy Research found that the average income in a community rises by  2\\1/2\\ percent for every 1 percent increase in Pell grants.\n\nWe should focus on making education more accessible and doubling the  maximum Pell grant, not cutting off support for students who need it  the most for…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693064/cuts-to-pell-grants"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…already explosive prior to October 7,  with an absolute explosion of online hate.\n\nIn 2024, the ADL tracked 9,354 anti-Semitic incidents across America.  That marked a 344 percent increase over the past 5 years, and it was  the highest number on record since these instances of hate were first  tracked in 1979.\n\nIt is so disheartening that every year a new…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691194/calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism-and-educate-the-public-on-the-contributions-of-the-jewish-american-community"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…specific. The cost per pedal that currently  costs $0.02 would increase to $12.80 by the end of the year, according  to an article in the Akron Beacon Journal. That is a 640 percent  increase in costs.\n\nWith no relief in sight, they are being forced to raise prices, cut  staff, and halt domestic innovation, all because of a policy that was  supposed to help…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691573/earthquaker-devices-sounds-the-alarm"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…no  consequences.\n\nICE acts first and then lies. The lie sets the frame. The truth is  forced to play defense.\n\nIn 2025, Republicans gave ICE $75 billion, a nearly 300 percent  increase in its annual budget, at the same time that they stripped  millions of Americans of their healthcare. Republicans now want to give  ICE and Border Patrol even more money.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699041/authority-without-accountability"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…subject to the arbitrary action of President Trump.\n\nFarmers are really hit hard. Most of our farmers in Vermont import  their fertilizer from Canada. There is about a 25-percent increase that  they are going to be paying. And these are farmers, as the Presiding  Officer knows, that operate on the thinnest of margins in the most  uncertain of activities,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690522/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Health. The National Institutes of Health is  the premier medical research laboratory in the world.\n\nI did my best to make sure with my friends that we fought for a 5- percent increase in growth in medical research each and every year. We  did it too. A 60-percent increase to NIH's budget over the last  decade--60 percent, money that is used to research…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690656/national-institutes-of-health"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…capital  that they then put into small- and medium-sized businesses.  Calculations are that $120 billion more will be available to invest by  BDCs because we expect a 30 percent increase in total investment. That  is because this bill opens the door to mutual fund investments in BDCs.\n\nDespite the success of BDCs, in 2006, the SEC adopted a rule that…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692711/access-to-small-business-investor-capital-act"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…On border security, the Biden-Harris administration's open-border  policies resulted in over 10 million encounters at the southern border  from 2021 to this year, a 500 percent increase in illegal crossings,  and over $115 billion in costs to State and local governments. This  wide-open border allowed deadly fentanyl to flood into our communities,  killing…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689862/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Eli Crane", "party": "Republican", "sentence": "…the resources needed to  acquire counter-tunnel technology.\n\nSince 1990, officials have discovered more than 140 tunnels that have  breached the U.S. border, with an 80 percent increase in tunnel  activity occurring since 2008.\n\nOver the years, CBP has worked to combat these tunnels as part of  their overall strategy. In fact, the United States conducts…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688707/subterranean-border-defense-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…astounding when you consider what has actually happened  with homelessness in California during that time. During the  Governorship of Gavin Newsom, we have seen a 24 percent increase in  homelessness. The population is now over 187,000 people, and roughly  half of all unsheltered homeless in the United States are in  California.\n\nWe have continued…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688626/finding-common-ground"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…Since 2019,  they have been responsible for over 70 percent of net new job creation.  Just last year, we saw more than 430,000 new business applications each  month, a 50 percent increase compared to 2019.\n\nThat kind of momentum deserves our full support. We should be doing  everything we can to encourage investment, foster innovation, and make  it easier,…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692723/helping-angels-lead-our-startups-act-of-2025"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…provide tax  relief for working families.\n\nOn border security, Biden's open-border policies resulted in over 8.5  million encounters at the southern border since 2021, a 500 percent  increase in illegal crossings, and over $115 billion in costs to State  and local governments. Most tragically, Biden's border crisis allowed  unprecedented amounts of deadly…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688089/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions-and-providing-for-consideration-of-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Nathaniel Moran", "party": "Republican", "sentence": "…yet to deliver on the promises made to Americans over a decade ago.  Since the ACA was enacted, premiums have increased by roughly 80  percent. Guess what. Ninety percent of that increase has been paid for  by the taxpayers.\n\nIt is important to note that these premium tax credits are sent  directly to insurance companies, not the taxpayers, and it is…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698806/breaking-the-gridlock-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…insult added to  injury, to add a huge tax increase on top of all of the inflation that  Americans experienced during the last 4 years--roughly, on average,  about a 21-percent increase in the cost of living.\n\nBut not just families would be affected. Small businesses would see  their Federal tax rates increase by almost 50 percent. One recent  survey…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689668/government-funding"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Let's actually take another look at one of these. Major healthcare  programs were up $150 billion over the previous year, and the major  healthcare programs came in at a 9-percent increase from the previous  years.\n\nDoes anyone see a math problem? You have an economy right now that is  growing at 5 percent. It is amazing. Yet, our spending, when you tack…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699257/debt-deficits-and-demographics"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…percent of  every dollar we take in, in tax receipts will just cover interest.\n\nI didn't bring the chart. Maybe I should have because they have been  mixed up. If we had a 1 percent increase from what we expect baseline  interest rates to be, Mr. Speaker, would you dare in your head guess  that, in 2034-2035, 30 percent of all of our tax receipts is just…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692327/math-always-wins"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "…is the driving force behind that.\n\nMr. Speaker, it is not just the country at large that has experienced  this problem. In my own district, we have seen an over 1,000 percent  increase in the rate of fentanyl poisoning and deaths.\n\nMr. Speaker, I had the most difficult day in my over 20 years in  public office recently when I had to console one of my…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692350/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…people that we are going to be fiscally  disciplined. As soon as it is uncomfortable, then we will just waive  it.\n\nWhy this is important is we will say that there is a 45 percent  increase in discretionary spending since 2019, and it is. Yet, when my  colleagues actually look at it, it is a lot of money.\n\nDid I mention that we are borrowing $6 billion a…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690748/the-math"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…imaginable, including a 20-year-old citizen of Guatemala who was  filming a child being raped.\n\nMr. Speaker, despite all of this, ICE law enforcement is facing a  1,300 percent increase in assaults against them, a 3,200 percent  increase in vehicle attacks, and an 8,000 percent increase in death  threats.\n\nIf Democrats want to debate the new Supreme Court…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699311/providing-for-consideration-of-hr-consolidated-appropriations-act-and-providing-for-consideration-of-hr-department-of-homeland-security-appropriations-act-and-for-other-purposes"}, {"senator": "Andy Harris", "party": "Republican", "sentence": "…much. The average American thinks that is pretty reasonable.\n\nIf we eliminate all the fraud, waste, and abuse--and there is plenty  of it--we are left with at least a 25 percent increase in Medicaid over  the next 10 years from the current spending level. Only in Washington  could anyone claim that is a cut.\n\nMr. Speaker, who are you going to believe,…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690807/medicaid-rumors"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…living  as January 2021.\n\nWe have increased spending, our budget, our Federal budget, from  roughly $3.6 trillion or so in 2015 to almost $7 trillion now. That is  an 80 percent increase.\n\nDoes anybody alive think that we can sustain this? Do any of my  colleagues, Republican or Democrat, think that we can sustain this?  Does anybody alive right now in…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690594/fiscal-responsibility"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…In 2026, the  same exact plan costs $625 a month. The benchmark ACA silver plan  deductible was $2,425 in 2014. In 2026, the average deductible will be  $5,304, a 119 percent increase. That means that before your health  insurance even kicks in, you have to incur $5,304 in out-of-pocket  costs.\n\nSuch deductibles leave families effectively self-funding…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698804/breaking-the-gridlock-act"}]