[{"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…institution. So, we have to continue  to keep fighting.\n\nIf we look at the cycles, in the 2010 cycle, as I mentioned before,  the top 100 individual donors spent 2.1 percent of all the spending in  2010. By 2024, it was 15 percent. If you extrapolate that, by 2038,  about half of our spending could end up being from the top 100  individual donors. I mean,…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699239/restoring-election-integrity"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…was raising money from  individuals, folks who were spending $25, $100, maybe a couple hundred  dollars on campaign contributions. Individuals today make up just 16  percent of total spending in elections--16 percent. Eighty-four percent  of all the spending in elections today is not done by citizens; 84  percent of spending is by corporations and organizations.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699117/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…barriers where you have armies of lobbyists walking up  and down these hallways, and the inefficiency, that waste and fraud, is  their profit model.\n\nMr. Speaker, 80 percent of the spending growth--we are not supposed  to tell people this, but it is the math. You can't do policy unless you  are willing to tell the truth about the math. Eighty percent…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691518/truth-telling-with-math-and-facts"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…let's say we are  blessed and we get $2 trillion in offsets, so that creates a couple  trillion dollars in additional borrowing, we are talking a fraction, a  couple percent of the spending, Madam Chair.\n\nI would argue this is the moment for us where it is not about cuts.  If any of us has ever just even bothered to look at the MedPAC reports,  and this…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688035/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…show the chart all the time saying:  Here is the pie chart of all of our spending. Today, about 75 percent  is on autopilot. Mr. Speaker, you and I get to vote on 25 percent of  the spending. About half of that is defense; about half of that is  nondiscretionary. Every dime that a Member of Congress votes on today  is borrowed.\n\nThink about that. Other…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690748/the-math"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…also doubling our spending on the Strategic  Petroleum Reserve.\n\nSo to sum up, the Energy and Water bill vis-a-vis the current budget  cuts spending by 2.8 percent. We increased defense spending by 2.7  percent. We paid for that increase and accommodated the decrease in  overall spending by cutting nondefense, mostly green energy, 3.8  percent. We have…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699012/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Come on, people.\n\nLook, I almost always start with this chart. You see what is in blue?  It is defense and nondefense discretionary. It is--we expect it to be  26, 25 percent of spending. Last year, for every dollar this country  took in in tax collections, we spent $1.39, but everything we vote on  is 26 percent of the budget. Does anyone see a math…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689381/us-borrows-billion-a-day"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…attention to how we take care of our customers, the  American citizens? Do we pay attention to the reality?\n\nSocial Security, Medicare, and net interest account for 80 percent of  the spending growth over the next nine budget years. If we do the 30  years, it is everything. If we do the 30 years, military and nondefense  discretionary are scheduled to grow…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691811/actual-solutions"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…screaming and gnashing of  teeth and protests that are all ginned up, you cut $800 billion from  this, and a little bit from a couple other things, it was less than 2  percent of that spending.\n\nAre you telling me that the left doesn't believe that if you are  spending $86 trillion as your baseline spending, and understand--I am  going to show you some of…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694131/dismantling-californias-citizens-redistricting-commission"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…documents. Let's understand the size of these committees are  vastly different, but the one people were focusing on, E&C, the Energy  and Commerce Committee, still has 96 percent of its spending authority  within its jurisdiction. That is going to continue.\n\nThis little wedge here is what they are being asked to work on. I  will promise you if I am given the…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688088/republican-budget"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…those 65 and up.\n\nNow, I need you to work through something with me. I have already  presented the Moody's Analytics report that is saying, in 8 years from  now, 30 percent of our spending, 30 percent of tax collections, will go  just to interest. You are now seeing, in 3 years, the majority of our  spending will actually go to benefits here. We have…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698698/congress-is-a-math-free-zone"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…in costs. How many times have  you heard the saying in healthcare that 5 percent of the population is  over 50 percent of the spend? It turns out that much of that 50 percent  of spending is on people who have multichronic conditions. A  substantial portion of that is because of obesity.\n\nLet's not be afraid to talk about it. Let's do the moral thing…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698412/fun-with-math"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "Mr. PAUL. Mr. President, I rise today to introduce a budget that  balances over 5 years. My budget, the Six Penny Plan, the Six Penny  Plan budget, cuts 6 percent of all spending to rebalance in just 5  years.\n\nI am able to introduce this budget because neither Republicans nor  Democrats introduced a budget this year. So we are running a $7…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695544/setting-forth-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2026-and-setting-forth-the-appropriate-budgetary-levels"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…the math.\n\nLet's have at it. For anyone out there paying any attention--and this  number, actually probably right now is a little bit worse. We now think  about 75 percent of Federal spending is on autopilot.\n\nMr. Speaker, when you become a Member of Congress, everything you get  to vote on is borrowed. When you vote on nondiscretionary, when you  vote…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690586/economic-anxiety"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…look at the charts, do you  see what is in blue? That is everything a Member of Congress gets to  vote on, defense and nondefense. Your only problem is that it is 26  percent of the spending.\n\nIf you ask a Member of Congress right now to balance the budget, we  can do it. We can do it. You have to get rid of all defense, all  nondefense discretionary.…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689025/tell-the-truth-about-math"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…I get to vote on. As Members of  Congress, we only vote on the discretionary portion, and this was a  2025 chart. Today, it is  probably only 25 percent, not 26 percent, of the total spending. Every  dime of that is borrowed.\n\nMr. Speaker, the math for last year, for every dollar we took in, in  tax receipts, we spent $1.43.\n\nWe were just in the back.…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699257/debt-deficits-and-demographics"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…provide services? What  does it cost to help our brothers and sisters be healthy? We are  actually seeing that we had some projections from CBO and others of  about a 5 percent growth in spending on healthcare. I am going to show  you some of this.\n\nWe are seeing some numbers coming in that are closer to 8 percent or  9 percent growth in that spending, so…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699674/united-states-fiscal-situation"}]