[{"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Home Rule Act. This bill would give the  District of Columbia the authority to appoint the members of the D.C.  Board of Zoning Adjustment (Board), except when the Board is performing  functions regarding an application by a foreign mission with respect to  a chancery. The Board issues special exceptions, or variances, to the  regulations issued by the…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693426/introduction-of-the-district-of-columbia-board-of-zoning-adjustment-home-rule-act"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "…incredibly important event, which is hosted by the National  Fraternal Order of Police, will honor Federal, State, and local law  enforcement officers who lost their lives performing their duties in  the year 2024.\n\nIn addition to the family and friends of the deceased, event  organizers expect up to 25,000 police officers from around the country  to…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689660/authorizing-the-use-of-the-capitol-grounds-for-the-national-peace-officers-memorial-service-and-the-national-honor-guard-and-pipe-band-exhibition"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…production will proudly be made right here in  the United States and, most importantly, Ohio's 13th Congressional  District.\n\nI know that the Tech Hub in my community is performing groundbreaking  research and development that can revolutionize industries across the  country and across the world. That is why I am introducing this  amendment that urges…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695128/my-amendments-to-hr-3838"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…And that is the role they have performed in our  government: saving millions--perhaps billions--of dollars in taxpayer  money, ending corruption at the highest levels, and performing a vital  experience for our democracy.\n\nOne of the very best of our inspectors general has been Mike Missal.  He was responsible for recovering more than $37 billion during…", "date": "2025-07-31", "source_url": "https://justfacts.votesmart.org/public-statement/1694542/9999"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…policies are is simply an affirmation  that immigration enforcement is the job of the Federal Government and  that State and local authorities cannot be co-opted or forced into  performing inherently Federal responsibilities. It means that while  Federal Agencies carry out immigration enforcement, State and local law  enforcement will choose to focus their…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700066/9999"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…Foundation, the fraternity has  invested substantially in initiatives that serve the greater good-- mentoring youth, increasing access to STEM education, supporting the  performing arts in Title I schools, and providing college scholarships  for deserving minority students. These actions reflect a commitment not  only to excellence, but to ensuring…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692968/recognizing-epsilon-sigmas-10th-anniversary"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…who then, sadly, experienced  cardiac arrest.\n\nFirefighter and EMT Tim Ellithorpe, Fire Chief Devon Kelble, and  Lyons Fire Chief Zachary Miramontes launched into action, performing  lifesaving efforts. They succeeded.\n\nThis illustrates how our brave first responders will always answer  the call.\n\nIn honor of the bravery of all first responders lost…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690783/national-fallen-firefighters-memorial-the-lyons-fire"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…Program or who have       left Federal service under a Voluntary Early Retirement       Authority; and the number of veterans employed by contractors       or subcontractors performing work for the Federal government       who have seen their working hours, wages, or employment       reduced or terminated.\n\nMs. WASSERMAN SCHULTZ. Mr. Chairman, I yield to…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692948/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Hospital, and later as a professor  and director at The George Washington University, Dr. Siegel has  consistently worked to improve care for the most vulnerable among us,  performing pioneering research into health care quality, health care  disparities, and the safety net. He has had a significant and positive  impact on our health care system, and his…", "date": "2025-10-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696206/recognizing-dr-bruce-siegel"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…appropriated funds and attempted to dismantle  congressionally mandated agencies by withholding funds and crippling  agencies. He has prevented the Federal Government from performing  critical duties here and abroad. He has threatened the well-being of  the United States citizens through the gross misconduct of his office  resulting in dire and life-threatening…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691079/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…Strikers are a drumline that seamlessly integrates  the arts and education. They perform year-round and offer a wide range  of programs in percussion, color guard, and other performing arts  disciplines. Their mission is twofold: to provide high-quality  entertainment to the community and to build confidence in students. By  expanding upon lessons taught…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690915/recognizing-the-crystal-lake-strikers-for-receiving-the-carl-e-wehde-award"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…journey to become an R1       institution. I am not sure we can recover from this anytime       soon.\n\nAnother person on these cuts to the NIH:\n\nI am a postdoctoral researcher performing basic science       research on bacterial communication. In short, I am seeking       to understand bacterial chemical communication to find new       pathways for therapeutic…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…Admission is based on  entrance exams, standardized tests, and elementary school grades. The  school has a strong focus on developing well-rounded individuals with a  variety of performing  and fine arts programs alongside academic preparation.\n\nThe school is comprehensive and excels in athletics, as well. For  example, during the 2023-2024 school year, they…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692107/in-honor-of-charles-rangel"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…the COVID-19  pandemic. Achievement gaps, which existed before the pandemic, have  widened. According to that assessment, math and reading gaps between  higher- and lower-performing students continue to rise, as Black  students continue to be more than 10 points behind their white peers in  all subjects.\n\nIn 2021, Democrats passed the largest one-time…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689643/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…critical condition.  These children arrived alone, unidentified, and ripped apart by gunshot  wounds.\n\nThe hospital staff leapt into action immediately, removing shrapnel,  performing emergency surgery, and providing stabilizing care and  comfort to these little children.\n\nWhile we are immensely grateful for their expertise, we should not  normalize that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694875/recognizing-the-brave-hospital-workers-to-the-annunciation-school-shooting"}, {"senator": "Barry Moore", "party": "Republican", "sentence": "…the medical establishment.  The majority of these brave transitioners are girls and women.\n\nThe first rule of medicine is do no harm. Yet, those in the medical  community performing these grotesque procedures on children are  committing some serious harm. In fact, these procedures are so  grotesque that during the markup of this legislation, our colleagues…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698346/protect-childrens-innocence-act"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…Choir here to Washington, D.C.\n\nThe choir, composed of talented individuals living with Down syndrome  and who are based in Colorado's Fifth Congressional District, will be  performing the national anthem to launch the March for Life rally this  Friday.\n\nClub 21 came and visited me just a couple of months ago here in  Washington, D.C., and it is really…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699252/welcoming-jared-anderson-and-friends-of-club-21-choir-to-washington-dc"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…and encouragement needed to pursue their love of music. Beyond  the classroom, Nancy is an amazing musician herself, serving as the  pianist for her church and previously performing at county festivals.  In retirement, she is looking forward to spending time with her first  grandchild and continuing to stay involved in music at schools across  southern…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699834/recognizing-carl-and-nancy-schneider"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…achievement in the classroom.\n\nThe United States Collegiate Athletic Association named Christendom  the winner of the 2025 President's Cup, recognizing the Nation's top  academic-performing athletic department. I commend Director of  Athletics Patrick Quest and Assistant Athletic Director Joe Dotson for  their outstanding leadership.\n\nChristendom's varsity teams…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693527/congratulating-central-high-school-womens-softball-team"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…character. Weekly, the organization comes  together to provide aid and comfort to the less fortunate, to honor  community leaders, to promote integrity, and to work towards performing  meaningful service with the purpose of building a better world. The  Rotary Club of Lincoln is an award-winning service club that has  obtained a wide diversity of accomplishments…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696716/recognizing-the-100th-anniversary-of-the-rotary-club-of-lincoln"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…because of activist radical judges that stop the executive  branch. Every day Americans have to read about that garbage, a radical  judge stopping the elected President from performing his role as  Commander in Chief and President of the United States.\n\nThe executive branch needs Members of Congress to perform like my  friend and colleague, Ms. Marjorie…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693077/special-interest-alien-reporting-act-of-2025"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…built what has been called  ``the prettiest village in Maine,'' with handsome homes, churches, and  schools. Education remains a center of community life, with the high- performing Strong Elementary School being named a National Blue Ribbon  School.\n\nFrom the American Revolution to our time, Strong has always been a  town of patriots, with a veterans…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699397/225th-anniversary-of-the-town-of-strong"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…2025 data from the Internal Revenue Service (IRS) on       APTC reconciliation from tax forms filed for tax year 2023.       We assessed the reliability of all data sets by performing       electronic tests to determine the completeness and accuracy       of key fields. We also reviewed agency documentation and       interviewed knowledgeable agency officials…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698381/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Cindy Hyde-Smith", "party": "Republican", "sentence": "…than  that.\n\nI am grateful for the strong response from our State and Federal  partners. More than 600 Mississippi National Guard soldiers are on  extended deployment after performing critical missions, including road  clearance, refueling operations, distribution of goods, and conducting  welfare checks.\n\nThe Mississippi Department of Wildlife, Fisheries,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699701/9999"}, {"senator": "Claudia Tenney", "party": "Republican", "sentence": "…as a financial adviser  in Monument, Colorado. He often enjoyed spending time with his fellow  1966 Academy graduates and cheering on his grandchildren, whether they  were performing in a play or competing in sports.\n\nSadly, in 2021, Rick passed away with his wife, Nancy, by his side.  On the Fourth of July, the town of Lyndonville recognized Rick at…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693663/recognizing-colonel-john-peyton-swain"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…our nation. After his Army service, Andy built and managed  several successful businesses, including a national natural products  distribution company and one of the top-performing UPS franchise in  North Texas. He was also elected to the Celina City Council in 2015,  where his leadership as Mayor Pro Tempore and councilmember has played  a critical…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690707/recognizing-congressional-patriot-award-recipient-andy-hopkins"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…2025 data from the Internal Revenue Service (IRS) on       APTC reconciliation from tax forms filed for tax year 2023.       We assessed the reliability of all data sets by performing       electronic tests to determine the completeness and accuracy       of key fields. We also reviewed agency documentation and       interviewed knowledgeable agency officials…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698800/breaking-the-gridlock-act"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…infrastructure, and outside the boundaries of the       Conservation Area, powerline, facility, and access road       rights-of-way depicted on the map for the purposes of--\n\n``(A) performing geotechnical investigations within the       rights-of-way; and\n\n``(B) constructing and operating water transmission and       related facilities.\n\n``(2) Excavation and disposal.--…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698162/sloan-canyon-conservation-and-lateral-pipeline-act"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…back to really doing the things for the American people and not  using their suffering as leverage like Democratic Whip Clark is willing  to do.\n\nDemocrats have spent weeks performing political theater by refusing  to open government, and they continue to perform that political  theater. We need to prioritize the reopening of the government and stop  the…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696682/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…to engage in union activities while  being paid by the taxpayers.\n\nFor years, Federal employees have spent millions of taxpayer dollars  on union-related work instead of performing their official  responsibilities. Federal employees spent 3.6 million hours performing  union-related activities in 2016 alone, costing taxpayers $177.2  million.\n\nEven after…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689724/congratulating-glenvar-high-school-boys-swim-team"}]