[{"senator": "Brian Schatz", "party": "Democrat", "sentence": "…have to tell you, I am deeply disappointed at the extent to  which Members on our side of the aisle and your side of the aisle put  themselves in a position of some political peril to try to stabilize  the country and be the ballast that everybody needs across America.\n\nWe were trending well. We were trending well. I know how negotiations  go. They go…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695313/cloture-motion"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…had envisioned, which was this idea of every  generation making this a more perfect Union.\n\nBut there have been times in this journey where our Union was in  crisis and was in peril. There were times in this great American  journey, over our 250 years, where so many heroes had to emerge, people  that I have come to revere, like Joshua Chamberlain from…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…Court in the  Brandenburg decision in 1969, the ability to advocate violence except  in a manner calculated to induce immediate violence.\n\nWe forget the First Amendment at our peril. It is the keystone of our  liberties, and we almost disgraced ourselves by traducing it a few  minutes ago. I am glad we did not.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695637/first-amendment-is-keystone-of-our-liberties"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…communities, and who use  coercion to bring youth in and around Port-au-Prince into the service  of criminal activity.\n\nMr. Speaker, we ignore the ongoing crisis in Haiti at our own peril.  We have a duty to make sure that we identify and hold accountable those  who perpetuate chaos.\n\nI thank my colleagues for working in a bipartisan manner because this  is…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694816/haiti-criminal-collusion-transparency-act-of-2025"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…of Representatives.  Congress has the only authority to declare war. This President, like  many others of both parties, has ignored that requirement and, I think,  at his own peril. They are engaging us in a long-term conflict which  could cost us dearly, and they are not engaging the American people in  the discussion and rationale of our ultimate goals…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698599/venezuela"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…history.\n\nLet us honor the lives lost not only with remembrance but with  responsibility. Let's choose diplomacy over destruction, prevention  over provocation, and peace over peril.\n\nLet me return back to that scene of riding over that bridge over the  river with my cousin Kikue and the thought that I had that every world  leader who has some control…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694115/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…where average  premiums now have soared to over $14,000 or look westward from there  where 92 percent of Texans now are worried about homeowners insurance  costs. The insurance peril comes as no surprise because insurance, to  quote First Street, ``directly prices expected loss.''\n\nFirst Street describes how insurance is often the first transmission  channel…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699613/9999"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "Ms. STANSBURY. Mr. Speaker, Donald Trump's war on science is putting  our country and our economy in peril. From haphazard firings of Federal  workers who work on nuclear security and keep our food and medicine  safe to firefighters and healthcare workers, I am here to say enough…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691393/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…foreign sources for materials, critical minerals, or  key military components. Furthermore, by cutting all funding for  Ukraine, this bill dangerously ignores history at our own peril.\n\nAt our founding, Patrick Henry heroically proclaimed: ``Give me  liberty or give me death.'' He knew liberty's cost and our new Nation's  responsibility to uphold the values…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693693/department-of-defense-appropriations-act-2026"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…right through the dumb scheme, and they  know that the sole reason they are facing higher prices is because of  his policies.\n\nWhile Republicans ignore higher costs at their own peril, Democrats  are still going to keep fighting to lower costs for the American  people. We know that there is an opportunity that is going to come  before the Senate in just…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697242/the-economy"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…miscalculation, and  one moment of madness, and everything--everything--will end.\n\nThe clock is ticking, but the future is still ours to shape. Let us  choose wisdom over fear, peace over peril, and life over annihilation.\n\nMahalo to my colleague, Congressman McGovern, for organizing this  Special Order hour.\n\nI ask on August 6 and August 9, let us take a moment to…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694116/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…the ogre or the  dragon. First of all, it gets to be a really boring story, and second  of all, it ain't the right story.\n\nWhat we have is a situation in which we are in this peril that I  described. We are in this peril because the fossil fuel industry has  propped up this whole array of phony front groups to spread climate  disinformation, stuff that…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697077/climate-change"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…--Universities and media must protect free speech. Without       a unified stance, they will be picked off one-by-one and       first amendment rights for every American will be in peril.\n\n--Our largest law firms must remain guardians of the rule       of law by resisting administration pressure to undermine the       legal system of checks and balances which…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691413/recognizing-assault-on-american-diplomacy"}, {"senator": "Mark Pocan", "party": "Democrat", "sentence": "…their money. Leave it alone. That is the pledge. Mr. Speaker,  Republican Members of Congress can ignore their constituents, but  listen to the lesson from Wisconsin at your own peril. Figure out how  to listen to your constituents or get a discount card at Costco so you  can buy Depends by the carton. Those are pretty much your choices.\n\nPeople don't support…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689813/listening-to-our-constituents"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…This is a recipe for stifling creativity and the development of the  skills needed for an ever-changing knowledge economy.\n\nWe politicize and neglect public schools at our peril. They educate  nearly 50 million students--our future. It is time that we treat public  education as the priority it must be if we want a brighter future for  our children…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688311/nomination-of-linda-mcmahon"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…hours of the Biden  administration on December 26, after Christmas and weeks after  Americans soundly rejected the Biden-Harris regulatory regime  administration, putting in peril the livelihoods of hundreds of my  constituents the day after Christmas.\n\nTo put this into perspective, noncondensing tankless water heaters  account for 40 percent of our…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688098/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions-and-providing-for-consideration-of-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…congressional district in Georgia.\n\nThis regulation was imposed on December 26, 2024, in the midnight  hour of the Biden administration and the day after Christmas, putting  in peril the livelihoods of hundreds of my constituents during the  holiday season.\n\nMadam Speaker, I should also note that the timing of this regulation  was 7 weeks after Americans…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688294/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…life. We believe in prosperity. We do not believe  in martyrdom. We do not celebrate death. That is not what we believe.  There are those that do, and we put ourselves in great peril when we  fail to recognize that.\n\nDonald Trump recognized it. Our brave American soldiers who flew 40  hours round trip to deliver a message that under this President and…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692703/thanking-president-trump-for-saving-the-world"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…Armed  Forces, past and present, who have worn the uniform of the United  States of America.\n\nOur military has stood for freedom throughout our history in times of  peace and peril. They do not ask for recognition. They do not serve for  applause. They serve because they believe in something bigger than  themselves. They serve out of duty, honor, and…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691525/national-military-appreciation-month"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…surround them but  within their own nation, depriving people of basic rights, especially  women.\n\nThe President said enough is enough. This Nation has put too many  nations in peril, and he has stood up and eliminated the threat of a  nuclear weapon so that we no longer have this unrest in the region.\n\nBecause of his prior policies as President, we now…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692814/elections-matter"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…we want to talk  about intellectual dishonesty, that is the definition of it. So is so  much of the Democrat's energy policy that ignores current technical  realities at the peril of our American citizens.\n\nMr. Speaker, that is why my resolution is so important. It reverses  the Biden administration's plan that ignored my State's serious  concerns, restores…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694907/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Todd Young", "party": "Republican", "sentence": "…admit it or not--I suspect the answer is no--Clyde  Milligan is one of our best. You might even call him a hero--a hero for  the way he answered his country's call in a time of peril and for the  way he has lived his life since the war ended--a life guided by faith,  full of achievements and friendships, and, as the Bible says, years.\n\nThere have been many…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695668/cloture-motion"}]