[{"senator": "Dick Durbin", "party": "Democrat", "sentence": "…much and really don't want to see changes made--let it go forward.\n\nI think that is unfair to her. I could give you her name, but I am  not going to because I didn't ask her permission, but I believe every  word she told me.\n\nHard-working woman, 63 years old, whose health insurance is going to  more than double each month. She doesn't make a fortune as…", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697576/department-of-defense"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…are  saying: Is this cheaper or more expensive than the alternative?\n\nThere is a saying back in the days when I was going and doing all of  that, that asking a utility for permission to interconnect to the grid  is like asking a man for permission to date his wife. It doesn't matter  whether you are cheaper. It doesn't matter whether that is in the  national…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700229/winners-of-the-global-energy-race-are-being-decided"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…fentanyl crisis; and in three Congresses, this body has  failed to rise to the challenge.\n\nI am dying to be here when my colleague tells me: I told you so--and  I give him permission to do that--that this body would do something  beyond just scheduling. Because, as I have read, law enforcement,  scientists, doctors, and parents are not just asking for…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687971/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…under the Taliban  where they will face near-certain persecution.\n\nTrump is sending ICE officials to elementary schools where they tried  to gain access by lying about having permission from parents to speak  with their kids. ICE officials are arresting people with maximum  violence and lawlessness, showing up without judicial warrants, since  the Trump…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690540/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…have a plan. It is to  take all of Palestine. It is to take all of Gaza. It is to take the  West Bank. He has a plan. Don't assume that because he is going in  without our permission that he doesn't have a plan; he does.\n\nMy plan is to vote against any additional funds to the State of  Israel.", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691156/speaking-truth-about-power"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…=========================== NOTE ===========================\n\nOn September 15, 2025, page H4301, in the third column, the  following appeared: (Mr. LATTIMER asked and was given permission  to address the House for 1 minute and to revise and extend his  remarks.) Mr. LATTIMER. Mr. Speaker, as a\n\nThe online version has been corrected to read: (Mr. LATIMER  asked…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695435/cdcs-dangerous-turn-on-vaccines"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…further escalation. If you are  watching at home, read it yourself, H. Con. Res. 68. The reason we  think we need to do that is because the administration already did not  get permission before escalating the first time.\n\nBy the chairman's logic, the only time we can ever have a vote is if  there are physically boots on the ground. That just is logically…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699359/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…protections implemented by the Founders to avoid  improper influence, he violates one of the core principles of our  Constitution. He has never come to Congress asking for any permission  for any of these deals; that is for sure. His willingness to use the  privileges of his office to enrich himself and his family seems to know  no bounds. Congress simply…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691071/9999"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…That is simply ridiculous.\n\nIf Republicans have their way, agencies would not only have to seek  review from the Office of Management and Budget but will also have to  ask permission from FERC to see if FERC likes the regulation or not. If  not, even if the White House likes the regulation, the agency can't  finalize it.\n\nIf that is not bad enough, FERC…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698275/reliable-power-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…commits a murder or rape, they are going to be  prosecuted for murder or rape, so the bite of this bill is with respect  to people who just keep reentering our country without permission.\n\nNow, it would require that people who are immediately removable and  deportable, undocumented immigrants, must spend 5 or 10 years in  overcrowded and overburdened Bureau…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695361/stop-illegal-entry-act-of-2025"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…brought  here to the floor and wiped out.\n\nWhat about a permit? A permit is very close to being a waiver,  saying: Hey, you can undertake this process. We are giving you  permission. Well, that is what a waiver does. It says: Yes, you can  undertake that process.\n\nSo now no one has a foundation for pursuing projects because they  know that if the majority…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691625/congressional-review-act"}, {"senator": "Al Green", "party": "Democrat", "sentence": "Mr. GREEN of Texas.  Pressley).\n\nMr. GREEN of Texas. Mr. Speaker, permit me to commend the gentlewoman  for her very moving and powerful commentary. With her consent and  permission, I would associate myself with it.\n\nMr. GREEN of Texas. Mr. Speaker, and still I rise, a very proud,  liberated Democrat, unbought, unbossed, and unafraid.\n\nI rise today,…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697472/president-trump-is-a-threat-to-our-republic"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…essentially what is happening.\n\nI mean, heck, in New Mexico, Senator, if someone is going to do some  remodeling of their home, they have to go pull local permits and get  permission and follow the rules and all the rest--not this guy. At a  time when people are about to have their health insurance premiums  double or triple and when food programs are…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696347/trump-administration"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…report. Then the credit bureau sells that  information--which you don't want divulged and which the lender doesn't  want divulged--to other financial institutions without your permission,  creating a so-called trigger lead. Then, as was pointed out, you become  bombarded with phone calls, text messages, and other communications  from rival mortgage loan officers.…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692804/homebuyers-privacy-protection-act"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…``licensing'' to include an agency granting or revoking a       license, and ``license'' to include an agency approval,       statutory exemption, or other form of permission. 5 U.S.C.       Sec. 551 (8), (9). An agency action that constitutes an       order under APA is not a rule under the statute and,       therefore, is not a rule under CRA.…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691583/hj-res-88"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…for: eye care,  dental care, orthodonture. She makes the decision. She gets the  healthcare she knows she needs as opposed to the healthcare the  insurance company gives her permission to have. Put differently, giving  her the money gives power to the patient. That is where we should be.\n\nWhat Democrat wants to give 100 percent of the money to the insurance…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697554/healthcare"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…excellence, and  patriotism embody the very best of American service.\n\nRichard Loughran answered the call to serve his country at the young  age of 17--with his father's permission--when he enlisted in the United  States Marine Corps. He graduated from the Detroit Institute of  Technology in 1942 and enlisted in 1943. He began basic training and  soon…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693382/recognizing-united-states-marine-sgt-richard-loughran-as-july-2025-veteran-of-the-month"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…Act was done. So California got a waiver,  basically, to say: If your rules are at least as strong as the Clean  Air Act, you can have your own rules, but you have to ask permission.\n\nSo that is part of law that was originally written on the Clean Air  Act.\n\nSo California approached the Biden administration in 2022 and said:  We would like to have an…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691634/congressional-review-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…UTILITIES.\n\n(a) In General.--In any special use permit or easement on       covered Federal lands provided to an electrical utility, the       Secretary concerned may provide permission to cut and remove       trees or other vegetation from within the vicinity of       distribution lines or transmission lines without requiring a       separate timber sale,…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691068/fire-safe-electrical-corridors-act-of-2025"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…means the individual--of course, we now know that many of these are  fake--they didn't approve this or submit it or ask for it; it was the  agent or the broker, without permission, who made that change.\n\nOver the same period, there were close to 100,000 duplicate Social  Security numbers enrolled in the program. In 1 case, there was 1 Social  Security…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699102/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…American       tribal police officers who are cross-deputized as a federal       law enforcement officer by the federal Bureau of Indian       Affairs (``BIA'') and have permission from their supervisor       at the BIA may utilize 18 U.S.C. Sec. 925(a)(1), but only for       ordering weapons for their direct individual use, and not for       their…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700037/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…themselves in ``Star Wars,'' and, of course, it is fiction. The central  bank digital currency is kind of the equivalent. The central banks are  saying: Don't worry. We would need permission from the legislature  before we could establish a central bank digital currency. We are just  designing it.\n\nIn the movie, they didn't really get permission to turn it on.…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693006/central-bank-digital-currency"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…a penalty on an American taxpayer  before obtaining a supervisor's approval. Moreover, they can shop  around for any other employee at the agency that they wish to seek  permission from since current law does not require approval from a  direct supervisor.\n\nThese loopholes undermine the no-signature, no-penalty principle.  Representative Grothman's…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697248/fair-and-accountable-irs-reviews-act"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…surgeon available in her province to  perform that surgery. You would think she would look elsewhere in  Canada to get the surgery, but she can't do that. Jolene must get  permission from a local specialist first due to government rules  running the socialized healthcare system in Canada.\n\nYet getting an appointment with a specialist isn't possible because…", "date": "2026-01-05", "source_url": "https://justfacts.votesmart.org/public-statement/1698485/healthcare"}, {"senator": "David Kustoff", "party": "Republican", "sentence": "…movie that could benefit the company.\n\nAs FedEx's lead attorney, Chris told Fred that there had never been  an airline that willingly participated in a movie where they gave  permission to crash their plane. Chris advised against all of it.\n\nYet, Fred wanted to think outside the box, and he signed off on the  idea. He was really impressed with the production…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692825/remarkable-life-and-legacy-of-frederick-w-smith"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…section if--\n\n``(1) such vessel is located at a federally approved or       State approved mooring area;\n\n``(2) such vessel is located on private property with the       permission of the owner of such property;\n\n``(3) the owner or operator of such vessel provides a       notification to the Commandant that--\n\n``(A) indicates the location of the vessel;…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…decision that allows  inadmissible aliens . . . [who] are not admitted to the United States .  . . to be physically present in the United States.'' It is sort of like  a permission slip.\n\nParole is an authority that allows the Department of Homeland  Security Secretary to waive people into the country who otherwise would  not be allowed in.\n\nUnder Operation…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699092/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…participants. It requires  loyalty, prudence, and a clear focus on financial outcomes that workers  rely on.\n\nMr. Speaker, the problem with the Biden-Harris rule is that it  created permission and, in many cases, pressure for fiduciaries to  prioritize ESG factors over the economic interests of participants.  When that happens, retirement security is placed at…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699160/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…secrets can still exist.\n\nAnd, in fact, it is even more justified for the President not to tell  us anything about the attack until afterward, if we have already given  him permission to initiate a war.\n\nAnd people say: Oh, this is just a technicality. Why should we care?\n\nWell, if you have sons or daughters, you should care, because if we  have unlimited…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698611/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…with isolation, and  with a culture that pushes them toward passivity instead of purpose.  Meanwhile, Washington drags its feet. But these businesses aren't  waiting for permission--they're taking action. And as we refocus on  Making America Healthy Again, this is exactly the kind of leadership we  should be lifting up.\n\nI'm proud to recognize Gateway…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690045/recognizing-gateway-parks-and-barn-elite-training"}]