[{"senator": "Rick Larsen", "party": "Democrat", "sentence": "…Mr. Chair, I rise today to oppose the dirty water act. This bill will  make it more difficult to keep our water clean and will, ironically,  add more uncertainty to the permitting process, just the opposite of  what we need to have happen. This bill guts Federal, State, Tribal, and  local authority and resources to attain clean water and protect locally…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698022/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…Federal appraisal.\n\nIn addition to the conveyance, the bill would require the Secretary  of the Interior to conduct and publish a comprehensive review of the  Federal permitting process for the development of stone, sand, and  gravel on Federal lands.\n\nThis review will include descriptions of the Federal permitting  process for stone, sand, and gravel…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694031/wabeno-economic-development-act"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…and regulatory structure, investments, grants  because that is another casualty of this administration's war on  American-made affordable energy: the reliability of the permitting  process.\n\nIn January, on his first day in office, President Trump paused all  new leasing and permitting of wind energy projects on public lands.\n\nIn February, the Army Corps…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696124/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…education program at  Macalester College.\n\nMy Republican colleagues want to talk about permitting reform? Let's  talk about how President Trump is weaponizing the existing permitting  process to freeze the approval of permits for onshore wind and solar  projects, leaving thousands of megawatts of clean power in limbo at a  time when demand for electricity…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698075/opposition-to-permitting-bills"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "…strong opposition to the PERMIT  Act, Republicans' latest attempt to help corporate polluters dodge  responsibility.\n\nThis alarming bill would weaken the Army Corps' permitting process  and EPA's Clean Water Act authorities, threatening my district, where  the Clean Water Act protects our waters, our salmon, and our people.\n\nMoreover, this bill would…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698018/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "…national security and hurting hundreds of union  workers in my home State of Rhode Island ready to finish this project  that is 80 percent complete.\n\nWe already have a permitting process that works. This amendment  perpetuates a false narrative that leaves thousands of family- sustaining union jobs at risk.\n\nMR. COURTNEY. Mr. Chair, I yield back the balance…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695136/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Steven Horsford", "party": "Democrat", "sentence": "…Bureau of Land Management and Clark County  to issue utility and transportation rights-of-way.\n\nOriginally, Clark County had this authorization in order to make the  permitting process shorter. In recent years, however, the city of North  Las Vegas and the Apex Industrial Owners Association primarily manage  the site, not Clark County.\n\nThe result is…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691122/apex-area-technical-corrections-act"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…``radar  interference'' and possible swarm attacks from undersea drones at the  wind farm as potential threats.\n\nMadam Speaker, here is the thing: During the yearslong permitting  process, BOEM meticulously investigated all national security concerns,  and its 2023 Record of Decision approving the project specifically had  a section on national security.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695066/halt-work-orders"}, {"senator": "Jimmy Panetta", "party": "Democrat", "sentence": "…heard, this is a bill that would require the Council on  Environmental Quality to provide annual reports that evaluate the  efficiency and effectiveness of the Federal permitting process.\n\nI thank Representative Yakym for his leadership on this issue and  really appreciate his willingness to work in a bipartisan fashion to  fix our government's permitting…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697712/studying-nepas-impact-on-projects-act"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…the largest clean energy  project in North American history, bigger than the Hoover Dam. That is  pretty unbelievable.\n\nBut what is even more unbelievable is that the permitting process for  that transmission line and that generation started over 17 years ago,  and the project is being energized, as we speak. Think about that. It  took nearly two decades…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698581/permitting-reform"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…of an agency, including       statements that govern the conduct of agency proceedings. The       ROD describes various practices and procedures related to the       permitting process, including how and when BLM will include       stipulations in leases or impose required operating       procedures, as well as the availability of waivers,       exceptions,…", "date": "2025-07-28", "source_url": "https://justfacts.votesmart.org/public-statement/1694269/us-government-accountability-office-legal-opinion"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…to the House floor later this week.\n\nThis Congress, Republicans on the Energy and Commerce Committee have  worked diligently to improve grid reliability as well as the permitting  process for Federal projects, ultimately supporting President Trump's  goal of unleashing American energy dominance.\n\nUpcoming legislation that came out of the Committee will…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697690/letterkenny-army-depot-plays-important-role"}, {"senator": "David Rouzer", "party": "Republican", "sentence": "…Regulatory Burdens  Act, and the Improving Water Quality Certifications and American Energy  Infrastructure Act.\n\nEach addresses well-documented breakdowns in our Nation's permitting  process which delay critical projects, drive up costs, and do nothing  to actually improve water quality.\n\nThe Nationwide Permitting Improvement Act narrows the scope of the…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698028/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…Hudson.\n\nMy Energy and Commerce Committee colleagues and I have been hard at  work this year, crafting commonsense legislative solutions to improve  our burdensome Federal permitting process. The bill before us today is  just one example.\n\nDue to unclear review processes and a lack of coordination amongst  government agencies, pipeline infrastructure approvals…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698069/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…convey our strong support for H.R. 3898, the       PERMIT Act, which will provide necessary clarity and       confidence required under the Clean Water Act (CWA)       permitting process. Because clear and predictable permitting       leads to the creation of attainable housing, NAHB has       designated support for passage of H.R. 3898 as a KEY VOTE.…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698026/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…more housing, for more broadband, for more critical  infrastructure that will power this American economy for decades to  come.\n\nToo often in the last few years, our permitting process has stood in  the way of that. Here we are, arguably the most technologically  advanced nation in the world. Yet, our agencies have been using  decades-old fragmented…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697679/epermit-act"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…and dependable energy in our country, then we  must build the infrastructure that delivers it. However, too often  these projects are delayed or blocked by a Federal permitting process  that is far too inconsistent. When one State can derail an interstate  pipeline, then entire regions pay the price. We have already seen this  time and time again in…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698057/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…other words, what you had was a high-level management framework.  No individual projects were approved. Any seeking to advance would  still have to go through a separate permitting process before being  allowed to do so.\n\nBut unfortunately, BLM abandoned that approach after the Biden  administration took office. They didn't base their 2022 plan on any new…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696449/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…that predation from  double-crested cormorants costs the aquaculture industry nearly $65  million annually in economic losses.\n\nThis legislation would streamline the permitting process to take  double-crested cormorants, restoring protections for aquaculture  producers without negatively impacting cormorant populations.\n\nMr. Speaker, I commend Representative…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697641/cormorant-relief-act-of-2025"}, {"senator": "Tom Tiffany", "party": "Republican", "sentence": "…make publicly available       on the website of the Department of the Interior a report       that includes--\n\n(1) a detailed description of the current Federal       permitting process for stone, sand, and gravel development,       including average timelines from initial application to final       approval;\n\n(2) an analysis identifying potential inefficiencies…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694030/wabeno-economic-development-act"}, {"senator": "Andy Harris", "party": "Republican", "sentence": "Mr. HARRIS of Maryland. Mr. Chair, I thank the gentleman from New  Jersey for bringing up this topic.\n\nThe fact of the matter is that the permitting process was abbreviated  for offshore wind because we have this fascination that we have to  bring this very expensive type of energy production somehow to the  United States,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695162/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "Mr. WESTERMAN. Mr. Speaker, I rise to shed light on the broken  permitting process that creates roadblocks to unleashing American  innovation and development while costing more taxpayer dollars with  basically nothing to show for the expenses.\n\nThe…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693796/fix-broken-permitting-and-regulatory-laws"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…resolution before us does not mandate projects, mining sites,  firms, or schedules. It simply reverses the Biden administration's  unilateral short-circuiting of the normal permitting process.\n\nThis resolution is a step toward balance and the rule of law. It is a  step toward the mineral abundance that the American people deserve and  that Washington has denied…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699275/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…the United  States is 60 years. Therefore, hundreds of projects will be up for  relicensing between now and 2035.\n\nHydropower developers must go through an extensive permitting process  in order to license and relicense projects. While important, this  process can significantly increase the cost and timeline of relicensing  these important energy sources.…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693478/hydropower-licensing-transparency-act"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…restoring common sense to a process bogged down  by bureaucratic delays and partisan politics.\n\nFor far too long, energy developers have faced an outdated and  unpredictable permitting process that has delayed and even canceled  critical infrastructure projects, costing taxpayers millions of  dollars, and weakening American energy security.\n\nRight now, if you…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695691/promoting-cross-border-energy-infrastructure-act"}]