[{"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…do more for our  rural communities in providing care, not less.\n\nMr. Speaker, it's not too late to address this health care crisis of  Republicans' making. We can start by permanently extending the enhanced  premium tax credits under the Affordable Care Act to prevent millions  more from seeing their premiums skyrocket.\n\nThis Rural Health Day, I urge…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697097/national-rural-health-month"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…will remain under the sovereignty of the       federal government.\n\nSome critics have argued that the District Clause somehow       mandates that the District of Columbia permanently retain all       of its current territory, and that its size may neither be       increased or reduced by Congress. The plain language of the       District Clause says…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696933/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…scourges of fentanyl that we all know. Those people all said that this  can't be all Congress does; that the HALT bill cannot be our only  response because the whole bill permanently schedules what we have  already scheduled temporarily.\n\nI believe in the 99 Members here who know that our response to this  crisis cannot be what we have already been doing…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687971/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…an active member of his  community, as a trustee for the John Randolph Foundation, and as a  member of the city of Hopewell's planning commission.\n\nHe helped establish a permanently endowed scholarship for  Chesterfield, Hopewell, and Prince George students pursuing a medical  career.\n\nI thank Colonel Butler for his service to our Nation and admire…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696920/recognizing-william-woodard-butler-veteran-of-the-year"}, {"senator": "Brad Schneider", "party": "Democrat", "sentence": "…their futures, and of course to Israel, as well as the United  States and Europe, so I support the U.S. efforts to stop Iran's march  to a nuclear weapon.\n\nHowever, we cannot permanently end Iran's nuclear programs without a  negotiated agreement, without inspectors on the ground, without Iran  agreeing to reverse course. We must permanently block every…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692935/cancellation-of-iran-classified-briefing"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…cease-fire, war criminal Netanyahu is now  preparing a full-scale assault to ethnically cleanse and forcibly expel  the entire Palestinian population from Gaza and to flatten and  permanently occupy the land. This was always their plan. He said it  himself.\n\nIsraeli forces have killed more than 52,000 Palestinians, and nearly  70 percent of them were women and…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691384/the-nakba-never-ended"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…staff who work here,  and for the reporters who work here.\n\nWe have many officers who have had to leave the police service  because they have been wounded and disfigured permanently by the  injuries they suffered at the hands of these people. This is the very  least we can do at a time when the President of the United States says  that he wants to create…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691242/leosa-reform-act"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "Ms. MORRISON. Mr. Speaker, today I rise in strong opposition to H.J.  Res. 140. This resolution would permanently allow copper sulfide mining  in the watershed of the Boundary Waters Canoe Area Wilderness.\n\nCopper sulfide mining is the most toxic industry in America, and it  is particularly…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699272/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Laura Gillen", "party": "Democrat", "sentence": "…conditions from the toxins at Ground Zero.\n\nThat is why I was proud to help reintroduce the bipartisan 9/11  Responder and Survivor Health Funding Correction Act, which would  permanently fix the current funding shortfalls in the World Trade  Center Health Program.\n\nWe owe it to our 9/11 first responders to ensure that the programs  they rely on will be fully…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691183/national-police-week"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…the United States. We, of course, have thousands of American troops and  soldiers and airmen in Qatar today.\n\nAnd so what we need to say here is not that we are going to  permanently pause our military relationships with these countries, but  for the time being, while these two nations are willing to pay the  President tribute, we cannot endorse or condone…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692362/motion-to-discharge-sj-res-54"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…the Forest Legacy Program.\n\nAllowing States participating in the federal Forest Legacy Program  the flexibility to partner with accredited, nonprofit land trusts will  help permanently conserve more land by working with private landowners  who want to have their land conserved but are wary of selling the  federal or state governments an easement on their…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689872/reintroduction-of-the-forest-legacy-management-flexibility-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…will remain under the sovereignty of the       federal government.\n\nSome critics have argued that the District Clause somehow       mandates that the District of Columbia permanently retain all       of its current territory, and that its size may neither be       increased or reduced by Congress. The plain language of the       District Clause says…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695559/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…economic strategies that make sense and are designed to lift up  the American people. Yet, I can't find anything in this 900-plus page  bill that is actually designed to permanently sustain a positive  trajectory for farmers in this country and for everyday Americans.\n\nIn fact, the chaotic uncertainty of the economic policies that have  been unleashed…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…provisions of the One Big Beautiful  Bill Act. The D.C. law expires in 225 days, giving D.C. time to  evaluate which provisions in the One Big Beautiful Bill Act it wants to  permanently adopt or decouple.\n\nThis disapproval resolution could harm D.C.'s credit rating, forcing  D.C. to pay higher interest rates. Rating agencies consider the  possibility of…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699680/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…attacks  on public health, coupled with the Republicans' attacks on Americans'  healthcare will seriously threaten the improvements we have made.\n\nThe bill before us today permanently schedules fentanyl-related  substances on schedule I of the Controlled Substances Act. This is  based on a class definition disputed by scientists. I oppose this bill  because…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692341/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…was an  objection. So I don't understand what we are going through here.\n\nI, for one, believe that the workers should be paid. I, for one,  believe that we should fix this permanently. The bill that I have  presented is not just to pay them one time; it is to pay all workers  all the time who are under contract and who show up for work whether  there…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696562/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…breathing room for businesses.  However, more work needs to be done; and Congress has a role to play.\n\nMy resolution seeks to ensure that these overreaching regulations are  permanently overturned. By doing so, we will protect small businesses  from unnecessary compliance costs and preserve the diversity of choice  available to consumers.\n\nThis action aligns…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689262/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers"}, {"senator": "Anna Luna", "party": "Republican", "sentence": "…fundamentally dangerous this rule change is.\n\nAs of right now, they slipped language into this rule, and I will get  to what they attached the rule to in a second, that would permanently  kill any ability for new Members of Congress to be able to bring this  up and allow those Members who just had a child to be able to vote.  That is dangerous because of…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689415/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…respond to incentives and  rewards, which underscores the main problem with the ``once in, always  in'' rule. There is no incentive to invest.\n\nThis misguided regulation permanently classifies certain industrial  facilities as major sources, major sources of hazardous air pollutants  even after they have made significant investments to reduce the  emissions…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691597/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…taxpayer and innocent women like Laken Riley, Jocelyn  Nungaray, and Rachel Morin have paid the full price of the left's open- border agenda.\n\nIt is time to turn off the faucet permanently. American taxpayers  shouldn't have to fund their own demise, paying for government programs  that actually encourage an invasion.\n\nPresident Trump has shown us the path…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690711/outrageous-government-funded-incentives"}, {"senator": "Steve Daines", "party": "Republican", "sentence": "…BLM from  issuing a new amendment. This CRA simply prohibits a new administration  from issuing a substantially similar coal amendment. In this case, that  means they can't permanently prohibit any new coal development.\n\nToday, you may hear from the other side of the aisle that the sky is  falling. That is absolutely not true. What we are doing today is…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696095/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…important not only to the security of  Lebanon but also their neighboring countries and the United States.  That stability is more important than ever as the LAF works to  permanently disarm and destroy Hezbollah's presence in Lebanon.\n\nBuilding on the tremendous success of Israel in weakening Iran and  eliminating Hezbollah's terrorist leader network,…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693688/department-of-defense-appropriations-act-2026"}, {"senator": "Byron Donalds", "party": "Republican", "sentence": "…gallery, he often would return to  the Capitol.\n\nCongress has honored Douglass with a portrait and plaque in the  gallery and a statute in Emancipation Hall. This  resolution permanently renames these famous offices off of the House  floor for all Americans today, and years to come, to honor his work for  freedom in this hallowed Chamber.\n\nI thank Speaker…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692222/designating-the-house-press-gallery-in-the-united-states-capitol-as-the-frederick-douglass-press-gallery"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…18 months in subsequent rules with continued  support by the committee's minority counterparts.\n\nSimilarly, when it comes to the National Emergencies Act, in a rule  they permanently blocked votes terminating the COVID national  emergency, despite Mr. Gosar introducing two separate disapproval  resolutions.\n\nMr. Speaker, be careful what you accuse us…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689703/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…hospitals are under serious strain. Nearly half are  operating at negative margins. Since 2010, more than 150 rural  hospitals have cut inpatient services or closed their doors  permanently, including some in northern Michigan and the Upper  Peninsula.\n\nThese closures aren't happening because communities don't need care  but because the financial reality of…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696877/national-rural-health-day"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…never should have been in our country in the first  place.\n\nTo commemorate Jocelyn's life, I have introduced the Jocelyn Nungaray  National Wildlife Refuge Act, which would permanently rename the  Anahuac National Wildlife Refuge in Texas in her memory.\n\nThis bill would actually codify President Trump's Executive order and  ensure that future generations…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691123/jocelyn-nungaray-national-wildlife-refuge"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…WESTERMAN.  Res. 104.\n\nMr. Speaker, I rise in strong support of H.J. Res. 104, sponsored by  Representative Downing of Montana.\n\nThis Congressional Review Act resolution would permanently repeal the  Bureau of Land Management's misguided resource management plan  amendment for the Miles City Field Office in Montana, finalized under  the Biden administration.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694888/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "…quality and timely physician examinations so that they are able to  receive the care they are entitled to, regardless of where they live.\n\nThis legislation does this by permanently allowing VA providers to  perform cross-State disability exams and expanding the pool of  providers who can perform medical disability examinations for the VA to  include…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695498/rural-veterans-improved-access-to-benefits-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…speak. Make them do their job so that we can defend our  country and defend our people. Pass the SAVE Act, pass voter ID, and  secure American elections. Secure our border permanently instead of  just having it depend on the current President. Reform our immigration  system. Pause it. We have done it before. Pause it, review it, and stop  people from…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…Senate  Democrat voted for it. Essentially, by voting against it, they voted  for a $3,000 tax increase on most families back in Texas.\n\nThe Working Families Tax Cuts Act permanently increased the standard  deduction to $15,750, including an annual adjustment for inflation.  Without our legislation, the standard deduction would have dropped to  $8,300…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698258/nominations"}]