[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…or all of these vessels. It may  also be that some of these boats were being used for human trafficking  and that the victims of that offense were killed along with the  perpetrators, or, if not on one of the first four ships destroyed, then  perhaps on the next one.\n\nThe lack of detail concerning these strikes is telling. We have  learned of these strikes…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696120/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…wrong under the values of equal justice under law, wrong under the  values of justice for those who have been victimized, wrong under the  value of accountability for the perpetrators.", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699772/9999"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…social landscape continues to evolve, placing our most vulnerable  population online more often, we must be prepared with the laws to  deter and punish bad actors.\n\nThese perpetrators have taken Al-generated images of their victims or  convinced the teens to send nude images of themselves and used them as  leverage for outrageous demands. Some perpetrators…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699202/supporting-hr-the-combating-online-predators-act"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…tomorrow, not next year, not after more damage is done. The TAKE IT  DOWN Act gives victims a clear, fast pathway to have these images  removed from online platforms, hold perpetrators accountable, and  ensure that tech companies do their part. They have responsibility.\n\nThis is just one piece of a broader fight. It is one I have been in  for years, and…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690184/tools-to-address-known-exploitation-by-immobilizing-technological-deepfakes-on-websites-and-networks-act"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…administration's  proposed reorganization and so-called streamlining of the government  has been for United States' national security. The sanctions in this  bill may help to hold perpetrators accountable and deter the practice,  as well.\n\nWe cannot remain silent in the face of such cruelty. We must stand  with the victims, show them they are not forgotten, and…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690646/falun-gong-protection-act"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…harassment.\n\nOur coasties deserve better, and this legislation provides oversight  and the tools needed for the Coast Guard to prevent these crimes,  protect victims, and hold perpetrators accountable.\n\nMoreover, I am proud that this bill includes several provisions that  I sponsored regarding U.S. merchant mariners. This bill tackles long  outdated methods…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694192/coast-guard-authorization-act-of-2025"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…have the bipartisan convergence that we need  to reverse the error of the interpretation that is in the Howard  decision to make sure we can always hold accountable the perpetrators  of this seriously corrosive crime.\n\nH.R. 6715 strives to right this wrong, and I am proud that we are  acting in a bipartisan way to do that. I urge my colleagues to support…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698895/child-predators-accountability-act"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…make our laws safer after I witnessed firsthand  how fragile our justice system can be, and now I am determined, as we  all should be, to protect our justice system so that perpetrators of  crime and violence are actually held accountable.\n\nThere have been recent attacks on judges, as has been expressed by my  colleague, Mr. Johnson. These attacks on our…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690394/attacks-and-threats-on-democracy-and-rule-of-law"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…Israel, my colleagues are willing to throw  international law in the shredder. Their actions consistently undermine  the principle of equal justice under law when they protect perpetrators  of the most horrific crimes against humanity.\n\nI wish my colleagues would see what is happening. I wish they would  see that, no matter their ethnicity, we should be saving…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689027/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…rebellion by the American colonists,       Rhode Island historians and officials maintain. And the       resulting fallout--with King George III demanding that the       perpetrators be held accountable in a showdown between the       colonial legal system and the British courts--helped unify       the colonies for the war to come.\n\n``[T]his is a Matter…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691707/253rd-anniversary-of-the-gaspee-raid"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…victims. These crimes have deadly consequences.\n\nNCMEC has identified 36 teens who took their own lives after being  subjected to harsh and incessant harassment from callous perpetrators  of sextortion. The problem is everywhere.\n\nLast May, the U.S. Attorney's Office for the District of Maryland  announced the guilty plea of a man who had coerced at least…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698862/combating-online-predators-act"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…when millions of TANF dollars were stolen from struggling  families in Mississippi to build a volleyball stadium and when the  Trump administration stepped in to shield the perpetrators from  accountability. Instead, they were silent.\n\nThe bottom line is simple. Anti-abortion centers that spread  misinformation and put women at risk should not receive taxpayer…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699223/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…securely conduct transactions, our economy suffers as a whole. H.R.  1155 ensures confidence in our banking system by ensuring that stolen  checks can be recovered and that perpetrators face real consequences.\n\nMr. Speaker, check fraud is a growing problem, but today, we, in a  bipartisan way, in the Ways and Means Committee are finally taking  commonsense,…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689292/recovery-of-stolen-checks-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…files. Create the  force of law, deliver the files. And 51 Senators in this body, I am  ashamed to say, said: Hell no. We want them kept secret. We want to  protect the perpetrators. Why? Because the man in the Oval Office, Mr.  Trump, told us he wants us to protect those files, does not want them  public.\n\nOn July 17, the Wall Street Journal reported…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695214/jeffrey-epstein"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…videos of her  self-inflicted wounds.\n\nAccording to the criminal complaint, the content was shared with the  leader of the 764 group, or the so-called boss, so that the  perpetrators could become full-fledged members of the group.\n\nMind you, Roblox is a massive online platform that actually allows  users to design, create, and play millions of different…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698879/coercion-and-sexual-abuse-free-environment-act"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…of the current and emerging threats posed       by vehicular terrorism, as well as the following:\n\n(i) An analysis of the methods, tactics, and motivations       used by perpetrators of vehicular terrorism.\n\n(ii) An evaluation of domestic and international trends in       vehicular terrorism.\n\n(iii) An identification of potential future threats related…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696768/department-of-homeland-security-vehicular-terrorism-prevention-and-mitigation-act-of-2025"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…assault on Israel. It was an attack on the  American vision for a safe and secure Middle East, which was led,  perpetuated, and financed by the Iranian regime.\n\nThe Hamas perpetrators not only set out to destroy the very existence  of the State of Israel, but they sought something larger. They wanted  to prevent a seismic shift in the region from taking…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688138/promoting-stability-and-prosperity"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…waste, fraud, and abuse in California since 2016;\n\n2, a breakdown of fraud by economic sector such as       transportation, healthcare, housing, law enforcement;\n\n3, who the perpetrators of fraud are;\n\n4, what stolen funds are spent on; and,\n\n5, using California as a case study, what steps can the       Federal Government take to reduce the most common frauds…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699473/illegal-bio-lab-in-las-vegas"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…a direct assault on every  principle of human dignity and decency.\n\nH.R. 1503, the Stop Forced Organ Harvesting Act of 2025, is a  bipartisan moral imperative. It holds perpetrators accountable and  targets the heart of this depraved industry.\n\nThis bill sends a clear message: The United States will not be  complicit. If you take part in forced organ…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690630/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…juveniles,  and 53 percent of all carjacking arrests in 2025, as of August, were  juveniles.\n\nCongress must respond to these violent crimes being committed by  juvenile perpetrators. Currently, minors 16 years old and older are  eligible to have their case moved up to criminal court and to be tried  as an adult in D.C. This bill lowers that age to 14…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695595/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…So when I was attorney general a number of years ago, the Governor  and I launched this big initiative called the Choose Respect  Initiative. We changed the laws. We made perpetrators really pay if  they were going to commit these heinous crimes in Alaska.\n\nWe got funding for lawyers and resources. We got different services,  and we had ads all over TV…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695990/supporting-the-goals-and-objectives-of-choose-respect-day"}, {"senator": "Ryan Mackenzie", "party": "Republican", "sentence": "…relentless terror and violence, it takes enormous  courage to do many of the things that we take for granted. We can take  inspiration from those who face down the cowardly perpetrators of  destruction with faith and hope as they work to rebuild their nation.\n\nI join the Greater Lehigh Valley Syrian community in praying for the  victims of this attack and…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693108/facing-down-perpetrators-of-destruction"}]