[{"senator": "Sylvia Garcia", "party": "Democrat", "sentence": "…284--Congressional Award Program Reauthorization Act (Sen. Lummis-- Education and Workforce); and YEA on H.R. 3187--Conveyance of specified  Forest Service property to Perry County, Arkansas (Rep. Hill--Natural  Resources).                             personal explanation\n\nMr. GOLDMAN of New York. Mr. Speaker, I was unable to vote today due  to an…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698155/conveyance-of-specified-forest-service-property-to-perry-county-arkansas"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…best wishes for  continued success.                           honoring the metz family\n\nMr. JOYCE of Pennsylvania. Madam Speaker, I rise today to honor the  Metz family of Perry County, Pennsylvania, for receiving the  designation of bicentennial farm from the Pennsylvania Department of  Agriculture.\n\nA bicentennial farm is a farm that has been owned by…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694805/critical-supply-chains"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…Mr. Speaker, I move to suspend the rules and pass the  bill (H.R. 3187) to require the Secretary of Agriculture to convey a  parcel of property of the Forest Service to Perry County, Arkansas, and  for other purposes, as amended.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:                                 H.R. 3187\n\nBe…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698160/conveyance-of-specified-forest-service-property-to-perry-county-arkansas"}, {"senator": "French Hill", "party": "Republican", "sentence": "…support.\n\nAs noted, my bill seeks to transfer ownership of a vacant Federal  building owned by the U.S. Forest Service at 1069 Fourche Avenue in  Perryville, Arkansas, to Perry County.\n\nThis property is no longer in use by the Forest Service, and there  are no plans for its utilization by them. That has been the case, Mr.  Speaker, for well over a decade.…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698159/conveyance-of-specified-forest-service-property-to-perry-county-arkansas"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…Outstanding Agriculture  Education Teacher of the Year. This is one of the highest honors for  his profession.\n\nMichael is an agriculture teacher at the Greenwood High School in  Perry County, Pennsylvania.\n\nThe national award that Michael received recognizes teachers who  demonstrate innovation and program development, a commitment to  lifelong learning, and…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700129/opening-of-kongsberg-defense-expansion"}]