[{"senator": "Cory Booker", "party": "Democrat", "sentence": "I think that is why today has hurt so  many of us personally is because of what this breach of this body  actually means to all of us.", "title": "Alex Padilla", "date": "2025-06-12"}, {"senator": "John Larson", "party": "Democrat", "sentence": "I am very concerned about the Supreme Court's most recent ruling  that overturned two lower courts with no logic and said, no, there  shouldn't be a pause, that DOGE ought to be able to look at everyone's  personal data and records.", "title": "Doge Has Unfettered Access to Personal Data", "date": "2025-06-12"}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "One person I was trying to get their job back was actually working  with the Veterans Crisis Hotline.", "title": "-9999", "date": "2025-04-09"}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "They  know people like Stephen Miller, whom I have often called and said that  he is the most dangerous person in our country, are not accountable to  them.", "title": "-9999", "date": "2026-01-28"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "I was told that he gave away thousands of dollars of his own  personal Trump swag.", "title": "Trump Administration", "date": "2025-10-21"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "If a person runs away from these masked vigilantes, they will beat  and chase that person down.", "title": "Condemning Violence By Ice", "date": "2025-06-25"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "Reverend Norman has led the church in spiritual matters, Sunday  worship services, and weekly Bible study classes, in person and online.", "title": "Recognizing Reverend William E. Norman, Sr.", "date": "2025-11-19"}, {"senator": "Richard Neal", "party": "Democrat", "sentence": "The tax cut for the person at  the top was 288 times what it was for the person making less than  $50,000 a year.", "title": "Concurrent Resolution on the Budget for Fiscal Year 2025", "date": "2025-04-09"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "The Fourth Amendment of the Constitution states that the right of the  people against unreasonable searches and seizures shall not be  violated, and the Fifth Amendment of the Constitution states no person  shall be deprived of life, liberty, or property without due process of  the law.", "title": "Notice of Intention to Offer Resolution Raising A Question of the Privileges of the House", "date": "2025-05-13"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "What naive person would think that these  people who contributed these obscene amounts of money did it for  altruistic purposes?", "title": "Restoring Election Integrity", "date": "2026-01-21"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "The average cost increase  is $700 per person per year.", "title": "Stories From Home: the Human Cost of Expiring Healthcare Tax Credits", "date": "2025-11-17"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "``ICE does not house aliens at these locations, rather these are  working offices where ERO personnel process aliens to make custody  determinations based on the specific circumstances of each case.", "title": "Holding Power Accountable", "date": "2025-06-25"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "Speaker, they have forced seniors to go in person to apply for  Social Security.", "title": "Disapproving the Rule Submitted By the Bureau of Consumer Financial Protection Relating to ``Overdraft Lending: Very Large Financial Institutions''", "date": "2025-04-09"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "To  a person, they all said the same thing.", "title": "Agoa Extension Act", "date": "2026-01-12"}, {"senator": "Jacky Rosen", "party": "Democrat", "sentence": "Every person needs to eat.", "title": "-9999", "date": "2026-01-08"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "I personally thank  President Trump for his contribution to funding the government.", "title": "Consolidated Appropriations Act, 2026", "date": "2026-02-03"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "Blanche is the right man for the job because he has  seen this weaponization firsthand, and he has paid a personal cost to  do something about it.", "title": "-9999", "date": "2025-03-05"}, {"senator": "Cindy Hyde-Smith", "party": "Republican", "sentence": "The SAVE Moms and Babies Act would restore commonsense safety  protections, including requiring an in-person doctor visit before  mifepristone is prescribed.", "title": "Rounds, Mr. Wicker, Mr. Lankford, Mr. McConnell, Ms. Lummis,", "date": "2026-01-27"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "He seemed to be a  wonderful man, a wonderful person, and my thoughts and prayers and the  thoughts of the Energy and Commerce Committee, and I know the whole  House, are with his family.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the Department of Energy Relating to ``Energy Conservation Program for Appliance Standards: Certification Requirements, Labeling Requirements, and Enforcement Provisions for Certain Consumer Products and Commercial Equipment''", "date": "2025-03-05"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "It calls upon all of  us to mark Choose Respect Day by teaching our youth about healthy  relationships, supporting survivors, honoring those we have lost, and  recommitting ourselves to the fundamental truth that every person  deserves to live in freedom from violence and fear.", "title": "Supporting the Goals and Objectives of Choose Respect Day", "date": "2025-10-03"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "Worst of all is my own State of California, which became the first  State in the Nation, the only State in the Nation, to provide free  Medi-Cal to every single person in our State illegally.", "title": "Protect Medicaid Benefits for American Citizens", "date": "2025-02-26"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "He was a person of reason, but as you got to know Doug, Mr.", "title": "-9999", "date": "2026-01-08"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "I have yet to meet one  person who supports it.", "title": "Repeal of Senate Notification Requirements Relating to Legal Process on Disclosures of Senate Data", "date": "2025-11-19"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "If I get one more person  who says: I saw on cable news this, so why don't you fix it?", "title": "Truth Telling with Math and Facts", "date": "2025-05-20"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "For somebody like Elon Musk, who is reportedly one of the most  wealthy--maybe, the most wealthy person--on the planet to spend his  time and effort and to assemble a team like he has to work with the  government and to start the Department of Government Efficiency is a  huge public service.", "title": "Department of Government Efficiency", "date": "2025-05-05"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "We strengthened surveillance and gave  up personal freedoms in the hope of preventing another large-scale  attack.", "title": "-9999", "date": "2025-10-08"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "I will talk about that later, but we also  need to protect self-custody, which is the ability for you to move your  money directly person to person without an intermediary.", "title": "Guiding and Establishing National Innovation for U.S. Stablecoins Act", "date": "2025-07-17"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "When a fiduciary chooses investments  based on nonfinancial criteria, the person paying the price is not the  bureaucrat in Washington or the corporate executive on a conference  call.", "title": "Protecting Prudent Investment of Retirement Savings Act", "date": "2026-01-15"}]