[{"senator": "Kathy Castor", "party": "Democrat", "sentence": "…shut down operations in response to a federal       judge's ruling against DOGE that he claimed would leave no       one in the agency with access to beneficiaries' personal       information.\n\nAlarmed lawmakers are straining to answer questions back       home from angry constituents. Calls have flooded into       congressional offices. AARP announced…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689130/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Brad Schneider", "party": "Democrat", "sentence": "…hauled       away in trucks.\n\nIn August 1943, grandmother decided we had to flee Paris.       We obtained false identity papers with new names and equally       false personal information. We departed from Paris on an       overnight train that would pass through two border control       checkpoints, the first under German control, the second under…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690804/rose-helene-spreiregen"}, {"senator": "Rob Menendez", "party": "Democrat", "sentence": "…their data. Instead, my colleagues across the  aisle have seemingly left the door open for DOGE and anyone else to  potentially access and misuse their constituents' personal information.\n\nIt is not just the recklessness that should concern everyone across  the country. It is the fact that the data being held by the government  is being weaponized by…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690782/protecting-sensitive-data-for-millions-of-americans"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…the Merit Systems  Protection Board, a tribunal created to address widespread public  concerns about the Federal civil service; and unlawfully transmitted  sensitive personal information of private citizens and government  employees in violation of, among other Federal laws, the Privacy Act  and the Administrative Procedure Act.\n\nIn all of this, Donald…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691079/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…impacts  all 435 congressional districts.\n\nMadam Speaker, you have 161,000 Social Security recipients in your  district. I know that you do not stand for having their personal  information gone through, looked over, and utilized for anything that  was unintended, let alone having been taken from its secure position in  Social Security and stored in a…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695464/condolences-to-the-family-of-charlie-kirk"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…reported that the former chief data  officer for the Social Security Administration has said that Elon Musk  and his DOGE gang copied a mainframe database containing the personal  information of hundreds of millions of Americans, including names,  birth dates, addresses, and more. In fact, if you step back, DOGE has  pilfered information from every Federal…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696343/trump-administration"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…strip States of  these rights is flagrantly illegal and unconstitutional.\n\nPresident Trump's lackeys have attempted to bully States into handing  over sensitive and personal information contained within State voter  rolls. DOJ has requested information or meetings about election  administration from States and has demanded 40 States--40 States-- provide…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696440/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…our government falsely accused them of being  spies.\n\nAlready, 72 percent of Asian-American academic researchers report  feeling unsafe. By publicizing the private, personal information of  certain faculty and staff on databases, this bill would make the  problem worse, making them much easier targets for xenophobic attacks.\n\nSafeguarding national security…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689033/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…shy about  it. They admit to raising the price of water and ice cream if it is hot  outside. Even worse, corporations are tracking consumers and using  their own personal, private information against them.\n\nWe all know that companies collect and purchase a tremendous amount  of our private data and personal information. These custom, personal  profiles…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694896/providing-recovery-for-flood-victims"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…have taken that  data and put it in a cloud, making it vulnerable to being hacked. It is  an unsecured position by people who had no right to go into  individuals' personal data and information.\n\nMadam Speaker, I asked Chairman Estes yesterday if he would call a  hearing on this so that we could bring the whistleblower in who made  this evident and clear…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695217/data-collected-by-doge"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…They worked for it.\n\nDOGE not only threatens Social Security by removing vital staff  across our country but by mistreating and exposing beneficiaries'  private and personal information.\n\nIn my entire lifetime, I have never seen strangers go into the U.S.  Treasury Department and peek at other people's private beneficiary  records. This is un-American.…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699878/protecting-social-security"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…benefits they earned through service. Too many veterans, along with  their families, caregivers, and survivors, are being hit with savvy  fraud schemes designed to steal personal information, drain bank  accounts, and even redirect VA benefits to bad actors. When these scams  happen, veterans often don't know where to turn inside the Federal  system.\n\nThe…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699191/veterans-scam-and-fraud-evasion-act-of-2025"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…promising to  kill him, his wife, and his daughter, stating ``I am coming for you. .  . . [Y]ou, your wife, and your dead damn effing daughter are dead,''  after his personal information was stolen from a government vehicle  last month.\n\nThe numerous ICE officers whose wives have received calls telling  them that their families will be killed.\n\nThe ICE…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699689/immigration"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Covered California Trackers\n\nMr. KILEY of California. Mr. Speaker, an investigation by CalMatters  has revealed something extremely disturbing when it comes to the  personal health information of Californians.\n\nIt has been revealed that the website of Covered California, which is  the State's ObamaCare exchange, had a tracker that was collecting the  personal…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690562/gas-prices-are-lower-for-everyone-except-californians"}, {"senator": "Anna Luna", "party": "Republican", "sentence": "…was  engaging in Jim Crow-era law or pushing that type of perspective. And  for the same people who are advocating saying that Kristi Noem and ICE  will demand your personal information and you will be under  surveillance, might I remind them that they actually all authorized the  reauthorization of FISA, unreformed, that violated our constitutional…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700010/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…Secretary of Defense to update the Defense  Federal Acquisition Regulation Supplement to require the same  cybersecurity vulnerability disclosure policies, safeguarding the  personal information of our servicemembers and the information vital to  our national security.\n\nThese updates shall be done consistent with the guidelines and best  practices developed…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688359/federal-contractor-cybersecurity-vulnerability-reduction-act-of-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Protection of Information.--Data included in a report       required under subsection (a) may be aggregated or anonymized       to protect the financial information and personal information       of program participants.''.\n\n(c) Application Review.--\n\n(1) Sense of congress.--It is the sense of the Congress,       not later than 90 days after the date on…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "…this  statute--would be forfeited to the U.S. Treasury. But it would preserve  the important protections that are in place under the statute when it  comes to Members' personal information.\n\nI happen to think--and that was what animated this--that individual  Senators, Members of the article I branch of our government, should not  be subject to a weaponized…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697049/unanimous-consent-requests"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…torts; or\n\n(B) preempt any law of a State or political subdivision of       a State to the extent that such law relates to an act of       fraud, unauthorized access to personal information, or       notification of unauthorized access to personal information.\n\n(d) Definitions.--In this Act:\n\n(1) Base services price.--The term ``base services       price''--…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690200/hotel-fees-transparency-act-of-2025"}, {"senator": "Laurel Lee", "party": "Republican", "sentence": "…them into committing acts of violence against  themselves, others, or even animals.\n\nThese online groups use mainstream platforms to gain access to  children, extract personal information or images, and then weaponize  that material.\n\nThe result is severe psychological coercion and abuse--children  forced into self-mutilation, cruelty to animals, or even…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698877/coercion-and-sexual-abuse-free-environment-act"}]