[{"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…recognize Chloe Sherman  for earning the Arvada Wheat Ridge Service Ambassadors for Youth Award.\n\nChloe has overcome many challenges along her journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their education, like Chloe, develop crucial skills and a  work ethic that will guide them for the rest of their…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690033/recognizing-chloe-sherman"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…Michael  Racinowski for earning the Arvada Wheat Ridge Service Ambassadors for  Youth Award.\n\nMichael has overcome many challenges along his journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their education, like Michael, develop crucial skills and a  work ethic that will guide them for the rest of their…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689468/recognizing-michael-racinowski"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…spoke with humility and love, paying tribute to  his beloved parents who shaped his life.\n\nPresident John F. Kennedy defined true grit as courage, grace under  pressure, perseverance in the face of adversity. Maxim personifies that  ideal. He teaches us that determination can rise even from the deepest  loss and that discipline and artistry can become…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698839/uplifting-spirit-of-olympic-skater-maxim-naumov"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…Seanz  Alvarado for earning the Arvada Wheat Ridge Service Ambassadors for  Youth Award.\n\nValeria has overcome many challenges along her journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their education, like Valeria, develop crucial skills and a  work ethic that will guide them for the rest of their…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689450/recognizing-valeria-seanz-alvarado"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…recognize Giana Padilla  for earning the Arvada Wheat Ridge Service Ambassadors for Youth Award.\n\nGiana has overcome many challenges along her journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their education, like Giana, develop crucial skills and a  work ethic that will guide them for the rest of their…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691501/recognizing-giana-padilla"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…Omar Lautenbach  for earning the Arvada Wheat Ridge Service Ambassadors for Youth Award.\n\nOmar has overcome many challenges along their journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their education, like Omar, develop crucial skills and a  work ethic that will guide them for the rest of their lives.…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689451/recognizing-omar-lautenbach"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…recognize Heyzel Perez  for earning the Arvada Wheat Ridge Service Ambassadors for Youth Award.\n\nHeyzel has overcome many challenges along her journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their education, like Heyzel, develop crucial skills and a  work ethic that will guide them for the rest of their…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691009/recognizing-heyzel-perez"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…Barscocchini for earning the Arvada Wheat Ridge Service Ambassadors for  Youth Award.\n\nDanovin has overcome many challenges along his journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their education, like Danovin, develop crucial skills and a  work ethic that will guide them for the rest of their…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689693/recognizing-danovin-barscocchini"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…Jackson Minor  for earning the Arvada Wheat Ridge Service Ambassadors for Youth Award.\n\nJackson has overcome many challenges along his journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their education, like Jackson, develop crucial skills and a  work ethic that will guide them for the rest of their…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690051/recognizing-jackson-minor"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…was the first Democratic woman elected  to Congress from Ohio.\n\nMary Rose was elected from the heart of the working class of people.  She exhibited raw courage, loyalty, perseverance, high learning,  precious humor, and stellar insight into human nature. Her hearty  giggle elevated people's spirits, and she suffered no fools. She stood  her ground, and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695548/moment-of-silence-for-mary-rose-oakar"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…Laura Jeffries  for earning the Arvada Wheat Ridge Service Ambassadors for Youth Award.\n\nLaura has overcome many challenges along her journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their education, like Laura, develop crucial skills and a  work ethic that will guide them for the rest of their…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691970/recognizing-laura-jeffries"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…Isabella Ekman  for earning the Arvada Wheat Ridge Service Ambassadors for Youth Award.\n\nIsabella has overcome many challenges along her journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their education, like Isabella, develop crucial skills and  a work ethic that will guide them for the rest of their…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690024/recognizing-isabella-ekman"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…recognize Alexis DeLeo  for earning the Arvada Wheat Ridge Service Ambassadors for Youth Award.\n\nAlexis has overcome many challenges along her journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their education, like Alexis, develop crucial skills and a  work ethic that will guide them for the rest of their…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690022/9999"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…Ricky Martinez  for earning the Arvada Wheat Ridge Service Ambassadors for Youth Award.\n\nRicky has overcome many challenges along his journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their education, like Ricky, develop crucial skills and a  work ethic that will guide them for the rest of their…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690401/recognizing-ricky-martinez"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…Jayden Cordic  for earning the Arvada Wheat Ridge Service Ambassadors for Youth Award.\n\nJayden has overcome many challenges along his journey to success,  demonstrating perseverance at every step. Students who strive to make  the most of their education, like Jayden, develop crucial skills and a  work ethic that will guide them for the rest of their…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691472/recognizing-jayden-cordic"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…the Nassau County Ocean, Highway & Port Authority.\n\nCarrol was a man who showed up, not just when it was easy but when it  was needed. He believed in faith, integrity, and perseverance. He loved  his family dearly. For 42 years, he stood side by side with his beloved  wife, Judy, raising their sons, Garrett and Greg. They also cherished  their granddaughter,…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694060/may-beam-continue-to-light-the-way"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…straight-set sweep of 25-20, 25-23,  and 27-25, capping an extraordinary 35-1 season. This victory wasn't  just a win on the court but the culmination of years of hard work,  perseverance, and belief.\n\nLed by veteran Coach Tom Peterson, who has now guided three different  programs to NCAA titles, the Knights embodied excellence in every  sense. Senior outside…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691982/recognizing-southern-virginia-universitys-ncaa-division-iii-mens-volleyball-national-championship-victory"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…school culture.\n\nMrs. Harvey also develops student athletes through her role as a  cross-country coach and helps young athletes to learn the importance of  lifelong skills of perseverance, teamwork, and resilience, while  leading them to excel in competition.\n\nFurthermore, as check-in and checkout coordinator, Mrs. Harvey  ensures the students have the structure…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Mark Amodei", "party": "Republican", "sentence": "…years, Gold Award  Girl Scouts demonstrate significant initiative, commitment, and  leadership, distinguishing them from their peers. Through their  resourcefulness and perseverance, they embody the Girl Scout Law to  truly make the world a better place.\n\nFaith McCrea created ``Emotions through Art,'' designed to help  students who experience anxiety…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691494/recognizing-faith-mccrea-gold-award"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…Atsma Family, who  have been named the 2025 Dairy Family of the Year by the Tulare Chamber  of Commerce.\n\nThe Atsma family's story is a remarkable example of hard work,  perseverance, and dedication to agriculture. George Atsma's father  initially immigrated from the Netherlands to Canada in 1953 at just 20  years old. After meeting his wife and welcoming…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698674/recognizing-the-atsma-family"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…[Whereas Douglass was a pioneer in journalism who broke       through glass ceilings throughout one of the most crucial       times in American history, exhibited great perseverance to       become an American hero, and became a legend known in the       House Press Gallery: Now, therefore, be it]\n\nWhereas Frederick Douglass was born to an enslaved…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692224/designating-the-house-press-gallery-in-the-united-states-capitol-as-the-frederick-douglass-press-gallery"}, {"senator": "Kat Cammack", "party": "Republican", "sentence": "…who shaped our  Nation, women like Abigail Adams, Harriet Tubman, and Clara Barton.  Their stories weren't just words in a textbook. They were testaments to  the power of perseverance, patriotism, and principle.\n\nHistory is not just simply about the past. It is about what we pass  on to the next generation. That is why the Smithsonian American Women's…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689364/womens-history-month"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…arm; and Ariana Jones,  with profound strength and courage, competed while mourning the recent  passing of her mother.\n\nThese young women embody the values of hard work, perseverance, and  grit. I am in awe of their determination and spirit. They have shown us  what true resilience looks like.\n\nWe are incredibly proud to have such talented and dedicated…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688401/congratulating-duchesne-high-school-girls-wrestling-team"}, {"senator": "David Rouzer", "party": "Republican", "sentence": "…achievement would not have been possible without the  steadfast leadership of Chairman John Lowery and generations of Lumbee.  Their voice has been heard, and their commitment and perseverance have  brought us to this historic moment.\n\nI commend and thank President Trump for his tremendous support, as  well as our current Senators Thom Tillis and Ted Budd, former…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698409/federal-recognition-for-lumbee-tribe"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…achieved a career in the field.  Today, she is the proud matriarch of a growing family that includes  seven grandchildren and fourteen great-grandchildren. Her legacy of  love, perseverance, and hard work continues to shine through them.\n\nMr. Speaker, Marjorie Curtiss is an exceptional woman who answered  the call to support her Nation in its darkest hour.…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690143/recognizing-marjorie-curtiss"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…will finally be recognized with a ceremony and the  presentation of a specially made championship trophy.\n\nThese remarkable women represent the best of our communities:  perseverance, teamwork, and pride that will stand the test of time.  Now, finally, they will have a victory cup to recognize their  significant achievement.\n\nMr. Speaker, I would also…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699649/recognizing-1984-walla-walla-high-school-girls-basketball-team"}, {"senator": "Morgan Luttrell", "party": "Republican", "sentence": "…inspiration not only to inspiring  athletes but to Americans who know the success that often comes when  the odds are stacked against them.\n\nWe salute Aaron's grit, his perseverance, and his example, and we  congratulate him on a well-earned victory.", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689821/congratulating-supercross-rider-aaron-plessinger"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…2024, they believed that the tumor showed  improvement. Unfortunately, she recently learned that she would have to  start chemotherapy all over again. Despite this, her perseverance and  her bright smile continue to light up the entire community.\n\nMr. Speaker, I ask that you join me in praying for Zariea during her  battle with this tumor.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698704/praying-for-zariea-patrick-of-harrison-high-school"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…into a vibrant  congregation rooted in service, tradition, and faith.\n\nThe sanctuary itself, built of native limestone in the Victorian  Gothic style, is a testament to the perseverance of its early leaders,  including Capt. A.H. Barnes, Dr. James Bierbower, W.T. Campbell, T.H.  Haynie, W.C. Price, and others whose dedication made possible the  construction…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696051/recognizing-the-150th-anniversary-of-st-marys-episcopal-church-in-lampasas-texas"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…Carolina, making her achievement even more meaningful for  our state and the Grand Strand community.\n\nTheir accomplishment reflects the best of American spirit, teamwork,  and perseverance. Competing at this level not only showcased their  skill but also provided invaluable experience playing alongside and  against some of the best athletes in the world.…", "date": "2025-10-28", "source_url": "https://justfacts.votesmart.org/public-statement/1696435/recognizing-izzy-soto-and-the-us-national-development-team"}]