[{"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…our cyber capabilities in a  comprehensive manner. Why?\n\nSince taking office, Elon Musk and DOGE have decimated cybersecurity,  CISA, our premier cybersecurity agency, with personnel cuts and stop  work orders.\n\nWhy would anyone do that?\n\nIn March, President Trump and Defense Secretary Pete Hegseth abruptly  ended U.S. cyber operations against Russia.…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691084/liberty-versus-dictatorship"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…the Commission set targets  for ensuring there are more than enough qualified individuals seeking  to serve in the Armed Forces, and it called for modernizing government  personnel systems to attract and enable Americans with critical skills  to enter public service. The Unity through Service Act would help to  implement those recommendations, providing…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689050/act-back-then-senate-armed-services-committee-chairman-john-mccain"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…all being done with the active participation of the U.S.  military. The U.S. military assets in place around Venezuela are, as  President Trump said, an armada, 16,000 U.S. personnel. This is open  source reporting as of 2 days ago, arrayed around Venezuela:\n\nThe USS Gerald R. Ford Carrier Strike Group: Carrier Air Wing 9, the  USS Winston Churchill,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699109/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…role, if any, the  administration's staff cuts to local and National Weather Service  stations played in this tragedy. It is now clear that the  administration fired key FEMA personnel during and, sadly, after the  tragedy. So, today, it is very clear: This is a systemic problem that  exists in Texas, extends beyond Texas, beyond the National Weather  Service,…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693517/central-texas-floods"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…inclusive, effective, and modern military.\n\nMoreover, the bill weakens the department by continuing the  administration's reckless and indiscriminate cuts to vital civilian  personnel and yielding to DOGE and Elon Musk.\n\nIn further conceding Congress' prerogative over funding the  Department of Defense to DOGE, the majority directs the Department to  find…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693648/department-of-defense-appropriations-act-2026"}, {"senator": "Sharice Davids", "party": "Democrat", "sentence": "…prevent this event  from ever happening again and ensure that aviation safety always  remains a top priority.\n\nWith regard to the investigation, we are grateful to the NTSB  personnel who are actively supporting the victims' families through the  agency's family assistance program. Family assistance is a critical  function of the NTSB and invaluable to…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688369/expressing-condolences-to-the-families-friends-and-loved-ones-of-the-victims-of-the-crash-of-american-eagle-flight-5342-and-pat-25"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…considers the  National Defense Authorization Act which has critical investments in  our national defense, including in Maryland. In my State, tens of  thousands of military personnel and civilians work at military  installations and in the defense sector, driving innovation and  research to advance our defense. The NDAA governs this work and  provides…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698254/nominations"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "Mr. Speaker, this week, we welcome thousands of law enforcement  personnel to Washington for National Police Week. We remember officers  who lost their lives in service to our communities and our country, and  we thank all officers who work to keep…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691030/expressing-support-for-local-law-enforcement-officers"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "…pay for.\n\nThat amount is nearly four times what Trump originally promised the  wall would cost, and it is ten times what the bill spends on Customs  and Border Protection personnel.\n\nThe ``One Big Ugly Bill'' allows the Homeland Security Department to  create a slush fund that will enable the worst impulses of the Trump  administration, like private…", "date": "2025-05-23", "source_url": "https://justfacts.votesmart.org/public-statement/1691679/one-big-beautiful-bill-act"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…build a  bomb? Had Iran begun the process of building the mechanism of a bomb?  Was there an imminent threat to the United States or our forces? What  were the threats to U.S. personnel and facilities in the region, should  Iran respond? How might Iran and its proxies escalate and harm U.S.  interests, not only in the region but here at home and in other…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693120/motion-to-discharge-sj-res-59"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…enforcement  agencies. I am grateful every day for the selfless service and  sacrifice that first responders, including our local police, fire  departments, and emergency personnel, provide to our communities every  day.\n\nThese requested funds will ensure that our officers and public safety  personnel have the resources that they need to carry out their…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698753/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "Mr. BLUMENTHAL. Mr. President, I was unable to vote on Executive  Calendar No. 81, Scott Kupor, of California, to be Director of the  Office of Personnel Management for a term of four years, due to my  participation at the Ukraine Recovery Conference in Rome, Italy, on  July 10, 2025. I am working with Senator Graham to build…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693523/vote-explanation"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…transported by Americans,  hidden in their cars and trucks. That is why I have supported--like  most of my colleagues in this body have supported--more money for  technology and personnel to better find these drugs before they enter  the United States. That is why I supported the border bill last year  that this President stopped because he wanted a political…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688447/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…after separation.\n\nFirst, this bill would allow a penalty-free withdrawal to make up the  gap between the interim payments a retiree receives during the period  the Office of Personnel Management is calculating the retiree's final  annuity and the estimated final annuity. A retiree's interim payment is  generally only 60 percent to 80 percent of the finalized…", "date": "2025-12-23", "source_url": "https://justfacts.votesmart.org/public-statement/1698468/introduction-of-the-thrift-savings-plan-emergency-withdrawal-act-of-2025"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…Space  Base Delta 2 is evident in every action she takes on their behalf.\n\nDuring her time at Buckley, Colonel Dexter has worked to bolster the  morale and well-being of the personnel under her charge. Her commitment  to creating a supportive environment does not go unnoticed and has  contributed to the readiness and effectiveness of the base.\n\nColonel…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693378/recognizing-colonel-heidi-dexter"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…1995 graduate of  Cleburne County High School.\n\nBersheba came to work for the City of Anniston in August of 2000 as  Clerk Typist. She moved up the ranks to Payroll Clerk, Personnel  Specialist, and finally Human Resources Director. Bersheba has  dedicated 25 years to the City of Anniston.\n\nShe is a member of the Alabama Association of Public Personnel…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697364/recognizing-the-retirement-of-bersheba-austin"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…don't care  about this question of censorship. I am telling you, Madam Chair, our  adversaries don't care about this question of the environment and the  ESA.\n\nIt exempts our personnel from ESA prohibitions during defense-related  operations. That is what is happening, even if incidental harm occurs,  because in the heat of preparation for real-world threats,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695254/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "James Risch", "party": "Republican", "sentence": "…and Test Equipment (STTE);       technical manuals and publications; new equipment training;       U.S. Government and contractor technical engineering,       logistics, and personnel services; and other related elements       of logistics and program support. The estimated total program       cost was $3.75 billion. Major Defense Equipment (MDE)…", "date": "2025-07-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694372/arms-sales-notification"}, {"senator": "James Risch", "party": "Republican", "sentence": "…GBU-39 Small Diameter Bombs; 11,500 FMU-139 Fuses;       11,500 FMU-143 Fuses; and 11,500 FMU-152 Fuses. Also included       were spare and repair parts, support equipment, personnel       training and training equipment, publications and technical       documentation, U.S. Government and contractor engineering and       technical support, and other related…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688394/arms-sales-notification"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…policies without giving its union bosses an  opportunity to negotiate, delaying needed cybersecurity updates.\n\nIn another example, union bosses threatened to block the Office of  Personnel Management from implementing basic IT security controls.\n\nThere is a troubling pattern where union bosses block measures that  they don't like, forgetting that they work…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697995/protect-americas-workforce-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…system support and software; classified and       unclassified software delivery and support; classified and       unclassified publications and technical documentation;       personnel training and training equipment; U.S. Government       and contractor engineering, technical, and logistics support       services; and other related elements of logistics…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695866/arms-sales-notification"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…Region, the       Nation, and the multiple countries who grieve for the       victims; and\n\n(4) commends the heroic actions of the first responders,       emergency services personnel, and all those who aided in the       recovery efforts in freezing waters.\n\nMr. MANN.  Res. 153.\n\nMr. Speaker, I rise today in support of H. Res. 153, which expresses  condolences…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688371/expressing-condolences-to-the-families-friends-and-loved-ones-of-the-victims-of-the-crash-of-american-eagle-flight-5342-and-pat-25"}, {"senator": "James Risch", "party": "Republican", "sentence": "…Missile Support Center support;       operator and maintenance support; test program set       development process support; publications and technical       documentation; personnel training and training equipment;       U.S. Government and contractor engineering, technical, and       logistics support services; studies and surveys;       transportation;…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699127/arms-sales-notification"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…Corps.  He reported to Marine Combat Training at the School of Infantry in Camp  Pendleton, California in 1996. After completing training at Camp  Pendleton, Timothy attended Personnel Administration School at Camp  Johnson, North Carolina where he earned the Military Occupational  Specialty (MOS) of 0151 Administrative Clerk.\n\nFollowing his training, Timothy…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693985/recognizing-united-states-marine-sergeant-major-timothy-babcock-as-august-2025-veteran-of-the-month"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…ready. Deterrence requires strength, and strength  requires sustained investment, which is exactly what this legislation  delivers.\n\nThis bill funds operations, maintenance, personnel, and procurement  across all branches of the military, ensuring that our servicemembers  have the tools, training, and resources they need to succeed in every  domain, including…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693544/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "James Risch", "party": "Republican", "sentence": "…transportation; wheeled vehicles and organizational       equipment; spare and repair parts; support equipment; tools       and test equipment; technical data and publications;       personnel training and training equipment; U.S. government       and contractor engineering, technical, and logistics support       services; and other related elements of logistics…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699550/arms-sales-notification"}, {"senator": "French Hill", "party": "Republican", "sentence": "…pilot program;\n\n(B) identification of the firms granted a license;\n\n(C) information on the operation of the pilot program,       including how long each license lasted and the personnel       needed to manage the pilot program;\n\n(D) information gleaned by the Office of Foreign Assets       Control from running the pilot program;\n\n(E) the utility of that…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693944/ofac-licensure-for-investigators-act"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…joining the ranks of the world's most  fearsome fighting force--the United States Army--guided by duty, honor,  and country.\n\nThe service and sacrifice of America's military personnel have  safeguarded our Nation since its inception, defending our way of life  from Lexington to Normandy.\n\nAnd throughout our history, American soldiers have demonstrated…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692755/congratulating-tyrone-miller"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…rise and       collapse as well as fall from grace of a once enthusiastic       recruit on a sacred national mission of accompanying Israeli       high-schoolers, military personnel, VIPs, and ordinary adult       tourists to Poland seeking a very brief exposure to a death       camp site. The heavy-laden theme is made bearable by a       genuine literary…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688281/international-holocaust-remembrance-day"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…critical  manpower and support to these Helene-affected areas. At the same time,  Clay County Emergency Medical Services coordinated efforts to deliver  much-needed medical personnel and essential supplies to communities in  need.\n\nThe Clay County Sheriff's Office and Emergency Medical Services were  flooded with donated supplies from area churches, local…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693201/recognizing-the-sheriffs-office-and-emergency-medical-services-of-clay-county"}]