[{"senator": "Norma Torres", "party": "Democrat", "sentence": "…September 24, 2025.\n\nMr. Drake was born on September 24, 1924. On June 6, 1942, he  enlisted in the United States Navy at the age of 17. He went on to  serve with distinction as a Petty Officer Second Class, participating  in several major campaigns, including the Atlantic Invasion of North  Africa and the pivotal battles of Iwo Jima and Okinawa in the Pacific…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694839/recognizing-jesse-drake"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…that doesn't involve invading a NATO ally. No, no, no. In no way  is this about national security or defending the Arctic. It is a cover  story.\n\nThis is about a thin-skinned, petty man throwing a global tantrum  because he didn't get the prize that he thinks he deserves. Through all  of this, barely a peep from most Republicans--not a whisper. Imagine…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699220/providing-for-consideration-of-hr-supporting-pregnant-and-parenting-women-and-families-act-providing-for-consideration-of-hr-pregnant-students-rights-act-and-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…civil servants do so much to boost our quality of life, and do  you know what? This administration doesn't care. For the first 100  days, they have been subjected to spiteful, petty attacks. They have  been caught in the crossfire of a political witch hunt. They have had  their lives disrupted by these abrupt and improper firings.\n\nMy State has felt a…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690300/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…and never doubt the power of the people to create  change.\n\nOur Cuba policy is on the wrong track. It is a throwback to the Cold  War. It is ineffective, and it makes us look petty and vindictive in  the eyes of the world community. We need to do much better.", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692909/do-not-forget-the-crisis-in-cuba"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…to enact retribution on places because  this administration wants to impose its view of law enforcement: deep  state authority not subject to judicial review.\n\nThe result of petty and punitive motives of this bill is that small  businesses will suffer. You would think that, when you offer support  for this President's tariff strategy, reckless as it…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692104/save-sba-from-sanctuary-cities-act-of-2025"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…ask my colleagues: What kind of man asks  for absolute fealty and bootlicking from the people around him?\n\nWhat kind of man asks people to lie for him?\n\nWhat kind of man is so petty that he can't admit obvious mistakes and  lies?\n\nWhat kind of man mocks veterans and then callously fires them from  jobs?\n\nWhat kind of man appeases and flatters our enemies?…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688349/collective-protection-of-our-ideals"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…and dignity of all, and he was assassinated  while serving in public office. His memory is worthy of dignity and  respect.\n\nRemoving his name from a ship is small and it is petty. It is  obviously an attempt to erase the history of anyone who shows  resistance to this administration. That is what autocrats and  authoritarians do.\n\nSince Secretary Hegseth…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692120/stop-renaming-ships"}, {"senator": "Thomas Suozzi", "party": "Democrat", "sentence": "…premiums  for people's health insurance are going to be skyrocketing because of  the expiration of the premium tax credits.\n\nWe have heard so much talk. We have heard so many petty partisan  messages, people attacking each other, but right now, we have to  actually do something about this issue.\n\nIn my district, if you are a family of four and make $130,000…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697961/healthcare-crisis"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…from Turkey. The Patriarch himself is often jeered and  threatened when he ventures outside his walled enclave. He is  periodically burned in effigy by Turkish chauvinists. Petty bureaucrats  take pleasure in harassing him, summoning him to their offices to  question him about irrelevant issues, blocking his efforts to make  repairs in the few buildings…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695407/welcoming-his-all-holiness-bartholomew-i-ecumenical-patriarch-of-constantinople"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…Tribal  sovereignty. It is a well-crafted bill. It is bipartisan. It is  noncontroversial. Someone in the White House has decided to use it as a  hostage to play politics, very petty and personal politics because of  score settling.\n\nThey have chosen to do that, but that doesn't mean that all of us  have to be used as pawns to advance that nastiness. This…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698657/miccosukee-reserved-area-amendments-act-veto-message-from-the-president-of-the-united-states"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…shield to protect the vulnerable.\n\nI am furious that, while millions of families struggle to afford  groceries, healthcare, rent, and basic necessities, this is the  vindictive, petty garbage that Republicans are using the people's House  to put to a vote.\n\nBanning healthcare for trans people cannot be justified by science.  Using the Federal Government…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698352/protect-childrens-innocence-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…US Ambassador, retired; Beth Jones, US Ambassador,       retired, Former Assistant Secretary of State; John Jones, US       Ambassador, retired; Denis Kaufman, Senior Chief Petty       Officer, US Navy, retired; Richard Kauzlarich, US Ambassador,       retired, Former Deputy Assistant Secretary of State.\n\nYvonne Keeler, Senior Intelligence Officer,…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691413/recognizing-assault-on-american-diplomacy"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "…that they can't  afford to buy a home, and that their paycheck just doesn't go as far as  it used to.\n\nWe need to be doing more to help families get by instead of focusing  on petty partisan politics. I have said over and over again my focus is  lower costs, more jobs, and a better quality of life for Oregonians and  that I will work with anyone to get…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688086/it-is-time-to-lower-costs"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "Mrs. McCLAIN. Mr. Speaker, I rise today with deep respect and  admiration to recognize the remarkable service of Radioman Petty  Officer 3rd Class Natale ``Nate'' Scarpelli, a proud veteran of the  United States Navy and our distinguished Veteran of the Month for  October 2025 from Michigan's 9th Congressional…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695850/recognizing-united-states-navy-radioman-petty-officer-3rd-class-natale-nate-john-scarpelli"}, {"senator": "Morgan Luttrell", "party": "Republican", "sentence": "…carry out the operations, a four-man reconnaissance team was  inserted into the rugged terrain under the cover of darkness. The team  consisted of Lieutenant Michael Murphy, Petty Officer Matthew Axelson,  Petty Officer Danny Dietz, and Petty Officer Marcus Luttrell. Their  mission was to observe and confirm the presence of Ahmad Shah.\n\nUnfortunately,…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692903/recognizing-the-20th-anniversary-of-operation-red-wings"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…I am disappointed because Congress gave the President authority to  impose tariffs in the event of a national security crisis. Congress did  not grant this power to pursue petty grudges against trusted neighbors.\n\nHonestly, how can anyone be angry with Canadians? They are the nicest  people in the world. Yet here they are, working with us, pleading…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688254/unanimous-consent-request-s-348"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…when responding to emergencies and disasters.\n\nThat fact was clearly demonstrated during the response to the tragic  flooding in Texas over the Fourth of July holiday weekend. Petty  Officer Scott Ruskan and the Rescue 6553 aircrew were first on the  scene at Camp Mystic, the historic girls' camp that was caught in the  catastrophic flooding, and helped…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "John Thune", "party": "Republican", "sentence": "…Democrat leader objected to his confirmation by voice  vote Monday, along with the confirmation of a Trump nominee who had  previously been nominated by President Biden, is petty partisanship-- petty partisanship that is well on its way to turning the Senate from a  legislative body into, in the words of the senior Democrat from  Minnesota, a ``full-time…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695295/rules-change"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "Mrs. McCLAIN. Mr. Speaker, I rise today to recognize Petty Officer  Second Class Katrina Gramer for her honorable service to the United  States Navy and her unwavering dedication to supporting our veteran  community. Her service in…", "date": "2026-02-20", "source_url": "https://justfacts.votesmart.org/public-statement/1700088/recognizing-united-states-navy-petty-officer-second-class-katrina-gramer"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Congress to sponsor them because they are hard.\n\nI will get lobbyists who will say mean things about me.\n\nSo let's keep just doing the shiny objects. Let's just keep doing the  petty around here. I think yesterday was the 14th time we have tried to  reprimand or censure a fellow Member. Let's just do more of that  because it gets great Twitter traffic,…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697051/facing-fiscal-reality"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…particular State or moment, but in service of democracy.\n\nDemocracy is a fragile flower, and around the world, people look to  what we do to know what they should do. There are petty, tin-pot  dictators, authoritarians, and strongmen around the world who will  watch this video and be encouraged and think this is the way to silence  their critics.\n\nI can't…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692447/alex-padilla"}, {"senator": "Tom Kean, Jr.", "party": "Republican", "sentence": "Mr. KEAN. Madam Speaker, I rise today to honor U.S. Coast Guard Petty  Officer Scott Ruskan, a native of Oxford, New Jersey, who displayed  extraordinary bravery during the devastating flooding in Kerr County,  Texas.\n\nOn his very first rescue…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693983/recognizing-uscg-petty-officer-scott-ruskan"}, {"senator": "John Thune", "party": "Republican", "sentence": "…dragging out nominations for Assistant Administrator for the  Office of Solid Waste and Director of the Office of Surface Mining  Reclamation and Enforcement was nothing more than petty politics-- because as we see with Venezuela and as we have seen with Presidential  nominations, Democrats are incapable of fairness or nuance when it  comes to President Trump.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699100/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Keith Self", "party": "Republican", "sentence": "…Mills, U.S. Army.\n\nMajor Gary Billings, U.S. Marine Corps.\n\nSecond Lieutenant Charles Neubecker, U.S. Army.\n\nMaster Sergeant Fernando Cruz, Jr., U.S. Marine Corps.\n\nSenior Chief Petty Officer Vincent Riggs, U.S. Navy.\n\nSenior Airman David Davis, U.S. Air Force.\n\nMajor Philip Shortino, U.S. Army.\n\nStaff Sergeant David DuBay, U.S. Air Force.\n\nSenior Airman…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696747/recognizing-veterans-in-texas-third-congressional-district"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…will remember this.\n\nMrs. McCLAIN. Mr. Speaker, I thank the gentleman for yielding  additional time.\n\nMr. Speaker, the American people will remember who held them hostage  for petty political reasons and who fought to put America first.\n\nNow that the shameful charade is over, House Republicans will  continue our work on behalf of the American people. We…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696724/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…healthcare industry. She has served her  community as a postpartum department unit clerk, an emergency  department unit clerk, and as office manager and receptionist for Dr.  Petty's Podiatry.\n\nBeyond her professional career, Lisa's dedication to civic engagement  has been extraordinary. She has been a volunteer with the Bowie County  Republican Party…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696870/recognizing-congressional-patriot-award-recipient-lisa-singleton"}, {"senator": "John Thune", "party": "Republican", "sentence": "…Democrat votes on final passage. So either Democrats are voting for  ``historically bad nominees'' or something else has been going on here.  That something else looks a lot like petty partisanship.\n\nIt became abundantly clear, a while ago, that the real reason  Democrats have been dragging out nominations for Assistant  Administrator of the Office of Solid…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698260/nominations"}, {"senator": "Kat Cammack", "party": "Republican", "sentence": "Mrs. CAMMACK. Mr. Speaker, I rise today to recognize and honor  Captain Steve Petty, a United States Army veteran, who was inducted  into the Florida Veterans Hall of Fame on November 5, 2025, for his  outstanding service, leadership, and unwavering commitment…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697107/recognizing-captain-steve-petty"}]