[{"senator": "Kweisi Mfume", "party": "Democrat", "sentence": "…in Prince George's County in 2001,  primarily prosecuting violent crimes, before transferring to Baltimore  City in 2004 and continuing in this position until 2006.\n\nThe next phase of his career was at the Department of Justice, as a  Trial Attorney in their Criminal Division. There, he focused on  tackling the scourge of organized crime, investigating…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688210/recognizing-a-trailblazing-career-in-criminal-justice-us-attorney-erek-lawrence-barron"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…the education of our children.\n\nNothing brings more money to the Treasury than the education of the  American people from early childhood through lifetime learning and  every phase of it in between.\n\nYou should be ashamed of yourselves to mock spending on education.  The best dollars we spend are on educating the American people and the  investments in…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693157/one-big-beautiful-bill-act"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…theft. If Congress truly wants to protect tipped workers, it       should pass the Raise the Wage Act, which would raise the       federal minimum wage floor and gradually phase out the       subminimum wage for tipped workers.      H.R. 4366, Save Local Business Act\n\nThe ``Save Local Business Act'' would ensure that trillion-      dollar corporations…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698964/tipped-employee-protection-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…(By Giulia Petroni)\n\nThe International Energy Agency slashed its forecast for       renewable energy capacity growth in the U.S. this decade,       citing the early phase-out of federal tax incentives and       regulatory shifts under the Trump administration.\n\nThe West's energy watchdog now expects the U.S. to add       nearly 250 gigawatts…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696127/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…the sidelines. I commend our servicemen for  their performance last weekend, but I am deeply concerned about the  Trump administration's lack of serious planning for the next phase.  That is why this War Powers Resolution is necessary.\n\nThe Constitution vests the power to authorize war in Congress, not  the President. President Trump has claimed this…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698780/venezuela"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…disease is  stabilized. Plasma exchange (a blood ``cleansing'' procedure) and high  dose intravenous immune globulins are often helpful to shorten the  course of GBS. The acute phase of GBS typically varies in length from a  few days to months. Patient care involves the coordinated  efforts of a team such as a neurologist, physiatrist (rehabilitation  physician),…", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691695/recognizing-may-2025-as-gbscidp-awareness-month"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…much Agencies are required to allocate for  these programs to maximize our innovation potential. I want to  strengthen our commercialization efforts through allowing direct to  phase II authority for all Agencies, as well as better data collection,  better training, and specifically designated commercialization  officers. I want to increase the number of…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698329/hr-5100"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "…historic victory by finally  implementing Medicaid expansion after a decade of political gridlock.\n\nMedicaid expansion has helped new moms and their babies during a  critical phase of life. It has supported older Americans living in  nursing homes. It has ensured that individuals with disabilities get  the care that they need.\n\nRepublicans want to roll…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690766/opposing-republican-budget-plan"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…Jack Markell. Through hard  work and dedicated investment, Seaford's Main Street has gone from 90  percent vacancy to more than 90 percent occupancy.\n\nAt the center of the next phase of Seaford's revitalization effort is  the Nylon Capital Center, a project that will breathe new life into a  space that was once a focal point of Seaford and  will soon serve…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689020/food-banks-facing-urgent-crisis"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…District of New Jersey will thank her for her efforts to  keep Middlesex County's greater environment safe, healthy, and thriving  for years to come. As she embarks on this new phase, Dorothy is joined  by her beloved two sons, husband, Alex Giamboi, two shih tzus, and  grandchildren.\n\nMr. Speaker, please join me on congratulating Dorothy Giamboi on her…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698050/recognizing-dorothy-giamboi-for-nearly-fifteen-years-of-public-service"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…who invited influencers to the White House and then passed out binders  about the soon-to-be-released client list suddenly changed their tune.  It clicked again yesterday when phase two of the binders came out, more  information released that has already been released. Mr. Speaker, 97  percent of it has already been released. It clicked when the same MAGA…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694886/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…workers  with disabilities.\n\nIn December, the previous administration, under President Biden's  leadership and the Department of Labor, released a proposed rule that  would phase out, as quickly as possible, subminimum wage certificates  which allow employers to legally pay workers with disabilities below  the Federal minimum wage. This was long, long…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695575/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…with the significant help of bipartisan efforts here in this U.S.  Congress. I am talking about the World Food Programme, about UNICEF,  about the Integrated Food Security Phase Classification, about Mercy  Corps, about Doctors Without Borders. All of these organizations have  documented the devastating starvation. So this is not a question of  whether…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695678/cloture-motion"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…financial and familial losses suffered by       pretrial detainees, there is a very real threat to physical       well-being. Nationally, pretrial detention is the riskiest       phase for in-custody deaths, and DC Jail is already unsafe.       Even before the recent wave of arrests by the current federal       executive branch, a report by the DC Auditor…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696958/opposition-letter-led-by-tzedek-dc-on-the-district-of-columbia-cash-bail-reform-act-of-2025-hr-november-2025"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…the reality of the  climate crisis and to accept the related reality of coal being the  biggest contributor to carbon pollution, and the entire world is  talking about how to phase down our dependence on coal pollution and  fossil fuel pollution, we are here in this alternate reality of the  Republican majority, where my colleague from Wyoming calls it…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696881/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…to banking.\n\nMr. Speaker, I especially thank Chairman Hill for including in this  legislation a version of my bill, the Promoting New Bank Formation Act,  which allows for a phase-in of capital requirements for new banks to  make it easier for de novo charters. We have seen a dearth and a  decline in de novo charters. The more community-based lenders,…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699809/lowering-housing-costs-and-advancing-main-street-community-banks"}, {"senator": "Andy Ogles", "party": "Republican", "sentence": "…to be  reported.\n\nMr. Chair, this is about accountability. We know that they are here  to steal our secrets. We know that they want to undermine us. As we go  into the next phase of warfare that is not just on the battlefield but  is cyber war and its capabilities therein, we know that China is  aggressive in these spaces. They are in our universities.…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689026/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…Olympics volunteer and a member of the National  Honor Society.\n\nI thank Lucas for his commitment to service and wish him the very  best of luck as he embarks on this exciting new phase of life at West  Point.                         Congratulating Bryony Shipe\n\nMr. THOMPSON of Pennsylvania. Mr. Speaker, I rise today to recognize  and congratulate Bryony Shipe…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691782/congratulating-lucas-gaston"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…who once protected our Nation but  returned home to uncertainty.\n\nBuilding on that success, Lisa led the charge for Victory II  Apartments, which opened in 2020. This second phase added 60 more  apartment homes dedicated to veterans and their families who earn at or  below 50 percent of this area's median income. These homes are designed  with dignity…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696802/recognizing-lisa-yanney-roskens"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…Secretary of the Treasury.\n\nDuring consideration of the One Big Beautiful Bill Act, I worked with  my colleagues to provide wind and solar an appropriate glidepath for  the orderly phase-out of the tax credits. Ultimately, Congress  enshrined in statute a 12-month transition period based on when  projects ``begin construction.''\n\nWhat it means for a project…", "date": "2025-08-01", "source_url": "https://justfacts.votesmart.org/public-statement/1694587/department-of-the-treasury-nominations"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…So President Trump is doing his best to help work to make Memphis  safe again.\n\nNow, we have had an FBI operation that has taken place in Memphis,  and this marks the next phase of what is a multipronged, multi-Agency  strategy to fight this crime.\n\nThis summer, the FBI, under Director Patel, conducted Operation Viper  in Memphis, and the FBI worked…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695666/cloture-motion"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…638(n)(1)(A)) is amended by striking ``through fiscal       year 2025'' and inserting ``though fiscal year 2026''.       SEC. 2. EXTENSION OF SBIR AND STTR PROGRAMS AND ACTIVITIES.\n\n(a) Phase Flexibility.--Section 9(cc) of the Small Business       Act (15 U.S.C. 638(cc)) is amended by striking ``through       2025'' and inserting ``through 2026''.\n\n(b) Commercialization…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695452/extension-of-sbir-and-sttr-authority"}, {"senator": "Nicole Malliotakis", "party": "Republican", "sentence": "…frequency of mail theft. I am encouraged by President Trump's executive  order last week titled, ``Modernizing Payments to and From America's  Bank Account,'' which intends to phase out most paper checks by  September of this year and modernize other government payment systems.\n\nI thank President Trump and Secretary Bessent for their quick and  decisive…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689293/recovery-of-stolen-checks-act"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…developed. Wind and solar now account for  17 percent of our electric generation.\n\nThe cost of these technologies has also dropped dramatically, and  this is the seventh reason to phase them out. Wind and solar  technologies have less overhead, longer lifespans, and higher profits  than they did when these credits were introduced nearly 30 years ago in  the…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690785/big-beautiful-bill"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…been that tax incentives intended to spur  fledgling industries shouldn't last longer than necessary. That is why  in 2015 I worked with both the wind and solar industries to phase out  their credits over a period of years. Unfortunately, the Democrats so- called Inflation Reduction Act reversed course and supercharged these  credits once more.\n\nAs part…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694089/one-big-beautiful-bill-act"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…have sympathy for people who came  here illegally.\n\nI think it is important that we educate the American public on that  because we are soon going to have to start the next phase where we not  only get rid of the criminal element that came in here, but we have to  get rid of the 10 million people who may not have broken a horrible law  but broke the…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690195/wisconsin-in-the-news"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…infrastructure required to homeport or station all       surface and aviation assets to be delivered as part of Level       1 or Level 2 acquisitions that have entered the obtain phase       as authorized under section 1132(b) of title 14, United       States Code.\n\n(2) Elements.--The report required under paragraph (1)       shall include--\n\n(A) a description…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…Jinping said that to President Trump and to President Biden.  Guess what. He never kept that agreement--ever.\n\nOf course, during the Trump administration--in the first term--the  phase one China deal was signed with all this fanfare in the East Room  of the White House--I was actually there when that happened--and they  never kept any of those commitments.…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690106/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…exemption.\n\nThe One Big Beautiful Bill Act reverses 4 long years of Biden's open- border policies with a generational investment in border security,  including funding to complete phase 2 of the border wall.\n\nThe One Big Beautiful Bill Act modernizes our Armed Forces for 21st  century threats by properly funding our military and funding the Golden  Dome.…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693210/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…applying for Federal       deposit insurance, Federal share insurance, or membership in       the Federal Reserve System.       SEC. 611. PROMOTING NEW BANK FORMATION.\n\n(a) Pilot Phase-in of Capital Standards.--The Federal       banking agencies may issue rules that provide for a 2-year       phase-in period for a qualifying community bank or its       depository…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}]