[{"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…transformation of American foreign policy from a force for good in the  world to a force for evil. Trump is aligning American foreign policy  with that of the Kremlin.\n\nAs analyst Phillips O'Brien has put it: ``The USA is now run by  gangsters who both want to ally with other gangsters and are using  threats of destruction and violence to get their way.''\n\nIn…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688107/marking-third-anniversary-of-unprovoked-russian-invasion-of-ukraine"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…ago the U.S. House of  Representatives--and the House Armed Services Committee--bid farewell  to one of its most invaluable, talented, professional staff experts:  Mr. John Phillips MacNaughton, Jr.\n\nAt the end of January, Phil, as he is known, completed 30 years of  public service to our Nation. That service began as a plebe entering  the U.S. Naval…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699522/9999"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Ambassador, retired; David Petri, Commander, US Navy,       retired; James Petti, US Ambassador, retired.\n\nAnnie Pforzheimer, Senior Foreign Service Officer, retired;       Randal Phillips, Senior Intelligence Officer, CIA, retired;       William Piekney, Senior Intelligence Officer, CIA, retired;       Steven Pifer, US Ambassador, retired; Michael Polt, US…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691413/recognizing-assault-on-american-diplomacy"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "Ms. CROCKETT. Mr. Speaker, I rise today to honor an exceptional  member of our community, Mr. Robert Phillips, the recipient of D  Magazine's Volunteer of the Year Award.\n\nFor more than two decades, Mr. Phillips has dedicated thousands of  hours to serving low-income families through…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695269/recognizing-the-work-of-robert-phillips"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…imposed by Gavin Newsom and the  California Legislature's supermajority.\n\nThe most recent news is that there are two refineries that are  closing operations in California: the Phillips 66 refinery in L.A. by  the end of 2025, and the Valero refinery by April 2026.\n\nAccording to a letter from Senate Minority Leader Brian Jones in  California, these two facilities…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…BROADCASTING; Pexton, Kenneth: VENTANA PRODUCTIONS; Peyton,       Michael: ABC NEWS; Phares, Kelly: FOX NEWS; Philhower, Kyle:       HEARST TELEVISION INC; Phillip, Abigail: CNN; Phillips,       Antaria: FOX NEWS; Phillips, Morgan: FOX NEWS; Phillips,       Tayler: CNN; Philpot, ElizaPearl: FOX NEWS; Phippen, Thomas:       FOX NEWS; Phrommayon, Annie: BBC;…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698150/members-entitled-to-admission-to-the-119th-congress-radio-and-television-correspondents-gallery"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…are not only learning about agriculture  but also taking initiative to serve their neighbors, strengthen their  school, and build a brighter future.\n\nLed by adviser Lynne Phillips and officers Harlie Brooks, Madison  Ballard, Bella Kaplan, Allie Englert, Camberlee Lockhart, Cadence  Flint, Alexis Clark, Silas Dutton, and Lex Flores, alongside all other…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696845/recognizing-50th-anniversary-of-opera-roanoke"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Matthew: Associated Press; Perry, Kati:       Washington Post; Perticone, Joseph: Bulwark; Peterson,       Kristina: Bloomberg News; Petit, Benoit: Agence France-      Presse; Phillips, Jimm: Communications Daily; Pickert, Reade:       Bloomberg News; Picket, Kerry: Washington Times; Pietsch,       Bryan: Bloomberg News.\n\nPigman, Alexander: Agence France-Presse;…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698132/members-entitled-to-admission-to-the-119th-congress-daily-press-gallery"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Jerry Phillips has made through his volunteerism  with the Area Agency on Aging of Pinellas and Pasco Counties. Jerry  Phillips began his journey with the SHINE program in 2013 and with…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690791/recognizing-jerry-phillips"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…through exactly what the bill does, I wanted to make  clear why this is so important for those of us in California.  California is seeing the closure of two of its refineries, Phillips 66  and Valero, which represent a significant chunk of our State's overall  refining capacity.\n\nNow, we already pay the highest gas prices of any State in the  country. We…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697101/highlighting-the-state-of-california"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…Kukatla, Martin Meister, Joshua Oh,       Simone Pulerwitz-Waisbord, Emily Shi, Michael Shi, Vaishnavi       Uppalapati, Chelsea Zhu\n\nMI: Swathi Jeeda, Griffin Maline, Patrick Phillips, Rakshan       Samynathan, Abigail Schafer, Ian Sim, Nisha Singhi\n\nMN: Alexander Allocco, Ellie Donnay, Thomas Hoffman,       Michael Luo\n\nMO: Nevinka Amarakone, Nethmi Amarakone,…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692400/congratulating-the-2025-congressional-award-gold-medalists"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…Magen Morris, Paramedic, Special       Events Administrative Supervisor, MedicWest, Las Vegas,       Nevada; Holly Nasello, Paramedic, Life Line, Prescott,       Arizona; Trey Phillips, Flight Nurse, Paramedic, Air Evac       Lifeteam, Snellville, Georgia; Rick Pringle, Paramedic, Field       Training Office, AMR Temple EMS, Temple, Texas; Julie Purick,…", "date": "2025-11-04", "source_url": "https://justfacts.votesmart.org/public-statement/1696510/recognizing-the-global-medical-response-2025-stars-of-life-award-recipients"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…producing  abundant gasoline at easily affordable prices. Mr. Latta said 14  refineries were left. His numbers are old. We are now down to  nine refineries, and two more of those, Phillips in southern California  and Valero in northern California, are closing by April. That will  leave us just seven refineries to serve the State.\n\nCalifornians already pay the…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697033/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Mr. Mike Phillips has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood victims, he helped coordinate…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691726/recognizing-mike-phillips"}, {"senator": "Keith Self", "party": "Republican", "sentence": "…Allen       TX; Sara Elizabeth Compton, Prosper TX; Bryce Tanner Denton,       Anna TX; Corbin Benzi Glass, Parker TX; Garrett Christopher       Hutchins, Lucas TX; Luke Tyler Phillips, McKinney TX; Timothy       Hunjae Seo, McKinney TX.                         u.s. merchant marine academy\n\nJack Quinlin Flannery, McKinney TX.                u.s. military…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692978/saluting-our-soldiers-of-tomorrow"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…BAUMGARTNER. Mr. Speaker, eastern Washington and Spokane are home  to many heroes and champions, but I would like to speak today of one  particularly exceptional young man, Brycen Phillips of Mt. Spokane High  School.\n\nBrycen was named a two-time U.S. Paralympics Track and Field High  School All-American, and he is somebody who has overcome tremendous  challenges.…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694110/recognizing-brycen-phillips"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…McConnell; but in addition:  Gabriella Armonda, Dylan Byrd, Rachel DaPieve, Laura Forrest, Abigail  Grace, Megan Handal, Cole Hodge, Brigid Kolish, Alexa Lorick, Ryan  Pettit, Todd Phillips, Kathryn Plunkett, Kim Segura, Tom Shaffer, and  Elise Stebick.\n\nIf I missed anyone, count it as my fault, not the staff who helped me  assemble that list and the following.…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699444/appropriations"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Ms. Tasha Phillips has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors and flood victims, she helped coordinate…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692158/recognizing-tasha-phillips"}]