[{"senator": "Ron Wyden", "party": "Democrat", "sentence": "…multiple phone companies and accessed vast  troves of sensitive call records. They even co-opted the system  designed for law enforcement to conduct wiretaps and accessed phone  calls of politicians and other high-value targets.\n\nVice President Vance said his communications and President Trump's  were compromised in this hack. The press reported that…", "date": "2025-07-28", "source_url": "https://justfacts.votesmart.org/public-statement/1694259/telecom-cybersecurity-transparency-act"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…postcrash  safety measures that the FAA, NTSB, and the military had agreed to, the  families spoke up. They stood at a press conference with Senator Cruz  and me. They made phone calls. They demanded better, and today, we are  closer to delivering on that and what they have asked for.\n\nThe ROTOR Act ends the exemption for planes to be in the airspace…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698319/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…disagrees with him, he immediately  calls upon the constituents of that Member to do what is necessary  within the law, generally speaking, to make sure that that Member gets  phone calls. He makes  sure that that Member is intimidated to the extent that that Member has  to reconsider whatever the disagreement was.\n\nThis is the President of the United States,…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697472/president-trump-is-a-threat-to-our-republic"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…prices on every single citizen  in this country.\n\nRetirement plans should be sacred. What just happened on Wall Street  made a whole lot of people nervous.\n\nWe got so many phone calls in our office. Not only are jobs at risk  but retirement savings are put at risk. Investments are put at risk.\n\nI spent too much of my time in this House and in this Chamber…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690052/trump-tariffs"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…Democratic Member for taking a phone call  from her constituent, Jeffrey Epstein, in the middle of a hearing, and,  of course, I don't think there is any rule here against taking phone  calls in a hearing.\n\nNow if you want to actually give her the chance to explain what  happened, then we would take it to the Ethics Committee. I still don't  see what the charge…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696885/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…doesn't  want divulged--to other financial institutions without your permission,  creating a so-called trigger lead. Then, as was pointed out, you become  bombarded with phone calls, text messages, and other communications  from rival mortgage loan officers. They may even give you misleading or  deceptive information.\n\nH.R. 2808 would curtail this abusive…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692804/homebuyers-privacy-protection-act"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "Mr. PADILLA. Mr. President, over the last few months, there has  literally been more than 10,000 Californians who have made it a point  to reach out to me by phone calls, by letters, by emails to say one  thing loud and clear: Stand up for public education.\n\nThere are students throughout California, teachers throughout  California, parents…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688250/nomination-of-linda-mcmahon"}, {"senator": "Sylvia Garcia", "party": "Democrat", "sentence": "…care.\n\nHowever, when they move outside the VA network, problems start to  pile up. Records don't transfer and systems don't update with the  latest data. That means more phone calls, more waiting, more back and  forth, more frustrations.\n\nWomen veterans and their families could be using this energy and time  on their treatment and their journey to recovery.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695418/women-veterans-cancer-care-coordination-act"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…us to find real solutions that put the American  people first.\n\nMs. RANDALL. The gentlewoman is right. I think all of us have been  receiving stories, texts, emails, and phone calls from neighbors,  friends, families, and constituents around the country who are impacted  by rising healthcare costs because of the decisions that Republican  leadership…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698673/protecting-healthcare-for-millions-of-americans"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…and homebound customers       who cannot use computers or come into an office--and       acknowledged that service levels will decline.\n\nIn the weeks before that briefing, phone calls to Social       Security surged--with questions from anxious customers       wondering whether their benefits had been or would be cut and       desperate to get an in-person…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689130/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…Congresswoman  Tlaib. The gentlewoman is absolutely right. Our constituents do, in  fact, deserve better.\n\nAs I go back to the district and I look at the emails and the phone  calls that are coming through, our constituents are asking: What are  you doing to defend me? What are you doing to protect the programs that  we depend on to stay alive? You…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689781/defending-social-services-and-programs"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…experience in this area.\n\nHomeland Security Secretary Noem put in place measures, cost-cutting  measures, that catastrophically impacted what the response was in this  situation. Phone calls were never answered. The day after this flood  happened, she canceled the contracts of the people who answer the phone  when you call for help. That is not the response…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693655/tragic-storms-in-texas"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…act as an ordinary       consumer would in attempting to make a successful       application. For example, if, during online applications,       we were directed to make phone calls to complete the       process, we acted as instructed.\n\nFor applications for plan year 2024, our covert tests       included fictitious applicants who provided invalid (i.e.,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698381/lower-health-care-premiums-for-all-americans-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…talked about doing talent-based immigration 2 nights ago,  talked about modernizing, using technology.\n\nWhen you call the IRS--their own auditor says only 31 percent of the  phone calls get answered. Why wouldn't you jump up immediately and say  we are going to use the latest version of an AI chat that sounds like a  person, that knows everything about…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688651/a-real-math-problem"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…delivered more than $6.1 million in Federal funding for nine excellent  community projects.\n\nMy office responded to more than 81,000 constituent letters, answered  nearly 8,000 phone calls, and closed nearly 1,600 constituent cases,  helping folks navigate the Federal agencies and Federal bureaucracy.\n\nThe most rewarding part of being a Representative is helping…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698682/recognizing-the-honorable-steny-hoyer"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…regarding forced organ harvesting from prisoners of       conscience in China.\n\nMultiple lines of evidence reviewed by the China Tribunal       over 12 months included undercover phone calls to Chinese       surgeons and officials who admitted that Falun Gong       practitioners' organs are available on demand. Other       undercover calls atso provided evidence…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690630/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…act as an ordinary consumer       would in attempting to make a successful application. For       example, if, during online applications, we were directed to       make phone calls to complete the process, we acted as       instructed.\n\nFor applications for plan year 2024, our covert tests       included fictitious applicants       who provided invalid…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698800/breaking-the-gridlock-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…is millions of taxpayers call the IRS for help. Two- thirds don't reach anyone. Think of this. The auditors of the IRS last  year put out a report that only 31 percent of phone calls were getting  answered at the IRS.\n\nFolks are trying to fill out a tax form and give the government  money. They call and call and can't get the phone answered. There was…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689025/tell-the-truth-about-math"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…do it  through policy, the adoption of technology, and the alignment of  incentives, and we can make the delivery of government services work.\n\nWhen only 31 percent of the phone calls at the IRS get answered, are  we doing our job? You do realize there is technology that would fix  that, but that would anger the union of the government employees there.…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691518/truth-telling-with-math-and-facts"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…when a human answered the phone.\n\nMaybe we should stop being scared of adopting the technology because,  remember, last year's taxpayer audit said only 31 percent of the phone  calls to the IRS were getting answered, yet the IRS union attacks you  for saying maybe we could use technology.\n\nOh, we can't do that.\n\nWell, now we have the survey data that…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692327/math-always-wins"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…time to ensure that our Party's message is heard  and that our candidates have the support they need to succeed.\n\nCam has set records in the State of Michigan for the most phone calls  made in support of Republican candidates, an achievement that  demonstrates not only her dedication, but also her determination to  connect with voters and strengthen our…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695818/recognizing-ms-camilla-cam-williams-for-her-dedicated-service-to-the-republican-party"}]