[{"senator": "Joe Morelle", "party": "Democrat", "sentence": "…Wisconsin, I would like to remind him  that an estimated 165,000 women in his district in Wisconsin have a  different name on their birth certificate than is on their current  photo ID. Under the SAVE Act, these women could not register  using their birth certificate alone. Roughly 340,000 residents in  Wisconsin's First District lack a passport, so the…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690001/safeguard-american-voter-eligibility-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…This would be done via       strict voter identification laws--requiring, for example,       that voters present a valid driver's license or other       government-issued photo ID upon arrival at the polling       station.\n\nThe push for voter ID laws was based on a false claim: that       voter fraud is widespread in the [U.S.] All reputable studies…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…and only two things. By the  way, these are things that we already do in Florida today, and we don't  have issues with our elections.\n\nNumber one, it says you have to show a photo ID in order to vote.  This is something that people overwhelmingly support because we have to  do it in every aspect of our lives.\n\nSecond, it says you should have to prove you…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700011/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…citizens. This legislation will ensure that  voter registration systems accurately reflect the law and that  citizenship requirements are consistently enforced.\n\nBy requiring a photo ID in Federal elections, this congressional  action will work to prevent fraud before it even starts. Supporting the  SAVE America Act means promising every voter that their…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699851/us-elections-are-for-us-citizens"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…The survival of our constitutional Republic  relies on free, fair, and secure elections.\n\nThankfully, this legislation bolsters election integrity by requiring  a government photo ID to vote, requiring proof of U.S. citizenship to  register to vote, and directing States to remove noncitizens from  existing voter rolls.\n\nThese are not controversial issues.…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699940/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…can assure my colleagues that we are, even  if we get married.\n\nThe SAVE America Act requires individuals to provide documented proof  of U.S. citizenship along with a valid photo ID when registering to  vote. This commonsense legislation strengthens election integrity  through practical measures, including voter ID requirements and  safeguards to prevent…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700005/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "David McCormick", "party": "Republican", "sentence": "…three critical things.\n\nFirst, it prevents noncitizens from voting by requiring people to  show proof of citizenship when registering to vote and to show a  government-issued photo ID when casting a ballot.\n\nSecond, it directs the States to remove noncitizens from their voter  rolls by mandating regular reviews of those lists and giving States the  abilities…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700069/9999"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…United States Capital of  Washington, D.C., for simply 30 days, could walk out of the embassy,  walk to a polling location and, because Washington, D.C., does not even  have photo ID, would not need to pull their Russian passport out of  their pocket and would be eligible to vote for Mayor in our Nation's  Capital.\n\nWhat the Democrats want to do, Mr. Speaker,…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692319/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…data-oriented individual, so let us  review the numbers before us as we debate this legislation.\n\nMr. Speaker, 83 percent of Americans favor requiring a government- issued photo ID in order to cast a ballot. By party, 95 percent of  Republicans favor requiring photo ID to vote, and 71 percent of  Democrats, the party across the aisle, favor requiring…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699936/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…are not  supposed to be there, just by requiring a picture ID.\n\nAmericans have been asked about this. An overwhelming 83 percent of  Americans are in favor of requiring a photo ID to vote. That is not  Republicans. That is all across the spectrum. Over 70 percent of  Democrats support picture ID, 82 percent of Hispanic Americans support  picture ID…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700016/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…elections. You will hear  arguments about it is burdensome.\n\nMr. Speaker, I think it is absurd that we are protecting beer more  than we are protecting ballots. You have to show a photo ID when you go  in to buy a six-pack of beer. You should have to go in and show that  you are a U.S. citizen when you register to vote. It is just that  simple.\n\nI remind my…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690007/safeguard-american-voter-eligibility-act"}, {"senator": "Gary Palmer", "party": "Republican", "sentence": "…only 13  States do not require any form of voter ID. Having this requirement  should be the standard and not the exception.\n\nMy Democratic colleagues claim that requiring a photo ID to vote is  too burdensome. Some say it is too difficult for rural Americans and  will lead to voter suppression. I grew up in rural America.\n\nThe reality is that Americans…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699945/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Mary Miller", "party": "Republican", "sentence": "…American elections. This should be  the easiest ``yes'' vote this year.\n\nThe American people want the SAVE America Act. Mr. Speaker, 83  percent of adults support requiring a photo ID to vote, as do 73  percent of Democrat voters.\n\nDemocrat politicians standing here today oppose it, just as they have  opposed every election integrity measure.\n\nDemocrats…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700002/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…SAVE America Act becomes the law of the land, three simple  things will be true:\n\nNumber one, everyone who shows up to vote in a Federal election will  have to show their photo ID.\n\nNumber two, States will only register American citizens to vote in  Federal elections.\n\nNumber three, States will actually have to remove noncitizens from  the voter rolls.…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700014/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…this country with illegal  immigrants--and by the way, you shouldn't have to prove you are an  American citizen to vote. That is their position. You shouldn't have to  show photo ID, which is broadly supported even among Democrat voters.  Why? Why would they do that? Even though their voters don't want that,  even though their voters want photo ID to…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700065/9999"}]