[{"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "Mrs. GRIJALVA. Mr. Speaker, today, while Kristi Noem staged yet  another photo op, this time in Nogales, Arizona, families across this  country are still grieving people who should be alive.\n\nLet's be clear: Border communities are not war zones. Border…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699657/horrific-ice-abuses"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…depiction of  sexually explicit conduct does not automatically violate the statute.  To obtain a conviction for production of CSAM in the Seventh Circuit,  the child in the photo, video, or image must themselves be engaged in  the explicit conduct.\n\nThis is an absurd reading that we can and must legislatively resolve.  The Howard ruling undermines the…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698895/child-predators-accountability-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…history. Institutions such as the Toledo-Lucas  County Public Library, the National Museum of the Great Lakes, and the  Liberty Aviation Museum in Port Clinton, Ohio, where this photo was  taken, have preserved their stories, ensuring that future generations  will remember their courage and their sacrifice.\n\nThese men were not just warriors in the sky. They…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687895/black-history-month"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…later on censured, censured but not  silenced. Yes, I stand today where I stood then. Censured but not  silent I stand today where I stood then. It is best captured in this  photo that depicts what occurred: censured not silenced.\n\nSo I stand today where I stood then, and I stand today where I stood  then because there is a CR that has been brought before…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695807/censured-but-not-silenced"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…Wisconsin, I would like to remind him  that an estimated 165,000 women in his district in Wisconsin have a  different name on their birth certificate than is on their current  photo ID. Under the SAVE Act, these women could not register  using their birth certificate alone. Roughly 340,000 residents in  Wisconsin's First District lack a passport, so the…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690001/safeguard-american-voter-eligibility-act"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…bill that would throw their constituents under the bus, a  bill that flies in the face of everything they claim to stand for, all  because Donald Trump wants a bill-signing photo op by the Fourth of  July.\n\nMy Republican colleagues know that this bill will cost 17 million  Americans their health insurance. They know that nursing homes in their  own…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693238/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…claims will ``almost  immediately'' bring down the costs of prescription drugs. Americans  should hold their applause because Donald Trump's announcement is  little more than a photo op masquerading at reform, just as he said he  would bring down costs on day one, and it didn't happen--the same thing  here. ``Almost immediately''? Give me a break.\n\nIn case…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690954/prescription-drugs"}, {"senator": "Mark Pocan", "party": "Democrat", "sentence": "…civilian  casualties and using starvation as a weapon.\n\nNo weapons should be sent from the United States to Israel that could  be used against the people of Gaza. Instead of photo ops with Benjamin  Netanyahu, it is time for condemnation. Help facilitate the serving of  an arrest warrant from the ICC to him.\n\nLet's make him the international pariah he…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695067/condemning-benjamin-netanyahu"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…photograph.  It was the same agent who had previously kept coming in and out of my  room, and I had to tell him repeatedly to leave. It still haunts me  that this agent has my photo on his phone.'' She was stopped and shot.  The bullets caused her to bleed profusely. The wounds caused her almost  to bleed to death.\n\nThe agent who shot her seven times--seven…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699650/9999"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…get a picture of what a  safe American looks like, what a nondeportable American looks like?\n\nThat is because I want to know. I want to be able to share that  picture and that photo with my constituents to say: So if you look like  this, if you are maybe this shape, if you have this degree of melanin,  if this is the color of your hair, or this is the…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690637/trumps-first-100-days"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…Mr. Speaker, and still I rise, and still I rise,  a proud, unbought, unbossed, liberated Democrat.\n\nAnd still I rise, censured but not silenced. It is important to have  this photo tonight because it will get us into some very important  issues.\n\nThis was the occasion when I stood before the President as he stood  behind me giving a statement at a joint…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697060/no-mandate-to-cut-medicaid"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "Mr. GARAMENDI. Mr. Speaker, I thank the gentleman for yielding. I  look at the photo and say, Doug, for 12 years, you and I represented  the Sacramento River. We developed a friendship based upon the working  part, but mostly upon sharing, sharing things. We…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698742/9999"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…itself: Do we still  prefer democracy over tyranny?\n\nAnd as we face the 250th anniversary of the Nation's birth, we are  confronted with that.\n\nI have handed my colleague a photo. I had hoped to have it on a  poster, but the photo was taken today, and I didn't have time to turn  it into a poster. But I want to ask my colleague from Oregon to  describe…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696334/trump-administration"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…sharing of intimate images  online, one of the most significant harms proliferating on the internet  in recent years.\n\nAdvances in generative artificial intelligence and other photo  manipulation software have enabled the creation of digital forgeries  that place victims in sexually explicit situations that never actually  occurred but can still cause…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690185/tools-to-address-known-exploitation-by-immobilizing-technological-deepfakes-on-websites-and-networks-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "Ms. KAPTUR. Mr. Speaker, I rise to share the latest photo of the  founding of another billionaire private club here in Washington, D.C.,  in Georgetown, for the superrich, spearheaded by Donald Trump, Jr.; JD  Vance; and their billionaire…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690166/executive-branch-club"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…The survival of our constitutional Republic  relies on free, fair, and secure elections.\n\nThankfully, this legislation bolsters election integrity by requiring  a government photo ID to vote, requiring proof of U.S. citizenship to  register to vote, and directing States to remove noncitizens from  existing voter rolls.\n\nThese are not controversial issues.…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699940/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Agence France-Presse; Georges, Salwan: Washington Post;       Gordon, Annabelle: Freelance; Grant, Matthew: Press       Photographers' Gallery; Gripas, Yuri: AbacaPress Photo       Agency; Gromelski, Joseph: Freelance; Gruber, Jack: USA       Today; Gunes, Celal: Anadolu Agency; Gupta, Avijit: U.S. News       & World Report; Gutman, Caroline: Freelance;…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698154/members-entitled-to-admission-to-the-119th-congress-press-photographers-gallery"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…Do  you really have to be Sherlock Holmes to figure this out? This is a  missile in Iran. In Hebrew, it says: ``Death to Israel.'' This is the  freaking missile they took a photo of in Hebrew that said ``Death to  Israel.'' I wonder what they want to do with that missile.\n\nIf you are confused about this regime, you should not be allowed to  drive because…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692780/iran"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…one  of the most consequential pieces of legislation concerning election  integrity in our country's history. S. 1383, the SAVE America Act, will  require voters to present photo identification to vote in Federal  elections and to provide proof of U.S. citizenship when registering to  vote.\n\nPublic opinion overwhelmingly supports this legislation, and…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699936/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…this country with illegal  immigrants--and by the way, you shouldn't have to prove you are an  American citizen to vote. That is their position. You shouldn't have to  show photo ID, which is broadly supported even among Democrat voters.  Why? Why would they do that? Even though their voters don't want that,  even though their voters want photo ID to…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700065/9999"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…elections. You will hear  arguments about it is burdensome.\n\nMr. Speaker, I think it is absurd that we are protecting beer more  than we are protecting ballots. You have to show a photo ID when you go  in to buy a six-pack of beer. You should have to go in and show that  you are a U.S. citizen when you register to vote. It is just that  simple.\n\nI remind my…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690007/safeguard-american-voter-eligibility-act"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…can assure my colleagues that we are, even  if we get married.\n\nThe SAVE America Act requires individuals to provide documented proof  of U.S. citizenship along with a valid photo ID when registering to  vote. This commonsense legislation strengthens election integrity  through practical measures, including voter ID requirements and  safeguards to prevent…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700005/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…that an individual registers to vote.\n\nWe should also be showing voter ID when we go to vote. This is a  commonsense principle. The American people know that they need to show  photo identification when they board an airplane, open a bank account,  or buy a six-pack of beer.\n\nI am often reminded of a debate we had at committee, and then I flew  home to…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700014/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…and only two things. By the  way, these are things that we already do in Florida today, and we don't  have issues with our elections.\n\nNumber one, it says you have to show a photo ID in order to vote.  This is something that people overwhelmingly support because we have to  do it in every aspect of our lives.\n\nSecond, it says you should have to prove…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700011/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Mary Miller", "party": "Republican", "sentence": "…American elections. This should be  the easiest ``yes'' vote this year.\n\nThe American people want the SAVE America Act. Mr. Speaker, 83  percent of adults support requiring a photo ID to vote, as do 73  percent of Democrat voters.\n\nDemocrat politicians standing here today oppose it, just as they have  opposed every election integrity measure.\n\nDemocrats…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700002/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…or is each child valuable?\n\nI am going to stand with the marchers that are coming in next week to  joyfully celebrate the beauty of every child.\n\nYesterday, I was emailed the photo of a longtime friend of mine who  just had her first child. It has been a long process for her and her  husband. I got a beautiful picture of baby Benjamin yesterday, and he…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699097/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…and simple.  If you stand shoulder to shoulder with MS-13, Tren de Aragua, and  Sinaloa Cartel, and the dictators who work hand in hand with them, like  Nicolas Maduro in this photo, then this resolution is for you. Vote for  it.\n\nWe know exactly where some of my colleagues stand. You can look to  see where they stand in this photo. Let's talk a little…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698249/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Senate passed S. 2125 on August 9, 1984. Following       House passage, President Reagan signed the bill into law on       October 19, 1984 (PL 98-508).\n\nI'll conclude with this photo taken on May 7, 1984, of       Senator Tower sitting in his office in the Russell Senate       Office Building reviewing Bill Coleman and Susan Morrison's       beautifully…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691095/flatside-wilderness-additions-act"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…they are not  supposed to be there, just by requiring a picture ID.\n\nAmericans have been asked about this. An overwhelming 83 percent of  Americans are in favor of requiring a photo ID to vote. That is not  Republicans. That is all across the spectrum. Over 70 percent of  Democrats support picture ID, 82 percent of Hispanic Americans support  picture ID…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700016/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…United States Capital of  Washington, D.C., for simply 30 days, could walk out of the embassy,  walk to a polling location and, because Washington, D.C., does not even  have photo ID, would not need to pull their Russian passport out of  their pocket and would be eligible to vote for Mayor in our Nation's  Capital.\n\nWhat the Democrats want to do, Mr.…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692319/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}]