[{"senator": "Alex Padilla", "party": "Democrat", "sentence": "…that they are  acknowledging I, too, share that frustration. But I also can't believe  we can't create a scenario where the Senate completely cedes to the  House the ability to pick and choose which public lands bills are  allowed to be sent to the White House.\n\nRegardless of who is in the majority, the process has historically  been both bicameral and…", "date": "2026-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1700284/cape-fox-land-entitlement-finalization-act-of-2025"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…issue  stablecoins and amass consumer data at the same time we are gutting the  Consumer Financial Protection Bureau, which protects consumers.\n\nIt allows issuers to cherry-pick the lightest-touch regulator between  the Federal Government and any of the 50 States.\n\nRather than fixing the problems created when Silicon Valley Bank  collapsed, it makes…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693832/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…she got home one Friday  night and saw on her computer ``You are RIF'd''--which means you are  fired--with no reason why and not even a chance to come back into the  office to pick up her mementos she had there--pictures of her loved  ones.\n\nDonald Trump likes to pretend that he cares about our armed services  members and veterans, but actions speak louder…", "date": "2025-07-08", "source_url": "https://justfacts.votesmart.org/public-statement/1693277/veterans-administration"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…They own their own small businesses, they own their own homes,  and yet we cannot regularize their status. We support Dreamers.\n\nWe are in support of farmworkers. They have to pick the crops and the  fruits that come to our dinner table, and many of them are staying home  in fear of being deported. Mr. Speaker, you can expect food prices to  go up.\n\nOf…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688134/republican-budget-betrayal"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "…farm eco-friendly.       ``We're lowering the amount of costs we're putting in,''       Lesko said. ``We're lowering the amount of transportation for       things we need to pick up. We're letting the natural cycle do       its thing and kind of working alongside it.'' But for       Guerrero, it's starting to plant the seeds for the next       generation.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695344/recognizing-kyla-guerrero-for-her-impressive-gold-award-project"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…price hikes, and veterans  will see their future healthcare funding for toxic exposures put in  jeopardy, all so billionaires can keep getting huge tax breaks.\n\nIt is hard to pick between the worst moral outrages behind this bill.  Was it covering up for Epstein's best friend for nearly 2 months just  so Republicans could vacation and avoid negotiating…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696741/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…to misdemeanors.\n\nThis isn't a hypothetical for me. When I was the State's attorney in  Prince George's County, we actually had one of these. We had several,  but I will just pick one for purposes of time. A police officer saw a  stolen motorcycle zip down the beltway and decided to pursue it.  Stealing a motorcycle is a misdemeanor and speeding is a…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695639/district-of-columbia-policing-protection-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…shows the consequences of picking an inexperienced FOX News host to  lead a massively complex life-or-death Federal Agency. Donald Trump is  learning it the hard way: If you pick a FOX News cable host to lead the  largest, most complicated Federal Agency of all, you get burnt, and  Hegseth is just way beyond what anyone would imagine in how bad he is…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697368/trump-administration"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…Only Democrats  raised their hand.\n\nI also have to ask when our loved ones and when our friends and  family members go overseas and they get snatched, are Republicans going  to pick up the phone and ask to have their constituents brought back?\n\nAre they going to fight for them?\n\nThat is because in that Committee, they said that they were not going  to.…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690637/trumps-first-100-days"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…doing the work? How about we trust the plan participants,  the workers, and the retirees? Anyone who has a 401(k) or an IRA will  tell you that they can go on the website and pick from a range of  different plans based on what they think is a good idea for them. Why  don't we trust them instead of trusting bureaucrats and political  appointees to make…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699159/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…trafficking to be classified and treated as  criminals. I am pleased to support this essential and thoughtful  bipartisan bill, and I urge my colleagues to support it.\n\nMr. Speaker, I pick up on the words of the distinguished gentlewoman  from Georgia, who is the ranking member of the Crime and Federal  Government Surveillance Subcommittee on Committee on the…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697181/trafficking-survivors-relief-act"}, {"senator": "Kirsten Gillibrand", "party": "Democrat", "sentence": "…Republican and Democratic members of the Senate  Banking Committee.\n\nThe strong bipartisan nature of this effort has been demonstrated by  the fact that the bill has continued to pick up new support with each  additional vote.\n\nI am very grateful Senator Hagerty is here. Together, we had a very  strong bipartisan working relationship. If you could see a document…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692380/9999"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "Ms. DEXTER. Mr. Speaker, back-to-school season should be a time of  excitement, a time when families pick out backpacks, meet teachers, and  look ahead to a year of learning and growth.\n\nHowever, for the Merlos family, a Portland family, homeowners,  businessowners, and vital members…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694771/toward-a-more-dignified-and-just-immigration-system"}, {"senator": "Doris Matsui", "party": "Democrat", "sentence": "…go from $175 to  $400 a month, a fifth of her monthly wages. She is a college student  who relies on her insurance for mental health care. She wrote to me: I  don't want to pick between my dream, mental health, and food.\n\nWhat does this bill do for her? Nothing. I know Republicans are  getting similar calls. Yet, instead of caring about the millions…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698364/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…Federal receivership, over an academic department  that houses professors who are critical of Trump and his policies.  Effectively, the President of the United States got to pick the person  who will oversee the Columbia Department of Middle East, South Asian  and African Studies as well as the Center for Palestine Studies. That  is extraordinary. That…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690111/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…are just starting out with children and have a big  mortgage. We should look out for the average guy at a time when they  are most desperate.\n\nSome people would say my second pick would be to reduce the marginal  tax rate on the most technical manufactured goods because we want those  goods to be made here in America, and it would be great to have those…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691493/new-tax-cuts"}, {"senator": "Gary Palmer", "party": "Republican", "sentence": "…I hope that people who don't have a photo ID don't get sick because  they need a photo ID to purchase things like Sudafed, NyQuil, and  Mucinex D. I hope they don't have to pick up a package at the post  office because we have to have a photo ID to pick up a package at the  post office.\n\nIf we require a photo ID to prevent fraud in these areas I just…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699945/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Gary Palmer", "party": "Republican", "sentence": "…stovetops.\n\nThis would allow future Democratic administrations to restart their  party's regulatory attack on our home appliances. I know that when the  government steps in to pick winners and losers there are manufacturers  of competing products that would profit.\n\nIt is amazing to me that my Democratic colleagues claim that a United  States-based company…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688292/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "Mrs. BLACKBURN. Mr. President, yesterday did indeed mark the 100th  day of President Trump's second term, and I think, if you were to pick  four words that really describe his first 100 days, it would be  promises were made, and promises are being kept. That is precisely what  he has done.\n\nIf you want to go through…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690548/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…the words of this resolution. It is not a secret. Anybody can read  it.\n\nThe President doesn't have the authority to combat MS-13, Tren de  Aragua, Sinaloa Cartel, take your pick. If the President says they are  terrorists, and they are in the Western Hemisphere, the President can't  touch them.\n\nThat is what they are trying to do. They want to tie his…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698249/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…and which trucks are acceptable and which are not.  If Americans want to drive an electric or a hybrid car, that is fine.  However, the government--the government--should not pick winners and  losers in the vehicle marketplace. I believe in the power of America's  free markets, and I believe we should allow the markets to determine  the viability of clean…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691668/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…more than I will ever know. When I run into a problem  on my farm, he is the first person I call. Whether it is with deer or  turkey or anything else, he is always quick to pick up my call.\n\nAndy will spend his retirement days doing what he loves best:  spending time outdoors with his beautiful wife, Mary Jo; his son,  Wyatt; and his daughter, Emily.…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700233/congratulating-andy-collins-on-his-retirement"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…it to communicate with veterans via text message. Right  now, VA is only able to reach out to veterans in Solid Start by calling  them. While the older generation of veterans pick up the phone, the VA  Solid Start program has seen a concerning drop-off among younger  veterans. This bill would bridge the gap in communication.\n\nMadam Speaker, I thank Representative…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695438/delivering-digitally-to-our-veterans-act-of-2025"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…tree that I picked up that day is now in my living  room, and I will be enjoying it until January.\n\nI thank the Fairchild family for such an enjoyable visit and for  helping me pick out a tree of my own. I look forward to stopping in  again to see all of them in the future. May God continue to bless them  and may He bless our country with a very happy and…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697374/fun-with-math"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…imagine that? I have had  it since I was a teenager. I take a calcium inhibitor. It lowers my  blood pressure. Hopefully, I don't pop an aneurysm, but every 90 days,  I have to pick up the phone to renew a doctor's prescription or go  visit the doctor, even though it is the same prescription I have had  for decades.\n\nUtah just created AI that will take…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698698/congress-is-a-math-free-zone"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…problem requiring ID to board a  plane, buy a six-pack, drive a car, or even adopt a pet. Just a few  years ago, they demanded proof of vaccination just to eat at a  restaurant or pick up food.\n\nWhen it comes to the most sacred act in our Republic, voting, they  fight tooth and nail against requiring proof of citizenship. Why? It is  blatant hypocrisy, and…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689398/supporting-american-elections"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…bureaucracy in the Federal Government. It  turns out the union loses its mind when we start talking about  technology to take care of the American people. Wouldn't we like to  pick up the phone and call, whether it be the Social Security  Administration or the IRS, and get the phone answered?\n\nHow do I get my brothers and sisters here to help us adopt…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689025/tell-the-truth-about-math"}, {"senator": "French Hill", "party": "Republican", "sentence": "…have joined them, but was attending the funeral       of his Mother. These hearings would be followed by a second       set of hearings in Washington in April 1984.\n\nSo, let's pick up the ``back story'' as to the role of a       conservative Texas Republican in this wilderness saga. On       February 7, 1984, the week before Little Rock hearings, I…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691095/flatside-wilderness-additions-act"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…facilitate the passage of historic legislation, just as our colleagues  did when they were in charge.\n\nMr. Speaker, our friends on the other side of the aisle, they love to  cherry-pick the facts when it comes to the timing of committee  proceedings, especially in reference to the Rules Committee's upcoming  meeting. They bemoan the late start and the timing…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691514/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Ron Johnson", "party": "Republican", "sentence": "…really good place  right now. We tried to think of everything. No Federal employee would  be excluded from this.\n\nThe Senator from Michigan says my bill allows the President to pick  and choose. That is total hogwash. Again, every Federal employee,  including contractors, gets paid. There is no picking and choosing.  That is completely false. Money transfers?…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696605/9999"}]