[{"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…Congressional District.\n\nSince this administration is also rescinding Federal funds for  economic development projects that are approved and signed into law and  when the OMB is picking and choosing how appropriations laws are  implemented, they are right to be concerned.\n\nThis meeting has filled me with a renewed sense of optimism for the  days ahead, for…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695393/recognizing-more-action-for-students-organization"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…farmworkers in my district. What happened? One day, we are going about  our business in Santa Ana, Orange County, masked Federal agents start  going into our neighborhoods, picking up hardworking neighbors. Oh,  yeah, you bet, people were concerned, scared, and nervous.\n\nA lot of people expressed their First Amendment rights. We got the  National Guard.…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693145/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…someone is  arrested. In fact, the Federal Government is notified every single time  an individual is booked into a jail or prison. This means nothing is  preventing ICE from picking up individuals when they are released from  custody.\n\nBut instead of prioritizing picking up the dangerous, violent  criminals they talk so much about, what is ICE doing instead?…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700066/9999"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…innovations that help lower utility costs  and allow Americans to live better and healthier lives. Instead, this  administration is doing favors for the fossil fuel industry and picking  energy favorites.\n\nI think this is bad for every single American, and I think we need to  stand up against it.", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693909/utility-bills-are-going-up"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…gone. That is already deportable. That is already inadmissible.\n\nIn an effort to try to find another way to go out and demonize and  vilify immigrants, this legislation is now picking on people who are  permanent residents of the country and could have been here for decades  with their families. They get a DUI, which is a terrible thing  regardless. They…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693082/jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…to  hook up to the grid.\n\nIt has been a disaster.\n\nWhile recent rules from the Federal Energy Regulatory Commission have  helped, we have to do more. Instead of focusing on picking winners and  losers in the interconnection queue, we should focus instead on  speeding up the processing of the entire queue so power plants can get  online as quickly as…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695754/guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…child  nutrition in Cambodia, and Beijing just announced an early childhood  project in Rwanda, where the United States recently cut our program.\n\nThey are even moving in, picking up the PEPFAR Program that we have  walked away from in Africa, after saving millions of lives. These cuts  represent a serious strategic error on behalf of the United States…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690349/9999"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "Ms. CRAIG. Mr. Speaker, President Trump changes his tariff policy  more than most people change their socks. One day he is picking fights  with Canada and Mexico, our friends, and the next day he is launching a  global trade war. Today, he is pausing tariffs on some countries while  also increasing them…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689863/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…tax cuts for billionaires. Instead of  focusing on the cost of living or making America safer, Republicans are  planning a massive giveaway to the rich, with working people picking up  the tab.\n\nThey want $2 trillion in tax cuts for people making more than  $500,000 a year by extending Trump's 2017 tax plan. That is $2 trillion  for people making more…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688097/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions-and-providing-for-consideration-of-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…across the aisle, and it is  all I am asking from this body, is that we, together, say: We need to  get resources for police officers in all of our country. We shouldn't  be picking out some departments and not others.\n\nThis is just simply making sure that this is a bipartisan effort to  fund local police officers.\n\nSo I ask my colleagues to pass these…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696004/unanimous-consent-requests"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…their jobs for an uncertain period of time  with uncertain pay and benefits. It is most certainly divisive,  shameful, and irresponsible when we force them to spend their days  picking up trash at a cost of millions to the taxpayer.\n\nOur National Guard is designed and trained, indeed purpose-built, to  serve key roles in domestic emergencies, natural disasters,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695246/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…Republicans want to permanently enshrine fossil fuel extraction  as the top priority for millions of acres of public land across the  country, no matter the cost. They are picking winners and losers here,  blocking affordable renewable energy projects, and sacrificing our  public lands in the process.\n\nMr. Speaker, I urge my colleagues to reject these…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696881/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Linda Sánchez", "party": "Democrat", "sentence": "…position against China.\n\nNow, because of this administration's chaotic trade policies, that  progress is  unravelling. Rather than target the real bad actors, the President is  picking fights with our friends. Instead of standing up for their  constituents and defending Congress' constitutional authority over  trade, most Republicans in this Chamber are…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699972/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…emergency that Donald Trump has declared in order  to slap tariffs on 49 percent of products Americans buy from other  countries. It would terminate that.\n\nAgain, instead of picking a fight with the entire world, Donald Trump  should be focused on going after America's actual adversaries.\n\nThe Senate has the power and authority to stop Donald Trump's…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689739/resolution"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…administration.\n\nThe failure of the leadership at the Department of Defense is also a  national embarrassment. The mess Secretary Hegseth creates regularly  shows the consequences of picking an inexperienced FOX News host to  lead a massively complex life-or-death Federal Agency. Donald Trump is  learning it the hard way: If you pick a FOX News cable host to lead…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697368/trump-administration"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…an American manufacturer of noncondensing tankless water heaters.  Effectively, the Biden administration and the government were trying to  alter the market on their own by picking winners and losers, which is  something that consumers should do, not unelected nameless bureaucrats.\n\nMr. Speaker, our colleagues on the other side of the aisle have spent…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688098/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions-and-providing-for-consideration-of-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…When the worst happens, when a first responder is lost in the line of  duty, it is the family who bears the burden of that sacrifice for the  long term. They are the ones picking up the pieces, mourning their  loved ones, and carrying their legacy forward.\n\nThe term ``Gold Shield families'' is modeled after the Gold Star  families, which honors the…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691021/calling-upon-local-communities-to-support-organizations-that-provide-resources-and-aid-gold-shield-families-in-their-time-of-need"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…He ran the Bill and  Hillary Clinton airport. He was a gun hobbyist. The ATF thinks he has  done something wrong. Instead of just going and visiting him, coming to  see him, picking him up at his work, taking him back to his house to  execute the warrant, the search warrant, no, they had to kick in his  door, predawn raid, 10 cars pull up. The first thing…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691031/expressing-support-for-local-law-enforcement-officers"}, {"senator": "Ron Johnson", "party": "Republican", "sentence": "…Senator from Michigan says my bill allows the President to pick  and choose. That is total hogwash. Again, every Federal employee,  including contractors, gets paid. There is no picking and choosing.  That is completely false. Money transfers? What is he talking about?  More power? There is no power. It is completely silent in terms of  Presidential authority.…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696605/9999"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…partnership with local volunteers.\n\nThrough this innovative solution, ECO-CLEAN and their beach cleaning  BEBOT have cleaned 1 million square miles of Lake Tahoe's shoreline,  picking up more than 30,000 pieces of litter in 2024 alone. They also  partner and collaborate with several local organizations, one of which  includes the Desert Research Institute,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…the cost before they spend their money to get  that.\n\nImportantly, this bill does all of this without authorizing any new  spending. It builds on existing programs, avoids picking winners and  losers, and keeps the Federal Government focused on providing  information, not mandates.\n\nI urge my colleagues to support this commonsense, bipartisan  legislation…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699206/artificial-intelligence-wisdom-for-innovative-small-enterprises-act"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "Mrs. FEDORCHAK. Mr. Speaker, this microphone isn't picking up that  well, but I thank the gentlewoman for this opportunity.\n\nI had a really hard time deciding what to talk about tonight because  there are so many great things about…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694792/promises-made-promises-kept"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…making over half a million dollars a year, you, too, could get a  Biden COVID credit bonus and subsidy from the ObamaCare exchange and  you, too, could have the U.S. taxpayer picking up the tab for 80 to 90  percent of your health insurance because they plussed up the credit,  and they removed the income caps.\n\nNow, the original ObamaCare subsidies--which,…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696539/government-funding"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…one-third of that--let's call it $10 billion--has to be  refinanced this year. Much of that is coming off of lower bond prices  from a couple of years ago.\n\nOn average, we are picking up one point of interest, 1.5 points, some  2. There is your problem. The chart here--I am just trying to show  you--is we have to constantly refinance. We are refinancing…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699257/debt-deficits-and-demographics"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…reduces taxes  on tips and overtime. This lets servers, bartenders, and hourly workers  keep more of their money. This means that waitresses working late and  the factory worker picking up an extra shift will finally keep more of  what they earned.\n\nIt is time to bring common sense and competitiveness back to our  economy, which is exactly what this bill…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691959/supporting-the-big-beautiful-bill"}, {"senator": "Steve Womack", "party": "Republican", "sentence": "…watching him play  high school sports with no way of knowing where his dreams and  ambitions would take him.\n\nHe began his career at Walmart as an hourly associate in 1984,  picking orders and unloading trailers in the warehouse. He attended the  University of Arkansas and worked part time at the Bank of Bentonville.  Later, he enrolled in the MBA program…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698690/recognizing-doug-mcmillon"}, {"senator": "James Risch", "party": "Republican", "sentence": "…Ambassador to China. This is  certainly one of the most important nominations and appointments that  will come across this floor, and the President is to be commended for  picking David Perdue for this position.\n\nChina, as we all know, is the largest, the most significant, probably  the longest lasting foreign policy challenge that the United States…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690343/9999"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…is true, but the prosecutors are trying to  get to the bottom of it.\n\nThere have been a lot of allegations about racism in these reports.  They are saying: Oh, you are just picking on the Somali community. I am  not, and I don't think the American people are. I think what they are  picking on are crooks. They are picking on crooks. Everything I just…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697400/welfare-fraud"}, {"senator": "Kevin Hern", "party": "Republican", "sentence": "…healthcare coverage. It gives individuals more options to choose health  plans that work for them.\n\nCHOICE accounts put individuals in the driver's seat when it comes to  picking their healthcare plan and lets their employer financially  support their decision. This empowers people in one of their most  personal decisions, their healthcare.\n\nOver the…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698397/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…with  local volunteers.\n\nThrough this innovative solution, ECO-CLEAN Solutions and their  beach-cleaning BEBOT have cleaned more than 1 million square miles of  shoreline, picking up over 38,000 pieces of litter that may have become  pollution in Lake Tahoe.\n\nIn comparison to visible litter items collected by volunteers, BEBOTs  detect and remove up…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697549/congratulating-eco-clean-solutions"}]