[{"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…that was laid out back 51 years ago, in 1974,  when the Senate created, along with the House, the Budget and  Impoundment Control Act.\n\nThat act had three pillars. The first pillar was that in a 10-year  period, you have to decrease the deficit with the provisions that were  in the bill. And then, every year after, in every category, it either  has to…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689508/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Grace Meng", "party": "Democrat", "sentence": "…one-half of the  world's population, but too many still face obstacles to economic  opportunity, gender equality, and their fundamental freedoms.\n\nThis funding has been a core pillar of U.S. assistance since the  1950s, and it is lifesaving. Estimates suggest that each year, it  prevents 17.1 million unintended pregnancies and saves the lives of  34,000…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699050/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…least 15 were  killed, another 29 injured. Among the murdered was a 10-year-old girl  and an 87-year-old Holocaust survivor. Also among the murdered was  Rabbi Eli Schlanger--a pillar of Brooklyn's Crown Heights community-- who welcomed a son into the world just 2 months ago.\n\nMay the memories of all those killed and injured this weekend be a  blessing.…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698130/shooting-at-brown-university-and-shooting-in-sydney-australia"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "Ms. KAPTUR. Mr. Speaker, I rise to celebrate the members of Ohio's  Lyons-Royalton Fire Department, a pillar of the Lyons community.\n\nFirefighters recently saved the life of a local man while responding  to a fire call. Homeowners Barb and Steve Bates reported a fire that  had sparked…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690783/national-fallen-firefighters-memorial-the-lyons-fire"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…to honor the life and  memory of Chandrashekar Namagondlu. A devoted husband, father, son, and  brother, Chandra was the embodiment of joy and a well-lived life. He  was a pillar of every community and organization that he was a part of.\n\nHe began his career as a network engineer before transitioning into  cybersecurity. Over the past 20 years at Visa,…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689774/congratulating-chief-keith-johnson-on-his-retirement"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…life to serving our great country.\n\nJamie entered the United States Army in 1966, deploying to Vietnam as  a Mustang crew chief.\n\nToday, at 80 years young, Jamie remains a pillar of support for our  local veterans. Every Thursday, he volunteers at the military diversion  court in Santa Ana. He attends bimonthly veteran treatment court  meetings, and…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697850/recognizing-ocfa-chief-brian-fennessy"}, {"senator": "Diana DeGette", "party": "Democrat", "sentence": "…DeGETTE. Mr. Speaker. I rise today to honor the life and legacy  of my dear friend and mentor, Gerald P. McDermott--a highly regarded  trial attorney, advocate for justice, pillar of Denver's legal  community, and revered family man.\n\nJerry's career was defined by an unwavering commitment to defending  the rights of all Coloradoans, no matter their circumstance…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690315/in-remembrance-of-gerald-p-mcdermott"}, {"senator": "Maggie Hassan", "party": "Democrat", "sentence": "…unable to get care, and because ending Medicaid as we  know it will devastate our economy, weaken our workforce, and, most of  all, make our people less free.\n\nMedicaid is a pillar of America's healthcare system. Tens of millions  of Americans, including working Americans, pregnant women, and millions  of children depend on Medicaid every day for routine…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689509/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Katherine Clark", "party": "Democrat", "sentence": "…my floor director, the incomparable Ray Salazar.\n\nIf you have had the privilege of serving in this Chamber, you know  what a gem, what a patriot, and what an indispensable pillar of this  institution Ray is. You also know what a reliable friend and adviser he  is, and you know what a loss his departure will be for the House of  Representatives.\n\nFrom…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699262/farewell-ray-salazar"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…magnifiers,  adaptive gaming controllers, and wearable artificial-vision devices.  Additionally, they have introduced LEGO Braille Brick kits in both  English and Spanish.\n\nKDL is a pillar of our community, Year after year, their commitment  to academic excellence and innovative programming has helped  generations of children and adults to reach their full potential.…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694075/recognizing-the-kent-district-librarys-talking-book-braille-center"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…diplomatic exchange, a museum of  American life, and the home of the foreign affairs community.\n\nTwo hundred years after its construction, the DACOR Bacon House  remains a pillar of strength in the President's Neighborhood, pays  tribute to the legacy of its prior owners, enslaved workers, and  distinguished guests, and serves as a unique prism for…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692065/recognizing-the-dacor-bacon-house-bicentennial-day"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "Mr. JOHNSON of Georgia. Mr. Speaker, a judiciary cannot stand as a  pillar of trust and independence unless it is also anchored in  accountability. Yet, as it stands, Federal judges facing serious  misconduct allegations can stop an investigation…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692556/accountability-for-judiciary-investigations"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…reliable services  from routine transport to emergency response. With exemplary civic  dedication, members have fostered an immeasurable dependability that  stands out as a pillar to the Deal community and beyond. I commend the  Deal First Aid Squad for their commitment to support residents during  times of need, including life-saving interventions and…", "date": "2025-08-05", "source_url": "https://justfacts.votesmart.org/public-statement/1694713/recognizing-the-75th-anniversary-of-the-deal-first-aid-squad"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…turn away  from helplessness. . . . never to ignore or spurn those who suffer  untended in a land that is bursting with abundance.''\n\nIndeed, Medicaid saves lives and is a pillar of health, security, and  justice for tens of millions of Americans.\n\nPeople often think of Medicaid as healthcare for poor children, and  that would be justification enough,…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691417/gop-tax-scam-hurts-everyone"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…Zoning In on Service: Honoring Gerry Hyland's Legacy\n\nMr. BEYER. Mr. Speaker, I rise today to honor the life and legacy of  Gerald W. ``Gerry'' Hyland, the true pillar of the Mount Vernon  community who recently passed away.\n\nFor 28 years, Gerry served as the Mount Vernon district supervisor,  but he was no ordinary public servant. After…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687959/congratulating-dame-karen-pierce"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "Mr. BEAN of Florida. Mr. Speaker, I thank very much the chairman for  yielding time.\n\nMr. Speaker, one citizen, one vote. It is the pillar of our democracy  and you would think that of all the issues that we debate on this  hallowed floor, this is the one. This is the one that brings everybody  together, the pillar…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1689995/safeguard-american-voter-eligibility-act"}, {"senator": "Andy Ogles", "party": "Republican", "sentence": "…gentleman for yielding.\n\nMadam Speaker, I rise today in support of my bill, H.R. 5078, the  Protecting Information by Local Leaders for Agency Resilience Act,  known as the PILLAR Act.\n\nThis legislation is about strengthening the first line of defense in  our Nation's cybersecurity. While we often focus on Federal networks  and high-profile national…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696789/protecting-information-by-local-leaders-for-agency-resilience-act"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…birthday to  the U.S. Army.\n\nOn June 14, we will celebrate a remarkable milestone: the 250th  birthday of the United States Army. For 2\\1/2\\ centuries, the Army has  stood as a pillar of strength, sacrifice, and service. From the  earliest days of our Nation's founding to today's complex challenges,  Army soldiers have defended our freedoms, upheld our values,…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692323/taking-an-important-step-for-rural-america"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…the skills needed to succeed beyond graduation. Ms.  Elias' impact extends far beyond the classroom. She has been a mentor  to colleagues, a trusted partner to parents, and a pillar of the  greater Kern County community. As the Master of Ceremonies for academic  award assemblies, she brought families together to celebrate student  achievement, often receiving…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698972/recognizing-ms-martha-elias"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…made through his work with NAMI  Hernando. Tommy works as the Operations Manager of Meares Plumbing and  Electrical and former Board President of NAMI Hernando. He has been a  pillar of leadership and unwavering support for mental health in our  community. Tommy's impact reaches far beyond boardroom decisions. Tommy  brings integrity, dedication, and a…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692203/recognizing-tommy-baker"}, {"senator": "Rudy Yakym III", "party": "Republican", "sentence": "…whose craftsmanship and professionalism have earned  the respect of clients across Indiana and beyond.\n\nBeyond their business success, LeMaster Steel Erectors has become a  pillar of the local economy. With offices in Elkhart and Noblesville,  they provide stable employment, support local suppliers, and are a  pillar in their communities.\n\nMr. Speaker,…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693965/9999"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "Mr. FLOOD. Mr. Speaker, I rise today to congratulate a true pillar of  the Norfolk community, Jerry Landkamer, on his recent election as one  of five National Vice Commanders of the American Legion.\n\nA proud Legionnaire since 1975, Landkamer…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695830/recognizing-norfolks-jerry-landkamer-on-his-election-as-national-vice-commander"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…strength, efficiency, and purpose,  reflecting his ability to maximize their potential and bring out the  best in those he leads.\n\nA lifelong public servant, Chief Estes is truly a pillar of our  community. He is defined by his consistent and active engagement and  his deep dedication to those he serves, going above and beyond the  regular call of duty.\n\nIt…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698099/california-is-the-exact-opposite-of-a-model-of-efficiency"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…constituents of New York's 23rd Congressional District to recognize a  true cornerstone of our community. For 80 years, the Jewish Community  Center of Greater Buffalo has been a pillar of strength, service, and  unity for Western New York--a place where generations have come  together to learn, grow, and celebrate Jewish life and values.\n\nSince its founding…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693643/recognizing-the-jewish-community-center-of-greater-buffalo-on-its-80th-anniversary-of-service-and-community-leadership"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "…my pleasure to recognize  and celebrate the 100th Anniversary of the Rotary Club of Winter  Garden.\n\nFor the past 100 years, the Rotary Club of Winter Garden has stood as  a pillar of leadership and service. Its business and professional  members have generously volunteered their time and talents, faithfully  upholding Rotary's Four-Way Test. Their commitment…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699377/recognizing-the-100th-anniversary-of-the-rotary-club-of-winter-garden"}, {"senator": "Vince Fong", "party": "Republican", "sentence": "…to honor a cherished institution  in my district, Smith's Bakeries, located in Bakersfield, California.\n\nSince 1945, Smith's has been more than just a bakery. It has been a  pillar of joy in our community. Founded by Howard Smith and Roy  Balmain, the goal was simple: to provide the best baked goods possible.\n\nAs we celebrate Small Business Week, Smith's…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690793/recognizing-smiths-bakeries"}, {"senator": "Adrian Smith", "party": "Republican", "sentence": "…making all free nations of the world  stronger and more self-reliant.'' While times have changed somewhat  since these words were spoken, the message still rings true.\n\nAs a key pillar of our economic engagement with Haiti, the HELP/HOPE  program has supported industry growth while encouraging a more stable  business environment. However, as with AGOA and…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698849/haiti-economic-lift-program-extension-act"}, {"senator": "Michael Cloud", "party": "Republican", "sentence": "Mr. CLOUD. Mr. Speaker, today the House advances another pillar of  President Trump's America First agenda with the passage of the American  Entrepreneurs First Act of 2025.\n\nThis bill ensures that taxpayer-funded SBA loans are reserved…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692127/american-entrepreneurs-first-act-of-2025"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…peace, safety, and recovery.\n\nOn this Memorial Day, we thank them. We remember those who laid down  their lives in uniform, and we honor the Spokane Readiness Center as a  pillar of strength in both our Nation's defense and our local  community.\n\nMay their legacy never be forgotten, and may our gratitude be as  enduring as their service.…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691526/recognizing-washington-army-national-guard-1st-battalion-161st-infantry-regiment"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…the Life of Ms. Elizabeth Pryor\n\nMr. CARTER of Georgia. Mr. Speaker, I rise today to honor the life of  Ms. Elizabeth Katherine Pryor, a civil rights activist, educator, and  pillar in the Savannah community, who passed away last month.\n\nMs. Pryor was an activist, joining the civil rights movement at a  young age where she proudly participated in organized…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687985/mourning-the-loss-of-john-reginald-murphy"}]