[{"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…to honor the life and  memory of Chandrashekar Namagondlu. A devoted husband, father, son, and  brother, Chandra was the embodiment of joy and a well-lived life. He  was a pillar of every community and organization that he was a part of.\n\nHe began his career as a network engineer before transitioning into  cybersecurity. Over the past 20 years at Visa,…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689774/congratulating-chief-keith-johnson-on-his-retirement"}, {"senator": "Grace Meng", "party": "Democrat", "sentence": "…one-half of the  world's population, but too many still face obstacles to economic  opportunity, gender equality, and their fundamental freedoms.\n\nThis funding has been a core pillar of U.S. assistance since the  1950s, and it is lifesaving. Estimates suggest that each year, it  prevents 17.1 million unintended pregnancies and saves the lives of  34,000…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699050/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Maggie Hassan", "party": "Democrat", "sentence": "…unable to get care, and because ending Medicaid as we  know it will devastate our economy, weaken our workforce, and, most of  all, make our people less free.\n\nMedicaid is a pillar of America's healthcare system. Tens of millions  of Americans, including working Americans, pregnant women, and millions  of children depend on Medicaid every day for routine…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689509/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…reinstate the VASP  program and make it clear that VA's job is to help veterans stay in  their homes, not push them into homelessness.\n\nThe VA Home Loan Program has been a pillar of the American middle  class since the original GI Bill. It helped returning World War II  veterans achieve economic security through homeownership. Yet, today's  veterans,…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689694/montgomery-gi-bill-selected-reserves-tuition-fairness-act-of-2025"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…magnifiers,  adaptive gaming controllers, and wearable artificial-vision devices.  Additionally, they have introduced LEGO Braille Brick kits in both  English and Spanish.\n\nKDL is a pillar of our community, Year after year, their commitment  to academic excellence and innovative programming has helped  generations of children and adults to reach their full potential.…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694075/recognizing-the-kent-district-librarys-talking-book-braille-center"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…turn away  from helplessness. . . . never to ignore or spurn those who suffer  untended in a land that is bursting with abundance.''\n\nIndeed, Medicaid saves lives and is a pillar of health, security, and  justice for tens of millions of Americans.\n\nPeople often think of Medicaid as healthcare for poor children, and  that would be justification enough,…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691417/gop-tax-scam-hurts-everyone"}, {"senator": "Joaquin Castro", "party": "Democrat", "sentence": "…cause, in this case, a free and open Indo- Pacific.\n\nThe AUKUS agreement accomplishes these ends by providing Australia  with additional submarine training and technology in Pillar I, as well  as knitting together cooperative defense research and development  efforts between Australia, the United States, and the U.K. in Pillar  II.\n\nThis bill builds on…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694780/aukus-reform-for-military-optimization-and-review-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…reliable services  from routine transport to emergency response. With exemplary civic  dedication, members have fostered an immeasurable dependability that  stands out as a pillar to the Deal community and beyond. I commend the  Deal First Aid Squad for their commitment to support residents during  times of need, including life-saving interventions and…", "date": "2025-08-05", "source_url": "https://justfacts.votesmart.org/public-statement/1694713/recognizing-the-75th-anniversary-of-the-deal-first-aid-squad"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…diplomatic exchange, a museum of  American life, and the home of the foreign affairs community.\n\nTwo hundred years after its construction, the DACOR Bacon House  remains a pillar of strength in the President's Neighborhood, pays  tribute to the legacy of its prior owners, enslaved workers, and  distinguished guests, and serves as a unique prism for…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692065/recognizing-the-dacor-bacon-house-bicentennial-day"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…deficits and debt. The first was  that in the first 10 years that are presented in a reconciliation bill,  the sum of the 10 years has to produce deficit reduction. That was  pillar No. 1.\n\nThe second pillar was that in every single year that follows the  first 10, it has to produce deficit reduction. It has to save money.\n\nAnd the third was honest numbers.…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693102/one-big-beautiful-bill"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…Zoning In on Service: Honoring Gerry Hyland's Legacy\n\nMr. BEYER. Mr. Speaker, I rise today to honor the life and legacy of  Gerald W. ``Gerry'' Hyland, the true pillar of the Mount Vernon  community who recently passed away.\n\nFor 28 years, Gerry served as the Mount Vernon district supervisor,  but he was no ordinary public servant. After…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687959/congratulating-dame-karen-pierce"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "Mr. CARBAJAL. Mr. Speaker, this year marks 125 years since the  founding of Cal Poly San Luis Obispo. From its inception, Cal Poly has  been a pillar of the San Luis Obispo community embodying the spirit of  its motto ``learn by doing''.\n\nIn the past 125 years Cal Poly SLO has educated more than 230,000  individuals who…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699776/recognizing-the-california-polytechnic-state-university-san-luis-obispo"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "Mr. FOSTER. Mr. Speaker, I rise today to honor and celebrate the  100th Anniversary of Family Counseling Service (FCS) in Aurora,  Illinois. For a century, FCS has been a pillar of compassion, support,  and guidance, providing critical mental health and social services to  individuals and families in need.\n\nSince its founding in 1925, Family Counseling…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688268/recognizing-the-100th-anniversary-of-family-counseling-service"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…least 15 were  killed, another 29 injured. Among the murdered was a 10-year-old girl  and an 87-year-old Holocaust survivor. Also among the murdered was  Rabbi Eli Schlanger--a pillar of Brooklyn's Crown Heights community-- who welcomed a son into the world just 2 months ago.\n\nMay the memories of all those killed and injured this weekend be a  blessing.…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698130/shooting-at-brown-university-and-shooting-in-sydney-australia"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "Ms. KAPTUR. Mr. Speaker, I rise to celebrate the members of Ohio's  Lyons-Royalton Fire Department, a pillar of the Lyons community.\n\nFirefighters recently saved the life of a local man while responding  to a fire call. Homeowners Barb and Steve Bates reported a fire that  had sparked…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690783/national-fallen-firefighters-memorial-the-lyons-fire"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "Mr. OBERNOLTE. Mr. Speaker, I rise today to recognize the 65th  anniversary of the Mojave Water Agency, an institution that has stood  as a pillar of responsible stewardship, innovation, and public service  in California's High Desert since its founding in 1960.\n\nFor over six decades, the Mojave Water Agency has safeguarded…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694201/recognizing-the-mojave-water-agency-on-the-occasion-of-its-65th-anniversary"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…constituents of New York's 23rd Congressional District to recognize a  true cornerstone of our community. For 80 years, the Jewish Community  Center of Greater Buffalo has been a pillar of strength, service, and  unity for Western New York--a place where generations have come  together to learn, grow, and celebrate Jewish life and values.\n\nSince its founding…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693643/recognizing-the-jewish-community-center-of-greater-buffalo-on-its-80th-anniversary-of-service-and-community-leadership"}, {"senator": "Rudy Yakym III", "party": "Republican", "sentence": "…whose craftsmanship and professionalism have earned  the respect of clients across Indiana and beyond.\n\nBeyond their business success, LeMaster Steel Erectors has become a  pillar of the local economy. With offices in Elkhart and Noblesville,  they provide stable employment, support local suppliers, and are a  pillar in their communities.\n\nMr. Speaker,…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693965/9999"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…vision to life through hard work but makes it look easy.\n\nWarren County has become a dynamic community and recreational hub  thanks to Jim's leadership. Jim is a steadfast pillar of the  northwestern Pennsylvania region, and his legacy will be felt for  generations.\n\nWhile it is bittersweet to see Jim retire, I know that we will still  see him around…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697068/recognizing-jim-decker"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "Mr. STAUBER. Mr. Speaker, I rise today to honor Colin ``Mac''  MacDonald, a community pillar and legendary broadcaster in Brainerd,  Minnesota.\n\nFor over 30 years, Mac has been the trusted voice of the Brainerd  Lakes Area. He began on the Power Loon in 1992, advanced…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699726/9999"}, {"senator": "Andy Ogles", "party": "Republican", "sentence": "…gentleman for yielding.\n\nMadam Speaker, I rise today in support of my bill, H.R. 5078, the  Protecting Information by Local Leaders for Agency Resilience Act,  known as the PILLAR Act.\n\nThis legislation is about strengthening the first line of defense in  our Nation's cybersecurity. While we often focus on Federal networks  and high-profile national…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696789/protecting-information-by-local-leaders-for-agency-resilience-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…made through his work with NAMI  Hernando. Tommy works as the Operations Manager of Meares Plumbing and  Electrical and former Board President of NAMI Hernando. He has been a  pillar of leadership and unwavering support for mental health in our  community. Tommy's impact reaches far beyond boardroom decisions. Tommy  brings integrity, dedication, and a…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692203/recognizing-tommy-baker"}, {"senator": "Tom Emmer", "party": "Republican", "sentence": "…and someone who truly embodies  his well-known motto, ``I'm living the dream.''\n\nDenny's love for Watertown, his decades of service, and his heart of  gold have made him a pillar of the community. As he completes his final  day behind the barber chair on December 19, 2025, we honor his lifetime  of contributions and celebrate the legacy he leaves behind.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698267/recognizing-the-retirement-of-dennis-eugene-denny-butcher-of-watertown-minnesota"}, {"senator": "Adrian Smith", "party": "Republican", "sentence": "…making all free nations of the world  stronger and more self-reliant.'' While times have changed somewhat  since these words were spoken, the message still rings true.\n\nAs a key pillar of our economic engagement with Haiti, the HELP/HOPE  program has supported industry growth while encouraging a more stable  business environment. However, as with AGOA and…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698849/haiti-economic-lift-program-extension-act"}, {"senator": "Michael Cloud", "party": "Republican", "sentence": "Mr. CLOUD. Mr. Speaker, today the House advances another pillar of  President Trump's America First agenda with the passage of the American  Entrepreneurs First Act of 2025.\n\nThis bill ensures that taxpayer-funded SBA loans are reserved…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692127/american-entrepreneurs-first-act-of-2025"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…Leechburg Rotary Club on an incredible milestone,  100 years of dedicated service to their community.\n\nSince receiving their charter in 1925, the Leechburg Rotary has been  a pillar of civic engagement, compassion, and leadership in Armstrong  County.\n\nFrom their very first project of placing Bibles in hotel rooms to  helping pave Canal Street, building…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692828/leechburg-rotary-club-celebrates-100-years-of-service"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…the Life of Ms. Elizabeth Pryor\n\nMr. CARTER of Georgia. Mr. Speaker, I rise today to honor the life of  Ms. Elizabeth Katherine Pryor, a civil rights activist, educator, and  pillar in the Savannah community, who passed away last month.\n\nMs. Pryor was an activist, joining the civil rights movement at a  young age where she proudly participated in organized…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687985/mourning-the-loss-of-john-reginald-murphy"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…talent loss, preserves irreplaceable know-how, and keeps our defense  industrial base resilient against any adversary who hopes to see it  weakened.\n\nIn addition to being a pillar of our national defense, Rock Island  Arsenal supports more than 15,000 jobs. Nearly one-half of those  workers live in Iowa. It also contributes over $1.2 billion annually…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693676/department-of-defense-appropriations-act-2026"}, {"senator": "Barry Loudermilk", "party": "Republican", "sentence": "Mr. LOUDERMILK. Mr. Speaker, I rise today to recognize an incredible  individual who is a true pillar of the community, Mrs. Pam Younker, and  congratulate her on her retirement from Children's Healthcare of  Atlanta.\n\nThe daughter of a United States Marine, Pam is a longtime…", "date": "2025-05-23", "source_url": "https://justfacts.votesmart.org/public-statement/1691682/recognizing-pam-younker-on-her-retirement"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "Mr. FLOOD. Mr. Speaker, I rise today to congratulate a true pillar of  the Norfolk community, Jerry Landkamer, on his recent election as one  of five National Vice Commanders of the American Legion.\n\nA proud Legionnaire since 1975, Landkamer…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695830/recognizing-norfolks-jerry-landkamer-on-his-election-as-national-vice-commander"}]