[{"senator": "Paul Tonko", "party": "Democrat", "sentence": "…value of hard  work and the dignity that comes with a paycheck, a steady paycheck. I  think that is driven somewhat, perhaps greatly, by the DNA of our  Nation, which is the pioneer spirit. People are just about innovation.  They want to discover and create a stronger economy.\n\nIt is also inspired in upstate New York because I represent the  easternmost…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695601/devastating-harm-caused-by-trump-administration"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…Mr. Speaker, I rise to introduce bipartisan legislation,  alongside my northwest Ohio colleague, Representative  Bob Latta.\n\nOur purpose is to honor a legendary Ohioan and pioneer of American  military history, Rear Admiral Alene B. Duerk.\n\nAdmiral Duerk was the first woman in the United States Navy to  achieve the rank of Rear Admiral. Our legislation…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697052/request-to-name-us-vessel-after-rear-admiral-duerk"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…the forms of inequality, injustice in health is the       most shocking and inhumane.\n\nPaul Farmer--extraordinary leader, physician, anthropologist,  renowned humanitarian, pioneer of global health--I read his book  ``Mountains Beyond Mountains.'' In another one of his books,  ``Pathologies of Power: Health, Human Rights, and the New War on the  Poor,''…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…batteries, perhaps the single most important       technology underpinning EV performance. Many of these players       got a big boost working alongside Tesla, the American EV       pioneer that started making cars at its Shanghai plant in       late 2019.\n\nNow, global dependence on Chinese battery suppliers, paired       with concerns that Chinese EVs could…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694959/highlighting-advances-in-chinese-electric-vehicle-technology-and-the-need-for-american-investment-in-battery-technology"}, {"senator": "John Mannion", "party": "Democrat", "sentence": "…mother of UAW International Representative Mark Barbee, who resides in  my district in Syracuse, NY.\n\nBorn on July 23, 1939, Josephine Barbee was a devoted mother and a  true pioneer in early childhood education and community service. Along  with her brother, Dr. Bishop Leonard R. Williams--pastor of Zion  Holiness Church and Bishop of the Great Lakes…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688217/recognizing-josephine-barbee"}, {"senator": "Doris Matsui", "party": "Democrat", "sentence": "…natural  barriers that trap pollutants and contribute to unique air pollution  challenges. As a State, we have long recognized the dangers of air  pollution, and we have been a pioneer in addressing the root causes.\n\nIn fact, California's efforts to control air pollution predate  Federal efforts in 1967. In 1967, California was the first State to  establish…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690489/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…transmission conductors in my district: CTC Global and TS  Conductor. These companies are extraordinary examples of American  innovation and manufacturing which is helping pioneer the grid of the  future and create high-skilled domestic jobs in the process.\n\nMr. Chairman, I urge Members to support my amendment, and I reserve  the balance of my time.…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697895/electric-supply-chain-act"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…milk and end up chatting with so many familiar  faces they forget what they came in for. The store is also a leading  participant in charitable giving around town. They were a pioneer of 19  Days of Norwich, an annual holiday drive where businesses donate a  portion of their December sales to the local food shelf. During the  rest of the year, they put…", "date": "2025-07-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694332/recognizing-dan-whits-general-store"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…Patriarch Bartholomew will join the esteemed ranks of past  recipients, including Mother Teresa, the Dalai Lama, and Archbishop  Desmond Tutu.\n\nHis All-Holiness has been a pioneer in merging spirituality with  science as a force for change. As head of the Eastern Orthodox church,  he has gathered scientists, scholars, politicians with Catholic,  Jewish,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695851/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…initiated international meetings and theological  conversations with Muslim and Jewish leaders to promote mutual respect  and religious tolerance on a global level, proving a pioneer in  interfaith encounters and traveling to Muslim countries rarely visited  by Christian leaders.\n\nHe has organized international, inter-faith and inter-disciplinary  symposia…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695051/recognizing-his-all-holiness-bartholomew"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…population of scientists, of  engineers who can then provide for the muscle of our innovation  economy, to allow for that intellectual capacity of this great Nation  and the pioneer spirit of this Nation to continue to foster this growth  of product delivery that speaks to the quality of life of people across  this great world.\n\nWe as a nation have been…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691396/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Jim Costa", "party": "Democrat", "sentence": "…on July 14, 1943, in Fresno County, John was a proud graduate of  the University of California-Davis and a United States Army veteran.\n\nFor over 40 years, he was not only a pioneer in agriculture, but a  good friend of mine. He was a leader who was well respected throughout  the country. John shaped the Harris Ranch and turned it into one of the  Nation's…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693899/denouncing-cuts-to-k-12-schools"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…about our leader, Yvette Clarke, who stands on the  shoulders of her constituents in Brooklyn, New York. I think about  Yvette Clarke, who stands on her mother's shoulders, a pioneer and  someone who understood what we need to do to preserve our Black  history.\n\nMr. Speaker, I ask everyone to listen carefully as this powerful  Black woman comes to us and…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699864/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…public  service.\n\nMarilyn has been a constant force for many years, leading with  strength, dedication, and a genuine heart for the people of North  Myrtle Beach.\n\nShe is a pioneer. She has worked harder than anyone. In fact, she is  one of the hardest-working women that I know to make North Myrtle Beach  not just a premier tourist destination but a…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694053/recognizing-mayor-marilyn-hatley"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "…what  they have done. Their influence is undeniable.\n\nWhen we think of remarkable women, let us be reminded of women like  Martha Hughes Cannon, a physician, suffragist, and pioneer who went on  to become the first female State Senator in the United States.\n\nWe are a Nation of pioneers. Martha beautifully embodies that  pioneering spirit. She immigrated…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689363/womens-history-month"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "…modernizes systems and protects public health across multiple  communities in Graham County.\n\nIt also invests in source water system improvements at Marana  Regional Airport and the Pioneer Well PFAS Treatment Project to help  ensure safe and reliable water for families and businesses. These are  practical, locally requested projects that are transparent,  accountable,…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698633/providing-for-consideration-of-hr-saving-homeowners-from-overregulation-with-exceptional-rinsing-act-providing-for-consideration-of-hr-affordable-housing-over-mandating-efficiency-standards-act-and-providing-for-consideration-of-hr-commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…districts to merge.\n\nMr. Speaker, by celebrating the 150th Anniversary of the Village of  Tontogany, community members recognize the outstanding  achievements, maintain the pioneer attitude, and strive to better their  village through the principles on which it was founded. I thank and  congratulate Tontogany on this significant milestone.", "date": "2025-08-08", "source_url": "https://justfacts.votesmart.org/public-statement/1694722/recognizing-the-village-of-tontoganys-sesquicentennial"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…signed       Public Law 112-174, which directed Frederick Douglass' statue       placement in the Capitol Visitor Center's Emancipation Hall;       and\n\n[Whereas Douglass was a pioneer in journalism who broke       through glass ceilings throughout one of the most crucial       times in American history, exhibited great perseverance to       become an American…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692224/designating-the-house-press-gallery-in-the-united-states-capitol-as-the-frederick-douglass-press-gallery"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "…lifelong dedication to  advancing Florida agriculture.\n\nReba is a fifth-generation Florida cattle producer with deep roots in  agriculture. She was born into the Yarborough pioneer ranching family  in Sanford, Florida, where she was raised with a deep respect for the  land and livestock, learning the ranching lifestyle through hard work  alongside her…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699853/recognizing-reba-y-mazak"}, {"senator": "Jim Baird", "party": "Republican", "sentence": "Mr. BAIRD. Mr. Speaker, I rise to honor the Pioneer High School  football team. The Pioneer Panthers had an incredible season and a  well-deserved visit to the 1A State Championship finals.\n\nWhile the end of this football season…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698081/recognizing-pioneer-high-school-football-team"}, {"senator": "Eric Burlison", "party": "Republican", "sentence": "…Missouri, area and has been recognized with the  Missouri Award, the Holllister Area Chamber of Commerce Heart of  Hollister Award, the Branson Lakes Area Chamber of Commerce Pioneer and  Community Spirit awards, and the True American Hero Award from the  Branson Veteran's Task Force.\n\nMr. Ziegenfuss is married to the former Dana Woodall, and they have…", "date": "2025-04-17", "source_url": "https://justfacts.votesmart.org/public-statement/1690124/recognizing-hollister-city-administrator-rick-ziegenfuss"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…Seattle, all of them take a piece of  Utah with them.\n\nOn July 24, you may just see every one of them pulling kids in a  wagon in a neighborhood parade or hear them singing a pioneer song or  making the trek downtown to the shelter to drop off bedding and  clothing. Each in his own way honors July 24, and I ask you today to  honor those long-dead pioneers…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694022/july-24th-utahs-state-holiday"}]