[{"senator": "Bennie Thompson", "party": "Democrat", "sentence": "…include in the Record the  following proclamation commemorating the Multi-Year Reunion of Amanda  Elzy High School located in Greenwood, Mississippi, and recognizing the  pivotal role it played in the Civil Rights Movement.\n\nWhereas the House of Representatives joins the graduates of       Amanda Elzy High School and the citizens of Mississippi in…", "date": "2025-08-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694753/recognizing-the-amanda-elzy-high-school-multi-year-reunion"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…great American  journey, over our 250 years, where so many heroes had to emerge, people  that I have come to revere, like Joshua Chamberlain from Maine, who  played such a pivotal role in the Battle of Gettysburg. What a noble  soul he was. He would later go on to be Governor of his State and go on  to do great things, but his heroism lay that in a time…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…oversight will be  instrumental in the continued restoration of the Woodbrook Superfund  Site, and associated conservation efforts throughout the area. Dorothy  played a pivotal role in securing grants from Sustainable Jersey and  the National Park Service, including twenty-five thousand dollars to  provide composters to residents. In 2015, Dorothy was…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698050/recognizing-dorothy-giamboi-for-nearly-fifteen-years-of-public-service"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…to Hindu American  Civil Rights, interfaith dialogue, and intellectual diversity.\n\nThe Infinity Foundation, established by Rajiv Malhotra thirty years  ago, has played a pivotal role in championing the rights of Hindu  Americans, advocating against biases and Hinduphobia, and ensuring  their equal protection under civil rights laws. It has contributed…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689467/recognizing-the-contributions-of-rajiv-malhotra-and-the-infinity-foundation"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…is marked by numerous accomplishments. He  spearheaded major urban improvement projects, including a $2.4 million  streetscape enhancement for Myrtle Avenue and played a pivotal role in  helping secure a $55 million upgrade of the Myrtle-Wyckoff transit hub,  enhancing accessibility for thousands of daily commuters and consumers.  As an advocate for…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693397/recognizing-theodore-m-renz"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…Emery, where he  combined his legal acumen with a deep-seated sense of justice.\n\nA dedicated member of the Board of Governors for the Jewish  Federation, Nick has played a pivotal role in strengthening Jewish life  and fostering a culture of generosity and community-mindedness. His  decades of service and thoughtful leadership have made him an  indispensable…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691612/recognizing-nick-robfogel"}, {"senator": "Jared Moskowitz", "party": "Democrat", "sentence": "…independently, and with  dignity in their own homes and communities. From meal delivery and  transportation assistance to caregiver support and health education,  the Agency plays a pivotal role in addressing the needs of our aging  population.\n\nEach year, the Broward Senior Hall of Fame honors exemplary residents  aged 60 and older who have selflessly dedicated…", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691691/recognizing-the-2025-honorees-of-the-broward-county-florida-senior-hall-of-fame"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…with great joy and honor to  recognize the Igbo Community Association of Nigeria (ICAN) DFW and its  annual Igbo Day Celebration.\n\nFor over 25 years, ICAN DFW has played a pivotal role in preserving  the rich customs, language, values, and traditions of the Igbo people,  while also fostering cross-cultural understanding throughout the  Dallas-Fort Worth…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694153/recognizing-the-igbo-community-association-of-nigeria-dalles-fort-worth"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…Jerry also worked for 21 years as  a juvenile detective, where he investigated crimes against children.\n\nThroughout his distinguished career, Detective Gachett has played a  pivotal role of securing justice with his investigations, leading to  the imprisonment of hundreds of child predators, solidifying his  reputation as a champion for the community's most…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687992/congratulating-jerry-gachett-on-his-retirement"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…it or not.\n\nIt is the responsibility of this body to be stewards of our country's  future and leave this country better than how we found it. That means  recognizing the pivotal role of science and innovation for the people,  as well as the funding, and how it plays a role in making our country  great now and in the future.\n\nStanding up for science is…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691395/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…scientists  delivering major military and civil works construction, and regional  infrastructure improvements in New York and New Jersey. Mr. Seebode's  leadership has played a pivotal role in delivering life-saving  technical expertise and environmental restoration during national  crises. Together, we have worked on projects to reduce storm and  coastal flood…", "date": "2025-11-04", "source_url": "https://justfacts.votesmart.org/public-statement/1696524/recognizing-joseph-seebode"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…spaces for children, ensuring that progress didn't just mean  progress for some. It meant progress for all.\n\nLucia Voorhees Grimes was a dedicated suffragist who played a pivotal  role in Michigan's fight for women's voting rights. As a leader in the  Michigan Equal Suffrage Association, she traveled the State organizing  campaigns, educating voters,…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689165/womens-history-month"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "…on issues of shared importance  and reinforcing the values that unite us.\n\nNick's efforts extended far beyond the day-to-day responsibilities of  diplomacy. He played a pivotal role in coordinating and supporting  visits by Prime Ministers, Cabinet Ministers, Members of Parliament,  and Members of the Royal Family to Washington and across the United…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698086/recognizing-nick-alton"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…American  Heritage Month to recognize an outstanding business and community  leader from Rochester, New York, Orlando Ortiz.\n\nServing as President, Orlando Ortiz has played a pivotal role in  shaping and leading the Puerto Rican Festival for over 15 years. He has  worked tirelessly to honor Puerto Rican heritage and create a welcoming  space where thousands…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695838/recognizing-orlando-ortiz"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…were qualified. She stood out because of her  outstanding trial accomplishments and contributions to the Virginia  Association of Commonwealth's Attorneys.\n\nShe played a pivotal role in establishing a regional behavioral  health docket in the Fredericksburg area. This initiative helps connect  individuals with serious mental health illness and substance…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699136/constituent-of-the-week-alexandra-vakos"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…his time  with the Coast Guard, Dave served as the deputy Federal security  director for Minnesota at the Minneapolis-Saint Paul International  Airport. He also played a pivotal role as a primary field leader for  Super Bowl LII.\n\nFrom assistant Federal security director roles to active director  positions, Dave has consistently delivered strong leadership…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698763/recognizing-david-mcmahon"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…Greenland has been not only a partner but a  faithful partner. They have been an ally and a friend to the United  States, dating back to World War II. At that time, it played a pivotal  role in the Allied victory.\n\nTo this day, they continue to be that staunch ally. As I mentioned,  they have been hosting the Pituffik Space Base and allowing the United  States…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698821/9999"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…time.\n\nMr. WESTERMAN.  Stefanik), the lead sponsor of this bill.\n\nMr. WESTERMAN. Mr. Speaker, this bill by Representative Stefanik  acknowledges a significant site for its pivotal role in American  history as we approach our Nation's 250th anniversary.\n\nI urge the adoption of the bill, and I yield back the balance of my  time.", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691018/strengthening-americas-turning-point-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…to her role has made a meaningful impact in the lives and  learning outcomes of her students. Not only does she empower her  students academically, but she also plays a pivotal role in supporting  her colleagues and fellow educators, reflecting her ongoing commitment  to public service and civic responsibility.\n\nDr. Sandfort exemplifies the highest…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…boardroom decisions. Tommy  brings integrity, dedication, and a true sense of responsibility to  every aspect of his volunteer work. As Board President, Tommy played a  pivotal role in strengthening NAMI Hernando's foundation, guiding  strategic growth, and supporting long-term sustainability. His  leadership helped expand outreach efforts and foster…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692203/recognizing-tommy-baker"}, {"senator": "Elise Stefanik", "party": "Republican", "sentence": "…Nation's founding and history.\n\nAs we approach the U.S. semiquincentennial and the 250th anniversary  of the Battles of Saratoga, there is no better time to recognize the  pivotal role this site played in our Nation's war for independence.\n\nThe Battles of Saratoga were the most significant turning points and  one of the most decisive American battles of…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691016/strengthening-americas-turning-point-act"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…Sales, Marketing, and Government Affairs, including serving as the  director of U.S. Public Affairs before leading the Global Government  Affairs organization. In this pivotal role, he developed Deere's  strategy and advocacy priorities leading to legislative, regulatory,  and public policy outcomes that ultimately benefited the company,  customers,…", "date": "2025-08-12", "source_url": "https://justfacts.votesmart.org/public-statement/1694731/congratuling-deere-company-vice-president-of-global-government-affairs-collis-jones-on-his-retirement"}, {"senator": "Randy Feenstra", "party": "Republican", "sentence": "…State's  priorities at the Federal level.\n\nWe also worked closely on protecting CIRAS to grow manufacturing in  Iowa and to bring jobs to our rural communities. She played a pivotal  role in supporting our veterinary diagnostic lab and the world-renowned  Ames Laboratory. She will continue to be remembered as a phenomenal  leader for our Iowa State University.…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691604/als-awareness-month"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…the Year in 2014.\n\nFor more than 25 years, Mary Ann devoted her time to the James A.  Haley Veterans' Hospital (JAHVH), logging over 11,000 volunteer hours.  She played a pivotal role in the creation of both Fisher House I and  II, providing families of hospitalized veterans a place to stay during  long-term care. She was also instrumental in founding…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697717/recognizing-mary-ann-keckler"}, {"senator": "John Carter", "party": "Republican", "sentence": "…31-year career  serving our Nation in the U.S. Army, holding numerous leadership  positions across every level. As Chief of Staff for the 49th Armored  Division, he played a pivotal role in preparing the unit for deployment  in support of peacekeeping operations in war-torn Bosnia. Once  deployed, he assumed the role of Chief of Staff for the Multi-National…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689317/saluting-the-service-of-colonel-garry-patterson"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…associated with NASA, Houston  and Cape Canaveral come to mind, but I am here to tell you tonight, Mr.  Speaker, that Utah should be added to that list. While Utah has played  a pivotal role in the history of NASA since the dawn of the space age  in the mid-20th century, we are fast moving into a starring role.\n\nWe stand at the crossroads of an exciting new…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687925/space-dominance"}, {"senator": "French Hill", "party": "Republican", "sentence": "…and chief operating  officer, and she became the agency's first female director in early  2020.\n\nLorie guided the department through the challenges of COVID-19,  played a pivotal role in the Connecting Arkansas Program, which  included over 30 State highway construction projects and helped  modernize the Natural State's transportation infrastructure.…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688705/recognizing-lorie-tudor-on-her-retirement"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…emigrants,  missionaries, and homesteaders.\n\nFrom 1841 to 1890, the area served as an important military outpost.  Renamed Fort Laramie by the U.S. Army, the post played a pivotal role  during the Westward expansion. The fort served as an integral resource  for settlers, traders, and the U.S. military throughout the Western  Territories. As an important…", "date": "2025-07-31", "source_url": "https://justfacts.votesmart.org/public-statement/1694485/100th-anniversary-of-fort-laramie-wyoming"}]