[{"senator": "Hillary Scholten", "party": "Democrat", "sentence": "Through their  resourcefulness and perseverance, they embody the Girl Scout Law to  truly make the world a better place.", "title": "Recognizing Paige Kitts", "date": "2025-07-23"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "Violence and hate have no place in America.", "title": "Minnesota Lawmakers Shooting", "date": "2025-06-16"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "There are millions of people in this country who  cannot physically get to a polling place.", "title": "Providing for Consideration of S.J. Res. Disapproving the Rule Submitted By the Bureau of Consumer Financial Protection Relating to ``Overdraft Lending: Very Large Financial Institutions''; Providing for Consideration of S.J. Res. Disapproving the Rule Submitted By the Bureau of Consumer Financial Protection Relating to ``Defining Larger Participants of A Market for General-Use Digital Consumer Payment Applications''; Providing for Consideration of H.R. No Rogue Rulings Act of Providing for Consideration of H.R. Safeguard American Voter Eligibility Act; and for Other Purposes", "date": "2025-04-01"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "The minimum tax has only  been in place for a few years, but already corporations and the private  equity crowd are trying to rip it to pieces, and clearly the Trump  administration is helping.", "title": "Providing for Congressional Disapproval Under Chapter 8 of Title United States Code, of the Rule Submitted By the Internal Revenue Service Relating to ``Interim Guidance Simplifying Application of the", "date": "2026-02-10"}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "It changed how this place, the U.S.", "title": "Commerce, Justice, Science; Energy and Water Development; and Interior and Environment Appropriations Act, 2026", "date": "2026-01-14"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "This is such an important discussion for Americans, and I  think most Americans don't realize what a deliberate effort this was  for years to take away their power and place it in the hands of the  wealthiest and, unfortunately, the most obscenely greedy people in this  country who think only they have the wisdom to govern.", "title": "Restoring Election Integrity", "date": "2026-01-21"}, {"senator": "Jan Schakowsky", "party": "Democrat", "sentence": "Speaker, I rise today to recognize the 22nd  Annual Disability Pride Parade taking place in Chicago's Loop on  Saturday, July 26.", "title": "Recognizing the 22nd Annual Disability Pride Parade", "date": "2025-07-22"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "I want to  thank Senators Gallego, McCormick, and Britt for introducing this  bipartisan bill with me, and I hope our colleagues will join us in  supporting solutions that ensure no veteran is left without a safe  place to call home.", "title": "By Mr. Padilla (For HimsMcelf, Mr. Cormick, Mr. Gallego, Mrs.Thank Senators Gallego, Cormick, and Britt for Introducing This", "date": "2025-04-10"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "So  you go into a community, you go into a place where a shooting has  happened, and you do work with the victim of that incident to make sure  that it doesn't become a cycle of violence.", "title": "Gun Violence", "date": "2025-05-08"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "Then, in the Point Place neighborhood of Toledo, I saw a church sign  that read:\n\nLove Always Heals.", "title": "Resisting the Temptation to Divide", "date": null}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "Let's get some reforms in place that allow our citizens to feel safe,  for there to be accountability''--we are being told that it is too  complicated because we already have a bill and we will have to divide  it, and that means procedural hassles; that means, oh, the House will  have to come back.", "title": "-9999", "date": "2026-01-28"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "As we learn of these communities with toxic exposure and illness  beyond the battle, we need to make sure that we have adequate systems  in place to take care of them.", "title": "Aces Act", "date": "2025-05-05"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "So don't tell me that your so-called reform is about  integrity at the ballot place.", "title": "Terminating the National Emergency Declared to Impose Global Tariffs", "date": "2025-04-30"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "These unpaid bills often lead to Tribal members paying  those themselves and being saddled with medical debt that they should  never have incurred in the first place.", "title": "Medical Debts of Tribal Members", "date": "2025-05-08"}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "Connolly, lived his life serving others and  making our country a better place.", "title": "Gerald E. Connolly Esophageal Cancer Awareness Act of 2025", "date": "2025-06-03"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "Each of these recognitions affirms what Iowans already know: Iowa  Stead Family Children's Hospital is a place of hope, healing, and  leadership.", "title": "Recognizing Stead Family Children's Hospital", "date": "2025-10-29"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "The place  went nuts when he was recognized--a 5-minute standing ovation for this  great American hero.", "title": "Recognizing the 250th Anniversary of the United States Marine Corps", "date": "2025-11-09"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "I can't figure out why this place is so intellectually calcified that  they are terrified of changing it.", "title": "Republican Budget", "date": "2025-02-25"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "``(B) The production of books, papers, documents,       electronically stored information, or tangible things from       any place in the United States by any party or witness having       custody or control thereof for purposes of discovery or for       use of the things produced as evidence in accordance with the       rules and orders of the Tax Court.", "title": "Tax Court Improvement Act", "date": "2025-12-01"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "It brings together  residents and visitors alike and highlights the unique charm that makes  Savannah such a special place.", "title": "Recognizing the Savannah Christmas Market", "date": "2026-01-07"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "Speaker, I highlight a special place in Camdenton,  Missouri, in the Fourth Congressional District of Missouri: The Funky  Buffalo Coffee House and Trading Company, a weird name, but a great  place.", "title": "Recognizing the Funky Buffalo Coffee House and Trading Company", "date": null}, {"senator": "Andy Barr", "party": "Republican", "sentence": "If she is so concerned about no  branches, not enough branches, banking deserts, why is she voting  against making it easier for new banks to form in those places where  there are no financial services?", "title": "Providing for Congressional Disapproval of the Rule Submitted By the Office of the Comptroller of the Currency of the Department of the Treasury Relating to the Review of Applications Under the Bank Merger Act", "date": "2025-05-20"}, {"senator": "Rudy Yakym III", "party": "Republican", "sentence": "We didn't have a place to turn until one of her  friends suggested that we go to a pregnancy resource center.", "title": "Supporting Pregnant and Parenting Women and Families Act", "date": "2026-01-21"}, {"senator": "French Hill", "party": "Republican", "sentence": "With this final addition, the Flatside Wilderness area can continue  to serve central Arkansas as a place of economic, recreational, and  historic importance.", "title": "Flatside Wilderness Additions Act", "date": "2025-05-13"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "Now, whether my colleagues want to  admit it or not, the world is a safer place because President Trump had  the backbone and the stones to do what nobody else would: bring Nicolas  Maduro to justice.", "title": "Removal of the Use of United States Forces for Hostilities Within or Against Venezuela", "date": "2026-01-22"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "Remember that when you have dangerous people in  places like Minnesota and lawless States like California and New York,  where you have sanctuary cities, then there are dangerous people  throughout our country, too.", "title": "Ice Under Attack", "date": "2026-01-13"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "They will be  able to say, hey, Walmart is a credible place, you really were there,  you really did spend $100 at Walmart.", "title": "Central Bank Digital Currency", "date": "2025-06-26"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "After the project broke ground, inflation took place.", "title": "Finish the Arkansas Valley Conduit Act--Veto Message From the President of the United States", "date": "2026-01-08"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "2290 provides that authority, ensuring this memorial can be located in  a place of national prominence alongside other monuments honoring  wartime service and sacrifice.", "title": "World War II Women's Memorial Location Act", "date": "2025-12-09"}, {"senator": "James Risch", "party": "Republican", "sentence": "With all of this in mind and the fact that, at this time and place,  this resolution is not in the best interest of the United States, I  object.", "title": "-9999", "date": "2025-11-19"}]