[{"senator": "George Latimer", "party": "Democrat", "sentence": "…government.\n\nLet me recognize: New Rochelle, Joan Alexander; Larchmont-Mamaroneck,  Louise Perez and Beth Radow; Scarsdale, Beth Cukier; Rivertowns, Susan  Maggiotto; White Plains, Alan Cass; Rye-Rye Brook-Port Chester, Liz  Rotfeld and Roz Carvin; and the Countywide League of Women Voters of  Westchester for the past 5 years under the leadership of…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692778/recognizing-league-of-women-voters-leadership"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…Jareca Lee;\n\nIn Yonkers, Kisha Skipper and Karen Edmonson;\n\nIn Williamsbridge, Laura Rhodan and Shirley Fearon;\n\nIn Mt. Vernon, Kathie Brewington and A.J. Woodson;\n\nIn White Plains-Greenburgh, Janice Griffiths;\n\nIn Port Chester-Rye, James Henderson III.\n\nI also recognize other leaders such as Minister Mark McLean, Reverend  Frank Coleman, and Reverend…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693011/recognizing-local-naacp-leaders"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…reduced staffing levels at field offices have made it more  difficult to schedule a timely appointment.\n\nIn my district, the Social Security Administration closed the White  Plains hearing office, forcing constituents in Westchester to travel  farther distances at a greater expense to receive in-person service.\n\nI implore this body to hold the Social…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699376/concerning-state-of-service-at-social-security-administration"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…conveniently  ignoring the fact that grid operators can already do that.\n\nThis isn't some hypothetical power. Grid operators from the mid- Atlantic, the Midwest, and the Great Plains have this year all made  tweaks to the processes they use to hook power plants up to the grid.\n\nIn reality, the point of this bill, in my opinion, is to prioritize  fossil…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695754/guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…is much more ahead for him and the  people he serves. We salute Derrick from the floor of the House of  Representatives.                    Saluting the Community of White Plains\n\nMr. LATIMER. Mr. Speaker, the city of White Plains, Westchester  County's seat of government, is a dynamic city of over 60,000 people,  with major corporations headquartered…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699911/recognizing-derrick-thompson"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…Mr. Speaker, the new administration, as it  indiscriminately cuts services, has announced that it will not keep the  Social Security Administration's hearing office in White Plains, New  York. Closing this hearing office with no local replacement is  unacceptable to the community it serves, and it covers multiple  congressional districts.\n\nSeniors and…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687931/white-plains-social-security-hearing-office-closure"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…service.\n\nThe wait times, in terms of people trying to get appointments in  person, are going to get longer. Just in the Northeast, we have already  been told that the White Plains office in New York is going to be  closed, and they are telling people to go to New Haven, Connecticut, my  State. That is about a 2-hour drive for people if they want to have…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689134/dont-touch-social-security"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "Mr. LATIMER. Mr. Speaker, it is with great appreciation that I rise  to recognize Dr. Stephen A. Ferrara, DNP, FNP-BC, FAANP, FAAN of White  Plains, New York for his outstanding leadership and contributions as  President of the American Association of Nurse Practitioners (AANP).\n\nDr. Ferrara is a dedicated health care…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690400/recognizing-the-service-of-dr-stephen-a-ferrara"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "Mr. LATIMER. Mr. Speaker, I want to recognize an important faith  institution in the city of White Plains celebrating its 90th year of  worship and service: Calvary Baptist Church.\n\nThe leadership and congregants have been a bedrock for worship and  values since its founding in…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697280/calvary-baptist-church"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "Mr. LATIMER. Mr. Speaker, Elon Musk's so-called department of  government elimination is closing the Social Security hearing office in  White Plains in May, just like that.\n\nWestchester County Executive Ken Jenkins offered the Federal  Government county space that would be more cost-effective. The offer  was turned down…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689272/social-security-cuts"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "…State Senator in the United States.\n\nWe are a Nation of pioneers. Martha beautifully embodies that  pioneering spirit. She immigrated to the United States, crossed the  Great Plains, and helped settle Utah when it was a frontier State. She  challenged societal expectations, standing alone in the fields of  science and politics, to advocate for her convictions.…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689363/womens-history-month"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "Mr. EVANS of Colorado. Mr. Speaker, I rise today to commemorate our  Nation's brave men and women and to recognize the High Plains Honor  Flight Network, which conducts trips for veterans to Washington, D.C.,  to tour the monuments built to honor their bravery and service. The  High Plains Honor Flight…", "date": "2025-10-31", "source_url": "https://justfacts.votesmart.org/public-statement/1696496/recognizing-the-high-plains-honor-flight"}, {"senator": "John Thune", "party": "Republican", "sentence": "…Dakotans were concerned  about the loss of choice and about being forced into electric vehicles  that aren't suitable for the long distances and bitter cold of life on  the Great Plains. So the elimination of this mandate is welcome news in  South Dakota, as I am sure it is for a lot of Americans around the  country.\n\nHere in Congress, we are joining the President…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689698/energy-regulations"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "Mr. ARRINGTON. Mr. Speaker, I rise today to recognize a group of  remarkable young women from the plains of West Texas who are making  history on the national stage, our Texas Tech Lady Raiders' softball  team.\n\nThese athletes have battled all season long, with an impressive…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692008/recognizing-texas-tech-girls-softball-team"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…throughout the Western  Territories. As an important stop for people traveling to Oregon, Utah,  and California, it was the largest and best known military posts on the  Northern Plains, earning the nickname the ``Grand Old Post.''\n\nIn 1890, the Army decommissioned the fort and sold the land and  buildings to local residents. In its absence, the settled town…", "date": "2025-07-31", "source_url": "https://justfacts.votesmart.org/public-statement/1694485/100th-anniversary-of-fort-laramie-wyoming"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…West Texas--the groundbreaking of the Crossroads Business  Park in Big Spring, Texas.\n\nThis development is the first major business park in West Texas tied  to the Ports-to-Plains initiative, which will transform the I-27  corridor from Dumas to Laredo. The hundreds of acres of new office  space the Crossroads Business Park will create is a model of…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692259/recognizing-the-groundbreaking-of-the-crossroads-business-park-in-big-spring-texas"}]