[{"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…to say, ``I told you so.''\n\nSuma Metla, a pediatric physical therapist and mom, treats kids with  complex needs. Forty percent of her patients are on Medicaid. She told  me plainly, as she sat in my office today with her 1-year-old, Kashi:  If these cuts pass, we will not survive past this year.\n\nAlready, speech therapists and other specialists are shutting…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691418/gop-tax-scam-hurts-everyone"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…out of this country.\n\nMr. Speaker, I want to say that, over the last hour, the American  public has heard directly as Members of Congress came to this hallowed  floor to talk plainly about the grave constitutional crisis unfolding  in our country. We have heard the names Kilmar Abrego Garcia and Andry  Hernandez Romero. We have spoken of students taken…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690506/trump-immigration-policies"}, {"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…due to inflation during Trump's first  year back in office.\n\nYet, after running on lower prices, Trump now calls this  affordability crisis a hoax. Just last week, he said plainly: ``I don't  want to drive housing prices down. I want to drive housing prices up. .  . .''\n\nThat tells us exactly whom he is fighting for: Wall Street  speculators and billionaires,…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699586/stop-the-republican-affordability-crisis"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…beautiful phrase in the New  Testament that says: From the fullness of the heart, the mouth speaks.  On this topic, the President has a very full heart, and he has spoken  very plainly about his motivation.\n\nIn the speech marking the beginning of his campaign in 2016, day one,  President Trump embarked on a tirade against Mexicans and Mexican- Americans…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699611/9999"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…care.\n\nI hear from families all across north Texas every day begging for  help. One constituent in Dallas, a small business owner with a child  who has type 1 diabetes, told me plainly: ``I need these tax credits so  my baby can survive.''\n\nThis is life or death for so many families in our communities. Yet,  Republicans have refused to extend these tax credits,…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698596/providing-for-consideration-of-hr-breaking-the-gridlock-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…easy to start, but they are  hard as hell to stop.\n\nThis resolution ought to pass no matter what you believe about  further military involvement in Venezuela. What it says plainly is that  if the President is contemplating further military action, then he has  a moral and a constitutional obligation to come here and get our  approval.\n\nThe people we…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699359/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…industrial  and agricultural heartland.\n\nTrade policy must be targeted carefully, and it should never cause  chaos. That is exactly what it is doing, causing chaos. Let me state  plainly: Tariffs on our Canadian allies are foolish. The businesses and  people of northwest Ohio and all of Ohio and the industrial  agricultural Midwest overwhelmingly oppose this…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688734/americans-are-in-for-a-rough-ride"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "Mr. BOOKER. Mr. President, I just want to first thank my colleague  from California for stating so plainly about the character of the  individual we are talking about.\n\nWe have justifiable disagreements in this body. We have strong-held  beliefs in this body. We have real debates…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692454/alex-padilla"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…cannot  eat food without getting sick. Her daughter relies on Medicaid to pay  for the formula that keeps her alive.\n\nWithout it, she won't just struggle. As her mother wrote plainly to  me: ``If she loses Medicaid, she will die.''\n\nMr. Speaker, we must not gut Medicaid to give tax breaks to  billionaires while moms are begging for their children to survive.…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691433/gop-tax-scam-hurts-women-and-families"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…people against their will and stealing  their property that they should have had in their own bodies and in  their own lives.\n\nThe resolution is completely disoriented. It plainly feeds into the  decades-long Republican obsession with labeling the great programmatic  achievements of American democracy as socialism, including Medicare,  Medicaid, Social…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697148/denouncing-the-horrors-of-socialism"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…what the President is trying to do.\n\nWhat is most alarming is not just that Donald Trump spoke those  words, but that so many congressional Republicans have refused to say  plainly what the Constitution requires. Silence in the face of an  unconstitutional power grab is not neutrality. It is acquiescence to  the undermining of the U.S. Constitution.…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700022/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…standards; to farmworkers  who already endure grueling conditions are being stripped of hard- fought protections.\n\nNone of this is okay. This is not normal.\n\nAllow me to say this plainly for the second time tonight: If you work  in America today, you are less safe than you were a year ago. You are  more likely to be underpaid, exploited, or ignored. This is…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695577/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…This is what it looks like when a country values science.  Meanwhile, we are bleeding talent.\n\nAs ranking member of the House Veterans' Affairs Committee, I need to  speak plainly: Our veterans are being hurt, too.\n\nIn Pennsylvania, doctors at VA hospitals warned that lifesaving  cancer trials were being shut down. I was told by the Secretary--I  rushed…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691392/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…this industry, especially as  the Chinese Communist Party is advancing in the remote sensing sector.\n\nAs a 2024 report from the Center for Strategic and International  Studies plainly put it: ``Should any one country dominate the  commercial remote sensing market, not only could it gain economic  advantages, but it would also control the information narrative…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688973/commercial-remote-sensing-amendment-act-of-2025"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…terrorist  activity is presently inadmissible to the United States and is  presently deportable. Hamas has been designated as such a terrorist  group since 1997.\n\nWe already plainly have the legal tools to keep any noncitizen  involved with Hamas, as well as any noncitizen who was involved in the  horrific terror attacks of October 7, out of this country…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697236/no-immigration-benefits-for-hamas-terrorists-act-of-2025"}, {"senator": "Mike Johnson", "party": "Republican", "sentence": "…We did not write this bill for the Democratic Party, the elites,  or the media. This bill is for hardworking Americans, and they deserve  it.\n\nI am going to just say this as plainly as I can. This is the simple  truth. If you are for a secure border, safer communities, and a strong  military, this bill is for you. If you are for commonsense fiscal  responsibility…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693177/one-big-beautiful-bill-act"}, {"senator": "Rudy Yakym III", "party": "Republican", "sentence": "…from the  Biden-Harris administration. There were nearly 9 million encounters at  the southern border under President Biden, more than the last 14 years  combined.\n\nYou can plainly see the difference between the first 5 months of  President Biden and the first 5 months of President Trump on this  chart.\n\nAs it turns out, all we really needed was a new…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693161/one-big-beautiful-bill-act"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…Colorado. Mr. Speaker, our colleague Doug LaMalfa passed  away on Monday, and I want to take just a minute--he would have liked  that--to honor him the best way that I know how: plainly.\n\nDoug believed that we should speak clearly, not in jargon. He had a  whiteboard in his office labeled unacceptable words, and he meant it.  The words ``stakeholders,'' ``empower,''…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698710/9999"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…surrender to hopelessness. He spoke  truth when others stayed silent. He strengthened resolve when others  faltered. He understood that a single courageous leader speaking  plainly, boldly, and without apology could ignite the moral energy of  millions.\n\nWe are seeing that in Maryam Rajavi right now, and I will talk more  about that in just a minute.…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697723/free-iran"}]