[{"senator": "Jared Huffman", "party": "Democrat", "sentence": "…be clear. This  resolution isn't about helping the common worker, it is about  Republicans making good on their promise to deliver for Big Oil  billionaires destroying our planet.\n\nMy Republican colleagues decided that the best use of our time today  is to debate whether or not we should keep a commonsense rule that  protects Tribal resources, worker…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688632/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…the environment. His coming to Washington will highlight the  role that religious leaders play in pursuit of these goals and remind  us to be stewards of all people and the planet before pursuing partisan  and personal ends.\n\nI congratulate His All-Holiness on the well-deserved and highly  impressive honor of being awarded the 2025 Templeton Prize, which…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695345/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…scientific and spiritual discourses. His  All-Holiness has exemplified a sense of responsibility towards coming  generations: to preserve, protect, and promote the health of the planet  on which we are honored to live.\n\nBeyond his environmental advocacy, His All-Holiness has been an  unwavering pillar in support of intersectionality, working to foster  relations…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696019/appreciating-the-presence-and-contributions-of-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…1,000 times in  the Epstein emails.\n\nPresident Trump and House Republicans continue to push their drill,  baby, drill agenda even though it makes no sense for people, for the  planet, or for our pocketbooks.\n\nMr. Speaker, I urge my colleagues to vote ``no'' on this distraction,  this S.J. Res.\n\nMr. Speaker, again, the plan that this resolution targets for…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696836/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…leader.\n\nSo that is where we are. Instead of catching up and overtaking China,  this bill will cede more jobs and more progress, and Republicans are  putting our health and our planet up for sale. This bill would increase  emissions equivalent to putting 72 million more cars on the road and  eliminates pollution-reduction programs, leading to approximately…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692644/one-big-beautiful-bill"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "…repurposing it to sustain a local farm.  I am truly impressed by her innovation and hard work. This creative  compost system keeps our community eco-friendly and helps protect our  planet for future generations. I thank and congratulate Kyla. I include  in the Record this article from the Central Oregon Daily written by  Jakob Salao that details Kyla's hard…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695344/recognizing-kyla-guerrero-for-her-impressive-gold-award-project"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…perhaps modeling a system to  be able to equitably donate organs to people or molecules to cure a  disease, modeling energy sources so that we can have a more safe and  healthy planet, or maybe even, unfortunately, having to model the  destruction of our infrastructure so that we can make sure that we have  the national security resources to be able to protect…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688979/mathematical-and-statistical-modeling-education-act"}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "…features of digital currency.\n\nLet's talk about the EU. It is widely acknowledged that the EU has  one of the most stringent data protection regimes and protection laws  on the planet. They have strict data protections, number one, on the  GDPR, so EU citizens have access to control of their personal data.  They have the right to be forgotten, which would…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693737/anti-cbdc-surveillance-state-act"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…participatory democracy, the world itself becomes at  greater risk.\n\nMr. Speaker, the United States of America is a pretty important piece  of the puzzle of life that the entire planet Earth is a part of. We  have got to protect this participatory democracy.", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697060/no-mandate-to-cut-medicaid"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…turn, this administration and my Republican  colleagues have engaged in a scorched-earth policy, a policy that  creates chaos across the country as the richest person on the planet  eliminates services that our Nation depends upon.\n\nMy friend from South Carolina earlier said that the policies would  bankrupt our country. What does he mean? Healthcare…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688065/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…subsistence and they  have been an essential piece of their traditional culture and way of  life.\n\nBecause it is one of the largest remaining untouched ecosystems on  our entire planet, I believe we should strive hard to protect it. It is  so unique. People do want to travel there. But many would like to  ignore the fact that it is a fragile and irreplaceable…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697560/hj-res-131"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…mines to continue to  operate through the end of their current leases. Rescinding this plan  means locking us into unnecessary emissions and energy costs at a time  when the planet and the American people cannot afford it. It also puts  us on a treadmill of litigation and uncertainty, sending us back  theoretically to a plan that was already adjudicated…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696881/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…Congress. The Clean Air Act  was a healthy respect for federalism and the role of sovereign States,  and the role of California--what is now the fourth biggest economy on  the planet--allowed California a waiver in order to be able to make its  own clean air auto emissions rules.\n\nSo beginning with the passage of the Clean Air Act, California took  advantage…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691656/congressional-review-act"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…exports, which have  been shown to drive up prices for American consumers.\n\nMr. Speaker, for the sake of our consumers, our national security  interests, and the future of our planet, I urge my colleagues to vote  ``no'' on H.R. 3062.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695689/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…percent of the excess heat, 30 percent of the carbon  dioxide, all absorbed by the oceans. Without that ocean effect, fossil  fuel emissions would likely have already made planet Earth unlivable  for humankind.\n\nWhen you account for ocean impacts, when you monetize those ocean  impacts, it nearly doubles the social cost of carbon to humankind. The…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699613/9999"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…receive the B-21 Raider, including Dyess Air Force  Base in the key city of Abilene, Texas.\n\nThe B-21 Raider represents the most capable and lethal bomber this  world and this planet has ever known and seen. It is the future of our  long-range strike capability, designed to evade modern air defenses and  deliver both nuclear and conventional payloads across…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692947/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…enacting a religious agenda that has no place for  anybody but them. If you are a Christian, they want to destroy your  faith. If you are Jewish, they want to wipe you off the planet. And if  you are a Muslim and you don't agree with them, which most don't, they  want to take over the entire faith and make you bend a knee to their  view. These people are…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692780/iran"}, {"senator": "Ron Johnson", "party": "Republican", "sentence": "…from Florida.\n\nI see the Senator from Michigan. I believe he wants to speak to this  bill. We will have the last word.\n\nMr. JOHNSON. Mr. President, I am not quite sure what planet the  Senator from Michigan comes from, but here on planet Earth, when you  read the actual language of the bill, none of these phantom provisions  exist in there. But I will…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696605/9999"}, {"senator": "Rob Wittman", "party": "Republican", "sentence": "…our Nation's security.\n\nMadam Chair, this year's NDAA is a strong, bipartisan bill that works  to keep the United States the most dynamic and lethal military power on  the planet.\n\nMadam Chair, I encourage my colleagues to support this bill.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695147/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…to this, to raise these issues to a lost  generation, consumed into devices that are destroying the minds of our  youth, devices that I would wipe away from the face of the planet  tomorrow if I could. I would, God's honest truth. The Amish are on to  something, but since I can't do that, can we not at least recognize  that these are poisoning our children?…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695719/highlighting-flawed-policies"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…energy security concerns was advancing  United States' production and unleashing American energy dominance. Now  the United States is the premier oil-producing nation on this planet.\n\nToday, we find ourselves, Mr. Speaker, in a similar disadvantaged  position. An adversarial nation controls the access to key resources,  as well as retains the ability to…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699990/securing-americas-critical-minerals-supply-act"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…HARIDOPOLOS. Mr. Speaker, I rise with my colleagues, in fact, the  freshmen Members of Congress, to reach far beyond party lines, beyond  State borders, and even beyond our planet. It affects every American,  shaping our economy, our security, and our future. I am talking about  space.\n\nAs President Trump said, you can't be number one on Earth if you…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687924/space-dominance"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…with       revolutionary promise as well as colossal dark threats to       human life, the painstakingly garnered civilization and the       very survival of all life on our planet Earth. Greenberg       attributes the impetus to writing this inspirational guide--      which aims to reassure readers from all persuasions that       covenantal life of the…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697168/the-triumph-of-life"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…away the plot, but the evil empire builds this Death  Star that is like a moon-sized place, and it can destroy entire planets  with one giant laser beam. Just boom and the planet is gone.\n\nIt is an amazing amount of power that the empire has built for  themselves in ``Star Wars,'' and, of course, it is fiction. The central  bank digital currency is…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693006/central-bank-digital-currency"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…how much prices have  not gone down but have gone up, I recommend you think about one  country, one of our most trusted and loyal allies--some of the nicest  people on the planet. Who doesn't like Canadians?\n\nCanadians have served alongside us in virtually every war we have  ever fought. They are a NATO ally and partner, and for my small-but- mighty…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689488/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…retiring as a lieutenant  commander.\n\nMr. Speaker, Dr. Mitchell has built a legacy of excellence and  dedication to others. Today, I honor him as he celebrates 100 years on  this planet, and I recognize a life that has given this Nation  countless reasons to smile. It is a privilege to share his story with  this Chamber.\n\nMr. Speaker, I wish Dr. Mitchell a…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698093/9999"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…rejoin the Paris climate accord. That is real serious. As my friend  already mentioned, they wanted to take this bill, it was obviously not  germane, they wanted to rename the planet, planet Trump. That is how  serious they are in their debate.\n\nI left out one of the other amendments my colleagues across the aisle  filed. They wanted to rename the Gulf…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690939/gulf-of-america-act"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…energy dominance.\n\nWe have more coal in this country than any other country in the  world. It is one of our most affordable, reliable, and abundant sources  of energy on the planet. And in America, we can use that coal cleaner  than ever before.\n\nWyoming's Powder River Basin produces the cleanest burning coal in  the world. Nearly half of all coal produced…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689762/coal"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…unfair to drunken sailors,'' which just  about sums it up.\n\nFor somebody like Elon Musk, who is reportedly one of the most  wealthy--maybe, the most wealthy person--on the planet to spend his  time and effort and to assemble a team like he has to work with the  government and to start the Department of Government Efficiency is a  huge public service.…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690662/department-of-government-efficiency"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Superior National Forest  from mineral exploration and development.\n\nMr. Speaker, at issue is the Duluth Complex in northern Minnesota,  one of the largest mineral deposits on the planet, including the  world's largest copper-nickel deposit.\n\nThe Federal Government routinely granted and renewed mineral leases  to these deposits beginning in the 1960s. Decades…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699275/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}]