[{"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…BEYER. Mr. Speaker, I wish to recognize the extraordinary work of  Good360, an organization located in the heart of my district in  Alexandria, Virginia. This organization plays a vital, yet often  overlooked, role in reducing the impact of large-scale emergencies and  disasters across the United States.\n\nAs the second largest nonprofit in the Nation,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694807/recognizing-good360-in-honor-of-national-preparedness-month"}, {"senator": "Doris Matsui", "party": "Democrat", "sentence": "…bill to ensure America continues to stand as a  global leader in communications and technology.\n\nThe National Telecommunications and Information Administration, or  NTIA, plays a vital role in ensuring the United States' strong  technological leadership.\n\nThis Federal agency is integral for getting people connected,  ensuring we can communicate in emergencies,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690255/national-telecommunications-and-information-administration-reauthorization-act-of-2025"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…Without Medicaid, she and many others like her would be       left without critical care, increasing the risk of       institutionalization or homelessness.\n\nMedicaid also plays a vital role in adoption. Many children       with disabilities, like my daughter, find forever families       because Medicaid provides the financial support needed to       care…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689543/h-con-res-14"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…when they start their ventures, so it is only right that the Federal  Government do what it can to provide them with a greater opportunity to  succeed.\n\nOur government plays a vital role in working to keep our economy  strong and vibrant, and Federal contracts can be a great opportunity  and boon for our small businesses.\n\nHowever, the government isn't…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687943/small-business-procurement-and-utilization-reform-act-of-2025"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…abuse of power.\n\nWe will join Republicans in passing this bill today, but we need to  finally get to work to deliver real change for the American people.\n\nMr. Speaker, HUD plays a vital role in providing safe and affordable  housing to families all across the United States. Families depend on  HUD's programs to keep a roof over their heads.\n\nH.R. 225 would…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697210/hud-transparency-act-of-2025"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…modernize its IT infrastructure and improve  its services to small businesses.\n\nBillions of dollars in Federal contracts are awarded to small  businesses every year, and the SBA plays a vital role in promoting  small business participation; however, over the years the SBA's  outdated and inefficient IT systems have made it harder for  entrepreneurs to access…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697272/sba-it-modernization-reporting-act"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…is about breaking  harmful habits, making informed decisions, and prioritizing health in a  way that protects not just individuals but the whole community.\n\nThis effort plays a vital role in addressing a stark and troubling  reality: Men have higher mortality rates in most of the leading causes  of death and have a lifespan nearly 6 years shorter than…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692206/raising-awareness-about-mens-health"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…among Federal,  State, and local agencies.\n\nCurrently, as the commanding officer of the New York Police  Department's Detective Bureau Tactical Training Unit, Mr. Camhi plays a  vital role in preparing law enforcement officers for the challenges  they face. Under his leadership, the unit provides essential tactical  investigative training to detective…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689427/recognizing-david-camhi"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…Mr. Speaker, I rise today to speak on behalf of the United States  Grain Standards Reauthorization Act of 2025, a piece of legislation  that is more than 100 years old and plays a vital role in preserving  safety, quality, and a standard of excellence for the American grain  industry.\n\nIf we want America to maintain its status as the safest, most  abundant…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695054/united-states-grain-standards-reauthorization-act-of-2025"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…Department of Homeland Security, through agencies       like the Transportation Security Administration and the       Cybersecurity and Infrastructure Security Agency, plays a       vital role in detecting, assessing, and mitigating the risks       associated with vehicle-based threats.\n\n(6) Strengthened coordination between Federal, State,       local,…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696768/department-of-homeland-security-vehicular-terrorism-prevention-and-mitigation-act-of-2025"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…receptions, family reunions, and  community celebrations, it has hosted countless gatherings that reflect  the heart and spirit of Hanford. More than just a venue, the auditorium  plays a vital role in fostering civic pride, cultural expression, and a  shared appreciation for the city's rich local history--ensuring its  legacy will endure. The original vision…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698408/recognizing-the-hanford-civic-auditorium"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…their institutions and improve lives. Dr. Connelly embodies  that calling through his commitment to patient care and medical  education.\n\nIn addition to serving patients, he plays a vital role as the  associate program director for Memorial's internal medicine residency  program, helping train the next generation of physicians. Dr.  Connelly's leadership…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699008/dr-tim-connelly-receives-2025-georgia-physician-hero-award"}, {"senator": "Bernie Moreno", "party": "Republican", "sentence": "…those goods by cutting through redtape and  breaking down trade barriers. That means more exports, more jobs, and  stronger communities here at home.\n\nOn enforcement, ITA plays a vital role in confronting dumping  practices, countering illegal subsidies, and ensuring that foreign  competitors play by the rules. For too long, American workers were  undercut…", "date": "2025-07-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694342/confirmation-of-william-kimmitt"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…at the  intersection of national security and agriculture: foreign investment  in American farmland.\n\nThe Committee on Foreign Investment in the United States, or CFIUS,  plays a vital role in safeguarding our country by reviewing foreign  acquisitions that could pose risks to our national security. Ensuring  that CFIUS has the right expertise and authority…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692799/agricultural-risk-review-act-of-2025"}, {"senator": "Tom Tiffany", "party": "Republican", "sentence": "…mass marking.  This practice enables them to easily distinguish between hatchery fish  and wild fish populations.\n\nIn addition to tagging hatchery fish, this program also plays a vital  role in aiding cooperative fisheries management decisions with States  and Tribes by producing data on the health of the fishery.\n\nThe Great Lakes Mass Marking Program…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693992/great-lakes-mass-marking-program-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…broad positive economic effects of producing energy here at home.\n\nThe CRA isn't just about Montana. Energy security is national  security, and Montana's mining industry plays a vital role in ensuring  America and our allies maintain a strategic energy advantage over our  adversaries.\n\nWe can be sure of one thing: The people who benefit from America…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694888/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…within the community empower students to become  thoughtful leaders inside and outside the classroom.\n\nThe dedication of the teachers and staff at Hanford Christian School  plays a vital role in helping students across the Central Valley  thrive. I want to thank the entire faculty for fostering a learning  environment that helps our youth become the best…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698331/recognizing-hanford-christian-school"}, {"senator": "Nathaniel Moran", "party": "Republican", "sentence": "…deserves the support of this House on both sides of  the aisle.\n\nI urge my colleagues to vote for the Tax Court Improvement Act to  help strengthen a court process that plays a vital role in protecting  our taxpayers' rights and ensuring accountability of the IRS within our  tax system.", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697270/tax-court-improvement-act"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…a lasting  impact on the borough and the people he served. His commitment to  community engagement and civic responsibility stands as an example of  how local leadership plays a vital role in strengthening our  Commonwealth.\n\nI wish to congratulate Larry Keller on his service to the citizens of  New Hope Borough and thank him for his dedication to public…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699203/congratulating-larry-keller-on-his-service-as-mayor-of-new-hope-pennsylvania"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…animals. The  park provides luxurious accommodations, including glamping tents and a  private giraffe suite, giving guests the chance to stay close to  nature.\n\nThe park plays a vital role in wildlife conservation by educating the  public and supporting endangered species. The park's success has  significantly contributed to Madison's economy by attracting…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689617/commending-jekyll-island-club-resort-and-sea-island"}]