[{"senator": "Angie Craig", "party": "Democrat", "sentence": "…gave it to  them.\n\nLet's stop pretending that what happened in game five of the WNBA  finals was just a bad call. It wasn't.\n\nThe Minnesota Lynx clawed their way through the playoffs. They defied  the odds. They outworked every team and every narrative. In the final  seconds of a championship game, on the biggest stage, they didn't get  outplayed. They…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693881/taking-on-wnba"}, {"senator": "George Whitesides", "party": "Democrat", "sentence": "…heartbreaking  and inspiring story of the Santa Clarita Lady Flyers, a 12-under hockey  team that plays in my district.\n\nWhile on the way to the Western Girls Hockey League playoffs, a  snowplow collided head-on with one of their team vans, injuring five  players and killing Manny Lorenzana.\n\nWe remember Manny as a loving dad to Brody, an excellent partner…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700079/santa-clarita-lady-flyers-tragedy"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…Jesuit 35-7\n\nArchbishop Rummel, 19-6\n\nHoly Cross, 41-7\n\nDeLaSalle, 33-0\n\nChalmette, 34-0\n\nArchbishop Shaw, 26-0\n\nBrother Martin, 7-0                                STATE PLAYOFFS\n\nGeorge Washington Carver **, 29-8\n\nWest Jefferson **, 14-6\n\nSouth Lafourche, 20-7\n\nSulphur, 11-10\n\nCovington, 35-13\n\n** First 2 high school games held in the LA Superdome--40k…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695287/recognizing-the-50th-anniversary-of-an-historic-athletic-achievement-in-the-history-of-the-louisiana-high-school-athletic-association-lhsaa"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…After enduring a five-game losing streak, the Braves turned their  season around with determination and teamwork and ultimately secured an  at-large bid into Division 11 playoffs.\n\nIn the playoffs, the Braves became a different team and dominated  their way to the CIF Division 11 championship game.\n\nThis was the first CIF Southern Section championship…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697339/congratulations-to-the-lady-eagles-volleyball-team"}, {"senator": "Raul Ruiz", "party": "Democrat", "sentence": "…past year, the Coachella Football Club's Premier team, our semi- pro squad, dominated the field. They were SoCal East season champions  and went undefeated in the divisional playoffs. Coached by Aldo Caro  and Octavio Bustillos, this team played one of their best seasons yet,  and we are so proud of them.\n\nThey are not alone. The Coachella Football Club's…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692140/recognizing-coachella-football-club"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…played an incredible basketball game last night and brought them to  victory over the Rockets out of Texas and are going to advance onto the  next round of the basketball playoffs. So I congratulate the Dubs.\n\nSadly, that is where the good news ends. What we are going to talk  about for the rest of this evening is some bad news, bad for the  American…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690628/republican-tax-cuts"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…second title in its history. What makes this title even sweeter  is that Kent State knocked the Cougars out of the playoff tournament  last year.\n\nUC Clermont dominated the playoffs, thanks to their tireless work  ethic and family culture. Ending the season 23-4, the Cougars secured  the top tournament seed and rode the momentum to the national  championship.…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697701/recognizing-brandan-holliday"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…at the rural eastern edge of the 11th  Congressional District, Linville Hill Christian School has defied  expectations. After cruising through the regular season and the  playoffs, the boys' basketball team made their way to the Class 2A PIAA  Championship game.\n\nThough they trailed with four minutes to go in the fourth quarter,  late game heroism cut…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689659/congratulating-the-linville-hill-christian-school-boys-basketball-state-champions"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…their school ably on their way to achieving the Division  VII State Girls Volleyball Title. In their effort to surpass all other  teams in the Division VII State Volleyball Playoffs, the Calvert  Senecas overcame the challenges posed by intense competition.\n\nIn pursuing the State Championship, Tiffin Calvert defeated the  Monroeville Eagles to win the…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697947/recognizing-the-tiffin-calvert-catholic-high-school-on-winning-the-division-vii-state-girls-volleyball-championship"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…the PIAA Class 2A  State championship on Saturday, June 14, 2025.\n\nThe Manheim Central Barons cruised through the regular season, the  District Three championship, and state playoffs to end up exactly where  they had been the previous year: in the PIAA Class 2A championship  match against the same opponent. Manheim Central came up just short  with a silver…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692807/congratulating-the-manheim-central-high-school-boys-volleyball-state-champions"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…represented their school ably on their  way to achieving the Division II State Football Title. In their effort  to surpass all other teams in the Division II State Football Playoffs,  the Avon Eagles overcame the challenges posed by intense competition.\n\nIn pursuing the State Championship, the Avon Eagles defeated the  Cincinnati Anderson Raptors to win…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698001/recognizing-avon-high-school-on-winning-the-division-ii-state-football-championship"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…one. Their baseball program had  battled a history of ups and downs, not quite being able to finish the  drill, until now.\n\nFighting back from near elimination early in the playoffs, the St.  Simon's team overcame adversity to make their first State title series  since 2018. The boys swept their opponents from Pinewood Christian to  earn the GIAA Class…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692453/frederica-academy-baseball-team"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…their school ably on their way to achieving the Division VI State Girls  Basketball Title. In their effort to surpass all other teams in the  Division VI State Basketball Playoffs, the Columbus Grove Bulldogs  overcame the challenges posed by intense competition.\n\nIn pursuing the State Championship, the Columbus Grove Lady Bulldogs  defeated the Rootstown…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690078/recognizing-columbus-grove-high-school-winning-the-division-vi-state-girls-basketball"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…their  school ably on their way to achieving the Division IV State Girls  Basketball Title. In their effort to surpass all other teams in the  Division IV State Basketball Playoffs, the Bellevue Redmen overcame the  challenges posed by intense competition.\n\nIn pursuing the State Championship, the Bellevue Lady Redmen defeated  the Kettering Archbishop…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1689987/recognizing-bellevue-high-school-winning-the-division-iv-state-girls-basketball"}, {"senator": "Tony Wied", "party": "Republican", "sentence": "…West De Pere Phantoms football team for winning the WIAA Division 2  High School State Championship.\n\nFollowing an impressive regular season and dominant performance in  the playoffs, the West De Pere Phantoms traveled to Camp Randall  Stadium in Madison to compete in the 2025 WIAA Division 2 State  Football Championship.\n\nIn a hard-fought matchup, the…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697388/congratulating-west-de-pere-phantoms-football-team"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…their school ably on  their way to achieving the Division II State Girls Volleyball Title. In  their effort to surpass all other teams in the Division II State  Volleyball Playoffs, the Avon Eagles overcame the challenges posed by  intense competition.\n\nIn pursuing the State Championship, the Avon Eagles defeated the  Anthony Wayne Generals to win the…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697918/recognizing-avon-high-school-on-winning-the-division-ii-state-girls-volleyball-championship"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…represented their school ably on their way  to achieving the Division II State Boys Soccer Title. In their effort  to surpass all other teams in the Division II State Soccer Playoffs,  the Avon Eagles overcame the challenges posed by intense competition.\n\nIn pursuing the State Championship, the Avon Eagles defeated the  Kings Mills Knights to win their…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697971/recognizing-avon-high-school-on-winning-the-division-ii-state-boys-soccer-championship"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "…Brayant, Braeydn Darby, Isaiah Davis, Bas Guthrie, Preston Harshberger,  Warrick Mendoza, Dominic Olivito, and Cor Pinneo--throughout the entire  year, and this season's playoffs in particular, played with grit,  determination, and passion. In spite of being down by several  possessions at different points, they kept their composure and executed  the…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691925/jc-flag-football-championship"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…represented their school ably on  their way to achieving the Division VII State Football Title. In their  effort to surpass all other teams in the Division VII State Football  Playoffs, the St. Henry Redskins overcame the challenges posed by  intense competition.\n\nIn pursuing the State Championship, the St. Henry Redskins defeated  the Hillsdale Falcons…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697924/recognizing-st-henry-high-school-on-winning-the-division-vii-state-football-championship"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…represented their school ably on  their way to achieving the Division V State Football Title. In their  effort to surpass all other teams in the Division V State Football  Playoffs, the Liberty Center Tigers overcame the challenges posed by  intense competition.\n\nIn pursuing the State Championship, the Liberty Center Tigers  defeated the Wheelersburg…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697967/recognizing-liberty-center-high-school-on-winning-the-division-v-state-football-championship"}]