[{"senator": "Kweisi Mfume", "party": "Democrat", "sentence": "…the disadvantages that underrepresented  communities face, and he has vigorously advocated for diversity and  inclusion at all levels of his career.\n\nMr. Speaker, I am pleased to recognize Byron Allen in the hope of  encapsulating a man who has left a lasting mark on entertainment  without ever straying from his moral undertaking of corporate social  responsibility.…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696283/recognizing-a-magnanimous-media-mogul-mr-byron-allen"}, {"senator": "Chellie Pingree", "party": "Democrat", "sentence": "…it is my honor to speak in celebration of a  group of workers and artists who entertain live audiences in every  state across the country: the theatrical chorus. I am pleased to  recognize 2025 as ``A Chorus Year.''\n\nFrom Oklahoma! to Hamilton, some of the greatest art to come out of  the United States has been musical theatre, and a staple of this art…", "date": "2025-08-12", "source_url": "https://justfacts.votesmart.org/public-statement/1694729/recognizing-2025-as-a-chorus-year"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…like a well-planted tree: deep roots give you staying  power, sturdy branches let you grow, and a good neighborhood street,  well, that's your main limb. So today, I'm pleased to recognize a man  whose roots run deep and whose work on roots and limbs alike has  brought new life to Green Cove Springs, Florida. I rise to honor the  retirement of Steve Kennedy,…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696636/recognizing-the-retirement-of-steve-kennedy"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…Health Care, and Transportation  Services. Each one of these programs serves as a testament to their  unwavering commitment to community well-being.\n\nMr. Speaker, I am pleased to recognize the Community First Health  Centers staff and volunteers who have worked tirelessly to bring  accessible, high-quality healthcare to communities across Michigan's  Ninth…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694747/recognizing-community-first-health-centers-on-50-years-of-service-to-the-ninth-congressional-district"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…recognition of Ralph's decades of service as a  senior center coordinator. He is also a man of faith, and he regularly  attends First Methodist Church in Celina. I am pleased to recognize  Ralph today for being an upstanding American patriot and his  ongoing pursuit for freedom, strength, and integrity in our Nation.\n\nIt is an honor to bestow Ralph with…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690225/recognizing-congressional-patriot-award-recipient-ralph-odell"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…commitment to excellence is a shining  example to students across Ohio that achieving your dreams is possible  if you put in the hard work and never stop improving.\n\nI am pleased to recognize each hardworking player, supportive parent,  and committed coach who helped make this victory possible. I  congratulate Portsmouth High School as they celebrate this…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689346/joanna-sheaf-celebrates-100th-birthday"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "Mr. SMUCKER. Mr. Speaker, I am pleased to recognize and congratulate  Kyle Welk of Peach Bottom, Pennsylvania, on being named the 2025 Merle  Howard Award winner at the 58th World Dairy Expo in Wisconsin.\n\nHaving grown…", "date": "2025-10-28", "source_url": "https://justfacts.votesmart.org/public-statement/1696415/congratulating-kyle-welk-on-being-named-the-2025-merle-howard-award-winner"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…most cherished accomplishment is  raising a wonderful family with  seven children, all of whom were instilled with the values of  compassion, faith, and kindness. I'm pleased to recognize Beth today  for her important contributions to our community, and I wish her  continued success.\n\nIt is an honor to bestow Beth with the Patriot Award for her  exceptional…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694169/recognizing-congressional-patriot-award-recipient-beth-terrell"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…and have made a  lasting impact on our region.\n\nTherefore, on behalf of California's Third Congressional District and  the United States House of Representatives, I am pleased to recognize  the Rotary Club of Grass Valley for their outstanding contributions  throughout their 100-year history, and I commend them for their ongoing  and tireless devotion…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689211/protecting-medicaid-for-californians"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…Business Journal and Grayson  County's Top 40 Under 40 Business Professionals. He was also named  Citizen of the Year in 2024 by the Anna Chamber of Commerce. I am  pleased to recognize Nate today for a lifetime of servant leadership,  and I wish him continued success.\n\nIt is an honor to bestow Nate with the Patriot Award for his  exceptional service…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690209/recognizing-congressional-patriot-award-recipient-nate-pike"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…also won a state  cutting horse event alongside his daughter on Father's Day, making them  the first father and daughter champion duo on that special occasion. I  am pleased to recognize Punk for his dedication to serving our  community and being an upstanding leader to those around him.\n\nIt is an honor to bestow Punk with the Patriot Award for his…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690761/recognizing-congressional-patriot-award-recipient-punk-carter"}, {"senator": "Rick Crawford", "party": "Republican", "sentence": "…ensure that a lack of credits doesn't hamstring  new developments.\n\nMr. Chair, I urge my colleagues to support my amendment to H.R.\n\nMr. CRAWFORD. Mr. Chair, I am very pleased to recognize that my  friends on the other side of the aisle do recognize that we have a real  big problem with compliance burdens and the costs associated with that,  and how that…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698040/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…exceptional dedication to  education and promoting student success and academic achievement.\n\nTherefore, on behalf of the United States House of Representatives, I  am pleased to recognize Mrs. Danna McCoy for her significant  contributions to the Colfax Elementary School District and the young  students of the Colfax community.…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…Dan Hogan, on receiving the 2025 W.  Gene Davis Memorial Award as Class 3A girls Coach of the Year by the  Pennsylvania Soccer Coaches Association (PSCA). I am equally pleased to  recognize his colleague, Mrs. Lynn Parmer, for being named the  Assistant Coach of the Year by the PSCA.\n\nThe Cocalico Eagles soared under Hogan and Parmer's leadership.  During…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699464/congratulating-coach-dan-hogan-and-coach-lynn-parmer-on-coaching-honors"}, {"senator": "Rick Crawford", "party": "Republican", "sentence": "…distinguished member of the House  Permanent Select Committee on Intelligence, as well as the chairman of  the Committee on Financial Services.\n\nMr. CRAWFORD. Mr. Speaker, I am pleased to recognize the gentleman  from Georgia, Mr. Austin Scott, my good friend and a distinguished  member of the House Permanent Select Committee on Intelligence and  chairman of the…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698882/successful-operation-to-arrest-nicolas-maduro"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…left an indelible mark on countless students,  colleagues, and families within his community.\n\nTherefore, on behalf of the United States House of Representatives, I  am pleased to recognize Mr. Steve Holland for his substantial  contributions to the Bishop Unified School District and the students of  the Bishop community.            Recognizing Brandy Rost…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…Commissioners Court for the State of Texas. Sean's leadership  and community advocacy have made a profound impact on the City of  Celina and the North Texas region. I am pleased to recognize him today  for his unwavering dedication to public service, and I wish him  continued success.\n\nIt is an honor to bestow Sean with the Patriot Award for his  exceptional…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690277/recognizing-congressional-patriot-award-recipient-sean-michael-terry"}]