[{"senator": "Patty Murray", "party": "Democrat", "sentence": "…President Trump's own  health leaders championed mRNA research as groundbreaking scientific  advancement.\n\nBut with all the lives hanging in the balance, R.F.K., Jr., pulled  the plug on all Federal funding for mRNA research. Now, not only is  this a massive blow to our researchers and to our patients, but it is a  massive win, by the way, for China, which…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694964/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…including cars, of 145%.\n\nMeanwhile, within China, Xi's top-down push has been       broadly embraced by ordinary consumers, who are now as likely       to buy electric and plug-in vehicles as traditional gas-      powered cars, aided by relatively low electricity costs and a       batch of consumption-related subsidies.\n\nIn March, 52% of passenger…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694959/highlighting-advances-in-chinese-electric-vehicle-technology-and-the-need-for-american-investment-in-battery-technology"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…essentially kill every clean energy project in the country  that is not almost all finished. If it isn't going to be operational in  a very short period of time, they want to pull the plug.\n\nNow, why would they do that? Why would they do that when, in fact,  most of those projects are in red States, not blue ones, not States  like California but States like Indiana…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691621/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…Johnson.                  Centers for Disease Control and Prevention\n\nMrs. McBATH. Mr. Speaker, our public health system is on life support  while Secretary Kennedy pulls the plug on lifesaving programs.\n\nJust 9 months in, he fired his own CDC director and has forced out  disease experts who protected us through a pandemic and disease  outbreaks.\n\nHe…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695085/commending-myesha-cooper-and-robert-johnson-south-fulton-police-officers"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…If we pass this resolution--the resolution which the Republicans are  malevolently bringing out onto the floor--we are not simply undoing a  regulation; we are pulling the plug on progress in our country; we are  abandoning millions of students who lack the internet access needed to  complete their homework, to attend class, to reach their full  potential.…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690803/addressing-the-homework-gap-through-the-e-rate-program"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…let SNAP  expire.\n\nTrump did this once before. In 2019, he funded SNAP during his last  shutdown. Back then, Trump kept SNAP funded. This time, he is  deliberately pulling the plug, even though in September he said he  would fund it and could fund it, independent of any shutdown.\n\nTrump is weaponizing hunger. He is using kids and parents as pawns.  Donald…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696462/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-record-of-decision-for-the-barred-owl"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…So California has had no option, but we have embraced the challenge  to innovate, to advance creative and indirect source rules or rules  that, for example, require ships to plug in when docked in our ports to  cut down on pollution.\n\nThat is why these waivers are so important. They let us get at these  mobile sources of pollution that we need to clean…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691583/hj-res-88"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…Williams was also an author and creative minister--writing  Order in the House and The Church Under Siege, producing the gospel  recording Zion Is Calling, and hosting the podcast Plug In With  Bishop--platforms through which he taught, encouraged, and lifted up  his community during seasons of trial and renewal.\n\nIn 2009, following the tragic loss of his…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699461/in-memory-of-bishop-dr-frederick-williams-sr"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…face a  diabetic complication or coma or even suffer a stroke. What will that  mean to his 12-year-old son?\n\nIt is unconscionable to think that the other party would pull the  plug on lifesaving health coverage and deny food to our most needy  children, but that is exactly what they voted for and celebrated on  July 4.\n\nAs Republicans moved this megabill…", "date": "2025-07-08", "source_url": "https://justfacts.votesmart.org/public-statement/1693251/one-big-beautiful-bill-act"}, {"senator": "John Mannion", "party": "Democrat", "sentence": "…district? In Massena, New York, jobs like the International Union  of Painters and Allied Trades, IUPAT, and others do not have those jobs  that were promised. They pulled the plug because those hydrogen fuel  tax credits were pulled.\n\nWe are fighting that challenge. The cuts, the loss of these jobs, and  the loss of promises and tax credits are impacting…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695609/devastating-harm-caused-by-trump-administration"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…must accelerate the manufacturing of cleaner  vehicles in a practical, affordable, and inclusive way. That means  building out EV charging infrastructure, keeping hybrids and plug-in  hybrids available, and assuring affordability, which is becoming one of  the biggest issues in this country, especially when we are competing  with at least one other country…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690490/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…soul. But that is not a person we have in  the Oval Office today.\n\nSo I do support efforts that a number of folks--and I believe you  might be well involved in--are striving to plug some of those loopholes  so that that power does not get deployed.\n\nMr. MERKLEY. Thank you.\n\nI note that we have a Senator from Wisconsin. I would be happy to  yield for a question,…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…time.\n\nSince my colleague mentioned the SPEED Act, which we will be marking  up in committee on Thursday, even though it is not on the floor today,  I will put in a shameless plug for our bipartisan legislation that is  not only tech neutral, but it is agnostic to the project, the project  type.\n\nIt would definitely help us produce more energy in America,…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696879/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…think. Just that  lowering, if you do the math on the back of an envelope, it is not that  hard. It is just a little less than $200 billion of loss of tax  receipts. If you plug that into our committed spending, it basically  means what we are going to have to borrow--you may have interest this  year of $1.1 trillion and a borrow this year when the…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689025/tell-the-truth-about-math"}, {"senator": "John James", "party": "Republican", "sentence": "…across the country.\n\nIn addition to air pollution, Republicans care about clean air. We  care about clean water. We also care about common sense. Maybe in  California they can plug their trucks into a tree, but in the rest of  the country we are relying on an energy grid that is still at least  half reliant on an all-of-the-above approach where we have…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690473/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…prescribe. It is for the renewal of your  prescriptions. As I was talking about before, my calcium inhibitor, my  hypertension medicine, the same one I have had for decades, I could  plug in my data to the AI, and it would order my prescription, and it  would be sent to me. It functionally has almost no cost.\n\nWe have dozens of examples that I have brought to…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698698/congress-is-a-math-free-zone"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…producers and American energy production. President  Trump said: No, we are not doing that. He has opened Alaska's vast  amounts of energy for the American people.\n\nHe pulled the plug on Biden's electric vehicle mandates. He reopened  625 million acres of offshore drilling. Remember, Joe Biden, in the  final days of his administration, with his midnight regulation…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688471/joint-session-of-congress"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…custom  duties. That is the tariffs. What is that offsetting? You will see me  over the coming weeks with a couple of charts and start saying: Okay,  here is what we have to plug into our models. For everyone who has been  whining around here, here is your math problem. I wish they would start  the whining with telling the truth on math and facts before…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691518/truth-telling-with-math-and-facts"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…agenda, let's do something  about it, dadgummit.\n\nThat means making sweeping reforms that may actually involve some  sacrifice, like passing a bill that I have--a shameless plug--End  Congressional Stock Trading Act, which would level the playing field  and help restore America's faith in Congress once again.\n\nThere is no reason in the world, Mr. Speaker,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690429/the-first-100-days"}]