[{"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…infant's.\n\nWhen they suffer from extreme malnutrition, they can't be fed  traditional food anymore. In order to save their lives and to cure  their malnutrition, they need this: Plumpy'Nut. It is a packet of  fortified paste. They take one of these per day. After a month, they  are back up to normal body weight and healthy once again.\n\nEdesia Nutrition in…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692267/calling-on-trump-administration-to-restore-food-aid"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…administration to restore lifesaving food aid for starving  children around the world.\n\nEdesia Nutrition, an organization in my district, in North Kingstown,  Rhode Island, manufactures Plumpy'Nut, a nutritional supplement that is  needed to get starving children back to health. When kids are starving,  their organs break down, and they cannot digest conventional…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695817/lifesaving-food-aid"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…specially designed for malnutrition among  children. There are high-calorie biscuits and a high-calorie peanut  paste enriched with milk powder that often goes by the name Plumpy'Nut.  It is designed to help children. It has a long shelf life. It doesn't  have to be refrigerated. To help save them from severe acute  malnutrition, couldn't we have enough…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694437/providing-for-congressional-disapproval-of-the-proposed-export-of"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…malnutrition, the Trump administration has stopped  funding this lifesaving program.\n\nIn my district in North Kingstown, Rhode Island, there is a warehouse  with 90,000 boxes of Plumpy'Nut, lifesaving food aid that is designed  to save the lives of starving children whose organs are shutting down  and can no longer process conventional food.\n\nThis food aid…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694157/plumpynut-saves-lives"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…around the world with HIV. They cut aid for malaria. They cut  aid for clean water around the world.\n\nThankfully, this bill did not cut funding for emergency food aid like  Plumpy'Nut. The problem is that even though this funding has not been  cut and it is still available, the Trump administration still continues  to hold up the money instead of getting…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692483/funding-for-edesias-plumpynut"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…food aid for  malnourished children. I see some of my friends and colleagues are here  who perhaps haven't heard this before. I will set aside my prepared  remarks.\n\nThis is Plumpy'Nut. It is a peanut paste that is used to treat  children with malnutrition whose organs are no longer able to process  food because they are starving.\n\nPrior to January, the…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693597/restore-funding-for-edesias-plumpynut"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "Mr. MAGAZINER. Mr. Speaker, I rise today for the 37th time to demand  that the Trump administration restore lifesaving food aid for  malnourished children.\n\nThis is Plumpy'Nut. It is manufactured in my district to treat kids  who are starving to death.\n\nMr. Speaker, when children are starving, their organs stop working.  They cannot digest regular…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695055/restoring-lifesaving-food-aid-for-malnourished-children"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…MAGAZINER. Mr. Speaker, I rise today for the 24th time to demand  that the Trump administration restore funding for lifesaving food aid  for malnourished children.\n\nThis is Plumpy'Nut. It is used to treat malnutrition. Until this  Trump administration began, we were shipping Plumpy'Nut around the  world, saving millions of lives a year. Starvation is…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692971/restore-funding-for-malnourished-children"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…MAGAZINER. Mr. Speaker, I rise today for the 25th time to demand  that the Trump administration restore funding for lifesaving food aid  for malnourished children.\n\nThis is Plumpy'Nut. It is a fortified peanut paste that has saved  millions of lives by getting safe nutrition to children in hard-to- reach places around the world. Until recently, this…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693021/trump-administration-needs-to-honor-its-word-on-food-aid"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…United States has stepped up in the face of these  tragedies. Edesia, an organization in my district in Rhode Island,  produces ready-made, ready-to-use food therapeutics called Plumpy'Nut  that has saved millions of lives in Sudan and more than 60 other  countries.\n\nThe Trump administration has stopped submitting new orders, and now  boxes of this lifesaving…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690624/support-for-edesia"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…starvation, needlessly and unnecessarily. For decades, the United  States has saved lives, particularly by providing funding for ready-to- use therapeutic food, also known as Plumpy'Nut. This is a miracle  treatment. This is a peanut-based paste that treats malnutrition,  doesn't need to be refrigerated, and can be shipped around the world.  You don't…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691610/global-report-on-food-crisis"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…Mr. Speaker, I rise today for the 16th time to beg the  Trump administration to honor its word and restore funding for  lifesaving food aid for starving children.\n\nThis is Plumpy'Nut, an emergency paste that is used to treat  malnourished children. Until recently, the United States shipped this  product all across the world, saving lives, saving the…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692007/cuts-to-public-broadcasting"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…for the 42nd time to call on the  Trump administration to restore lifesaving food aid for starving  children. Edesia Nutrition, an organization in my district,  manufactures Plumpy'Nut, a nutritional supplement that helps starving  children get back to health.\n\nTheir production has been largely shut down since the Trump  administration froze the program…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695735/edesia-nutrition"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…malnourished children,  even in the most remote corners of the world. Ready-to-use therapeutic  food, or RUTF, is a nutrient-packed peanut butter paste.\n\nRUTF, also known as Plumpy'Nut, delivers the fat, sugar, and protein  that children with malnutrition need to survive and grow. It requires  no refrigeration, and kids show improvement and are saved…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690379/edesia-nutrition-saves-malnourished-children"}]