[{"senator": "Kathy Castor", "party": "Democrat", "sentence": "…moment. It is going to keep electricity  bills going up, up, and up. I urge my colleagues to vote against this  bill and get back to work on serious solutions for people's  pocketbooks.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695692/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…Great Lakes economy is being choked by  reckless tariffs and inside-out trade policies that hit us hard,  including the district I represent in northwest Ohio. It hits our  pocketbooks and it hits the balance sheets of thousands of companies.\n\nTake a drive through the Port of Toledo. You will see mountains of  aluminum and steel stockpiled, stalled, waiting.…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690375/great-lakes-tariffs-and-trade"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…and medicine more affordable, and to help  our seniors get the care they need.\n\nWhat has he done instead? He has used his position to inflate his own  wealth and pad the pocketbooks of billionaire donors, all at the  expense of the very people who elected him.\n\nUnlike every single President before him, Donald Trump has refused to  divest his business…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691208/ending-pay-for-play-political-gifts"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…Although I support opening the government after  this devastating 43-day shutdown, I will not support a bill that will  continue the Republican's assault on Americans and their pocketbooks.  At a time when Oregonians and Americans are already struggling with  rising costs, this bill locks in devastating cuts to health care and  drives up the cost of health…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696722/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…401(k) lately? People are very  uncertain.\n\nLet's get back to business, standing up for hardworking Americans,  standing up for businesses. Let's make sure we guard their pocketbooks  and tackle the affordability squeeze together, rather than serve the  special interests that all have too much power. Republican billionaires  and Big Oil companies are…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689260/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…that oversee the nuclear enterprise and our nuclear  weapons; and tariffs, which are, in essence, new taxes on American  families and businesses, is really socking it to the pocketbooks of  American families and businessowners, except for billionaires like Elon  Musk, who stand to win big from the tax breaks for billionaires that  Republicans are moving…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688544/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…have without these  crazy tariffs that the President wields like a tool of retribution and  fear.\n\nThat is not how you--you have got to keep the American people and  their pocketbooks central rather than you are threatening Greenland. He  has to have Greenland. He is going to insult Canada and put tariffs on  Canada.\n\nThankfully, later this afternoon,…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699992/securing-americas-critical-minerals-supply-act"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…concern for Americans, and it baffles me  that Republicans would cause such unnecessary harm to low- and middle- income households.\n\nI will continue fighting to protect your pocketbooks as we defend  your right to affordable healthcare. We cannot claim to be the greatest  country on earth when one side is willing to watch millions suffer or  be kicked off…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696975/stories-from-home-the-human-cost-of-expiring-healthcare-tax-credits"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…affect all Rhode Islanders.\n\nWe buy a lot of energy, for instance, from Canada, and that is going  to raise costs for Rhode Island families. It is a direct hit to  people's pocketbooks. And as has been pointed out, this is just a shady  way to hit Americans in the pocketbook, to raise revenue so that this  phony-baloney budget resolution we are about to…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689472/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…discussion going on about the Republican budget that is coming to the  floor likely tomorrow, and Democrats are here to say we are going to  fight to protect Americans' pocketbooks. We want lower costs.\n\nWe know the impact of the big, ugly bill was to raise healthcare  costs and to raise energy bills. It is really time that the average  working American…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695752/guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…wrong  side of history trying to prop up the dying coal industry. They are on  the wrong side of public land management. They are on the wrong side of  the American people's pocketbooks as they face rising electricity  costs.\n\nMr. Speaker, that is why I oppose this resolution, and I reserve the  balance of my time.\n\nMr. Speaker, it occurs to me that as…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696881/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "Ms. CASTOR of Florida. Mr. Chairman, I thank the ranking member for  yielding me time and thank her for everything that she does to protect  the pocketbooks of American families.\n\nMr. Chairman, American families and small business owners deserve  lower electric bills, but Republicans in Congress are really sticking  it to folks…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694853/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…the last priority on Republicans' list.  Instead, they want to give a massive tax giveaway to the wealthy and  the well-connected while people really need help with their  pocketbooks. They need help. They want to retain their healthcare. They  want to make sure that the ocean waters are free of pollution.\n\nPlease vote ``no'' and focus on what is important.", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690936/gulf-of-america-act"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…Epstein emails.\n\nPresident Trump and House Republicans continue to push their drill,  baby, drill agenda even though it makes no sense for people, for the  planet, or for our pocketbooks.\n\nMr. Speaker, I urge my colleagues to vote ``no'' on this distraction,  this S.J. Res.\n\nMr. Speaker, again, the plan that this resolution targets for  disapproval is not…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696836/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…billion? The American  taxpayer. The countless pay-to-play schemes and vanity projects that  have consumed his administration, all paid by American taxpayers, are  stripping the pocketbooks of Americans to line their own.\n\nLast weekend, The New Yorker reported that the President and his  family have raked in $4 billion in personal profits by leveraging the…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699746/it-is-time-for-the-corruption-to-end"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Security benefits,  because the key to affordability is bigger paychecks, not bigger  government.\n\nPeople are going to be feeling the effects of these tax savings in  their pocketbooks this tax season, where Georgia families can expect up  to $5,000 in savings. By unleashing American energy, we are bringing  relief to families right now.\n\nThe national…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699063/how-republicans-have-delivered-for-americans"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…took office and ushered in  the worst inflation crisis since the 1970s.\n\nPresident Trump and my Republican colleagues believe that Americans  should have more money in their pocketbooks, not less, which is why we  are working to extend the President's 2017 tax cuts. These tax cuts  delivered historic growth for the economy, and if we fail to extend  them,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690548/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…but the trillions of dollars of debt that were racked up had  consequences, Mr. Speaker.\n\nIt had consequences not only in terms of our national debt, but it  affected the pocketbooks of families all across America because that  bloated spending in Washington, which is money we don't have, by the  way; and it increased inflation to the point where people…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692544/rescissions-act-of-2025"}]