[{"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…bipartisan  infrastructure bill to expand access to broadband and provide  telehealth services to rural and underserved communities.\n\nWe also passed legislation to cap the out-of-pocket costs of insulin  at $35 for seniors through the Inflation Reduction Act.\n\nWe also passed legislation to cap the annual cost of copayments for  Medicare recipients to $2,000 per…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690244/health-disparities-in-minority-communities"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…increase from $300/month to $2,449/ month. The only way they can pay that is to draw funds from their  retirement 401k, triggering tax penalties on top of the increased out- of-pocket costs. My office heard from many other constituents with  similar shocking increases, whose stories are attached to my written  statement.\n\nI also want to alert Members of the…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696732/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…Xarelto and Eliquis. Combined, in  1 year--just 1 year, when this starts next year; no one has refuted  these statistics--9 million seniors will save $1.5 billion in out-of- pocket costs in the first year alone and save taxpayers over $100  billion in the next decade. That is just 10 drugs.\n\nThey have now come up with 15 more drugs, including Ozempic and…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688282/department-of-health-and-human-services"}, {"senator": "Raul Ruiz", "party": "Democrat", "sentence": "…that rip off the American people. It does not cover essential health  benefits. It allows them to discriminate against people with  preexisting conditions, increases out-of-pocket costs, and will lead to  millions more uninsured.", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698369/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…ruin. I       relied on the ACA's Marketplace for my health coverage, the       only way I could secure a policy that didn't deny me for my       age, that capped my out-of-pocket costs, and that allowed me       to maintain my own health. Now, with funding cuts and       legislative actions targeting the core of the ACA, that       coverage is dissolving.…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696975/stories-from-home-the-human-cost-of-expiring-healthcare-tax-credits"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…library association.  She does some bookkeeping on the side. None of these jobs offers  benefits.\n\nHer projected monthly premium increased by $400, raising her monthly  out-of-pocket costs to $1,900, and her doctor moved out of network. It  is astonishing, she said. She spent 3 weeks combing through plans and  eventually found one that would save her family…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697649/restoring-enhanced-premium-tax-credits"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…Medicaid. As we look back at this monumental achievement, we should be  strengthening healthcare in the country, not undermining it.\n\nWe made progress, right? Capping out-of-pocket costs, passing my bill  to allow Medicare to finally negotiate for better prices, making  healthcare more affordable. But we should be building on that progress  because the status…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695910/government-funding"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…finally negotiated the prices and negotiated prices for those 10  drugs--which went down 60 percent, 70 percent--and will save 9 million  seniors $1.5 billion in out-of-pocket costs in just the first year  alone. No one has refuted these stats because this was the negotiation.\n\nNow this torch, this incredible effort to finally bring down  pharmaceutical…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689542/h-con-res-14"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…these cuts. So even if you have private health  insurance, your nearest hospital could close. You may have to wait  longer for an appointment to see a doctor. Your out-of-pocket costs may  increase. Hospitals will attempt to recoup that lost funding on your  back. They have no choice. They have to stay open, and they have to  cover their costs.\n\nTo make…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694385/9999"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…cancers will see  discounts of up to 79 percent for these essential drugs. There are 9  million American seniors who will save a total of $1.5 billion in  annual out-of-pocket costs, including nearly 300,000 seniors in  Illinois who take 1 of those 10 drugs.\n\nWhy did it take so darned long to lower these prices? Politicians  have been talking about…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698601/healthcare"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…at McDonald's because she doesn't want to let her  children go without healthcare.\n\nHer projected monthly premium increase is $400, which would raise her  monthly out-of-pocket costs to $1900. On top of that, her longtime  doctor has moved out of network. It is astonishing, she said.\n\nShe spent 3 weeks combing through plans and eventually found one that…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697213/medical-bills-are-too-high"}, {"senator": "Jim Costa", "party": "Democrat", "sentence": "…more than double compared to silver plans.\n\nIn my district, over 65,000 families risk losing Medicaid, and  another 22,000 families will face higher premiums and out-of-pocket  costs. Nationwide, nearly 100,000 American families could lose their  coverage each year if Congress fails to act.\n\nLast year, Republicans passed a partisan bill that failed…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698830/putting-americans-first"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…are getting notices saying: Here is what your  ACA premiums are going to cost you.\n\nThe figures are astounding. Without an extension of these credits,  average out-of-pocket premium costs for a family of four in Hawaii are  expected to increase from $10,000 to more than $16,000 a year--an  increase of more than $6,000, or $500 a month.\n\nMaybe in Trump's…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696175/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…primary care,       [it also] provides care for [people with] chronic illnesses,       prevents premature deaths, and protects people from       catastrophic out-of-pocket medical costs.\n\nLet me pull away from the nonpartisan group's remarks for a second  because I saw this as a mayor. When you scrimp on regular treatment for  people with chronic care,…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…predicted almost 5 million people could  lose their healthcare coverage. Families are being forced to reduce the  quality of their coverage, and they are facing higher out-of-pocket  costs.\n\nBack in October, one of my constituents from New Boston, NH, Darla,  contacted me with serious concerns about whether she and her husband  would be able to afford healthcare…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699085/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…was enacted, premiums have increased by 80 percent.  Since ObamaCare was enacted--let me say that again--the premiums have  increased by 80 percent. Deductibles and out-of-pocket costs have  skyrocketed. Families worry about medical debt--that is, those who  still have access to doctors. In fact, 150 rural hospitals have closed  since passage of ObamaCare,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698800/breaking-the-gridlock-act"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…does this by appropriating  dollars for cost-sharing reductions. This will stop the practice of  silver loading by putting dollars toward lowering beneficiaries' out- of-pocket costs, which in turn lowers premiums for Americans who are on  the so-called Affordable Care Act, again, by roughly 11 percent.\n\nToday, Mr. Speaker, you will hear my friends and…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698304/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…are suffering. I  repeat: Reopen the government, then let's have a conversation about the  areas in healthcare we can address to actually lower premium costs and  out-of-pocket costs for middle-income Americans.\n\nBy the way, the Democrats' current plan will only affect 7 percent of  the people on ObamaCare. Their plan ignores 93 percent of Americans…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696452/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…Many patients lose  the ability to work or support themselves long before coverage kicks  in, while families are left to shoulder an additional $20,000 a year in  out-of-pocket costs.\n\nCongress has acted before for rapidly progressing diseases like ALS.  We should do the same here. As one of my constituents put it, this bill  puts health and dignity…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700027/relief-for-early-on-set-alzheimers-disease"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…Act's original subsidies will remain in place. So  that is the original subsidies, ensuring that millions still qualify  for the income-based tax credit and capping out-of-pocket costs  relative to income.\n\nIt is the COVID era. I can't say that enough. It is the COVID-era  subsidies that are in question here, and premium increases are actually  driven…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696682/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…In 2026, the average deductible will be  $5,304, a 119 percent increase. That means that before your health  insurance even kicks in, you have to incur $5,304 in out-of-pocket  costs.\n\nSuch deductibles leave families effectively self-funding their care  despite being insured. A policy that you can't afford when you are sick  is not a real solution,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698804/breaking-the-gridlock-act"}, {"senator": "Mike Crapo", "party": "Republican", "sentence": "…list price, Congress should  ensure that patients can share in the savings reflected in the net  pricing points, enabling both increased transparency and reduced out- of-pocket costs at the pharmacy counter.\n\nWhat I am saying is that this is complex, and we are working and have  a working solution. I stand ready to work with the administration and  my…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694206/military-construction-veterans-affairs-and-related-agencies"}, {"senator": "Nathaniel Moran", "party": "Republican", "sentence": "…it has served to drive up the stock price for those  insurance companies by more than 1,000 percent since the ACA came into  existence.\n\nMeanwhile, families face out-of-pocket costs exceeding $20,000 a year  and a 95-percent increase in their premiums over that same time period.  This is hardly a coincidence in a system designed to reward the  insurers,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698806/breaking-the-gridlock-act"}]