[{"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…American manufacturing and American jobs, they don't mean  that they stand with American workers. They are there to stand with the  corporations and the people who line their pockets off of the sweat of  the hardworking men and women who actually do the work in this country.\n\nUnfortunately, as I look around this floor this evening, I don't see  a single…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695576/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…be much easier for them if the last remaining musk ox  hadn't survived the Ice Age or if the Porcupine caribou herd simply  went extinct, just to add a few dollars to their pockets today without  giving a damn about tomorrow.\n\nThe truth is, in my district back home in New Mexico, the Permian  Basin is a domestic energy powerhouse, fueling America's energy…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696905/defending-the-arctic-refuge"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "…insurance because Republicans don't provide money for  Americans to pay for the healthcare under the Affordable Care Act.\n\nAmericans don't have an extra $1,000 or $2,000 in their pockets every  month to pay for health insurance. They shouldn't have to choose  between being able to afford a doctor's visit or feeding their family.\n\nHouse Democrats' discharge…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698399/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…out of our schools  and communities that need it the most. They are going to cut off  funding that directly supports our students and teachers and send it  straight to the pockets of unaccountable private and for-profit K  through 12 schools.\n\nAnd on standing up for our students, standing up to President Trump,  Linda McMahon got it backward. When I…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688363/nomination-of-linda-mcmahon"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…unilaterally, not with a consultation of both sides. It was done on its  own in the Senate, in the dark, in cahoots with a bunch of people. It  includes a provision that will line the pockets of eight Senators that  we know of by allowing them to sue the government for millions of  dollars if the Department of Justice subpoenas their phone records or  seeks a lawful…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696743/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…are billionaires, are struggling to stay afloat in this economy.  While President Trump and his family use the White House to haul in  billions of dollars to line their own pockets, people will not be able  to access healthcare.\n\nI congratulate Mr. Buchanan and Mr. Evans on bringing forth this  bill. I certainly agree with them that people do better…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697171/hospital-inpatient-services-modernization-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…thing.\n\nI urge my colleagues to work with Democrats to ensure that the money  that was illegally stolen is returned, that in the future we return the  money directly into the pockets of working families who have had to pay  more for everything because of these damn tariffs.\n\nMr. Speaker, I can hardly believe my ears. The gentleman said that he  wants to…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700195/providing-for-consideration-of-hr-dont-mess-with-my-home-appliances-act-and-providing-for-consideration-of-hr-homeowner-energy-freedom-act"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…dollars from  Federal taxpayers.\n\nIt should be clear to everyone here: Under no circumstances should  the power entrusted to us as Members of Congress be used to line your  own pockets, period, full stop. Anyone who voted for this appalling  provision, including all but two House Republicans just last week,  should feel ashamed of themselves.\n\nAs these Republican…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696924/repeal-of-senate-notification-requirements-relating-to-legal-process-on-disclosures-of-senate-data"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…Jeff, and all these  billionaires pay their fair share. Their money has to be out of our  elections and out of the White House, and their hands out of the  working people's pockets and off our services, where our rights and our  freedoms mean working people have every single thing they need to  thrive.\n\nWe need bold legislative action if we are going…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699241/restoring-election-integrity"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…unaffordable for millions of people.\n\nI refuse to accept Republicans governing in the currency of cruelty.  It is critical that we restore these credits and put the money back in  the pockets of the people who need it the most.\n\nI urge every Member of this body, Democrat and Republican alike, to  support this bill and stand up for the American people. We deserve…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698596/providing-for-consideration-of-hr-breaking-the-gridlock-act"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…60-point margin among  the American public on putting a pollution limit, a carbon pollution  limit on big companies--72 to 12. That is where the American people  are, not in the pockets of Big Oil.\n\nHere is another one: Impose a fee on big polluters. It shouldn't be  pollute for free. If you are polluting something, whether it is your  neighbor's yard with…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697077/climate-change"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…connection with the January  6 insurrection.\n\nThe President and Congressional Republicans aren't looking for ways  to feed people or lower costs. They are thieves lining their pockets.\n\nI believe F. Scott Fitzgerald would have called them ``careless  people.''", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697099/careless-people"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "…Constitution. Yet, now, his conduct is even more extreme. Just  days before his inauguration, Trump launched a meme coin. Buyers can  now funnel money directly into Donald Trump's pockets, and it is  happening.\n\nWe know that he actually offered the top buyers of this coin a  private dinner at his golf club. He is basically selling access to the  Presidency…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690819/gross-violations-of-law-by-trump-administration"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…overturn the 2020 Presidential election.\n\nAt a time when Americans are struggling to get ahead, Republicans in  both the House and the Senate signed off on a deal that lines the  pockets of the very people who wrote it.\n\nIn every corner of my district, families are doing everything they  can to make ends meet. They are juggling rising grocery costs, higher…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697071/congratulating-tracy-eubanks"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…waste and fraud. Just look at the defense  budget. You just look at it. It is just loaded with waste and fraud,  but they aren't going to look there.\n\nThey are looking at the pockets of ordinary families in our country,  and they are going to tip them upside down and shake the money out of  their pockets, 2 days before Christmas, and make them pay more…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697772/healthcare"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…billion at the insurance companies, 85  percent has to be spent on healthcare. That is true.\n\nMr. Speaker, 15 percent of $500 that the insurance companies get to  put in their pockets is a whole lot less than 15 percent of $2,000. If  we throw more money at the insurance companies, the big insurance  executives get more money to put in their pockets. They…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698304/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…fraud, and abuse in  government spending. We have seen it over and over and over again.\n\nEvery time we have tried to get our economy back on track to put more  money in the pockets, by the way, of hardworking families, as we just  succeeded in doing with the One Big Beautiful Bill Act, every step of  the way, the only people trying to block that effort…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693719/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…I can't deny that a crowd favorite is calling it the  working families tax cut bill because it delivers the largest tax cut  in American history. It puts money back in the pockets of people who  need it most: people who rely on tips and overtime and people living on  Social Security. It lifts burdens off the backs of working parents,  retirees, and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695114/launching-golden-age-of-america"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…place in  Minnesota. Under State Democrats, billions of taxpayer dollars were  stolen by front groups that pretended they were providing social  services. But they padded their pockets. They basically took this money  from vulnerable individuals--programs that were intended for children,  for the elderly, for individuals with autism. So basically, they were…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698560/fraud-accountability-act"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…justifications are just excuses to play politics.  It is all at the expense of local residents and businesses who want to  and should be able to keep their hard-earned money in their pockets to  reinvest in their families, communities, and businesses.\n\nThe House must swiftly exercise its constitutional responsibility to  oversee the District of Columbia and reject…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699678/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…spending problem.\n\nUnder the new Trump administration, we can cut spending, deliver on  the mandate given to us by the American people, and put more money back  in Americans' pockets.\n\nAs I begin to yield back, I will await the false report on Medicaid  in Michigan.", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688056/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…important to them.\n\nThe thing I heard from constituents is how grateful they are that the  One Big Beautiful Bill Act will help them stay in business, keep money  in their pockets, and reinvigorate our local economies.\n\nSmall business owners operating shops on our Main Streets told me how  the 199A tax credit will help them afford to stay in business…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694798/promises-made-promises-kept"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…that are having to increase prices  and increase tuition and increase what they have to deal with simply  because of covering insurance premiums, which are going into the  pockets of insurance companies to provide you substandard options in  healthcare.\n\nThey don't provide you care. They don't. They are a middleman, a  funding mechanism that gets in…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697130/congress-is-back"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…part of the working families tax cuts, Republicans enacted  landmark policies like no tax on tips and no tax on overtime, which put  more money back into the working family's pockets.\n\nRepublicans are working hard to deliver solutions that help Americans  thrive. H.R. 2312 puts more money back in workers' pockets and eases  the burden on employers by removing…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698965/tipped-employee-protection-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…look forward to continuing to work with President Trump and Secretary  Bessent to ensure that U.S. dollars no longer are able to help build  the Chinese military and line the pockets of the country that is  working to undermine the international rules-based order and the United  States first and foremost.                                  ______\n\nBy Mr.…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688824/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…underscores one of the most significant problems that my  Republican colleagues and I have raised with these so-called ObamaCare  enhanced subsidies. They directly line the pockets of insurance  companies without lowering the costs for consumers and taxpayers, and  they do so in a way that is rife with fraud.\n\nWhen insurance brokers are enrolling patients…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697929/healthcare"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "…These appropriations bills that are included in the rule spend hard- earned tax dollars responsibly, reduce spending below current levels,  putting money back in Americans' pockets, and reduce our deficit. They  ensure that government funding works efficiently to deliver services  that make life better for Americans.\n\nThe American people are watching…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698632/providing-for-consideration-of-hr-saving-homeowners-from-overregulation-with-exceptional-rinsing-act-providing-for-consideration-of-hr-affordable-housing-over-mandating-efficiency-standards-act-and-providing-for-consideration-of-hr-commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "John Thune", "party": "Republican", "sentence": "…took steps to unleash  American energy production to ensure Americans have a stable and  affordable energy supply and more.\n\nOur goal for 2025 was more money in Americans' pockets, new  opportunities, and safer streets. We are accomplishing that with the  Working Families Tax Cuts and the rest of our landmark legislation, and  we will continue to expand…", "date": "2026-01-05", "source_url": "https://justfacts.votesmart.org/public-statement/1698482/senate-agenda"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…fact is, ObamaCare remains in place. Its subsidy structure  remains in place for better or worse, and those subsidies that they are  talking about would literally go into the pockets of insurance  companies whose profits have gone up 1,000-plus percent over the last  decade.\n\nIt is an insurance enrichment scheme.\n\nMy Democratic colleagues broke healthcare,…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698106/bringing-america-back-to-its-roots"}, {"senator": "John James", "party": "Republican", "sentence": "…Department remains squarely focused on  protecting and strengthening our Nation's critical energy resources,  while making sure Americans are able to put more money in their  pockets.\n\nMr. Speaker, this bill could not come at a more important time.  Today, China controls more than 90 percent of global rare earth  refining capacity. Russia maintains roughly…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699991/securing-americas-critical-minerals-supply-act"}]