[{"senator": "Joshua Riley", "party": "Democrat", "sentence": "…just to keep the lights on.\n\nNow the utility monopolies, which are owned by foreign corporations,  are raising rates again. They are taking more and more money out of our  pockets, and they are sending it to foreign corporations to pad their  profits. They have been getting away with it for years because they  work the refs, hire lobbyists, and grease…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695743/high-utility-rates-by-foreign-monopolies"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…financially be better off than they were under the Biden  administration. However, it is clear in the first 6 months that what he  has been doing is he is not putting money in their pockets, he is  taking it out.\n\nI think it is critical for us to make sure we understand fully what  is going on here with respect to the packages that they are trying to  move. He…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691087/big-backstabbing-bill"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…Susan and her husband, denying them access to healthcare, forcing them  to ration their food, and jeopardizing their ability to remain in their  home. For what? To line the pockets of the ultrawealthy, to pad the  bottom line of corporations already raking in profits.\n\nI offered six commonsense amendments to this bill to safeguard  critical programs…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688096/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions-and-providing-for-consideration-of-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…costs for  hardworking Americans, and supporting new domestic industries, but when  it comes down to a choice between reducing everyday Americans' energy  bills or lining the pockets of oil and gas executives, Republicans will  choose Big Oil each and every time.\n\nLet's stop wasting methane without consequence, and let's not leave  American consumers to…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688179/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…unilaterally, not with a consultation of both sides. It was done on its  own in the Senate, in the dark, in cahoots with a bunch of people. It  includes a provision that will line the pockets of eight Senators that  we know of by allowing them to sue the government for millions of  dollars if the Department of Justice subpoenas their phone records or  seeks a lawful…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696743/continuing-appropriations-and-extensions-act-2026"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…overturn the results of a free and fair election. It is a brazen  attempt by Republicans to further whitewash a conspiracy and a violent  insurrection while lining their own pockets with taxpayer dollars.\n\nIt is a trifecta of the type of corruption that shakes Americans'  faith in Congress: contempt for the rule of law, a secret backroom  deal, and self-enrichment.…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696925/repeal-of-senate-notification-requirements-relating-to-legal-process-on-disclosures-of-senate-data"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…dollars from  Federal taxpayers.\n\nIt should be clear to everyone here: Under no circumstances should  the power entrusted to us as Members of Congress be used to line your  own pockets, period, full stop. Anyone who voted for this appalling  provision, including all but two House Republicans just last week,  should feel ashamed of themselves.\n\nAs these Republican…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696924/repeal-of-senate-notification-requirements-relating-to-legal-process-on-disclosures-of-senate-data"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…will cut  services dramatically.\n\nIt doesn't matter if you are on Medicaid, on Medicare, if you have  private insurance through your employer, or you are filthy rich with  pockets full of gold. If you go to the hospital or to the clinic or to  an urgent care center and they have had to make drastic cuts to  compensate for these terrible Medicaid cuts…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690628/republican-tax-cuts"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…Jeff, and all these  billionaires pay their fair share. Their money has to be out of our  elections and out of the White House, and their hands out of the  working people's pockets and off our services, where our rights and our  freedoms mean working people have every single thing they need to  thrive.\n\nWe need bold legislative action if we are going…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699241/restoring-election-integrity"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…funneled to the benefit of a handful of Senators. While  families are struggling to afford groceries and healthcare, we are  being asked to sign off on a deal that lines the pockets of the very  people who wrote it. That is an insult to every hardworking taxpayer  who expects honesty from their government.\n\nThe contrast could not be clearer. Republicans…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696691/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…60-point margin among  the American public on putting a pollution limit, a carbon pollution  limit on big companies--72 to 12. That is where the American people  are, not in the pockets of Big Oil.\n\nHere is another one: Impose a fee on big polluters. It shouldn't be  pollute for free. If you are polluting something, whether it is your  neighbor's yard with…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697077/climate-change"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…or 2:30. How do you pay for  childcare? How do you try to make ends meet? What about the summer  vacation when school is not in session?\n\nMy Republican friends are so in the pockets of billionaires and the  well-off and the well-connected, I don't think they know what real life  is like for so many people in this country, how difficult it is.\n\nWhen we…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691512/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…a moment  for moral clarity. Not one person in this country should go hungry, not  one person should be left behind, and certainly not just so  billionaires can line their pockets even further.\n\nWe have time to stop it, but only if we speak up. Stay loud.", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691769/151-days-without-a-vote-to-lower-costs"}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "…plaything, with fewer and fewer guardrails to  keep the rest of us safe. He believes there are no checks on his  power--no checks at all--other than the ones going into his own  pockets, signed by his rich friends.\n\nThe United States exists today because a few brave patriots saw a  tyrant who cared more about the gold in his coffers than the people in  his…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696554/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…nurses. Not  even the drivers.\n\nIt is the polluters. This dependence on fossil fuels allows Big Oil  CEOs to turn drivers upside down at the pump and shake money out of  their pockets.\n\nThe Republicans say ``all of the above.'' No. No. It is ``oil above  all.'' We put 70 percent of the oil we consume into gasoline tanks. And  with cleaner, smarter, more…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691549/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…I can't deny that a crowd favorite is calling it the  working families tax cut bill because it delivers the largest tax cut  in American history. It puts money back in the pockets of people who  need it most: people who rely on tips and overtime and people living on  Social Security. It lifts burdens off the backs of working parents,  retirees, and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695114/launching-golden-age-of-america"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…justifications are just excuses to play politics.  It is all at the expense of local residents and businesses who want to  and should be able to keep their hard-earned money in their pockets to  reinvest in their families, communities, and businesses.\n\nThe House must swiftly exercise its constitutional responsibility to  oversee the District of Columbia and reject…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699678/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Mike Johnson", "party": "Republican", "sentence": "…means  real, positive change that they can feel, and they will feel much more  when this bill is done. Families back home will have real relief, an  average of $10,000 in their pockets, thanks to the largest working- and  middle-class tax cut in the history of this great Nation. That is what  we are doing today.\n\nYou have hardworking Americans like our waiters,…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693177/one-big-beautiful-bill-act"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…this agenda into law. Unleashing American energy, further  supporting our Border Patrol and ICE agents, and ensuring that working- class Americans keep more money in their pockets are commonsense  policies that my constituents overwhelmingly support. I am proud to  have helped deliver on this agenda.\n\nNow, with this legislation finally signed into law…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693458/golden-age-of-america-has-arrived"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…of  additional deficits, is what you believe the growth rate will be if you  adopt policies that will actually increase economic growth. That is  putting more money into the pockets of the American people and  deregulating so that businesses can create wealth.\n\nWe assumed 2.6 percent economic growth. That is higher than the CBO's  expectation of 1.8 but…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692388/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…people. When you give money back to the people, it is a return  on investment. I will always fight to provide certainty for the future  and to put more money back into your pockets as we step into the golden  age in America. In God we trust.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694793/promises-made-promises-kept"}, {"senator": "John Rose", "party": "Republican", "sentence": "…administration. It enabled them to seek  $500,000, per occurrence, for having their phone data seized by the  Biden FBI.\n\nThis could have resulted in millions of tax dollars lining the  pockets of a select group of United States Senators. It is no doubt  that they were the architects of this provision. That is not  accountability. That is corruption.\n\nNevertheless,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699753/repeal-of-senate-payday-provision"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…billion at the insurance companies, 85  percent has to be spent on healthcare. That is true.\n\nMr. Speaker, 15 percent of $500 that the insurance companies get to  put in their pockets is a whole lot less than 15 percent of $2,000. If  we throw more money at the insurance companies, the big insurance  executives get more money to put in their pockets. They…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698304/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…are far less efficient than  nuclear and clean-burning natural gas. Those things are driving up the  price of energy for the average American and putting that money into  the pockets of a handful of wealthy people and the Chinese. I  congratulate them, but my colleagues on the other side of the aisle  shouldn't come whining to Congress about what they…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695719/highlighting-flawed-policies"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…denaturalize scammers who have come to our country to steal from the  American people--to steal from the U.S. taxpayer; to steal from the  Federal Government--and pad their pockets.\n\nHard-working taxpayers deserve to know their money goes to those who  truly need it. It should not be going to criminals who are choosing to  game the system. I know the…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699102/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "John Rose", "party": "Republican", "sentence": "…restoring  fairness and awarding work, and it begins with Americans' taxes.\n\nIn Tennessee, the bill we passed here in the House would put an  average of $11,700 more in the pockets of a family of four every year.  Under this bill, everyday Americans will see lower income tax rates, a  larger standard deduction, and an expanded child tax credit. That…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693037/benefits-of-the-one-big-beautiful-bill"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…part of the working families tax cuts, Republicans enacted  landmark policies like no tax on tips and no tax on overtime, which put  more money back into the working family's pockets.\n\nRepublicans are working hard to deliver solutions that help Americans  thrive. H.R. 2312 puts more money back in workers' pockets and eases  the burden on employers by removing…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698965/tipped-employee-protection-act"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…government says to a small business, ``thou shalt do this,''  the compliance cost of doing it is borne by that business, and it comes  out of their bottom line or out of their pockets. It takes away from  their ability to invest in expanding, growing, and hiring more people.  It has the same effect as taking another dollar of tax out of their  pocket to…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690784/big-beautiful-bill"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…provisions that strengthen  small business and encourage investment in American industry.\n\nThis year, House Republicans are keeping more hard-earned dollars in  working families' pockets, not with the Washington bureaucracy. The tax  filing season begins next week, and Americans can expect to see some of  the biggest tax refunds in history.\n\nAfter 4 years…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699064/how-republicans-have-delivered-for-americans"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…raise the price of everything from  groceries to smartphones, to washing machines, to prescription drugs.  Every dollar collected in tariff revenue comes straight out of the  pockets of American consumers.\n\nConservatives used to understand that tariffs are taxes on the  American people. Conservatives used to be uniformly opposed to raising  taxes because…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689478/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}]