[{"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…amongst us. In fact, the very foundation of our democracy is built  on the idea that the voices of our people are our most powerful tool,  exercised at the ballot box, the debate podium, and in our communities.  That is how we come together as a nation to form a more perfect Union.\n\nIndeed, the very concept of democracy was forged in that crucible,  that a…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695522/violence-nor-silence-is-the-answer"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…those being underpayments.\n\nToday, of course, is not the first time we have heard these claims  about fraudulent Social Security payments to the dead. Indeed, from  that very podium, Madam Speaker, we heard President Trump last March  come to give a lengthy address to a joint session of this Congress. In  his remarks that combined misinformation, outright…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698920/ending-improper-payments-to-deceased-people-act"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…Speak truth about power, you say: Power, there is a problem, and you  are it.\n\nThat is just as I did from that seat right over to my right when the  President was up at that podium and I told him he didn't have a mandate  to cut Medicaid, Medicare, and Social Security.\n\nThe networks are a status quo institution for the most part. They  want to maintain…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699134/where-do-you-stand"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…put  our troops in harm's way without congressional consent, all so that he  could replace one dictator with another dictator. Everything is the  same except the face at the podium.\n\nNow the President says he is the one running Venezuela. I don't even  know what the hell that means.\n\nHe says we control the oil. What happens if the Venezuelan people  don't…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699359/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…of Impeachment. I  want to say that more has to be said at this time about who he is that  wasn't in the Articles of Impeachment. To say that, I am going to move  to another podium. I am going to move to another podium, so give me  just a moment as I move to another podium.\n\nAnd still I rise, Mr. Speaker, and I rise now to explain to the world  who Donald…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698076/liberty-and-justice-for-all"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…to the well before your colleagues and  the world and commit an act of incivility?\n\nHere is why: It is because when the President of the United States  right there at that podium addressed the Members of Congress, Democrats  seated on this side, seated, many of them saying nothing, the President  of the United States looked upon them, pointed toward…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688663/incivility-in-chamber"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…there and not to worry about it. The  President of the United States says ugly things about people. The  President of the United States came right here, and right at that  podium just below the Speaker called Democrats lunatics. It was the  same night that I was evicted from the joint session of Congress, the  only person ever to be evicted. The President…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695338/dark-days"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…weeks, 5-year-old Liam Ramos was used as  bait and detained, and three more people died in ICE custody during  those same 2 weeks.\n\nMr. Speaker, I don't want to be back at this podium in 2 weeks with a  longer list of names. I urge my colleagues to consider what we are  wagering at this point.\n\nAre we going to give ICE 2 more weeks to invade U.S. cities…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699497/no-more-money-for-ice"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…requiring me to be removed, although I am the only person  who has ever been removed from a joint session of Congress.\n\nHere is what happened after I left. The President, from this podium,  looked over toward my Democratic colleagues, and the President said to  them, as he was talking, words tantamount to them being lunatics. He  said it. Members of the Congress…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697060/no-mandate-to-cut-medicaid"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…furious--furious--that someone  dared to speak up.\n\nDo you know what, Mr. Speaker?\n\nI agree that there was a violation of the dignity and decorum of this  Chamber, and it came from the podium where Donald Trump was standing.  He gave one of the most bitter, angry, and divisive speeches ever  delivered in this room.\n\nHe offered no vision and no solutions, just grievance…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688503/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…because, quite frankly, I just  believe I have the right to have a cane.\n\nMr. Speaker, I rise today to speak on several different topics. As a  result, I will move from one podium to another to present these various  topics.\n\nMr. Speaker, I rise today to address the issue of fidelity to  sycophancy emanating from the Presidency--fidelity to sycophancy…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690560/a-message-to-the-cabinet"}, {"senator": "Jahana Hayes", "party": "Democrat", "sentence": "…which is just a fraction of what it costs to  educate students with special needs.\n\nMrs. HAYES. Mr. Speaker, as our colleague on the committee from  Oregon makes her way to the podium, I will just read an excerpt from an  email that I got from a parent in my district:\n\nAs a special needs mom, the current news of the cuts       happening in the special education…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698939/protecting-education-for-children-with-disabilities"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…worked alongside Doug also knows he had quite a sense of humor.\n\nI learned that early on. Doug and I both did a lot of 1 minutes. He  used to intentionally leave this speaking podium raised up to above my  head to remind me of how short I was and how tall he was.\n\nHowever, that small moment says a lot about Doug. Doug worked hard.  He took his job seriously,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698730/9999"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…both as wrestlers and as scholars.\n\nIndividually, the Wolves had an impressive presence at the state  tournament, with nine wrestlers qualifying, six earning a place on the  podium, one claiming a State Championship title, and another finishing  as a State Runner-Up. These outstanding accomplishments reflect their  relentless drive, skill, and sportsmanship.…", "date": "2025-03-21", "source_url": "https://justfacts.votesmart.org/public-statement/1688924/recognizing-the-clarkston-high-school-wrestling-teams-outstanding-season"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…Evans, Justin  Madsen, and sophomore setter Gehrig Tolman, delivered in every critical  moment.\n\nFrom a heartbreaking quarterfinal loss last season to the national  championship podium this year, this team exemplifies resilience and  heart.\n\nI congratulate the Knights, Coach Peterson, and the entire SVU  community. This championship belongs to all of them.…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691982/recognizing-southern-virginia-universitys-ncaa-division-iii-mens-volleyball-national-championship-victory"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "Mr. STAUBER. Mr. Speaker, normally, when you come up to talk about a  bill, you raise the podium here and put your papers down. Mr. Speaker,  when you talk about the 1980 Olympic game, I don't need any notes. I  don't need any recollection.\n\n``Eleven seconds. You've got…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695441/miracle-on-ice-congressional-gold-medal-act"}, {"senator": "David Kustoff", "party": "Republican", "sentence": "…today to honor the life and legacy  of Frederick W. Smith, who left us this past Saturday, June 21, 2025,  at the age of 80.\n\nMr. Speaker, if I were to stand and speak at this podium all day, I  would barely be able to scratch the surface of Fred Smith's  extraordinary life, his influence on the country and the world, and his  profound impact on the city…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692825/remarkable-life-and-legacy-of-frederick-w-smith"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "Mrs. FEDORCHAK. Mr. Speaker, I appreciate the opportunity to be here.  This little podium seems to have a mind of its own, so I will leave it  down so it doesn't scare us all again.\n\nMr. Speaker, I thank my colleagues in the Western Caucus for leading  the charge…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689195/work-highlights-of-western-caucus"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "Mr. BARRASSO. Mr. President, tonight President Trump will take the  podium, and he will have a joint address to Congress, and, clearly, to  the Nation.\n\nI just heard the minority leader of the Senate come to the floor and  talk about President Trump's…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688471/joint-session-of-congress"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…friendly forces. Pitting over 800 competitors including  those from university, high school, and middle school--the Solanco High  School students took the top spots on the podium. Robert Baxter placed  1st overall, Lucas Vilk placed 2nd for high school students, and Caleb  Reed placed 3rd for high school students.\n\nI am grateful for educational programs…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698689/recognizing-solanco-high-school-students-for-their-performance-at-the-2025-student-drone-challenge"}]