[{"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…don't care.\n\nOther agencies spent years crafting regulations, often after an  extensive analysis that shows that the benefits of that regulation from  a health and safety point of view outweighs the costs. However, this  bill would throw all of that out the door by allowing FERC, which has  no expertise in these areas, to just say ``no,'' and FERC doesn't…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698275/reliable-power-act"}, {"senator": "Alma Adams", "party": "Democrat", "sentence": "…home State, I am very concerned about  museums. This museum also organized a traveling exhibition on women's  suffrage, launched a popular newsletter called ``A Different Point of  View,'' created a bipartisan Honorary Congressional Advisory Council,  and testified before Congress.\n\nSince its founding, the museum has played an integral role in  uplifting…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689365/womens-history-month"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…30 years from now or so, we are going to be in a place  where we are able to say, not just to the American people but to the  world, that we are at net zero from a carbon point of view and that we  were able to get there through American technology and through American  leadership and American ingenuity and American exports; that we took a  strategic…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688166/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…war against Iran--a third war in the  Middle East since 2001--would be a catastrophic blunder for this  country.\n\nI think there are some in this body who have a different point of  view than I on this point, but I think we should all be able to agree  in the fundamental constitutional principle that says we shouldn't be  in a war if Congress doesn't have…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692637/war-powers-resolution"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…powerless. We still represent,  pessimistically, 47 percent of the--certainly, 47 percent of the Senate  seats. But something like half the country wants us to represent their  point of view. And the point of view that we are representing, by the  way, is shared by most of the constituents who are represented by  Republicans too.\n\nAnd so there is still a pathway,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695916/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…time to see a recently  produced movie called ``A House of Dynamite.'' It is a recent one that  actually talks about what a modern nuclear war would look like from the  point of view of the participants who have to make those decisions and  the equipment and provisions they have to aid those decisions.\n\nMr. FOSTER. Mr. Speaker, I thank the gentleman…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699037/expiration-of-new-start"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…my colleagues to support H.R. 1770.\n\nMr. PALLONE. Mr. Speaker, I urge my colleagues to support this bill  on a bipartisan basis. It is important from a consumer safety point of  view.", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693412/consumer-safety-technology-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…support H.R. 1767, the Awning Safety Act, and I reserve  the balance of my time.\n\nMr. PALLONE. Mr. Speaker, obviously, this is an important bill from a  consumer safety point of view. I urge all my colleagues to support it,  and I yield back the balance of my time.", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692745/awning-safety-act-of-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…does is to rescind funding from a program  designed to help with building energy code adoption. That might sound a  little obscure, but it is also important from a cost point of view.\n\nThird, they repeal a program that provides assistance for contractor  training. Even these two programs that might seem less important than  the rebate are still programs…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700221/homeowner-energy-freedom-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Representatives Mullin and McClain for their leadership of  this issue.\n\nMr. PALLONE. Mr. Speaker, I urge support for this legislation. I do  think that from an environmental point of view and to protect our waste  treatment facilities this is important legislation, and I yield back  the balance of my time.", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692750/wastewater-infrastructure-pollution-prevention-and-environmental-safety-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…fee is  actually getting the oil and gas industry to correct this problem and  recycle the methane and not waste it.\n\nWe are just trying to do what makes sense from every point of view  here. The Methane Emissions Reduction Program is a win-win for  everybody, and this resolution is a lose-lose for everybody, in my  opinion.\n\nMr. PALLONE.  Dexter).\n\nMr.…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688180/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…have to act seriously. If you want respect, you have to  act respectfully.\n\nPrime Minister Carney, you say that President Trump is not a fair  trader. I understand your point of view. I don't agree with you, but I  understand your point of view. You have got to stand up for your  people. Prime Minister Carney, if you believe in free trade, then here…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689486/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…country illegally or whether they favor deporting no  one in the country illegally, we should not, cannot, and absolutely  must not use violence in order to advance that point of view.\n\nThat is the principle at stake in today's debate. To vote against  this resolution is to countenance what happened with the horrifying  events we saw in my State.\n\nMr.…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693143/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "French Hill", "party": "Republican", "sentence": "…work on this.\n\nMr. Speaker, I always enjoy my good friend from California's long  lectures to this House on her views about current events. I am always  grateful for her point of view.\n\nMr. Speaker, I would share from my perspective that the shutdown was  borne fully and irresponsibly by the United States Senate, by just a  handful of Democratic Senators…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697143/denouncing-the-horrors-of-socialism"}, {"senator": "Josh Hawley", "party": "Republican", "sentence": "…colleague,  who I think will soon object, to agree with us on this, but I certainly  respect his view. The scandal is not that 1 or 2 or 10 or 20 Senators  would take a different point of view. That is fine. The real scandal  here is this bill cannot get a vote on the floor of this Senate. It  passed unanimously--not once but twice out of committee--unanimously…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697735/9999"}]