[{"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…school parking lots and school routes and  detaining parents in front of their children. In one instance, ICE  agents surrounded two high school students at a coffee shop and pointed  rifles at them. This is beyond unacceptable.\n\nStudents as young as 9 years old know these actions are wrong. A  fourth grade student gave me a handwritten letter, saying…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697292/trump-administration-dismantling-department-of-education"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…States fails to provide this aid is a day  that China and our other adversaries have an opportunity to step into  the void and earn goodwill around the world.\n\nAs the Secretary pointed out yesterday--and Secretary Rubio said  this--China's generosity is not free. China's generosity comes with a  price. It comes with a price of subservience and dependency…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691610/global-report-on-food-crisis"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…overdue initiatives.\n\nLet me give you some facts that our critics never seem to       remember. When we took office in 1980, we faced a dusty shelf       of reports which pointed out our predecessors had been so       busy spending money on new lands for parks that they       seriously neglected basic upkeep of the magnificent parks we       had. So,…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691582/hj-res-88"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…greater insight  into the license application decisions and enforcement actions taken by  the Bureau of Industry and Security.\n\nNotwithstanding the length of the title, as pointed out by the  chairman, I hope my colleagues will join me and support this bill. I  yield back the balance of my time.", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690694/maintaining-american-superiority-by-improving-export-control-transparency-act"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…accountable for any action that didn't serve to lower prices,  protect consumers, or even the playing field for small, innovative  businesses. If necessary, they could have pointed out corruption or  backroom dealings. And they would have been able to change the  Commission's course on specific actions by persuading a Republican  Commissioner to join…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1689985/confirmation-of-mark-meador"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…improving the budget. It, in fact, was lying about the budgeting. It  was not consistent with the law. And it was massive--$37 trillion.\n\nSo my colleagues across the aisle, when we pointed this out, they  said: Yes, we had better not do that. That is just wrong.\n\nOK. Thank you. Thank you for deciding not to put in a scoring rule  that was completely wrong and…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689508/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…Americans were sent to fight and to bleed in  Venezuela.\n\nSeven Americans were wounded in that military operation. There is a  functional blockade of Venezuelan oil. As others have pointed out here,  Mr. Speaker, an aircraft carrier strike group sits nearby, poised to  again send Americans into Venezuela should the President order it.\n\nLet's talk about hypocrisy.…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699367/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…five now.\n\nThis bill is going to be hard to manage. It is difficult, if not  impossible, to easily access the most recent list of foreign entities  of concern.\n\nAs we have pointed out, this bill doesn't talk about China. It talks  about foreign entities of concern. That list can change without notice.  In fact, the most recent list from the Department…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697440/transparency-in-reporting-of-adversarial-contributions-to-education-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…the point of advancing a bill to reconstitute it  without adding guardrails to prohibit the mixing of industry priorities  with legitimate research. This is what the court pointed out to us.\n\nI only mention these things because I am trying to emphasize that  this bill is a complete waste of time and a disservice to our  constituents that we are even…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695765/national-coal-council-reestablishment-act"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…effects on portfolios and balance       sheets and therefore systemic--  Systemic--       implications for financial stability.\n\nLike the Financial Stability Board said.\n\nSo I pointed out that this risk was looming, and we need to pay  attention to it. This isn't about polar bears any longer. This isn't  about green jobs any longer. This is a serious warning…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697077/climate-change"}, {"senator": "Sara Jacobs", "party": "Democrat", "sentence": "…violation of privacy and  would make all women and girls less safe. Will Republicans require  menstrual monitoring, checking reproductive organs, as has happened, as  my colleague pointed out? Girls and women who are tall, strong, and  gender-nonconforming are already being questioned and yelled at.  Republicans seem to always want to dictate from D.C. what…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695241/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…was followed. The Department of the Interior notified the  Congress of the withdrawal on January 26, 2023, and as my colleague,  the ranking member from the committee, just pointed out, we all  received those letters. I received one. Mr. Stauber received one. The  chair of the committee received one. Everybody got a letter.\n\nThen Congress had 90 days…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699274/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…of programs and       facilities,'' Daniel Keenan, vice president of government       relations at Trinity Health of New England, stated in emailed       comments.\n\nKeenan pointed to emergency rooms as an example. When       people don't have coverage, they turn to emergency       departments for basic care, resulting in crowding, service       delays…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694776/congress-long-to-do-list"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…rates  and, more importantly, the way it applies to mutual fund investments in  banks.\n\nBecause of this rule's miscounting, BDCs were removed from several  stock indexes, as I pointed out earlier. If the SEC had the benefit of  hindsight, I think it is unlikely that they would have adopted this  rule, which contradicts the rule that they have for investments…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692711/access-to-small-business-investor-capital-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…division between  them.\n\nSo that was a completely phony distinction created by the Court to  create a system of corporate and billionaire power in America. As my  colleague pointed out in the context of climate, we saw a radical  change immediately.\n\nWell, the growth in dark money has been stunning. Because there is so  much money among the oligarchs…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699084/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "…Ukraine. Good for the President, and good for our  friends in the House and Senate.\n\nOur allies across the Atlantic are taking the lead now, as my  colleague from Kentucky just pointed out, in financing security  assistance for Ukraine. NATO allies are buying equipment from us in the  United States and giving it to Ukraine. I certainly applaud that, as…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699095/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…including the Department of Government Efficiency.\n\nI don't think it helps their credibility when some of the most  egregious expenditures and waste of taxpayer money are pointed out, and  they complain about the person who is identifying it and made it  possible maybe to save that money or to return it to the taxpayers from  whom it came in the first…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690662/department-of-government-efficiency"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…the aisle, then we are not doing it  right. I submit to you,  Mr. Speaker, that the House Oversight and Reform Committee is doing it  right. They are going through it.\n\nAs I pointed out in my opening, Mr. Speaker, if they decide to use  one of the limited areas that they could do a redaction, then they have  to explain why. If the administration doesn't…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694880/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…just relief for companies or big corporations, like many  of the Democrats are claiming. It is for everyday North Dakotans and  everyday Americans across the Nation.\n\nDan also pointed out the broader benefits in the bill, like the  expansion of the 199A small-business deduction, tax relief that allows  entrepreneurs like him to reinvest in their businesses,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694792/promises-made-promises-kept"}, {"senator": "Cory Mills", "party": "Republican", "sentence": "…high and proud. We will defend her against  all enemies, foreign and domestic.\n\nMr. Chair, I yield back the balance of my time.\n\nMr. MILLS. Mr. Chairman, as my colleagues have pointed out, it is  very simple. Article I, Section 8, Clauses 11 through 13, are the war  powers of Congress, granted to us and given to us. It states very  clearly: ``Congress shall…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695264/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…around here, here is your math problem. I wish they would start  the whining with telling the truth on math and facts before telling  anecdotes and stories. Remember, I just pointed out to you the 140  years analysts of the speeches here in Congress, how they have become  now about feelings instead of facts because we can manipulate you with  telling…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691518/truth-telling-with-math-and-facts"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…out waste, fraud, and abuse. Let the other party, Mr. Speaker, be the  defender of waste, fraud, and abuse in Washington, but we are cleaning  it up in this bill.\n\nUSDA has pointed out that there is about $10 billion a year in waste  just in the SNAP program because of fraud and improper payments. These  payments are not going to children that you hear…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693191/one-big-beautiful-bill-act"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…constituents  in Congress, I was one of the few that wore the uniform. I was one of  the few that was shot while off-duty. I was one of the few that had a  gun malfunction when it was pointed at my head. I was one of the few  that ran into the fire. I was one of the few that was on our tackle  response team.\n\nWhen they talk about tasers, it is a tool that we can…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700031/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…succeeding in this land of opportunity.\n\nActually, they were very thrilled to praise America. They praised us  not only as being a much better place to live than Pakistan, but they  pointed out we are a much better place to live than Europe. They  laughed at Europe, which they referred to as a ``socialist continent''  and one in which there was  no room for people…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689133/educating-young-people"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…electricity prices over the last 20 years, it is  important to look at this chart. This is from the EIA. If you look at  the top 12--and as the gentleman from North Carolina pointed out about  his legislation, especially in New England, the States up there, look  at what has happened here. Look at California, Hawaii, Maine,  Massachusetts, Connecticut,…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698073/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…if you look at the map, and a lot of people have  looked at maps of energy prices, what are the highest cost electric  prices in the country? I know my friend from Colorado  pointed out to my other friend from Colorado that Colorado is up in the  grid with California, New Jersey, and New York. They have higher energy  prices, and it is because their general…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697882/state-planning-for-reliability-and-affordability-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "…the 25-to-49-employee small business. What is  happening in that marketplace? So a lot of those companies used to  offer their employees insurance. And that insurance, as I pointed out,  is about half of the cost of increase over this time period that you  would get in the individual marketplace in the ObamaCare exchanges.\n\nSo what has happened is people…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697879/healthcare"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…want to do something that is a little bit  different than California or if they want to do something that is a  little bit different than the national standard.\n\nAs Mr. Kiley pointed out in his very good comments on this subject,  the problem is when California keeps ratcheting up their regulations,  because they are a large economy, as has been pointed…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690474/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…has changed. Construction is beginning to be able to close  that gap, and it is incredibly important. It is one of the first places  that CBP and Border Patrol took me to and pointed out to say: We need  this gap closed. It is very important that we actually get this gap  secured because it is in a very remote area, difficult to traverse, and  it is dangerous…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690878/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…Thunberg--anti-Westerners, anti-American people--who want elected  officials who share their view.\n\nBy the way, since we did touch upon the economy, I want to point out  something recently that was pointed out to me by Steve Miller. In the  most recent jobs report, there were some jobs we got more of and some  jobs we got less of.\n\nThere was a significant increase in private-sector…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700071/issues-of-the-day"}]