[{"senator": "Gwen Moore", "party": "Democrat", "sentence": "…Social Security  Administration. We have shut down scores of offices. Many people have  been fired, and that data and AI will not resolve the issue of having a  single point of contact or a person to deal with.\n\nMr. Speaker, I urge my colleagues to support this legislation. It did  pass out of committee with a strong bipartisan vote. I hope that there…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697187/improving-social-securitys-service-to-victims-of-identity-theft-act"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…experience levels to get things right for our veterans. I,  along with everyone else, support efforts to ensure that veterans and  beneficiaries are being served at every point of contact in VA by the  best talent we can muster.\n\nOne way we can do that is by ensuring we have the right folks in the  right roles. This legislation seeks to help that at BVA…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699208/veterans-law-judge-experience-act-of-2025"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…amended.\n\nIt is no secret that our offices get a lot of calls about casework on  veterans' benefits. Sometimes these calls are a simple matter of  getting people the right point of contact in the right office.  Sometimes it is an ask to wake a sleepy bureaucracy to move faster on  behalf of a constituent. Sometimes these calls highlight a loophole or  a…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699468/ernest-peltz-accrued-veterans-benefits-act"}, {"senator": "David Kustoff", "party": "Republican", "sentence": "…the  victims. The Improving Social Security's Service to Victims of Identity  Theft Act addresses this problem head-on.\n\nSpecifically, this bill will establish a single point of contact at  the Social Security Administration for Americans who have had their  Social Security numbers lost or stolen. Mr. Speaker, think of it as a  one-stop shop for those…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697188/improving-social-securitys-service-to-victims-of-identity-theft-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…the lead organizers applying to become a de       novo regulated institution to provide a tutorial with respect       to the application process; and\n\n(B) be the primary point of contact of the respective       Federal financial institutions regulatory agency for such       organizers during the application process.\n\n(3) New caseworker.--Each agency described…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…Officer, who shall--\n\n``(1) be responsible for fraud and scam prevention,       reporting, and incident response plans at the Department; and\n\n``(2) serve as a central point of contact to direct       veterans to resources to prevent and mitigate fraud and       scams.\n\n``(b) Responsibilities.--The Veterans Scam and Fraud       Evasion Officer shall…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699191/veterans-scam-and-fraud-evasion-act-of-2025"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "Mr. SMITH of Missouri. Mr. Speaker, I move to suspend the rules and  pass the bill (H.R. 5345) to amend title VII of the Social Security Act  to provide for a single point of contact at the Social Security  Administration for individuals who are victims of identity theft, as  amended.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697186/improving-social-securitys-service-to-victims-of-identity-theft-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…by ensuring adversaries  cannot exploit weak U.S. oversight to establish these secret labs. It  would create a public health biosafety and biosecurity team as a single  point of contact for State, local, Tribal, and territorial governments  when suspicious labs are identified. It would require a feasibility  study on creating a centralized national database…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699473/illegal-bio-lab-in-las-vegas"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…clock, caring for patients of all ages and across every  specialty--from cardiology and oncology to pediatrics and geriatrics.\n\nEmergency nurses are heroes, often the first point of contact for  patients within the ER, and they provide comfort and attentive care  during an uncertain or stressful time for patients and their families.  Their critical thinking…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696115/recognizing-emergency-nurses-week"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…telecommunications relay services. Individuals outside the       United States should use the relay services offered within       their country to make international calls to the point of       contact in the United States.\n\nSUPPLEMENTARY INFORMATION: The National Forest System Lands       described in this Order are within Lake, Cook, and Saint       Louis counties,…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699271/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}]