[{"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…Constitution is clear--must  come from Congress.\n\nNobody here denies the Maduro regime is horrific and undemocratic,  and we also agree drug traffickers and organized criminals who poison  Americans ought to be tracked down and dismantled. That was why, when I  was majority leader, Congress provided billions for counternarcotics  operations and granted sweeping…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696558/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…on the committee under  the leadership of my dear friend, Chairman Cole.\n\nWhen we began this process, we set out three goals: protect  Democratic priorities, eliminate any poison pills, and reassert  Congress' power of the purse. I am pleased to report that this package  accomplishes all three.\n\nIt protects funding for key Democratic priorities, and…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698760/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…does it. It is the last train out of the station, I repeat.\n\nBut Republicans? They seem to care more about banning abortion than  lowering premiums. This bill is loaded with a poison pill, so everyone  knows it can't come close to passing. By putting that poison abortion  pill in it, they basically are saying to Democrats: Forget about it.\n\nYou can't even…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697877/healthcare"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…the way, on tariffs, if I may, Republicans are once again rigging  the rules to protect Donald Trump and hide from accountability.\n\nRepublicans know his tariffs are economic poison and know voters hate  them, but House Republicans are too cowardly to go on record. The  majority is trying to sneak around with a procedural gimmick in this  rule to block…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689864/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…said that the President wanted to send a message by killing all of  those on board.\n\nWe all agree that the scourge of drugs is real and that scores of  Americans die from such poison every year. We are all committed on both  sides of the aisle to battling the importation of illegal drugs, even  as we work to beat back addiction here at home. But we are…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696120/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…into the issue of abortion now instead of  just expending these premium benefits--I know because I have lived  through the Affordable Care Act--it is a nonstarter. It is a poison  pill. It is the end of the conversation. We are too divided on the  issue.\n\nPrior to the ACA, we must remember that insurance companies could  deny coverage to patients with…", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697576/department-of-defense"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…any machine  gun. They have properly decided that we should not put more machine  guns into the stream of commerce.\n\nWhat is still swept within it? Any explosive, incendiary, poison gas,  bomb, grenade, rocket, missile having explosive or incendiary charge of  more than \\1/4\\ ounce, mine, device, and so on.\n\nWhy would we open this up if that is not the…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691349/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…have been attached to important  bills like the NDAA.\n\nHowever, this morning in the Rules Committee, Republicans green- lighted dozens of amendments containing controversial poison pills that  may very well make their way into the bill. I hope that my Republican  colleagues are able to demonstrate some restraint this week and vote  down these bad policies.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695109/providing-for-consideration-of-hr-streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-and-providing-for-consideration-of-hr-stop-illegal-entry-act-of-2025"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…the DEA, in 2018,  Congress has never allowed this authority to expire. So, by passing  this bill, we are merely maintaining the status quo. We must also  address how this poison gets into the hands of the most vulnerable: our  children. Too often, fentanyl is peddled in the open on some of the  world's largest social media platforms.\n\nWhen the Senate…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688848/halt-fentanyl-act"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…strategic objective they are meant to accomplish.\n\nI want to be clear about something at the outset: I have spent years  advocating for stronger action against drug cartels that poison our  communities. I have consistently voted to provide law enforcement with  the resources they need to dismantle these criminal networks. I have  supported international cooperation…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696553/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Jacky Rosen", "party": "Democrat", "sentence": "…progress for hard- working Americans. This bipartisan bill is a good idea that has support  from Democrats and Republicans. So we should pass it as soon as  possible without any poison pills.\n\nThe problem is that the House Republicans have included a version of  the No Tax on Tips Act in their bigger budget bill--a bill that cuts  Medicaid, SNAP, and other…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691423/no-tax-on-tips-act"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…country. We need to extend the subsidies. We need to make sure that  everybody who can get to a doctor gets care. This is not a poor  country.\n\nMr. Speaker, I refuse to take a poison pill and let my colleagues  tell me I will regurgitate it next week. The poison pill has killed the  CR.\n\nMr. Speaker, this is not a clean CR! This is a dirty, corrupt  Continuing…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696678/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Chellie Pingree", "party": "Democrat", "sentence": "…strong and resilient Indian Country, including through education,  public safety and justice, and healthcare programs.\n\nImportantly, this bill strips out every single partisan poison pill  rider that the Republicans tried to jam into the process, including the  pesticide liability shield that would have let chemical giants evade  accountability.\n\nThis bill…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698754/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…companies--companies that are trying to get the  Congress to pass legislation to essentially give these AI companies a  free ride--no protection from deepfakes, no protection from the poison  they are feeding our children. They want free rein, so they are putting  up $100 million in this next election.\n\nI just did the math, sitting at my desk, quickly. The average…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699117/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…Members DeLauro,  Hoyer, and Frankel, the legislation before us protects funding for  Democratic priorities, reasserts Congress's power of the purse, and  rejects Republicans' poison pill riders.\n\nThe fiscal year 2026 National Security, Department of State, and  Related Programs Appropriations bill upholds U.S. leadership abroad and  invests into vital…", "date": "2026-01-27", "source_url": "https://justfacts.votesmart.org/public-statement/1699388/supporting-hr-7006"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…responsible land management, all while spending less than the current  continuing resolution.\n\nMr. Speaker, that is not chaos. That is responsible governing. There  are no poison pills, no partisan games, and full-year funding that  takes shutdown leverage off the table and allows America to plan,  build, and lead.\n\nAs an appropriator, I am proud of…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698747/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…Speaker, Hyde amendment protections need to be added to this  bill. Taxpayer funds should not be forced to subsidize the killing of  an unborn child by dismemberment or by baby poison pills.\n\nThe Hyde amendment was not--I will say it again, was not--included  when the ACA was enacted in 2010, nor was it included when President  Biden significantly expanded…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698800/breaking-the-gridlock-act"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…interests, we are not funding it. We fully fund CFIUS to stop  foreign threats from buying up America, keep longstanding pro-life  protections in place, and deliver a bill with no poison pills. This  package keeps spending below the current continuing resolution and  moves us closer to finishing all 12 appropriations bills. They said it  couldn't be done. We…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699059/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Governor opposed this effort to make crime illegal again in California.\n\nThe Governor's first attempt to undermine this voter-qualified  citizen initiative was what was called a poison pill. The scheme went  like this: Newsom had the legislature pass a number of supposedly pro- public safety bills. They didn't really do much, but they were  supposedly part…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}, {"senator": "John Carter", "party": "Republican", "sentence": "…this debate, Mr. Chair, from the  blatant push toward privatization of VA medical care to the  underfunding of infrastructure and climate resiliency projects and the  harmful poison pill riders, I just cannot in good conscience support  this bill.\n\nIt breaks my heart because we do have such a good working  relationship across the aisle with Chairman Carter…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692945/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Mike Simpson", "party": "Republican", "sentence": "…is  determined to return to regular order and deliver results for our  districts.\n\nMr. Speaker, this bill works to ensure our priority programs receive  funding without any poison pills. We had to make some tough decisions,  but I am proud that this is a bipartisan, bicameral bill that both  parties and Chambers see as a benefit to the American people.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698758/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…Speaker, I rise today to strongly  support the HALT Fentanyl Act. This is critical legislation that will  increase penalties for the criminals who produce, traffic, and sell  this poison.\n\nIn 2023, one Pennsylvanian died every 2 hours from an overdose, with  the overwhelming majority of these resulting from fentanyl poisoning.  Our Nation has lost too many…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692145/doge-rescissions-package"}, {"senator": "James Risch", "party": "Republican", "sentence": "…to take appropriate military  action against an invasion. That invasion comes from those terrorists.  They invade the United States of America with boats loaded with this  poison. It is distributed around the United States, and it kills tens  of thousands of people every year.\n\nNow, let's assume that these terrorists, instead of using the drugs,  were…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697780/9999"}, {"senator": "Carlos Gimenez", "party": "Republican", "sentence": "…organization, a narcoterrorist state  that collaborates with other foreign terrorist organizations and  violent cartels to flood our hemisphere and our communities with deadly  poison.\n\nVenezuela has been taken over. The Venezuelan people are held hostage  by a foreign terrorist regime that uses their land as an operating base  for international drug trafficking,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698445/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "John James", "party": "Republican", "sentence": "…his very hard work and leadership in getting this done.\n\nFentanyl is a scourge on our Nation, leaving a trail of heartbreak  and destruction in its wake. We cannot allow this poison to continue  tearing our families apart, and I am proud the House Republicans are,  once again, leading the fight to protect our communities and get  fentanyl off our streets.…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691886/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "…Area in my district.\n\nThis would prohibit access to approximately 24 miles of road as the  chairman said, including popular trails near the Orange Cliffs and  segments of the Poison Springs Loop. I have spent a lot of time on the  ground in these areas with local elected officials who, for years, have  tried to generate a better experience for visitors…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690403/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles"}, {"senator": "Trent Kelly", "party": "Republican", "sentence": "…The Western Hemisphere is our home. It cannot  and will not become a safe haven for drug cartels, Iranian proxies, or  hostile actors who seek to undermine our security and poison our  communities.\n\nThis action made clear that the United States is serious about  defending our national interests and holding criminals accountable, not  through rhetoric…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698886/successful-operation-to-arrest-nicolas-maduro"}, {"senator": "Addison McDowell", "party": "Republican", "sentence": "Mr. McDOWELL. Mr. Speaker, today is Fentanyl Awareness Day, a day  meant to spread awareness of a ruthless poison that has stolen the  lives of too many of our sons, daughters, sisters, and brothers.\n\nMy family and I know this pain personally. My brother Luke was taken  from us by a single…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690382/fentanyl-awareness-day"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…Subcommittee, the gentleman from California (Mr. Sherman), to make sure  that consumer protection, especially for seniors, Mr. Chairman, was the  foundation of this bill.\n\nThere are no poison pills in here, Mr. Chairman. There are no  surprises in this. We are champions for American competitiveness, and I  urge my colleagues to vote ``yes.''", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697832/increasing-investor-opportunities-act"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…Patrol and law enforcement officers will be  more effective in removing fentanyl and fentanyl-related substances  that come across our border, end up in our communities, and poison our  children, friends, and neighbors.\n\nAdditionally, this legislation will also result in harsher penalties  for the criminals and cartel members who are responsible for the…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692344/halt-all-lethal-trafficking-of-fentanyl-act"}]