[{"senator": "Ed Markey", "party": "Democrat", "sentence": "…uncertainty, and put the refuge into limbo. But we do have some  certainty. Republicans know this will put our last most wild place at  risk. It will put the rare caribou, polar bears, and wildlife that call  the refuge home at risk. The Gwich'in people have said over and over  that it puts their way of life at risk.\n\nBut this vote would also put business…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697516/hj-res-131"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…see this refuge with my own eyes. I have seen  its towering peaks; I have seen the critical habitat on the Coastal  Plain where caribou drop their calves; and I have seen its polar bears.\n\nOver the course of a year in the Arctic Refuge, you might also see  one of the last great spectacles of migrating caribou, dueling musk ox  straight out of the Pleistocene,…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697413/9999"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…to introduce my colleague,   John Garamendi of  California, a longtime advocate for arms control, with whom I have had  the honor of spending a weekend underneath the north polar ice cap in a  nuclear submarine.\n\nMr. FOSTER. Mr. Speaker, I thank the gentleman for his remarks.\n\nMr. Speaker, I have to say the gentleman is absolutely right about  the messaging…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699037/expiration-of-new-start"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…implications for financial stability.\n\nLike the Financial Stability Board said.\n\nSo I pointed out that this risk was looming, and we need to pay  attention to it. This isn't about polar bears any longer. This isn't  about green jobs any longer. This is a serious warning about a  potential collapse in not just the United States but the global  financial system.…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697077/climate-change"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…unit of public lands in the United  States. It spans 23 million acres, and this area of the western Arctic  is home to a diverse ecosystem, where iconic species like wolves, polar  bears, and caribou roam. Beluga and bowhead whales shelter in its  coastal waters. Millions of migratory birds rely on this intact  landscape and the critical waters and wetlands…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696836/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…in, the Coast Guard is responsible for facilitating over $5  trillion of maritime commerce in our waterways. The Coast Guard is also  the sole operator of icebreakers in our polar regions, and they are our  primary force charged with the stopping of pirate fishing from China,  Russia, and other dark fishing fleets that are stealing American  fishing…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688520/coast-guard-authorization-act-of-2025"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…of commercial and civilian maritime activity.\n\nIncluded in this bill is a provision to reach out to our great ally  Finland to update and modernize our icebreaker fleet. Our Polar Star  large icebreaker is now 50 years old, and it is long past due,  particularly with the challenges in the Arctic with Russia and China,  to make sure we update and modernize…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694038/supporting-our-coast-guard"}, {"senator": "Rick Larsen", "party": "Democrat", "sentence": "…improvements funding by 100 percent over current funding levels. These  new resources should enable the Coast Guard to maintain its ongoing  recapitalization programs, including Polar Security Cutters and  Offshore Patrol Cutters.\n\nLast Congress, we enacted substantial improvements to safety for  mariners and passengers aboard vessels. This legislation builds…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694197/coast-guard-authorization-act-of-2025"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…The decisions were made prior to the present Trump administration to  take power offline. I know in my community down in Bowling Green,  Kentucky, a few years ago with the polar vortex, we actually had  blackouts, we had to have rolling blackouts because of taking power  offline.\n\nWe all want to address it. The way we address this is not taking  power…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697031/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Claudia Tenney", "party": "Republican", "sentence": "…amendment No. 287 to provide $71 million for nonrecurring engineering  expenses associated with designing the new LC-130J as part of LC-130  recapitalization project.\n\nLC-130s are polar ski planes that possess the unique capability of  being able to land on snow instead of solely on a paved runway. The LC- 130 is the only plane in the world with this capability…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693679/department-of-defense-appropriations-act-2026"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…Requirement for Coast Guard to provide analysis of                alternatives for aircraft. Sec. 116. Oversight of funds provided pursuant to Public Law 119-21. Sec. 117. Regular polar security cutter updates. Sec. 118. Annual plan for Coast Guard operations in the Pacific.  TITLE II--ORGANIZATION, AUTHORITIES, ACQUISITION, AND PERSONNEL OF THE…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…baby feels pain with every cut of the knife.\n\nIt is no wonder that the polling shows that the majority of Americans  do not want public funding for abortion. Abortion is the polar opposite  of healthcare.\n\nMr. SMITH of New Jersey. Mr. Speaker, abortion is not healthcare  unless one construes the life of an unborn child to be analogous to a  tumor to…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698800/breaking-the-gridlock-act"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…School Hall  of Fame for his remarkable coverage.\n\nOff the air, Colin served tirelessly--co-chairing United Way  campaigns, emceeing the Walk for Diabetes and Special Olympics Polar  Plunge, and coaching youth softball and baseball for over 15 years.\n\nMac delivered his final broadcast on 107.5 The Power Loon on January  31, 2026. I thank him for his dedication,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699726/9999"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…Alaska's unique geographic position  gives it a crucial edge in space surveillance, missile defense,  satellite communications, and launch capabilities.\n\nWith a high-latitude polar launch capability and vast, remote  terrain, my State offers unparalleled advantages for both government  and commercial space initiatives. The Pacific Spaceport Complex-Alaska,…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687923/space-dominance"}]