[{"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…seeks to overturn, and its long-      standing risk-based pretrial system, which H.R. 5214 would       upend--reflect precisely this kind of thoughtful, data-driven       policymaking. These reforms enjoy broad public support, align       with national best practices, and have contributed to       meaningful gains: D.C.'s crime rate is now the lowest…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696985/opposition-letter-by-the-southern-poverty-law-center-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…love to say this is just a one-off, but it fits a disturbing  trend. Again and again, this majority keeps replacing science with  slogans, governance with grievance, and policymaking with cheap  performance art.\n\nThe truth is, this bill won't fix a single problem. It does  absolutely nothing to help the Gulf Coast. It won't create a single  job. It is…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690937/gulf-of-america-act"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…rule, at the beginning of the day, is a  good policy that benefits every stakeholder involved, and banning this  rule would set a dangerous precedent for solutions-oriented  policymaking. It will roll back decades of bipartisan work that we have  all done to preserve history.\n\nMr. Speaker, I urge my colleagues to consider the cost of this  action, and I…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688635/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…every bit of common sense and every  bit of legal knowledge knows that that is a lie. Why did my colleagues  engage in this massive deception? It is an end-run around the  policymaking process.\n\nThey could have easily said: We want to expand the Congressional  Review Act to cover waivers. And then you simply craft a bill.  Republicans being in charge of…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691625/congressional-review-act"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…thorough and  accurate data is critical to delivering the best possible care for  patients. I believe it is incumbent upon us as lawmakers to take the  same approach with policymaking, especially when it comes to crafting  legislation to help care for our veterans.\n\nThe information provided under this report will help us to better  understand the most…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695485/modernizing-all-veterans-and-survivors-claims-processing-act"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…pay-as-you-go law.\n\nI said I was closing, but, like a good Baptist preacher, I may have  one or two more closings since we have an hour.\n\nWe also have to stop legislating and policymaking in silos. This is  one of my biggest frustrations as a legislator. I spent 18 years as a  State legislator and now here in Congress, and too often, we focus on  healthcare…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692205/raising-awareness-about-mens-health"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…on the idea that every voice matters, regardless of how much  money you have. When the wealthy few can drown out the many, we lose  sight of who we are supposed to serve. Policymaking gets overshadowed  by these special interests.\n\nYet, after Citizens United, it is too often small groups of  corporations and billionaires tipping the scales based on who…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699239/restoring-election-integrity"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…with and usage of the benefits and services furnished under       laws administered by the Secretary for which they are       eligible; and\n\n``(B) to be considered during policymaking.\n\n``(4) Providing strategic guidance and strategies to       Department entities for engaging with veterans and       beneficiaries regarding benefits and services furnished…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693967/protecting-regular-order-for-veterans-act-of-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…surpass that of the Federal Government, it is the bureaucracy that we  have in California.\n\nSpeaking of the bureaucracy, find ways to rein in these massive,  unelected policymaking bodies we have in California such as CARB, the  California Air Resources Board.\n\nThese are just a few suggestions, but our State has absolutely  enormous potential that…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689211/protecting-medicaid-for-californians"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…services.\n\nThe Democratic-led OCC rule was driven more by a progressive ideology  against mergers in all sectors of all kinds in the economy rather than  sound, rational policymaking. In fact, the Biden-Harris OCC did not  even coordinate with the other banking regulators, such as the Federal  Reserve Board, before issuing this final rule.\n\nCreating…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691498/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…the millions of Americans who continue to  rely on Wyoming coal--and who always will.\n\nFourth, it is a win for Congress, reminding the agencies that we are  the primary policymaking branch of government and that we will hold the  agencies responsible for bad, unlawful regulations.\n\nI urge all of my colleagues to vote in favor of H.J. Res. 130.", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696878/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Dan Crenshaw", "party": "Republican", "sentence": "…environment. I can't name a single Member who doesn't. As policymakers,  we have to ensure that regulations are pragmatic and balance the  inherent trade-offs. That is what policymaking is about. That is what  regulation is about, trade-offs.\n\nThe Biden-era regulation on tire manufacturers is a perfect example  of when regulators fail to do a proper cost-benefit…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688530/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…networks,  Congress needs a sophisticated and comprehensive assessment of what  vulnerabilities persist, what issues have been resolved, and where  mobile cybersecurity policymaking should be focused.\n\nThe Understanding Cybersecurity of Mobile Networks Act requires the  National Telecommunications and Information Administration, NTIA, to  submit to…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693423/understanding-cybersecurity-of-mobile-networks-act"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…of making this a reality.\n\nThis is an exciting moment. It will be monumental, and it will do so  much good.\n\nI have always said, as I have been involved in congressional  policymaking, that we live in 2-year increments, but every CEO across  the country has to live in 15-year increments. They have to see what is  around the corner, and we are constantly…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691960/supporting-the-big-beautiful-bill"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…in a Member-driven process.\n\nAs I stand here today, I think of the genius of our Founding Fathers.  They designed Congress to be an engine of thoughtful and deliberative  policymaking. It wasn't meant to be easy. In fact, difficulty is what  separates serious legislating from political performance.\n\nIn her 250 years, America has never shied away from…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698749/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…the State and Federal role in education.\n\nI also expect that she understands the difference between the  executive and legislative branches when it comes to the serious  policymaking of education. Congress passes the laws and holds the power  of the purse. We have also the responsibility to make sure that laws  are faithfully executed by the executive…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688387/nomination-of-linda-mcmahon"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…family, and all who know him to  understood his impact. He roamed the Halls of Congress, indifferent to  politics, to make sure the  voiceless were heard and reflected in our policymaking.\n\nMr. Speaker, I thank Grant for his work, which has inspired so many,  including myself.\n\nGod bless.", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688646/recognizing-grant-smith"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…political exercise that has been  engineered by the minority leader at the expense of pursuing an actual  solution.\n\nNow, once again, it is falling on the Senate to do the real  policymaking, but I am heartened that they seem to be close to a deal  that roughly mirrors the compromise bipartisan bill that I have offered  with the gentleman from California (Mr.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698807/breaking-the-gridlock-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…onslaught of these policies before they destroy  businesses and make life more expensive for the American people.\n\nMr. Speaker, let us be pragmatic and use common sense in our  policymaking, and I urge my colleagues to join me in supporting H.J.  Res. 61.", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688524/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "French Hill", "party": "Republican", "sentence": "…memorandum of understanding, or other appropriate interagency       agreement, to share relevant housing-related research and       market data that facilitates evidence-based policymaking.\n\n(b) Interagency Report.--\n\n(1) Report.--Not later than 1 year after the date of       enactment of this Act, the Secretary of Housing and Urban       Development, the…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}]