[{"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…people don't understand why.\n\nIf you look back at what happened with Citizens United, you realize  that that influence on our campaigns and elections is why you end up  with policies like that. This is why we have to make sure that we  overturn Citizens United.\n\nMr. SUBRAMANYAM.  Tokuda).\n\nMr. SUBRAMANYAM. Mr. Speaker, I thank the gentlewoman for a lot of…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699239/restoring-election-integrity"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "…the communities they protect and serve.\n\nWe know communities are safer when residents feel safe calling on 911  and when they feel safe working with the police. We know policies like  de-escalation, expanding body-worn cameras, and improving safety should  not move backwards.\n\nThis bill is opposed by D.C. residents. It is opposed by the Mayor of  D.C.…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696935/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…such as       per capita caps or block grants would undermine these values       and risk leaving millions without access to essential health       services.\n\nFurthermore, policies like work reporting requirements have       shown clear evidence of creating artificial barriers to care,       generating paperwork and bureaucracy while doing little to…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…proven record of success.\n\nFederal agencies award a record amount of contracting dollars to  small businesses each year. However, many other factors, complexities,  and policies, like category management and overly strict past  performance requirements, are countering the impact of these programs.  As a result, the government has over 40 percent fewer…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687940/small-business-procurement-and-utilization-reform-act-of-2025"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…operating on narrow margins and have already sustained a 1- percent budget cut this year at the State level. If Congress passes the  budget reconciliation bill and enacts policies like the suggestion on  the State Directed Payment Caps, they will have to reduce their budget  by 20 percent, meaning they will have to cut staff and lay off people.\n\nAs a…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692972/one-big-beautiful-bill"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…raising  costs. All of our economic indicators show that we are heading toward a  recession and that consumer confidence is extremely low.\n\nWhy aren't Republicans fighting policies like the tariffs that impact  the  cost of things now instead of the cost of commercial refrigerators in  2029? I don't know what else to say.\n\nMr. Speaker, I urge opposition…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689127/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…based on their specific       needs. Several other jurisdictions have enacted policies       similar to those in the CPJRAA. States across the country       have enacted policies like these because many believe that       holding law enforcement accountable for abuse of power and       racial bias can deter misconduct. Some jurisdictions have       seen…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697021/opposition-letter-by-the-naacp-legal-defense-and-educational-fund-inc-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Wesley Bell", "party": "Democrat", "sentence": "…special  interest, you get a seat at the table. If you are a nurse, a warehouse  worker, or a parent juggling two jobs, you are out of luck. That is how  we end up with policies like tariffs that raise costs for Missouri  families by $600 a year. It is how we end up with an economy that works  great for the people at the top and barely works for everyone…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699585/stop-the-republican-affordability-crisis"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…bill will help us  build the workforce we need to address evolving threats and keep air  travel trusted and secure.\n\nNow, more than ever, it is critical that we advance policies like the  TSA Commuting Fairness Act to make it clear that we value the critical  work of our transportation security workers.\n\nMr. Speaker, I thank Congressman Garbarino and…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688740/tsa-commuting-fairness-act"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…that part of the bill?\n\nThis economy has shoveled benefits for 50 years on the wealthiest  people in our country. Do we want to compound that unfairness with a  set of tax policies like the ones that are being pursued here and turn  around and cut healthcare for the most vulnerable people in America?\n\nIf you are concerned about waste, fraud, and abuse,…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689543/h-con-res-14"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…vulnerable. It  is a path that listens to the American people and protects programs  like Medicaid and Social Security while lowering the cost of living  through proven policies like the expanded child tax credit which lifted  one-half of our children in this Nation out of poverty, lowered the  hunger rate, and provided a path forward in economic security…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689082/economic-populism"}, {"senator": "Joshua Gottheimer", "party": "Democrat", "sentence": "…hardworking families care about: lowering food and healthcare  prices, cutting childcare costs, and lowering utility bills.\n\nWhat do socialists stand for? Tax-raising, job-killing policies like  defunding the police, shuttering prisons, massive unfunded spending  increases, and even government-run grocery stores.\n\nIn New York, job-killing comptroller, socialist,…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697158/denouncing-the-horrors-of-socialism"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…Our bill is the type of bipartisan work that is  needed to tackle the crisis facing Americans. Among meaningless tweets,  empty promises, costly tariffs, and ridiculous policies like the 50- year mortgage, while this affordability crisis rages on, Congress can  act tonight to support Americans who are looking for real housing  solutions.", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699799/housing-for-the-21st-century-act"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…comes from answering a call that requires hard labor  and lots of sacrifices to feed their neighbors. It isn't glamorous, but  it is essential, and they need commonsense policies like the ones in  the one big, beautiful bill to ensure their businesses can stay afloat  and that their families won't lose their inheritance because Uncle Sam  is trying to…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692936/peace-through-strength"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…support--90 percent. This is just one  of the ways Republicans are helping tipped workers earn more.\n\nAs part of the working families tax cuts, Republicans enacted  landmark policies like no tax on tips and no tax on overtime, which put  more money back into the working family's pockets.\n\nRepublicans are working hard to deliver solutions that help Americans…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698965/tipped-employee-protection-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…oil and gas producers have reduced their total methane  emissions intensity by 42 percent since 2015.\n\nWe have our entrepreneurial spirit to thank for this success, not  policies like the WEC, which are unworkable for American producers and  will lead to our allies being forced to rely on gas with higher  emissions coming from adversarial nations like…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688177/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Rob Wittman", "party": "Republican", "sentence": "…I hear from my constituents about the rising costs of energy,  whether it is at the gas pump or their power bills.\n\nI am proud to cosponsor this bill, H.R. 1047, because policies like  this ensure a supply of reliable, affordable electricity generation. In  turn, we want to do everything we can to lower costs for American  households while providing…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695756/guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…working  families and small businesses in their communities, the elected leaders  in D.C. are going out of their way to deny their own citizens tax  relief. That includes policies like no tax on tips, no tax on overtime,  and an increased standard deduction which 91 percent of Americans use  to file their taxes.\n\nThey say that they are the party of the…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699682/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…RMP does entail some changes to       agency procedure as it introduces new internal directives,       practices, and procedures necessary to carry out these       policies. However, like the Forest Service memorandum in B-      274505 and the Tongass Amendment in B-238859, the North       Dakota RMP is not limited to changes in internal agency…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694908/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…as far as Texas, Illinois, and my home State of  Arkansas.\n\nNationwide, residential electricity prices have increased by 13  percent since 2022, and overturning misguided policies like this RMP  amendment will help make the cost of living more affordable for  families across America.\n\nIt is time to unleash our domestic resources to put this money back…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696879/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…resist when the  government shuts off access to their bank?\n\nWe had a trial run of this during COVID. Lots of people really  objected to all sorts of things about COVID policies, like when their  workplace imposed mandates and restrictions including shots that  weren't really tested or proven. Now we find out that the data, there  is a lot of concern…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693006/central-bank-digital-currency"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…to help drive down the cost of energy for Coloradans  and Americans.\n\nThis is a straightforward piece of legislation that will help  counteract shortsighted energy policies that States like Colorado have  implemented for far too long to the detriment of my constituents and  their wallets.\n\nThis commonsense bill would require State public utility commissions…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697881/state-planning-for-reliability-and-affordability-act"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…reduced emissions more than any other nation  since 2005, all while leading the world in energy production. We should  be building on that success, not undermining it with policies like this  outdated, overly  burdensome Biden regulation that stifle investment and progress.\n\nNorth Dakota is proof that responsible energy production and  environmental stewardship…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689195/work-highlights-of-western-caucus"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…infrastructure.\n\nThe only reason we are mired in mineral dependence today and not  enjoying or sharing the benefits of American mineral dominance is  because of outdated or misguided policies like the one we are  overturning today.\n\nThe resolution before us would correct these policies by reopening  mineral-rich land to exploration and reducing our reliance on China…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699275/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…billion in economic growth for more manufacturing, and billions in new  investments to revitalize our poorest neighborhoods.\n\nWe will reignite our economy with a return of policies like 100  percent immediate expensing and incentives to make sure R&D is  happening here and not being outsourced around the globe.\n\nWe will deliver on President Trump's commitment…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688028/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}]