[{"senator": "Mark Takano", "party": "Democrat", "sentence": "…makeup artist and asylum seeker  who was forcibly disappeared without due process.\n\nAndry entered the United States legally, fleeing persecution for his  sexual orientation and political beliefs. He passed an initial asylum  screening and had no criminal record. Yet, without warning or due  process, he was forcibly removed to El Salvador and imprisoned in…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690506/trump-immigration-policies"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…boys,  were treated as guilty of a horrific crime in Central Park, despite  being innocent of all accusations. It was part of the hyper-punitive  culture that prioritized political talking points about being tough on  crime and targeted Black and Brown communities rather than investing in  resources and policies that actually keep us all safe.\n\nDoes…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695594/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Nikki Budzinski", "party": "Democrat", "sentence": "…have reduced emissions from this plant by  99 percent. Yet this administration chose to cancel this project, along  with countless others, simply because it did not fit their political  agenda.\n\nThis story isn't unique. Today, you will hear from other Members  whose districts received the same frustrating news. It is not just  canceling funds to help companies…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695602/devastating-harm-caused-by-trump-administration"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…playbook       to purge staff and destroy programs in across our entire       domestic infrastructure in government, universities, and       medical center. And they inserting political controls on NIH       science research, FDA approvals, and CDC guidance.\n\nFor the sake of power, they are destroying an enterprise       that added more than 30 years to…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691139/us-global-health-programs"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…the agency entrusted with enforcing this bill  and several others under consideration this afternoon, is compromised  by the Trump administration and the President's illegal political  attempt to fire the two Democratic commissioners.\n\nThis unlawful decision undermines the legitimacy and transparency of  the agency's decisions, sending a message that no…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690174/transparency-in-charges-for-key-events-ticketing-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…As my colleagues have said, what we have seen is the  endless proliferation of criminal offenses, some of them statutory,  some of them regulatory, oftentimes in a kind of political reaction to  a particular event that might have been criminal already under a more  general category.\n\nThis legislation will allow us to get on top of the problem. It will…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697205/count-the-crimes-to-cut-act"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…week's government funding  deadline.\n\nThat is a horrible idea. To be clear, the government funding bill  should have been completed last year, but House Republicans made the  political decision to punt it to this year because my colleagues wanted  to wait for President Trump to move into the White House.\n\nMr. Speaker, House Republicans got what the majority…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688483/disastrous-implications-of-a-yearlong-cr"}, {"senator": "Derek Tran", "party": "Democrat", "sentence": "…my colleagues across the aisle to show some  humanity and compassion to the thousands of veterans who have been  recklessly dismissed from their civil service jobs at the political  whim of this administration.\n\nThe men and women who serve our country deserve our unwavering  support, not broken promises. The indiscriminate firing of veterans by  the…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688466/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing-and-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…bill does not preclude ESG  factors from being considered if they are material, but that is not  true in practice. What will happen in practice is that SEC bureaucrats  and political appointees will get to choose what is material and what  is not.\n\nAny time an executive, a corporate executive, doesn't like what a  shareholder proposal is about, they can…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699159/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "…them to lose  faith in democracy itself, while 77 percent said that, when we tackle  Big Money in our politics, we make our democracy stronger. These  numbers are across the political spectrum, and these numbers are borne  out in survey after survey. Pew, in 2023, showed that nearly three- quarters of all Americans just want us to put limits on what can…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699106/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…local officials.\n\nFor good reason, the Governor of each State makes the decision about  when and where to deploy National Guard, not Presidents who are trying  to score cheap political points and who are trying to divide our  Nation.\n\nI am very proud to be a veteran, and as ranking member of the  Military Personnel Subcommittee, it is my responsibility…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695246/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…that shows up and is ready to respond. Costs and  response capacity are too much for any one State to bear on their own.\n\nAmericans deserve competence and compassion, not political games and  threats to withhold funds when lives are on the table.\n\nWe must remember the lessons of Katrina. Disaster will strike whether  we are ready or not. It is the Federal…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694969/20th-anniversary-of-hurricane-katrina"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…locations across the  United States.''\n\n``The difficulty of recruiting law enforcement officers and employees  is not due to one particular cause. Rather, multiple social, political,  and economic forces are all simultaneously at play.''\n\nIn 1973, Congress passed the D.C. Home Rule Act, which established  locally elected chief executive officer and legislature.…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696933/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…local volunteers, our local regional planning  commissions: What worked and what didn't in the long-term response?\n\nAnd what I heard from officials--regardless of what their political  orientation was but local officials who had a real sense of urgency  about getting the community back on its feet--was that FEMA was too  slow; it was too bureaucratic;…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693402/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "Mr. KHANNA. Mr. Speaker, I am just returning from hearing the  survivors tell their stories, and I was so deeply moved. This is not a  political issue. This is an issue of 14-year-olds and 15-year-olds who  told the stories of how they were solicited by Jeffrey Epstein and  raped and assaulted. Then they went to the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694883/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "John McGuire III", "party": "Republican", "sentence": "…intelligence. This is a commonsense idea, and I encourage my  colleagues to support the amendment.\n\nMr. McGUIRE. Mr. Chair, talking about DOGE is a thinly veiled attempt  to score political points by changing the topic of the conversation  from this amendment, which protects our national security from foreign  entities of concern, and turning it into something…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697894/electric-supply-chain-act"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…Again, let's have the honest conversation. If the other side wants to  fund it, then say it; but don't say it is not happening or bury it  under the typical bureaucratic or political doublespeak. These are the  conversations we need to have.\n\nJust so you know, Mr. Speaker, in the policy that we are looking at  today where we are going to let's say reconsider…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690712/outrageous-government-funded-incentives"}, {"senator": "Darrell Issa", "party": "Republican", "sentence": "…Biden combined. In addition, more than 90 percent of  these nationwide injunctions have been issued by Democrat appointed  judges.\n\nI am calling this what it is: weaponized political lawfare.\n\nThere are 677 district court judgeships nationwide, and as of now, if  just one of these judges decides to block an executive action, they can  singlehandedly halt…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689711/no-rogue-rulings-act-of-2025"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…States. The message is this: America means what  it says, and America will keep our people safe.\n\nNow, Democrats, of course, rushed to turn this successful strike into  a political fight. Even today, they are forcing the Senate to vote this  very afternoon on a resolution that says the President lacked the  authority to do what he did. They have gone…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693090/iran"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…the production of fentanyl by targeting the source of  precursors in China.\n\nChinese producers of synthetic opioids and opioid precursors and  senior government and Chinese political officials' culpability does not  end when their precursor products land in Mexico or illegally cross our  southern border. We must look at every step of fentanyl's deadly…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694828/stop-chinese-fentanyl-act-of-2025"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…come to an agreement on  reconciliation language so that the committees can begin drafting  specific policies to achieve the administration's agenda.\n\nThere has been a lot of political rhetoric about what this upcoming  budget resolution does and does not do, and I want to be clear about  where I stand.\n\nAs a Representative of one of the most agriculturally…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688025/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…that  this particular project has a greater ability to keep information  secret than anything else in the public domain in California.\n\nIt just goes to show how desperate the political leaders in  California are, starting with the Governor, to avoid any accountability  here.\n\nMr. Speaker, the Governor, for his part, held a big ceremony  yesterday with much…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699738/national-oversight-for-biological-labs"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…President Trump is doing. The Senator refused to answer that  question. Instead, he told a national television audience that having  the National Guard in Washington, DC, was a ``political stunt.'' He  blamed President Trump.\n\n``Political stunt''? It is a matter of public safety.\n\nPresident Trump is the one who is protecting American citizens from  terrorist…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697341/trump-administration"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…at an event--\n\n(1) sponsored by--\n\n(A) the United States or any territory thereof, the       District of Columbia, any State, a federally recognized       Indian Tribe, a political subdivision of any State,       territory, or federally recognized Indian Tribe, or any       agency or public instrumentality of any of the foregoing;\n\n(B) a college, university,…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692725/helping-angels-lead-our-startups-act-of-2025"}, {"senator": "James Risch", "party": "Republican", "sentence": "…proposed sale will support the       foreign policy and national security objectives of the United       States by improving the security of a NATO Ally that is a       force for political stability and economic       progress in Europe. The proposed sale will improve Belgium's       capability to meet current and future threats by maintaining       its F-16…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696021/arms-sales-notification"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "Mr. MANN. Mr. Speaker, I rise today still in shock and saddened at  the political assassination of Charlie Kirk. There is no place for  political violence in our country, and it is antithetical to who we are  as Americans.\n\nThe beauty of our Nation and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695600/we-are-better-together"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…intelligence, unmanned systems, hypersonic weapons, next-generation  aircraft, and space-based capabilities, they are all reshaping the  battlefield. At the same time, we live in a political environment that  is too often partisan and divided.\n\nYet on this issue, I believe most of my colleagues agree that we must  confront these threats head-on, and that means…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695027/9999"}, {"senator": "French Hill", "party": "Republican", "sentence": "…building churches, have  limited representation in government, and, tragically, have been  targets of violence and persecution. They are attacked in the streets,  held as political prisoners, and have little recourse.\n\nThe discrimination they face not only violates their basic human  rights, but also undermines Egypt's rich cultural diversity and  history,…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698914/warmth-of-collectivism"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…requirements and limitations that apply under this paragraph       to a civil action brought by an attorney general.\n\n(c) One National Standard.--\n\n(1) In general.--A State, or political subdivision thereof,       may not maintain, enforce, prescribe, or continue in effect a       provision of any law, rule, regulation, requirement, or       standard having…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692730/romance-scam-prevention-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…money for the program. I need  more money for--fill in the blank. I need more money for Medicaid. I  need more money for SALT. Why? It is because they feel like they have a  political interest in doing so.\n\nI am sure the gentleman had, like I did yesterday, the farm bureau  coming into your office and needing help. Guess what? I understand why  they need…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690587/economic-anxiety"}]