[{"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…homicide that are 10 or 20 times higher  than Canada, the United Kingdom, France, Germany, Israel, and Japan.  You name it, nothing comes close to us.\n\nInstead of helping police officers by getting guns out of the hands  of criminals, our colleagues are just looking for ways to create more  loopholes in the laws for purchasing guns.\n\nMr. Speaker, again,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691349/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…now have a President who has pardoned January 6 rioters, calling  them patriots, and brought them into his administration, including one  caught shouting ``kill them'' at police officers that day.\n\nWe have an administration that treats White nationalist extremism as  a core competency in the hiring process and an administration that  focuses Federal law…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700133/climate-change"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "…these streets cutting funding for programs that support a lot  of things Americans care about: Survivors of sexual assault, programs  that offer mental health care for police officers and keep hotlines to  victims of crime open, programs that assist law enforcement in rural  communities, provide guidance on finding safe housing, and offer care  and…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1690993/support-safer-communities"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…like lip service to me.\n\nBut the hypocrisy doesn't end there. President Donald Trump, in his  speech to the joint session of Congress last week, said he would, ``Get  police officers nationwide the support, protection, and respect they so  dearly deserve.'' He said those words in a chamber that was protected  by the very officers who were violently…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688828/january-6-pardons"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…may not be favored are attacked and attacked and attacked? Where were  you? Did you speak up when they came for those firms?\n\nWhat about when the people who attacked the police officers who  defended this building--an American democracy--on January 6; who just  outside those doors put their lives on the line for us, and many of  them would later die--where…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…occasions, knew that he lived, ate, and  breathed Paterson. That man loved Paterson and was Paterson.\n\nMr. Speaker, it is also fitting that, on the week that we honor  police officers, who put their lives on the line to protect and serve  us, this is the time that we will pass this bill honoring Bill  Pascrell. He never backed down from standing up…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691126/redesignation-of-paterson-great-falls-nhp-facilities"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…law when it comes to honoring law  enforcement because this body on March 15, 2022, passed a resolution to  put up a plaque, a simple plaque to honor the noble and brave police  officers who battled for 4 or 5 hours to stop a violent riot and  insurrection unleashed against this Chamber and against the Senate in  an attempt to overthrow a Presidential…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693146/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…racist vulgarities. But we  made that walk, and our democracy prevailed.\n\nBut in one of President Trump's first acts, he pardoned the violent  offenders who had struck police officers, who had injured over 100  police officers. That is what he did.\n\nAnd from that January 6 insurrection to dangerous rhetoric and  baseless election conspiracies, to other…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690545/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…to ensure that they now will  see a giant sign saying, ``Come get your weapon,'' because they no  longer will be prohibited from getting one of these weapons, while the  police officers, the law enforcement officers across this country, get  no benefit. In fact, their job is made more difficult because these  weapons can no longer be traced when used…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700030/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…fleecing of the  American people, which they get and understand.\n\nAt the same time, this bill excludes a provision that would order a  plaque to be hung that honors the police officers who put their lives  on the line to defend our democracy from that same insurrection. What a  contrast.\n\nIt is yet another instance of this administration's shameless…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696741/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…took that position.\n\nThose 30,000 who will be out of the VA by the end of the year include  1,720 registered nurses, 600 doctors, 1,150 medical support assistance,  200 police officers, 80 psychologists, and more than 1,000 claims  examiners. Maybe we should be grateful the number isn't 83,000, which  was his plan, and she was his senior adviser for…", "date": "2025-07-31", "source_url": "https://justfacts.votesmart.org/public-statement/1694542/9999"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…helps restore public confidence in law enforcement both by       deterring abuses of power and demonstrating that law       enforcement is not above the law. Holding police officers       accountable for violating the law does not lead to an       increase in crime in fact, D.C. saw a 30-year low in violent       crime in 2024, after the CPJRAA was…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696914/letter-led-by-the-leadership-conference-on-civil-and-human-rights-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "…Supreme Court has held  that Congress can delegate full legislative authority to the District  of Columbia for local matters. However, Republicans choose not to do  so.\n\nPolice officers are entrusted with extraordinary authority to protect  public safety. The vast majority of officers exercise it honorably and  bravely. However, there must be accountability…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692304/protecting-our-nations-capital-emergency-act"}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "…He was a target because he had the courage--he had the  courage--to speak the truth about the results of an election.\n\nWe didn't know that, at that very moment, Capitol Police officers  were being pinned in doors, being beaten with flagpoles, and being  attacked with bear spray. We didn't know that Officer Eugene Goodman  was making a split-second decision…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698511/9999"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…of this bill is irrelevant since there is never  justification for Congress to legislate on local D.C. matters.  Nevertheless, I will discuss it.\n\nVehicular pursuits by police officers are inherently dangerous not  just for officers and suspects but for bystanders, too, and often there  are other options to detain a suspect. D.C. permits vehicular pursuits,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695641/district-of-columbia-policing-protection-act"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…vandalism,  blocking streets and highways, lighting cars on fire, shooting  fireworks, throwing rocks at law enforcement vehicles, and even  assaulting Federal and local police officers. As a result, we saw more  than 500 rioters were arrested, and at least a dozen LAPD officers were  injured.\n\nLocal and State leadership clearly could not contain the…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693138/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…political  class which seems hell-bent on undermining and attacking them at every  turn.\n\nWe have watched this unfold for years now. The press has smeared and  defamed our police officers, seeking to incite hatred and violence  against them. Fringe academic ideas about defunding police and  shuttering prisons have moved from the classroom, to the courtroom,…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696003/unanimous-consent-requests"}, {"senator": "Pat Ryan", "party": "Republican", "sentence": "…we, their elected Representatives, listen and  act and elevate it. That is economic patriotism.\n\nI am proud that as a Democrat our party stands with law enforcement  and police officers, stands with small businesses, stands with  veterans, stands with hardworking families, with nurses, teachers, and  truck drivers. Democrats stand with our constituents,…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689084/economic-populism"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…classes, Firearms qualifications  training, Self Defense training, Non-Lethal Force training, and Taser  and OC Spray usage training for the Department and for the Municipal  Police Officers Training and Education Commission. He is also certified  by the federal government in National Incident Management Systems and  Federal Motor Carrier Commercial Vehicle…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698017/recognizing-chief-steven-kingsborough"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…this District safe and secure.\n\nOn January 4, 2023, the D.C. Council passed the Comprehensive  Policing and Justice Reform Amendment Act of 2022. The act stripped  D.C. police officers of certain employee protections, making the job  more difficult despite rising crime in the District.\n\nWhen the D.C. Council passed this law, Congress acted swiftly in…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692305/protecting-our-nations-capital-emergency-act"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…a reason the  Protect and Serve Act is supported by law enforcement groups across the  Nation: the Fraternal Order of Police, the National Association of  Police Organizations, the Police Officers' Defense Coalition, the North  Carolina Fraternal Order of Police, the National Sheriffs' Association,  and the Major County Sheriffs association.\n\nLadies…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691402/motion-to-discharge-s-res-195"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…tax  cuts. Waiters, barbers, and bartenders keep $1,300 more by having to  pay no tax on tips. In my home State and in the Presiding Officer's,  nurses, firefighters, and police officers can keep $1,400 more by  having to pay no tax on overtime. New parents get a $1,000 Trump  account for every newborn child, to invest in their future, and parents  get…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696537/government-funding"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…intervene in times of need.  Without their timely response and attentive care, our region could not  be the healthy and supportive place it is today.\n\nI recognize our local police officers, who are often the first ones  on the scene of an emergency and the first wave of assistance for  someone experiencing a mental health emergency. They are heroes,  lifesavers,…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691424/increasing-mental-health-services"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…coverage of       online and on TV have been ``peaceful.''\n\nLet's set the record straight: Protestors were engaging in       violence and vandalism--burning cars, attacking police       officers, and burglarizing businesses. The previous       administration's open-border policies and disregard for the       law led us to the chaos and lawlessness we are seeing…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692878/newsletter-from-congressman-chuck-edwards"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…are our neighbors, they are  our friends, but many of them are also survivors or family members of  survivors or family members of those who are lost. There are still  police officers and firefighters that have literally never been back to  that location because it is too painful to be able to return to a spot  where they carried out the bodies of their…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690112/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…D.C. Council essentially made it illegal for police  to pursue and apprehend criminals if they were fleeing in a vehicle by  imposing a complex matrix of 14 factors that police officers have to  consider for whether or not they would pursue a fleeing vehicle.\n\nI speak from my own experience as a police officer. I have been, very  likely, the only one…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695643/district-of-columbia-policing-protection-act"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…dangerous crimes.\n\nH.R. 5107 would repeal the Comprehensive Policing and Justice Reform  Amendment Act of 2022 enacted by the District of Columbia Council. This  act targeted police officers in D.C. for simply doing their duties, and  it led to over 1,600 officers being removed from the city's force.\n\nThanks to President Trump's efforts, the streets in D.C.…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696900/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision-providing-for-consideration-of-h-con-res-denouncing-the-horrors-of-socialism-providing-for-consideration-of-hr-unlocking-our-domestic-lng-potential-act-of-providing-for-consideration-of-hr-researching-efficient-federal-improvements-for-necessary-energy-refining-act-providing-for-consideration-of-hr-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-providing-for-consideration-of-hr-district-of-columbia-cash-bail-reform-act-of-and-for-other-purposes"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "Mr. BEAN of Florida. Mr. Speaker, diamonds are rare and among the  most sought-after treasures in the world--but so are police officers.  Their courage, dedication, and commitment to protecting communities  make them priceless. Unlike diamonds, their shine comes not from the  way they reflect light, but…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690845/recognizing-clay-county-police-memorial-day-and-law-enforcement-appreciation-week"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…Lieutenant Moffett's pride in serving the residents of Bucks  County was always evident--so much so that this legacy continues, with  all three of his sons now serving as police officers in communities  across the county.\n\nAfter a long and honorable career in law enforcement, Lieutenant  Moffett looks forward to a well-deserved retirement.\n\nMr. Speaker,…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694744/recognizing-buckingham-township-police-department-lieutenant-william-moffetts-35-years-of-service"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…there were 342  on-duty officers who were shot, 50 of whom were killed.\n\nIn February of this year, tragedy occurred in the district I am  honored to represent when multiple police officers were shot while in  the line of duty. One, Officer Andrew Duarte of the West York Borough  Police Department, made the ultimate sacrifice. Mr. Speaker, he was  only 30…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689661/authorizing-the-use-of-the-capitol-grounds-for-the-national-peace-officers-memorial-service-and-the-national-honor-guard-and-pipe-band-exhibition"}]