[{"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…Branch Subcommittee, I am  more than willing to work with the Architect of the Capitol and  Republican leadership to make sure that we honor our police officers,  and this Police Week it is important that we do that.\n\nWhat do we get from the White House? We get a pardon of very violent  people that wanted to hurt all of us.\n\nMr. ESPAILLAT. Mr. Speaker,…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691171/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…for all. Founded in 1874, the department has a  long history of dedicated officers working to build public trust  through accountability and equitable policing.\n\nNational Police Week offers an opportunity to honor law enforcement  and pay tribute to those who gave their lives serving their  communities. This week, we honor Officer Evan Dunn, who was…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692010/recognizing-the-golden-police-department"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "Mr. Speaker, this week, we welcome thousands of law enforcement  personnel to Washington for National Police Week. We remember officers  who lost their lives in service to our communities and our country, and  we thank all officers who work to keep us safe while reflecting on how  we…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691030/expressing-support-for-local-law-enforcement-officers"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "Mr. VASQUEZ. Mr. Speaker, I rise today during National Police Week to  honor the courageous law enforcement officers from New Mexico who have  made the ultimate sacrifice in service to our communities.\n\nEvery day across our country and…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691300/national-police-week"}, {"senator": "Eric Sorensen", "party": "Democrat", "sentence": "Mr. SORENSEN. Mr. Speaker, this is National Police Week when we honor  the brave men and women who serve and protect us every day, but it is  also a good reminder that they deserve our thanks every day. We also  need to thank…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691333/thanking-our-law-enforcement-officers-and-their-families"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…preparing Orange County's next  generation of leaders.               Honoring Santa Ana Police Chief Robert Rodriguez\n\nMr. CORREA. Mr. Speaker, I rise today to celebrate Police Week by  honoring my very good friend, Santa Ana Police Chief Robert Rodriguez.\n\nChief Rodriguez was brought to the United States when he was 4 years  old as an undocumented…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691173/congratulating-loris-griset-academy"}, {"senator": "Raul Ruiz", "party": "Democrat", "sentence": "Mr. RUIZ. Mr. Speaker, I rise today during National Police Week to  honor the bravery, sacrifice, and service of law enforcement officers  across California's 25th District and our Nation.\n\nI thank every officer in my district, from…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691331/9999"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "Ms. STANSBURY. Mr. Speaker, as we honor Police Week, I rise to take a  moment to thank all of our first responders who bravely put their lives  on the line every day across New Mexico and to honor all of those who  have fallen…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691382/supporting-our-first-responders"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "Mr. CROW. Mr. Speaker, as we commemorate Police Week, I join my  colleagues in honoring law enforcement around the country and back home  in Colorado.\n\nOn Capitol Hill, the men and women of the U.S. Capitol Police protect…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691167/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…the  ICA, such as Elon Musk.\n\nIt is time to stand up for the rule of law and to put the power of  the purse back where it belongs, in the hands of Congress.\n\nThis National Police Week, I urge my colleagues to consider  supporting this important law enforcement priority.", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691297/stand-up-for-the-rule-of-law"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…out today. Indeed, it doesn't provide a single Federal  dollar to help local law enforcement.\n\nIn fact, our colleagues have not advanced a single bill during this  entire Police Week or even this entire session of Congress to increase  funding to State and local police.\n\nIn fact, the party that now controls the White House and both  Chambers of Congress…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691349/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…law enforcement officers encounter put them, as  we all know, at an increased risk of developing mental health  disorders, including PTSD, depression, and anxiety.\n\nThis Police Week, I thank the sponsors of the bill, my colleagues  across the aisle, for introducing H.R. 2240, the Improving Law  Enforcement Officer Safety and Wellness Through Data Act.…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691322/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "Mr. VINDMAN. Mr. Speaker, today during National Police Week, I rise  to commend the bravery of law enforcement officers across Virginia's  Seventh Congressional District.\n\nIn early April, tragedy struck Spotsylvania County when a…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691301/commending-virginias-seventh-district-law-enforcement-officers-for-their-bravery"}, {"senator": "Laura Gillen", "party": "Democrat", "sentence": "Ms. GILLEN. Mr. Speaker, in recognition of National Police Week, and  on behalf of New York's Fourth Congressional District, I am proud to  stand here today to honor our brave men and women in law enforcement.  Every day, our officers…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691183/national-police-week"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "Mr. Speaker, this is Police Week. In colloquial terms, it is Law  Enforcement Week. Traditionally, we do two things in Law Enforcement  Week. One, we recognize the valor, the sacrifices, and the commitment…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691242/leosa-reform-act"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…be  considered made and laid upon the table, all en bloc.\n\nI rise to request unanimous consent here on the bills that were just  mentioned, to call up and pass this year's Police Week bills. These are  bipartisan bills. These are common sense. Most importantly,  particularly in light of recent events--and you can turn on the  television right now and…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696003/unanimous-consent-requests"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Recognizing Deputy Jeff Bilodeau\n\nMr. KILEY of California. Mr. Speaker, as part of the California  Congressional District Three Police Honor Roll and in honor of National  Police Week 2025, I wish to recognize Deputy Jeff Bilodeau of the  Placer County Sheriff's Office for his unwavering commitment to serving  and protecting the Placer County community.…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…Spotswood Trailblazers on this historic win. They  have made Spottswood proud. We can't wait to see what they accomplish  in the future.                        Honoring National Police Week\n\nMr. CLINE. Mr. Speaker, I rise today during National Police Week to  recognize the brave men and women in law enforcement who serve our  communities, our Commonwealth,…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691284/congratulating-salem-high-school"}, {"senator": "Tony Wied", "party": "Republican", "sentence": "…current role as sheriff, Timothy Wilz's  dedication to public service is an inspiration to us all.\n\nIt is especially fitting that his 30-year anniversary fell during  National Police Week, a time when we honor the hard work of our law  enforcement officers who put their lives on the line every day to keep  our communities safe.\n\nThroughout his impressive…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691410/recognizing-sheriff-timothy-wilz"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "Mr. SHREVE. Mr. Speaker, I rise in recognition of our law enforcement  community in Indiana's Sixth District and across our Hoosier State.\n\nPolice Week is a time for all of us to recognize and honor those  serving our communities and, most especially, those who have given  their lives in the line of duty.\n\nThis week, I…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691339/recognizing-indianas-sixth-district-law-enforcement-community"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…THOMPSON of Pennsylvania. Mr. Speaker, this past weekend, tens of  thousands of law enforcement officers from across the country traveled  to Washington, D.C., for National Police Week.\n\nEstablished in 1962 through a joint resolution of Congress, National  Police Week is a time for our Nation to honor the courageous men and  women who made the ultimate…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691352/saluting-police-officer-heroes"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…of delivering on President Trump's agenda.               Honoring our Courageous Law Enforcement Officers\n\nMr. JOYCE of Pennsylvania. Madam Speaker, this week is National  Police Week, where we have an opportunity to honor the courageous law  enforcement officers who put their lives on the line each and every day  to protect us.\n\nOn the House floor this…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1690998/delivering-on-president-trumps-agenda"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…of this process and for the  work my colleagues here are putting into this, as well.\n\nIn addition to the reconciliation work, House Republicans are honored  to recognize Police Week and highlight the important work of our law  enforcement officers that they do each day.\n\nI just was walking through the Capitol rotunda, and I saw a few  police officers…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691166/events-this-week"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "Mr. TILLIS. Mr. President, I rise during Police Week to honor the  brave men and women in North Carolina and across the Nation who serve  in law enforcement. Thousands of officers and their families come to  our Nation's Capital…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691402/motion-to-discharge-s-res-195"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…Byrne JAG and  COPS Programs for local police as well as efforts to combat drug  trafficking.\n\nAdditionally, four bipartisan bills the Judiciary Committee passed  during Police Week in May became law with the passage of the National  Defense Authorization Act. These new laws will expand access to Federal  support for law enforcement and their families…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698692/national-law-enforcement-appreciation-day"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…Speaker, this week, we honor the brave men and women who wear the  badge, those who serve with courage, professionalism, and heart to keep  our communities safe.\n\nNational Police Week is a time to give thanks and to reaffirm our  support for the law enforcement officers, from Utah to D.C., who put  their lives on the line every single day.\n\nThese officers…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691165/events-this-week"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…enforcement agencies and the communities they serve to       strengthen public safety and trust.\n\nMr. JORDAN.  Con. Res. 30.\n\nMr. Speaker, this week, we celebrate National Police Week. In so  doing, we honor those officers who have been killed in the line of  duty, as well as those who bravely serve their communities every single  day.\n\nMore than 60 years…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691031/expressing-support-for-local-law-enforcement-officers"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "Mr. CISCOMANI. Mr. Speaker, I rise today during National Police Week  to honor the men and women in law enforcement for their invaluable  service to our Nation.\n\nI especially thank all of the police officers in my district who work  tirelessly…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691350/national-police-week"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…provides each with a motion to  recommit.\n\nMr. Speaker, Republicans are here in Washington this week to continue  to work on behalf of the American people. This is, in fact, Police  Week, but we have been busy this year, this Congress delivering for the  American people.\n\nIn this Congress so far, we have passed legislation to secure our  elections, H.R.…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691169/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "Mr. GRASSLEY. Mr. President, today, I am here in the Senate honoring  our Nation's law enforcement officers during our 64th annual National  Police Week.\n\nNational Police Week presents an opportunity to show appreciation  toward the men and women in blue for their sacrifice and selfless  service and honor, at the same time, the fallen…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690982/national-police-week"}]