[{"senator": "Lateefah Simon", "party": "Democrat", "sentence": "…American citizens who  don't have the papers to fill what this bill demands. We all know the  history.\n\nDarnella Cavaness, my grandmother from Malvern, Arkansas, had to face  the poll tax. After Reconstruction, nobody wrote the word ``race'' into  a single suppression statute. They wrote poll taxes. They wrote  literacy tests, good character clauses. It was…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699939/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Nikema Williams", "party": "Democrat", "sentence": "…licenses, even the REAL ID, don't prove citizenship.\n\nThis resolution could force Georgians to pay more than $700 million  just to register to vote.\n\nMr. Speaker, that is a poll tax, plain and simple, and it is blatant  voter suppression.\n\nMs. WILLIAMS of Georgia. Mr. Speaker, voter suppression by any other  name is still voter suppression. This resolution…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1689998/safeguard-american-voter-eligibility-act"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…do, and in many cases unable to  keep their employees, or keep their doors open in some cases. This  uncertainty is weighing on a lot of families as well. According to one  poll, 59 percent of Virginians expect to face financial difficulty in  the years ahead. This doesn't sound like the golden age. It sounds like  fool's gold.…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691978/recognizing-fauquier-high-school-class-of-2025"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…this known danger. This web of denial, of fraud,  of corruption costs American lives, and it costs Americans money, too.\n\nBy the way, voters are paying attention. A December poll found that  65 percent of American voters understand that climate change is  increasing their cost of living. And we know that to be true. As  chairman of the Budget Committee,…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698993/unanimous-consent-request-s-res-550"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…passport. And it will set you back $165 to get one just so you can  exercise your constitutionally protected right to vote.\n\nBy the way, I wonder if that could be considered a poll tax, which  was outlawed through our Constitution, and we have to respect our  Constitution. We all take an oath to do that.\n\nThe Trump policy allows citizens to use a REAL…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690531/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…portfolio may be. We should be making decisions based just on what is  best for the American people.\n\nThe American people recognize that this is a reform that is long  overdue. Poll after poll has shown upwards of 90 percent of the  American people supporting a ban on Members trading stocks.\n\nThis is an issue that has been around for a while. Yet, in just…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691216/stock-trading-ban-for-members-of-congress"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…That is the operative word: chaos. The turmoil  and turbulence have produced confusion and, yes, anxiety, deep fear,  and apprehension about the future of this country. And the poll numbers  only reflect not only the downward spiral of our economy but of our  confidence in the future.\n\nThis administration has been cruel, and it has been dumb. It is  unmatched…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690353/9999"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…Black men voted and  got elected to office. When Reconstruction ended, though, the former  Confederate States passed new constitutions, including such things as  literacy tests, poll taxes, and felony disenfranchisement. In the words  of E. Carter Glass in the Virginia constitutional convention of 1902,  he said these were intended to ``eliminate the darky''…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689341/fighting-voter-suppression"}, {"senator": "Veronica Escobar", "party": "Democrat", "sentence": "…that our country is  in. It is not just an economic crisis, as we see our country sinking  very quickly into an economic crisis, which is being reflected in  Donald Trump's poll numbers. In fact, his sinking poll numbers are even  being reflected in the issue that many consider to be his strong suit  with the American people, which is immigration.…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690507/trump-immigration-policies"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…meme coin while you are at  it.\n\nRemember, all of these grifts are for a limited time. They won't last  much longer.\n\nThe American people deserve much better. A recent FOX News poll--yes,  FOX--showed that a big majority opposes the name change for the Gulf of  Mexico: 67 percent. Americans know a joke when they see one, even if  this Republican Congress…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690937/gulf-of-america-act"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…tariffs, but we don't  know what is coming on day 91.\n\nTariffs are imposed. Tariffs are not imposed. More significant  tariffs are imposed. I hope it has nothing to do with his poll numbers  because the American public will continue to feel more pain.\n\nMy point is this. Other markets and consumers abroad who have  purchased from the United States are going…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690535/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…Americans.\n\nIn advancing it, Republicans invoke those historical policies that  were intended to disenfranchise Americans. Let me remind Members what  they were: literacy tests and poll taxes for eligible voters,  grandfather clauses that tied voters' rights to the grandfathers before  the Civil War, all-White primaries to eliminate Black voters' presence…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690008/safeguard-american-voter-eligibility-act"}, {"senator": "Laura Friedman", "party": "Democrat", "sentence": "…FRIEDMAN. Mr. Speaker, I thank Ranking Member Morelle for  yielding me time.\n\nMr. Speaker, I rise in strong opposition to this so-called SAVE Act,  a bill that is a modern-day poll tax targeting American women and low- income Americans.\n\nThis bill bans voter ID. It bans using driver's licenses as a voter  ID unless they are backed by additional proof of…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690000/safeguard-american-voter-eligibility-act"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…American citizens.'' What is really diluting the voice of  American citizens are voter suppression laws like we see in the South  and like we see in Florida where I am from: poll taxes, voter roll  purges, and voter intimidation. That is what is diluting the voice of  American citizens.\n\nI haven't heard a single Republican in this debate talk about…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692318/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…propelled the Akron Zips Women's lacrosse team to victory.\n\nThe odds were stacked against this team as they were picked to finish  last this season in the MAC Preseason Coaches Poll, but they persevered  and beat the odds coming in as the champions.\n\nThis historic season was led by Coach Elaine Jones, who also won the  MAC Coach of the Year Award.\n\nCongratulations…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691189/champion-of-the-week-university-of-akron-womens-lacrosse-teams"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…for months  and months, and I understand that they don't like what the House  Republicans are doing and don't like what the  President is doing, but the American people do.\n\nPoll after poll is showing that an increasing number of people now  believe this country is heading in the right direction. A Rasmussen  Reports survey shows that this is the first…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691940/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…said that when  you have closed rules, this is what it looks like in an authoritarian  dictatorship.\n\nMr. Speaker, I know that the words ``authoritarian dictatorship''  must poll well because my colleagues on the other side of the aisle are  consistently throwing it out there. Here is what is so fascinating: In  an authoritarian dictatorship, you don't…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697302/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…Those two things are the biggest items of this entire bill. Then to  go and say it is just some tax giveaway to the wealthy, it just flies  in the face of reality. It might poll well, I guess, but it is  disheartening to see something that I actually believe most, if not  all, Members of Congress believe in a simplified, higher standard  deduction,…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691960/supporting-the-big-beautiful-bill"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "…him with anything but caution  and contempt.\n\nAfter 4 years, Putin knows a Russian victory is not inevitable. More  and more, the American people see and know this. A November poll found  that 70 percent of Americans do not trust Putin to honor any peace  agreement with Ukraine.\n\nHe is cut from the same cloth as terrorists all over the world and  terrorists…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699095/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "John Thune", "party": "Republican", "sentence": "…number of other Democrats  have spoken at length on many occasions about the pain--the pain--that  government shutdowns cause Americans. Since he mentioned it, I will  show this poll. This is a poll right here, the New York Times.\n\nBy the way, this morning, the Democrat leader used one of my other  charts. Thank you for doing that. It makes my point. I am…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695921/continuing-appropriations-and-extensions-and-other-matters-act-2026"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…protect women and girls  in sports. There is absolutely zero reason for Senate Democrats to  oppose this resolution, and here is the reason why: We have a New York  Times Ipsos poll that tells the story on this. Seventy-nine percent of  the American people, including 67 percent of Democrats, want to make  certain that female sports are for girls and women.…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688449/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…reconciliation bill. Their tax cuts  are going to make sure the rich always win.\n\nNow, Trump's approval ratings are the lowest of any President in the  last 80 years. In the latest poll released today, Americans give him  F's. He is getting F's on the economy. He is getting F's all over the  place.\n\nAmericans disapprove of Trump because he is destroying our…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690387/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…are saying that American minorities are not capable of showing  an ID to vote. It is an insult. It is abusive. In reality, 76 percent  of Black Americans support voter ID in poll after poll, and 82 percent  of Latino Americans support voter ID in poll after poll.\n\nWhat the left is saying is that they don't trust the American people  to prove who they…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700014/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…bill might  do. We are about to find out what it will do.\n\nThe Democrats have succeeded in frightening Americans into lopsided  opposition. On the day it passed the House, one poll registered just 29  percent public support for it compared to 55 percent opposition.\n\nThis has encouraged Democrats to double down on their hysterical  warnings of societal…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693629/democrats-big-mistake"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…volunteer and for Oasis. Carol  is an inspiration to the staff and the team she serves with.  Additionally, Carol has served for years as a Sunday School teacher  each week and Poll Captain of elections in her area. She truly is a  Hero in the community.\n\nIt is clear Carol Berti has made a profoundly positive impact on our  community, and I am grateful…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690132/recognizing-carol-berti"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…of California are  overwhelmingly opposed to this plan.\n\nHow do we know that? California voters have voted three times to  support the independent redistricting commission. A poll just recently  came out from Politico asking voters: Do you want the commission to  draw district lines, or do you want the politicians to get that power  back?\n\nBy a 2-1 margin,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…win--the President said Ukraine can win--and unlike some of  his advisers, the American people are indicating in clear majorities  that they think we ought to help.\n\nBy one recent poll, more than 6 in 10 Americans support--support-- sending more arms and military supplies to help Ukraine win. That  includes--listen to this: A clear majority of Republicans…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695989/9999"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…of millions of illegal aliens into this country that prompted a crisis  in countless communities, including my own, Americans' top concerns  coming back time and time again, poll after poll, were the economy and  our border. Democrats did no work to address those concerns.\n\nDid Vice President Kamala Harris address them? No, she did not. She  didn't make…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688464/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing-and-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "David McCormick", "party": "Republican", "sentence": "…like those  in Chester County, they rightly question the integrity of our electoral  process.\n\nIt should come as no surprise to us that according to a recent  Scripps and Ipsos poll, more than half of Americans--more than half-- are concerned about noncitizens voting and more than half fear  electoral fraud.\n\nThe bottom line is we cannot stand in this Chamber…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700069/9999"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…country. I am calling on House  leadership to do the right thing and bring this bill to the floor for a  vote. Not only is it supported widely by Members in this body but a  poll showed that the American people support this proposal by a 3 to 1  margin. Let's pass this legislation and restore a dose of sanity to  politics in this country.", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696907/bring-the-senseless-redistricting-war-to-an-end"}]