[{"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…and their future.\n\nThey want to prevent States that are at the forefront from using  their authority to cut tailpipe pollution, a move that guts local  authority in favor of polluters. We must let our communities lead.  Repealing these waivers would undermine stronger vehicle emissions  standards that reduce dangerous pollution and are essential to fighting…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690482/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Rick Larsen", "party": "Democrat", "sentence": "…better protect their own water. The  result will be more pollution in our Nation's rivers, streams, and  lakes, thanks to loopholes, legal shields, and limited oversight of  polluters.\n\nThird, this bill will end up slowing projects by increasing  regulatory uncertainty and delay. Democrats want to pass bills that  invest in infrastructure and get projects…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698022/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…this can down the road and wait to take action. As our  kids are forced to grapple with this reality, I am sick and tired of  Republican efforts to let Big Oil and corporate polluters off the hook.\n\nThe methane polluter fee that would be rolled back by this resolution  corrects a serious market failure that makes it cheaper for polluters  to waste methane…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688175/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…limit, a carbon pollution  limit on big companies--72 to 12. That is where the American people  are, not in the pockets of Big Oil.\n\nHere is another one: Impose a fee on big polluters. It shouldn't be  pollute for free. If you are polluting something, whether it is your  neighbor's yard with your waste, your trash, throwing it over the fence  or whether…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697077/climate-change"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…communities to the highest  bidder. This is in addition to gutting Medicaid and the Affordable Care  Act.\n\nWhat they put in relating to their pay-to-play scheme would allow Big  Oil polluters to pay a one-time $1 million fee to the Department of  Energy to grease the skids to get polluting gas plants online faster.\n\nYes, we need more energy, but this comes at…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691593/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "Ms. TLAIB. Mr. Chairman, we know that the dirty water bill reduces  significant oversight for the Clean Water Act, and it is really  important to know that polluters are pushing to weaken this--not  residents, not families, and not communities that are directly  impacted.\n\nThis is about discharging toxic chemicals into our water bodies.…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698042/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…listing PFAS as hazardous air pollutants, this bill sets the  foundation for strong, science-based standards that will reduce  emissions. The PROTECT Act also holds major polluters responsible for  the cleanup of these poisons, delivering real transparency and  accountability to affected communities.\n\nMr. Speaker, I thank my bipartisan cosponsors from…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698778/removing-pfas-from-our-environment"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…hardworking families, and now Republicans want to offer  a package of bills that is going to make it worse, add insult to  injury.\n\nThey just can't stop providing solace for polluters. They have  already gutted a lot of the tools that make energy more affordable,  like clean energy tax credits, like trying to save on energy efficiency  and things like…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695692/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "…front  lines of helping our citizens during Hurricane Helene.\n\nThe Trump administration is attacking Federal research offices  because they expose disastrous policies and hold polluters accountable.  Eliminating the Office of Research and Development not only violates  the law, it puts our people, public health, and the environment in  danger.\n\nI will fight…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689045/expressing-concern-regarding-job-cuts"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…crushingly expensive to do so.\n\nHardworking American families are just looking up here to Washington  and saying: Can you all please focus on solutions and not cater to the  polluters and the folks who have all too much power here in the Halls  of Congress? It is not fair.\n\nThis bill is an example of not only is it a waste of time, because  here is the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695767/national-coal-council-reestablishment-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "Mr. Speaker, I rise in strong opposition to H.R. 3616, yet another  Republican bill that puts large corporate polluters over people. At a  time when American families are struggling with rising monthly energy  bills, this legislation does nothing to address the affordability  crisis.\n\nElectricity…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698275/reliable-power-act"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…injustice.\n\nHere is the double insult of the Trump administration. One is they  gutted the Environmental Justice section at the DOJ. They are not  investigating corporate polluters. They are not investigating the  injustices environmentally that big, powerful, wealthy people do that  often cause people--we all saw ``Erin Brockovich''--that cause people…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…choice. Well, let me ask: Who is really choosing this? Not the parents.  Not the residents near busy highways. Not the doctors and nurses. Not  even the drivers.\n\nIt is the polluters. This dependence on fossil fuels allows Big Oil  CEOs to turn drivers upside down at the pump and shake money out of  their pockets.\n\nThe Republicans say ``all of the above.''…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691549/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…Americans from toxic air and water  pollution for decades.\n\nAnd so, far from ensuring clean land, water, and air for all, Elon  Musk and EPA are giving Donald Trump's big polluters a carte blanche to  trash the planet--no exaggeration, really. I mean, come right down to  it. Let's call it for what it is. The administration is running  roughshod over…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689118/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…change, but it  is also bad for Americans, especially through their energy bills.\n\nConsumers still pay for natural gas that is wasted, but this  resolution will let those polluters off the hook. It also hurts  American companies that are innovating new technologies enabling leak  detection and repair, creating whole new pollution reduction  industries.…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688179/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}]