[{"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…Congress has ever  considered. The top 20 percent of income earners will get at least 68  percent of the tax benefits and everyone else will see their costs  increase. The poorest Americans will be paying for tax breaks for the  richest.\n\nI'm a policymaker, mom, and education advocate, and I know that our  country does better when we treat people with…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693169/one-big-beautiful-bill-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…by Russia, China, Iran, Belarus, and  North Korea, it is real, and it is lethal.\n\nUkraine is in a historic fight now, not of her own choosing but for  her very survival. The poorest nation in Europe has fought back  mightily against the third largest military in the world after Putin's  murderous aggression that began in 2014.\n\nRussia and its spiderweb…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693693/department-of-defense-appropriations-act-2026"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "…this bill passes, 16 million people are going to lose their health  insurance. They will take away basic food assistance from millions of  veterans, seniors, and kids. The poorest 10 percent of Americans are  going to lose $1,600 per person on average while the richest only get  richer because of this bill. It is a transfer from the poor and the  middle…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693237/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…been courageously standing and fighting in the breach  between liberty and dictatorship. This has come at great cost to her  people, her prosperity, and her aspirations.\n\nThe poorest country in Europe, Ukraine is holding back Putin's  covetousness and aggression against the Continent of Europe. Ukraine  wants nothing more than to finally and permanently…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691084/liberty-versus-dictatorship"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…of foreign aid and humanitarian assistance  is going to cost us in terms of lives. It will deny people food, clean  water to drink, medicine, and the basics of life. In the poorest places  on Earth, it will cost us lives.\n\nThe original bill eliminated a program called PEPFAR. PEPFAR was  created by Republican President George W. Bush. He rallied our…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693932/rescissions"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Wisconsin border, and Carbondale, all the  way downstate, they came to see me.\n\nThese are small, critical access hospitals in rural areas, the safety  net hospitals treating the poorest patients and the large teaching  hospitals in downtown Chicago. They are all focused on Medicaid.\n\nAll of them told me the Medicaid cuts that Republicans have put on  the…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690984/medicaid"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "Mr. DeSAULNIER. Mr. Speaker, I thank the gentleman from Massachusetts  for yielding.\n\nMr. Speaker, this bill would cause household resources for the  poorest Americans to decrease while the obscenely rich will get richer.\n\nI offered two amendments in the Rules Committee, one to prevent  people with disabilities from being kicked…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693235/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…lending arm, and it is  one of the most effective tools we have to combat poverty and  instability worldwide.\n\nThe IDA offers grants and low-cost or no-cost lending to help the  poorest nations to invest in their futures, improve the lives of their  citizens, and create more prosperous communities for the long term.\n\nThe United States, as the largest donor…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693972/aligning-sec-regulations-for-the-world-banks-international-development-association-act"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…comes to  providing healthcare.\n\nDo we believe that the greatest country in the world should be able  to treat the people who need help in our country or are we OK with the  poorest among us, the weakest among us--those who are disabled, those  who are elderly, those who are children--just not having access to  care?\n\nAs the Senator said, when you look…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689544/h-con-res-14"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…from Medicaid,  Medicare, and the Affordable Care Act. These deep cuts will allow the  richest Americans to receive, on average, an additional $30,000  annually, while the poorest Americans will lose approximately $700  annually.\n\nThis legislation is a complete betrayal of the American people,  extending additional tax breaks to the wealthiest individuals…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693211/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…only by their illegality but also  by their immorality and incompetence, the three I's.\n\nWe saw the immorality as he continued to cut programs that were meant  to help our poorest and most vulnerable.\n\nSocial Security is a lifeline program for all the seniors around the  country, including the ones in the district I represent. He called it a  Ponzi…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692038/consequences-of-doge"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…Putin ought to take care  of his own country. They have got major problems. Putin should help his  own nation thrive again. He has no need for Ukraine, which is among the  poorest Nations in Europe. Look how they are fighting for liberty. It  brings tears to my eyes.\n\nPutin's plunder seeks to reconstitute the dictatorship, the  vanquished Soviet dictatorship,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690215/supporting-ukraines-independence"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…you look at Chicago's West Loop  neighborhood, you will see new lofts and condominiums, trendy  restaurants, and many people moving in. But 50 years ago, it was one of  the poorest parts of Chicago. It used to be called ``Skid Row'' and was  crowded with warehouses and boarded-up businesses. Not much of that  past is left there today, except for a few…", "date": "2025-08-01", "source_url": "https://justfacts.votesmart.org/public-statement/1694580/recognizing-50-years-of-haymarket-center"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…hurt families who  are struggling in poverty.\n\nRepublicans have succeeded in putting together a Marie Antoinette  budget, helping the richest of the rich while hurting the poorest of  the poor. Let them eat cake. That is the Republican motto.\n\nI have never seen such cruelty contained in a budget in all my years  here. This budget would force the biggest…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689864/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…most part, it happened by the year  2000, 2001. It was done. People had it. Broadband was deployed.\n\nBut what we did was we said to ourselves: We have got to take care of  the poorest kids in our country as we move rapidly on a technological  revolution. Yes, the economy is going to be absolutely exploding. In  fact, about $1.5 trillion worth of private…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690803/addressing-the-homework-gap-through-the-e-rate-program"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…residents of Nauvoo, Illinois, began leaving their homes and farms  behind, crossing the frozen Mississippi River by ferry and wagon to  escape persecution. Only the sickest and poorest remained behind, and  even they were finally forced out by mob action. All crossed Iowa to  Nebraska, just north of Omaha, their winter quarters on the Missouri  River.\n\nWhy…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694022/july-24th-utahs-state-holiday"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…By  shutting down some of the State's most popular motorized recreation  trails, the National Park Service is shutting down a main engine of  economic growth in some of the poorest, most rural counties.\n\nEarlier this year, Congress passed the first-ever bipartisan,  comprehensive recreation package aimed at growing, not restricting, our  Nation's $1.1…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690405/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…still retain very generous subsidies next year. Mr.  Speaker, 60 percent of the enrollees will still have access to a plan  at or below $50 a month.\n\nI represent one of the poorest congressional districts in the  country, and still, 99.7 percent of my constituents in my district, one  of the poorest congressional districts, will be unaffected by this…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698800/breaking-the-gridlock-act"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…causing  more returned checks and a decline in account ownership among low- income households.''\n\nMr. Speaker, I happen to know that because I have represented some of  the poorest counties in the State of Michigan in my time in Congress.  This is a valuable tool those on the lower end of the economic rung  use.\n\nAfter the November election and President…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689844/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…him.\n\nSocialism under Chavez and Maduro utterly destroyed the prosperity  and freedom of Venezuela, reducing it from one of the wealthiest  nations in the world to one of the poorest. Like all socialist regimes,  the Chavistas depend on brutal intimidation, terrorism, and violence to  maintain their grip on power. A third of the population has now fled…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698660/lessons-from-caracas"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…fellow Republicans to pass full- year funding for several critical programs. In my district, several  water and police projects will be funded, which will benefit some of  the poorest and most rural areas in this country. These projects will  help fund long-overdue water infrastructure projects and make local  improvements, ultimately driving down costs…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698639/providing-for-consideration-of-hr-saving-homeowners-from-overregulation-with-exceptional-rinsing-act-providing-for-consideration-of-hr-affordable-housing-over-mandating-efficiency-standards-act-and-providing-for-consideration-of-hr-commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…of prosperity: over 1 million new small business jobs each year, $284  billion in economic growth for more manufacturing, and billions in new  investments to revitalize our poorest neighborhoods.\n\nWe will reignite our economy with a return of policies like 100  percent immediate expensing and incentives to make sure R&D is  happening here and not being…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688028/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…issue debt in the securities markets.  Its funding came primarily from donor contributions and repayments on  past loans.\n\nAs the IDA evolves to meet the needs of the world's poorest nations,  it has entered the capital markets to expand its resources and its  impact.\n\nIt is only logical and fair that its securities receive the same  exempted status consistent…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693973/aligning-sec-regulations-for-the-world-banks-international-development-association-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…better,  and I support getting it to President Trump's desk.\n\nMr. Speaker, I urge all my colleagues to do the same.\n\nMr. SMITH of Missouri. Mr. Speaker, I represent one of the poorest  congressional districts in this country. I can tell you this piece of  legislation is for those working families, those small business owners,  and those farmers who are…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693189/one-big-beautiful-bill-act"}]