[{"senator": "Alex Padilla", "party": "Democrat", "sentence": "…cases had pending asylum cases or some other sort of  immigration protection. But simply because they may have tattoos, the  Trump administration has decided to use them for a poorly executed and  expensive publicity stunt.\n\nAs I think Senator Van Hollen began to explain to us, if Republicans  allow Donald Trump to make himself judge, jury, and executioner,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691401/motion-to-discharge-s-res-195"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…were  overrun in those areas by the farmers who were objecting to Federal  taxes. That original Insurrection Act was written at a time when police  forces were limited and poorly equipped. The Insurrection Act provided  for a Federal force when a genuine insurrection, rebellion, or armed  violence was occurring beyond the control of local or State officials,…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696297/9999"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…climate change is real and that we should  be doing something about it.\n\nAnd those of us who are advocates on this, on this side, have to be  very clear--much clearer, he said poorly and unclearly--but let me say  again--have to be much clearer about what we stand for, which is for a  transition that makes sense and that science commands and for the  respect…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688166/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…again today. I expressed my serious concerns with how this resolution  was written then, but nothing has changed.\n\nOnce again, the Republican majority has thrown together a poorly  written, ill-conceived resolution that is so sloppy that it condemns  socialism in all its forms, including democratically elected officials  and governments. That includes…", "date": "2025-11-28", "source_url": "https://justfacts.votesmart.org/public-statement/1697166/denouncing-the-horrors-of-socialism"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…Julie said: ``I do work but don't make enough money to cover all of  my expenses. It is a big misunderstanding that people on SNAP don't  have jobs. My children would eat very poorly if I didn't have SNAP. I  would have to rely on church food pantries, and they can only offer the  bare minimum. Food banks don't give basics like milk and bread.''\n\nThat is…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…What would turn out to be a mass of force by the United  States sent down in the Caribbean--there is sure to be a show of force,  maybe subject to attack even by Venezuela, poorly armed country that it  is.\n\nSo I would say that if we are thinking clearly about this, we would  think long and hard before we engaged in any conflict with Venezuela.  That…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696557/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "…find it so interesting that in real time we are having  this conversation. When we talk about Black voters, we are going to  talk about Black voters.\n\nThis bill was written so poorly it doesn't even take into  consideration women of all races who changed their names when they got  married. It is ridiculous.\n\nIt has been a Federal crime, we know, for noncitizens…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699939/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…even surprised with how many Americans--I don't think we  had a townhall where someone didn't want to stand up and tell me about  the mental health crisis in America and how poorly we were doing. So  when the Mental Health Liaison Group starts off with that, it hits me  very hard.\n\nI still remember meeting with a guy in a New Jersey diner who had  mental…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…from bank accounts,  kids' college savings from investment accounts, and retirement savings  from 401k's.\n\nIt is not too late to change course and declare Liberation Day as a  poorly constructed April Fools' joke.", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689774/congratulating-chief-keith-johnson-on-his-retirement"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…of the Whiskey Rebellion  and the Battle of Wabash--in those instances, probably not at the tip  of the tongue of most of us.\n\nThe forces of law enforcement were limited and poorly equipped. They  were barely existent. Local police. Virtually no State had its own  police. So there was a need for potential use of the military in those  instances. But even…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696181/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…currency, these bills will enable the crypto industry to       operate without effective oversight, and this will endanger       the financial health of working people.           Poorly regulated crypto assets are dangerous to pensions\n\nUnions strongly support workers having retirement benefits       and regularly negotiate for pension plans in employment…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693839/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…of the undue foreign influence, but instead of deterring the bad  actors, the bill seeks to punish the victim and, in effect, punish our  students. The bill is, therefore, poorly written, poorly  tailored, misdirected, and ultimately counterproductive and not a  targeted national security measure.\n\nSimilar to H.R. 1005 and H.R. 1049, which we considered…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697533/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}, {"senator": "Jake Auchincloss", "party": "Democrat", "sentence": "…concerns  with a provision contained within the Fiscal Year 2026 National Defense  Authorization Act, which I will vote against. This provision, though  well intentioned, is poorly drafted and shows the deficit of proper  process.\n\nReferred to as the BIOSECURE Act, Section 851 of the NDAA will only  apply to contracts subject to the Federal Acquisition…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698004/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Tina Smith", "party": "Democrat", "sentence": "…Metro Surge have been so brutal, we have gotten so  much of the attention, but this is not just a Minnesota problem.\n\nI ask you, colleagues, to consider how these dangerous and poorly  trained and unaccountable ICE agents have been treating Americans who  have been exercising their constitutional right to peacefully speak and  to demonstrate. These Americans…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699416/9999"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…toward preventing debilitating shortages.\n\nMr. Speaker, we must invest, rebuild, and protect our industrial base  from threats to innovation and competitiveness. For too long, poorly  negotiated trade deals, job outsourcing, and the decline of  unionization have hollowed out our industrial base, leaving  manufacturers and suppliers vulnerable. We have a…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690189/promoting-resilient-supply-chains-act-of-2025"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…making the same observation.\n\nYoung people going to college--kind of hard to believe, but it is  true--may decide not to get married because they get the Pell grant,  another poorly designed program, and get it to pay for either all or  part of their college.\n\nYou may say: Is this all on purpose? Did the government design these  programs to destroy the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695628/breakdown-of-traditional-families"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…cost to the United States taxpayers by  allowing for more adequate cost recovery from applicants.\n\nMr. Speaker, H.R. 1182 will better protect the public from the  dangers of poorly manufactured and mislabeled compressed gas cylinders.\n\nThis legislation will also better ensure fair competition for  American manufacturers and workers.\n\nFurther, H.R. 1182…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692179/compressed-gas-cylinder-safety-and-oversight-improvements-act-of-2025"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…in an attempt to take down  President Trump and to hurt his administration and what he is doing to  Make America Great Again.\n\nThe actions taken by Delegate Plaskett reflect poorly on the House,  and this body needs to hold her accountable.\n\nMr. Speaker, I urge all of my colleagues to vote to adopt this  resolution to show the American people that those…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696888/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…staged a riot. Officers  liberated 12 minors forced to work at this facility. Eight of them were  among the 465,000 unaccompanied alien children that the Democrats  placed with poorly or unvetted sponsors during Biden's administration.\n\nIt appears the marijuana farm was employing scores of illegal aliens  to undercut their competition, in flagrant violation…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694126/sorry-not-sorry-for-immigration-enforcement"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…own  children, or are we going to choose the harder path?\n\nAs President Reagan said in 1964, it was a time for choosing.  Frankly, we didn't actually heed his call. We chose poorly. We chose  the path of a massive, bureaucratic tyrannical State. We have empowered  government; we haven't reduced it. We have increased spending; we  haven't reduced it. We…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690594/fiscal-responsibility"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…see who is  dying of drug overdoses, it is usually single men. Those who are not  doing well education-wise are single men.\n\nOf course, the reason the single men are doing so poorly is because  of the great society programs which are designed to make those single  men worthless. This is another reason why this body ought to take up  these welfare programs.…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700071/issues-of-the-day"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…sleep, waking up the next morning,  and going to school happy and that same child asking their mom when is  the next time they will eat a meal, going to bed hungry, and doing  poorly the next day.\n\nRepublicans are working to extend the program. I want a bill to fund  SNAP, but it looks like we will not have Democratic support to pass.\n\nThere are a lot of…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696452/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…all agree  on, no matter what your party, healthcare is too expensive.\n\nI am a doctor who worked at a hospital in the public hospital system  for the working uninsured and poorly insured. And it is not just the  poor but middle-income Americans who have a really hard time right now  affording their healthcare.\n\nThere is a little bit of irony here. ObamaCare…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698998/disrupt-explicit-forged-images-and-non-consensual-edits-act-of-2025"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…probationary employees, 10 out of  nearly 500 full-time winter employees, 25 if you include early  retirements and no firefighters.\n\nThis begs some important questions: Is the park so poorly managed  that only one employee has keys to the restrooms serving the 748,000- acre national park?\n\nApparently.\n\nHow will the Sierra Nevada red fox survive with only eight…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688585/yosemite-belongs-to-the-people"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…when prior Presidents conducted military  operations in Yemen and Libya and Syria, operations which were also  limited and successful.\n\nThis resolution is also reckless and poorly written. It prevents the  President from acting against any foreign terrorist organization in the  Western Hemisphere. Under this resolution, the President could strike  al-Qaida…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698249/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Dan Newhouse", "party": "Republican", "sentence": "…of the most important issues  facing the American public, I would daresay the entire world, right  here in this Chamber. The things that happen in this Chamber that  reflect poorly on us reflect poorly on every single one of us.\n\nI would say to you, Mr. Speaker, that this is truly a wake-up call  for this Chamber. The lack of decorum has reached a new…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688496/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…effectively manage the Federal  workforce.\n\nNow, it is no secret that accountability problems in the Federal  workforce are legendary. It takes a Herculean effort to fire a poorly  performing Federal worker or one who is engaged in misconduct.\n\nCollective bargaining agreements often create procedural hurdles to  firing such employees, above and beyond…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697996/protect-americas-workforce-act"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…Saddam and Qadhafi, Maduro is unmistakably a  dictator. He  is a bad guy. He suppresses freedom of speech. He controls his people.  There is no free voting. He treats people poorly, and that is an  understatement.\n\nBut there are a lot of bad guys in the world. There are a lot of  dictators. There is a lot of socialism leading to starvation. It  doesn't…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696562/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…innocent people. When innocent  people are harmed, that is not furthering justice.\n\nWith an investigation of this size and a file that is as large as the  Epstein files and as poorly defined as that is in this petition, there  will invariably be people who are released, pursuant to this discharge  petition, who had nothing to do with criminal activity.…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696815/epstein-files-transparency-act"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…January 18 article, the Times shreds the First  Amendment and, in doing so, undermines and devalues patriotic  whistleblowers. That is an historic disgrace that will age very poorly  for these authors, their editors, and the New York Times at large.\n\nThe January 18 article also argues that my critics say these  whistleblowers won't face reprisal because…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699769/whistleblowers"}]