[{"senator": "Tim Kaine", "party": "Democrat", "sentence": "Mr. KAINE. Madam President, I can make it fast or slow.\n\nI am joining all of my colleagues to advocate for this bill.\n\nOne-third of the Virginia population is a resident of the DC metro  area and enjoys this Capital, and 150,000 Virginians come to work in DC  every day. They want DC police and services to be well funded. Please…", "date": "2025-03-14", "source_url": "https://justfacts.votesmart.org/public-statement/1688852/district-of-columbia-local-funds-act-2025"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…receiving Social Security benefits. These are people with  retirement benefits, children who have lost a parent, and people on  disability.\n\nWe now have a bigger-than-ever population of people collecting Social  Security benefits and a reduced staff.\n\nTo put this in perspective, in 2010, not that long ago, the size of  the Social Security workforce was…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689134/dont-touch-social-security"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…leadership status in the world without  investments made and attention paid to science, to science technology,  engineering, and math.\n\nIt is essential that we grow that population of scientists, of  engineers who can then provide for the muscle of our innovation  economy, to allow for that intellectual capacity of this great Nation  and the pioneer…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691396/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…Please do       everything in your power to help fund and not cut Medicaid in       any way. Thank you for your time and your commitment in       helping the more vulnerable population.\n\nI mean, Sally and Mike, you are not alone. That sandwich generation,  taking care of children and parents. You are taking care of adult  children and 90-plus-year-old parents.…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…very  identity of what makes this country America.\n\nLast week, I met with immigrants' rights advocates and toured the  Northwest Detention Center in Tacoma. The detainee population has  doubled in the last few months. The average time detained has extended.  Discretionary releases are now uncommon, even for detainees without  violent criminal records.…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690510/trump-immigration-policies"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…Affordable Care Act was passed, we were able to  lower the number of uninsured through both Medicaid expansion and the  healthcare exchanges.\n\nA majority of the Medicaid expansion population is men, over 50  percent. They are more likely, incidentally, to be White men, about 59  percent. That is compared to the 34 percent of the traditional Medicaid  population…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692205/raising-awareness-about-mens-health"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…in  financial assets in retirement funds. Only 1.4 percent of those assets  are managed by women or minority firms. Women and minorities,  represented by two-thirds of the population, they are managing 1.4  percent of the assets.\n\nNow, apparently that creates a problem, and the problem is: How did  they get the 1.4 percent? How did the good old boys lose…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699154/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…serve communities as  the bridge between the local community and FEMA--they are changed  constantly. So we have had in some of our small towns--and I am talking  towns with a population of like 300--they have one program manager  after another and over the course of a year and a half might have seven  or eight program managers. When that program manager…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693402/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…hospitals, clinics, doctors' offices, and urgent care  centers will close, leaving even those with private insurance without  access to healthcare.\n\nIn my State, one-third of the population is covered by Medicaid.  Republicans can't cut one-third of the money that goes to healthcare  and expect our healthcare system and infrastructure to stand. Hospitals  and…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690628/republican-tax-cuts"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…some of the most vulnerable in the VA's care.  Because they are often elderly or mentally ill, they are at greater  risk for financial abuse and theft of benefits than the population at  large. Unfortunately, despite the VA's best efforts at vetting proposed  fiduciaries, bad actors do arise from time to time. When that happens,  theft or misuse of benefits…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690671/veteran-fraud-reimbursement-act-of-2025"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…I rise today to address the dangerous  actions of the Health and Human Services Secretary in regard to  vaccines.\n\nVaccines play a critical role in protecting our entire population in  the United States. They are the most powerful tool we have against  serious infectious diseases. They help our immune system learn how to  fight against viruses and prevent…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695621/vaccines-protect-our-communities"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…area, Green was a  township, mostly farmland and a few businesses, and fewer than 10,000  residents. In 1992, Green was incorporated as a city.\n\nNow, 30-plus years later, its population has nearly tripled. It is  the home of more than 1,200 businesses and is the fastest growing city  in Summit County.\n\nCommunity members, elected leaders, and local businesses…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693900/single-unique-zip-codes-for-certain-communities"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…jurisdictions  collectively known as the Pacific Islands, including twelve independent  states, countries in free association and territories. Though small in  land area and population, the land plus maritime exclusive economic  zones of all these jurisdictions combined exceed the land areas of  China and Russia combined, comprising a significant part of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694767/supporting-the-partner-act"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "…That is why I launched the bipartisan Extreme Heat Caucus early this  year with Congressman Mike Lawler of New York. At one point this  summer, nearly half of the country's population was under an extreme  heat warning. From coast to coast, we are struggling to keep people  safe and to fully understand the challenges posed by extreme heat.\n\nExtreme heat…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695656/extreme-heat-caucus"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…reforms have focused on  encouraging local, evidence-based supervision for low-level youth  offenders, which has led to a significant reduction in the state-level  committed population and millions of dollars in cost savings while  protecting public safety. Juvenile arrests in Texas dropped by 27  percent between 2007 and 2011 following these changes.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695783/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "French Hill", "party": "Republican", "sentence": "…in my  district, the Little Red River, for the Sustainable Rivers Program.\n\nMr. Chair, the Little Red River has become home to a sizable and  attractive wild brown trout population. It is a regional mecca for  trout fishing in the mid-South.\n\nFor example, the Little Red River is home to the former world record  40-pound brown trout. Over 25 miles of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694859/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…to $7  spent for those who were 18 and younger. Today, that is flipped.\n\nIt is just demographics. It is not some evil plot. It is a  combination of the baby boomers, a big population bubble, and  healthcare got dramatically more expensive.\n\nLast week, I did a presentation here and basically showed where  Democrats are turning healthcare into financial…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699000/growing-the-gdp"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…President, keeping quantity and quality of  healthcare in rural America is a constant responsibility of most  Senators, because every Senator, even if you come from a high  population State, you still have a lot of rural areas.\n\nSo one of the things that I have been interested in is keeping  hospital services available in rural areas, even if they have…", "date": "2025-10-16", "source_url": "https://justfacts.votesmart.org/public-statement/1696257/rural-emergency-hospital-program"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…By screwing up all the incentives, everyone's  healthcare costs went up, even though the ACA, ObamaCare, is only this  little wedge here. It is 7 percent of the healthcare population.\n\nThe vast majority of the other population gets it through their  employer, veterans, Medicare, and Medicaid. Then I need my colleagues  to see this other wedge there. That…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697873/turning-healthcare-into-financial-engineering"}, {"senator": "Richard McCormick", "party": "Republican", "sentence": "…recommendation that timely, flexible military posturing is what  prevents war, and in this case protects Americans against the most  lethal attack ever on the American people and the population where we  have lost over 250 people per day for the last 3 years.\n\nThis is not the time to act in opposition to the Commander in Chief  and to oppose him from the most important…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698454/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "French Hill", "party": "Republican", "sentence": "…housing development;\n\n(IV) differentiations between best practices for rural,       suburban, and urban communities, and communities with       different levels of density or population distribution; and\n\n(V) streamlining of local environmental review policies;       and\n\n(xviii) other land use measures that promote access to new       housing opportunities…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "…core. She also helped  establish the Victorville Wellness Center, the first facility of its  kind in San Bernardino County, which reduced the city's unsheltered  homeless population by fifty-seven percent and now serves as a model  for other communities.\n\nIn addition to her work in public office, Debra has been deeply  involved in education and community…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696324/recognizing-the-service-of-debra-jones-on-her-retirement"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "…particular piece of land owned by the Federal Government and  might be affected by the land management policy associated with that  parcel, are very important to that local population but might be  completely unknown not only to people on the other side of the country  but even to people in other parts of that same State.\n\nThere is a fair amount of legislation…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698423/unanimous-consent-requests-the-calendar"}, {"senator": "John Thune", "party": "Republican", "sentence": "…hypoxia, including--\n\n``(A) State and local entities;\n\n``(B) Indian tribes, Tribal organizations, and Native       Hawaiians organizations;\n\n``(C) island communities;\n\n``(D) low-population rural communities;\n\n``(E) subsistence communities; and\n\n``(F) fisheries and recreation industries;''; and\n\n(I) by inserting after paragraph (10), as redesignated by…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695277/harmful-algal-bloom-and-hypoxia-research-and-control-amendments-act-of-2025"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "…was formally  chartered.\n\nIn 1925, Fruitland Park was home to just 417 residents, spread across  a modest 3-square-mile area. As of May 2025, the city has grown to  serve a population of roughly 9,015 across more than 7 square miles.\n\nToday, Fruitland Park provides a full range of municipal services,  including public safety through police and fire departments,…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693999/recognizing-the-100th-anniversary-of-the-city-of-fruitland-park-florida"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…Israel and the United States. This is from  1950, where Ben-Gurion--the first President of Israel--is talking to an  Iranian diplomat in Israel. Iran had a very vibrant Jewish population.  So it has not always been this way.\n\nSo what happened? They had a revolution. In 1979 to 1981, there was  an uprising in Iran that led to the installing of the Ayatollah…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692780/iran"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "…traveling through Polk County and believed oil fields waited to be  exploited. Mr. Van Horn was responsible for naming the town after  President James K. Polk and increasing the population with new  construction of oil rigs.\n\nToday, Polk City is home to approximately 2,000 residents and remains  a vibrant small town with a strong sense community and rural charm.…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694002/recognizing-the-100th-anniversary-of-the-city-of-polk-city-florida"}, {"senator": "James Risch", "party": "Republican", "sentence": "…proposed sale will enhance Israel's capability to meet       current and future threats by improving its ability to defend       Israel's borders, vital infrastructure, and population       centers. This proposed sale will increase the       interoperability with U.S. forces and conveys U.S. commitment       to Israel's security and armed forces modernization.…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693349/arms-sales-notification"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…and  transparency.\n\nAs the name suggests, this is focused on the entirety of the  individuals on healthcare. This isn't just targeted toward a small 7  percent of the total population that is that narrow margin in  ObamaCare. This is touching every single person, and that is the only  way to actually lower health premium costs over time.\n\nThis bill lowers…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698435/republicans-have-delivered-in-2025"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…This incentive ensures that innovators willing to take the  extraordinary risk of developing a first-in-class treatment for a  complex condition affecting a small patient population are  appropriately rewarded.\n\nFor many rare diseases, the first FDA-approved treatment is a  lifeline. These therapies often require years of research, billions in  investment,…", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691696/support-for-the-orphan-drug-act"}]