[{"senator": "Peter Welch", "party": "Democrat", "sentence": "…community standards.\n\nWhile section 230 played a central role in the growth of the internet  as we know it today, the legislation could not have anticipated the  growth and popularity of social media platforms we are now grappling  with. For nearly 30 years, social media platforms have enjoyed blanket  immunity for the content they host. They have failed…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698531/sunset-section-230-act"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…the first time.\n\nThey tried this before during Trump's first administration when he  unsuccessfully tried to repeal the Affordable Care Act and cut  Medicaid, despite its popularity across the Nation, across the  political aisle. He was going after something that wasn't left or  right, that Americans were saying in the course of conviction that this…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…accidents in communities across  the Nation, yet there is no mandatory Federal standard to ensure  lithium-ion batteries are safe.\n\nAs electric bikes and scooters grow in popularity, we must ensure  that the CPSC adopts a strong Federal safety standard for lithium-ion  batteries. Consumers deserve to know that the products they buy are  thoroughly tested…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690260/setting-consumer-standards-for-lithium-ion-batteries-act"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…tenure  in Congress and say that when we had the opportunity--or I had the  opportunity--to take a stand for justice even when it might cost me a  career, cause me a lack of popularity, cause me a lack of safety. I  want people to know that I took the stand that could make a difference.\n\nMadam Speaker, I want my friends to know that I appreciate all of…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691346/proud-to-be-an-unbought-unbossed-liberated-democrat"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…Employment, or VR&E program, is perhaps the greatest resource disabled  veterans have to seek a new career path, but veterans are dealing with  historic wait times due to program popularity and expanded eligibility  under the PACT Act.\n\nI respectfully disagree with how the chairman has framed the VR&E  program and its shortcomings, but let me just proceed to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695411/focused-assistance-and-skills-training-for-veterans-employment-and-transition-success-act"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…consistently recognized as one of Virginia's  premier festivals, earning repeated distinction as ``Best of Virginia  Festivals'' by Virginia Living Magazine. Its enduring popularity and  acclaim reflect the dedication of the organizers and the appreciation  of the participants.\n\nI wish to recognize and extend my deep appreciation to Pat Miller,  the…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696005/recognizing-30-years-of-art-on-the-avenue"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…or deluded citizens (who devote themselves to the  favorite nation) facility to betray or sacrifice the interests of their  own country without odium, sometimes even with popularity, gilding with  the appearances of a virtuous sense of obligation, a commendable  deference for public opinion, or a laudable zeal for public good, the  base or foolish compliances…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700163/reading-of-washingtons-farewell-address"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…this unpopular  amendment. It was brutally defeated last year, and it was crushed the  year before, both times with bipartisan support.\n\nThe Endangered Species Act has wide popularity, but our current  biodiversity outlook has really worsened. Our scientific community  continues to scream from the rooftops that biodiversity shrinking is a  danger to humanity.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695233/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…or deluded citizens (who devote  themselves to the favorite nation) facility to betray or sacrifice the  interests of their own country without odium, sometimes even with  popularity; gilding with the appearances of a virtuous sense of  obligation a commendable deference for public opinion, or a laudable  zeal for public good, the base or foolish compliances…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700271/president-washingtons-farewell-address"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…running Social Security's complex benefit and       information technology systems. Others have left in disgust.\n\nThe moves have upended an agency that, despite the       popularity of its programs, has been underfunded for years,       faces potential insolvency in a decade and has been led by       four commissioners in five months--just one of them…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689130/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "…the town grew, so too did its reputation as a destination for  recreation and hospitality. The adjacent Floridian Country Club and  golf course capitalized on the growing popularity of the sport and were  later revitalized by the Beucher family, who transformed the property  into the acclaimed Mission Resort & Club. In 2022, the Beucher family  passed…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694139/recognizing-the-100th-anniversary-of-the-town-of-howey-in-the-hills-florida"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…the State.\n\nThe trauma conference came from humble beginnings. The first  conference was hosted in a basement room. Throughout the years, the  conference grew in size and popularity as a respected source of  education and information.\n\nOver the years, the Office of Emergency Medical Services and the  Wyoming Emergency Medical Services Association have…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694419/50th-anniversary-of-the-wyoming-trauma-and-emergency-medical-services-conference"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…the Greater Philadelphia  area. After obtaining her United States Citizenship, Jenya fulfilled  her dream through opening her very own small business. Today, Beauty  Mood's popularity and success makes a difference in the lives of many  Bucks County individuals--an area I proudly serve and represent.\n\nUltimately, Jenya Rahazhynskaya's story serves as a…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691903/recognizing-beauty-moods-one-year-anniversary"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…Chinese Communist Party. By 1999, Mr. Speaker, an estimated 70  million to 100 million people, roughly 5 to 7 percent of China's  population, were practicing Falun Gong.\n\nThis popularity triggered a brutal response from the CCP, unleashing  a campaign of illegal detentions, forced labor, torture, and most  horrifically, forced organ harvesting, a practice…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690647/falun-gong-protection-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…bettering our community is unwavering, and to  mark this milestone, the club has launched a project to construct new,  modern facilities at Shawmut Park.\n\nWith the growing popularity of Fall Fest and other local events, the  current facilities can no longer meet community needs. This upgrade  will improve accessibility and enhance the park experience…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690205/recognizing-st-marys-rotary-clubs-75th-anniversary"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…highlights Wyoming's Western heritage.  In 1834, William Sublette and Robert Campbell established Fort William,  a trading post for fur traders. As the settlement grew in popularity,  it expanded and attracted other travelers, including emigrants,  missionaries, and homesteaders.\n\nFrom 1841 to 1890, the area served as an important military outpost.…", "date": "2025-07-31", "source_url": "https://justfacts.votesmart.org/public-statement/1694485/100th-anniversary-of-fort-laramie-wyoming"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…interacted with someone who has been removed from the platform for  fraudulent activity.\n\nOnline dating platforms have been around for over 30 years, and they  continue to grow in popularity. While they can help people connect,  their accessibility and digital format have also created new risks,  unfortunately.\n\nThe FTC, the Federal Trade Commission, reported…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692730/romance-scam-prevention-act"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…Worth Metroplex. Throughout his  career, he has earned widespread respect for his openness,  transparency, and steadfast dedication to doing what is right,  regardless of popularity.\n\nIt is my honor to recognize James Branch for his integrity, his  decades of service, and his enduring commitment to strengthening the  Royse City and Rockwall County communities.", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698298/recognizing-the-success-of-james-branch"}]