[{"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…and outside countries--the UAE, Turkey, Iran, as well as  Russia and China--continue to send weapons to the factions. Why? Well,  because Russia doesn't want to give up its port access to the Red Sea,  China doesn't want to abandon the nearly $6 billion of investments it  has made in Sudan since 2005, and the UAE doesn't want to abandon  Sudan's wartime…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690103/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…northern Ohio--Ohio is known as the  State of flight, and 58 of these brave aviators called Ohio home, with  several hailing from the great Toledo area and Harold himself from Port  Clinton and points east.\n\nTheir contributions to our Armed Forces and to our communities remain  an indelible part of our history. Institutions such as the Toledo-Lucas  County…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687895/black-history-month"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…easternmost portion of the Erie Canal. This is a bold vision that  connected a great ocean, the Atlantic, with the Great Lakes. It allowed  for not only the strengthening of the port of a small place called New  York--New York City--but gave birth to a necklace of communities dubbed  ``mill towns'' that became the epicenter of invention and innovation.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695601/devastating-harm-caused-by-trump-administration"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "…401(k)'s, pensions, and kids'  college funds have all taken a huge hit.\n\nTrump's reckless trade war has only begun to squeeze the American  people. Imports at the San Pedro Bay port complex in my district are  expected to plunge in May. That means empty shelves at our stores in a  few weeks and further price spikes as shortages hit.\n\nExports at the port…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690420/put-hardworking-american-families-first"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…and Karen Edmonson;\n\nIn Williamsbridge, Laura Rhodan and Shirley Fearon;\n\nIn Mt. Vernon, Kathie Brewington and A.J. Woodson;\n\nIn White Plains-Greenburgh, Janice Griffiths;\n\nIn Port Chester-Rye, James Henderson III.\n\nI also recognize other leaders such as Minister Mark McLean, Reverend  Frank Coleman, and Reverend Margaret Fountain-Coleman.\n\nTheir hard…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693011/recognizing-local-naacp-leaders"}, {"senator": "Marilyn Strickland", "party": "Democrat", "sentence": "…remained a member  until he died.\n\nIn 1934, Mr. Tanner was the only Black member of the Tacoma strike  committee during the big strike that shut down every single Pacific  Coast port. Mr. Tanner worked closely with San Francisco leader, Harry  Bridges, to keep Black and White workers united during the strike so  employers could not break the union.\n\nHe was…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688111/ill-conceived-budget-resolution"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…President knows that behavioral  health--very tough challenge, particularly with the fentanyl epidemic  in our country.\n\nI met with representatives of Peninsula Behavioral Health in Port  Angeles, WA, and Sound Health in King County, who told me that clinics  are already operating on narrow margins and have already sustained a 1- percent budget cut this year…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692972/one-big-beautiful-bill"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…projects not only modernized critical assets, but  reshaped how New Yorkers move, work, and connect across the region.\n\nIn 2017, Mr. Cotton was appointed Executive Director of the Port  Authority of New York and New Jersey. Under his leadership, the agency  confronted some of the region's most complex infrastructure challenges  and undertook one of the most…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699560/recognizing-rick-cotton-for-a-lifetime-of-leadership"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…Mobile Bay, which is in the heart of my  district, is essential to Alabama's environment, flood protection, and  seafaring economy as well. Mobile Bay is now home to the deepest port  in the Gulf, so protecting its surrounding estuaries is critical not  just to our local economy but to our regional and national economy as  well.\n\nI will take a moment to…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698177/enhancing-science-treatment-and-upkeep-of-americas-resilient-and-important-estuarine-systems-act"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…patients and trauma  victims, community blood centers provide patients with the blood that  keeps them alive. This month and always, I thank them.             Saluting the Work of Port Chester Historical Society\n\nMr. LATIMER. Mr. Speaker, I rise to salute the work of those who are  leaders and members of the Port Chester Historical Society. Their  volunteer…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698776/recognizing-national-blood-donor-month"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…the Treasury of the United States of America, the  same place that your tax dollars will go, into the Treasury of the  United States of America. The tariff is collected at the port of entry.  Let's say $4,000 on a $40,000 item--it is a 10 percent tariff--and when  it is collected, it goes again, important to remember, into the  Treasury.\n\nNow, that person…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690093/protecting-the-american-dream"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…China makes a loan to Sri Lanka, that they know  Sri Lanka is not going to be able to pay for that project. They put in  there: Oh, if you don't pay, we get to control your port. Sri Lanka  should be encouraged: Don't give your port to China. Give your middle  finger to China, and you will able to borrow from American banks and  European banks and international…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688265/problems-caused-by-doge-cuts"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…silence from  our Commander in Chief and Navy leadership to publicly thank Denmark  for its act of friendship on Saturday.\n\nAs the Representative of the USS Delaware's home port and ranking  member of the Seapower and Projection Forces Subcommittee, I will  publicly tell the people of that nation that  your caring response to one of our sea servicemembers…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700095/thanking-the-people-of-denmark-and-greenland"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…fleet. Our economy depends on it.\n\nMARAD supports 13 public and 50 commercial ports across the Great  Lakes and the St. Lawrence Seaway.\n\nIn my district in northwestern Ohio, the Port of Toledo and Sandusky  Harbor connect us to global markets for energy, metal, farm  commodities, and more.\n\nIn 2024, South Bass Island and the Put-in-Bay Port Authority received…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698300/in-support-of-marad"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…plan.  That is an annual insurance bill of $24,000 without even having to go  to the doctor for a medical emergency or routine healthcare.\n\nI recently heard from a neighbor in Port Townsend who said: ``My  husband is retiring in a few weeks.'' She retired years ago. ``So  although we currently have a good benefits package through his work, we  will be…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697420/republican-healthcare-crisis"}, {"senator": "Jake Ellzey", "party": "Republican", "sentence": "…command was ready for  any mission at any moment or any call to action.\n\nOn September 8, 2001, the USS Enterprise departed the Arabian Gulf,  bound for home with a scheduled port call in South Africa for the first  time in about 40 years. Just days later, while still south of the  Arabian Peninsula, those aboard the USS Enterprise watched in horror as…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691519/truth-telling-with-math-and-facts"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize and celebrate  the 100th Anniversary of the City of Port Richey, Florida. Founded by  Aaron Richey in 1883 and officially incorporated in 1925 along the  beautiful shores of the Pithlachascotee River--known locally as the  Cotee River--Port…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691599/recognizing-100th-anniversary-of-the-city-of-port-richey-fl"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…entire world.\n\nGeorgia Ports authority operates the national gateway ports of  Savannah and Brunswick, allowing customers to compete and succeed in  global markets.\n\nThe Savannah Port is one of the most connected ports in the United  States with over thirty-five ships, forty-two double stack trains, and  sixteen thousand trucks moving in and out every week.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694778/georgia-ports-authority"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "Mr. EZELL. Mr. Speaker, I move to suspend the rules and pass the bill  (H.R. 2390) to amend title 46, United States Code, to clarify that port  infrastructure development program funds may be used to replace Chinese  port crane hardware or software, and for other purposes.\n\nThe Clerk read the title of the bill.\n\nThe…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692200/maritime-supply-chain-security-act"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…the United States of America in Congress assembled,       SECTION 1. SHORT TITLE.\n\nThis Act may be cited as the ``Transitioning Retiring And       New Service Members to Port Ocean Rail and Truck Jobs Act''       or the ``TRANSPORT Jobs Act''.       SEC. 2. VETERAN TO SUPPLY CHAIN EMPLOYEE ACTION PLAN.\n\n(a) In General.--Not later than 30 days after…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695018/transitioning-retiring-and-new-service-members-to-port-ocean-rail-and-truck-jobs-act"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…and  economic elites in Haiti who have fueled the country's ongoing gang  crisis.\n\nThis is not just about Haiti. It is about protecting U.S. national  security. The chaos in Port-au-Prince is creating regional instability.  Haitians are fleeing the island, using criminal networks to traffic  them and others to our southern border. These actors threaten…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694815/haiti-criminal-collusion-transparency-act-of-2025"}, {"senator": "David Rouzer", "party": "Republican", "sentence": "Mr. ROUZER. Mr. Speaker, I thank the gentleman for yielding.\n\nMr. Speaker, H.R. 2390, the Maritime Supply Chain Security Act, takes  a critical step toward strengthening our port infrastructure and  national security by expanding the eligible use of the port  infrastructure development program to include the replacement of  Chinese port hardware and…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692198/maritime-supply-chain-security-act"}, {"senator": "Michael Cloud", "party": "Republican", "sentence": "…exports the highest amount of crude oil in the  country and is one of the top exporters of LNG to our allies and  friends around the world, being the number one energy export port in  the world.\n\nWater is going to be a major issue as we continue to go forward and  develop. There is language in here that points to desalination projects  to help receive…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694857/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…carjacked, murdered.\n\nAnd what we know is this: Memphis, TN, is a historic city. It has a  very rich cultural history. And it is also the logistics hub of our  Nation. We have the Port of Memphis; we have FedEx; we have I-40 that  goes from the east coast to the west coast that runs right through  Memphis; and we are also home to all five class A railroads.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695666/cloture-motion"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…as a teacher, she has dedicated her retirement years  to volunteering and substitute teaching in local schools. Additionally,  Kathy has been actively involved with the New Port Richey VA Center,  offering her time weekly to support veterans. She also volunteers with  the Salvation Army of Pasco County's Domestic Violence Program each  week, helping…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691195/recognizing-kathy-logue"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…following:\n\n``(5) The Secretary may provide that domestic non-export       grain loaded or unloaded into or out of a rail car, barge,       truck, or other container, at an export port location, shall       be inspected in the manner provided in this subsection or       subsection (f), as the Secretary determines will best meet       the objectives of this…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695054/united-states-grain-standards-reauthorization-act-of-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…meaningful  opportunities and provide vital resources to support and uplift the  youth we serve. Driven by a bold vision, Victoria imagined a large- scale annual event in New Port Richey--one that would not only generate  funds for the RAP House but also raise community awareness and  engagement with YFA's mission. Despite having no prior experience in…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692476/recognizing-victoria-barley"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Watch Program. As the Coast Guard's homeland and  national security responsibilities continue to expand, the men and  women of the Auxiliary have stepped up to increase their port security  patrols to provide for the defense of our Nation's and in our case  Florida's coastline and waterways.\n\nLast year, the Flotilla 11-1 members volunteered more than…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690718/recognizing-coast-guard-auxiliary-clearwater-flotilla-11-1s-75th-anniversary"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…program. As an officer, Capt. Hammond initially served as a Gold Bar  Recruiter before being selected as the Assistant Flight Commander for  Air Freight at the 436th Aerial Port Squadron at Dover Air Force Base.  In this role, he led 226 military and civilian personnel to ensure  efficient flight operations at the Department of Defense's largest  aerial…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690077/recognizing-the-military-service-of-nathan-l-hammond"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…embody the Girl Scout Law to truly make the world a  better place.\n\nKrysta's project, ``BAT-vocate: Appreciation and Awareness for  Bats,'' in partnership with The City of North Port, North Port School  District, The Environmental Conservancy of North Port, Peace River  Wildlife Center, Girl Scouts of Gulf Coast Florida, was an excellent  endeavor to address…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690422/recognizing-krysta-fowler-gold-award"}]