[{"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…without recourse, and the promise of a  free and appropriate public education will be broken.''\n\nThese are challenging enough times for students, families, and  schools. In Portland, the public school district recently redirected an  additional $25 million from their general fund to fill the gap to help  provide students with disabilities the resources…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698934/protecting-education-for-children-with-disabilities"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…should be a time of  excitement, a time when families pick out backpacks, meet teachers, and  look ahead to a year of learning and growth.\n\nHowever, for the Merlos family, a Portland family, homeowners,  businessowners, and vital members of our community, this school year  begins in fear and heartbreak.\n\nJackie Merlos and her four U.S. citizen children…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694771/toward-a-more-dignified-and-just-immigration-system"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…Here is what it is about: If they will do this to a  sitting U.S. Senator in front of a room full of media, imagine what is  being done to powerless people in secret.\n\nIn Portland, in my hometown, we have had firsthand experience with  this kind of activity--faceless, unidentifiable agents with guns  staring down peaceful protesters. In Portland, it…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692429/alex-padilla"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…that I am delivering on that  commitment. I secured over $6 million in Community Project Funding for  seven transformative community-led initiatives across the district in  Portland, Gresham, Sandy, and Multnomah County.\n\nThese investments will help prevent youth violence, modernize  emergency response systems, strengthen wastewater infrastructure,  expand…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698771/delivering-on-commitments-to-oregons-third-congressional-district"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…here at home or  abroad. He has deployed the National Guard to the District of Columbia,  Los Angeles, Memphis, and Chicago and has attempted to deploy the  National Guard to Portland. These deployments are a flagrant violation  of U.S. law, including the Posse Comitatus Act, as noted in recent  court decisions. Not only have these deployments created chaos…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698254/nominations"}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "…U.S.  servicemembers and as motivated by mission and doing the right thing  and making moral and ethical choices. And that is all at risk.\n\nIn Senator Merkley's State, in Portland, they are sending armed  uniformed soldiers to do what we traditionally feel is police work-- intimidating the population, using tear gas against U.S. citizens for  no reason.…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696346/trump-administration"}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "…is a need to deploy troops into our cities against local  officials' wishes--first to L.A., then DC. And he isn't stopping there.  He is also attempting to deploy troops to Portland, though a Federal  judge he appointed blocked his efforts there twice because, in his own  hand-picked appointee's words, Trump's claims about why they are needed  were ``untethered…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696180/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…want to face reality. Because of the  vigilance of women, I am standing here today in the Senate.\n\nNow, further, on this point, as my colleague knows, during the  protests in Portland this past weekend, Federal agents dragged a 4- foot-6 blind man named Quinn across a driveway and detained him for  over an hour. Apparently, they thought he didn't move out…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696341/trump-administration"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…million American women. That isn't just a  number; it is personal. It is the working mom in Sandy who can't afford  to take time off work to go get paperwork. It is the woman in Portland  whose name no longer matches her birth certificate and doesn't have  $160 for a passport.\n\nIn the year 2025, I cannot believe I have to come to the House floor  to argue…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690040/voter-suppression-bill-cloaked-in-lies-about-election-integrity"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…their favorite uniforms from  the 1930s and 1940s.\n\nDHS is now building databases of Americans, detaining and even  disappearing people off of corners in Minneapolis, Chicago, Portland,  Nashville, Los Angeles, and far too many communities across the Nation.\n\nThe Trump administration demanded that Republicans deliver a $170  billion taxpayer-funded slush…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699422/9999"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "Ms. BYNUM. Mr. Speaker, today I am here to stand up for Oregon. Just  before the weekend, the President spouted off some nonsense about  deploying the National Guard to Portland. As we have seen in D.C.,  L.A., and now Boston, it is an unwelcome occupation.\n\nThe President is wasting our troops' time and the country's money to  play cops and robbers…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695015/national-guard-in-portland"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…our communities.\n\nTrump promises safety, but he delivers chaos. Cruelty is not law  enforcement. It is intimidation, and the harm goes beyond our immigrant  families.\n\nIn Portland, an elementary school had to relocate students because  chemical agents deployed by Federal immigration officials drifted onto  their campus. Low-income seniors were told…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697452/fighting-dhs-immigration-raids"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…to send some from Texas. That could still be  possible. I just hope all are well-trained, and that it is a redline  that you never attack a peaceful protester.\n\nSo far, the Portland protesters decided to engage in joy and whimsy.  They have just frustrated the hell of the Trump team because they want  riots. No, there is the ``pastries and pajamas'' team,…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…and a critical care physician, caring for people who are  on life support in our intensive care units.\n\nMs. DEXTER. It is Oregon's Third Congressional District, which is  Portland to the beautiful mountain, Mount Hood, which is emblematic of  our State.", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688236/democratic-proposals"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "Ms. DEXTER. Mr. Speaker, today, I rise as Federal agents once again  descend upon Portland, not to protect, but to terrorize.\n\nOver the weekend, during a peaceful labor-led protest, DHS agents  deployed tear gas on civilians, including children in the crowd. DHS,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699722/dhs-excessive-use-of-force"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…CRANK. Mr. Speaker, my colleagues on the other side of the aisle  have a choice to make.\n\nThey thought it was cute to defund the police. That didn't work out  for  cities like Portland, Seattle, and St. Louis.\n\nThen they thought it was cute to ignore our border. They allowed  millions to storm America. Many were sex traffickers, drug runners,  child predators,…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692194/los-angeles-protests"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…Bautista, Base Aviation Manager, Fixed Wing Pilot,       EagleMed, Dodge City, Kansas; Chris Crawford, Paramedic,       Field Training Officer, American Medical Response, Portland,       Oregon; Nathanael Day, Flight Nurse, Paramedic, EagleMed,       Dodge City, Kansas; Rudy Drago, Dispatch Lead, AMR River       Medical, Lake Havasu City, Arizona; Aaron…", "date": "2025-11-04", "source_url": "https://justfacts.votesmart.org/public-statement/1696510/recognizing-the-global-medical-response-2025-stars-of-life-award-recipients"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…lumber, boots, shoes,  and barrel staves.\n\nAs the town grew, so did trade and tourism. The Cumberland and Oxford  Canal opened in 1832, tying together the Sebago Lake and Portland  economies. Later, in the 1870s, the Portland and Ogdensburg Railroad  expanded the town's hospitality industry and encouraged steamboats to  bring visitors to Sebago. What…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699146/town-of-sebago-200th-anniversary"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…record.\n\nHe then clerked for Judge Paul Kelly of the U.S. Court of Appeals for  the Tenth Circuit.\n\nIn 2009, Josh joined the very well respected law firm Pierce Atwood  in Portland, ME. During his 16 years at the firm, he has specialized in  complex civil litigation matters and currently serves as cochair of the  firm's appellate team.\n\nJosh is admitted…", "date": "2025-10-30", "source_url": "https://justfacts.votesmart.org/public-statement/1696490/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…healthcare industry.\n\nHis educational background, including a bachelor of science in  chemistry and biology from West Texas A&M University and an MBA from  the University of Portland, has shaped his strategic leadership.\n\nSince joining PCCA in 2000, Mr. Smith has played a crucial role in  the organization's growth, serving as president, chief operating…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690331/recognizing-david-sparks-for-contributions-to-pharmaceutical-industry"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…balance of my time.\n\nMr. Speaker, H.R. 1534 is commonsense legislation that passed  unanimously last Congress. It has the support of major industry  associations, including the Portland Cement Association, the National  Asphalt Pavement Association, and the National Ready Mixed Concrete  Association. It also has the endorsement of those groups affected by…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688938/innovative-mitigation-partnerships-for-asphalt-and-concrete-technologies-act"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…life of Roger  Reed, a man whose legacy is defined not only by his distinguished legal  career but his deep love of family, history, faith, and Cougar  football.\n\nBorn in Portland in 1939 and raised in Wenatchee and Spokane, Roger  was a lifelong learner with a passion for the law.\n\nAfter graduating from Washington State University and earning his law…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695071/operation-rolling-thunder"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…politic  today. I think that phrase is actually far too generous.\n\nThese radicals on the streets of Minneapolis and their comrades in  cities like Los Angeles, Chicago, and Portland are not driven by  ``empathy'' in any meaningful sense of the term. These are not  bleeding-heart humanitarians paralyzed by an overwhelming concern for  the welfare of mankind--quite…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699689/immigration"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "…Word by accepting an interim position in Sioux Falls, South       Dakota.\n\nAfter Fran's death in 2002, Jim continued with interim       preaching at Wahpeton, Fargo, Portland, Grand Forks, Valley       City, Horace, and Enderlin, all in North Dakota. In addition       to serving his parishes, Jim authored 15 books, which include       sermon series,…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696152/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…two illegal aliens suspected of being members of the  Venezuelan gang Tren de Aragua were charged with allegedly weaponizing  their vehicle against a Border Patrol agent in Portland. Both suspects  originally crossed the southern border under Biden and were released  into the interior. The driver wound up with a rap sheet, including DUI,  while the passenger…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…million cut;\n\nMinneapolis, $8 million;\n\nNew York City, $1 billion cut that summer;\n\nNorman, Oklahoma, $865,000;\n\nOklahoma City, $5.5 million;\n\nPhiladelphia, $33 million;\n\nPortland, Oregon, $16 million;\n\nSalt Lake City, $5.3 million;\n\nSan Francisco, $120 million;\n\nSeattle, Washington, $69 million;\n\nWashington, D.C., $15 million--we know about the crime…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691031/expressing-support-for-local-law-enforcement-officers"}]