[{"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…have earned her deep respect  and admiration from those who know her.\n\nAs a faithful 73-year member of First African Baptist Church, Mrs.  Booker has held numerous leadership positions, including Deaconess,  Trustee, and Finance Committee Member, where she has demonstrated her  commitment to spiritual growth and community service. Her involvement  in various…", "date": "2025-08-26", "source_url": "https://justfacts.votesmart.org/public-statement/1694759/recognizing-mrs-juanita-carson-booker"}, {"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…health center in my district is feeling the  impact of the healthcare cuts. In 2025, they saw significant cuts in  their Ryan White part B funding.\n\nDue to these cuts, some positions had to be eliminated and workflows  realigned, including the loss of medical case management and treatment  adherence support.\n\nThe impacts are real. For instance, a 29-year-old…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698664/protecting-healthcare-for-millions-of-americans"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…CFA has review authority for the design of  private buildings in the part of Georgetown referred to as ``Old  Georgetown'' in the act.\n\nResidency requirements for government positions are found in federal,  state and D.C. law, including for members of the National Capital  Planning Commission. The primary reason such laws exist is so that  government officials…", "date": "2025-08-12", "source_url": "https://justfacts.votesmart.org/public-statement/1694733/introduction-of-the-commission-of-fine-arts-district-of-columbia-residency-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…generative AI  can swap someone's face onto another person's body, remove that  person's clothing so they appear nude, or undress someone to show them  in lingerie or other exposed positions.\n\nRecent reporting details how users of X, the social media platform  formerly known as Twitter, can ask its AI chatbot Grok to undress women  and underage girls in photos.…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698999/disrupt-explicit-forged-images-and-non-consensual-edits-act-of-2025"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…critical leadership  vacancies?\n\nMembers have been fired at the FAA, and others have quit out of just  disgust. Well, there are a lot of vacancies, especially in the higher  positions. We need to fill them. What is the plan?\n\nOther airports across the Nation could see similar problems like  Newark if the FAA does not take this investigation seriously.", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690645/faa"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…consider Mike Missal's replacement, a woman named Cheryl  Mason, who, unfortunately, is one of the most partisan and least  independent of the nominees for inspector general positions that we  have seen in recent years.\n\nWe need now, more than ever, independent oversight in the VA. And so  to my friends, to veterans of America who may be wondering why…", "date": "2025-07-31", "source_url": "https://justfacts.votesmart.org/public-statement/1694542/9999"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…administration's artificial barriers on who can lead and who can  serve are disrespectful and irresponsible. Firing and pushing aside  decorated female leaders who earned their positions diminishes military  readiness and devalues the standards and integrity of the very military  itself.\n\nWomen in our military are not insignificant or inconsequential. We…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692563/women-in-the-military"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…or President. They are career civil servants devoted to  serving Americans and answering to the Constitution. And they are being  abruptly and illegally fired from critical positions across the  government.\n\nToday, I will share the stories of four Federal employees with ties  to Illinois who have been terminated in the President's DOGE rampage.\n\nOne of…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688591/recognizing-federal-employees"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…many of you saw it, as well--Members of the  Cabinet, persons meeting with the President in the Oval Office. I never  thought I would see persons holding such high and lofty positions  pledging fealty not to the Presidency as much as to sycophancy--fealty.  It was just unbelievable. The only time I saw anything similar to this  was when I was in Communist…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690560/a-message-to-the-cabinet"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…votes  and undermining free and fair elections.\n\nAnd since that very first day in office, President Trump and his  administration have been praising and hiring into leadership positions  the very people who attempted to subvert our democracy. In fact, just  this past month, the White House reportedly hired Kurt Olsen, a lawyer  who attempted to overturn…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696440/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Susie Lee", "party": "Democrat", "sentence": "…Kotulich on  her retirement from the U.S. Army Reserve.\n\nMajor General Kotulich's 35-year career has been characterized by  exceptionally meritorious service while serving in positions of  increasing responsibility and culminating as the Deputy Chief of Army  Reserve. A native of New Jersey and West Point graduate, Major General  Kotulich's distinguished…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692707/recognizing-deputy-chief-of-army-reserve-major-general-deborah-deb-kotulich-on-her-retirement-from-the-us-army-reserve"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…employees--our young workforce, starting out on jobs, our  VA future, and some of them dedicated multiyear employees who have just  been promoted and, therefore, are in those new positions on a  probationary basis. They have been promoted because they were good at  their jobs and dedicated and hard-working, and they have been fired.\n\nThat is why I have proposed…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690353/9999"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…local, district, state, and national levels,  including serving as Department President of Ohio in 2015; and\n\nWhereas, Madam President has held numerous distinguished national  positions, including National Historian, National Hospital Chair,  National Honors and Awards Chair, and Vice President at all levels, as  well as two terms as National Sergeant of…", "date": "2025-04-17", "source_url": "https://justfacts.votesmart.org/public-statement/1690126/proclamation-for-national-amvets-auxiliary-president-cindy-rice"}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "…lessons of the murder       of George Floyd by police officers: officers with a pattern       of misconduct must be removed from employment, not simply       cycled back into positions of authority and control.\n\nH.R. 2096 Will Reinstate the 8 Year Arbitration Process       That Pays Dangerous Police Officers $374,000 on Average in       Backpay and Costs…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692304/protecting-our-nations-capital-emergency-act"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…at least 10 hurricanes this  year.\n\nAfter firing hundreds of weather experts and saying they wanted to  traumatize the rest, NOAA is now scrambling to refill those empty  positions. They also cancelled critical storm damage reports this year.\n\nIt just seems like we are not prepared right now for hurricane season  and other major natural disasters.…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692184/concerns-about-hurricane-season"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…resources to assist manufacturers in meeting our strategic goals, while  ensuring the concrete supply that supports our economy continues to  grow and thrive.\n\nThe IMPACT Act positions our country to rise to that challenge and  become a resource for the entire world.\n\nI thank Science, Space, and Technology Committee members, Mr. Miller  and Mrs. Foushee,…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688938/innovative-mitigation-partnerships-for-asphalt-and-concrete-technologies-act"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…distinguished American  patriot and aviator who served as a U.S. Navy pilot in Vietnam. After  enduring nearly six years as a prisoner of war, Capt. Carey served in  key leadership positions in the Navy and became a passionate  motivational speaker and author.\n\nI have requested the United States flag be flown over our Nation's  Capitol to commemorate and honor…", "date": "2025-03-18", "source_url": "https://justfacts.votesmart.org/public-statement/1688919/recognizing-the-service-of-our-vietnam-veterans"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…began as a brief visit to his  alma mater evolved into a lifelong career of service. Starting as an  admissions representative in 1984, he advanced through various  leadership positions before being selected as President in 2004 at age  42, making him the youngest president in the school's history.\n\nDuring Collins' tenure at Loras College, the institution…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694164/congratulating-loras-college-president-james-collins-on-his-retirement"}, {"senator": "Barry Moore", "party": "Republican", "sentence": "…Madam Speaker, we as a Nation are facing one of the greatest crises  of our time: Child abuse disguised as medical intervention. Children  are being coerced by adults in positions of authority into life- altering and medically questionable gender transition procedures  without a full understanding of the meaning or that impact.\n\nDemocrats have embraced…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698346/protect-childrens-innocence-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…direct fire modes, an       advanced tandem warhead and imaging infrared seeker, target       lock-on before launch, and soft launch from enclosures or       covered fighting positions. The Javelin missile also has a       minimum smoke motor thus decreasing the likelihood of its       detection on the battlefield.\n\n3. The Javelin Weapon System is comprised…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692048/arms-sales-notification"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…just a fact of  life that we must understand.\n\nI can imagine that there are Members who want to see more within  these measures, and there are some who want to see less. Both positions  are to be expected, but here is the bottom line: We should never let  the perfect be the enemy of the good.\n\nThe two appropriations measures under consideration here today,…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699311/providing-for-consideration-of-hr-consolidated-appropriations-act-and-providing-for-consideration-of-hr-department-of-homeland-security-appropriations-act-and-for-other-purposes"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Mayflower Hotel in Washington, D.C. She acted in Hollywood where she  would go on to meet future President Reagan when she was in Hollywood  in that Golden Age. She held many positions in the Reagan  administration in the 1980s, and she stood strong against the Soviet  Union and Soviet aggression around the globe. She was truly one of the  last cold warriors,…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690594/fiscal-responsibility"}, {"senator": "John Carter", "party": "Republican", "sentence": "…selfless service and true leadership.\n\nFrom 1972 to 2003, COL Patterson had an extraordinary 31-year career  serving our Nation in the U.S. Army, holding numerous leadership  positions across every level. As Chief of Staff for the 49th Armored  Division, he played a pivotal role in preparing the unit for deployment  in support of peacekeeping operations…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689317/saluting-the-service-of-colonel-garry-patterson"}, {"senator": "Dan Newhouse", "party": "Republican", "sentence": "…important work done by  the Federal Emergency Management Agency. This bill increases FEMA grant  programs by 5 percent above their previous levels and restores critical  staffing positions lost under the fiscal year 2025 continuing  resolution. It also delivers funds directly to communities across the  country, including my own Yakima County, to establish a…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699356/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "…the Energy and Natural Resources Committee, I have  consistently stated that bills within the committee's jurisdiction  should proceed through regular order. That process positions bills for  successful consideration on the floor, consideration by the House, and,  ultimately, enactment into law.\n\nSkipping that process allows a bill to jump ahead of…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698296/9999"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…Paul International  Airport. He also played a pivotal role as a primary field leader for  Super Bowl LII.\n\nFrom assistant Federal security director roles to active director  positions, Dave has consistently delivered strong leadership and  results wherever he was placed. Notably, in the early days of TSA, Dave  helped federalize six airports while serving…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698763/recognizing-david-mcmahon"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "…Sheriff Randy Retter, who dedicated 37 years of law  enforcement experience to my district in Wayne County.\n\nOver that career, Sheriff Retter has worked tirelessly, holding  positions of ever-increasing responsibility, beginning as a road patrol  officer before being ultimately elected sheriff of Wayne County and  having served as president of the Indiana…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688602/recognizing-sheriff-randy-retter"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Lyons was selected as Chief of the Year by the  Georgia Association of Chiefs of Police before retiring from Garden  City in December of 2017.\n\nThese are only a handful of positions Marshal Lyons has held in our  Nation's police force throughout his impressive career.\n\nToday, we honor U.S. Marshal David Lyons for his lifelong service in  ensuring the…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693004/fletc-celebrates-55-year-anniversary"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…school age, she discovered a new calling:  serving those who have served.\n\nMrs. Gramer has devoted herself to supporting veterans and their  families. She has held leadership positions within her local Veterans  of Foreign Wars Post, maintains membership in her local American Legion  Post, and has served as both Co-Director and Vice President of a local…", "date": "2026-02-20", "source_url": "https://justfacts.votesmart.org/public-statement/1700088/recognizing-united-states-navy-petty-officer-second-class-katrina-gramer"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…During his time there, he co-founded both the Moravian College Jazz  Quartet and the Moravian College Dixieland Band. His exceptional talent  earned him the lead alto saxophone positions with the Moravian College  and Muhlenberg College Big Bands, and he also served as Principal Alto  Saxophone for the Moravian College Wind Ensemble.\n\nHis pursuit of excellence…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694748/recognizing-mr-frank-c-parker-iv-quakertown-community-school-district-director-of-bands-for-27-years-of-service"}]