[{"senator": "Shomari Figures", "party": "Democrat", "sentence": "…expectations,  and they left behind a spectacular record of service and  accomplishment. Though these men took off as the unlikeliest of  American heroes, they landed as what is possibly the greatest, most  well-known, most well-decorated fighting force in this Nation's  history.\n\nAs a young man now that has the privilege to represent Tuskegee, it  is my honor,…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696982/tuskegee-airmen-moment-of-silence"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…January 6, 2021. This provision would give  those Senators $500,000 for every phone call appearing on a call log,  adding up to a corrupt giveaway of hundreds of millions or possibly  even billions of taxpayer dollars. One of my colleagues has already  bragged about his plans to sue the Federal Government to secure himself  a payday.\n\nHow did we get here?…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697046/unanimous-consent-requests"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…that risk.\n\nAll of these agencies, including the CIA at Langley and other  agencies, four of which are in Virginia, are so that those agencies can  be as secure as we can possibly make them, so that we will not lose  people, FBI agents, CIA agents, NSA agents, or whoever, and that we  will have those facilities in a secure place. All this amendment…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699075/providing-for-consideration-of-hr-financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…seen this time after time. Now, it is with the illegal sweeps  of immigrants, including immigrants who are here on travel visas,  leading to a stark drop in tourism, and the possibly illegal usurpation  of our taxation authority by an unprecedented series of tariff  announcements.\n\nA great gauge of how corrupt things are right now is by seeing how  much…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690818/gross-violations-of-law-by-trump-administration"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…benefits aren't there or the files regarding your  disability benefits or your age and birth records? Who all knows what  can disappear or be modified? Banking records are possibly included if  you had banking transactions to pay your taxes. It could be incredible  amounts of stuff.\n\nWe have had fairly protective practices of these databases, which is…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Maggie Hassan", "party": "Democrat", "sentence": "…stormed our Capitol and assaulted police  officers.\n\nCan anyone in the administration look the families of the officers in  their eyes and explain why such a pardon could possibly be justified?\n\nOf course not.\n\nBut then again, this administration doesn't think it should have to.  And make no mistake: The pardons may have voided the criminal  convictions,…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698503/9999"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…to afford the medications that  they need to help keep them alive.\n\nHealthcare should be affordable for all citizens in the United  States. Amanda is worried that they will possibly lose their home if  they get sick and have to go to a doctor.\n\nAndrea from Tacoma works for a California-based company. The  insurance that they offer would cost her $1,000…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698673/protecting-healthcare-for-millions-of-americans"}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "…military that are now in some sort of potential future  legal jeopardy. And it is because we have a President that I believe  doesn't do his homework, doesn't follow norms, and possibly is making  decisions that are not legal.\n\n(Mr. BANKS assumed the Chair.)\n\nWe have seen the politicalization of the U.S. military over the last  9 months. That really disturbs…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696346/trump-administration"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…America?\n\nThe answer will be better explained when the Articles of Impeachment  are presented. However, I do believe that it is necessary to give some  indication today and possibly at a later time as to why this is so  important, why would I do such a thing.\n\nMr. Speaker, I agree with Vice President Dick Cheney. I agree with  him. I agree with a statement…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697472/president-trump-is-a-threat-to-our-republic"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…other materials.\n\nWe ought to look at the folks, the people of Ukraine, led by  President Zelenskyy, with such admiration. We ought to say that we  should do everything we possibly can to support them, everything they  need to win. We have to finish that sentence: Everything they need to  win.\n\nThe win must not be through some sort of appeasement. It…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690214/supporting-ukraines-independence"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…our fight  against this administration's authoritarian agenda.\n\nMr. Speaker, I will talk to you about immigrants because apparently  my colleagues here do everything they possibly can to vilify them every  single day. It is almost as if they forgot that their grandparents also  crossed borders and shores to get here, but let me say to you, you may…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689781/defending-social-services-and-programs"}, {"senator": "Brad Schneider", "party": "Democrat", "sentence": "…I include in the Record remarks from  Rose-Helene Spreiregen, a holocaust survivor.\n\nNever, as a young Jewish girl hiding in France during World       War II, could I have possibly dreamed of standing where I am       now. Never could I have imagined addressing democratically       elected representatives, in a country where people can live       freely,…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690804/rose-helene-spreiregen"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…permanency of your felicity as a people. These will be offered to you  with the more freedom as you can only see in them the disinterested  warnings of a parting friend, who can possibly have no personal motive  to bias his counsel. Nor can I forget, as an encouragement to it, your  indulgent reception of my sentiments on a former and not dissimilar  occasion.…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700163/reading-of-washingtons-farewell-address"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…mayors, and even a  sitting U.S. Senator, what does that mean for the rest of us? These  tactics are to scare people. People are now afraid to go to court.\n\nHow does that possibly make our country more safe? People are  skipping hearings, risking automatic deportation, because they don't  trust the system anymore. How is anyone supposed to follow the…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693019/ice-turns-courthouses-into-traps"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…for her remarks and for always keeping it real. I will  reiterate  some of the things that she said, which is that this administration has  been targeting Black Americans, possibly because they are so afraid of  our shine. This administration and its policies have certainly been  laser focused on trying to tear down Black women. You don't have to  connect…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690637/trumps-first-100-days"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…cases, if you  are on private insurance to get a doctor's appointment in California.  The Governor's reckless policy is a big reason why.\n\nWe are going to do everything we possibly can here to fight for  Californians and fight for Medicaid in California. I will do everything  I can to protect this program against the Governor and the  legislature's reckless…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "…Defense  authorization act. And we are talking about adding a bill, a piece of  legislation, that really belongs in another jurisdiction, as my friend  acknowledged.\n\nWe cannot possibly add another $10 billion--$9 or $10 billion of  entitlement money--to this DOD authorization act and hope to pass it.\n\nAnd that is the reason that in Democrat majorities and…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696110/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…2020. California was in the throes of the worst wildfire  recorded in our State's history. There was untold suffering. Our heroic  firefighters were doing everything they possibly could to get the blaze  under control. Governor Newsom came out and announced: Here is what we  are going to do. We are going to ban gas-powered cars. Our cars make  wildfires…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690484/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision"}, {"senator": "Scott Fitzgerald", "party": "Republican", "sentence": "…legislatures aren't aware of. As  a matter of fact, I have said before, I think that there may be some  State legislatures that will react to the legislation before us today  and possibly come up with other items that States have already put in  place that probably will support law enforcement in this area.\n\nI think suggestions that the bill will put these…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700039/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "…can use the benefits that they earned. This bill  changes that by modernizing the GI Bill and expanding access to high- quality certificates and technical training programs, possibly offered  in a hybrid format, that lead directly to good-paying jobs in high- demand fields.\n\nNot every veteran wants or needs a traditional 4-year degree. Many  want fast,…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699510/veterans-education-and-technical-skills-opportunity-act-of-2025"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…beginning and in the debate, not the last  step to bring integrity into the name, image, and likeness, NIL,  process in college sports by setting up a Federal framework--not  possibly 50; we already have 30--but a Federal framework to ensure that  we have fairness across the board on college athletics.\n\nMr. Speaker, I urge the passage of this rule so that…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697302/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Darrell Issa", "party": "Republican", "sentence": "…miles of Mexican border between the United  States and Mexico. I represent about 80 of those miles right there  outside of San Diego. I have seen the border closed as best it possibly  could in an amazing way. I have seen submarines still coming in the  Pacific to try to circumvent it. I know we will never get to zero.\n\nAll the President has asked Canada…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699964/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "…we are researching the cures for those  diseases, thousands and thousands of children continue to suffer.\n\nMr. Speaker, we need to give every priority and do everything we  possibly can to speed up the delivery of these treatments for rare  pediatric diseases, and that is what this bill is all about. The Give  Kids a Chance Act will reauthorize the FDA's…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697275/mikaela-naylon-give-kids-a-chance-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…will close by saying I greatly appreciate the leadership my friend  from Colorado has shown. She is a leader in this House and in ensuring  that we deal with as much as we possibly can in every way possible with  substance use disorder. I believe we need to stick to the budget  neutrality.\n\nMadam Chair, I oppose the amendment, and I yield back the balance…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691874/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…lab was out there. The question  still remains: How many others are there? We need to get answers to  that very quickly, and we need to make sure we are doing everything we  possibly can to find and shut down any other labs that are indeed out  there.             Congratulating PRIDE Industries' 60 Years of Service\n\nMr. KILEY of California. Mr. Speaker,…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700217/prices-in-california-are-too-high"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…significant late-night engagement in debate. The ranking  member of the Committee on Rules, Mr. McGovern from Massachusetts, has  had an unfortunate loss that words cannot possibly convey as a dad what  he and his wife are going through with the loss of his daughter, Molly.\n\nI say from this side of the aisle, I know speaking for the entire  Committee…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690387/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…senseless murder yesterday, the  assassination of Charlie Kirk, and the violence and evil that is all  around us. This is one step to try to prevent and stem even more of  that possibly happening. It is by dealing with dangerous folks, not  just folks who come across the border for the first time and are dealt  with in the normal way, but dealing with folks…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695365/stop-illegal-entry-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…all the little girls who were riding in  the bus as they left Camp Mystic, singing hymns and expressing their  faith. They were looking at the destruction that they couldn't possibly  comprehend as they left that camp, but they were still putting their  faith in their Lord and their Savior.\n\nIf there is anything we can take out of this, it is that sense…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693607/mourning-the-loss-of-life-in-the-state-of-texas"}, {"senator": "Ron Estes", "party": "Republican", "sentence": "Mr. ESTES. Mr. Speaker, I rise today to honor a friend and fellow  fiscal hawk on her last day of work, my district director, Debbie  Luper.\n\nHow can I possibly frame up the service and political activities of  Debbie Luper in one short floor speech? Her presence in Kansas politics  is deep, and a great number of elected officials…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690554/recognizing-debbie-lupers-tenure-as-district-director-for-the-fourth-district-of-kansas"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…ensure that  the subpoenas were going to be kept secret from us.\n\nNow, the basis for the gag orders was this: that notifying the  Members of Congress being spied on could possibly result in destruction  of evidence, intimidation of potential witnesses, serious jeopardy to  the investigation. I am reading that from the gag order. Imagine that.\n\nWe also…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700058/9999"}]