[{"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…Representatives that the  American people want all the files open.\n\nWe have had enough of the coverup. We want all of the truth. We want  the survivors and the victims to have the possibility of  accountability. Well, they want to give them another headline, which is  that they have arraigned a Democratic Member for taking a phone call  from her constituent,…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696885/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…calling attention to the need to act now, and this shutdown was  avoidable. The path to stopping it was available. And shortening it,  assuming it will occur, is still a possibility, if we come together, if  Republicans are willing to negotiate, if they come back to town. House  Republicans are out of town. They are out of touch with reality. The  way…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695920/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Jake Auchincloss", "party": "Democrat", "sentence": "…To a nonverbal child      Who just learned to make sounds      Like morning birds.      In living rooms turned sacred spaces,      Therapists pack up their tools of possibility--      Weighted vests, sensory brushes,      Piece of someone's future      Now deemed too expensive      By men who've never seen      How a body learns to trust itself…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690834/advocating-against-medicaid-cuts"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…what is really hurting  American energy prices. This rule didn't even meet the threshold to  require a Statement of Energy Effects report because it has such a  negligible possibility of impacting energy supply, distribution, or  use.\n\nThis rule actually promotes efficiency as has been stated. It  provides consistency to businesses and protects oil and…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688635/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…currently no cure. However,  there is hope. Because of ongoing advancements in medical research and  continued investments in biomedical science, we are closer than ever to  the possibility of breakthrough treatments and perhaps even a cure in  the decade ahead through gene therapy.\n\nRachel, my constituent, recently reached out to me to bravely share  her story.…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691197/recognizing-may-as-huntingtons-disease-awareness-month"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…messy crayon. When I look at it, I remember the little hands  that made each one of those squares. I think about those little heads  with big, curious minds and a world of possibility before them. I  remember the responsibility that we all felt to make sure they were  leaving our preschool ready to succeed. I wonder how many of those  children that made…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688363/nomination-of-linda-mcmahon"}, {"senator": "Doris Matsui", "party": "Democrat", "sentence": "…diseases, plasma-derived therapies mean the  difference between life and death, or between a life of diminished  health and physical limitations and one filled with hope and  possibility.\n\nFor example, Guillain-Barre syndrome is a rare but serious  neurological disorder that can lead to rapid muscle weakness and, in  severe cases, paralysis. A related condition,…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696010/recognizing-international-plasma-awareness-week-2025"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…be accomplished with a  bipartisan approach to problem solving and good-faith negotiations.\n\nThe Fiscal Responsibility Act directed the Biden administration to  study the possibility of improving digital tools for permitting.  Representatives Johnson and Peters partnered to turn those Biden  administration recommendations into good legislation. The current…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697678/epermit-act"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…is beneficial bigotry to say they should be obliterated and to say  that the Palestinians don't deserve a country. He has used it to do all  that he can to eliminate the possibility of a two-state solution. That  plan that he has is nothing more than a land grab.\n\nI know who he is. I see what he is doing. Others do, too. They just  don't have the ability…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698076/liberty-and-justice-for-all"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…``going to run  the country'' and seize control of Venezuelan oil production. He stated  that ``we are ready to stage a second and much larger attack if we need  to.'' So the possibility of hostilities certainly still exists in the  President's mind, and he expects to be involved in Venezuela for years  to come. This is not really a plan; it is an aspiration.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699116/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…whether there is a pathway.\n\nI don't know whether there would have been a pathway, but I know  today that the majority party in the U.S. Senate decided to foreclose  the possibility of bipartisanship, and that is a real disappointment to  me.\n\nMr. SCHATZ.  Right? That is what you do. If you have got the votes,  you just sort of move through the process…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695313/cloture-motion"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…before, and  it led to the impeachment of the President, and he lost an election as  a result of that, I believe. I plan to bring these Articles of  Impeachment. Removal is a possibility.\n\nThere is always a deterrent effect of Articles of Impeachment. They  can be used to say to a President: If you don't behave, if you don't  cease and desist with what you…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690862/and-still-i-rise-impeaching-president-trump"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…currently rent an       apartment in Boston and purchased a car so I can get to work.\n\nMy community here is all that I have built over the years.\n\nI am deeply worried about the possibility of losing my       ability to work if my work permit expires with the       termination of TPS. The thought of losing everything I have       worked so hard for is overwhelming.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699630/constituent-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…more       productive.\n\nI could not agree more with what President Trump said. It is why I  want to speak today about the soon-to-expire New START treaty and the  very real possibility of a new nuclear arms race, something that  neither the President, the Vice President, nor any other senior  official has even mentioned, but it is looming.\n\nIt is important…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694014/new-start-treaty"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…will  afford the screenings and any necessary care.\n\nFor a mother in Austin, who contacted me about the stop-loss  provision that is reinforced in this bill, it means the possibility  that after her 3-year-old child was diagnosed with cancer, they will  lose all their coverage.\n\nThese are real-life stories from my neighbors who have been forgotten  by…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698310/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Andy Ogles", "party": "Republican", "sentence": "…position  themselves inside sensitive systems for long periods of time, for  years, in some cases, before being discovered.\n\nTheir activity indicates preparation for the possibility of major  disruption during a time of crisis, including potentially over Taiwan.  This is a serious strategic concern, and it demands a serious national  response.\n\nThese…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696757/strengthening-cyber-resilience-against-state-sponsored-threats-act"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…defend the United States from an armed attack or imminent  threat. I believe invoking the War Powers Act at this moment is  necessary, given the President's comments about the possibility of  ``boots on the ground'' and a sustained engagement ``running''  Venezuela, with which I do not agree.\n\nWhat happens now matters greatly, both in terms of accountability…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698694/venezuela"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…Biden-Harris rule, companies have absolutely no incentive  to decrease their emissions.\n\nWe should encourage industries, Mr. Speaker, to lower their emissions  and allow them the possibility of reclassifying as an area source if  they can successfully reduce their emissions.\n\nU.S. emissions have already decreased over the past two decades, even  as our energy…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691596/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…asleep in the Lord.'' Lauren's  legacy of goodness and positivity will always be remembered.\n\nAfter Ashlyn stabilized, doctors let her family know that there was a  strong possibility that she may never regain consciousness. If she ever  were to, it was possible that she would never walk or talk again.\n\nThankfully, Ashlyn has made significant signs of…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699245/recognizing-ashlyn-gwynn"}, {"senator": "Laurel Lee", "party": "Republican", "sentence": "…type of long-term access is particularly concerning. When an  adversary establishes persistent access to critical systems, even  access that appears dormant, it creates the possibility of disruption  at a future date.\n\nThe United States cannot allow foreign actors to position themselves  in ways that could compromise public safety, interrupt essential…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696758/strengthening-cyber-resilience-against-state-sponsored-threats-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…located in       Garland, TX; Ellwood National Forge Company, located in       Irvine, PA; and McAlester Army Ammunition Plant, located in       McAlester, OK. There is a possibility that a portion of this       procurement will come from U.S. stock. At this time, the U.S.       Government is not aware of any offset agreement proposed in       connection…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688394/arms-sales-notification"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…ensure  that a contract is, in fact, payment for services rendered, as opposed  to a payment to attend a certain institution. Without disclosure of NIL  deals, there is a real possibility that the integrity  of competition could be called into question.\n\nThis bipartisan bill has received overwhelming support from schools  and conferences across the country,…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697302/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Darrell Issa", "party": "Republican", "sentence": "…Court ruled against the district  judge by a 5-4 ruling undoing this whole question of does the President  have the right to deport aliens. Yes. They said that there was a  possibility of bringing a case in Texas as to one or more of them. To  be honest, we have said that for quite a while that, in fact, there was  a procedure and that, in fact, the chief…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689711/no-rogue-rulings-act-of-2025"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…quickly approved, and he was allowed to  enter the United States.\n\nAfter the October 7 attacks, Director Wray warned us that the FBI  ``cannot, and [does] not, discount the possibility that Hamas . . .  could exploit the conflict to call on their supporters to conduct  attacks on our own soil.'' These words proved to be prophetic.\n\nOn June 1, 2025, Mohammed…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697237/no-immigration-benefits-for-hamas-terrorists-act-of-2025"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…of imprisonment for any illegal alien convicted of       reentering the United States.\n\nThe best deterrent against these violent criminals       attempting re-entry is the possibility of lengthy jail time.       Seventy percent of the aliens charged for illegal reentry in       2023 had criminal records. For example, an off-duty Customs       and Border…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695364/stop-illegal-entry-act-of-2025"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…obligation  to the American people to have that debate and to have that vote. To  vote against the rule means you do not believe the American people  should even have the possibility of having the government reopened  again.\n\nI came here to fight to make sure there are not another 500 families  next year and 500 the year after and 500 the year after.…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699594/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…recreation values, withdrawing the lands from ``all  forms of appropriation . . . including mining but not the mineral  leasing laws.'' PLO 2214 intentionally left open the possibility of the  development of certain resources, including oil and gas.\n\nUnder the landmark 1980 Alaska National Interest Lands Conservation  Act, ANILCA, the Range was expanded…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697739/9999"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…feedback on its impact.\n\nFurther, it is important to clearly delineate the extent of       the rulemaking's scope. In its current form, the proposal       leaves open the possibility that entities far outside the       market for general-use digital consumer payment applications       will be captured. For example, the proposal specifies that       the…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689949/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…agencies to report       to the Congress if federal banking regulators invoke an       emergency determination known as the systemic risk exception.       Systemic risk is the possibility that the failure of a       financial business, market, or product could trigger severe       financial instability in the economy. The bill would require       the Federal…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697286/systemic-risk-authority-transparency-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…the Fed and be  subject to these risks to privacy or surveillance. Let's stick with the  approach of private-sector solutions.\n\nWe have already seen small glimpses of this possibility under the  prior administration. The chair of the House Financial Services  Subcommittee for Oversight and Investigations,  Dan Meuser of  Pennsylvania, has been having…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693731/anti-cbdc-surveillance-state-act"}]