[{"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…are 229,000 people on Medicaid, including 79,000 children and 33,000  seniors. Medicaid paid for 3,000 births last year, providing  comprehensive prenatal, delivery, and postpartum care to newborns and  mothers. These are programs that help families and children. Medicaid  works.\n\nElon Musk is only interested in helping the richest among us. His  dream…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688072/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…Medicaid plays a critical role in supporting maternal health,  covering a significant portion of births in our country and providing  access to healthcare for pregnant women and postpartum individuals,  including prenatal care and postpartum services.\n\nBlack women, we know, are three times more likely to die from  pregnancy-related causes than White women.…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689783/defending-social-services-and-programs"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…America  has the highest rates of maternal deaths--women dying in childbirth or  in the days after--of any nation. A majority of these maternal deaths  take place during that postpartum period, the days after birth.\n\nFor years, I fought for Medicaid to provide coverage for women for up  to 1 year postpartum instead of just 60 days. In 2022's Congress, I…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…Medicaid reimbursement can match Medicare reimbursement so that more  children can have a medical home. It is about expanding Medicaid care  for pregnant women until 1 year postpartum to make sure that they are  healthy and plan their pregnancies and that we can cut down this  outrageous incidence of maternal mortality in this country.\n\nNow we are just…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691419/gop-tax-scam-hurts-everyone"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…mislead, and delay women from accessing abortion care.\n\nThis bill does nothing to lower healthcare costs. It does nothing to  help families afford prenatal care, childbirth, or postpartum care. It  does nothing to address the deadly consequences of extreme Republican  abortion bans that are forcing women to delay care and risk their  lives.\n\nMr. Speaker, if…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699219/providing-for-consideration-of-hr-supporting-pregnant-and-parenting-women-and-families-act-providing-for-consideration-of-hr-pregnant-students-rights-act-and-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Communities Reauthorization Act of 2025.\n\nThis includes programs to train first responders who respond to  opioid overdose calls, provide residential treatment to pregnant and  postpartum women, and support people on long-term recovery.\n\nIf Republicans really support these programs, my colleagues should be  opposing the President's budget, which lays out plans…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691876/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…drive me:  Everyone deserves access to healthcare. That is why, in the State  legislature, I worked every day to protect and expand access to care,  passing laws to expand postpartum Medicaid so that new  parents received the care that they needed after childbirth,  establishing a universal healthcare commission, removing barriers to  behavioral health…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698673/protecting-healthcare-for-millions-of-americans"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…back in with their grandparents.\n\nI heard from a nurse who shared that 40 percent of the births in her  hospital are covered by Medicaid, including prenatal, maternal, and  postpartum care. That is what supporting families and family values  looks like.\n\nA speech language pathologist at a title I school told me that most  of her students are on Medicaid.…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690740/medicaid-is-a-lifeline"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…nothing about it. That is the ultimate kind of  cynical maneuver.\n\nI mean, this administration is cutting money for first responder  training, cutting money for pregnant and postpartum women, cutting  programs to help prevent children from going down the road to  addiction, cutting programs to track opioids, and cutting comprehensive  opioid care centers.…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691944/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…in the  United States. Medicaid covers nearly half of all children, and it is  the largest insurer of kids with disabilities. Medicaid is a vital  source of prenatal and postpartum care for women, and it covers more  than 40 percent of births in our country.\n\nThe Republicans' dangerous proposal today is selling out the health  and wellness of kids,…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688090/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions-and-providing-for-consideration-of-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…women died compared to White women, and  there were differences in the reasons.\n\nIn Virginia, the data showed us that for White women they were more  likely to die due to postpartum depression leading to suicide or other  mental health-related issues leading them to take their own life or to  self-medicate and die of drug overdoses.\n\nFor Black women…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690243/health-disparities-in-minority-communities"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…wrong information. This misdiagnosis greatly increased her risk of  having pregnancy complications.\n\nMs. CHU. Mr. Speaker, I would like to talk about Kentucky, where a  postpartum nurse with 20 years of experience was motivated to volunteer  at a crisis pregnancy center. During her training, she learned that the  clinic was using expired disinfectants…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699223/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Kat Cammack", "party": "Republican", "sentence": "…Act of 2025  has the backing of more than 160 different organizations dedicated to  substance abuse disorder treatment and recovery, and it expands care  for pregnant and postpartum women, strengthens prescription drug  monitoring, and helps individuals in recovery reenter the workforce and  rebuild their lives.\n\nThat is what real solutions look like,…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691884/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Neal Dunn", "party": "Republican", "sentence": "…program, which helps ensure that first responders are prepared and  trained to administer Narcan.\n\nI also strongly believe in the residential treatment program for  pregnant and postpartum women. This program is vital to help new moms  obtain treatment for substance abuse disorders.\n\nPrograms in this bill can change the lives of those who are suffering  from…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691878/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…for Walmart, a local  rental car agent, and in jewelry sales. Yet her greatest professional  passion has been in the healthcare industry. She has served her  community as a postpartum department unit clerk, an emergency  department unit clerk, and as office manager and receptionist for Dr.  Petty's Podiatry.\n\nBeyond her professional career, Lisa's dedication…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696870/recognizing-congressional-patriot-award-recipient-lisa-singleton"}]