[{"senator": "Mark Kelly", "party": "Democrat", "sentence": "…jobs, who are working every single day to make sure  that our Nation and our allies are safe and secure and have to make  some really complicated decisions every day about the posture of force,  how to equip them, make sure they are ready to fight--and the Secretary  of Defense, for some reason, decides that he needed to give a TED talk  about gym clothes…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696346/trump-administration"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…has upheld  the Constitution and faithfully followed the rule of law. She is  impartial, thoughtful, and even-handed, evaluating every case from, in  her words, a ``neutral posture.''\n\nSince her confirmation, Justice Jackson made her mark on the Court,  establishing her status as a sharp and inquisitive questioner of the  parties before her. And whether…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689666/justice-ketanji-brown-jackson"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…like industrial tools and semiconductors.\n\nAt a minimum, given its tendencies to appease Russia rather than  pressure it, the Trump administration must maintain the current posture  of deterrence with the existing tools it already has. The better  approach is for this administration to also use the additional tools  offered by this legislation to deter…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690677/economic-espionage-prevention-act"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…Trump administration has spent months  conducting a large-scale military buildup in the Caribbean but has  completely failed to explain the rationale to Congress. A military  posture that includes a carrier strike group is wildly disproportionate  to the goal of prosecuting counter-narcotics missions. The financial  costs of Operation Southern Spear are…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698418/supporting-of-h-con-res-61-and-h-con-res-64"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…remarkable.\n\nCheck out a city in Europe called Szeged, in Hungary. That is Toledo,  Ohio's sister city for 40 years.\n\nThe good news is the Trump administration appears ready to posture  across America to draw forth geothermal power, and we are interested in  doing exactly that, particularly in manufacturing America.\n\nI am privileged to also represent a vast…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694099/trumps-reckless-tariff-policies"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…Located  in the middle of the Indo-Pacific, Hawaii is not just a remote island  economy dependent on maritime commerce. It is the linchpin of U.S.  power projection and force posture across the Indo-Pacific. Any  disruption to Hawaii's shipping system is not only an economic risk to  our residents but a direct vulnerability in America's strategic  readiness.…", "date": "2025-08-01", "source_url": "https://justfacts.votesmart.org/public-statement/1694572/introduction-of-the-merchant-marine-allies-partnership-act"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…significant  challenge to America's economy and financial system. This doesn't mean  that China is simply an economic competitor. Rather, China has taken an  aggressive adversarial posture toward American  influence and power globally, leveraging its growing economic strength  to do so.\n\nTo address concerns raised by China's conduct in this regard,  American…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694120/china-financial-threat-mitigation-act-of-2025"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "…Among other provisions, it increases oversight of the FBI's terrorist  watch listing process, requires the NSA to notify Congress of  significant changes in its collection posture, and improves our  visibility in counter-narcotics-related operations.\n\nIt requires each IC element to designate a senior official to oversee  work on biotechnology issues,…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697797/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…this veto has nothing to do with fiscal  policy, nothing to do with the merits. There has been extensive  reporting that raises broader concerns about the administration's  posture toward the State of Colorado and even toward the sponsor of  this bill.\n\nWe know what this veto was about, and the message that that sends to  Colorado and communities awaiting…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698699/finish-the-arkansas-valley-conduit-act-veto-message-from-the-president-of-the-united-states"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…belief that one does not  have to accept the world as it is, but he glimpses into what the world  ought to be. That is leadership.\n\nLeadership is not a performance. It is not a posture. It is a way of  standing with the vulnerable, a way of insisting that compassion is not  weakness, that justice is not a luxury, and that democracy is not a  spectator sport…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696773/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…vital  to the security of both the United States and our partners.\n\nOn the final leg of the trip, I met with Taiwanese officials and saw  firsthand how we can strengthen U.S. posture and deepen collaboration  in the region. I was also struck by the warmth, hospitality, and the  resilience of the Taiwanese people.\n\nFor decades, our partnership with Taiwan…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694962/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…operate port terminals in this country.\n\nThis legislation will ensure that our ports remain safe from both  cyber and physical threats, which increases our national security  posture.\n\nI commend my colleague from California (Mr. Calvert) for leading on  this issue and working to strengthen our Nation's posture against our  adversaries.\n\nMr. Speaker, I…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692209/secure-our-ports-act-of-2025"}, {"senator": "Eric Burlison", "party": "Republican", "sentence": "…nicknames, including  ``leathernecks'' due to the stiff leather collars worn in their 18th-  and 19th-century uniforms, which protected against sword slashes and  encouraged good posture; ``jarheads,'' which was initially due to the  appearance of their high-collared dress uniforms that made their heads  look like a mason jar in the early 1900's and has since…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696652/recognizing-the-us-marine-corps-on-its-250th-birthday"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…hallmarks of the America First agenda. They meet the priorities of the  President and the priorities of the American people. They make sizeable  contributions to America's strong posture of defense, our Nation's  systems of infrastructure, national security, and research and  innovation within health.\n\nAs Chairman Cole has noted multiple times over, this process…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699311/providing-for-consideration-of-hr-consolidated-appropriations-act-and-providing-for-consideration-of-hr-department-of-homeland-security-appropriations-act-and-for-other-purposes"}, {"senator": "Andy Ogles", "party": "Republican", "sentence": "…tools  or authorities Federal agencies may need.\n\nClassified briefings will ensure that Congress receives timely and  accurate information necessary to evaluate our nationwide posture.\n\nThis bill strengthens unity and effort. It improves coordination. It  increases visibility and accountability. It ensures that the United  States can respond to foreign…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696757/strengthening-cyber-resilience-against-state-sponsored-threats-act"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…preventing unauthorized entry is common sense. As I said, it is  straightforward, and it will help both our servicemembers, our air  arsenal, and our overall national security posture.\n\nMr. Chair, I thank the judge for his leadership, and I urge adoption  of this amendment.\n\nMs. WASSERMAN SCHULTZ. Mr. Chairman, I rise in opposition to the  amendment.", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692947/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…the Indo-Pacific. The bill includes a number of provisions  to rid adversaries from our defense supply chain. It extends the  Pacific Deterrence Initiative to enhance U.S. posture in the region and  improves our ability to conduct military operations in the Pacific. It  also bolsters Taiwan's defenses and helps build the capacity of our  allies in the…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697810/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…Engineer Battalion. The  battalion's mission was diverse, including construction, aviation  support, and multi-role bridging capabilities, all while maintaining a  combat-ready posture to fight at a moment's notice. Bill's heroic  efforts earned him the National Defense Service Medal, the Vietnam  Service Medal, and the Vietnam Campaign Medal. After being…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696330/recognizing-william-bill-forest-harris-with-a-congressional-veteran-commendation"}, {"senator": "Laurel Lee", "party": "Republican", "sentence": "…lays the groundwork for a  more unified and prepared Federal approach. It supports the operators  who manage vital systems across our country. It strengthens our  national posture against a foreign adversary that has already shown its  willingness to target essential American services.\n\nI urge my colleagues to join me in supporting this important  legislation.", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696758/strengthening-cyber-resilience-against-state-sponsored-threats-act"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…null and void.\n\nMr. Speaker, before I reserve, I want to take a moment to recognize  the good faith efforts of Speaker Johnson in helping maintain a strong  family-centric posture here in the people's House.\n\nLeading from the front and building consensus are not always easy  endeavors. All of us understand this to be true. However, when done in  the…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689703/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…transformers  and natural gas turbines, can stifle infrastructure development.\n\nBy establishing periodic assessments under this legislation, the  Department will remain in a proactive posture to identify and address  matters affecting our power sector supply chain as they arise. In fact,  in the last 2 months, DOE has taken 52 actions to secure our grid and  lower…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697897/electric-supply-chain-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…driving economic growth and creating good-paying  jobs for households.\n\nThat is why the Electric Supply Chain Act will ensure that our  Federal Government remains in a proactive posture to assess, identify,  and address any challenges to our supply chain grid for grid  components. H.R. 3638 takes a comprehensive look at the supply chain  for our electric…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697890/electric-supply-chain-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…generation of warfighters by preserving  local museums like the Patton Museum.\n\nMake no mistake, this NDAA restores peace through strength, rightly  refocuses our military posture, and puts America first.\n\nMr. Speaker, I encourage all of my colleagues to join me in  supporting this historic investment in our national defense.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695348/ndaa-restores-peace-through-strength"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…Typhoon attack, underscores the urgency of  addressing this ever-evolving challenge.\n\nThe NTIA Policy and Cybersecurity Coordination Act bolsters our  Nation's cybersecurity posture by strengthening the coordination  between the National Telecommunications and Information Administration,  NTIA, and other relevant Federal agencies. Additionally, the bill…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693497/ntia-policy-and-cybersecurity-coordination-act"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "…Before legislation is advanced to the floor, it should be vetted  through that process so that the Senate can fully understand and  appreciate its scope, its effect, its legal posture, and whatever  unintended or intended consequences the legislation might have.\n\nI have made it clear, from the beginning, that I am willing to work  with the Senator from…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698296/9999"}]