[{"senator": "Stephen Lynch", "party": "Democrat", "sentence": "…passes for genius these days.\n\nRepublican leadership has, once again, caved in to President Trump's  demands to quickly push crypto legislation.\n\nPresident Trump just yesterday posted to pass the GENIUS Act ASAP.  There is no need to debate it, read it, or amend it. Just pass it.\n\nMr. Speaker, you might think that Republicans might be cautious about  taking…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693842/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…just 12 days ago, and it  included significant changes from its original version, the SAVE Act.\n\nAfter the SAVE America Act's initial introduction, the Committee on  Rules posted a complete rewrite of it last Friday. Even after two  sweeping rounds of edits, Republicans were not done changing their  half-baked bill. Yesterday, they posted a manager's…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699941/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…making sure that every voice is  heard, even when they are overseas.\n\nPresident Trump has stated that he wants to ``lead a movement'' to  get rid of mail-in voting, and he posted this past week on social  media: ``No mail-in or `Early' Voting.'' He has assigned lawyers to  craft another Executive order to stop it.\n\nThe irony is not lost on anyone that…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696440/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…consume.\n\nMr. Speaker, this process is an abomination, legislative malpractice.  Final text of this bill came out less than 24 hours ago. We met in  committee an hour after it was posted, and now, we are here considering  a rule that allows for only 1 hour of debate.\n\nThis bill is within the jurisdiction of 12 different committees. One  hour is ridiculous.…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693225/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…schizophrenic, and he lacks ``the mental capacity to reach out to  anybody,'' according to his family.\n\nHis family only learned of his arrest after footage of the encounter  was posted on social media. His family started searching desperately to  find him in detention. Now, if this sounds like an extreme case, it is  not. It is the usual custom. The ICE agents…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696536/government-funding"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…giant tax cuts for billionaires, and since those two cannot begin to  imagine what it means for working people, let's tell them what Social  Security does.\n\nA few weeks ago, I posted a video explaining what Trump and Musk were  doing to Social Security, and I asked people: Just tell your stories.  And the stories came flooding in, and here are just a few:…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690633/nomination-of-frank-bisignano"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…Americans, working in a fourth-floor       conference room at the Woodlawn, Maryland, headquarters, with       blackout curtains on the windows and an armed security guard       posted outside.\n\nAt first, the DOGE team was obsessed by false claims that       millions of deceased people were receiving benefits. Then       came new       mandates designed to…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689130/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…floor of this body, a Senator called Islam a ``poisonous religion''  that ``is fundamentally incompatible with our Western values.'' In  recent weeks, a Member of the House posted on his official Twitter  page:\n\nHow to Deal with Mainstream Muslims: I don't know how you       make peace with those who seek your destruction, I think you       destroy them…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698866/commerce-justice-science-energy-and-water-development-and-interior"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…selecting an award for continued industry  work on a space microreactor design that could provide a supply of  power for use on the Moon and beyond.\n\nJust last week, scientists posted new data from the Department of  Energy's ground-based Dark Energy Spectroscopic Instrument, providing  insights on the mysterious dark energy of the universe that NASA's…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688987/doe-and-nasa-interagency-research-coordination-act"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…eagerness to push out the videos  of these attacks.\n\nWe first learned about these strikes when video of an attack was  published by the President of the United States, who posted the video  of it on his social media. That was video of the first strike on  September 2.\n\nIn the strikes since--strikes that have killed nearly 100 people in  the last few…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698422/unanimous-consent-requests-the-calendar"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…the U.S. Senate or U.S. House of  Representatives and who previously served in the U.S. Military or in  U.S. Intelligence communities, in response to a short video that they  posted on November 18, 2025. In their video, the Democratic lawmakers  appropriately urged current members of the military and intelligence  communities to adhere to the Constitution…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697872/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…consultation with  the Clerk of the House and the document retention precedents of other  committees of this House. The select committee's final report and its  support materials are posted publicly online. Just to be sure, I  checked again today. All of them, every single page of every  transcript, are posted online publicly. Maybe the gentleman can't find  them.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694886/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…alarm every single one of us.\n\nSecretary Hegseth loves to look tough. He loves to boast about the  lethality of our forces. He wants to be taken seriously, but yesterday  he posted a ridiculous tweet of a cartoon turtle firing on alleged drug  traffickers--a sick parody of a well-known children's book. This man is  a national embarrassment. Tweeting memes…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697173/secretary-hegseth"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…time I have been on the  floor has been to ring the alarm bells. Ring the alarm bells.  Authoritarianism is here now. I am told that each time I say this, lots  of bells are posted online. So just for my team's fun, ring the alarm  bells. I want that to be heard all across America, that we are way off  track. This is the wrong way to go.\n\nIn a democracy,…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…people loitering outside their homes or sitting       in parked cars with cameras, watching them.\n\nOne San Diego child care provider whose name and phone       number were posted online by a local activist said that ever       since then, her phone has been ``flooded'' with calls, and       she has seen people loitering around her home with recording…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699222/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…athletic department. I commend Director of  Athletics Patrick Quest and Assistant Athletic Director Joe Dotson for  their outstanding leadership.\n\nChristendom's varsity teams posted a 3.51 GPA, with the senior  student athlete class achieving a 3.61 average. A total of 45 student- athlete sophomores, juniors, and seniors earned USCAA and NCR National…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693527/congratulating-central-high-school-womens-softball-team"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…As a graduate of Benedictine Military School in Savannah,  Justin was a standout athlete who now plays center field for the  Arkansas Razorbacks.\n\nJustin and the Razorbacks posted an impressive 50-win season, earning  a trip to the College World Series. Even though Arkansas came up short  of the program's first national title, Thomas' relentless hitting…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693004/fletc-celebrates-55-year-anniversary"}, {"senator": "French Hill", "party": "Republican", "sentence": "…colleagues to.\n\nMr. HILL of Arkansas. Mr. Speaker, I include in the Record the CBO  estimate for this bill.\n\nESTIMATED BUDGETARY EFFECTS OF H.R. 3633, THE CLARITY ACT OF 2025, AS POSTED ON THE WEBSITE OF THE HOUSE COMMITTEE ON RULES ON JULY 2, 2025 --------------------------------------------------------------------------------------------------------------------------------------------------------…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693775/digital-asset-market-clarity-act-of-2025"}, {"senator": "Tony Wied", "party": "Republican", "sentence": "…and CEO, the Green Bay Packers won the  Super Bowl in 2011, made 5 NFC Championship Game appearances, secured 8  NFC North division titles, earned 13 playoff appearances, and posted a  172-101 regular season record, which was the second best in the league  over that span.\n\nOff the field and under his guidance, the Green Bay Packers invested  more than…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694121/recognizing-mark-murphy"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…is a current student at Manor Middle School and is a  Corporal with the Young Marines of Lancaster County. As a member of the  organization's color guard, he has spoken and posted the colors for  events such as graduations, sporting events, and a Cold War Veteran  Recognition Ceremony that I held in November 2025. He has also led  community service efforts,…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699827/recognizing-young-marine-corporal-chase-muchmore-on-being-named-the-pennsylvania-regiment-junior-young-marine-of-the-year"}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "…CDC       accelerated its public reporting of measles cases and       outbreaks so that anyone who visited the CDC's website could       see hot spots of infection. It also posted a ``Be Ready for       Measles toolkit, which provided outbreak response tools and       communication materials for clinicians and the public health       community. What's…", "date": "2025-10-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696063/texas-measles-outbreak"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…the public should know what agency guidance  says about the laws and programs that affect them. However, guidance  documents are not easy to find. They are not consistently posted on  agency websites.\n\nThis inconsistency burdens regulated entities, and it especially  burdens small businesses who often lack the resources to hire  compliance experts. The…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688391/guidance-out-of-darkness-act"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…financial  interest in the items requested.\n\nAll of the fiscal year 2026 CDS requests submitted to the  Appropriations Committee can be found in a searchable table that has  been posted on the committee's website.\n\nMs. COLLINS. I urge our colleagues to defeat this amendment, and I  move to table.\n\nMs. COLLINS. Mr. President, I call up my amendment No. 4273…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699433/consolidated-appropriations-act-2026"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…each member of the Organ Procurement and       Transplantation Network; and\n\n``(ii) a list of activities such fees are used to support;       and\n\n``(B) update the information posted pursuant to       subparagraph (A), as applicable for each calendar quarter for       which fees are collected under paragraph (1).\n\n``(5) GAO review.--Not later than 2 years…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697276/mikaela-naylon-give-kids-a-chance-act"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…insulates ``Big Tech'' from most liability for the digital fentanyl  promoted on their sites. Time and time again, drugs are sold, sexually  suggestive and/or explicit content is posted without consent,  algorithms promote and normalize suicide and self-harm, and chatbots  tell children how to cope with their emotions. All of these things are  harming our…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699543/true-cost-of-big-tech"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…Leader Jeffries want to stoke fear in this way and terrorize  Americans?\n\nInstead of recognizing the sickening, repulsive rhetoric for what it  is, this Member doubled down and posted it on her social media  accounts, instilling fear in and terrorizing those people who she  claims to care for.\n\nMr. Speaker, Democrats are injecting fear into the lives of…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689862/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…a       classified annex.\n\n(B) Public availability.--The unclassified portion of each       report required by paragraph (1) shall be made available to       the public and posted on a publicly accessible website of the       Department of the Treasury--\n\n(i) in precompressed, easily downloadable versions, in all       appropriate formats; and\n\n(ii)…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693963/financial-technology-protection-act-of-2025"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…reinstates clear timelines for  disciplinary investigations.\n\nH.R. 2096 also repeals the D.C. Council's requirement that the time  and place of some adverse action hearings be posted to a public  website.\n\nThis public posting requirement enables antipolice activists to  harass officers attempting to pursue their due process in the  workplace.\n\nIn summary,…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692305/protecting-our-nations-capital-emergency-act"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…nothing.\n\nDon't just take my word for it, and don't blame the State employees.  They tried. In fact, recently, the State employees, they just said:  Look, we have had enough. They posted this. These are several hundred  employees from the Minnesota Department of Human Services who  administered this program, who just get up every day and go to work and  do…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697400/welfare-fraud"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…each building at the       Coast Guard Academy that contains a dormitory or other       overnight accommodations for cadets or officer candidates,       written information is posted in a visible location with       respect to--\n\n(1) the methods and means by which a cadet or officer       candidate may report a crime, including harassment, sexual…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}]