[{"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…as we take up the Senate- passed bill to reopen the government, I want to clarify that we should  be proceeding through regular order before taking any action that could  potentially impact the entire hemp industry and affect more than  220,000 American jobs.\n\nAuthorizing policy through an appropriations bill is counter to House  rules and undermines…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696722/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…enter the  fray; when countless American families were forced to consider whether  their children would be the next to bear the burden and carry the  sacrifices of another potentially endless war in the Middle East.\n\nAnd so with those families and our servicemembers in mind, Senator  Kaine introduced this resolution to ensure that the President did not…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693120/motion-to-discharge-sj-res-59"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…nominees because we disagree with their  judicial philosophy. We have opposed them because they were out of the  mainstream; they were ideologues with an ax to grind that was  potentially detrimental to rights and liberties.\n\nMr. Bove is in a different category. Yes, he is conservative. He is  out of the mainstream. But he is corrupt. He is dangerous, vindictive,…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694062/9999"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…The Supreme Court has broadly construed Congress's assigned       power to admit new states and has never interfered with       Congress's admission of a state, even when potentially       legitimate constitutional objections existed. For example, in       1863, Congress admitted into the Union West Virginia, which       had been part of the State of…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696933/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…the policy would disrupt programs       serving disabled and elderly people in New Jersey and       throughout the country. And Medicaid is only one area which       will potentially be affected by Donald Trump's funding       freeze. Please protect Social Security and Medicare for the       hard-working Americans who have earned it. Social Security…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…provides greater Federal  support for small telecommunications companies in rural and  disadvantaged communities to help these companies improve their  networks and remove potentially insecure Chinese network hardware.\n\nSpecifically, this bill directs the National Telecommunications and  Information Administration to provide outreach and technical assistance…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693487/open-ran-outreach-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…Let's be very clear. If you are a Jew, if your family gave their  lives to fight the Nazis in World War II, if you are a minority in any  way, there is nothing, nothing potentially divisive about a swastika.  It is just about the most unmistakable hate symbol in existence.\n\nNow, this is part of an emerging pattern on the right. Young  Republicans were…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698255/nominations"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…increasing the probability of       both being convicted and being imprisoned, and contributes to       the cycle of limiting upward mobility for Black people in       D.C. by potentially hindering employment while jailed.\n\nFurther, the rationale behind reinstituting cash bail is to       protect public safety by ensuring that law enforcement is not…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697021/opposition-letter-by-the-naacp-legal-defense-and-educational-fund-inc-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…the ability to provide for their children. Many fear       being forced to return to a country that remains unsafe and       unstable. Others carry the unbearable guilt of potentially       uprooting U.S.-born children or leaving them behind. For the       Haitian community, this fear is not hypothetical. Haiti's       ongoing political collapse, gang…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699638/expert-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…And the reason for this clause, which was written by the Founders  centuries ago, is so powerfully shown today. At the beginning of our  Nation, we were a small country, potentially influenced by big foreign  powers--England, France.\n\nThe Founders were concerned that our Presidents or other officials  could be bought, could be influenced, could be pressured…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691071/9999"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…terminated--abruptly shuttering clinics,       interrupting supply chains, and cutting patients off from       treatment for deadly diseases, like tuberculosis, risking a       rise in new, potentially untreatable, drug-resistant strains.\n\nAll Global Health programming--aside from HIV--had been       excluded from the Agency's definition of lifesaving. Contrary       to…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691139/us-global-health-programs"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…nationwide. In 2023  alone, SBICs provided $7.2 billion in funding to 1,142 small businesses  and startups.\n\nBy raising the investment cap from 5 percent to 15 percent, we could  potentially triple those numbers in the years to come and drive  revitalization in communities across the country.\n\nI thank Representatives Finstad, McIver, and Garbarino for their…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687919/investing-in-main-street-act-of-2025"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…Congress will fulfill its  constitutional duty or whether we will abdicate our responsibility and  allow this President to commit American military resources,  credibility, and, potentially, American lives to an open-ended  entanglement without authorization or accountability.\n\nI urge my colleagues to support this resolution.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698780/venezuela"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…a non-agency party's       right to receive notice of potential agency action and to       submit information to the agency to inform the agency's       determination and potentially affect the outcome of the       proceeding. Therefore, the rules establishing or       rescinding those procedures substantially affected the       rights or obligations…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694840/government-accountability-office-legal-opinion"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…city in the middle of the hot Florida summer, hot sun, where folks  are not getting enough food. Detainees are exposed to the heat, and  wildlife, and mosquitoes that can potentially carry disease. They are  being stripped of their civil rights, and as of this past Saturday,  they have been cut off from legal counsel.\n\nWhile this humanitarian nightmare…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693654/internment-camp-in-the-florida-everglades"}, {"senator": "Troy Balderson", "party": "Republican", "sentence": "…once every 5 years.\n\nOver time, certain foreign producers have deliberately evaded safety  and regulatory standards to gain a competitive advantage over domestic  producers, potentially jeopardizing public safety in the process.\n\nThis bill ensures that PHMSA has the necessary tools to conduct more  frequent inspections at foreign manufacturing facilities…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692180/compressed-gas-cylinder-safety-and-oversight-improvements-act-of-2025"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…you another example. Over the weekend, the President--the  question yesterday had to do with Chair Powell. I made the statement  that I felt like now that the Fed Chair is potentially under  indictment, I will not support any vote for any Fed Board member until  this matter is decided. Why? Well, because the whole argument about Fed  independence comes…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699082/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…to ensure that these heinous individuals are  prosecuted.\n\nThe conduct of groups such as the 764 network do not always fit  neatly into existing criminal statutes, which potentially jeopardizes  prosecutions.\n\nThe Coercion and Sexual Abuse Free Environment Act, CSAFE,  criminalizes compelling or enticing a minor to engage in self-harm,  engage in animal…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698880/coercion-and-sexual-abuse-free-environment-act"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…out. A private cause of  action would strip it out.\n\nI live in America. We all live in America. If you cannot hold your  government accountable for violating your rights or potentially  violating your rights, you have a very dangerous government. I am no  better than anybody else, but I am certainly--hell--no worse than  anybody else. So I want to know…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699105/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…week by advancing the DETERRENT Act, to protect our higher  education institutions from foreign influence by strengthening gift and  contract disclosure requirements and potentially banning contracts from  foreign entities of concern.\n\nI applaud  Michael Baumgartner, a new freshman out of Washington, for  his work on this important bill.\n\nWe are also…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689152/advancing-america-first-policies"}, {"senator": "John Thune", "party": "Republican", "sentence": "…address bird flu and its effect on the egg  supply have had a positive impact. And the Agriculture appropriations  bill continues efforts to combat bird flu as well as other potentially  devastating threats like chronic wasting disease and the New World  screwworm.\n\nNutrition is another important part of agriculture policy, and the  bill that has been reported…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693501/agriculture-appropriations"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…watch C-SPAN. Sometimes I am worried there is not even  14--if you ever have a curiosity, if you really care about saving the  Republic, I would argue what takes us down is potentially the bond  market. If we keep borrowing like this, the bond market is going to  start running this country.\n\nGo to the Joint Economic Committee Republicans' website. We put…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699674/united-states-fiscal-situation"}, {"senator": "Craig Goldman", "party": "Republican", "sentence": "…these costs would be passed on to consumers, increasing food and  beverage prices nationwide.\n\nBeyond the financial strain, the rule would force manufacturers into  costly,  potentially unfeasible redesigns of refrigeration equipment. The Biden  administration failed to account for real-world conditions, including  how frequently refrigerators are used…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689126/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "French Hill", "party": "Republican", "sentence": "…were aware their balance wouldn't cover a transaction preferred paying  the overdraft fee rather than having their transaction declined. Not  only is it inconvenient or potentially embarrassing in a particular  situation, but it is also fundamental to in-between paycheck cash flow.  They are making the decision to go into overdraft so they make that…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689849/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Tony Wied", "party": "Republican", "sentence": "…uniquely sensitive to any amount of ice and snow that  accumulates on the airframe, causing irregularities that add weight,  interrupt airflow, and can come loose during flight, potentially  damaging critical flight systems.\n\nBy clarifying that these storage facilities qualify for Federal  Airport Improvement Program funding, the FROST Act empowers airports…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695009/facility-for-runway-operations-and-safe-transportation-act"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…Publication.--The Commandant shall make the inventory       established under subsection (a) publicly available on a       website of the Coast Guard.\n\n``(d) Reporting of Potentially Abandoned Vessels.--In       carrying out this section, the Commandant shall develop a       process by which--\n\n``(1) a State, Indian Tribe, Native Hawaiian organization,…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…has  adequate resources, and if the Department of Justice doesn't,  organizations across the Nation helping survivors and helping victims  of crime are at serious risk of potentially closing their doors and not  being able to continue this help.\n\nThe Department of Justice shouldn't allow the mistakes of the Biden  administration to happen again.", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689937/national-crime-victims-rights-week"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…in the first year,  is a cost that is basically triple what was originally projected. Think  what that is going to look like over the next 10 years. We are talking  about potentially hundreds of billions of dollars that could be going  toward Medi-Cal for our own residents that is instead going toward a  reckless policy that exists nowhere else in the…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…back against the CFPB's 1071 rule, which mandated that  lenders collect and report demographic and financial data on small  business loan applications, raising costs and potentially limiting  access to capital.\n\nTo ensure we are hearing directly from those affected, the Small  Business Administration has also now launched recently a red tape  hotline,…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690760/national-small-business-week"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…witnesses emphasized the importance of export controls,  controlling what technology goes from the United States into China,  where they can then use that to compete with us and potentially even  beat us in the AI race.\n\nOne quoted a senior executive at a Chinese AI firm, who said that  Chinese companies have to use two to four times the computing power to…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697555/china"}]