[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…for their origins. It means learning from  our history and charting a more equitable course for the future. It  means justice that applies equally to the powerful and the powerless.  It means scientists free to pursue truth without fear. It means  alliances that multiply our influence instead of isolation that  diminishes it. It means an America where…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700133/climate-change"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…actions by persuading a Republican  Commissioner to join them. But if the President is allowed to  unilaterally dismiss Commissioners, even Republican Commissioners would  be powerless to stand up to the White House if ordered to take an  illegal action at the expense of consumers because the President could  fire them as well. Ultimately, removing the…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1689985/confirmation-of-mark-meador"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…Hartford, we are looking at a kind of  desperation and sorrow that is unique--that is unique that also  comes with not just losing a loved one to gun violence but feeling  powerless in that exercise.\n\nMr. MURPHY. Feeling like there was nothing you could do and watching  your elected leader stand by and allow for this reality to continue to  occur in…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689306/privileges-of-the-floor"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…it happening  to a U.S. Senator. Here is what it is about: If they will do this to a  sitting U.S. Senator in front of a room full of media, imagine what is  being done to powerless people in secret.\n\nIn Portland, in my hometown, we have had firsthand experience with  this kind of activity--faceless, unidentifiable agents with guns  staring down peaceful…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692429/alex-padilla"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…is not about partisanship. This is about whether the United  States Congress will side with survivors or with abusers. Will we  protect the powerful or will we protect the powerless?\n\nTrump threatens Republican Members who demand justice in this matter.  Like Epstein survivors, the majority are now terrorized by men in power  to stay silent. I know that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695278/jeffrey-epsteins-abuse"}, {"senator": "Rick Larsen", "party": "Democrat", "sentence": "…administration has already acted to slash Federal funding for clean  water and eliminate agency staff. This bill compounds those efforts and  will leave Federal agencies powerless to fulfill their responsibilities  under the Clean Water Act.\n\nSecond, the bill undermines the partnership that the Federal  Government has with States and Tribes to prevent…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698022/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…address such abuses  online and protect their users but, nevertheless, victims report great  difficulty in getting such images removed from the internet. They tell  us they feel powerless as it spreads or even resurfaces years later.\n\nThe TAKE IT DOWN Act will require social media and other online  public platforms to provide a mechanism for people to notify…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690185/tools-to-address-known-exploitation-by-immobilizing-technological-deepfakes-on-websites-and-networks-act"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…country. Unlimited spending in politics has corroded our democracy.  It has bred cynicism and nihilism in the political process. It has made  Americans feel disenfranchised and powerless. It says to every  American, your voice doesn't count unless you can pay to play.\n\nMr. Speaker, we have a political system where any company or any rich  person can pay for…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693551/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "…Congress and the American people. Now, amid a buildup of forces in the  Caribbean, the administration is even reportedly considering action  against Venezuela itself.\n\nWe are not powerless against this lawlessness. That is why I rise  today in support of this resolution.\n\nI rise because no President can unilaterally decide to use our  military to target or…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696566/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…troops and college sports teams, in summer  camps, anywhere the powerful and the rich believe they have the  opportunity and the impunity to exploit the young, the poor, the  powerless, and the vulnerable.\n\nWe must face the truth and find the coconspirators still at large in  one of America's most extensive and sophisticated sex trafficking and  child abuse…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696807/epstein-files-transparency-act"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…constitutional crisis  on our hands?\n\nMr. Speaker, this bill makes it easier for the President's actions to  go unchecked. By blocking nationwide injunctions, people will be  powerless to quickly stop illegal and unconstitutional actions.\n\nThis bill is simply another loyalty bill for the President, up there  with naming airports after him or putting his…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689723/no-rogue-rulings-act-of-2025"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…decision allows those companies that are swimming in money  right now to be able to write an unlimited check into this next  election.\n\nSo you can understand why people feel powerless today, why people  feel like this whole system is rigged because even if they give $25, it  just doesn't make a difference when a handful of companies can, with  the snap…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699117/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…and held civilly  liable for the damages.\n\nImagine losing control of your own likeness and identity. Imagine  that happening to you when you are in high school. Imagine how  powerless victims feel when they cannot remove illicit conduct, cannot  prevent it from being reproduced repeatedly, and cannot prevent new  images from being created. The consequences…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698999/disrupt-explicit-forged-images-and-non-consensual-edits-act-of-2025"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…Bladen, Nebraska, says:  ``Any time our country gets involved with any sort of tariffs that  affect the agriculture industry, every farmer just kind of groans about  that. We're powerless to do anything except take what comes out in the  wash.''\n\nHere is Travis Johnson, who farms cotton, sorghum, and corn in Texas'  Rio Grande Valley. He says: ``There's a…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690601/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…Hamer fought  against, that our dear friend and beloved colleague John Lewis fought  against, I continue to look to the civil rights movement as a reminder  that we are not powerless.\n\nOur voices and our role as legislators in this body give us all the  tools that we need to speak up, to stand up, and to fight back for  Black America and for all of America.…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687898/black-history-month"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…objected to leaving the poor to an extensive network of  charities. They solved our healthcare inequalities with highly  subsidized and mandated coverage that leaves consumers powerless to  choose their own best options while severing the connection between the  patient and the payer.\n\nWhen somebody else is paying the bill, the patient doesn't care about…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697036/government-is-still-the-problem"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…assault,  that today, we see you. This fight and this vote tonight, I see it is  about the Epstein victims, but it is about much more than the Epstein  victims. This is about the powerless taking power away from the very  powerful. This is about giving women who never had a voice a voice,  giving a voice to the voiceless.\n\nThis is about their sacrifice. This…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696901/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision-providing-for-consideration-of-h-con-res-denouncing-the-horrors-of-socialism-providing-for-consideration-of-hr-unlocking-our-domestic-lng-potential-act-of-providing-for-consideration-of-hr-researching-efficient-federal-improvements-for-necessary-energy-refining-act-providing-for-consideration-of-hr-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-providing-for-consideration-of-hr-district-of-columbia-cash-bail-reform-act-of-and-for-other-purposes"}]