[{"senator": "Joe Courtney", "party": "Democrat", "sentence": "During the televised gathering, he veered off topic and rambled on  one of his pet peeves, wind power.", "title": "China is Not Scamming Europe and United States on Wind Power", "date": "2026-01-13"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "Because of the power of the fossil fuel industry, that just got shoved  through here.", "title": "H.J. Res. 88", "date": "2025-05-21"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "It is an  abuse of power and a dangerous escalation that will only destabilize  our communities and hurt protesters.", "title": "Violations of Rights By Ice", "date": "2025-06-12"}, {"senator": "Katherine Clark", "party": "Democrat", "sentence": "When you destroy our capacity to address famine,  control disease, and build infrastructure in developing nations, you  are ceding our power to our rivals.", "title": "Rescissions Act of 2025", "date": "2025-06-12"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "Speaker, why did the Framers vest the power to  declare war in Congress alone?", "title": "Removal of the Use of United States Forces for Hostilities Within or Against Venezuela", "date": "2025-12-17"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "Instead, we have a White House filled with charlatans, con men, snake  oil salesmen, grifters, billionaires, and criminals, all using the  power of the Federal Government to enrich themselves at the expense of  the American  people and to punish their political opponents.", "title": "Providing for Consideration of H.R. Gulf of America Act; and Providing for Consideration of H.R. Dhs Restrictions on Confucius Institutes and Chinese Entities of Concern Act", "date": "2025-05-06"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "They love power.", "title": "Denouncing the Horrors of Socialism", "date": "2025-11-21"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "It protects  law enforcement who act in good faith, while ensuring that those who  abuse their power cannot hide behind a doctrine that was never intended  to excuse misconduct.", "title": "Upholding Rule of Law for Federal Officers", "date": "2026-02-04"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "Speaker, contained in this rule are two immigration bills, one of  which Congress has already passed, another of which directs the  administration to do something they already have the power to do.", "title": "Providing for Consideration of H.R. Military Construction, Veterans Affairs, and Related Agencies Appropriations Act, Providing for Consideration of H.R. Special Interest Alien Reporting Act of Providing for Consideration of H.R. Jeremy and Angel Seay and Sergeant Brandon Mendoza Protect Our Communities From Duis Act of and Providing for Consideration of H. Res. Condemning the Violent June 2025 Riots in Los Angeles, California", "date": "2025-06-24"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "And we do that not just because we are  the indispensable Nation and that is the right and moral thing to do-- although that would be enough--but also because projecting power in all  of its forms is smart, it is strategic, and it makes us more safe and  more competitive.", "title": "-9999", "date": "2026-02-04"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "For the sake of power, they are destroying an enterprise       that added more than 30 years to U.S.", "title": "U.S. Global Health Programs", "date": "2025-05-13"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "It is about an administration using the  power of the Federal Government to bully the press, going so far as to  ban reporters from the Oval Office for refusing to go along with this  charade.", "title": "Gulf of America Act", "date": "2025-05-08"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "Speaker, this administration has thrown out the  Constitution and asserted that the President has king-like power to  arrest anybody in this country and deport them, even to a foreign  prison for life, with no due process.", "title": "Trump Immigration Policies", "date": "2025-04-30"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "It is a terrible development  in our democracy where the checks and balances that were essential to  the well-being of our country, with the tug-of-war that goes on in  every generation about what is the right policy; the tug-of-war that  goes on in every generation with competing efforts to get more power in  either the judiciary, the executive, or the Congress; the checks and  balances system that we have where a check we have, as U.S.", "title": "Directing the Removal of United States Armed Forces From Hostilities Within or Against Venezuela That Have Not Been Authorized By Congress--", "date": "2025-11-06"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "Making these progrowth provisions  permanent empowers businesses to continue investing, innovating, and  creating jobs,  while also ensuring Utah families can keep more of their hard-earned  money and better manage their financial responsibilities.''\n\nThe One Big Beautiful Bill Act is also critical to innovative  national security-focused companies in Utah, such as Northrop Grumman  and Vector, which I had the opportunity to tour during the August work  period.", "title": "Promises Made, Promises Kept", "date": null}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "``(iv) Exemptions.--For purposes of applying section 552b       of title 5, United States Code, to any portion of a meeting       of the Board, and to any information pertaining to such       portion of a meeting, the Board may make a determination in       accordance with such section not to disclose to the public       under such section the following information:\n\n``(I) Information containing or relating to power       availability requests.", "title": "Tennessee Valley Authority Transparency Act of 2025", "date": "2025-06-09"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "As chairman of the House Committee on Energy and Commerce, one of my  top priorities is ensuring that America has the energy needed to win  the race for AI against China and power our future.", "title": "Promises Made, Promises Kept", "date": null}, {"senator": "John Hoeven", "party": "Republican", "sentence": "North Dakota is an energy powerhouse and the third largest oil- producing State in the Nation.", "title": "National Defense Authorization Act for Fiscal Year 2026", "date": "2025-10-08"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "Knowle[d]ge will for ever govern       ignorance: and a people who mean to be their own Governours,       must arm themselves with the power which knowledge gives.", "title": "Senate Resolution 259--Recognizing June As the 39th Anniversary of C-Span Chronicling Democracy in the Senate", "date": "2025-06-02"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "We are in awe of the  tremendous power of the Article I branch, and we want to give  encouragement and inspiration to the next generation as we are looking  back on 250 years.", "title": "-9999", "date": "2025-12-15"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "This  gave the Oversight Committee's investigation the full weight of the  House of Representatives behind the committee's existing subpoena  power.", "title": "Providing for Consideration of S.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Bureau of Land Management Relating to ``National Petroleum Reserve in Alaska Integrated Activity Plan Record of Decision''; Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Bureau of Land Management Relating to ``Buffalo Field Office Record of Decision and Approved Resource Management Plan Amendment''; Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Bureau of Land Management Relating to ``Coastal Plain Oil and Gas Leasing Program Record of Decision''; Providing for Consideration of H. Con. Res. Denouncing the Horrors of Socialism; Providing for Consideration of H.R. Unlocking Our Domestic Lng Potential Act of Providing for Consideration of H.R. Researching Efficient Federal Improvements for Necessary Energy Refining Act; Providing for Consideration of H.R. Common-Sense Law Enforcement and Accountability Now in DC Act of Providing for Consideration of H.R. District of Columbia Cash Bail Reform Act of and for Other Purposes", "date": "2025-11-18"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "grid and invest in reliable clean power like battery storage       to meet surging demand.", "title": "National Security", "date": "2025-10-21"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "It powers our homes,  fuels our farms, and drives our economy.", "title": "Promoting Cross-Border Energy Infrastructure Act", "date": null}, {"senator": "Andy Ogles", "party": "Republican", "sentence": "This isn't calling every  Chinese individual a bad actor but is acknowledging the fact that they  are our enemy and not our friend, and they want to supplant us as the  sole world power.", "title": "Defending Education Transparency and Ending Rogue Regimes Engaging in Nefarious Transactions Act", "date": "2025-03-25"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "We have the power to project some  capability in Greenland, and we haven't necessarily put a 75-year  alliance in NATO and dissolving it in the mix.", "title": "Commerce, Justice, Science; Energy and Water Development; and Interior and Environment Appropriations Act, 2026", "date": "2026-01-14"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "I think what we are doing today is we are exercising our Article I  power where an administration abused it and tried to make rules.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the Bureau of Land Management Relating to Public Land Order No. 7917 for Withdrawal of Federal Lands; Cook, Lake, and Saint Louis Counties, Mn", "date": "2026-01-21"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "I know that my friend from Louisiana, a devout  Catholic, a devout believer in the healing power and the grace of our  Saviour, I know that he, like I, believe in the power of forgiveness  and being able to work to rehabilitate and that we are called to do  that.", "title": "People Are Sick and Tired", "date": null}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "The United Way brings people together, nonprofits, businesses,  volunteers, and donors, with the common goal to improve lives by  mobilizing the caring power of communities worldwide to advance a  common good.", "title": "Recognizing United Way of the Bradford Area", "date": "2025-06-04"}]