[{"senator": "Maggie Hassan", "party": "Democrat", "sentence": "…taxes on his citizens, a  President who withholds the people's tax money already appropriated by  Congress based on his latest whim. The power of the purse is now the  power of the President because the majority in this body refuses to  stand up to him.\n\nOur Founders didn't draft a Constitution in order to build a more  perfect Union only to one day have…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698503/9999"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…does not understand how it all works.\n\nWe are in danger of him because they and him--the President and the  Republican Party--simply want to be in control. They love power. The  President loves Putin. The President likes Kim Jong Un. He likes having  a parade with  all of the military to show he is in control. He comes up with policies  that give him…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697150/denouncing-the-horrors-of-socialism"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…President, who as Commander in Chief is responsible for executing  on that declaration.\n\nThe Framers of the Constitution did understand one thing about the  President's power, which is the President as Commander in Chief should  defend the Nation. The President always has the ability to defend the  United States without asking Congress's permission.\n\nBack in…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692637/war-powers-resolution"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…subjugate us all if they could.\n\nGod stop us if we become the thug, if we become the dictatorship that  uses our economic and military strength to bully this world.\n\nThe power of any President is not about what one man thinks is moral.  It is guided by constitutional limitations, including three branches of  government, not a dominant dictator and a subservient…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698929/greenland"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…this rule further erodes the system of  checks and balances that has served our democracy so well. Republicans,  through it, are surrendering more and more unrestrained power to  President Trump. This rule is but another step on the march to tyranny.\n\nTrump is seeking to create a master file of information on every  single American, a digital ID tracking…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695526/providing-for-consideration-of-hr-dc-criminal-reforms-to-immediately-make-everyone-safe-act-providing-for-consideration-of-hr-district-of-columbia-policing-protection-act-providing-for-consideration-of-hr-lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia-providing-for-consideration-of-hr-district-of-columbia-judicial-nominations-reform-act-providing-for-consideration-of-hr-guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act-providing-for-consideration-of-hr-national-coal-council-reestablishment-act-providing-for-consideration-of-hr-promoting-cross-border-energy-infrastructure-act-and-for-other-purposes"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…Donald Trump is losing in court because he keeps trying to do  unlawful and unconstitutional things, not because of judicial  overreach. This bill a scheme to give more power to the President,  making it easier for him to carry out his illegal actions without  consequence.\n\nI urge my colleagues to reject this bill.", "date": "2025-04-17", "source_url": "https://justfacts.votesmart.org/public-statement/1690122/no-rogue-rulings-act-of-2025"}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "…simply giving himself the power to designate and then to  kill enemies without there being a proper legal review or transparency  for the American people. That is not a power any President should have  alone, and we cannot allow this to proceed under our watch. After all,  it will not be Donald Trump who feels the consequences of further  conflict; it…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696566/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…dehumanized immigrants and their countries of origin since day one of  his political career for matters completely unrelated to public safety.  And since he has been in power to be President, both in his first term  and now this term, he has thrown everything he can at keeping people  out and even rounding people up who he views as the wrong kind of  people,…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699611/9999"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…election, all so he could stay in power. You will remember that he lost  the election, but instead of respecting our Nation's nearly 250-year  history of peaceful transfers of power, President Trump and his allies  launched a pressure campaign to try to install slates of fake electors  to overturn the election results in several key States.\n\nWhile Senators were…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699110/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…power to stop it. Article I of the  Constitution says Congress has the power to levy tariffs, but what is  the Republican majority doing?\n\nThey are ceding all their power to this President and completely  disregarding their constitutional duty and the outcries from small  business owners who are warning us they will have to close their doors  in a matter…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692067/capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…Republicans or Democrats who observe the elections  every year or the League of Women Voters that the Federal Government  should overturn our Constitution and give this power to the President?\n\nState systems right now are working, and they are not finding  significant voter fraud. States have ways of finding out fraud. That is  how the system works--because…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700198/save-america-act"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…administration is out of control. What we have seen in recent weeks in  L.A. and over the past few months across the country is another  illustration of an outrageous abuse of power by our President and his  Cabinet.\n\nPresident Trump, Deputy Chief of Staff Miller, and Secretary of  Homeland Security Noem have gone too far, letting their hatred of  immigrants overwhelm…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692932/holding-power-accountable"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…one vote short here in the Senate Chamber. It needed 67 votes; it  only got 66.\n\nThen there was: We will do a line-item veto--and that was passed. But  that gave the power to the President to strike down any line.\n\nThe Supreme Court said: No, you can't do that. You can't delegate the  power of the purse. The power of the purse belongs with Congress. So…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689508/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "James Risch", "party": "Republican", "sentence": "…clear that the President not  only may but must act to defend America and Americans at a time or  place that a threat presents itself.\n\nCongress has also spoken on the power of the President in the War  Powers Act. Now, we have heard a lot on the floor today about how  important the Founding Fathers thought declaration of war was. They  were absolutely…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693132/motion-to-discharge-sj-res-59"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…Guess what, Mr. Speaker.\n\nI think President Trump showed in actions, not words, that he was  determined to remove a drug lord, and that is what Nicolas Maduro was,  from power.\n\nThe President doesn't have to let us know every time they go and  arrest somebody who has broken the law. That is exactly what happened  here.\n\nNow I want to talk about illiteracy.…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699369/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…with  the executive power in the body of one person, that no liberty can  exist. They worried about this. They fretted about it. They worried  about having too much power with the President, and so they severely  constricted the power of the Presidency. They said the President  couldn't take us to war; only Congress could. They said the President  couldn't…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690543/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…money-sucking insurance companies; give it to the patient--or something  like that. President Trump has a way with words. So, however you say  it, let's give the patient the power.\n\nBecause President Trump endorses it, though, I do think that  Republicans will by and large support it, that there will be a vote in  the House of Representatives, and that there is…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697554/healthcare"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…abdicate its role in the  decisions of war and peace, and no Congressman of any self-respect will  argue otherwise.\n\nOur leaders debated fully whether or not to grant this power to the  President. To a man, from Jefferson to Hamilton, the spectrum of our  Founding Fathers, they all agreed with the words that Madison wrote  that the executive is the branch most…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698611/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}]