[{"senator": "André Carson", "party": "Democrat", "sentence": "…either born in the Caribbean or have Caribbean ancestry. Among the  many influential Caribbean Americans are: Kamala Harris, the first  African-American Vice President; Colin Powell, the first African- American Secretary of State; Eric Holder, the first African-American  Attorney General; Karine Jean-Pierre, the first African-American White  House Press…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693058/introduction-of-resolution-recognizing-the-significance-of-national-caribbean-american-heritage-month"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…electronic monopoly  money. China is buying $300 million, and Abu Dhabi has agreed to buy $2  billion of Trump coin or Trump stablecoin.\n\nIt allows for bailouts by the Fed. Jerome Powell won't bail out Trump  coin, but the next Fed Chair will.\n\nIt allows for the purchase with your U.S. tax dollars of Bitcoin or  Trump coin.\n\nThe third bill says that innovation…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693667/afl-cio-scoring-crypto-bills"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…tweet. As I said before, he  has posted nearly 30 times since midnight. He took credit for a cease- fire which, by this morning, was broken. He attacked Federal Reserve  Chair Powell. He attacked Representative Ocasio-Cortez, and he attacked  Representative Thomas Massie. Again, I think attacking Massie may  replace golf as the President's favorite pastime.…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692813/providing-for-consideration-of-hr-military-construction-veterans-affairs-and-related-agencies-appropriations-act-providing-for-consideration-of-hr-special-interest-alien-reporting-act-of-providing-for-consideration-of-hr-jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-and-providing-for-consideration-of-h-res-condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…Sandven Consulting, LLC; Santulli Schudda       Law Office, LLC; Sarah Ward Law PLLC; Schenck and Long;       Shames & Litwin; Shames & Litwin; Sharma Law PLLC; Sharon       Powell, Powell Law PLLC; Sharp Law Firm, P.A.; Sherry Jones,       P.A.; Shreefer Law Firm, LLC; Silver State Equality; Silvix       Resources.\n\nSocial Justice Legal Foundation; Society…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689713/no-rogue-rulings-act-of-2025"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…about. There is a lot we  don't know about because cryptocurrency literally means hidden money.\n\nIt allows for bailouts under section 13(3) of the Federal Reserve  Act. Jay Powell won't do it, but the next guy will.\n\nCongress won't stop him because crypto spends more in super-PAC than  any other industry by far, five times more than the combination of…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693774/digital-asset-market-clarity-act-of-2025"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…week, the President launched a global trade war against the rest  of the world, including our friends, resulting in a record 2-day loss  of $6.6 trillion in wealth. Fed Chair Powell warned that these tariffs  will lead to higher inflation and job losses.\n\nLater today, Republicans will try to pass the President's budget that  is loaded with $7 trillion…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689953/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…selling to a  hedge fund or a billionaire, you have to mark your property down; you  have to sell it for cheap because there simply isn't a mortgage  available for it.\n\nJay Powell, who is useless on climate but knows a little bit about  mortgages and markets and the economy, has predicted that whole regions  of the United States will shortly be unmortgageable.…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699613/9999"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…issued a statement saying:\n\nThe Fed is finally taking actionable steps to do what we       have been asking them to do       for 2 years, and we are pleased to see Chairman Powell       announce steps toward making a digital dollar a reality.\n\nI ask the gentleman: What changed?\n\nWe need more research. We need to learn more, so we need to vote  ``no''…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693736/anti-cbdc-surveillance-state-act"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "Mrs. BEATTY. Mr. Speaker, I rise today to recognize Chair Jerome  Powell, who has served with honor and integrity on the Federal  Reserve's Board of Governors for 13 years.\n\nMr. Speaker, I rise and join Democrats, Republicans, and other  leaders…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699024/recognizing-jerome-powell"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…this bill contains a provision maintaining the eligibility  of stablecoins for bailouts under a facility created under section  13(3) of the Federal Reserve Act. Now, Jerome Powell won't bail out  stablecoin, but the next guy will.\n\nStablecoin marketers are going to tell investors that if they ever  have a problem they are going to get bailed out. After…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693831/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…United States, fundamentally disagree with President Donald J. Trump.\n\nMr. Speaker, I want Mr. Pete Hegseth to know that diversity is legal  in the United States military. Colin Powell was an affirmative action  general. We should tell the truth about it. He came through under the  Carter administration.\n\nMr. Speaker, I thank Congressman Fields for this Special…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690321/ending-of-dei-programs-through-executive-order"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…some of the climate economic  catastrophe warnings that are out there:\n\n[C]limate change could reduce the level of global GDP per       capita by 10-20%.\n\nThis is Fed Chair Powell. He is on my sheet right here: In 10 or 15  years, there  are going to be regions of the country where you can't get a mortgage.\n\nWhy is that? Because in those regions of the…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697077/climate-change"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…smugglers. But saber-rattling and military  escalations are a poor substitute--a poor substitute--for a real  counternarcotics strategy.\n\nI ask my colleagues: Remember what Colin Powell used to say about  military force? You break it; you own it.\n\nIt is the old Pottery Barn rule.\n\nThis is the danger of unilateral attacks against Venezuela. If we  break it,…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696558/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "…second did I feel like I was  getting some bad information from the battle group or from anybody  above in the chain of command, whether it was General Schwarzkopf or  Colin Powell or the President of the United States, George Herbert  Walker Bush. It was not a concern of ours. It is a concern today.\n\nAnd I can tell you, as I watch this from my vantage…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696346/trump-administration"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…2025, Arlington National Cemetery  erased from its website educational materials about the history of  Black servicemembers, including the Tuskegee Airmen and General Colin  Powell, the first Black Joint Chiefs chairman.\n\nWhy are they erasing these people from the website and not anybody  else? We know why.\n\nLet me be clear: The White House and the so-called…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699863/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…gets worse.\n\nLet me give you an example of where I think it is getting bad.\n\nOn a Sunday night, about a month or so ago, I saw a report that the  Chair of the Fed Board Jerome Powell was being investigated by the DOJ.  We all know the President's frustration with Chair Powell. I have got  some frustration with him too. I am an armchair quarterback. There…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700062/9999"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…visitors  ceramics, fiber art, jewelry, paintings, photography, woodworking, and  other handcrafted pieces that reflect the creative spirit of our  region.\n\nArtists like Randee Powell and Sharon Saseen speak to the sense of  family and shared purpose that defines Gallery 209.\n\nAs Savannah continues to grow, Gallery 209 stands as a reminder that  local art…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698926/recognizing-riverview-hotels-110th-anniversary"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…America\n\nMr. BAUMGARTNER. Mr. Speaker, I rise today to honor Scouts Across  America. Scouts Across America carries forward with a remarkable legacy  that began with Robert Baden-Powell, a British Army officer whose  simple idea was that outdoor skills, teamwork, and service could build  better citizens and a better world.\n\nRobert Baden-Powell served with…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697297/recognizing-ron-hauenstein"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…our public lands. The State of Utah compared  the decision to limit off-highway vehicles while still allowing for  conventional vehicles as akin to designating parts of Lake Powell  exclusively for yachts while restricting more accessible fishing boats  and kayaks to less desirable sections of the lake.\n\nIn totality, this rule ensures that only the most…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690405/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…in  opposing Central Bank Digital Currency, but we should deal with that  fully here.\n\nOn March 8, 2023, in a dialogue with Chairman Hill, Federal Reserve  Chairman Jerome Powell said that they would need congressional approval  for a retail CBDC, but he went on to explain that you could have a  layered CBDC. They are building just that at the Federal…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693835/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…better than they found it. Scouting  America has helped build future leaders by combining educational  activities and lifelong values with fun. Scouting founder, Lord Baden- Powell of England, defined Scouting as a game with a purpose. Through  over a century of experience, we know that helping youth is a key to  building a more conscientious, responsible,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699723/national-scouting-day"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "Mr. ARRINGTON. Mr. Speaker, it is a great honor and delight to hear  the familiar voice of my pastor, Elliott Powell, opening up the  people's House with prayer, a tradition that began at the very first  Congress in 1789.\n\nReverend Powell is the pastor of Westminster Presbyterian Church in…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695810/welcoming-rev-elliott-j-powell"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…11, 2026, the Noon Optimist Club of Lima will recognize  Andrew Baldauf, Vivian Elrod, Sheldyn Fetter, Daniela Garcia, Jackson  Niesen, Emersyn Painter, Eli Pohlman, Russell Powell, Aniya Prowant,  Michael Sherrick, Alexandria Weber, and Laila Woods at its annual youth  appreciation luncheon. These students were each nominated by their  schools for being…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699533/recognizing-the-lima-noon-optimist-clubs-annual-youth-appreciation-luncheon"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…President that  this was a viable path. It doesn't make sense.\n\nI will give you another example. Over the weekend, the President--the  question yesterday had to do with Chair Powell. I made the statement  that I felt like now that the Fed Chair is potentially under  indictment, I will not support any vote for any Fed Board member until  this matter is…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699082/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}]