[{"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…bills are surging; electric bills are up 13  percent; and residential gas prices are up nearly 60 percent. This  administration canceled clean energy projects that could have powered  13 million homes, destroying 165,000 jobs in the process.\n\nBehind every statistic is a family that is now experiencing hardship  due to these reckless and painful policies.…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699586/stop-the-republican-affordability-crisis"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…year under the Trump administration, this rogue agency  has engaged in an unrestrained crusade of cruelty against our migrant  neighbors and the places they call home, all powered by the $85 billion  and counting hand-delivered to them by Republicans in Congress and  their overlord in the White House, all conducted with immunity granted  not by law…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699655/horrific-ice-abuses"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…nationwide, you can lead on this issue by       advancing H.R. 973 as soon as possible.\n\nIn recent years, New York City has seen a proliferation of       lithium-ion battery-powered micromobility devices, such as       electronic bicycles, mopeds, and scooters. Many New Yorkers,       including numerous delivery workers, rely on these devices as…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690260/setting-consumer-standards-for-lithium-ion-batteries-act"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…to shut down a grant that would help some of those       families with       child care. The irony is staggering. This is all while       also creating a renewable, energy-powered refuge that will       protect our most vulnerable residents during extreme       weather events like wildfires and winter storms. When the       lights go out and the community…", "date": "2025-07-09", "source_url": "https://justfacts.votesmart.org/public-statement/1693322/greenhouse-gas-reduction-fund"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…country that we are finally seeing--because  the reality is that electricity is what powers our communities, our  innovation, our economies, and our lives. And electricity has powered  this country since the 1880s.\n\nBut, right now, we are facing an energy crisis of the Trump  administration's own making. First, electricity is becoming  prohibitively expensive.…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698581/permitting-reform"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…Samsung's Solve for Tomorrow STEM  competition.\n\nThese brilliant students, who I met with last week, tackled  Delaware's physician shortage with an innovative solution: an AI- powered smart bandage that monitors wound healing in real time.\n\nTheir project, called AKQUA-Gel, rose to the top from thousands of  entries nationwide, earning their school a $100,000…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690741/united-states-postal-service-is-not-just-a-convenience"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…bills. That is particularly  problematic to the neighbors back home I represent in the State of  Florida. The State of Florida, the Sunshine State, you would think  would be powered by the sun, Mr. Speaker, but we are 75 percent reliant  on gas to generate electricity.\n\nNow, Mr. Speaker, you are saying: Okay, Floridians, you are already  being crushed…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697080/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…works  best for them. Despite what has been suggested, this rule never  required 100 percent zero-emission vehicle sales for any class of  truck.\n\nBoth new and used diesel-powered trucks, buses, and vans will be  available for purchase in California and elsewhere in our United  States. The rule also includes numerous flexibility measures to help  auto…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690480/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…mandates across nearly 30 percent of the U.S. market. While that may  work for California, it isn't working in some other States.\n\nLet me be clear. This is not the time to ban gas-powered vehicles.  CARB and Governors must be able to adjust these programs if market  conditions change. Maryland Governor Wes Moore recently did just that,  easing compliance enforcement.…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690490/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…currently classified as       firearms under federal law and, therefore, subject to       important and long-standing public safety protections. In       doing so, these high-powered ``less-than-lethal'' devices       would become available to the general public and prohibited       persons alike without these protections all because this       legislation…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700034/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…risks and dangers are simply  treated as if they don't exist because of a different monetization--the  monetization of our politics defending a $700 billion annual subsidy,  powered by unlimited dark money spending. The fossil fuel industry and  its vast array of front groups have used the power of money in politics  to strangle this discussion.\n\nIn our…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699613/9999"}, {"senator": "Eric Sorensen", "party": "Democrat", "sentence": "…MetroLINK assumed operation in  1998 under the direction of CEO Jeff Nelson, the Channel Cat has grown  tremendously. Federal grants have helped fund three ADA-accessible  vessels powered by biodiesel, construction of improved riverfront  docks, and even plans for future electric ferries.\n\nThe Channel Cat has provided over one million rides, giving residents…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691090/recognizing-the-30th-anniversary-of-the-channel-cat-passenger-ferryboat-service-in-the-quad-cities"}, {"senator": "Katherine Clark", "party": "Democrat", "sentence": "…has been a  constant and joyful guiding light.\n\nFrom the longest speech in House history to the longest vote, Allison  has skillfully navigated the unprecedented.\n\nShe has powered through all-nighters with a smile, with pride, and  always with helpful information, because above all, she is driven by a  love of country, a love of justice, and a love…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695729/farewell-allison-blankenship"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…another Chinese firms have announced  that they will soon be selling EVs that can recharge in 5 minutes to  travel as much as 320 miles--equivalent to a typical traditional gas- powered car. Another Chinese battery firm has announced the development  of a battery they claim will be able to go 3,000 kilometers on only a  5-minute charge.\n\nNow, not everyone…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694959/highlighting-advances-in-chinese-electric-vehicle-technology-and-the-need-for-american-investment-in-battery-technology"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…possessing       firearms, immediately upon their release from prison these       individuals would legally be permitted under federal law to       acquire TASERs and other high-powered ``less-than-lethal       projectile devices'' that today are classified as       firearms. Moreover, once they obtained such weapons, there       would be no barrier in federal…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700033/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…security partnership.\n\nSince its inception in 2021, AUKUS has been key to our collective  defense strategy, promoting cooperation on cutting-edge technologies  like nuclear-powered submarines, artificial intelligence, and  hypersonic systems.\n\nUnfortunately, outdated export controls and bureaucratic hurdles  currently hinder the efficient sharing of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694782/aukus-reform-for-military-optimization-and-review-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "Mr. KILEY of California. Madam Speaker, today, I am presenting a  resolution I have sponsored under the Congressional Review Act to  reverse California's ban on gas-powered vehicles, to stop a single  individual, Gavin Newsom, from dictating what tens of millions of  Californians and other Americans are allowed to drive.\n\nMadam Speaker, let me…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690484/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "…dams, Wilson Dam supports TVA's mission of providing low-cost, reliable  power, flood control, and navigation of the Tennessee River. Over the  past 100 years, Wilson Dam has powered communities, enabled river  commerce, and driven economic growth throughout the Tennessee Valley.\n\nLocated in Florence, Alabama, Wilson Dam has 21 generating units,  capable…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695404/recognizing-wilson-dam-on-its-100th-anniversary"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…recognized the  problem and set out to find innovative and low-impact solutions to this  growing concern.\n\nIn their search, the team discovered BEBOT, the first battery- and  solar-powered beach-cleaning robot on the West Coast. Through funding  provided by the North Tahoe Community Alliance, the team was able to  successfully deploy BEBOT to the shores of Lake…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697549/congratulating-eco-clean-solutions"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…and Representative Moore of Alabama, I  encourage all my colleagues to vote in strong support of my amendment,  which eliminates the general ban on purchasing conventionally powered  vehicles and repeals the statutory preference for EVs and hybrid  nontactical vehicles within the Department of War.\n\nI am grateful to Chairman Rogers for his leadership…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695161/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…world-class coal, clean coal, low-sulfur coal.\n\nThis is Wyoming coal. We need more of it--not less of it--to power  our Nation. It is available, affordable, and reliable. This has powered  our Nation for  over a century. It continues to be a major source of power for our  Nation, and we need it far into the future.\n\nAnd today, to that case, President Trump…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689762/coal"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…resolution, this resolution offered by  my good friend from Pennsylvania (Mr. Joyce) would reverse a waiver  granted by the Biden EPA that allows States to ban the sale of gas- powered vehicles. This EPA rule has legitimate constitutional questions  and would increase costs for Americans and manufacturers.\n\nAmericans deserve to choose the car of their choice.…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690491/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision"}, {"senator": "Michael Rulli", "party": "Republican", "sentence": "…people that they have forgotten.\n\nThey bring up electricity, sir, but they do not allow us to address  power plants. They shut down coal plants. They put regulations on gas- powered generated plants, but then they say there is an electricity  problem.\n\nLet's talk about prices. In my district right now, eggs are $1.29. We  have chicken breast at 99 cents.…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698567/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "…these are actions addressing the Biden administration's good  neighbor rule and Clean Power Plan 2.0. Both of these regulations were  designed to effectively force fossil fuel-powered powerplants to  close--a dangerous goal at a time when we are already running low on  the electricity we need to meet demand. And preventing these Biden-era  rules from going…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689698/energy-regulations"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…direct result of the gentlewoman's leadership on the  issue, and I applaud her for her dedication and her efforts.\n\nTaiwan boasts a resilient and innovation-driven economy powered by  its high-tech industries, robust financial institutions, and dynamic  export sector.\n\nThe island plays a significant role in global supply chains,  particularly in the…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692796/taiwan-non-discrimination-act-of-2025"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…technology  policy, and electricity policy is manufacturing policy.\n\nThere is one source of reliable electricity that has been powering  American industry for many years. Coal-powered generation is a key  baseload resource that even today can protect against upward price  pressures and provide the right type of energy to fuel American  innovation and the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695764/national-coal-council-reestablishment-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…recognized the  problem and set out to find innovative and low-impact solutions to this  growing concern. In their search, the team discovered BEBOT, the first  battery- and solar-powered beach-cleaning robot on the West Coast.  Through funding provided by the North Tahoe Community Alliance, the  team was able to successfully deploy BEBOT to the shores of Lake…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…allow the State to mandate the sale of  zero-emission trucks.\n\nThese bills would repeal the California advanced clean cars waiver  allowing the State to ban the sale of gas-powered vehicles by 2035; put  an end to California's implementation of its most recent nitrogen oxide  engine emission standards, which create burdensome and unworkable  standards…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690387/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…mandates or electric truck mandates or electric  lawnmower mandates. I will soon be introducing a Congressional Review  Act resolution to end Gavin Newsom's plan to ban gas-powered cars in  California.\n\nBeyond that, there are a number of State policies that everyone knows  are causing immense harm and yet remain on the books. So if our State's  leadership…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689211/protecting-medicaid-for-californians"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…including my home State of Pennsylvania.\n\nIf consumers want to purchase an EV, they should be able to, but  Californian politicians have no right to remove the choice to buy a  gas-powered vehicle from my constituents.\n\nThe Biden EPA wrongly allowed California to enact an electric vehicle  mandate that will ultimately affect the entire United States.\n\nWhat works…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690494/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision"}]