[{"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…This bill directs the National Institute of Standards and Technology  to establish and distribute resources on how small businesses can adopt  AI tools and risk management practices. It would build on NIST's Small  Business Cybersecurity Corner program to help small businesses by  providing voluntary guidance on adopting AI and avoiding potential  issues…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700128/small-business-artificial-intelligence-advancement-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…Canada and Mexico.\n\nIt has been clear that in the past, when applied intelligently and  precisely, tariffs can be a useful tool against adversaries that engage  in unfair trade practices that harm American workers. The tariffs  against China years ago are one example of this. But the situation  today is completely different. It makes no sense to start a trade…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688408/joint-session-of-congress"}, {"senator": "André Carson", "party": "Democrat", "sentence": "…rights violations.\n\nMilitias engage in illicit mining activities to finance and sustain  themselves, often exploiting child labor and engaging in environmental  degradation practices that undermine the DRC's economic interests and  international treaty obligations.\n\nMy resolution condemns all acts of violence perpetrated against  ethnic minorities throughout…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699456/reintroduction-of-the-resolution-to-condemn-the-ethnic-violence-in-the-democratic-republic-of-the-congo"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…corporate greed, and the CEOs are  getting rich while working people struggle.\n\nIt is essential that we work together in this body to protect our  communities and ban these practices. I ask my colleagues to please  support my legislation to ban surveillance pricing, digital pricing in  grocery stores. Come and see me. You need to stand with your residents,…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693028/surveillance-pricing-in-grocery-stores"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…established by Congress to create reform in the education  system throughout the country, distribute Federal aid to students and  places of learning, and prohibit discriminatory practices. The  President does not have the authority to dismantle the Department of  Education, and he signed Executive Order 14242, which aims to  ``Improving Education Outcomes…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691079/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…about our own country, about our own government. This is  alarming when an app is the top news source of Americans under the age  of 30. Let me give some examples of these practices.\n\nIn December 2023, Rutgers University found that TikTok's algorithm  disproportionately amplified anti-Israel and, by extension, anti- Semitic content compared with other…", "date": "2025-06-18", "source_url": "https://justfacts.votesmart.org/public-statement/1692683/tiktok"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…5214 would       upend--reflect precisely this kind of thoughtful, data-driven       policymaking. These reforms enjoy broad public support, align       with national best practices, and have contributed to       meaningful gains: D.C.'s crime rate is now the lowest it has       been in 30 years, and violent crime fell 35 percent from 2023       to 2024.…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696985/opposition-letter-by-the-southern-poverty-law-center-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…African-centered organization established for the purpose of educating,  training, and empowering its participants in African-centered rites of  passage, process, rituals, customs, and practices.\n\nIts further purpose is to promote all aspects of healthy growth and  development of individuals, families, and the community of African  descent in Akron, Summit County,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699619/recognizing-akron-rites-of-passage-institute"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "Mr. Speaker, I rise in support of H.R. 3428, a bill to direct the GAO  to review the three Mid-Atlantic River Basin Commissions and report on  the practices and Federal responsibilities of each commission.\n\nThe Mid-Atlantic River Basin Commissions serve an important role in  the region by managing, protecting, and improving their…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695002/mid-atlantic-river-basin-commissions-review-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…American       worker and consumer. But the Japanese semiconductors were a       special case. We had clear evidence that Japanese companies       were engaging in unfair trade practices that violated an       agreement between Japan and the United States. We expect our       trading partners to live up to their agreements. As I've       often said: Our commitment…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696451/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…The ANCHOR Act directs the  National Science Foundation to develop a plan to modernize the Academic  Research Fleet's information technology, including its cybersecurity  practices, to carry out the fleet's mission to deliver critical science  that protects Michigan's Great Lakes.\n\nI urge my colleagues to support this bipartisan bill to secure and…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691439/accelerating-networking-cyberinfrastructure-and-hardware-for-oceanic-research-act"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…Black Americans from slavery  and ensuring their right to vote, and establishing the right of women  and those over 18 to vote, as well--free speech, assembly, and  religious practices for all.\n\nEconomic growth recognizes the buying power of all of our citizens  and the rising tide that allows women, people of color, and those of  every demographic to grow…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693593/dei-policies-build-stronger-future"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…imperiled with these aggressive actions by ICE.  Our citizens are being hurt. Green card holders have gone underground.  Our economy is suffering because of these brutal practices.\n\nLet's dismantle ICE. Let's take a look at these best practices, and  let's move forward as one United States of America.", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699655/horrific-ice-abuses"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…allergens, pesticides,       colors, and food additives, and microbial pathogens such as       E. coli and listeria. I was directly responsible for ensuring       that laboratory practices adhered to proper requirements.       Third-party lab accreditation provides confidence to the       public that testing is performed properly and results are       trustworthy.…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688139/fired-by-president-trump"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…evaluating whether the student is eligible for       services under section 504 of the Rehabilitation Act of 1973       (29 U.S.C. 794); and\n\n(C) encourages the use of best practices designed to       ensure, with respect to concussions, the uniformity of safety       standards, treatment, and management, such as--\n\n(i) disseminating information on concussion…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695777/by-mr-padilla"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…children, which is  the deficit. We have gone from 6.3 percent to 5.9, and exports are at  an all-time high.\n\nNow, what is the issue here? It is not about 301, unfair trade  practices, although there are plenty of grievances against our northern  neighbor in that regard. This isn't about USMCA. The USMCA products  flowing from Canada to the United States…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699974/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…VSOs had their  stipends withheld due to budgetary shortfalls and the National Guard's  operational needs taking priority.\n\nMy amendment will require the DOD to identify best practices and  cost-effective ways to protect the operational needs of our National  Guard while ensuring VSOs are supported in their selfless dedication to  our Nation's heroes.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695238/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…world. He was saying, if you       want the pure truth, look to me.\n\nAt the end of Revelation we see the importance of this       issue when it says that everyone who loves and practices       falsehood is classified with the sexually immoral, murderers       and idolators as being among those who will be damned. Of       course some people occasionally tell…", "date": "2025-08-26", "source_url": "https://justfacts.votesmart.org/public-statement/1694761/recognizing-campbell-the-nature-of-truth-odessa-american"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…to train new CSU members. During the year 2024, John provided  the agency and his community with 1,320.25 volunteer hours. John has  been instrumental in updating forms and practices within the CSU. His  input has been especially helpful in the creation of an electronic  Daily Activity Report, which captures trackable information pertaining  to the calls-for-service…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690801/recognizing-john-wajdowicz"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…illegal immigrants must pay for their  applications so American taxpayers aren't saddled with covering these  costs.\n\nIt protects family farmers.\n\nIt ends abusive financing practices in Medicaid by freezing provider  taxes and prohibiting new provider taxes.\n\nIt reins in the Consumer Financial Protection Bureau, and it rolls  back harmful Biden-era regulations…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692263/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "William Timmons", "party": "Republican", "sentence": "…workforce based on organizational goals, budget       considerations, and staffing needs;\n\n``(B) to provide training to supervisors on the prohibited       personnel practices under section 2302, employee rights, and       the procedures and processes used to enforce employee rights;       and\n\n``(C) under which experienced supervisor mentors are…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698216/federal-supervisor-education-act"}, {"senator": "Laurel Lee", "party": "Republican", "sentence": "…administer  elections.\n\nToday, Congress has the opportunity to build on this momentum and  ensure that these protections are part of our laws, that every State  can follow these  practices, and that voters across the Nation can feel confident in the  integrity and security of their elections.\n\nCongress must commit to supporting election officials and voters…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1689997/safeguard-american-voter-eligibility-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…deepfake pornography.\n\nLast month, I joined a bipartisan group convened by the First Lady.  We heard from young survivors and their parents who were targeted by  those abhorrent practices. I thank the First Lady for her leadership  and for shining a light on this dark and destructive crisis.\n\nI am sad to say that this issue struck close to home with the  heartbreaking…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690182/tools-to-address-known-exploitation-by-immobilizing-technological-deepfakes-on-websites-and-networks-act"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…realize some argue these dollars are not directly paying for  abortions or gender surgeries, but when we give taxpayer handouts like  these, we free up resources for these exact practices.\n\nI do not know how any Republican can support keeping these special  handouts in this bill. While I wish my original amendment was  considered to target the most egregious…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699289/amendment-no-1-offered-by-mr-massie"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…authorities have supported an influx of Han Chinese       economic immigrants into the XUAR, implemented discrimination       against Uyghurs and other minorities in hiring practices, and       provided unequal access to healthcare services.\n\n(7) PRC authorities have manipulated the strategic       objectives of the international war on terror to mask…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694799/uyghur-policy-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…(1) study the short-term and long-term mechanisms that       cause sinkholes, including extreme storm events, prolonged       droughts causing shifts in water management practices,       aquifer depletion, and other major changes in water use; and\n\n(2) develop maps that depict zones that are at greater risk       of sinkhole formation.\n\n(b) Use of…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693479/sinkhole-mapping-act-of-2025"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…of the counterintelligence vulnerabilities of       NASA, if any.\n\nThe assessment shall include the following:\n\n1. An assessment of the vulnerability of the security       practices and facilities of NASA to efforts by nation-state       and non-nation-state actors to acquire United States space       technology.\n\n2. An assessment of the counterintelligence…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698262/explanatory-statement-for-the-intelligence-authorization-act-for-fiscal-year-2026"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…educators in       professional learning opportunities to enhance mathematical       modeling and statistical problem solving knowledge, and       developing training and best practices to provide more       interdisciplinary learning opportunities.\n\n(2) Conducting research on curricula and teaching practices       that empower students to choose the mathematical,…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688976/mathematical-and-statistical-modeling-education-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…win for the first time in 11 years. This team began  the season with a unified goal and put in the work to bring their  vision to life. After a hard-fought season of long practices and  staying focused in school, these athletes, trainers, managers, and  coaches showed dedication, strength, and an unwavering commitment to  victory.\n\nI am proud that their…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693641/congratulating-aledo-bearcats"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…to attract foreign investment from       responsible private-sector entities based in trusted       countries.\n\n(11) Initiatives by other countries to identify best       practices for increasing global competitiveness in attracting       foreign direct investment from responsible private-sector       entities based in trusted countries.\n\n(12) The impact…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692697/global-investment-in-american-jobs-act-of-2025"}]