[{"senator": "Dick Durbin", "party": "Democrat", "sentence": "…know that it is unlikely.  I have seen the votes. I know the party discipline. I have seen it on  my side of the aisle. I am sure it is on the other side of the aisle. I  am praying to God there is going to be one or two John McCains who are  going to step forward and lift their hand enough to vote and save  health insurance for Americans across the board.…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689510/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…after doing that prayer privately  next to his car, he then went into the county meeting. And, suddenly,  everything that had been totally pro forma--someone had seen him  praying, and he suddenly found out the contract wasn't going to be  signed.\n\nThe fact is, this individual has got an extraordinary record of, as I  said, producing affordable housing…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698866/commerce-justice-science-energy-and-water-development-and-interior"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…administration rescinded guidance that would prevent immigration  enforcement in sensitive locations, like schools, hospitals, and houses  of worship.\n\nMr. Speaker, you could be praying at a church or in a synagogue or  temple, and immigration enforcement could bust in to arrest somebody as  they pray to their God. They tried to implement this aggressive…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690851/opposing-illegal-power-grabs"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…Congress. And he is taking the same  position on the floor today, consistent with what he did then.\n\nI am going to conclude and just say this: I know everybody in this  body is praying that the cease-fire that is in place now, for a couple  of days, works and that it holds.\n\nI know everybody is praying that when the administration now says  they are interested…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693124/motion-to-discharge-sj-res-59"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…years.\n\nAs they gathered, they were viciously targeted, ambushed, and  attacked by a man who attempted to burn them alive with Molotov  cocktails and incendiary devices.\n\nWe are praying hard for the 12 victims, several of whom I know  personally. It shocks the conscience that on the eve of the holiday of  Shavuot, our Jewish brothers and sisters were subjected…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691842/in-memory-of-recent-gun-violence-victims"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…protesting and having rubber bullets shot at you.\n\nImagine masked men detaining a 5-year-old who is coming home from  preschool. Imagine being pepper-sprayed as clergy while you are praying  out loud. Imagine tear gas filling your car on your way home from a  basketball game with your children in the backseat and doing CPR on a  6-month-old who stopped breathing.…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699401/9999"}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "…Medicaid not covering their care.\n\nThe Republicans say it won't affect her. Today, if you go to the  children's hospital here in Washington, D.C., and sit with the mother  who is praying over her dying child, who had to quit her job and who  now qualifies for Medicaid expansion, under their bill she will be cut.  Tell her you will not harm her.\n\nUnfortunately,…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692264/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…assassinated, and then people gloat and  celebrate an assassination.\n\nI ask today: What did Mr. Kirk and the victims of 9/11 and the  persons who have died in churches while praying, persons who were  killed as they were praying in various religious institutions, children  who have been murdered in schools, what did they all have in common?  The one thing…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695338/dark-days"}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "…children, arrest elected officials,  ransack apartment buildings, injure journalists, and shoot a priest in  the head with pepper balls for the so-called crime of peacefully  praying for nonviolence. They have even shot two people, leaving one--a  father of two young children--dead, making dubious and unsubstantiated  claims in their attempt to justify…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696180/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…that  Iran has targeted U.S. military bases and U.S. servicemembers in the  Middle East, putting the lives of thousands of Americans at immediate  risk. I join Americans in praying for their safety.\n\nThis afternoon, I asked the Trump administration to immediately  provide a classified briefing, laying out the full threat picture, the  intelligence behind…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692722/iran"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…unacceptable, but it is  not inevitable.\n\nI need just four Republicans, four people of conscience, to listen to  their constituents, to look into the eyes of pregnant mothers praying  for a safe delivery, and to show a shred of humanity and oppose this  horrific bill.\n\nIf my colleagues aren't here to fight for the people who sent them,  they should give…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691443/gop-tax-scam-hurts-women-and-families"}, {"senator": "Josh Harder", "party": "Democrat", "sentence": "…Speaker, I ask for a moment of silence to honor the victims,  including Amari, Susano, Maya, Journey, and their families as they  navigate this tragedy.\n\nMy wife, Pam, and I are praying for the victims, their families, and  our community. We are and always will be Stockton Strong.", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697396/horrific-mass-shooting-in-stockton"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…find its spine and do the right thing for the people of this  country.\n\nI truly cannot comprehend the heartlessness that is required to do  these things like this, and I am praying for all of the victims of this  administration's campaign of terror in my country.\n\nMr. TAKANO. Mr. Speaker, I thank Representative Watson Coleman for  informing the Nation…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690506/trump-immigration-policies"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…strikes. They save lives.\n\nMany of us in this Chamber have witnessed the devastation caused by  natural disasters in our own States, in our own communities. Now,  tonight, I am praying for all those families across Texas, for a safe  return of those who are missing and for those who lost loved ones.\n\nNew Mexico is far too familiar with devastation and destruction…", "date": "2025-07-09", "source_url": "https://justfacts.votesmart.org/public-statement/1693299/9999"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…tragic incident, we do know that when anti- Semitism is rife in the air, all kinds of individuals cling to it and,  sometimes, unfortunately, act on it.\n\nThis morning, I am praying for those who were killed in this  senseless act of violence, all those affected, and their families.", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691653/capital-jewish-museum-shooting"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…determination to see that we move forward in this Congress, not only on  this bill but others to make sure that it doesn't happen to other  families like theirs. We are all praying for that dear family.\n\nMr. Speaker, the heart-wrenching stories we have heard tell us all we  need to know. It is time to send the TAKE IT DOWN Act to the  President's desk…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690182/tools-to-address-known-exploitation-by-immobilizing-technological-deepfakes-on-websites-and-networks-act"}, {"senator": "Mary Miller", "party": "Republican", "sentence": "…to California.\n\nI was deeply saddened to hear of his passing. Mr. Speaker, because  Doug accepted Jesus Christ as his Savior, he is now in the presence of  the Lord.\n\nI am praying for his wife, Jill, and their children. May they receive  comfort from Revelation 21:4 and the promise that: ``He will wipe away  every tear from their eyes, and death shall…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698726/9999"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…staff sergeant in the Air Force,  also from West Virginia, and is 24 years old. He remains hospitalized  in critical condition, fighting for his life.\n\nWe join all Americans in praying for them and their families.\n\nThe terrorist who attacked them was an Afghan national. He is one of  tens of thousands of Afghans who were flown into our country following…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697356/wyoming-servicemembers"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…personal struggles to inspire others toward ministry and  service.\n\nGeorge's personal growth and friendship have left a lasting impact on  the Athens community, with thousands praying for him following the  accident.\n\nMr. Speaker, our hearts ache for this loss. I pray for the  Whittenburg family and all who knew him. May God's perfect plan bring  them comfort.", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699886/mark-burns-inducted-into-living-legends-of-aviation"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…grieves this tragic loss, I am reminded of John  15:13, ``Greater love has no one than this, that someone lay down his  life for his friends.''\n\nMr. Speaker, please join me in praying for Deputy Sikes' wife, Amber,  their daughter, Lyndsey, and all of Brandon's loved ones as they  continue to mourn this fallen hero.\n\nPlease also join me in praying for a…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690553/mourning-the-loss-of-deputy-brandon-sikes-and-praying-for-swift-recovery-for-deputy-gavin-white"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…able to kill a Jew. And then later  screamed at the front door ``Free Palestine.''\n\nThis is anti-Semitism at its worst, and I want my Jewish friends to  be able to know we are praying for you; we are speaking out on your  behalf today; and we have not forgotten. And this kind of hatred and  anti-Semitism cannot continue in America.       Historic Greenwood…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691662/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…pray for Charlie's wife, Erika, who has two  beautiful young children, and his family, friends, and supporters. Last  week, President Trump invited the Nation to commit to praying for the  country for 1 hour a week ahead of our 250th birthday. I would  encourage us to accept that challenge. It is hard to hate someone when  you pray with them and for…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695600/we-are-better-together"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…visiting him at our VA Hospital in Kansas City a few  weeks ago. Although, he is going through these challenges, he has a big  smile on his face.\n\nI will tell Dale that we are praying for him. We are going to make  sure he gets through this and that he gets the best healthcare possible  through the VA system.\n\nMr. Speaker, please join me in thanking Mr.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695704/recognizing-the-funky-buffalo-coffee-house-and-trading-company"}, {"senator": "Gary Palmer", "party": "Republican", "sentence": "…body. I will miss hearing him call me Francis Gary  Powers after the U.S. spy plane pilot who was shot down over Russia and  captured in the 1960s.\n\nMy wife, Ann, and I are praying for God to comfort Doug's wife, Jill;  his children; his family; his staff; and all who, like those who have  gathered in this Chamber this evening, knew and loved Doug LaMalfa.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698735/9999"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…still spinning on this issue. In fact, that year, that  September day, at at least one of those gatherings, the sheriff's  department came out and arrested the students for praying--praying--on  their school campus before class started.\n\nThe result of that was that the next September, a million students  showed up to pray--a million, documented. From…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695773/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…will absolutely encourage  her to get involved in Turning Point when she is just a little bit  older.\n\nTo Charlie's grieving wife Erika and his two beautiful children, we  are praying for you. Just know how grateful we are for Charlie's life  and legacy. I will continue fighting every day for the values that  Charlie believed in: faith, family, and freedom.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695705/expressing-support-for-the-designation-of-october-as-the-national-day-of-remembrance-for-charlie-kirk"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…found it; and, of course, always giving back more than you took.\n\nWe are going to miss him desperately. I join many across the country  who are mourning with his family and praying that justice will be  served.\n\nI am grateful to have known him personally, spending hours speaking  with him at Turning Point USA events and watching how Turning Point has…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695706/expressing-support-for-the-designation-of-october-as-the-national-day-of-remembrance-for-charlie-kirk"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…multigenerational family farm grounded him and his beliefs, making him  an even better advocate for the abundant agricultural producers of  California's First District.\n\nAudrey and I are praying for Doug's loved ones as they grieve through  this tragedy.\n\nPsalm 34:18 says: ``The Lord is close to the brokenhearted; he  rescues those whose spirits are crushed.'' It…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698727/9999"}, {"senator": "Ryan Mackenzie", "party": "Republican", "sentence": "…those who face down the cowardly perpetrators of  destruction with faith and hope as they work to rebuild their nation.\n\nI join the Greater Lehigh Valley Syrian community in praying for the  victims of this attack and for peace to return to Syria. May God bless  all of those who stand up in the face of terror and violence.", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693108/facing-down-perpetrators-of-destruction"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Rhonda is in Heaven looking down on  Thomas, probably laughing at him a little.\n\nI know my colleagues all wish Thomas well. He is a dear friend, and  we will be thinking and praying about him today even as we go about  doing our jobs.\n\nI am proud to call Thomas a friend. I am proud to stand alongside  Thomas, and I will stand alongside Thomas as a man…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693110/tax-cuts-and-spending"}]