[{"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…appreciation to the Isleta Police  Department and local law enforcement for their nonstop efforts to  protect our communities. We appreciate their dedication to public  service and pray for their continued safety. I look forward to our  continued partnership as we work to keep drugs off our streets and hold  bad actors seeking to prey on our communities accountable.", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697564/commending-the-isleta-police-department-and-local-law-enforcement"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…John Bowens.  Moreover, we extend our deepest sympathies to Sheriff Bowens' family,  friends, loved ones and all those who grieve during this difficult time  of bereavement. We pray that they will all be consoled and comforted by  an abiding faith and the Holy Spirit in the days, weeks, and months  ahead.\n\nMay the life of Sheriff John Bowens be a beacon…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699826/in-memory-of-sheriff-john-bowens"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…to them, as they did in those days immediately following that  horror.\n\nWe cannot forget the 48 hostages still enduring unimaginable  suffering at the hands of Hamas, and we pray for their return. The  wound of October 7 is still healing. It may never heal, but it is also  a call to action and remembrance.\n\nIn the days immediately following October 7,…", "date": "2025-10-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696083/9999"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…better than she found it. She exemplified our values of hard work,  respect, inclusion, and civil engagement.\n\nAs we mourn the loss of Melissa and Mark, I join Minnesotans to pray  for Senator John Hoffman and his wife, Yvette, as they recover.\n\nAs Minnesota's top leader in Human Services, Senator Hoffman  shepherded historic investments for the most…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692784/grieving-mark-and-melissa-hortman"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…an iconic figure in film and  made us laugh, cry, and think--and think--with the movies he created.\n\nPaul and I and our entire family mourn the loss of our dear friends  and pray for their loved ones.\n\nHis children, Jake and Romy, put out a statement thanking everyone  for their good wishes but asking for privacy. We respect that.\n\nMr. Speaker, I will…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698360/rob-and-michele-reiner-tribute"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…are in a countdown to impeachment. I am giving every assurance  that I can. Please take me literally. I plan to bring these Articles of  Impeachment against this President. I pray that the Senate will  convict. The Articles of Impeachment filed in the House are comparable  to an indictment but not the same. They are comparable to it in a  sense.\n\nThe…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697060/no-mandate-to-cut-medicaid"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…fingers  crossed--that neither one of them is going to have an emergency next  year.\n\nWell, that is the Republican plan for Laurie and her husband: Just  cross your fingers. Pray that no healthcare catastrophe hits your  family for a year--because they cannot afford $26,000 a year, up from  $6,000 a year.\n\nSo the Republicans are asking Americans to trade…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697772/healthcare"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…third-ranking Republican in  the House of Representatives, Liz Cheney, the daughter of Vice  President Cheney--found that courage to recognize that day for the  tragedy it was. I pray others will do the same.\n\nGeneral Washington, whom I mentioned earlier, would do the same. He  would tell them what he told his own officers when he learned they were  conspiring…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698552/january-6-attack"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…for.\n\nToday, I believe it appropriate that I first say a prayer, and then  after the prayer, I will make some comments about current  circumstances.\n\nI don't ask everyone to pray with me. You pray with me if you desire.  If you choose to do other things, then do those other things, but I  pray this prayer for my country.\n\nMost Gracious Creator, we know…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695338/dark-days"}, {"senator": "Katherine Clark", "party": "Democrat", "sentence": "…and make ends meet. They are trying to juggle getting their kids  to school and maybe catch an occasional game. They fear they will never  find childcare they can afford. They pray nobody in the family gets  sick because they can't afford a doctor either.\n\nMr. Speaker, Republicans are going to say to those women that because  they got married and changed…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700018/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "Mr. SCHUMER. Mr. President, we continue to pray for the families of  the 132 people now confirmed dead in Central Texas. We continue to pray  for everyone still missing. We thank our heroic first responders who  risked their…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693517/central-texas-floods"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…infrastructure stronger--1 year later,  we remember their loss. They are greatly missed. One year later, their  families and communities are still grieving. May we continue to pray  for their strength and peace.\n\nWe also remember the two men, including Julio Adrian Cervantes  Suarez, who miraculously survived the devastating collapse.\n\nAs Julio was falling…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689022/9999"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…the first use of a nuclear weapon in  a conflict--and that was the atomic bombing of Hiroshima on August 6,  1945--and the second, the bombing of Nagasaki, on August 9. Let us pray  that Nagasaki will be the last. Let us work to make sure that it is.\n\nSadly, the threat from nuclear weapons is only increasing. There are  estimated to be 13,400 nuclear weapons…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694117/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…African American; you can be Asian; you can be  Latino; we are moving toward your being suspect.\n\nThere are people of good will of all colors who are going to fight  this. I pray that we will succeed. There are people of good will who  are White and who are standing with us.\n\nIt is easy to see, if you care to look, at how the President has now  said:…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698076/liberty-and-justice-for-all"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…quick thinking, the entire Gomez family,  including their dog, Lyka, escaped without injury. That night, Mr.  Gomez did show us what true bravery is all about.\n\nMr. Speaker, I pray that Otoniel's family continues to recover from  the loss of their home.           Honoring the Life and Legacy of Doris Ann Derleth Hirota\n\nMr. CORREA. Mr. Speaker, I rise…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699624/9999"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…forms across the country.\n\nMelissa Hortman was a dedicated public servant, and we join Minnesota  and the Nation in honoring her life and the life of her husband, Mark.  We also pray for the speedy recovery of John and Yvette Hoffman and for  peace and unity in the face of tragedy and division.\n\nMr. Speaker, I urge adoption of the resolution.", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692853/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…ideals of duty and sacrifice. We  grieve her loss deeply, and I ask God to bring comfort and peace to her  family, her loved ones, and entire National Guard community.\n\nWe also pray for the full and swift recovery of Staff Sergeant Wolfe.  He remains in critical condition, and Americans across Kansas and the  country continue to cover him in prayer. I ask…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697294/national-guard-shooting"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…virtue. How may we obtain these treasures of the       Holy Spirit? Of course, through prayer, reading Scripture,       attending church and fellowshipping with other Christians.\n\nPray and ask God for the wisdom to discern truth and       succeed in our ever-advancing pursuit of higher and higher       virtue. Ask to be empowered to bear well the responsibility…", "date": "2025-08-26", "source_url": "https://justfacts.votesmart.org/public-statement/1694761/recognizing-campbell-the-nature-of-truth-odessa-american"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…ended up in a toilet after a chemical  abortion. What is the difference between those two children? Not a  thing. Not a thing.\n\nAll children are valuable, all of them, and I pray for the day when  all of them have an opportunity to live, to experience this glorious  Nation that we get to experience the freedom of every day.\n\nThanks to the marchers who…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699097/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…way.\n\nMr. Speaker, on behalf of the family of South Carolina, I thank  George and Joanna and their family for their many years of service in  Fort Lawn and Chester County. I pray their work continues to inspire  people to lead by their strong values. They epitomize the American  spirit of faith, family, and freedom.", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696937/recognizing-the-katergaris-family"}, {"senator": "Mike Crapo", "party": "Republican", "sentence": "…Pocatello, ID, and others across our country who keep an  unwavering spotlight on the need to bring every American servicemember  home. With a heavy but hopeful heart, I continue to pray for all those  who await answers about lost servicemembers and thank America's  servicemembers, veterans, and their families for their extraordinary  commitment to our country.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695075/national-powmia-recognition-day"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…growth and friendship have left a lasting impact on  the Athens community, with thousands praying for him following the  accident.\n\nMr. Speaker, our hearts ache for this loss. I pray for the  Whittenburg family and all who knew him. May God's perfect plan bring  them comfort.", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699886/mark-burns-inducted-into-living-legends-of-aviation"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…hungry, the church has never wavered in its mission to live  out the love of Christ.\n\nMr. Speaker, I thank the entire church family for their 35 years of  faithful service, and I pray for many more years of impact and growth.\n\nGod bless Abundant Life Evangelistic Church, and God bless the great  State of Mississippi.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695571/recognizing-abundant-life-evangelistic-church-in-biloxi-mississippi"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…Day  and extending to Father's Day.\n\nShe is rallying the community to identify the gaps in support for  addiction recovery and urging connection and action. It is a call to  pray, a call to talk, and a call to engage.\n\nIn Kitara's own words:\n\nNo matter how many differences we have, we have one thing       in common, and that is the serial killer in our…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690498/recognizing-gabriels-challenge"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…tragedies like the floods in Texas, we are incredibly fortunate to have  brave first responders who choose to run toward danger instead of away  from it.\n\nI will continue to pray for the safety of our first responders, as  well as the victims and families affected by this horrific disaster. I  am grateful that this team was able to put their expertise…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694073/recognizing-virginia-beach-fire-departments-swiftwater-rescue-team"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…Beckstrom on the eve of Thanksgiving. She was, as we all will  recall,  one of the National Guard servicemembers working here in the District  of Columbia. We are continuing to pray for the recovery of Staff Sgt.  Andrew Wolfe, who was injured in the shooting. But, of course,  Specialist Beckstrom lost her life.\n\nThe news cycle moves very quickly, and it…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699092/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Chuck Fleischmann", "party": "Republican", "sentence": "…presence here remind us of our commitment to remain ``One nation under  God, indivisible, with liberty and justice for all.''\n\nI extend my warmest welcome to His All-Holiness and pray that his  visit will be blessed with success, fellowship, and hope for the future  of our common humanity.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694769/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…service through missed birthdays, school events, and sports games. This  resolution is a small way in which we can show our thanks. I encourage  all Members to take time to pray, show their support for, and say thank  you to our local law enforcement heroes.\n\nMr. Speaker, I urge my colleagues to support this resolution. I thank  the gentleman from Mississippi…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691031/expressing-support-for-local-law-enforcement-officers"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…people won't even notice but, quite frankly, is Earth- shattering.\n\nThirty-five years ago, a group of students gathered around a flagpole  early in the morning to be able to pray for their school. It was in  1990. It ended up being about 46,000 total students in 4 different  States, including my State of Oklahoma, that just kind of gathered. The  word…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695773/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…containment for the Thompson Hollow fire.\n\nOn behalf of the entire 13th District of Pennsylvania, I thank these  firefighters for their courage in the face of danger, and I pray for  their continued safety as they continue to fight these fires.", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690194/repealing-green-new-deal-policies"}]