[{"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…their loving  memory that we dedicate our own efforts to rebuilding the Key Bridge.\n\nWhen the bridge collapsed on that early morning, people across the  globe immediately predicted our economy would crash. One of the world's  biggest ports was instantly shut off to traffic, and we would be  challenged to recover. But Team Maryland proved them wrong.…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689022/9999"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…Iran nuclear deal.\n\nOne of the tragedies of the recent past has been this President's  abandonment of the Iran nuclear deal, which has gotten us into a heck  of a pickle, as predicted by the people who actually understood what  our true options were in that negotiation.\n\nAfter the U.S. bombing of Iran, there has been an immense amount of  debate about…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694113/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…$129,000 a year  will see their premiums increase by $4,675. A 60-year-old couple  earning $82,800 a year will see their premiums increase by $11,968.\n\nMy State legislators have predicted at least 60,000 Virginians will  have to cancel their insurance coverage. Who are some of these people?\n\nWe have heard stories, at least under the Medicaid cut debate, we…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697649/restoring-enhanced-premium-tax-credits"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…the  observation that this bill also assaults higher education in the United  States of America. That is a disgrace.\n\nMr. Speaker, members of the House Republican Conference predicted  that that would occur. Those are their words, not our words.\n\n``The House Committee on Education and the Workforce has been tasked  with cutting $330 billion, where Federal…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Eric Swalwell", "party": "Democrat", "sentence": "…in the building  to bring food to the Members at the evacuation site where we huddled,  and then he counseled our staff who were waiting to know what would  happen next. He predicted to me, stick around in this room because  Speaker Pelosi would later gavel us in. He was right, and she was right  to hire him a few months later from my staff to work for…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689175/michael-reed-dedicated-public-servant"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…nothing.\n\nNot only did they know, but their own scientists' work was stunningly  accurate.\n\nThis is a chart from Exxon pulled from a 1982 Exxon memo. This line  in black is the predicted rise, back when this was prepared, before  1982, in CO2 concentrations. They start at 1960 and work  their way to 2100. This is what Exxon predicted for CO2  concentration…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698993/unanimous-consent-request-s-res-550"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…motion:  punishing low-income Americans by making it more difficult for them to  access what is now one of the cheapest forms of energy.\n\nOh, yes, there was a prediction. We predicted it on the floor in  March that electricity prices were going to go up, and then others,  when the bill passed, predicted it, but by July 24, it wasn't just a  prediction.…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696123/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…that.\n\n``And even the future, not for us, also for the West, for       NATO,'' he added. ``Libya used to be the flank of NATO.''\n\nAnd elsewhere on the continent itself, he predicted that       inaction on Russia's projection of influence through the       deployment of personnel in regions like the Sahel could       precipitate a broader geopolitical…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697384/recognizing-the-importance-of-libyas-return-to-stability"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…cascade works. It goes from climate risk to  uninsurability, to mortgage collapse, to property values collapse, to  recession. That is what the chief economist for Freddie Mac predicted.\n\nThis guy, Fed Chair Powell, is not green at all. He is lousy on  climate, but he is good on finance, and he sees this coming.\n\nFreddie Mac is not a green organization.…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697077/climate-change"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…It appears D.C.'s omission was a mistake. This  oversight likely occurred because the CZMA was passed in 1972, which  was before D.C. achieved home rule.\n\nScientists have predicted that the tides on the Atlantic Coast could  rise two to four feet by 2100, causing property worth as much as $7  billion in D.C. to be routinely under threat by floodwaters.…", "date": "2025-11-04", "source_url": "https://justfacts.votesmart.org/public-statement/1696521/introduction-of-the-district-of-columbia-flood-prevention-act-of-2025"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…what they saw. About half of the 17-member staff will be       making the move, including Wartenberg Kagan and van Alfen.\n\n``They will be welcomed with open arms,'' Levine predicted.       ``And they'll have more visitors in their first year than       they've had in the last five.''\n\n``Probably 10 years,'' Wartenberg Kagan added.", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697235/priceless-coin-collection-heads-to-the-toledo-museum-of-art"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…would always need virtue to  be able to defeat tyranny.\n\nAnd so as you are talking about authoritarianism and where we are, I  am just reminded of the fact that Virginians predicted in 1776 that the  Nation would need to always be on guard against tyranny.\n\nAnd in the formation of the Constitution--and my colleague has done a  great job of looking at…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696334/trump-administration"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "…halted investments because  of the economic uncertainty. Families in Arizona saw their retirement  accounts and 401(k)'s nosedive. The biggest financial firms in the  country predicted a recession.\n\nNow, of course, President Trump caved today, and that was actually  the right thing to do. While this constant whiplash may make for a good  episode of ``The…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689930/enough-of-trumps-chaos"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…that piece of property? When the property is uninsurable and  unmortgageable, its value goes down.\n\nThat is why the chief economist for Freddie Mac, the mortgage  company, predicted the cascade from climate risk to uninsurability, to  no mortgages, to what he called a coastal property values crash that  could lead to a recession like in 2008.\n\nI remember…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696122/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…increase. That is what Virginians are  facing if we can't find common ground to solve this problem, even  temporarily.\n\nOur former colleagues in the General Assembly have predicted that at  least 60,000 Virginians would end up canceling their insurance coverage  due to affordability if they lose access to the enhanced premium tax  credits.\n\nMr. Speaker,…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697213/medical-bills-are-too-high"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…the total destruction of the hemp industry. Well, obviously,  that is wrong. Under my language, industrial hemp, and CBD would have  remained legal, period. Period.\n\nSome predicted there would be widespread economic downturn to farmers  should this language become law. Wrong again.\n\nHemp makes up less than one-hundredth of 1 percent of all farmed  acres…", "date": "2025-08-01", "source_url": "https://justfacts.votesmart.org/public-statement/1694557/9999"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…the prerogative of power.\n\nWho among the Framers would have ever guessed or conceived of a time  when Congress would lack any ambition--any ambition at all? Who would  have predicted a time when Congress would be so feckless as to simply  and obediently abandon all pretense of responsibility and any semblance  of duty so as to cede the war power so completely…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698611/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…because of the technologies of the future,  because of digital asset innovation, because of quantum computing and,  yes, because of artificial intelligence.\n\nMr. Speaker, it is predicted and projected that by 2030 power demands  resulting from datacenter construction will triple just at a time when  we have been taking all of this power supply off of our…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699277/highlighting-republican-successes-in-2025"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…quipped       Senator John Kennedy, also on the banking committee.''\n\n--Reuters article, 1/12/26\n\n``Kennedy said he'd be ``stunned'' if Powell had done       anything wrong and predicted litigation between the Fed and       the administration will raise interest rates.''\n\n--Semafor article, 1/12/26\n\nSenator Cynthia Lummis:\n\n``Senator Cynthia Lummis, one of…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700062/9999"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…not less. Steel producers,  manufacturers, data centers need steady, reliable power if we are going  to compete and win. The electricity needed for data centers alone is  predicted to increase by up to 20 percent each year over the next 5  years. Coal will help power them. It will give our industry an edge, a  competitive advantage. In turn, more workers…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689762/coal"}, {"senator": "Mike Crapo", "party": "Republican", "sentence": "…partnerships. The corporate alternative minimum tax is a  fundamentally flawed, Democrat-enacted book minimum tax. Not one single  Republican voted for it.\n\nAs Republicans predicted, the book minimum tax has proven to be  highly complex and burdensome. Even President Biden's own Treasury  Department acknowledged its dizzying complexity. They waived penalties…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699912/9999"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…serious fire  threat. In fact, the largest single wildfire in California history, the  Dixie fire, ignited when a tree fell onto electrical lines. As we enter  into what is predicted to be another devastating fire year, it is more  imperative than ever that we take every step to manage our forests and  reduce wildfire risk.\n\nIn January, the world watched…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691068/fire-safe-electrical-corridors-act-of-2025"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…That is what the bill says. Anybody can go and read it, black ink,  white paper. Let's get straight to the point.\n\nThe U.S. is not at war with Venezuela. I know they all predicted  there was going to be some forever protracted war, but we were never at  war with Venezuela. There are no boots on the ground. Democrats are  asking us to vote on a resolution…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699364/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…to say on the floor today,  that the minority was going to lie about what is in this budget  resolution. I expect every single one of them to come down here and do  that. I predicted it, Mr. Speaker. Here it is, coming true.\n\nLet me talk a little bit about the tariffs. The tariffs announced by  President Trump on April 2, 2025, are a response to our economy…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689862/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "Mr. SHREVE. Mr. Speaker, last night the country watched something  nobody predicted: Indiana, national football champions. Our Hoosiers  beat Miami 27-21, and finished a perfect season and brought the title  home to Indiana.\n\nI say that as a proud IU alum,…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699173/indiana-college-national-football-champions"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…probably like  you, a number of folks go on television and confidently predict that we  were going to be out of the shutdown. Some said as early as Wednesday.  One confidently predicted Thursday. A couple more said Friday. So when  I came back on Monday, I was pretty sanguine about things.\n\nIt gives me no joy to say this, but I was wrong. I don't know. As…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696561/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…trucks and by consumers who will have to  pay more in freight costs for everyday goods. We have already seen  lower truck sales in California and, as expected and previously  predicted by one of our earlier speakers, increased purchase prices.\n\nBriefly, I will address the congressional resolution of disapproval  process. We have heard a lot today about…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690434/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-nox-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "Ryan Mackenzie", "party": "Republican", "sentence": "…Families Tax Cuts Act, we passed what has been called the largest  expansion ever of affordable housing tax credits. Our reforms to the  low-income housing tax credit are predicted to create 1.2 million  additional affordable housing units over the next decade, helping  millions more Americans access the high-quality affordable housing they  deserve.…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699814/lowering-housing-costs-and-advancing-main-street-community-banks"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…today, hemp is a major crop for our Kentucky farmers, and nearly every  farmer I know who grew hemp last year was a former tobacco farmer.\n\nHemp is doing exactly today what I predicted in 2015. It has become  an alternative crop to tobacco for Kentucky farmers.\n\nThe Senate recently added language to a continuing resolution that  would put our Kentucky hemp…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698983/industrial-hemp-in-kentucky"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…Committee, and  Senator Cassidy, a medical doctor, who is head of the Health,  Education, Labor, and Pensions Committee, for coming up with an  alternative proposal that is predicted to bring premium prices down  about 11 percent. Now, that is real money that people can use to spend  on other things.\n\nAgain, an 18-percent increase each year after year,…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697929/healthcare"}]