[{"senator": "Bobby Scott", "party": "Democrat", "sentence": "…PROTECT Our Kids Act, you  wonder what this bill is all about. You might think it protects kids  from guns, protects kids from bullying, or protects kids maybe from  online predators; but no, this is from the foreign influence of China.\n\nThere is no credible evidence of any improper influence in K-12  schools, yet this is what the bill is about. It imposes…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697533/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…back there. These are people who walked here from Venezuela. They went  through the Darien Gap. They dealt with the forest. They dealt with the  snakes. They dealt with the predators. They dealt with the drug  dealers.\n\nThey came into our country at great personal risk. They are going to  see a 30-second ad praising Donald Trump and decide to walk back…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688265/problems-caused-by-doge-cuts"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "Mr. Speaker, I rise in support of H.R. 6719, the Combating Online  Predators Act, and I echo my distinguished colleague in noting that  sextortion is a serious and rising threat faced by countless  unsuspecting teens all over America when they use…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698862/combating-online-predators-act"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…act as soon as possible  to provide robust resources that help prevent children from becoming  victims in the first place.\n\nHowever, instead of focusing on stopping online predators, S. 1829,  the STOP CSAM Act, weakens the single strongest technology protecting  children and families online: strong encryption. The bill explicitly  allows courts to punish…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692908/stop-csam-act-of-2025"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "Mrs. McBATH. Mr. Speaker, I thank Ranking Member Raskin for yielding  me time.\n\nMr. Speaker, I rise today in strong support of H.R. 6715, the Child  Predators Accountability Act of 2025.\n\nThe safety of our children is foundational to a secure and just  society. Yet this foundation is broken every time a child is  victimized.\n\nDue…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698896/child-predators-accountability-act"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "…immigrants while the majority effects one of the greatest coverups of  our time, covering up the horrific abuses of Jeffrey Epstein and his  network of child traffickers and sexual predators.\n\nWhy not spend our time focused on justice for the incredibly brave  survivors who have spoken out against the rich and powerful men who  abused them?\n\nWhy fight a bipartisan…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695359/stop-illegal-entry-act-of-2025"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…have been charged with assaulting police officers, making  terrorist threats, and preying on children. That is who this President  set free: violent individuals and child predators.\n\nMy colleagues on the other side of the aisle ought to recognize the  darkness this day represents for our country. The Republican majority  must restore checks and balances…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698554/january-6-attack"}, {"senator": "Mike Quigley", "party": "Democrat", "sentence": "…in the  Great Lakes. Those include zebra mussels, rusty crayfish, and round  goby. They compete for the same resources and prey on native species.  Many don't have natural predators in the Great Lakes. Without  intervention, these invasive species will be ``eely'' bad for our  native fish and plant populations.\n\nMr. Speaker, 61 native fish species are…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698193/great-lakes-fishery-research-reauthorization-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…we went there? The stated purpose, according to the  Trump administration, was very clear and understandable. We were going  after the rapists, murderers, terrorists, child predators, and  criminally insane who had come across the border illegally during the  Biden administration. They were to be found and removed and held  accountable for their conduct.…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699485/department-of-homeland-security"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…transparency to calling the  files boring, then a hoax, then a dead issue. This is not transparency.  This is a coverup.\n\nMadam Speaker, when leaders abuse their office to shield predators,  that is corruption of the highest order. When hundreds of survivors are  denied justice to protect one man's reputation, that is a crime against  the very idea of democracy.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695278/jeffrey-epsteins-abuse"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "…January 20, make no mistake, this country has been running a  fever, a moral sickness, one that begins at the very top, a twisted  agenda that pardons the powerful, protects the predators, and punishes  the people. Black Americans are paying the price.\n\nMr. Speaker, buried in the last jobs report was this number: The  Black unemployment rate is now 7\\1/2\\…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697467/recognizing-myesha-watkins"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "Mr. Speaker, I am rising in strong support of H.R. 6715, the Child  Predators Accountability Act of 2025.\n\nMr. Speaker, the decision that the distinguished gentleman from North  Carolina references out of the Seventh Circuit, United States v.  Howard,…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698895/child-predators-accountability-act"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…abroad.\n\nNot surprisingly, not one of the ten amendments I submitted were made  in order.\n\nLet me tell you what Republicans apparently don't care about:  Accountability for predators.\n\nI offered an amendment to disinter Dr. Robert McCormick Browne, a man  accused of sexually abusing dozens of students in Hawaii, from the  National Memorial Cemetery of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695301/fiscal-year-2026-ndaa"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "Mrs. McBATH. Mr. Speaker, I rise in support of H.R. 6719, the  Combating Online Predators Act.\n\nThere are a number of teenagers and pre-teens who have lost their  lives to suicide because of sextortion. We are fighting against  criminal individuals and groups…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699202/supporting-hr-the-combating-online-predators-act"}, {"senator": "Marc Veasey", "party": "Democrat", "sentence": "…their America, wealth and power buy secrecy. In our America,  justice demands sunlight and truth.\n\nIn their America, underage girls are treated like disposable property  by predators who believe they will never face consequences. In our  America, victims deserve justice, and the predators should face the  full weight of the law.\n\nTime and time again,…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693547/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…exploits a child for sexual purposes must face full  accountability and must face the full measure of the law.\n\nThere cannot be loopholes or technicalities that would let predators  slip through the cracks, and when we find them, this body has to fix  that. Protecting minors from sexual exploitation remains a core  priority for our Subcommittee on Crime…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698897/child-predators-accountability-act"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…cut for middle- and working-class  Americans in history, like no tax on tips and no tax on overtime.\n\nIt is a fact that the southern border is closed. Drug dealers, sexual  predators, human traffickers, and those who illegally invaded our  country during the Biden administration from over 160 countries are  being returned to the country of their origin.…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697390/providing-an-update-to-the-american-people"}, {"senator": "Laurel Lee", "party": "Republican", "sentence": "…Environment Act, and I  thank my colleague from Arizona (Mr. Biggs) for his leadership on this  critical issue.\n\nMadam Speaker, as technology advances, so do the tactics of predators  who seek to harm our children. Current Federal statutes were not  written with this kind of remote, organized, and coercive abuse in  mind. When the law lags behind the…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698877/coercion-and-sexual-abuse-free-environment-act"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…doxing. A disturbed young man, who has since been  arrested and jailed, started the 764 network in 2020.\n\nWhile decentralized, the group has grown into a vast array of online  predators seemingly in a dark competition of who can manipulate  children to commit the most violent acts.\n\nIn 2024, the National Center for Missing and Exploited Children,  NCMIC,…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698880/coercion-and-sexual-abuse-free-environment-act"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…response to yet another activist lawsuit.\n\nDouble-crested cormorants are waterbirds common to the Great Lakes  States and the Southeast. They are opportunistic and intelligent  predators that often feed at aquaculture facilities, where fish are  easy to catch. A variety of studies have determined that predation from  double-crested cormorants costs the aquaculture…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697641/cormorant-relief-act-of-2025"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…Chamber this afternoon moments ago, and I saw a  tweet or a post on X from South Carolina Attorney General Alan Wilson,  who said his protecting South Carolinians from sexual predators is a  top priority. Protecting citizens of this country has been my top  priority since the day I was ever sworn into office, particularly my  constituents whom I represent.…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688359/federal-contractor-cybersecurity-vulnerability-reduction-act-of-2025"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…with the  heartbreaking death of my constituent, 16-year-old Elijah Heacock. He  tragically fell victim to an online extortion scheme, showing my  community the dangers of predators targeting our kids online.\n\nI sat with his mom, his dad, and his brother just this last week. We  talked about the tragedy that happened in his life and their  determination…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690182/tools-to-address-known-exploitation-by-immobilizing-technological-deepfakes-on-websites-and-networks-act"}, {"senator": "Maria Salazar", "party": "Republican", "sentence": "…finally sends a  very loud and clear message to Big Tech. If you, Big Tech, do not  remove these fake images within 48 hours, you are as guilty and as  responsible as the predators who created them.\n\nI am talking to Snapchat, to Instagram, and to TikTok. All of them  will have to comply within 48 hours when a victim calls and demands and  tells you…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690181/tools-to-address-known-exploitation-by-immobilizing-technological-deepfakes-on-websites-and-networks-act"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…science, except for  women. We don't care about you. We hate you. We want to take everything  away from you. We won't follow science on this one.\n\nWe have opened the door for predators to abuse women and girls. Our  daughters are growing up with something we never had to distinguish  when our generation was growing up. We are putting our daughters in  imminent…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695260/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Tom Emmer", "party": "Republican", "sentence": "…In the past few  months, Director Berg's officers have removed dozens of dangerous  criminal illegal aliens from Minnesota, including known terrorists,  gang members, child predators, and murderers. After nearly 30 years in  federal law enforcement, Director Berg has had an incredible impact on  his Area of Responsibility. While we will certainly miss…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692698/recognizing-st-paul-minnesota-immigration-and-customs-enforcement-field-office-director-peter-berg"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…Federal Government Surveillance, both Republicans and  Democrats, for working together on these very important issues.\n\nMr. Speaker, sextortion has become a devastating crisis. Predators  threaten to release explicit images of minors to extort money, more  content, or compliance, preying on shame and fear.\n\nProtecting children from online sexual exploitation…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698863/combating-online-predators-act"}, {"senator": "Josh Hawley", "party": "Republican", "sentence": "…children have  been through.\n\nAnother employee at Meta testified about his own child--a daughter-- who signed up for an Instagram account and almost immediately was  bombarded by predators and sex abusers looking at her images, direct  messaging her, soliciting her for various sexual acts. It caused him to  ask himself: What are we doing at these tech companies?…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697735/9999"}, {"senator": "Tom Tiffany", "party": "Republican", "sentence": "…fish community objectives and fish       management plans described in the Joint Strategic Plan for       Management of Great Lakes Fisheries;\n\n(3) to assist in balancing predators and prey;\n\n(4) to support and improve the economic status of Tribal,       recreational, and commercial fisheries; and\n\n(5) to assist in evaluating the effectiveness of habitat…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693992/great-lakes-mass-marking-program-act-of-2025"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…So tomorrow, I am holding a hearing to  examine how scammers are targeting older Americans.\n\nThis continues my effort to ensure that seniors are protected from  financial predators and can live with the security and the dignity that  these seniors deserve.", "date": "2025-06-16", "source_url": "https://justfacts.votesmart.org/public-statement/1692579/national-elder-abuse-awareness-month"}, {"senator": "Laurel Lee", "party": "Republican", "sentence": "…Senate and House of Representatives of       the United States of America in Congress assembled,       SECTION 1. SHORT TITLE.\n\nThis Act may be cited as the ``Combating Online Predators       Act'' or the ``COP Act''.       SEC. 2. PROHIBITING THREATS TO A MINOR.\n\n(a) Material Involving the Sexual Exploitation of Minors.--      Section 2252A of title 18,…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698861/combating-online-predators-act"}]