[{"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…emergency powers to hurt one of the finest  relationships in the world; and you cannot drive up prices, eliminate  jobs, and put in place a national sales tax that experts now predict  will altogether--the tariff tax--cost the average family nearly $2,000  per year.\n\nAnd they are seeing it every day in their grocery bills. They are  seeing it when they…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696446/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…systemic economic collapse that is coming at us, based on a  fairly simple proposition, which is that climate risk is making weather  and risk unpredictable. And when you can't predict weather risk, you  can't predict the insurability of a piece of property. The original  concern was about coastal risk--flooding, hurricanes, rainstorms,  damage to coastal…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691581/hj-res-88"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…Elon Musk, who has never ever even thought about  wearing the uniform of the U.S. military.\n\nThese human impacts include world-class researchers who are looking  into how to predict stroke risk among veterans; enrollment of veterans  into clinical trials for advanced cancer delayed because of the VA's  hiring freeze; openings for new clinics that have…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690353/9999"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…With the uncertainty of Trump's tariffs, small business owners aren't  able to plan ahead for their businesses. Trump has small business  owners on a rollercoaster, trying to predict the extra costs they will  pay in this escalating trade war. Last week, my office met with Traci  Tapani, a Co-President of Wyoming Machine, a small family-owned sheet  metal…", "date": "2025-03-18", "source_url": "https://justfacts.votesmart.org/public-statement/1688917/impact-of-president-trumps-disasterous-tariffs-on-canada"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…and follow the  process of regular order. That is the way to pursue the changes that  they seek.\n\nMr. Speaker, I am not in the predictions business, but I can  confidently predict--and it is why one of the reasons this exchange is  so important--that this particular exchange will appear in litigation 2  years from now, 3 years from now, 5 years from…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694899/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…Nutrition for SNAP       would leave an unprecedented gap in Child Nutrition funding       that Congress has never had to fill with annual       appropriations, and USDA cannot predict what Congress will do       under these circumstances.\n\n10. The Child Nutrition Programs, which include the       National School Lunch and Breakfast Programs, Summer Food…", "date": "2025-11-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696499/unanimous-consent-request"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…hear it, and I doubt we will  be able to prevent them from proceeding with this misguided crypto  legislation today.\n\nYet, I will say this: If these bills become law, we can predict many  more crypto scandals and crises and money laundering. A lot of people  will lose a lot of money, and no one will face accountability for  taking advantage of retail…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693551/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "George Whitesides", "party": "Democrat", "sentence": "…home to  the smartest, most hardworking, and most impressive minds of our time  who have dedicated their lives to helping families across the country  fight deadly diseases, predict and prevent natural disasters before  they hit, and mount a challenge against our foreign rivals like China.\n\nHowever, we can't continue this important work without our scientific…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691391/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…to  get insurance coverage.\n\nIt matters what insurance companies think about this because those  insurance companies have both a fiduciary duty and a financial  incentive to predict well to make that an accurate transmission channel  of climate risk into markets. And they are predicting storm clouds  ahead, and they are battening down.\n\nOther reports…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699613/9999"}, {"senator": "Richard Neal", "party": "Democrat", "sentence": "…worry that if you went to the emergency room, you  somehow might be turned away because you had not been able to pay  another bill.\n\nWe don't get a chance on this Earth to predict when we are going to  get sick. Those are the basic actuarial realities of what insurance is  about. By way of example, we don't get to buy homeowners' insurance  after the…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698788/breaking-the-gridlock-act"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…these threats is not an option.\n\nThis working group is an initial robust approach to gain an  understanding of how to address these terrorism threats and prepare to  meet and predict them.\n\nI thank Representatives Nunn and Himes for introducing this bill, and  I, again, urge my colleagues to support it.", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693962/financial-technology-protection-act-of-2025"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…continue  to struggle. Supply chains will continue to experience chaos, strain,  and unpredictability.\n\nAgain, this is only a 90-day pause. As I said before, it is  impossible to predict what will happen next, even within the 90-day  period, because Trump changes his mind so quickly. Whatever seems good  in front of him at the moment, he goes for.\n\nFirst,…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690986/tariffs"}, {"senator": "Kevin Mullin", "party": "Democrat", "sentence": "…that amidst skyrocketing electricity costs, the  highest they have been since the 1990s, we are talking about  overturning commonsense energy efficiency standards.\n\nEconomists predict these standards would save American taxpayers  billions of dollars. Mr. Speaker, you don't need to be an economist to  know that a better fridge or freezer will mean lower…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689261/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…long-term causes of  sinkholes, including extreme weather events, droughts, and groundwater  depletion.\n\nRight now, there is no national, comprehensive mapping to track and  predict sinkholes, leaving communities across the country more  vulnerable to sudden and serious damage. Sinkholes can open without  warning and wreak havoc on our infrastructure,…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693481/sinkhole-mapping-act-of-2025"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…sledgehammer rather than the appropriate       discretion that's necessary.\n\nProtecting NOAA and its workforce is an investment in our future, an  investment in our ability to predict and prepare for natural disasters  and in the resilience of our planet.\n\nI urge the President and my colleagues to protect NOAA and ensure it  can continue to carry out its…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688171/national-oceanic-and-atmospheric-administration"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "…Sometimes a bill that can move through  over here without a single objection might draw some opposition on the  other side of the Capitol for reasons that can be difficult to predict.\n\nIn any event, there is a great safeguard in all of this in the way  the House of Representatives passes this--and I think this is inherent  in why it is that they want them…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698423/unanimous-consent-requests-the-calendar"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…you borrow trillions and trillions of dollars, pump it out into  the economy, you don't have your tax collections go up? Oh, but David,  they didn't project that. They didn't predict that. Come on, people.  Stop it.\n\nBecause even now, when we get back to baseline after we got beyond  COVID, they were still remarkably accurate. I found the chart. It was…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693062/stop-bathing-in-folklore-and-start-bathing-in-math"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "Mr. KENNEDY. Mr. President, this weekend, I watched, probably like  you, a number of folks go on television and confidently predict that we  were going to be out of the shutdown. Some said as early as Wednesday.  One confidently predicted Thursday. A couple more said Friday. So when  I came back on Monday,…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696561/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Darrell Issa", "party": "Republican", "sentence": "…could have significant budgetary       effects, depending on the extent to which judges choose to       rely instead on other types of relief like vacatur. CBO       cannot predict what actions will be litigated or the       decisions that judges will make. Accordingly, CBO has no       basis for estimating the budgetary effects of H.R. 1526.\n\nThe CBO…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689711/no-rogue-rulings-act-of-2025"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…the CFPB neglected to fully       consider the impact of increased compliance costs. The       proposed rule states, ``the CFPB lacks detailed information       with which to predict the extent to which increased costs       would be borne by providers or passed on to consumers, to       predict how providers might respond to higher costs, or to…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689949/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}, {"senator": "Eric Burlison", "party": "Republican", "sentence": "…system where premiums keep rising and  deductibles keep climbing, networks shrink, and patients are left with  coverage that they can't even use and bills that they can't even  predict. There is no transparency in the costs of the healthcare that  they are receiving.\n\nLet's be honest about where we are right now. Healthcare now consumes  one-fifth of our…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698105/bringing-america-back-to-its-roots"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…United  States, averaging $4.64 a gallon as of yesterday. The same gallon costs  only $2.56 in Oklahoma.\n\nWhen we lose these next two refineries, economists at UC Berkeley  predict Californians will be paying more than $8 a gallon by the  summer. Leftwing zealots like Gavin Newsom obsess over a 1-degree rise  in global temperatures over the next century,…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697033/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "John James", "party": "Republican", "sentence": "…specifically will create a supply chain resiliency  program to identify and address gaps in critical industries and  emerging technologies, establish an early warning system to predict and  prevent supply chain disruption, and reduce dependence on adversarial  nations by incentivizing domestic manufacturing.\n\nResilient global supply chains are the cornerstone…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690187/promoting-resilient-supply-chains-act-of-2025"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…economic policies of our Democratic colleagues. What we  did was we assumed a growth rate not based on CBO, JCT, or any other  predictive modeling. We said the best way to predict future achievement  is past performance.\n\nWhat did President Biden have as an annual average growth rate? What  did President Trump achieve? On average, Biden was at 2.7 if…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691961/supporting-the-big-beautiful-bill"}, {"senator": "John Thune", "party": "Republican", "sentence": "…subsistence use, and economic costs and benefits of such       methods;\n\n``(E) identify priorities for research needed to advance       techniques and technologies to detect, predict, monitor,       respond to, and minimize the occurrence, duration, and       severity of harmful algal blooms, including recommendations       to eliminate significant gaps…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695277/harmful-algal-bloom-and-hypoxia-research-and-control-amendments-act-of-2025"}]