[{"senator": "Alma Adams", "party": "Democrat", "sentence": "…assistance for middle-class families  when they are already struggling to make ends meet. It strips away  protections for patients, opening them up to discrimination and  predatory practices. It restricts access to abortion care which, by the  way, is healthcare, putting the government, not a woman and her doctor,  in charge of her body.\n\nPeople are…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698385/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Cleo Fields", "party": "Democrat", "sentence": "Mr. FIELDS. Mr. Speaker, I thank the gentlewoman from California, the  ranking member, for fighting predatory lending over the years.\n\nMr. Speaker, I rise today to oppose S.J. Res. 18 which would  dismantle important protections against predatory overdraft practices.\n\nLet me be absolutely…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689851/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "Ms. RANDALL. Mr. Speaker, I am here today to speak on H.R. 2293, the  Cormorant Relief Act of 2025.\n\nAquaculture facilities nationwide are facing issues with predatory  birds. We experience it in Washington State as well, along with the  pinnipeds that we spent some time discussing last week.\n\nDouble-crested cormorants consume large quantities…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697640/cormorant-relief-act-of-2025"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…women on the younger side, some of them.\n\nWell, some of them were actually not women; they were girls. This  crime is about the most heinous kind of exploitation of women,  predatory victimization of girls, in effect, trafficking them--which  was Maxwell's specialty. And the President has said that they may have  stolen some of them from his spa, as if…", "date": "2025-08-02", "source_url": "https://justfacts.votesmart.org/public-statement/1694635/9999"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…prohibiting exploitive overdraft fees.\n\nAnd the reason is--despicably, disgustingly--servicemembers are often  targeted by bad actors and financial institutions for abusive and  predatory practices like overdraft fees or that result in overdraft  fees.\n\nA Department of Defense survey revealed that 10 percent of Active- Duty and Reserve servicemembers paid…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689109/9999"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…efforts to  gut the authorities of the Consumer Financial Protection Bureau. I am  hopeful that we are making progress in stopping these efforts to  protect big Big Tech and predatory lenders.\n\nA district court judge blocked the Trump administration from  dismantling the Consumer Financial Protection Bureau before the  administration appealed the ruling,…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689953/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "Mr. REED. Mr. President, today I am reintroducing the Predatory  Lending Elimination Act along with many of my colleagues. This  important legislation would extend the bipartisan Military Lending Act,  MLA, protections for Active-Duty…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699792/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…bill, which would  authorize the use of post-9/11 GI Bill benefits for independent study  programs taught at non-degree-granting, for-profit institutions, might  be used by predatory operators to target veterans with subpar programs  and rob them of the benefits they have so rightfully earned.\n\nWhile I believe that student veterans should have the freedom…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699512/veterans-education-and-technical-skills-opportunity-act-of-2025"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…plants, animals and insects,  whether intentionally or accidentally introduced, have caused  significant ecological damage. Invasive species such as the mongoose,  rats and predatory insects have decimated native bird populations.  Invasive plants like the fireweed and strawberry guava overwhelm native  vegetation, altering habitats and disrupting the…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688377/the-hawaii-native-species-conservation-and-recovery-act"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…am wrong, but I also hoped very much that  Secretary Rubio would stand up for Ukraine and that he would be an  anchor, as Secretary of State, to defend Ukraine against the predatory,  brutal, criminal war crimes of Vladimir Putin. But what we have seen  instead has been the ``Putinization'' of our strategy to Ukraine, and  the Secretary of State has…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690667/nomination-of-frank-bisignano"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…get a 1-800 number and a cookie-cutter product  developed in some far-off headquarters. The problem is even more dire  in low-income neighborhoods where research shows that predatory lenders  and check cashers proliferate as bank consolidation increases.\n\nConcentrating power into a few financial giants and money centers  reduces competition, and it results…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690769/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "Mr. REED. Mr. President, today I am reintroducing the Predatory  Lending Elimination Act along with many of my colleagues. This  important legislation would extend the bipartisan Military Lending Act,  MLA, protections for Active-Duty…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699782/9999"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…mistakes of the past with a new risky  financial product. We can integrate the lessons of the past for a  future that spearheads responsible innovation and growth.\n\nRemember the predatory mortgages from the financial crisis? Those  were also sold as innovative products without sufficient guardrails.  Instead, they caused millions of people to lose their jobs,…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…driver. It has absolutely nothing to do with it. Yet, we are allowing  in this country for the auto insurance industry to use nondriving  factors to discriminate and to allow predatory practices to determine  auto insurance rates.\n\nIn my district alone, I have seen many families with auto insurance,  which is required by law, see their rates go up almost…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691869/job-corps-cuts"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…effort to roll back bail reform is a       handout to the for-profit bail industry, which thrives on the       desperation of working families. Bail bonds function like       predatory payday loans: families must pay a nonrefundable fee       to a bail bondsman, money they never get back--even if       charges are dropped. This $2 billion-a-year industry…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696985/opposition-letter-by-the-southern-poverty-law-center-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Basin Fund, which is funded by  hydropower revenues, not appropriations. In other words, utility  customers end up footing the very expensive bill to address the impacts  of predatory smallmouth bass.\n\nThe loss in revenues not only means higher electricity prices but  also negative impacts on the Colorado River system, as the Basin Fund  is the primary…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691060/memorandum-of-understanding-to-address-potential-impacts-of-a-certain-record-of-decision-on-the-upper-colorado-river-basin-fund"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…markets to propping up  state-owned industries and weaponizing finance for geopolitical gain,  the CCP's actions are not just unfair but are also downright dangerous.  These predatory practices harm American businesses, erode trust in  global markets, and risk empowering China to pressure developing  nations and destabilize debt markets for its own benefit.…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694119/china-financial-threat-mitigation-act-of-2025"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…signed on July 5, 2024, with  implementation beginning just 3 days later on July 8. Pretty doggone  quick.\n\nThe ROD calls for higher flows at the dam to combat the presence of  predatory smallmouth bass which threaten the federally protected  humpback chub. These higher flows bypass hydropower generators in order  to cool the river temperature below the dam…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691059/memorandum-of-understanding-to-address-potential-impacts-of-a-certain-record-of-decision-on-the-upper-colorado-river-basin-fund"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…embarrassment  of being turned down at the point of sale. Unfortunately, my Democrat  colleagues refuse to recognize this basic truth, choosing instead to  label overdraft products as predatory.\n\nLet me reiterate that point, Mr. Speaker. Consumers choose to use  this service, and they opt into the service voluntarily.\n\nThe first option under the new rule forces…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689846/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "John Moolenaar", "party": "Republican", "sentence": "…chairman for this time.\n\nChina is our Nation's greatest adversary, and it seeks to harm our  country on a daily basis. It thrives in the shadows. It uses fentanyl  precursors, predatory trade practices, and cyberattacks to hurt us.\n\nChina also uses informational warfare, and it would love to influence  what American students learn in classrooms, from kindergarten…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697437/transparency-in-reporting-of-adversarial-contributions-to-education-act"}]