[{"senator": "Chris Murphy", "party": "Democrat", "sentence": "…drone technology into the Middle East.\n\nGuess what. They got what they wanted. The President has agreed to  move forward with sending our most sensitive drone technology, the  Predator drones, into the Middle East, selling them to Qatar. It is not  a coincidence that they are also willing to send him this jet.\n\nI had the chance this morning to talk to the…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692362/motion-to-discharge-sj-res-54"}, {"senator": "Jacky Rosen", "party": "Democrat", "sentence": "…happens there, it won't stay there. It is part of a broader effort to  weaken our Nation's health. Disease knows no boundary and is,  unfortunately, an equal opportunity predator.\n\nAt the heart of this dangerous misinformation campaign are people  like the Secretary of Health and Human Services, R.F.K., Jr., who has  built a career by spreading lies…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695532/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…of Congress to withdraw their names from the petition, who  responded ``Quiet, piggy'' to a female reporter who asked about the  files, and who nominated an alleged sexual predator to be our AG. It is  the same person whose name appears more than any other in the Epstein  emails.\n\nIn the pantheon of violence, a sexual predator is the worst of the  worst,…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696809/epstein-files-transparency-act"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…amendment to disinter Dr. Robert McCormick Browne, a man  accused of sexually abusing dozens of students in Hawaii, from the  National Memorial Cemetery of the Pacific. A predator like that does  not deserve to rest amongst heroes. The Republicans said no. By  refusing to act, they are, once again, protecting a pedophile, allowing  him to lie in a place…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695301/fiscal-year-2026-ndaa"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…together in       pain and resilience, and we are asking for your help. We have       a right to feel safe in this country. We have a right to know       why a serial sexual predator was treated with more humanity       than we have ever experienced from our own government.\n\nYou now have the chance to be on the right side of history.       Unlike past…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695788/a-letter-from-survivors-of-jeffrey-epstein-and-ghislaine-maxwell"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…protection for predators.\n\nMadam Speaker, history will remember what we do in this moment. Here  is the truth: If we in Congress cannot unify to defy the most well- connected predator of our time, what good are we?", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695278/jeffrey-epsteins-abuse"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…children, and I commend the work of  this committee and the lead sponsor of this bill, Mr. Harris.\n\nMr. Speaker, I urge my colleagues to support H.R. 6715 so that every  child predator is fully held to account. Let's do this today. Let's get  it out of the Senate quickly and get it up to the President's desk to  be signed and enacted immediately.", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698897/child-predators-accountability-act"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…All those delay vital  infrastructure projects and constrain training exercises during  breeding seasons.\n\nOn top of that, Fort Huachuca must carry out ongoing monitoring,  predator control, and habitat management, all under ESA guidelines,  which impose onerous constraints on our ability to train and be ready  for our warriors. The same could be said…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695254/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…platform. These are users  who the Meta-owned company identified as potential child predators.\n\nThink about this. Looking at the profile, they think: That might be a  child predator. What do they do? They do nothing. They encourage them  to connect with young girls and boys. And what we know is that children  were more than a quarter of their follow recommendations…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691286/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…nationwide who suffered abuse. That  is 370,000 children in one year alone. For those who might not be  aware, after a child is tragically exploited or sexually assaulted by a  predator, one of the first places a victim is taken is a child advocacy  center, or CAC.\n\nAt CAC, specialized interviewers are able to work with the child  victim to not only make…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698841/crime-victims-fund-stabilization-act-of-2025"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…insulate online  predation, I am proud of the work multiple sheriff offices, as well as  state and federal agencies did to arrest 13 suspects during an online  child sexual predator operation in my district and in surrounding  communities last fall.\n\nImagine how much more ``Big Tech'' would be willing to do to shut  down the predator superhighway if they…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699543/true-cost-of-big-tech"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…imprisonment and battery.\n\nThat was just yesterday. Let's look real quick at the worst of the  worst from 2025 generally, not just yesterday.\n\nIn Louisiana, we have a sexual predator, an illegal alien from  Honduras, whose criminal history includes active warrants for 394  counts of pornography involving juveniles and two counts of sexual  abuse of an…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…people expect  integrity  and judgment from their elected officials. They expect Members of  Congress to conduct themselves with one word--decency--not to seek  advice from a predator who exploited minor children.\n\nThis resolution does not accuse. It acknowledges what is documented.  It censures Delegate Plaskett for her conduct; removes her from the  Intelligence…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696890/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}]