[{"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…people in my  district. There are too many to read all of them, but this one is from  Beth, who lives in Greenbelt, Maryland, which is in my district. She is  looking at her premiums going up $9,372 this year. She has major  health conditions that require ongoing healthcare that she can't avoid.  They were brought on by a major surgery that she underwent…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697216/medical-bills-are-too-high"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…time to  focus on something that already exists just days before the government  runs out of funding and mere weeks before people receive notice of  their health insurance premiums going up by thousands of dollars next  year, unless the House Republicans extend healthcare tax credits for  working families.\n\nMost importantly, it is a wasted opportunity to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695763/national-coal-council-reestablishment-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…insulting.\n\nWhat we need to do is prevent our premiums from skyrocketing, and  only our bill does it. It is the last train out of the station to avoid  these sky-high premiums from going up and up and up.\n\nWhat we need to do is prevent premiums from skyrocketing, and only  our bill does it. It is the last train out of the station, I repeat.\n\nBut Republicans?…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697877/healthcare"}, {"senator": "Thomas Suozzi", "party": "Democrat", "sentence": "…year,  right now under the premium tax credits you have to pay 8.5 percent of  your income for your health insurance. That is about $10,000 or $11,000  a year.\n\nThose premiums are going to go up to $30,000 on January 1. People are  going to go broke. They are not going to buy health insurance. When  less people are on health insurance, everybody's health…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697961/healthcare-crisis"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…minutes, and I yield myself such time as I  may consume.\n\nMr. Speaker, we heard a lot of words from the gentleman from  Virginia, but the reality is that some people's premiums are going up  100 percent. Their big, grand plan is to give people an 11 percent  coupon. This is laughable. It is pathetic.\n\nMr. Speaker, here we are, likely one of the very last…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698312/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…Republicans' cruel refusal  to extend ObamaCare tax subsidies, are depending on those tax credits.\n\nShe told me: That is just an amount I simply cannot afford.\n\nMr. Speaker, her premiums are going from $50 a month all the way up  to $1,260 a month. From $50 a month to $1,260 a month. There is no way  that she can afford that.\n\nVivian has suffered from psoriatic…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697217/medical-bills-are-too-high"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…Otherwise,  hospitals go underwater, and they go out of business.\n\nWho is that? That is the people who are not on Medicaid but who are  paying private insurance premiums. Those premiums are going to go up.  It will hurt individuals who buy their own insurance. It will hurt the  businesses and the companies who employ those people. This hurts  everybody.…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691419/gop-tax-scam-hurts-everyone"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…a day, doesn't lower premiums, and does absolutely nothing to help  people afford coverage.\n\nSo let's be very clear. There is only one reason--one reason-- Americans' premiums are going through the roof starting in just 14  days: It is because Republicans--Trump, the Republican Senate, the  Republican House--chose for it to happen.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698255/nominations"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…year. Everything is already too expensive. So where are  they supposed to find 6,500 extra dollars in their budget?\n\nAnother couple, from Butternut, WI, told me their premiums are going  from $400 per month to over $5,000 per month. That is $55,000 more a  year. As they wrote to me, ``healthcare tax breaks are not just numbers  on paper. They are a lifeline…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696658/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…so that  families like this don't have to rely on hope alone.\n\nAnd my Republican colleagues, they are going to have a different  plan. Instead of lowering people's premiums, they are going to give  everyone $1,000 for their healthcare expenses. And that sounds nice in  theory, but you already heard the stories of the people who are, right  now, trying…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697772/healthcare"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…is not a Democratic or a  Republican issue. The only thing they care about is getting those costs  lower. And they want to know who is going to step up and bring premiums  down. Who is going to lower costs?\n\nSenate Democrats say in one voice to Americans: We hear you. We have  a plan to bring your premiums down. We can pass it through the Senate  today,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699088/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…billion from the system over the next 10 years.\n\nThe Affordable Care Act, subsidizes premiums, which provides health  insurance for millions of Americans. Again, those premiums are going to  be cut. As a result, people are going to lose their health insurance.  That is not me saying that. That is the Congressional Budget Office,  the neutral umpire that…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691848/one-big-ugly-bill"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…the ACA starts in just  a few weeks, and because of Republicans' refusal to act--I repeat-- people across the country are getting notices saying: Here is what your  ACA premiums are going to cost you.\n\nThe figures are astounding. Without an extension of these credits,  average out-of-pocket premium costs for a family of four in Hawaii are  expected to…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696175/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…something about the high  cost of health insurance premiums. I am hearing it back home. People  understand what is happening. They are getting notices about what these  premiums are going to be as of the first of the year. Some 24 million  Americans are affected by the ``Big Beautiful Budget Bill'' of Donald  Trump and the elimination of these tax credits.…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697242/the-economy"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…beautiful, budget bill of the Trump  administration. It eliminated the tax treatment that helped families  pay for these health insurance premiums. As a consequence, their  premiums are going through the roof.\n\nWhat is that going to do to a family that has to make a choice--a  choice that comes down to $200 or $300 a month more in health insurance  premiums?…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696536/government-funding"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…for over 40 days was related to the fact that subsidies are ending  on the ObamaCare exchanges.\n\nA little bit of history: During the COVID pandemic, health insurance  premiums were going up so much that Democrats passed extended,  temporary, enhanced premium tax credits--if you will, EPTCs--which  helped give more money on top of the original ObamaCare…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697554/healthcare"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Austin, I know schools in Austin that are having to increase prices  and increase tuition and increase what they have to deal with simply  because of covering insurance premiums, which are going into the  pockets of insurance companies to provide you substandard options in  healthcare.\n\nThey don't provide you care. They don't. They are a middleman, a  funding…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697130/congress-is-back"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…worried. They are  worried about things like the cost of living. They are worried about  things like the cost of housing. They are worried about things like  their insurance premiums going up. They are wondering if it is ever  going to get any better. They are tired of having to pay more, live  worse. They are worried that eventually they are going to have…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697423/the-economy"}]