[{"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…Florida  to provide critical support during Hurricane Milton.\n\nNathan has led the way in adapting innovative technology and  strategies that have strengthened our community's preparedness and  resilience. We are grateful for his leadership and commitment to  keeping our communities safe.\n\nOn behalf of the people of Colorado's Seventh Congressional District,…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689320/recognizing-nathan-whittington"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…national nonprofits  and local community organizers to fill critical gaps in disaster  response and recovery by leveraging private sector resources. Moreover,  Good360's preparedness model reduces waste, improves efficiency, and  strengthens the capacity of frontline communities to withstand and  recover from future disasters.\n\nGood360's innovative use…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694807/recognizing-good360-in-honor-of-national-preparedness-month"}, {"senator": "Julia Brownley", "party": "Democrat", "sentence": "…China's military and their readiness first and  foremost.\n\nSecond, our DOD officials are talking about the future. They are not  talking about today. They are talking about preparedness for the  future.\n\nMr. Chair, if you want a ribeye steak, cultivated meats can create  that, and I assure you it will be delicious. They will love it, and  they will not…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695257/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Jim Costa", "party": "Democrat", "sentence": "…local communities are better  equipped to address these unauthorized biological operations that would  prevent threats in their areas. The public demands that we provide  preparedness, and preparedness demands action.\n\nLet me also thank local officials that acted responsibly when it was  first determined they had a problem. They include Code Officer Jesalyn…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699754/stopping-unregulated-biological-laboratories"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…affordable power and increasing energy  resilience. Specific community projects include solar power  interconnection, analyzing wind energy potential, conducting wildfire  preparedness, advancing weatherization retrofits and implementing  microgrids and battery storage projects.\n\nThe draw of this program is that it doesn't come in and dictate how  communities…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692645/introduction-of-the-energy-transitions-initiative-authorization-act"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…District from 1991 to 2017. For 20  years, he was a co-chair of the General Assembly's Public Safety and  Security Committee, which oversees all matters related to civil  preparedness, state and municipal police, and the overall safety of  residents. He also served on the Gaming Policy Task Force, the Police  Pursuit Task Force and the Private Security…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689392/recognizing-the-honorable-steven-steve-dargan-west-havens-2025-irish-person-of-the-year"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…Security to report back to Congress.\n\nThrough these changes, the Securing the Cities Improvement Act offers  a more targeted and effective approach to national security  preparedness and response. It ensures that our cities that need support  are reliably equipped with advanced detection technologies and will  have the infrastructure and training to…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688698/securing-the-cities-improvement-act"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…listen to the American  West when we say that this is a crisis that will kill thousands more  until we act. Let's work together on real solutions, like investing in  wildfire preparedness and providing better pay and benefits for  wildland firefighters.\n\nThe administration's current plan of slashing volunteer wildfire  crews is a disingenuous attempt to cut…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692450/wildfires-in-oregon"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…attack on public health--firing a CDC  Director, why? Because she stood up for science. The stakes are sky- high. Our medical research, our public health, our pandemic  preparedness, our food safety--R.F.K. Jr., is putting all of that in  jeopardy and putting communities across this country in danger.\n\nWe cannot put our heads into the sand. We absolutely…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694964/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…and other islands and  noncontiguous parts of our country remain a fully captive market, with  no viable alternatives to a Jones Act duopoly that prioritizes profit  over preparedness. We see no meaningful return on this federal maritime  policy. The economic burden of this broken system, including inflated  shipping costs driven by duopoly protections…", "date": "2025-08-01", "source_url": "https://justfacts.votesmart.org/public-statement/1694572/introduction-of-the-merchant-marine-allies-partnership-act"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…program's stability and strengthen  partnerships with at-risk cities by allowing the Countering Weapons of  Mass Destruction Office to select STC cities based on their  preparedness capabilities rather than UASI designations.\n\nThe bill, Mr. Speaker, also establishes performance metrics, enhances  oversight of expenditures, and requires DHS to report…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688696/securing-the-cities-improvement-act"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…extreme weather events.\n\nWaterford 3 employs more than 800 employees and contractors who have  demonstrated a commitment to operational excellence, nuclear safety,  emergency preparedness, and professional standards, exemplifying the  spirit of public service and technical leadership. Additionally,  Waterford 3 has maintained a strong and ongoing partnership…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696712/recognizing-the-40th-anniversary-of-entergys-nuclear-power-site-waterford-3-steam-electric-station-in-killona-louisiana"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…preparing, but this year they are doing so without the help of FEMA's  predisaster mitigation grants because the administration canceled the  program.\n\nCutting emergency preparedness funding doesn't prevent disasters. It  just makes them harder to handle. Once again, it is Americans who will  pay the price.", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693988/fema-cuts-and-hurricane-season"}, {"senator": "Rob Menendez", "party": "Democrat", "sentence": "…them.\n\nMy bill would codify the Communications Security, Reliability, and  Interoperability Council, or CSRIC, which focuses on improving next- generation 911, emergency preparedness, network security, resiliency,  and interoperability.\n\nTime and again, CSRIC has improved the reliability, availability, and  performance of our communications networks…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693436/communications-security-act"}, {"senator": "Joaquin Castro", "party": "Democrat", "sentence": "…obviously  incredibly important to the United States. CARICOM, the Caribbean  Community, plays a crucial role in democratic governance, regional  security, and disaster preparedness. Extending privileges and  immunities supports CARICOM as a unified voice for the Caribbean and  strengthens U.S. ties to a region where influence should be felt  through…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694823/providing-appropriate-recognition-and-treatment-needed-to-enhance-relations-act"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…threats.\n\n(6) Strengthened coordination between Federal, State,       local, Tribal, territorial, and private sector stakeholders       is essential to enhance prevention, preparedness, and       response efforts, ensuring the safety of communities across       the nation.       SEC. 3. REPORT ON EMERGING THREATS AND COUNTERMEASURES…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696768/department-of-homeland-security-vehicular-terrorism-prevention-and-mitigation-act-of-2025"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…to  reauthorize the National Volcano Early Warning and Monitoring System.\n\nThis is a program of national importance. Volcano monitoring  strengthens safety and emergency preparedness across the country, from  the Cascades to Hawaii to the Rockies, but there is no question that  Alaska has the most at stake.\n\nOur State is home to over 130 active volcanos,…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698112/southcentral-foundation-land-transfer-act-of-2025"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "…Homeland Security Act of 2002 to require the  development of a national strategy to secure elementary and secondary  schools against acts of terrorism, and ensure domestic preparedness for  and the response to terrorism, and for other purposes, as amended.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696997/national-strategy-for-school-security-act-of-2025"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…military. Our enemies are not waiting  for environmental impact studies. They are advancing relentlessly.\n\nIf we vote against this, we are choosing endangered species over war  preparedness and defending this country. This is essential, and it is a  lifeline for security.\n\nMadam Chair, I urge my colleagues to stand up for our troops and pass  the measure today,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695254/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…of  agricultural leaders.\n\nFounded in 1928, the National FFA Organization has grown into a  dynamic force in agriculture, education, leadership development, and  career preparedness.\n\nWith over 1 million members and chapters in all 50 States, Puerto  Rico, and the U.S. Virgin Islands, FFA stands as a pillar of strength  for young men and women pursuing…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687891/national-future-farmers-of-america-week"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…senior at Roanoke Benson High  School when the agency was known as the Emergency Services and Disaster  Agency. Throughout his career, he has held key roles in emergency  preparedness and response, including serving as Deputy Director, chief  storm spotter, and a member of the damage assessment team. In these  pivotal positions, he worked closely with…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697208/congratulating-mike-oltman-on-his-retirement-with-the-woodford-county-emergency-management-agency"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…technologies that may assist in       fulfilling the responsibilities described in section 2,       including such technologies that may be critical to       addressing preparedness, weaknesses, and vulnerabilities       relating to critical supply chains;\n\n(iii) critical industries, critical supply chains, and       critical goods designated pursuant…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690188/promoting-resilient-supply-chains-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…(a)(2), the Director of the United States       Geological Survey shall utilize 3D elevation data (as that       term is defined in section 2 of the National Landslide       Preparedness Act (43 U.S.C. 3101)) collected pursuant to       section 5 of that Act (43 U.S.C. 3104).\n\n(c) Review of Maps.--Once during each 5-year period, or       more often as the…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693479/sinkhole-mapping-act-of-2025"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…Cyber coordination and support in foreign territories. Sec. 213. Modification of treatment of minor construction and                improvement project management. Sec. 214. Preparedness plans for Coast Guard properties located in                tsunami inundation zones. Sec. 215. Additional Pribilof Island transition completion actions. Sec. 216. Scientific…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…Coroner's Office, where  he continues to serve as deputy medical examiner.\n\nMr. Speaker, Mr. Sheffield's decades of leadership and dedication  have strengthened emergency preparedness across our State. Today, I am  proud to honor him and his lifetime of service.", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697326/recognizing-paul-sheffield"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…business for the American  people.\n\nI rise in strong support today of H.R. 4016, the Defense  appropriations bill before us, not just as a matter of policy, but as a  matter of preparedness.\n\nTogether, we can ensure that our men and women in uniform and their  families have what they need when they need it.\n\nRight now, our small-caliber ammunition stockpiles…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693646/department-of-defense-appropriations-act-2026"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…Cooke County as the Emergency Manager  and Fire Marshal. In this role, which he held for an additional 22  years, he became a cornerstone of public safety and emergency  preparedness in North Texas. Mr. Fletcher led Cooke County through  seven federally declared disasters, investigated over 400 fires, and  oversaw numerous other critical incidents that…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693149/recognizing-mr-ray-fletcher"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…ledger technology,       applications built on blockchain technology or other       distributed ledger technology, tokens, and tokenization;\n\n(C) the current and future preparedness and ability of       Federal agencies to adopt blockchain technology or other       distributed ledger technology, applications built on       blockchain technology or other…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692733/deploying-american-blockchains-act-of-2025"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…training, and technology needed to  reinforce our defenses and confront those who wish us harm.\n\nIt also prioritizes strong and resilient communities by bolstering  disaster preparedness, response, and recovery efforts. Subcommittee  Chairman Mark Amodei prioritized safety at every level. Even in the  face of political challenge, he and the ranking member,…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699354/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Dan Newhouse", "party": "Republican", "sentence": "…provides critical investments to protect the American homeland.\n\nAs a member of the Subcommittee on Homeland Security, I know that  this bill champions public safety and preparedness. It protects  taxpayer dollars and refocuses the Department on its core functions.\n\nWith border encounters at a historic low, this legislation fully  funds DHS and the effort…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699356/department-of-homeland-security-appropriations-act-2026"}]