[{"senator": "Michael Bennet", "party": "Democrat", "sentence": "…wounded for life. Since that day, Jefferson  County, CO, has done what no community should ever have to do: They  have built some of the strongest systems in the Nation to prepare for  and respond to mass shootings at their schools.\n\nAt Evergreen, teachers acted so quickly that when the shooter tried  door after door, looking for students and teachers,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695673/cloture-motion"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…assignment months ago, but he  hadn't done anything to get ready for it. He hadn't let us know that he  needed the help to work on it, and he certainly hadn't done any work to  prepare the project.\n\nThat is what our Republican colleagues are doing right now. They came  into office on January 20th knowing that these ACA tax credits were  going to expire.…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697216/medical-bills-are-too-high"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…have health insurance. I was fortunate to get to a facility quickly  enough. On the way there, a local paramedic and an EMT from Santa Fe  County Fire Department helped to prepare me before I got to the  emergency room. They helped to save my life.\n\nWell, right now, across the country it is not just the concern of  health insurance premiums doubling…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696347/trump-administration"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…First Step Act,  another landmark piece of criminal justice reform legislation, I  highlighted that most people who are incarcerated will ultimately be  released, so we must prepare them for a successful reentry. The First  Step Act is bipartisan criminal justice reform legislation designed to  make our justice system fairer and our  communities safer…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688628/100th-anniversary-passage-of-the-federal-probation-act-of-1925"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…far- reaching. He continuously found ways to elevate our communications-- from quick video clips to informative electronic updates, to printed  newsletters. Matt worked to prepare me for appearances on MSNBC, NY1,  and other local New York City television news programs. He worked  closely with reporters to book interviews with major news outlets like…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693380/recognizing-matt-jansen-and-his-service-to-the-house-of-representatives"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…democracies. Ignoring these threats is not an option.\n\nThis working group is an initial robust approach to gain an  understanding of how to address these terrorism threats and prepare to  meet and predict them.\n\nI thank Representatives Nunn and Himes for introducing this bill, and  I, again, urge my colleagues to support it.", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693962/financial-technology-protection-act-of-2025"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…and band performances. They have won  regional titles and competed in Model U.N. competitions.\n\nTo the students, no matter what you do next, all of these experiences  will prepare you to be leaders, critical thinkers, scientists, or  whatever else you want to be. I am looking forward to following your  journey, and make sure to thank your parents and…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692320/congratulating-john-champe-high-school-class-of-2025"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…commanders who use this  to assist our allies, and it builds and cements our relationships.\n\nLet me just give you a few examples. When we help our allies improve  their capacity to prepare and to respond to a crisis that will take  place, when we help implement the Humanitarian Mine Action Program,  this provides significant training, readiness, and enhanced…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693686/department-of-defense-appropriations-act-2026"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…funding to  organizations that support eligible, lawful permanent residents with  the U.S. citizenship application process, civics instruction, and other  services to help prepare for naturalization.\n\nIf my colleagues haven't been to a naturalization ceremony, I  encourage everyone to do this. These are the types of people we want to  be U.S. citizens.…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692450/wildfires-in-oregon"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…spirit of National Preparedness Month--it is a reminder  that true readiness is built on effective partnerships, creative  solutions, and neighbors helping one another. As we prepare for the  challenges ahead, I encourage my colleagues to support initiatives like  those sponsored by Good360, which make a measurable difference in  disaster resilience and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694807/recognizing-good360-in-honor-of-national-preparedness-month"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…of that nature. But I knew within seconds what this was, as  soon as I realized it was machinery and not parts of a bridge. But this  is the demolition at the White House to prepare for some $300 million  ballroom. At least that is what I am nominating as my answer, and I  would yield to you a question if you would like to follow up.\n\nMr. MERKLEY. I will…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…credit. One method of preserving it is to use it as sparingly as  possible, avoiding occasions of expense by cultivating peace, but  remembering also that timely disbursements to prepare for danger  frequently prevent much greater disbursements to repel it; avoiding  likewise the accumulation of debt, not only by shunning occasions of  expense, but by vigorous…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700163/reading-of-washingtons-farewell-address"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…Offers training courses       for ``new probation and parole officers and others needing       TASER 10 Certification.''\n\nBillings Probation and Parole Officers training to prepare       for use.\n\nLake County Forest Preserves Police Department                                   NEBRASKA\n\nLincoln Police Department\n\nClay County Sheriff's Office…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700033/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…infrastructure and the imminent  challenges of the climate crisis--these are hard problems. Reasonable  people can disagree about how to solve them, but we can't solve them or  prepare for the problems of the future if we can't talk to each other.  We can't solve them if we treat politics as warfare rather than  negotiation. We can't solve them if the President…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700133/climate-change"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…who work behind the scenes to assist judges and those  involved in the criminal justice system. Through comprehensive  investigations and reports, these officers and staff prepare judicial  officers to make evidence-based decisions tailored to facts of every  case. They also provide essential support and supervision to people  returning home from prison,…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688716/centennial-of-the-probation-act-of-1925"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…U.S., American  companies need the workforce to support these industries.\n\nLast week, President Trump signed an executive order to modernize our  workforce programs to better prepare the American people for these  high-paying jobs in the trades.\n\nThis Presidential action will support more than 1 million  apprenticeships per year, meaning that talented…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690194/repealing-green-new-deal-policies"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Hendrix College in Conway.\n\nThanks to a generous $250,000 donation from George and Sallie Gill in  honor of their brother and brother-in-law, this endowed program will  help prepare Hendrix students for a legal career.\n\nAs a former president of the Arkansas Bar Association and member of  the  American College of Trial Lawyers, John Gill has left an indelible…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688705/recognizing-lorie-tudor-on-her-retirement"}, {"senator": "Ashley Hinson", "party": "Republican", "sentence": "…entrepreneurship.\n\nUnder her leadership, Iowa State University has advanced cutting-edge  research to strengthen Iowa agriculture. She supported world-class  faculty and helped prepare the next generation of leaders and  innovators to solve challenges and better our State and our Nation.\n\nMy husband, Matt, an Iowa State alum, and I, of course, look forward…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697328/recognizing-dr-wendy-wintersteen"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…sinkholes, analyze the areas with the greatest risk of experiencing a  sudden sinkhole and make maps publicly available to help community  planners and government agencies prepare for and avoid these  catastrophes.\n\nMr. WESTERMAN. Mr. Speaker, Mr. Soto's bill will help leverage modern  technology and mapping data to gain a better understanding of the…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693479/sinkhole-mapping-act-of-2025"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "…painful  truth, that the safety of our students and teachers cannot be taken for  granted. It recognizes that schools need Federal support, coordination,  and expertise to prepare for the threats they face, and it moves us on  a bipartisan basis toward a more consistent, nationwide approach to  keeping our children safe.\n\nHowever, let me be clear. This…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696997/national-strategy-for-school-security-act-of-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…services, economic  development, the history of Rocklin, and much more.\n\nLeadership Rocklin holds high esteem in the community and is  recognized by leaders as an important way to prepare those who wish to  further serve and learn about their community. I commend the  participants for their dedication to civic engagement and their  commitment to leadership…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…of Representatives of       the United States of America in Congress assembled,       SECTION 1. REPEAL REQUIREMENT FOR CONGRESSIONAL RESEARCH                     SERVICE TO PREPARE ANNOTATED CONSTITUTION AND                     SUPPLEMENTS IN HARDBOUND VERSION.\n\n(a) Repeal.--The first section of Public Law 91-589 (2       U.S.C. 168) is amended--\n\n(1)…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689324/repeal-requirement-for-congressional-research-service-to-prepare-annotated-constitution-and-supplements-in-hardbound-version"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…security. We cannot sit idly by while our adversaries seek  to gain competitive advantage to control the next-generation economy.\n\nThis legislation takes an important step to prepare our Federal  agencies against supply chain constraints that could occur as our  Nation seeks to address timely development of electric generation and  transmission infrastructure.…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697897/electric-supply-chain-act"}, {"senator": "Steve Daines", "party": "Republican", "sentence": "…https://eplanning.blm.gov/eplanning-ui/project/59042/510       (last visited June 11, 2025) (2015 Miles City RMP).\n\n14. 2015 Miles City RMP, at 1-1.\n\n15. Id.\n\n16. NEPA requires agencies to prepare an environmental       impact statement for ``major Federal actions'' that       ``significantly'' affect the ``quality of the human       environment . . .'' 42 U.S.C. Sec.…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693085/us-government-accountability-office-legal-opinion"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…growth, professional  development, and a powerful network of female leaders who are making a  difference in their communities and beyond. Its mission is simple yet  powerful: to prepare great women for the world and the world for great  women.\n\nSouthern Ohio is proud of Allison's and Olivia's accomplishments and  the ways they have given back to our Buckeye…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695223/congratulating-miss-ohio-olivia-fosson-and-miss-ohios-teen-allison-payton"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…sports and climbing. Jay is responsible for reestablishing the  resident camp program for the council which includes driving out to  camp on Christmas Day with his family to prepare for winter camp. Jay  is a steadfast proponent for getting youth outdoors. He was part of the  council COVID response committee which helped keep youth Scouting  during the…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690805/recognizing-james-sheridan"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…collects basic information on these attacks,  such as when the attack occurred and what types of weapons are used,  more information is needed to help law enforcement officers prepare  for, identify, and prevent future anti-police activity.\n\nThis legislation would also shed light on the mental health  consequences of the attacks on law enforcement and other…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691319/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…wasn't luck. This was discipline, toughness, and outright  superiority.\n\nWhat makes this championship even more special is how the U.P. made  it possible. With just days to prepare for the long trip to Ford Field,  the Maroons suddenly needed tens of thousands of dollars for buses,  lodging, and meals. Our Yoopers stepped up, raising nearly $30,000 in…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697511/recognizing-menominee-maroons"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "Mr. BEAN of Florida. Mr. Speaker, according to Bubba from ``Forrest  Gump,'' there are 21 ways to prepare shrimp, but there is only one  place you can experience all that and more: Fernandina Beach, Florida's  Isle of Eight Flags Shrimp Festival. Can you believe, Mr. Speaker,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690464/isle-of-eight-flags-shrimp-festival"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…Institution, and such other entities of the Federal       Government as the offices consider appropriate.\n\n(c) Duties of Architect.--The Architect of the Capitol       shall--\n\n(1) prepare the Time Capsule to be sealed and buried in the       Capitol Visitor Center, at a location specified by the       Architect, with the approval of the Committee on Rules and…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699840/semiquincentennial-congressional-time-capsule-act"}]