[{"senator": "Sylvia Garcia", "party": "Democrat", "sentence": "…extraordinary achievement  for Texas's 29th Congressional District.\n\nOn the biggest stage in Texas high school football, the Mustangs  earned a state championship through discipline, preparation, and belief  in one another. This victory marks the program's sixth state title and  a return to the top, reaffirming North Shore's tradition of excellence.\n\nThis championship…", "date": "2025-12-23", "source_url": "https://justfacts.votesmart.org/public-statement/1698467/congratulating-the-galena-park-north-shore-mustangs"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…and elementary school grades. The  school has a strong focus on developing well-rounded individuals with a  variety of performing  and fine arts programs alongside academic preparation.\n\nThe school is comprehensive and excels in athletics, as well. For  example, during the 2023-2024 school year, they were city champs in  boys' water polo, girls' basketball,…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692107/in-honor-of-charles-rangel"}, {"senator": "Jimmy Gomez", "party": "Democrat", "sentence": "…which helps reduce youth violence and strengthen  local families. In addition, El Centro is home to the Echo Park Family  Source Center, providing financial counseling, tax preparation,  tutoring and college prep classes and other critical services to  Angelenos.\n\nMs. Figueroa-Villa has also been active in public service, serving on  the Board of Police…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696024/recognizing-the-achievements-of-sandra-figueroa-villa"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…caring for American citizens who       need support with daily living activities. I help individuals       with tasks such as bathing, personal hygiene, dressing, meal       preparation, and mobility. I perform this work with       compassion and dignity, ensuring that those I care for feel       safe, respected, and comfortable.\n\nMany of the people I assist…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699630/constituent-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Sara Jacobs", "party": "Democrat", "sentence": "…children: ready-to- use therapeutic food, or RUTF. RUTF is the go-to treatment for  malnutrition in hard-to-reach areas and emergencies because it doesn't  require refrigeration, preparation, or any training to deliver. It is  nutrient rich, delivering essential nutrients and calories so people  can recover from malnutrition quickly.\n\nMr. Speaker, I worked at…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690808/funding-food-aid-for-malnutrition"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…changes include, but are not limited to:\n\nUpdating forms, schedules, and instructions. Forms and       other relevant filing documents must be developed.       Additionally, preparation for each filing season typically       begins immediately after the start of the previous season. If       OTR is required to re-work tax year 2025 now, they will be…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699680/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…disregard, to return to that retirement from which I had  been reluctantly drawn. The strength of my inclination to do this,  previous to the last election, had even led to the preparation of an  address to declare it to you; but mature reflection on the then  perplexed and critical posture of our affairs with foreign nations, and  the unanimous advice of…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700163/reading-of-washingtons-farewell-address"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…separately on my  campaign, Daniel helped propel me to a 30-point victory over a fellow  Democratic Committee Chair in a tough New York primary. He was  essential in debate preparation and worked with me to anticipate  questions and ensure that I was ready to respond in the most powerful  way possible. He led the communications team during the primary…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693365/recognizing-daniel-rubin-and-his-service-to-the-house-of-representatives"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…hours to serving low-income families through the Ferguson Road  Initiative's Volunteer Income Tax Assistance (VITA) Program. His  unwavering commitment to accurate, free tax preparation has made him a  cornerstone of this vital effort--and a source of immense pride for our  district.\n\nAs both a tax preparer and site coordinator at two VITA locations,  Mr.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695269/recognizing-the-work-of-robert-phillips"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…score  on the SAT this year. Less than 1 percent of SAT test-takers earn a  perfect score each year, and Sahli's accomplishment is nothing short of  extraordinary. His SAT preparation was largely self-directed, relying  on free resources, and using his time and determination to study for  the exam. Beyond  academics, he is deeply involved in extracurricular…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688149/recognizing-the-perfect-sat-score-of-sahli-negassi"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…destruction. She prepped supply bags, organized  inventory, communicated with other volunteers, and showed up each day  with a smile, ready and willing to help however needed. In preparation  for Hurricane Milton, just a few short weeks later, Donna helped the  organization pack up thousands of relief and recovery items onto a 40  foot trailer. She and her husband…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692146/recognizing-donna-telesco"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…goals, and  States have broad authority to pursue them all.\n\nLet's look at the second goal: to ``end the dependence of needy  parents on government benefits through work, job preparation, and  marriage.'' Cash assistance alone does not end dependence. It often  merely just manages it. Pregnancy resource centers offer the best hope  of achieving this goal…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699227/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…on behalf of, the eligible entity or, if the eligible       entity is a State, local governments within the jurisdiction       of the eligible entity;\n\n``(iii) enhance the preparation, response, and resiliency       of applications, user accounts, and information systems and       operational technology systems, including either or both of       such…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696787/protecting-information-by-local-leaders-for-agency-resilience-act"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…the Committee.\n\n10.4. The Committee staff shall assist the minority as       fully as the majority in the expression of minority views,       including assistance in the preparation and filing of       additional, separate, and minority views, to the end that all       points of view may be fully considered by the Committee and       the Senate.\n\n10.5.…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688225/us-senate-select-committee-on-intelligence-rules-of-procedure"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…tasks and workflows, and improve transparency and accuracy of       project timeline estimates, which in turn can help project       sponsors better plan for application preparation and project       delivery milestones;\n\n(8) taking a standardized, digital-first perspective to       environmental reviews and authorizations at Federal agencies…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697679/epermit-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…aspects of international telecommunications and information       policy;\n\n``(4) formulate, and recommend to the Under Secretary,       polices and plans with respect to preparation for and       participation in international telecommunications and       information policy activities;\n\n``(5) in coordination with the Secretary of State,       coordinate…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690257/national-telecommunications-and-information-administration-reauthorization-act-of-2025"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…Finally, I traveled to Wallops Island in my district to visit the  Mid-Atlantic Regional Spaceport, where Virginia is playing a vital role  in America's return to the Moon and preparation for Mars. The One Big  Beautiful Bill Act provides nearly $10 billion for NASA, supporting  Artemis missions, the International Space Station, and new launch  infrastructure.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694795/promises-made-promises-kept"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…BIGGS of Arizona. Madam Chair, let me reiterate: Activist groups  exploit the ESA through relentless litigation and red tape, curtailing  and preventing full training and preparation by our military.\n\nThis amendment is nonnegotiable. It draws a clear line: Military and  National Guard lands cannot be arbitrarily designated as critical  habitat if the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695254/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…Jackson's ``Smooth Criminal,'' and Imogen Heap's ``Hide and Seek.''  Their performance highlighted the Band's technical expertise and  creativity, character, and joy. They began preparation for the season  in June and competed throughout the fall in the Cavalcade of Bands--a  regional circuit of nearly 75 bands throughout Pennsylvania, New  Jersey, and Delaware.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698290/congratulating-the-big-spring-high-school-marching-bulldogs"}, {"senator": "French Hill", "party": "Republican", "sentence": "…embargoes, not through  invasion, and not through military attack. Congressman Lucas' bill is a  commonsense measure to unify American policy of economic deterrence,  military preparation, peace through strength, but also diplomacy and  economic deterrence.\n\nMr. Lucas' bill is an excellent step in that regard. I urge all  Members to support it on both sides…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699846/pressure-regulatory-organizations-to-end-chinese-threats-to-taiwan-act"}, {"senator": "Andy Ogles", "party": "Republican", "sentence": "…they have attempted to position  themselves inside sensitive systems for long periods of time, for  years, in some cases, before being discovered.\n\nTheir activity indicates preparation for the possibility of major  disruption during a time of crisis, including potentially over Taiwan.  This is a serious strategic concern, and it demands a serious national…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696757/strengthening-cyber-resilience-against-state-sponsored-threats-act"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…affect  health outcomes. They are responsible for managing nutrition and  foodservice operations, and are trained and qualified to administer  menus, food purchasing and preparation, and to apply nutrition  principles, among many other essential tasks.\n\nI would also like to recognize the Association of Nutrition &  Foodservice Professionals (ANFP) for…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697863/recognizing-the-national-certified-dietary-manager-cdm-and-certified-food-protection-professionals-cfpp-day"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…after graduating from high school. He served as a gunner's  mate in the Pacific during World War II and was later assigned to the  USS Ault, part of the Seahorse Squadron, in preparation for the  invasion of Japan.\n\nAfter the war ended, Edward remained on duty during the occupation  until January of 1946. During his service, he traveled the world from  Australia…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694105/recognizing-edward-eugene-holmes-july-veteran-of-the-month"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…will take part in activities like the run club,  where the benefits of competition can be experienced. They are also  learning the importance of goal setting, the pain of preparation, and  the tenacity to push through the pain.\n\nThey are in the process of learning one of life's more important  lessons, which is that we cannot control the scoreboard,…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693107/recognizing-midvale-boys-girls-club"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…of five-star recruits, they were often underestimated, but they  responded again and again with discipline and toughness. Week after  week, they proved that hard work and preparation still matter.\n\nUnder the leadership of Coach Curt Cignetti, this team has put  Indiana football on the map. A perfect regular season, a Big Ten  Championship victory over…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698931/recognizing-indiana-university-football-team"}]