[{"senator": "Jim McGovern", "party": "Democrat", "sentence": "…before, and I will thank again, all of the law enforcement and the men  and women who keep us safe in this Capitol. I appreciate what they do  for us.\n\nMr. Speaker, I am prepared to close if the gentleman is prepared to  close. I don't have any additional speakers. I reserve the balance of  my time.\n\nMr. Speaker, let me just say to the gentleman: You…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692813/providing-for-consideration-of-hr-military-construction-veterans-affairs-and-related-agencies-appropriations-act-providing-for-consideration-of-hr-special-interest-alien-reporting-act-of-providing-for-consideration-of-hr-jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-and-providing-for-consideration-of-h-res-condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…birth dates, addresses, and more. In fact, if you step back, DOGE has  pilfered information from every Federal Agency, and we are in a  situation where I believe Trump is prepared to weaponize that  information against the American people in so many different ways.\n\nSo I would just ask: Did you hear my distress that Trump could use  this information…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696343/trump-administration"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…amendment would allow for women and trans people to be subjected to  increased and invasive targeting and harassment.\n\nAthletic associations and the service academies are better prepared  to understand the sports that they regulate and how to provide both  respect for transgender people and fairness in sports. These  associations and academies should be addressing…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695232/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…This bill would ensure the  same standard for all Americans regardless of how they file.\n\nMr. DAVIS of Illinois. Mr. Speaker, I have no further requests for  time so I am prepared to close.\n\nMr. Speaker, H.R. 1152 is a narrowly targeted bill that can provide  meaningful help and assurance to taxpayers.\n\nMr. Speaker, I urge my colleagues to support it,…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689374/electronic-filing-and-payment-fairness-act"}, {"senator": "Nikki Budzinski", "party": "Democrat", "sentence": "…most important  legislative and district activities I have undertaken. She has guided  my office through farm bill negotiations and markups, ensured that our  team was well-prepared for the annual Farm Progress Show, and  represented my office with diligence and skill at countless other  hearings, briefings, and stakeholder meetings. Regardless of what…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695855/thanking-aleksi-knepp-for-her-service-to-illinois-13th-congressional-district"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…members offered to pick up a shift or  two. The new workers were often older Vermonters who had been retired  for years, but they stocked shelves, checked out customers, and  prepared sandwiches with enthusiasm. They pitched in not because they  had to--many donated their salaries to charity--but because they felt  the store's survival was essential to…", "date": "2025-07-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694332/recognizing-dan-whits-general-store"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…morning. We are going to be there, and we are going to stay there. We  are going to offer our amendments, and we are going to make our points.  I would urge my colleagues to be prepared to be there for a very, very  long time.\n\nMr. Speaker, I hope that the gentleman can give us some assurance  that, unlike in the Agriculture Committee where the chairman cut…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691512/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…dietary       supplement under section 201(ff).\n\n``(kkk) The introduction or delivery for introduction into       interstate commerce of a dietary supplement that has been       prepared, packed, or held using the assistance of, or at the       direction of, a person debarred under section 306.''.\n\n(b) New Import Exclusion.--Section 801(a) of the Federal…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699792/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…moves us  meaningfully forward.\n\nMs. CRAIG. Mr. Speaker, I have no other speakers at the moment. I  continue to reserve the balance of my time.\n\nMs. CRAIG. Mr. Speaker, I am prepared to close, and I reserve the  balance of my time.\n\nMr. Speaker, I, too, would like to thank the gentleman from  Pennsylvania, Chairman G.T. Thompson, and his team for working…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693791/digital-asset-market-clarity-act-of-2025"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…in the interests of United States'  national security.\n\nMr. Chairman, I yield 1 minute to the gentleman from Ohio (Mr.  Turner).\n\nMr. SMITH of Washington. Mr. Chair, I am prepared to close.\n\nMr. Chairman, I agree with all of the arguments that were made. I  think the most crucial point here is that the United States of America  is the most economically…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695253/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…increases in healthcare premiums, copays, and deductibles.  America is already too expensive. President Trump and House Republicans  are making things worse.\n\nDemocrats are prepared, under the leadership of Rosa DeLauro, to sit  down anytime and anyplace to negotiate a bipartisan spending agreement  that meets the needs of the American people in terms…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695292/9999"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…have a very large Ukrainian-American  population, cultural center, churches, and just extraordinary  constituents. I learned so much from them.\n\nAs Ms. Kaptur says, they have prepared--whether they are Ukrainian- American or not, the folks in my district care desperately about this.  I have one woman who has been physically a part of delivering  ambulances…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690214/supporting-ukraines-independence"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "…funding they rely on. That is  unacceptable.\n\nWhether it is for pushing out evacuation alerts or maintaining  shelters, this funding is key to keeping our neighbors safe and  prepared. That is why I can't stop, and I won't stop fighting to ensure  our communities have the resources they need.\n\nI ask my constituents to please continue to follow the direction…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693956/addressing-firefighter-funding-cuts"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…objection to the request  of the gentleman from New York?\n\nMr. PALLONE. I yield 4 minutes to the gentlewoman from New Mexico  (Ms. Stansbury).\n\nMr. PALLONE. Mr. Speaker, I am prepared to close, and I reserve the  balance of my time.\n\nMr. Speaker, I have to respond to the chairman of our committee who,  of course, I respect a great deal.\n\nThe Republicans…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698564/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…wondering if the new language would cover Changpeng Zhao, who  just  received a pardon from President Trump.\n\nMr. RASKIN. Madam Speaker, I have no further speakers, and I am  prepared to close.\n\nMadam Speaker, again, I strongly support this legislation. We need to  be doing whatever we can to eliminate terrorist forces and those who  are providing critical…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697236/no-immigration-benefits-for-hamas-terrorists-act-of-2025"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…Speaker, I urge my colleagues to vote ``yes'' on H.R.\n\nMr. WILLIAMS of Texas. Madam Speaker, I reserve the balance of my  time.\n\nMr. WILLIAMS of Texas. Madam Speaker, I am prepared to close, and I  reserve the balance of my time.\n\nMr. WILLIAMS of Texas. Madam Speaker, H.R. 5763 allows small  businesses on Main Street to have equal access to SBA 504 loans.…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699166/main-street-parity-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Bruce Westerman,                                                          Chairman.\n\nMr. WESTERMAN. Mr. Speaker, I have no further requests for time. I am  prepared to close and reserve the balance of my time.\n\nMr. Speaker, passing H.R. 2492 would be an essential step toward  reducing the urgent threat that wildfire poses to communities…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691068/fire-safe-electrical-corridors-act-of-2025"}, {"senator": "Nathaniel Moran", "party": "Republican", "sentence": "Mr. MORAN. Mr. Speaker, I want to point out before I get to my  prepared remarks that Leader Jeffries just said  that we need to fix our broken healthcare system. It is a healthcare  system put into place by the Democrats. It is a healthcare system…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698806/breaking-the-gridlock-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…miles away managing the land where you live. I  thank her for her efforts on behalf of her constituents and on all  Americans who enjoy outdoor recreation.\n\nMr. Speaker, I am prepared to close and continue to reserve the  balance of my time.\n\nI just want to say that it is unfortunate that we are having to use a  Congressional Review Act, but it is unfortunate…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690405/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…the Transportation and Infrastructure Committee to generate at  least $10 billion in savings overall. Committee Republicans have been  hard at work to make sure that we are prepared to support the Coast  Guard while also being good stewards of taxpayer dollars by responsibly  offsetting our investments.\n\nMr. Chairman, I urge my colleagues to support this…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688038/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…criminality, and they will pursue them  wherever they might be, political correctness be damned. Americans are  better off under this approach.\n\nMs. FOXX. Mr. Speaker, I am prepared to close, and I reserve the  balance of my time.\n\nMr. Speaker, this majority continues to roll up its sleeves and  advance the core priorities of the American people and President…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699072/providing-for-consideration-of-hr-financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…determine whether the       legislation would affect direct spending or revenues, time       may be insufficient to estimate the magnitude of those       effects. If CBO has prepared estimates for similar or       identical legislation, a more detailed assessment of       budgetary effects, including effects on spending subject to       appropriation,…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697286/systemic-risk-authority-transparency-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…hitting five, just, boom. Because suddenly  we are grabbing so much of the world's capital to finance what we have  been borrowing internally and now we have to pay it back.\n\nBe prepared. These aren't surprises. We all know it, but no one reads  the damn documents. It is math, and it turns out telling the truth-- remember our story here that fact-based discussions…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690586/economic-anxiety"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "…support H.R. 4058 and to act quickly so that  these critical funds reach the communities that need them most.\n\nMr. GUEST. Mr. Speaker, I have no further speakers, and I am prepared  to close after the gentleman from New York closes.\n\nMr. GOLDMAN of New York.\n\nMr. Speaker, my legislation would play a crucial role in  strengthening FEMA's engagement with…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696945/enhancing-stakeholder-support-and-outreach-for-preparedness-grants-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Phillip L. Swagel,                             Director, Congressional Budget Office.\n\nMr. HILL of Arkansas. Mr. Speaker, I am prepared to close, and I  reserve the balance of my time.\n\nMr. HILL of Arkansas. Mr. Speaker, I rise, as I said, in support of  this bill. I agree with the ranking member of the full…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693913/enhancing-multi-class-share-disclosures-act"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…Utah (Mr.  Kennedy).\n\nMr. KNOTT. Madam Speaker, I yield 2 minutes to the gentleman from  North Carolina (Mr. Moore).\n\nMr. MOORE of North Carolina. Madam Speaker, I had some prepared  remarks, but as I have talked about this and looked at it even more,  this is probably one of the most commonsense bills that will come  before this Congress.\n\nThis bill…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695365/stop-illegal-entry-act-of-2025"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…Department of State, and Related Programs.\n\nMr. COLE. Madam Speaker, I yield 1 minute to the gentleman from Guam  (Mr. Moylan), my very good friend.\n\nMr. COLE. Mr. Speaker, I am prepared to close, and I reserve the  balance of my time.\n\nMr. Speaker, when you reach a point like this, there are a lot of  people to thank. I will begin by thanking the President…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699575/consolidated-appropriations-act-2026"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…Madam Speaker, I yield such time as he may  consume to the gentleman from Florida (Mr. Patronis).\n\nMr. WILLIAMS of Texas. Madam Speaker, I have no further speakers, and  I am prepared to close.\n\nMr. WILLIAMS of Texas. Madam Speaker, H.R. 5788 provides transparency  to the SBA's 504 loan program, a key program that promotes job creation  and small business…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699188/504-program-risk-oversight-act"}, {"senator": "Dan Newhouse", "party": "Republican", "sentence": "…guy or your gal. It is the Office of the President that needs the  respect because it reflects on all of us as Members of the House of  Representatives.\n\nMr. NEWHOUSE. I am prepared to close, Mr. Speaker.\n\nOne of the things when I was a freshman in Congress that just shocked  me, amazed me, is how easily events on the floor would devolve into  what I…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688496/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…whether there are  significant savings here.\n\nOf course, some of the money will not go to reducing our debt.  Insofar as we find excess people around here, I think we are not  prepared enough in this country for hypersonic missiles. I don't think  we have an Iron Dome-type Israel situation in which we are prepared for  other sorts of missiles.\n\nI think the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695628/breakdown-of-traditional-families"}]