[{"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…objection to the request  of the gentleman from New York?\n\nMr. PALLONE. I yield 4 minutes to the gentlewoman from New Mexico  (Ms. Stansbury).\n\nMr. PALLONE. Mr. Speaker, I am prepared to close, and I reserve the  balance of my time.\n\nMr. Speaker, I have to respond to the chairman of our committee who,  of course, I respect a great deal.\n\nThe Republicans have…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698564/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Republican officials  that I read, and I have a volume more that I could read. They were  caught, so it sounds like the system works.\n\nMr. McGOVERN. Mr. Speaker, I am prepared to close.\n\nMr. Speaker, may I inquire as to how much time I have remaining.\n\nMr. Speaker, let me state, again, for the gentleman from Texas,  because he doesn't seem to understand…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699941/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…may I inquire as to how much  time is remaining.\n\nMr. SMITH of Washington. Mr. Speaker, I reserve the balance of my  time.\n\nMr. SMITH of Washington. Mr. Speaker, I am prepared to close, and I  reserve the balance of my time.\n\nMr. Speaker, the first thing I will say is we have mentioned  repeatedly ``acquisition reform,'' which is such a huge part of…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697790/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Richard Neal", "party": "Democrat", "sentence": "…inquire as to how much time is  remaining.\n\nMr. NEAL.  Plaskett).\n\nMr. NEAL.  Underwood).\n\nMr. NEAL.  Salinas).\n\nMr. NEAL. Mr. Speaker, I have no further speakers, and I am prepared  to close.\n\nMr. Speaker, it is too bad that we had to play this out to the  anxiety and consternation of the American people. Think of what this  might be like if you didn't know…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698788/breaking-the-gridlock-act"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…of our colleagues in the House Chamber to support this bill  once again.\n\nMs. STEVENS. Mr. Speaker, I have no further requests for time to  speak on this bill, and I am prepared to close.\n\nMr. Speaker, I thank, again, my colleague, Mr. Kennedy for his were  very affirming and wonderful remarks on the importance of this  legislation.\n\nI think from what…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688933/united-states-research-protection-act"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…Mr. Golden  for their bipartisan efforts on behalf of America's rural small  businesses.\n\nGoodlander).\n\nMr. CISNEROS. Mr. Speaker, I have no further speakers, and I am  prepared to close.\n\nMr. Speaker, I will, once again, thank my colleagues, Ms. Goodlander,  Mr. Wied, and Mr. Golden, for their bipartisan efforts to pass this  legislation.\n\nBy strengthening…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697282/office-of-rural-affairs-enhancement-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…wondering if the new language would cover Changpeng Zhao, who  just  received a pardon from President Trump.\n\nMr. RASKIN. Madam Speaker, I have no further speakers, and I am  prepared to close.\n\nMadam Speaker, again, I strongly support this legislation. We need to  be doing whatever we can to eliminate terrorist forces and those who  are providing critical…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697236/no-immigration-benefits-for-hamas-terrorists-act-of-2025"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…the interests of United States'  national security.\n\nMr. Chairman, I yield 1 minute to the gentleman from Ohio (Mr.  Turner).\n\nMr. SMITH of Washington. Mr. Chair, I am prepared to close.\n\nMr. Chairman, I agree with all of the arguments that were made. I  think the most crucial point here is that the United States of America  is the most economically…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695253/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…reserve the balance of my  time.\n\nMs. WATERS. Mr. Speaker, I continue to reserve the balance of my  time.\n\nMs. WATERS. Mr. Speaker, I have no further speakers, and I am  prepared to close if the gentleman from Arkansas has no further  speakers.\n\nMr. Speaker, let me again reiterate that a vote for S. 1582 is a vote  to give Trump the pen to write the rules…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693839/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…This bill would ensure the  same standard for all Americans regardless of how they file.\n\nMr. DAVIS of Illinois. Mr. Speaker, I have no further requests for  time so I am prepared to close.\n\nMr. Speaker, H.R. 1152 is a narrowly targeted bill that can provide  meaningful help and assurance to taxpayers.\n\nMr. Speaker, I urge my colleagues to support it, and…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689374/electronic-filing-and-payment-fairness-act"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…us  meaningfully forward.\n\nMs. CRAIG. Mr. Speaker, I have no other speakers at the moment. I  continue to reserve the balance of my time.\n\nMs. CRAIG. Mr. Speaker, I am prepared to close, and I reserve the  balance of my time.\n\nMr. Speaker, I, too, would like to thank the gentleman from  Pennsylvania, Chairman G.T. Thompson, and his team for working on…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693791/digital-asset-market-clarity-act-of-2025"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…colleagues to vote ``yes'' on H.R. 1325, and I  reserve the balance of my time.\n\nMs. STEVENS. Mr. Speaker, I have no further requests for time to  speak on this bill, and I am prepared to close.\n\nMr. Speaker, it is always a good thing when we have a Lucas bill, and  particularly when it is a bipartisan bill, and usually it is. You just  heard his remarks in…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688973/commercial-remote-sensing-amendment-act-of-2025"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…before, and I will thank again, all of the law enforcement and the men  and women who keep us safe in this Capitol. I appreciate what they do  for us.\n\nMr. Speaker, I am prepared to close if the gentleman is prepared to  close. I don't have any additional speakers. I reserve the balance of  my time.\n\nMr. Speaker, let me just say to the gentleman: You say…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692813/providing-for-consideration-of-hr-military-construction-veterans-affairs-and-related-agencies-appropriations-act-providing-for-consideration-of-hr-special-interest-alien-reporting-act-of-providing-for-consideration-of-hr-jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-and-providing-for-consideration-of-h-res-condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…provisions of this bill.\n\nFor those reasons, Mr. Speaker, I recommend a ``no'' vote on the bill  and reserve the balance my time.\n\nMr. SCOTT of Virginia. Mr. Speaker, I am prepared to close, and I  reserve the balance of my time.\n\nMr. SCOTT of Virginia. Mr. Speaker, may I inquire how much time is  remaining.\n\nMr. Speaker, when you hear the title, PROTECT…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697533/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…company in the country.\n\nI urge my colleagues to support this bill, and I reserve the balance  of my time.\n\nMr. SHERMAN. Mr. Speaker, I have no further speakers, and I am  prepared to close after hearing that the other side has no further  speakers. I yield myself the balance of my time.\n\nAs I have discussed, H.R. 2808 is an important positive step to  strengthen…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692804/homebuyers-privacy-protection-act"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…are talking about everything that has nothing to do  with this rule. I believe that I have exhausted all of my comments that  are directly related to the rule, so I am prepared to close at the  appropriate time. If we keep bringing up new issues, I may feel  compelled to respond.\n\nMr. Speaker, if we are just talking about the rule that deals with  these…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697302/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…away managing the land where you live. I  thank her for her efforts on behalf of her constituents and on all  Americans who enjoy outdoor recreation.\n\nMr. Speaker, I am prepared to close and continue to reserve the  balance of my time.\n\nI just want to say that it is unfortunate that we are having to use a  Congressional Review Act, but it is unfortunate…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690405/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…Speaker, I yield such time as he may  consume to the gentleman from Florida (Mr. Patronis).\n\nMr. WILLIAMS of Texas. Madam Speaker, I have no further speakers, and  I am prepared to close.\n\nMr. WILLIAMS of Texas. Madam Speaker, H.R. 5788 provides transparency  to the SBA's 504 loan program, a key program that promotes job creation  and small business growth.…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699188/504-program-risk-oversight-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…continue to look for bipartisan  ways to make the SBA Office of Advocacy more effective in helping our  American small businesses.\n\nMr. WILLIAMS of Texas. Mr. Speaker, I am prepared to close, and I  reserve the balance of my time.\n\nMr. WILLIAMS of Texas. Mr. Speaker, I urge my colleagues to support  this commonsense legislation, and I yield back the balance…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687957/small-business-advocacy-improvements-act-of-2025"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…Swalwell, for leading the House version of this legislation, H.R. 820,  through the committee earlier this year.\n\nMr. GARBARINO. Madam Speaker, I have no more speakers and am prepared  to close after the gentleman from Puerto Rico closes. I reserve the  balance of my time.\n\nMr. GARBARINO. Madam Speaker, I yield myself the balance of my time.\n\nI congratulate…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696791/bottles-and-breastfeeding-equipment-screening-enhancement-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…gentleman from Minnesota (Mr. Stauber), the  chairman of the Energy and Mineral Resources Subcommittee of the  Natural Resources Committee.\n\nMr. WESTERMAN. Mr. Speaker, I am prepared to close and continue to  reserve the balance of my time.\n\nSince my colleague mentioned the SPEED Act, which we will be marking  up in committee on Thursday, even though it is…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696879/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Congressman Flood and Chairman Hill for their  work on this resolution, and I urge my colleagues to support this  resolution.\n\nMr. HILL of Arkansas. Mr. Speaker, I am prepared to close, and I  reserve the balance of my time.\n\nMr. Speaker, let me say that, again, we are talking about unelected  bureaucrats in an agency that is not following the strict…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689950/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Representative Fulcher for their  leadership on this particular bill, and I urge my colleagues to join me  in voting in favor of H.R. 1737.\n\nMr. BILIRAKIS. Mr. Speaker, I am prepared to close, and I reserve the  balance of my time.\n\nMr. BILIRAKIS. Mr. Speaker, I commend the gentlewoman from the Virgin  Islands (Ms. Plaskett) for offering this very important…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692701/assessment-of-trans-atlantic-submarine-fiber-optic-cable"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…Mr. Speaker, I urge my colleagues to support H.R. 3657, and I reserve  the balance of my time.\n\nMr. LATTA. Mr. Speaker, I have no further speakers on the bill. I am  prepared to close if the gentleman is, and I reserve the balance of my  time.\n\nMr. LATTA. Mr. Speaker, all the reports that we have across this  country state that we have been producing…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693478/hydropower-licensing-transparency-act"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…we must all come together to reaffirm our  commitment to protecting the peace and civility that define the America  that I know and love.\n\nMr. COMER. Mr. Speaker, I am prepared to close, and I reserve the  balance of my time.\n\nMr. COMER. Mr. Speaker, I join my House colleagues in offering my  deepest condolences to the people of Minnesota.\n\nI particularly…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692859/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…2988 is essential to restore the neutrality of financial factor- only evaluation when investing to protect America's retirement savers.\n\nMr. WALBERG. Mr. Speaker, I am prepared to close, and I reserve the  balance of my time.\n\nLet me close with this: H.R. 2988 is about keeping retirement  investing focused on what matters--protecting workers and retirees.…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699160/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…thank the lead sponsor of this legislation,  Representative Yakym, for his hard work on this bill, and I reserve the  balance of my time.\n\nMr. CRANK. Mr. Speaker, I am prepared to close, and I reserve the  balance of my time.\n\nMr. CRANK. Mr. Speaker, the Studying NEPA's Impact on Projects Act  will provide Congress with crucial information on NEPA litigation.…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697711/studying-nepas-impact-on-projects-act"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…Enforcement Officer Safety and Wellness Through Data Act,  and let's ensure that our Nation's police forces know that we have  their back.\n\nMr. FRY. Mr. Speaker, I am prepared to close, and I reserve the  balance of my time.\n\nMr. FRY. Mr. Speaker, before I close, I yield 2 minutes to the  gentleman from North Carolina (Mr. Moore).\n\nMr. MOORE of North…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691319/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…D.C. It has nothing to do with their quest to continue to  defend the rioters and illegals in California.\n\nMr. COMER. Madam Speaker, I have no further speakers, and I am  prepared to close. I yield myself the balance of my time.\n\nMadam Speaker, in closing, I note that H.R. 2096 is endorsed by the  National Fraternal Order of Police. I strongly encourage…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692305/protecting-our-nations-capital-emergency-act"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…House. I hope my colleagues on the other  side will reflect on this, will reconsider, and will do the right thing  and vote for this bill.\n\nMr. KNOTT. Madam Speaker, I am prepared to close, and I reserve the  balance of my time.\n\nMr. KNOTT. Will the gentleman yield?\n\nMr. KNOTT. The issue with your characterization, sir, is number one,  someone who enters…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695365/stop-illegal-entry-act-of-2025"}]