[{"senator": "Angie Craig", "party": "Democrat", "sentence": "…meaningfully forward.\n\nMs. CRAIG. Mr. Speaker, I have no other speakers at the moment. I  continue to reserve the balance of my time.\n\nMs. CRAIG. Mr. Speaker, I am prepared to close, and I reserve the  balance of my time.\n\nMr. Speaker, I, too, would like to thank the gentleman from  Pennsylvania, Chairman G.T. Thompson, and his team for working on this…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693791/digital-asset-market-clarity-act-of-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…the request  of the gentleman from New York?\n\nMr. PALLONE. I yield 4 minutes to the gentlewoman from New Mexico  (Ms. Stansbury).\n\nMr. PALLONE. Mr. Speaker, I am prepared to close, and I reserve the  balance of my time.\n\nMr. Speaker, I have to respond to the chairman of our committee who,  of course, I respect a great deal.\n\nThe Republicans have never…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698564/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…inquire as to how much  time is remaining.\n\nMr. SMITH of Washington. Mr. Speaker, I reserve the balance of my  time.\n\nMr. SMITH of Washington. Mr. Speaker, I am prepared to close, and I  reserve the balance of my time.\n\nMr. Speaker, the first thing I will say is we have mentioned  repeatedly ``acquisition reform,'' which is such a huge part of this  bill…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697790/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…of this bill.\n\nFor those reasons, Mr. Speaker, I recommend a ``no'' vote on the bill  and reserve the balance my time.\n\nMr. SCOTT of Virginia. Mr. Speaker, I am prepared to close, and I  reserve the balance of my time.\n\nMr. SCOTT of Virginia. Mr. Speaker, may I inquire how much time is  remaining.\n\nMr. Speaker, when you hear the title, PROTECT Our Kids…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697533/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…about their  bartenders helping out cooks, hosts, and other nontipped employees, all  who often work in a fast-paced environment.\n\nMr. WALBERG. Mr. Speaker, I am prepared to close, and I reserve the  balance of my time.\n\nMr. WALBERG.\n\nMr. Speaker, we can all agree that our Nation's workers deserve to be  compensated fairly. H.R. 2312, the Tipped Employee…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698965/tipped-employee-protection-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…urge my colleagues to vote ``yes'' on H.R.\n\nMr. WILLIAMS of Texas. Madam Speaker, I reserve the balance of my  time.\n\nMr. WILLIAMS of Texas. Madam Speaker, I am prepared to close, and I  reserve the balance of my time.\n\nMr. WILLIAMS of Texas. Madam Speaker, H.R. 5763 allows small  businesses on Main Street to have equal access to SBA 504 loans. I urge…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699166/main-street-parity-act"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…broke it, but please join us to fix it.\n\nMr. WALBERG.\n\nMr. WALBERG. Mr. Speaker, may I inquire how much time I have  remaining.\n\nMr. WALBERG. Mr. Speaker, I am prepared to close, and I reserve the  balance of my time.\n\nMr. WALBERG. Mr. Speaker, I am prepared to close, and I reserve the  balance of my time.\n\nMr. Speaker, most Americans rely on employer-provided…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698404/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…Speaker, I am pleased to have worked with Ranking Member Morelle  on these efforts. I urge my colleagues to vote in favor of H.R.\n\nMr. STEIL. Mr. Speaker, I am prepared to close, and I reserve the  balance of my time.\n\nMr. Speaker, I thank the gentleman from New York (Mr. Morelle), the  ranking member on the Committee on House Administration, for his…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688200/semiquincentennial-congressional-time-capsule-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…Kansas (Mr. Estes).\n\nMr. SMITH of Missouri. Madam Speaker, I yield 3 minutes to the  gentleman from Florida (Mr. Bean).\n\nMr. SMITH of Missouri. Madam Speaker, I am prepared to close, and I  reserve the balance of my time.\n\nMr. SMITH of Missouri. Madam Speaker, I yield myself such time as I  may consume.\n\nMadam Speaker, this bill is another piece of the puzzle…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698922/ending-improper-payments-to-deceased-people-act"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…bites. We have to actually sit down and  have those discussions, and that is what getting the government back  open will do.\n\nMrs. FISCHBACH. Mr. Speaker, I am prepared to close, and I reserve  the balance of my time.\n\nMrs. FISCHBACH. Mr. Speaker, I am prepared to close, and I reserve  the balance of my time.\n\nAs we wrap up this debate, I want to take…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696682/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "French Hill", "party": "Republican", "sentence": "…chair of the House Labor,  Health and Human Services, Education, and Related Agencies Subcommittee  on Appropriations.\n\nMr. HILL of Arkansas. Mr. Speaker, I am prepared to close, and I  reserve the balance of my time.\n\nMr. Speaker, I thank Mr. Aderholt for using this historic precedent  to, again, have a numismatic memory of our semiquincentennial with…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699867/for-americas-250th-act"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…remember their position in  2017 and call it trash.\n\nCould it be mere political posturing for November elections? I submit  it is.\n\nMr. GRIFFITH. Mr. Speaker, I am prepared to close, and I reserve the  balance of my time.\n\nMr. Speaker, the gentleman is absolutely correct on this one point.  If what they want is socialized medicine, yes, I am against it and…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698304/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…balance of my time.\n\nMr. LATTA. Madam Speaker, I yield 4 minutes to the gentleman from the  Third District of Georgia (Mr. Jack).\n\nMr. LATTA. Madam Speaker, I am prepared to close, and I reserve the  balance of my time.\n\nMr. LATTA. Madam Speaker, I yield myself the balance of my time.\n\nMadam Speaker, we have heard from various speakers today, but I think…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688289/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…taxpayer  dollar, and address illegal immigration, but know that it will be a  vote against the will of the American people.\n\nMrs. FISCHBACH. Mr. Speaker, I am prepared to close, and I reserve  the balance of my time.\n\nMr. Speaker, I will clarify some things. My colleague continues to  talk about the tax bill, which is not actually in front of us right…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691940/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…enactment, nor will they be realized as a result of  enactment of this strengthening of that underlying statute for our  officers.\n\nMr. SCHMIDT. Mr. Speaker, I am prepared to close, and I reserve the  balance of my time.\n\nMr. SCHMIDT. Mr. Speaker, I thank the distinguished ranking member  for his argument and advocacy today.\n\nI would just point out to the…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691241/leosa-reform-act"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…and our economy. This  bill passed the House in the 117th and 118th Congresses, and I urge my  colleagues to pass it again today.\n\nMr. BABIN. Mr. Speaker, I am prepared to close, and I reserve the  balance of my time.\n\nMr. Speaker, as teachers prepare the next generation of American STEM  workers, we must invest in the best curricula and teaching methods.…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688976/mathematical-and-statistical-modeling-education-act"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…and they will pursue them  wherever they might be, political correctness be damned. Americans are  better off under this approach.\n\nMs. FOXX. Mr. Speaker, I am prepared to close, and I reserve the  balance of my time.\n\nMr. Speaker, this majority continues to roll up its sleeves and  advance the core priorities of the American people and President Trump.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699072/providing-for-consideration-of-hr-financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…question. I wish I would get  an answer to the question of why did they set them to expire and why is  the Affordable Care Act not working.\n\nMr. Speaker, I am prepared to close, and I reserve the balance of my  time.\n\nMr. Speaker, my point when I talked about the Affordable Care Act is  that once it was in place, I wish it had worked. I wish what was…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698566/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…Florida. Mr. Speaker, this is a huge win for  our national security and for all Americans, and I urge my colleagues  to support it.\n\nMr. COLE. Mr. Speaker, I am prepared to close, and I reserve the  balance of my time.\n\nMr. Speaker, I will begin by recognizing the hard work of my  distinguished ranking member and my very good friend, Ms. DeLauro from…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698749/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}]