[{"senator": "Haley Stevens", "party": "Democrat", "sentence": "…think we need a very comprehensive industrial policy that matches  the moment of time that we are in, Mr. Speaker. Of course, strategic  tariffs that the previous President and the President before did have  helped, but we are feeling the squeeze in Michigan, and it is news  unfolding before our eyes.\n\nAgain, I reference the article here: ``A stunning…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689752/reflecting-on-americas-history"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…invited--Democratic and Republican Senators and Congressmen--to discuss  the issue, and they, frankly, didn't agree with the conclusions which  we brought to the President.\n\nThe President spoke at length on his views about immigration. The  conversation declined at some point to a level I had never expected to  witness in my life. The President started…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697820/donald-trump"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…Democratic side, as opposed to the five that  are produced on the Republican side, then we are still at equilibrium,  where we are now.\n\nThat is not good enough for the President. The President has his eye  on Missouri. There is an African-American seat in Missouri that the  President is eyeing, as it were, a President who believes that all of  this is just…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694943/bloody-sunday-and-voting-rights-act"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "Mr. WELCH. Mr. President, every President of the United States has a  right to review and realign programs funded by Congress, but only if  the President acts in a way that complies with the law.\n\nIn the…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688467/usaid"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…in due process or not? Do you believe that final  orders of the U.S. Supreme Court should be respected or not? Those are  the questions at issue on S. Res. 195.\n\nOur President, President Trump, has entered into an agreement still  shrouded in some secrecy with the President of El Salvador, President  Bukele, to deport American residents into El Salvador…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691406/motion-to-discharge-s-res-195"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "Mr. MERKLEY. Mr. President, President Trump is engaged in massive  corruption. There is a ``government for sale'' sign flashing its lights  on the lawn of the White House. He is selling access and influence…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692355/motion-to-discharge-sj-res-54"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…break, but it is  really money out of your pocket that is being returned to you in a  diminished fashion. This is the art of the steal as is being perfected  by our President.\n\nOur President understands also that there are other ways to get money  into the coffer, the Treasury. You can get money into the Treasury by  simply having Medicare or Medicaid--have…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690093/protecting-the-american-dream"}, {"senator": "Joaquin Castro", "party": "Democrat", "sentence": "…January 3, the President ordered a military operation to capture  Nicolas Maduro and install the President's hand-picked successor, Delcy  Rodriguez, as the interim president.\n\nPresident Trump went to war, removed a leader, and established a  puppet government.\n\nThe President executed this transition when the most popular  opposition leader, Nobel Prize…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699362/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "Mr. MERKLEY. Mr. President, President Trump has developed a new MAHA  strategy. Instead of Make America Healthy Again, his new strategy is  ``Make America Hungry Agenda.'' He is weaponizing food against…", "date": "2025-11-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696499/unanimous-consent-request"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…of funding. Right now, people can use TANF dollars for  funding. That is how it has always been. This is just protecting that  it continues to do so because the prior President, President Biden,  decided to try to eliminate it for the first time in history. We are  trying to prevent it so that no future administration can do that. Mr.  Speaker, I do want…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699222/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…you won't escape history.\n\nHouston Chronicle, you won't escape history.\n\nNow, I want to say just a word about the top culprit in the process,  and that would be the President. The President is the biggest dastard  in the country. President Donald Trump is dastard number one.\n\nThis says: ``Countdown to Impeachment.'' This is the President of the  United…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700075/black-history-stolen-legacies"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "Ms. WARREN. Mr. President, President Trump took a strong American  economy and broke it in less than 100 days.\n\nRight now, Republican Senators are at a crossroads. Will they vote to  stop Trump's chaotic…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690534/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…regardless of  precedent, regardless of the Constitution.\n\nMr. Bove has a long history of defending Donald Trump when he was his  personal attorney. He defended the President when the President was  accused of inciting the January 6 insurrection, mishandling classified  documents, falsifying business records, and more.\n\nSo what should that do when someone…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693921/nomination-of-emil-j-bove-iii"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "Mr. Speaker, I strongly oppose this bill, which would eliminate the  D.C. Judicial Nomination Commission and give a President, any  President, the sole power to make nominations for D.C. local courts,  which deal with municipal issues.\n\nRight now, under the Home Rule Act, the D.C. Judicial Nomination  Commission…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695613/district-of-columbia-judicial-nominations-reform-act"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…this Congress--sets a harmful precedent.  It undermines the ability of Congress to make a serious and well- documented case for impeachment against this or any future president.\n\nPresident Trump was impeached twice during his first term, and I  voted to impeach him both times. We conducted a formal inquiry during  the first impeachment, where we subpoenaed…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698091/concerns-with-h-res-939"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…itself: Are we on the rise or decline?\n\nTo answer that question, we need to look at where we have been for  the last year. We need to look at the results that this President,  President Trump, and where the House Republican leadership has taken  this country over the last year.\n\nTogether, we have accomplished real results. It starts with tax  relief…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699278/highlighting-republican-successes-in-2025"}, {"senator": "James Risch", "party": "Republican", "sentence": "…ask us for permission to do it.\n\nSo these actions are political, pure and simple. These actions here  are political. This was a good decision on the part of the President,  and the President acted legally. So what are my Democratic friends  doing here? They are putting forth this joint resolution No. 83 to stop  the President from acting in the way…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696121/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Bill Hagerty", "party": "Republican", "sentence": "Mr. HAGERTY. Mr. President, President Trump's actions to address  Iran's nuclear weapons program last weekend didn't start a war; they  ended a war. So I rise today to support President Trump's wisdom and…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693130/motion-to-discharge-sj-res-59"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…the cattle community and  remains involved with the Kern County Cattlewomen. Over the past nine  years, she has served in numerous leadership roles, including Vice  President and President. Currently she serves as Secretary and on the  Board of Directors, chairs the organization's annual Clay Shoot, and  has chaired the Scholarship Committee for seven…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696714/recognizing-april-woody"}, {"senator": "Rick Scott", "party": "Republican", "sentence": "…laid upon the table; and that the  President be immediately notified of the Senate's action and the Senate  resume legislative session.\n\nMr. SCOTT of Florida. Mr. President, the President deserves his  national security nominees today. Let me see if we will consider this  one: Brandon Williams to be Under Secretary for Nuclear Security,  Military Health…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691405/motion-to-discharge-s-res-195"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…rule of law and secure borders and enforcement of the law and removal  of criminals is meeting resistance at every turn. Even this moment of  reprieve in which the President, President Trump, is restoring common  sense by eliminating DEI, CRT, and all this stuff in our agencies and  our Pentagon, even this moment of reprieve is just that, a moment…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695203/people-are-sick-and-tired"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…have to act seriously. We know that. It is a matter of common  sense.\n\nPresident Putin in Russia is not acting with respect toward the  United States of America or President Trump. President Putin is not  acting seriously.\n\nI don't know a single fairminded person with an IQ above his age who  doesn't want peace in Ukraine. We all want to see peace in…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689486/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…Deal agenda.\n\nWe sat idly by and watched our country get invaded by at least 10  million people that came across our country's borders with the direct  will of the President to do it. President Trump has proven in just less  than 2 short months the ability for a President to roll this all back  with executive orders. Yet, the cost to New York alone was…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688464/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing-and-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…need to  run their economy. They will do that if we don't step in and do this at  this time.\n\nMr. GUTHRIE. Mr. Speaker, this bill does nothing to prohibit the  President, or whoever is President, from limiting LNG exports,  sanctioning China, or tariffing China. There is no limit to that.\n\nThe people who are begging, I can tell you, Mr. Speaker, for our…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697089/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…Prior to leaving, I think it is important one more time to address  what I think is the most significant issue this Congress and next  Congress and that this President and the next President is going to  have to deal with. How we address this issue will determine whether  America fundamentally changes or not. That issue is immigration.\n\nWe see it on…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699344/fundamentally-changing-immigration"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…also trafficked over 300,000 children, and who knows what hell  those young people are in right now because of our callousness.\n\nThat has not happened under this President, though. Under President  Trump's leadership, the border is now completely shut down. That means  safer streets, safer schools, and safer communities, Mr. Speaker.\n\nIn my own community,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690429/the-first-100-days"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "Mr. COONS. Mr. President, I rise to bring the attention of this body  to a broken promise by our President. Our President promised, in the  campaign and recently in an address to all of us here in Congress, to  make America affordable again; to deal with the high prices of  groceries,…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689488/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "James Risch", "party": "Republican", "sentence": "…a break. He hasn't brought an end to the Maduro regime. The       Maduro regime is more powerful today and more entrenched       today than it was when the President began.\n\nWell, the President changed that. He removed Maduro. Do you know what  that same Senator says today?\n\nThis is reckless. And the American people are just, this       morning, in…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698707/venezuela"}]