[{"senator": "Al Green", "party": "Democrat", "sentence": "…am going beyond these Articles of Impeachment. I am going to file  additional Articles of Impeachment this month, and these articles will  relate to not only the President but also the Vice President. Both of  them should be removed from office, President and Vice President, and I  will present these Articles of Impeachment to this House this month.…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692296/and-still-i-rise-denouncing-the-presidents-authoritar-ianism-and-recognizing-the-impeachment-warriors"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…said. It is why I  want to speak today about the soon-to-expire New START treaty and the  very real possibility of a new nuclear arms race, something that  neither the President, the Vice President, nor any other senior  official has even mentioned, but it is looming.\n\nIt is important to step back a moment and understand how we got to  this point. There…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694014/new-start-treaty"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…SEC.\n\nSurely, each of my colleagues can see how this is a blatant conflict  of interest. Democrats do. It is why I introduced the Stop Trump and  Crypto Act to ban the President, Vice President, and all the Members of  Congress from crypto corruption.\n\nIf we do not ban elected officials, including the President or Vice  President, from this crypto corruption…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693777/digital-asset-market-clarity-act-of-2025"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…to the House  Committees on Financial Services and Agriculture expressing our serious  concern that the CLARITY and GENIUS Acts, including dangerous carveouts  for the President and Vice President from conflict-of-interest rules.\n\nS. 1582, the GENIUS Act, is a bipartisan attempt at establishing a  framework for stablecoins--a type of cryptocurrency primarily…", "date": "2025-07-25", "source_url": "https://justfacts.votesmart.org/public-statement/1694254/9999"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…Security Advisor of the United  Arab Emirates. This company is absolutely intertwined with this foreign  government. Our Constitution forbids this type of gift to a President  or a Vice President or any one of us.\n\nSo here is the fact: We are right now debating a bill dealing with  cryptocurrencies, so this is the time to debate and vote on an  amendment…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692355/motion-to-discharge-sj-res-54"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…provides:\n\nThe District constituting the seat of Government of the       United States shall appoint in such manner as the Congress       may direct: A number of electors of President and Vice       President equal to the whole number of Senators and       Representatives in Congress to which the District would be       entitled if it were a State, but in no…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695559/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…more efficient and effective.\n\nI did this myself when I was Deputy Secretary in the Clinton  administration at the Department of the Interior. We were told by the  President and the Vice President that it was time for reform, and we  set about to do it.\n\nIn the Department of the Interior alone, we had just over 100,000  employees at the National Park…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688233/democratic-proposals"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…provides:\n\nThe District constituting the seat of Government of the       United States shall appoint in such manner as the Congress       may direct: A number of electors of President and Vice       President equal to the whole number of Senators and       Representatives in Congress to which the District would be       entitled if it were a State, but in no…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696933/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…speak  about the New START Treaty, which expires on February 5, and the very  real possibility of a new nuclear arms race--something that, to my  knowledge, neither the President, Vice President, nor any other senior  U.S. official has meaningfully discussed.\n\nThe decision to start a nuclear war can be made by a single  individual--the President of the…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699676/the-new-start-treaty"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…invade foreign countries and threaten  our allies, but claims to not have enough money to fund American  healthcare.\n\nMr. Speaker, the American people want to know why the President and  Vice President are giving cover for lawless shootings by Federal agents  while using political excuses to withhold funding for our communities,  for public safety, housing,…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698893/holding-president-trump-accountable"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…ago. Putin cannot keep a deal.\n\nThis should make it crystal clear that dictator Vladimir Putin and  his thug state cannot be trusted. Read history. Why would the U.S.  President, Vice President, Secretary of State, or any world  leader believe that communist dictator Vladimir Putin and the Russian  regime will hold to any peace agreement? Russia never…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690215/supporting-ukraines-independence"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…on both bills.\n\nMr. SHERMAN. Mr. Speaker, this shows what Trump had to say about  crypto before he learned he could make money from it.\n\nThe bills we have allow the President and the Vice President to  sponsor crypto. It means they can print their electronic monopoly  money. China is buying $300 million, and Abu Dhabi has agreed to buy $2  billion of…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693667/afl-cio-scoring-crypto-bills"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…previous question.  If we do, I will offer an amendment to the rule to make in order  amendment No. 10 to the SAVE America Act, which prohibits Members of  Congress, the President, the Vice President, their spouses, and  dependents from owning or trading stocks.\n\nMr. McGOVERN. Mr. Speaker, to discuss our proposal, I yield 2 minutes  to the gentleman from…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699941/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "…support of long-overdue  legislative measures to prevent Members of Congress from trading stock.\n\nThe original STOCK Act passed in 2012 bars a Member of Congress, the  President, Vice President, and high-level staff from engaging in  insider trading or otherwise using nonpublic information for their own  benefit. The bill also included important updates…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691213/stock-trading-ban-for-members-of-congress"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…provides:\n\nThe District constituting the seat of Government of the       United States shall appoint in such manner as the Congress       may direct: A number of electors of President and Vice       President equal to the whole number of Senators and       Representatives in Congress to which the District would be       entitled if it were a State, but in no…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695641/district-of-columbia-policing-protection-act"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…might check the ambition of the other--all of this in  pursuit of the restraint of power.\n\nYet, as I have watched in the last year the remarks and the actions  of our President and Vice President, they are chillingly rhyming with  those of dictators like President Xi and President Putin of the PRC and  Russia--the growing and steady use of unrestrained…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699917/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…this that they don't want to tell us  what it is going to cost. Of course that irritates me, but most  importantly, it is not fair to the consumer.\n\nToday, we have a President, we have a Vice President, and we have a  Secretary of Health and Human Services all on record supporting this  commonsense measure to require prescription drug ads to list the price…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694205/military-construction-veterans-affairs-and-related-agencies"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "…his passion for the political  arena, an opportunity he contributed to his later years of service to  Florida's agricultuie industry.\n\nFrom 1993 to 2000, Bobby served as President, Vice President, and  Director of the Orange County Cattlemen's Association. It was  during this tenure that he also began serving on the Orange County  Agricultural Advisory…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688335/in-memory-of-mr-bobby-beagles"}]