[{"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…think we need  accountability, and we need the facts. They haven't been forthcoming.\n\nMr. BLUMENTHAL. What I hear from the other side is, essentially,  ``Give the President whatever he wants in the name of his having the  prerogative.'' He should name his own team, but we have a  responsibility. It is a constitutional obligation. ``Advice and  consent''…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691398/motion-to-discharge-s-res-195"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…or clean water we have.\n\nInstead, they are worried about the next time we have a President who  actually cares about protecting public health and the environment, a  President who wants to restore the bedrock environmental laws that the  Republicans have gotten rid of.\n\nRepublicans then want to use this bill as a shield to protect  polluters. If the…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698275/reliable-power-act"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…hard-earned money because this is going to  translate into increased costs.\n\nThis isn't partisan. This isn't Democrat-Republican. This is math.  And no matter how much the President wants to strut on the South Lawn-- and I am glad to see at least the South Lawn was being used for an  announcement today as opposed to another day of a Tesla show lot--who…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689480/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Jimmy Panetta", "party": "Democrat", "sentence": "…adventurism can also create instability not  just in Venezuela, but in the region, and that creates insecurity for  the United States.\n\nAs we saw this week about Greenland, the President wants spheres of  influence rather than stability from a rules-based order. Instead of  standing up to China and Russia, the President just wants to impress  them by acting…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699363/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…resolution, which would overturn  President Trump's really sham energy emergency.\n\nAt a time when the United States is already producing record amounts  of oil and gas, the President wants to bypass laws and explore eminent  domain to fast-track fossil fuel projects--not alternate energy  projects, fossil fuel projects--and really not to lower prices or…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688190/sj-res-10"}, {"senator": "Ruben Gallego", "party": "Democrat", "sentence": "…have not seen, have not heard of  the House of Representatives leaving Washington, DC, since we had to  get away from the redcoats, but that is what happened because this  President wants to avoid accountability, and this President wants to  continue to cover up for his elite friends.\n\nMr. GALLEGO.  My colleague from  Oklahoma refused to join me in calling…", "date": "2025-07-24", "source_url": "https://justfacts.votesmart.org/public-statement/1694235/9999"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…oath to the Constitution--not to a King,  not to a party, not to any one person. Nobody gets to rewrite the  Constitution--not a President, not an adviser, no one.\n\nIf the President wants to use force abroad or at home, he needs to  come to this body and explain it publicly to the American public.", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696126/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…fraudsters  themselves in a more efficient manner.\n\nThere are so many things that we could do if we came together as a  body. But what are we doing instead? Following our President that wants  his tax cuts renewed.\n\nWhat did those tax cuts do the first time around? Most of the  benefits went to the wealthiest people and corporations, and it drove  trillions…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…in  the aftermath, including Officer Brian Sicknick who died the very next  day after receiving grievous wounds and injuries.\n\nWe could be doing a lot more for them. President Trump wants a fund  for January 6. That is good, right? No. He wants a fund for the  rioters' families. He wants a fund for the insurrectionists that he  pardoned, not for the…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691349/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…which is also,  unfortunately, still familiar today.\n\nYet in the face of this hateful, dehumanizing rhetoric, Mother  Cabrini responded not with fear or hatred--what our President wants-- but with bold, unwavering love and compassion.\n\nAs the founder of the Missionary Sisters of the Sacred Heart of  Jesus, she built a movement grounded in hope, service,…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692932/holding-power-accountable"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…because of the policies  coming from this administration. Nearly 8 million Americans get  healthcare through Medicaid and through CHIP, which is on the chopping  block.\n\nThis President wants to cut $5.6 billion from the Department of  Education. The House Republicans' budget  includes $330 billion in cuts. Pell grants, school lunches, Head Start,  and everything…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690637/trumps-first-100-days"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…shared, and there should be no disagreement on that. We didn't exercise  oversight on that either, so stepping aside from all of these issues,  simply letting the President do what he wants to do.\n\nThen, internationally, the last point, this attack on that boat down  in the Caribbean is incredibly problematic. This is an expansion of the  war powers…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695253/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…intimidation or election interference.\n\nIt is amazing we would have to say that. It is amazing that we would  have to think about addressing that, but that is what the President  wants. Now don't put it past him to try. It is time to send the  administration a clear message that the United States of America's  elections will be decided by the voters,…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700066/9999"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…month, home prices hit a record high, and these tariffs could add more  than $10,000 to the cost of a home. Coffee prices hit a record high  earlier this year, and now President Trump wants to put a 50-percent  tariff on Brazil--our largest source of coffee. As families do their  back-to-school shopping, they are going to see higher prices for  clothing…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694454/9999"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…both parties, saying on the Senate floor:\n\n[Now], far too often, the Senate has stepped out of our       historic role in foreign policy and [has] said: Whatever the       President wants, we, the Senate, aren't going to say anything       about it.\n\nWhen there is a Republican President, Democrats suddenly       discover their voice and say: Hey, the Senate…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699091/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…power. People can't afford it. They can't  pay their way to live. They can't raise their family.\n\nThis power is way bigger than that. We have got to stop this. We have  a President who wants to stop it. He issued an executive order, but we  don't have a legislature that is doing the work to stop it.\n\nWe were talking about moving crypto bills today. The Senate…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693006/central-bank-digital-currency"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…that, just  in the last year in his district, he has lost at least 140 people to  overdose, which apparently he does not want to protect his community  from those like the President wants to protect his community.\n\nSalazar), the chairwoman of the Western Hemisphere Subcommittee.\n\nMr. Speaker, to Representative Himes, I tell him that he has had 182  overdoses…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698249/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}]