[{"senator": "Alex Padilla", "party": "Democrat", "sentence": "…pollution.\n\nHow is this for another ingredient: volatile organic compounds, known  as VOCs, referred to as VOCs:\n\nThese pollutants react with nitrogen oxides in the presence       of sunlight to form ground-level ozone, a main ingredient in       smog.\n\nThough beneficial in the upper atmosphere, at the ground       level, this gas irritates the…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691583/hj-res-88"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…public service truly looks  like. Many of us here have learned from her--not just how to do our  jobs, but how to do them with purpose.\n\nWe will miss Rikki and her steady presence, her joyful spirit, and  her years of experience. But we take comfort in knowing that the values  she has instilled will continue to guide this workplace in the dozens  of…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696707/recognizing-the-career-of-erica-rikki-miller-and-her-work-on-behalf-of-michigans-3rd-congressional-district"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…to pay them; they did  good work--because of Donald Trump's tariffs.\n\nTo each of my guests tonight, you make New York proud, and thank  you--thank you--for being here. Your presence is the reminder America  needs of the real-life harm that Trump's agenda has done to our  country.\n\nFinally, there is one more thing I am looking forward to tonight-- listening…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700178/state-of-the-union-address"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…struck had turned around  prior to being hit. The Secretary of State originally claimed that one  of the boats wasn't even heading to the United States.\n\nGiven our Coast Guard presence in the region and with a sizable Navy  deployment and expansive intelligence resources, U.S. personnel could  have boarded all of these vessels, detained those aboard, seized…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696120/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…word of the chairwoman's address outlining every  component of the bills that we are considering, but for folks who are  watching, for those who have graced us with their presence in the  gallery, please understand the three bills: one regulating commercial  refrigerators; another regulating walk-in refrigerators; and the third,  a bill to give new…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689052/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers-providing-for-consideration-of-hr-defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Josh Harder", "party": "Democrat", "sentence": "…only a place of  worship, but a community rooted in compassion, justice, and shared  purpose. From its earliest beginnings in the aftermath of the Civil War  to its continued presence today, the church has grown alongside  Stockton, adapting and expanding to meet the spiritual and civic needs  of its neighbors.\n\nWhat began as a small gathering of individuals…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695384/recognizing-the-160th-anniversary-of-the-first-congregational-church-of-stockton"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…Before every move,  Officer Scisco reminds Yanziel to stop, take a moment, and think,  advice for a game of checkers and for life.\n\nThis is what public service looks like: presence, patience, and  purpose.\n\nOfficer Scisco is helping build a culture of safety and connection in  our schools, one relationship at a time. I thank him and the Cape  Henlopen…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693522/thanking-officer-robert-scisco"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…occasion to turn  his binoculars on capturing more free territory to control Ukraine and  beyond.\n\nPutin and Xi together in that situation was rather hard to look at.  Yet, their presence underscored the danger stemming from their close  and increasing cooperation, enlarging the spiderweb of tyranny led by  Russia, China, North Korea, and Iran, all of them…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691084/liberty-versus-dictatorship"}, {"senator": "Marc Veasey", "party": "Democrat", "sentence": "…Exchange serves those who serve with department  stores, restaurants, malls, wellness services, combat uniforms at cost,  school meals for military children overseas, a robust presence at  ShopMyExchange.com, a leading credit option and more.\n\nAt 130, the Exchange, now based in Dallas, Texas, is among the oldest  U.S. retailers in America--and remains a…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693374/recognizing-the-army-and-air-force-exchange-service"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…spiritual leader of 250 million Orthodox Christians worldwide.  He is also a leading figure in the dialogues among the Abrahamic  Faiths--Judaism, Christianity, and Islam--and his presence in our  Nation's capital is an opportunity to highlight the positive role  religious leaders of his stature bring to the cause of peace and  religious liberty.\n\nThe true peacemakers…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695586/recognizing-the-spiritual-head-ecumenical-patriarch-bartholomew"}, {"senator": "Scott Peters", "party": "Democrat", "sentence": "…that the methane fee demonstrates that our gas  is cleaner. Also, the consumer demand from those customers has led to  the development of technologies to detect methane, its presence, and  its concentration in a way that we can make much more efficient ways to  regulate it.\n\nA repeal would undercut responsible producers who have invested in  cutting-edge…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688174/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…administration against the Libyan National       Army's advances in 2020. Ankara's role is defended by the       Government of National Unity as a necessary bulwark against       the presence of Russia's Wagner Group private military       company--largely since rebranded and reorganized under the       Russian Defense Ministry as the Africa Corps--among the ranks…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697384/recognizing-the-importance-of-libyas-return-to-stability"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…and human dignity is  enhanced.''\n\nEcumenical Patriarch Bartholomew is a leading figure in the dialogues  of the Abrahamic Faiths--Judaism, Christianity, and Islam, and his  presence in Washington, D.C. is an extraordinary opportunity to  highlight the positive role that religious leaders of his stature bring  to the myriad causes we in Congress grapple…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695407/welcoming-his-all-holiness-bartholomew-i-ecumenical-patriarch-of-constantinople"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…has seen a Korean American, the son  of immigrants, stand in this body. I will tell you this--not just  because of his heritage, not just because of the uniqueness of his  presence on this floor, but because of the depth of his humanity, his  demonstration today of the urgency that we stand up and allow people to  see our vulnerability, see our frailty.…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697705/9999"}, {"senator": "Norma Torres", "party": "Democrat", "sentence": "…or  have false charges filed against them simply for performing oversight.\n\nCitizens should not be shot at simply for raising concerns about the  safety of children in the presence of armed men in their neighborhoods.\n\nThis approach doesn't make us safer. It disrupts local economies,  increases costs for taxpayers, and undermines the workforce that keeps…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697448/fighting-dhs-immigration-raids"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "Mr. WEBER of Texas. Gosh, Mr. Speaker, fairy tales begin ``once upon  a time.'' You know how those begin. We are hearing one today right here  in our very presence, saying that somehow the One Big Beautiful Bill  Act has caused this problem.\n\nMr. Speaker, the plain and simple fact is that America's population  is growing, our economy…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698071/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…strengthens the local economy and  supports job growth in Michigan.\n\nMr. Speaker, I applaud SABA's continued success and leadership, and I  am proud to welcome their expanded presence in St. Clair. I wish them  the very best as they open this new chapter.", "date": "2025-08-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694765/congratulating-saba-on-the-grand-opening-of-its-north-american-headquarters"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…and Prevention,  in 2023, there were more than 107,000 overdose deaths that occurred in  the United States. These staggering numbers are due in large part to  the increasing presence of fentanyl and fentanyl analogues which are  approximately 100 times more potent than morphine and 50 times more  potent than heroin. The lethal dose of fentanyl is just…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692345/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…of Constantinople, New Rome,  and Ecumenical Patriarch, on the occasion of his official visit to the  United States. His All-Holiness is a respected spiritual leader whose  presence is deeply meaningful to many people across our great Nation.  His visit coincides with his acceptance of the distinguished Templeton  Prize, a testament to his lifelong dedication…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695423/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…my colleagues to join me in welcoming His All- Holiness to the United States and celebrating this historic visit with  many Greek Orthodox Americans who are honored by his presence. This  moment is a reminder of enduring contributions that faith, family, and  the community make the strength of our Nation a great nation.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695267/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…friend to her colleagues. Known as ``Mom'' at West Branch  Post 32, she provided unwavering support to her peers, always ready  with a smile and her characteristic wit. Her presence brought warmth  and camaraderie to the department, leaving a lasting impact on those  who had the privilege of working alongside her.\n\nMr. Speaker, let us all join in congratulating…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688435/recognizing-the-retirement-of-sergeant-christine-bettis"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…Lebanon but also their neighboring countries and the United States.  That stability is more important than ever as the LAF works to  permanently disarm and destroy Hezbollah's presence in Lebanon.\n\nBuilding on the tremendous success of Israel in weakening Iran and  eliminating Hezbollah's terrorist leader network, Hezbollah is now at  its weakest point.…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693688/department-of-defense-appropriations-act-2026"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…other provision of       law, SCF shall not be liable for any soil, surface water,       groundwater, or other contamination resulting from the       disposal, release, or presence of any environmental       contamination described in subsection (b) on any portion of       the property described in section 3(b) that occurred on or       before the date…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698113/southcentral-foundation-land-transfer-act-of-2025"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…ethic that inspired colleagues and endeared him to the residents he  served. Regardless of inclement weather or personal hardship, Joseph's  dedication never faltered--his presence was a certainty, ensuring that  his community received their mail with the efficiency and reliability  that only a true public servant could provide.\n\nIn recognition of his…", "date": "2025-03-21", "source_url": "https://justfacts.votesmart.org/public-statement/1688925/recognizing-joseph-bongarzones-retirement-with-the-united-states-postal-service-after-37-years"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…mergers, said: ``Reducing the efficiency of bank  M&A can be a deterrent to healthy bank transactions. It can reduce the  effectiveness of M&A activity that preserves the presence of community  banks in underserved areas, prevent institutions from pursuing prudent  growth strategies, and actually undermine competition by preventing  firms from growing…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691498/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…to consider in the House the bill (H.R. 261) to amend       the National Marine Sanctuaries Act to prohibit requiring an       authorization for the installation, continued presence,       operation, maintenance, repair, or recovery of undersea fiber       optic cables in a national marine sanctuary if such       activities have previously been authorized…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699943/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…south,  meeting with men and women who feed this great country. They are  memories I will always treasure. He was supposed to be with me in  Pennsylvania this weekend. His presence will be sorely missed.\n\nIn a town full of self-important figures, Doug was authentically  normal. I will certainly miss his wisdom, his sense of humor, and  incredible friendship.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698715/9999"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…to consider in the House the bill (H.R. 261) to amend       the National Marine Sanctuaries Act to prohibit requiring an       authorization for the installation, continued presence,       operation, maintenance, repair, or recovery of undersea fiber       optic cables in a national marine sanctuary if such       activities have previously been authorized…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699905/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…address this gap by requiring  manufacturers of internet-connected devices that contain a microphone  or camera, but aren't marketed as consumer electronics, to disclose the  presence of these components to consumers.\n\nThis is a very important bill. I commend the vice chairman of the  Subcommittee on Commerce, Manufacturing, and Trade for sponsoring this…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690179/informing-consumers-about-smart-devices-act"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…section.\n\n(iv) The Traffic Collision Avoidance System (TCAS)       resolution advisory rates at the airport compared to the       number of arrivals at the airport.\n\n(v) The presence of parallel runways.\n\n(vi) The presence of visual flights (in this subparagraph       referred to as ``VFR'') corridors in proximity to the       airport.\n\n(vii) The presence…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700111/rotorcraft-operations-transparency-and-oversight-reform-act"}]