[{"senator": "Betty McCollum", "party": "Democrat", "sentence": "…that a war to enact regime change in Venezuela would be  a catastrophic decision. That is why these two war powers resolutions  are so critically important,\n\nPresident Trump and his administration are out of control. The  Constitution grants Congress the power to declare war and authorize  military action. Because Congress has not done so in this case,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698418/supporting-of-h-con-res-61-and-h-con-res-64"}, {"senator": "Mike Quigley", "party": "Democrat", "sentence": "…a century, we must continue to stand up to  tyrants and defend freedom. We have learned that isolationism and  appeasing autocrats is a losing strategy. As President Trump and his  administration continue to push for negotiations between Ukraine and  Russia, I encourage them to remember history. Remember the reasons we  fought the Second World War and…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691085/liberty-versus-dictatorship"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…American or Muslim  American, that you are somehow a lesser American. And rather than being  a leader who elevates our morality, who confronts these views,  President Trump and his administration seem deliberately intent on  preying on these kinds of fears and deepening divisions based on  religion or immigration status.\n\nJust last month, the administration…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698866/commerce-justice-science-energy-and-water-development-and-interior"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…to an employee stock ownership plan, it is 100  percent owned by the employees who built the company.\n\nI know how to create jobs, and I know that with what President Trump  and his administration are doing, they are not going to deliver. I am,  unfortunately, not surprised.\n\nWhy is this? I think it is best summarized, actually, by paraphrasing  the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695605/devastating-harm-caused-by-trump-administration"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…organization supposedly       focused on eliminating waste, fraud and abuse.\n\nOn February 14, 2025, scientists and medical researchers       began to be dismissed by President Trump's administration.       They were told it was due to probationary status and poor job       performance. Nothing could be further from the truth. I know       because one of them…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694772/president-trumps-attack-on-the-federal-workforce"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…embraced: democracy, equality, individual       liberty, and human rights.\n\nThat moral foundation is now in grave danger. The challenge       comes from within, as President Trump and his administration       have assaulted the pillars of our democracy here at home and       our strength around the world.\n\nInternationally, Trump has questioned the value of…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691413/recognizing-assault-on-american-diplomacy"}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "…children,  providing them with affordable housing, career opportunities, community  engagement and, yes, Head Start programs.\n\nI learned from the Unity Council that President Trump and the  administration has stopped funding for the Oakland Head Start program.  This means that over 600 children will not have daycare, mental health  services, dental care, and…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691363/vulnerable-children-must-be-supported"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…facilitated by the United States, an illegitimate peace.  It is all horrifying. It is all infuriating, and it is all antithetical  to our American ideals.\n\nAs President Trump and his administration publicly trash our allies,  undermine the strength of NATO, and decimate our international aid  programs, our adversaries are greedily and happily waiting to…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687988/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…signal that his administration would be obsessed with suppressing votes  and undermining free and fair elections.\n\nAnd since that very first day in office, President Trump and his  administration have been praising and hiring into leadership positions  the very people who attempted to subvert our democracy. In fact, just  this past month, the White…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696440/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…deep  and, frankly, rising concern for the future of our intelligence  community and, in turn, the security of the United States.\n\nFor months now, we have watched President Trump's administration, led  in this arena by his handpicked Director of National Intelligence Ms.  Gabbard, systemically undermine the men and women whose mission is to  keep this country…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695695/authorizing-the-en-bloc-consideration-in-executive-session-of-certain-nominations-on-the-executive-calendar"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…Workers pay into this earned  benefit system, and they do it through their FICA taxes. It comes out  of a check every month. Social Security is earned.\n\nYet, President Trump and his administration, especially the DOGE  boys--I bet you nobody in this Chamber even knows their names--have  worked to weaken this 90-year-old security benefit.\n\nThe Trump administration…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699878/protecting-social-security"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…children of the minority group of equal educational opportunities, even  though the physical facilities and tangible factors may be equal.  Regrettably President Trump, during his last administration, appointed  dozens of judges who, during their confirmation hearings, refused to  say whether Brown v. Board was properly decided.\n\nLast week, the President…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689643/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…Tillerson; over the objection  of his National Security Advisor General McMaster; and over the  objection of his Chief of Staff General John Kelly.\n\nHad President Trump, in his first administration, not torn up that  agreement, we would be celebrating Iran's tenth anniversary under the  nuclear deal with no path to a nuclear weapon. By ripping up the…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693126/motion-to-discharge-sj-res-59"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…to resolve, but I  think it is high time that people in this Chamber talked about  immigrants to this country and recognized the strengths that they  bring.\n\nPresident Trump and his administration have launched upon an  unprecedented campaign against immigrants--immigrant crackdowns in  Virginia and elsewhere. And the claim of the administration and many…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699611/9999"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…to be  shaping up like a more extreme and more radical version of the first  term, where the Office of Special Counsel identified over 12 different  members of President Trump's administration as having violated the  Hatch Act.\n\nAs a refresher, Kellyanne Conway promoted Ivanka Trump's clothing  line in the last Trump administration. Stephanie Grisham,…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690818/gross-violations-of-law-by-trump-administration"}, {"senator": "Rick Scott", "party": "Republican", "sentence": "…and ready  to serve. President Trump was elected in a landslide, and the American  people expect and deserve our support in getting his agenda  accomplished.\n\nPresident Trump and his administration are working incredibly hard to  bring back the U.S. policy of peace through strength and to ensure our  military is a respected and lethal fighting force. This…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691405/motion-to-discharge-s-res-195"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…one big, beautiful bill will secure the border once and for all  and make America safe again. The border was the number one issue on the  campaign trail, and President Trump and his administration have made  historic efforts to remove bad actors here illegally and make our  country safe again. Illegal  border crossings have plummeted, but Congress needs…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691527/one-big-beautiful-bill"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…McCormick).\n\nThe Chinese Communist Party is working to undermine America's  interests around the world and is the global supplier of America's  adversaries.\n\nAs President Trump and his administration are working tirelessly to  finally bring an end to the war in Ukraine, the CCP continues to stoke  global chaos by providing massive amounts of industrial and…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690679/economic-espionage-prevention-act"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…only gets one chance at a quality education. The time for  change is now, and thankfully we have a President who puts students,  families, and results first. President Trump and his administration  will deliver for our students and for their futures.\n\nThe executive orders returning education authority to the States not  only prioritizes school choice,…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689153/advancing-america-first-policies"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…than  $19 billion to daycare centers without having any verification that  that childcare center had children--$19 billion to daycare centers.\n\nThankfully, President Trump and his administration are working to  ensure that these fraudsters face justice and that something like this  can never happen again.\n\nRight now, you have Federal authorities on…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698560/fraud-accountability-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "…February 2024, with  President Biden, Customs and Border Protection recorded 189,913  encounters at our southern border--189,913 to 11,709, a 93-percent  drop.\n\nPresident Trump and his administration have made incredible progress,  and our Nation is more secure because of their efforts.", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689044/border-security"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Secretary of the Interior to conduct ``an expeditious  program of competitive leasing of oil and gas in the National Petroleum  Reserve in Alaska.''\n\nIn 2020, in President Trump's first administration, the Bureau of  Land Management released its IAP for the NPR-A. The 2020 IAP listened  to local voices and opened up access to over 18.5 million acres of the…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696834/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision"}, {"senator": "Keith Self", "party": "Republican", "sentence": "…America's interests first while building our relations with allies  abroad against our common adversaries.\n\nWe have taken major steps in the right direction under President  Trump and his administration, but there is still more work to be done.  Our NATO partners must step up to the plate and give 5 percent of their  GDP for the protection of Europe as America…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689088/america-must-not-be-idle-while-adversaries-advance-capabilities"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…back burner to the front.\n\nIt is no secret to any of my colleagues that I have been working on  this issue for a while now. I was proud to partner with President Trump  during his first administration to update CFIUS, the Committee on  Foreign Investment in the United States. This interagency committee  reviews foreign investments and real estate transactions…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688807/cormick-and-mmcr-fettermanhagerty-kim-cormick-schumer-sullivan-fetterman-and-others-for"}, {"senator": "Eric Burlison", "party": "Republican", "sentence": "…program that Elon Musk, while leading DOGE, publicly said was a scam,  that it was rife with corruption and an evil organization that should  be dissolved. President Trump and his administration attempted to do  that, and yet here we are trying to fund it.\n\nThis program was sold to the American people as a force for advancing  freedom, but instead it…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699049/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…think you  would have to say the amount of antidepressants consumed was a tiny  fraction of what we have today--and really Make America Great Again.\n\nI implore President Trump's administration--we had a representative  from his administration here yesterday. I implore them to put together  a working group so that we can come up with solutions to this…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699038/reshaping-the-american-family"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…legislation that builds on the extraordinary progress we have seen  under President Trump's leadership to restore law and order in  Washington, D.C.\n\nThanks to President Trump and his administration, we are finally  seeing real results in this city. Crime is down, homicides are down,  carjackings are down, and most importantly, people feel safer in their…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695560/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…Bidenomics cost American families more  than $11,000 every year for the last 4 years.\n\nNext, this budget resolution prioritizes energy independence. Under  President Trump's first administration, the United States was energy  independent for the first time in 40 years. That stopped the day Joe  Biden took office, and American families have been hurting…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688089/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions-and-providing-for-consideration-of-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…Chairman Steil for his  great work; Whip Emmer, and so many in our committee and our colleagues  in the Senate for their work on this legislation.\n\nI also recognize President Trump's administration, crypto czar David  Sacks, and SEC Chair Paul Atkins for  their efforts to reverse the Biden-era irrational opposition and  misguided regulations that we lived…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693836/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…resolution will do nothing to achieve  accountability for the murder of Jamal Khashoggi more than has already  accrued.\n\nWhen Jamal Khashoggi was killed in 2019, President Trump and the  administration conducted a thorough investigation into his death and  determined that 17 Saudi nationals were responsible for Mr. Khashoggi's  death, and they were subsequently…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697011/9999"}]