[{"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…conclusively determined  cannot be used for this purpose. This is government overreach at its  most reckless.\n\nIt is a distraction--a deliberate one--from the fact that President  Trump's agenda is failing to meet the needs of working families. It  doesn't lower prescription costs. It doesn't fix our crumbling  infrastructure, and it certainly doesn't improve…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690482/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Robin Kelly", "party": "Democrat", "sentence": "…pregnancy-related deaths. I have introduced legislation to  help diversify clinical trials so medical breakthroughs can reach the  patients who need treatment the most.\n\nPresident Trump's agenda, however, is determined to drag us backward.  He has declared an end to so-called woke research and programs. These  programs are meant to help women, veterans, Black…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690242/health-disparities-in-minority-communities"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…Representatives,  connected to this one big, ugly bill.\n\nIn this letter, it says that: ``While we fully support efforts to  rein in wasteful spending and deliver on President Trump's agenda--''\n\nLet me park it right there parenthetically for a moment. Nothing in  this bill is about waste, fraud, and abuse. Nothing is doing anything  meaningful about waste,…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…99 on the nomination of  Linda McMahon, of Connecticut, to be Secretary of Education, I would  have voted no. As Secretary, Mrs. McMahon will be a rubberstamp on  President Trump's agenda to dismantle the Department of Education.  President Trump has even said that he hopes that Mrs. McMahon ``puts  herself out of a job.''\n\nThe Department of Education…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688592/confirmation-of-linda-mcmahon"}, {"senator": "French Hill", "party": "Republican", "sentence": "…suffering from inflation, the highest in 40  years. It takes $1.21 for what cost $1 just 4 years ago.\n\nThe resolution before us changes the direction. It delivers on  President Trump's agenda to put the American people first. This  resolution does protect the American people from the largest tax  increase in American history.\n\nLet's set the record straight:…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688083/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "John Rutherford", "party": "Republican", "sentence": "…projecting strength throughout the world, while bolstering  our naval fleet. The LCS supports America's maritime security, sea  control, and deterrence, and, importantly, President Trump's agenda.\n\nJust this past April, the USS Minneapolis-Saint Paul helped the U.S.  Coast Guard stop two alleged drug smuggling operations in the Caribbean  Sea. These ships assist…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693680/department-of-defense-appropriations-act-2026"}, {"senator": "Addison McDowell", "party": "Republican", "sentence": "…more dangerous, illegal  aliens parading around with no consequences.\n\nMr. Speaker, this legislation is one of the most consequential items  we will vote on. It is President Trump's agenda, and it is what we all  told the people back home we would do.\n\nNow the House must get it done. I urge all of my colleagues to vote  in favor of this rule. Let's choose…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693240/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…the House floor with  bipartisan support in both the 117th and 118th Congresses. I look  forward to seeing the Senate take swift action on this bill, which  supports President Trump's agenda to root out fraud and abuse.\n\nMr. Speaker, I urge my colleagues to support H.R. 1804, and I reserve  the balance of my time.\n\nMr. WILLIAMS of Texas. Mr. Speaker, I…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691854/9999"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…are smart. They have a  history of success, and that history is going to continue now that they  are members of the Cabinet.\n\nOur success has had a direct impact on President Trump's agenda. With  his team in place, President Trump has been able to execute effectively  and efficiently.\n\nThe Senate has also acted decisively to secure the border. Within…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688471/joint-session-of-congress"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "Mr. THOMPSON of Pennsylvania. Mr. Chair, this budget resolution  begins the process of delivering on President Trump's agenda, and that  agenda is clear. It is securing the border. It is unleashing economic  growth. It is providing efficiency and accountability in government. It  is reining…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688080/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…return to the workforce, have been draining funds from the citizens who  deserve and need Medicaid.\n\nThis ends now. The Ways and Means Committee is also delivering on  President Trump's agenda by permanently extending the President's 2017  tax cuts. Our small businesses will continue to prosper. Also included  in this big, beautiful bill is the removal of…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1690998/delivering-on-president-trumps-agenda"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…Representative  Norman's amendment, which would prevent my constituents' hard-earned  taxpayer dollars from funding woke earmarks and handouts to leftist  NGOs that undermine President Trump's agenda and, alarmingly, support  taxpayer-funded transgender surgeries for children.\n\nBuried in the minibus package is $14.3 million in earmarks for  special interest projects…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699288/amendment-no-1-offered-by-mr-massie"}, {"senator": "Rick Scott", "party": "Republican", "sentence": "…nominees. They enjoy  bipartisan support. There are several more nominees waiting. It is  obvious, my colleagues across the aisle will do everything they can to  undermine President Trump's agenda and delay these nominees.\n\nNext, I would like to consider Keith Bass to be Assistant Secretary  of Defense. Mr. Bass is a retired U.S. Navy commander. He is also a…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691405/motion-to-discharge-s-res-195"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…this legislation.\n\nMr. Speaker, our Republic is alive and well. This bill refocuses  Washington's spending. It cuts waste, restores accountability, and  delivers on President Trump's agenda. It cracks down on fentanyl and  foreign adversaries, defends American values and principles, and  ensures that taxpayer dollars are spent on public safety and national…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698748/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…issued a Statement of Administration Policy supporting  H.J. Res. 20. Congress should pass H.J. Res. 20 to right the wrongs of  the previous administration, execute President Trump's agenda, and  protect our consumers.\n\nI thank the gentleman from Alabama's Sixth District for his  leadership.\n\nMr. Speaker, I urge my colleagues to vote ``yes,'' and I reserve…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688289/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…Promises Kept\n\nMr. JOYCE of Pennsylvania. Mr. Speaker, my colleagues in the U.S.  Senate will vote this week on President Trump's One Big Beautiful Bill  Act, moving President Trump's agenda one step closer to being signed  into law.\n\nThis is critical legislation that will prevent the largest tax hike  in history by extending President Trump's Tax Cuts…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692792/operation-midnight-hammer-success"}, {"senator": "John Joyce", "party": "Republican", "sentence": "Mr. JOYCE of Pennsylvania. Mr. Speaker, this week, we will vote on  legislation to improve our domestic energy market and to support  President Trump's agenda on U.S. energy dominance.\n\nIn my home State of Pennsylvania, we have abundant natural gas  reserves. We can utilize this resource that is under the feet of my  constituents…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696753/improving-domestic-energy-market"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…them, particularly changes in the  disastrous policies from the last 4 years. I plan to help deliver on  those demands by fixing how Washington works and implementing President  Trump's agenda to make America first.\n\nThis resolution gives us the framework that we need to meet the  demands of those 77 million Americans. Those demands include fixing our…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688081/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…last decade. In addition  to being unconstitutional, they are also anti-democratic. Universal  injunctions have become a favorite tool of those seeking to obstruct  President Trump's agenda.\n\nIndividual district judges who don't even have authority over any of  the other 92 district courts are singlehandedly vetoing policies the  American people elected…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689309/statements-on-introduced-bills-and-joint-resolutions"}]