[{"senator": "Sheila Cherfilus-McCormick", "party": "Democrat", "sentence": "…Speaker, I include in the Record the  following proclamation honoring Band CaRiMi.\n\nWhereas, music has long been a unifying force that       transcends borders and generations, preserving culture and       celebrating heritage. Few bands have embodied this mission       more profoundly than CaRiMi, a pioneering group that has       played an instrumental role…", "date": "2025-08-12", "source_url": "https://justfacts.votesmart.org/public-statement/1694734/9999"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…camped with our kids on the Boundary  Waters every year since they were small. We share magical and life- changing memories from our adventures there that we all cherish.  Preserving this wilderness for future generations should be our goal,  not its destruction.\n\nThis resolution is an existential threat to our beloved Boundary  Waters. I implore my colleagues…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699272/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…significantly hindered or even discontinued,  putting the safety and security of our communities, taxpayers, and  citizens at risk.\n\nPassage of this legislation is very essential to preserving our  national readiness and to strengthen security against emerging threats  and those who would do us harm.\n\nMr. Speaker, I strongly encourage my colleagues to support H.R.…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688696/securing-the-cities-improvement-act"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…documenting the development of international  maritime trade and the journey to American economic independence  following the Revolutionary War.\n\nDue to the importance of preserving the maritime history of New  England, Congress chose to designate a piece of the Salem waterfront as  the country's first national historic site in 1938. The site has since…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691014/salem-maritime-national-historical-park-redesignation-and-boundary-study-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…preserve history, despite the blanket  pardon, despite the distortion of history that has occurred.\n\nSo we are here today to say to our Republican colleagues: Join us in  preserving that history. Join us in making sure the truth is told from  this Chamber to America, to all of our country.  Do not forget, 5 years ago, rioters, incited by President Trump,…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698494/9999"}, {"senator": "Suzan DelBene", "party": "Democrat", "sentence": "…mayor since 2020. During his  tenure, he has championed thoughtful city planning and growth, helping  Mill Creek expand economic opportunities and enhance tourism while  preserving the city's character.\n\nMayor Holtzclaw has lived in Mill Creek since 2003 and is deeply  engaged in the community he serves. He helped advance the South Town  Center Project…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697194/recognizing-mayor-brian-holtzclaw-for-twelve-years-of-leadership-in-mill-creek"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…authority for Jefferson County, Colorado.\n\nFirst created in the fall of 1975, Foothills Regional Housing has  worked to meet the growing housing needs of Jefferson County by  preserving existing affordable housing units and developing new ones.  In addition to supporting low-income renters by administering over  1,800 vouchers through the Department of Housing…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695831/recognizing-foothills-regional-housing"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…members and veterans receive advanced, appropriate spine care.\n\nFinally, the Motion Preservation Task Force ensures patients and  providers have access to lifechanging motion-preserving procedures,  focusing on artificial disc replacement.\n\nThe Foundation continues to be strongly committed to spine health  research. Patient reported outcomes have long been…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696032/recognizing-october-as-national-spine-health-awareness-month"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…trained students across Virginia, Maryland, and  Washington, D.C. in dance, yoga, aerobics, and Nepali-inspired fitness  programs. Luna's work is driven by her passion for preserving and  sharing Nepali traditions in America and giving young performers the  opportunity to showcase their skills on stages nationwide. She plays a  key role in the production…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695611/recognizing-navin-kc-luna-shrestha-and-nabaraj-kc"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…today, a year on from the wholesale evisceration of the American  foreign assistance enterprise, enacting a bipartisan law because  Members on both sides were committed to preserving this enterprise. So  I want to thank Senators Graham, Murray, and Collins as well as  Representatives Diaz-Balart and Frankel for their partnership in  negotiating the bill.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699751/9999"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…economy, and  someone who cares deeply about the environment, I do not take this vote  lightly.\n\nI have spoken multiple times to all of the stakeholders involved. I  believe in preserving consumer choice, maintaining American leadership  in innovation, defending the future of domestic manufacturing, and  protecting the environment. These are not mutually exclusive.…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690490/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision"}, {"senator": "Julia Brownley", "party": "Democrat", "sentence": "…officials.\n\nAs he steps down from this role, I am proud to join our community in  recognizing Gene's 27 years of dedicated public service and his  extraordinary contributions to preserving the defense, economic, and  technological vitality of the County of Ventura.\n\nMr. Speaker, it is with great admiration and respect that I recognize  Gene Fisher for his steadfast…", "date": "2026-02-20", "source_url": "https://justfacts.votesmart.org/public-statement/1700086/recognizing-gene-fisher-and-his-dedicated-service-to-the-county-of-ventura"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…ready.\n\nWe have that responsibility. It can't be the arbitrary action of any  single individual, including the President of the United States. So  what is at stake here is preserving the accountability that has so  weakened as the Congress itself has delegated so many of our  responsibilities to the Chief Executive. It is a terrible development  in our…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696567/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…bombings  remain with us, but their stories endure. The disturbing photos of the  burns and the radiation sickness endure.\n\nIn those cities, those gathered will recommit to preserving the  memory of the destruction, and to plead with current and future  generations to work to ensure that such horrors never ever, ever happen  again.\n\nMr. Speaker, I regret…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694117/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…community.\n\nThis year marks the tenth anniversary of Mr. Yeremyan's volunteer  service with Armenians of Colorado. Armenians of Colorado is a  nonprofit organization devoted to preserving and promoting Armenian  culture and heritage in our state.\n\nOver the last decade, Mr. Yeremyan has devoted his time and  leadership to the community, including through the…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697495/recognizing-byuzand-yeremyan"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…means passing this bill.\n\nThe Taiwan Conflict Deterrence Act is not just about Taiwan. It is  about standing up for American values, protecting American interests,  and preserving peace through strength.\n\nMr. Speaker, I urge my colleagues on both sides of the aisle to  support this important legislation that I was proud to introduce. Let's  show the…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693874/taiwan-conflict-deterrence-act-of-2025"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…development. In 1960, the Department of the Interior, DOI, issued PLO  2214, setting aside 8.9 million acres to establish the Arctic National  Wildlife Range for the purpose of preserving unique wildlife,  wilderness, and recreation values, withdrawing the lands from ``all  forms of appropriation . . . including mining but not the mineral  leasing laws.''…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697739/9999"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…of digital assets and establishing well-defined regulatory  responsibilities between the SEC and CFTC, creating a more predictable  landscape for market participants while preserving critical investor  protections and maintaining the integrity of U.S. financial markets.\n\nThis legislation reasserts the role of Congress in setting national  policy for emerging…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693544/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…the Nation.\n\nAccessibility is a priority with wheelchair-friendly amenities  ensuring all guests can fully enjoy the experience. TIME highlights  Georgia's commitment to preserving natural wonders while promoting  economic development. This honor showcases the park as a top  destination that blends adventure, education, and conservation.…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689617/commending-jekyll-island-club-resort-and-sea-island"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…build local businesses, serve in  public office, educate future generations, and contribute to the  cultural and economic vitality of the region. The city's commitment to  preserving its heritage while preparing for the future is a model of  responsible and thoughtful community development. As Brooksville  celebrates its 170th anniversary, it is fitting…", "date": "2026-02-20", "source_url": "https://justfacts.votesmart.org/public-statement/1700091/recognizing-the-city-of-brooksville"}, {"senator": "John James", "party": "Republican", "sentence": "…potential to power America's energy future.\n\nResearchers at Western Michigan University are actively working to  map and evaluate Michigan's critical mineral potential, preserving and  analyzing decades of geological data to better understand what  resources lie beneath our soil. Their work demonstrates that Michigan  is not just a part of the conversation.…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699991/securing-americas-critical-minerals-supply-act"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…over 40 years, Jeff Wilson has exemplified the very best of what  it means to be a South Carolina farmer. He is hardworking, he is  innovative, and he is deeply committed to preserving the land and the  legacy of his family.\n\nCotton Hills Farm has been in the Wilson family since 1882. That is  over 143 years ago. Originally starting with only 100 acres…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695599/recognizing-jeff-wilson"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…passing the SAVE Act we can ensure that only eligible Americans  are registering to vote.\n\nAdditionally, the SAVE Act is aligned with President Trump's recent  executive order, Preserving and Protecting the Integrity of Elections,  which will help restore trust in American elections, enhance our  election administration, and make our elections secure.\n\nThis…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690007/safeguard-american-voter-eligibility-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…prevent them from thriving.  By isolating problematic rules, we empower Congress and Federal  agencies to focus time and resources where they are needed most, while  still preserving the regulations that work.\n\nThe DUMP Red Tape Act strengthens our commitment to a pro-job, pro- innovation economy by ensuring that Federal agencies remain accountable  and…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697346/destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "…chairman for yielding.\n\nMr. Speaker, I am grateful for the opportunity to be here today, and  I commend my colleagues in the Western Caucus for their unwavering  dedication to preserving the values and livelihoods of rural America,  the Western States, and our Western values that we both represent.\n\nI will highlight today three pieces of legislation that…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689196/work-highlights-of-western-caucus"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…friends in the work centers, and it is  horrific for the Biden Department of Labor to try to shut these places  down.\n\nIn any event, one more time: I thank President Trump for preserving  the work centers. I hope his Department of Labor continues to look for  more opportunities in these facilities for people at a younger and  younger age, reminding you all…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694041/opportunities-to-stay-in-place-for-disabled-workers"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…former Speaker Pelosi,  Senator Schumer, and other Democrats railed against Chinese tariffs  years ago but did nothing about them. They even supported President  Biden's preserving of the tariffs from the Chinese most recently, and  they said nothing about it here.\n\nPresident Trump is doing something about the tariffs. He is  responding in ways that…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689703/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…cultural well-being of our Inupiaq shareholders.\n\nASRC is committed to both providing sound financial returns       to our shareholders, through jobs and dividends, and to       preserving our Inupiaq way of life, culture, and traditions,       including the ability to maintain a subsistence lifestyle       that supports our communities. In furtherance of this…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696449/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Andy Harris", "party": "Republican", "sentence": "…healthy, able-bodied young adults  than for our seniors. If you repeat a lie long enough, it becomes a  truth, but this is a fact.\n\nMr. Speaker, Republicans are protecting and preserving Medicaid for  the truly needy.", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690515/republicans-are-protecting-and-preserving-medicaid-for-the-truly-needy"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…we are here today. The language I recently attempted to  secure in the Agriculture appropriations bill would have kept these  products out of the hands of children while preserving the hemp  industry for farmers.\n\nFor the sake of those misguided by my opponents on this issue, let me  clarify a few things: You will hear from some that this language would…", "date": "2025-08-01", "source_url": "https://justfacts.votesmart.org/public-statement/1694557/9999"}]