[{"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…well.\n\nWhen it was reauthorized in 2006, the vote in the House was 390-33,  and it passed the Senate unanimously. President Reagan had signed a  previous reauthorization. President Bush signed this one, and that was  just 20 years ago. What has happened to the country since then?\n\nI will say this: We all know that the vote is the most powerful tool  in…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699200/building-a-beloved-community"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…lessen things like HIV and AIDS and  other diseases, which have an impact on global health, by stopping the  funding for the World Health Organization.\n\nI gave praise to President Bush when he put forth PEPFAR. We worked  closely with him to fund it as appropriators. There were 25 million  people's lives saved, but we are saying the alleviation of poverty…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693708/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…the ones who  struck it down were Democratic appointees, one by President Obama and  one by President Biden. The other two were Republican appointees, one  appointed by President Bush and one appointed by President Reagan, who  said that in his four decades on the bench he had never seen a more  unconstitutional law than that one. He had never seen an…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691320/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…Organization without  having an understanding that they should obey the requirements of good  membership in the WTO and not manipulate their currencies. That is not  what President Bush was about.\n\nThen, it went up, of course, during President Obama, down during the  first Trump Presidency, and up during the Biden Presidency. Now, of  course, it is trending…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695605/devastating-harm-caused-by-trump-administration"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…veterans receiving mental health treatment, children enrolled in public  schools, homebound seniors in need of assistance and companionship.\n\nAmeriCorps was born under President Bush and codified under President  Clinton. Its mission: to improve lives and strengthen communities  through the service of dedicated volunteers.\n\nIt has long enjoyed bipartisan…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691309/cutting-americorps-deprives-americans"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…bold,  decisive, and audacious action against Nicolas Maduro. This action was  well within the President's constitutional authority. The operation was  in keeping with President Bush's operation to arrest the drug lord and  Panamanian President Manuel Noriega, in 1989. If anything, Maduro was  much worse than Noriega, and Venezuela now is even more…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698556/venezuela"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…court system.\n\nI have some background in this. My father served as a chief judge of  the Western District of Texas in San Antonio. He served as FBI Director  for President Reagan, President Bush, and President Clinton. He  understood firsthand that control of crime has a lot to do with how you  deal with criminals, Mr. Speaker.\n\nThis opportunity that we…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695616/district-of-columbia-judicial-nominations-reform-act"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…the District of  Columbia took these actions, but I think we already know the answer. It  is politics because this happened following the various tax cut  packages during President Bush's administration. This happened yet  again after Congress passed the Trump Tax Cuts and Jobs Act in 2017.  When a Republican President enacts tax cut legislation, the District…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699590/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…makes this time different  than President Biden's strikes in Syria or Yemen? Certainly, there is  little daylight between the legality of this operation and the one  President H.W. Bush undertook to apprehend Manuel Noriega in Panama.\n\nYou don't have to agree with a President's approach to national  security policy to acknowledge his compliance with…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698662/venezuela"}, {"senator": "James Risch", "party": "Republican", "sentence": "…In addition, the President's actions in Venezuela are consistent with  other Presidents' efforts to protect the American people from threats  in our own backyard.\n\nPresident George H. W. Bush authorized limited military operations to  arrest Panama's Manuel Noriega and bring him to the United States to  stand trial for drug-related charges, just as President…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698707/venezuela"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…about a $72,000 spiff out  of Social Security. It is a crap rate of return. It is a horrible rate  of return.\n\nMany of you are the ones that went to war 25 years ago when President  Bush said: Could we take a little tiny  piece and put it into the markets? Today, you would have dramatically  greater wealth. That decision was made. The public spoke--actually,…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688651/a-real-math-problem"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…agreements, it doesn't matter. They never  abide by their agreements. I have seen this throughout my career.\n\nIn 2003, I was actually in this meeting right there. That is  President George W. Bush and the Vice Premier of China, Madame Wu Yi in  the Oval Office. I was a young staffer right there next to the  President. And President Bush pressed her, Madame Wu…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690106/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…Republic, with the Barbary  pirates off the coast of North Africa, but there is another example  much closer in time and, for that matter, on the border. That would be  President George H. W. Bush's decision to invade and topple the  Government of Panama in 1989. Without prior congressional approval, he  ordered 12,000 American troops into that country. We…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696118/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "James Risch", "party": "Republican", "sentence": "…citizens. What President Trump has done in  Venezuela is the definition of the President's article II  constitutional authorities as Commander in Chief.\n\nSimilarly, President George H.W. Bush authorized limited military  operations to arrest and bring Panama's Manuel Noriega to the United  States to stand trial for drug-related charges. Interestingly,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699089/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Maria Salazar", "party": "Republican", "sentence": "…hundreds of thousands of tons of  cocaine to the streets of the United States.\n\nBack in 1989, we had a very similar experience in Panama with Manuel  Noriega. At the time, President Bush took action in Panama to remove  Noriega. There was no need for congressional approval, but as Commander  in Chief, he did what he needed to do. Today, Panamanians are…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698241/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…trafficking and other related crimes.\n\nThere is legal precedent directly on point. All of these arguments  made by the Democrats that it is illegal should look no further than  President Bush's capture of Manuel Noriega in Panama in 1989. Like the  Maduro operation, the Panama invasion occurred without congressional  authorization.\n\nLike Noriega, Maduro faces…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698883/successful-operation-to-arrest-nicolas-maduro"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…using military force without a  declaration of war by the Congress and also without congressional  authorization under the War Powers Act.\n\nOne example is in 1989, when President Bush 41 literally invaded the  country of Panama. He sent ground forces in, sustaining casualties, to  take down Noriega, who was the leader of Panama, who was a drug  kingpin.…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698616/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}]