[{"senator": "Peter Welch", "party": "Democrat", "sentence": "…224; further, that the resolution be  agreed to, the preamble be agreed to, and the motions to reconsider be  considered made and laid upon the table.\n\nMr. WELCH. Mr. President, I thank the gentleman from Idaho, the chair  of our Foreign Relations Committee.\n\nI join him. I join him enthusiastically in condemning the actions of  Hamas--the invasion on…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695678/cloture-motion"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "Mr. BLUMENTHAL. Mr. President, I thank my colleagues for this unified  support for a measure that is eminently reasonable, and I thank the  leader of our side, Senator Schumer, for advancing this proposal.…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696612/9999"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "Mr. WYDEN. Mr. President, I thank my colleague from Rhode Island, as  well as Senator Klobuchar and Senator Kaine. We have all been teaming  up to terminate Donald Trump's blanket tariffs on products…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696442/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "Mr. MURPHY. Mr. President, I thank Senator Kelly for bringing us down  to the floor today.\n\nIt is hard to believe it has been 16 years since our politics were  upended, since the floodgates were opened…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699117/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "Ms. CANTWELL. Mr. President, I thank my colleagues for coming to the  floor to remember this horrific shooting in their State and to remember  those and the family ones who were affected by this. I very…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692627/executive-calendar"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "Ms. ALSOBROOKS. Mr. President, I thank Senator Welch and Senator  Marshall and my colleagues who are here today and all the members of  the Senate Agriculture Committee for their bipartisan work on this  legislation.…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697063/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "Mr. PADILLA. Mr. President, I thank the majority leader for his  comments and commitments regarding improving Member security. I know  that he, Leader Schumer, Chairman McConnell, and I all share the same…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695686/authorizing-the-use-of-funds-from-the-senators-official-personnel-and-office-expense-account-for-security-enhancements-and-services-provided-to-senators"}, {"senator": "Tina Smith", "party": "Democrat", "sentence": "Ms. SMITH. Mr. President, I thank my colleague Senator Klobuchar and  all of our colleagues who are joining us on the floor this afternoon.\n\nWe are here today because we have a full-blown, dangerous emergency…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699416/9999"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "Mr. SCHATZ. Mr. President, I thank the Senator from Kansas. And at  the risk of getting him into political trouble, I am a huge fan of his,  but I want to address the question that he asked, which I think…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695916/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Maggie Hassan", "party": "Democrat", "sentence": "Ms. HASSAN. Mr. President, I thank my colleague from Arizona for his  remarks just now, for his patriotism and his leadership.\n\nToday, we mark the anniversary of the January 6 attack on our  Capitol, on…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698503/9999"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…U.S. Marine Corps.\n\nSemper Fidelis.\n\nI am happy now to yield to my colleague and friend from Alaska and  fellow marine, U.S. Senator Dan Sullivan.\n\nMr. BLUMENTHAL. Mr. President, I thank my colleague from Alaska for  those very powerful words from himself and the Commandant.\n\nAs he has remarked, this Marine Corps birthday always has enormous  personal…", "date": "2025-11-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696623/recognizing-the-250th-anniversary-of-the-united-states-marine-corps"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…local  police, which they are not equipped or trained to do as readily as  civilian police.\n\nWith that, I will turn to my colleague from Vermont.\n\nMr. BLUMENTHAL. Mr. President, I thank the Senator from Vermont for  being here. We will be followed by others who have not yet come to the  floor. I expect them momentarily. I want to thank my colleague from…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696297/9999"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "Mr. SCHATZ. Mr. President, I thank the Senator from Rhode Island for  his leadership and his clarity, and I want to underscore one of the  most basic points that has to be made. And this is how times have…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699020/energy-costs"}, {"senator": "Jacky Rosen", "party": "Democrat", "sentence": "…Senator Scott of Florida for  his partnership in the effort to counter anti-Semitism and hate  everywhere.\n\nRes. 246 submitted earlier today.\n\nMs. ROSEN. Thank you, Madam President. Again, thank you to all my  colleagues for passing this important resolution unanimously today.", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691646/recognizing-the-significance-of-jewish-american-heritage-month-and-calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism"}, {"senator": "James Risch", "party": "Republican", "sentence": "…whatsoever--that every time we take a  strike and we send tons of these poisonous drugs to the bottom of the  ocean, thousands of American lives have been saved.\n\nMr. President, thank you for what you are doing on behalf of all  those Americans who will be saved from these poisonous drugs. Thank  you, and continue to do what you are doing.", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696565/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "James Risch", "party": "Republican", "sentence": "Mr. RISCH. Mr. President, I thank Senator Ricketts for those very  clear remarks that demonstrate exactly why this needs to be done.\n\nI myself for a long time have hoped to see our European partners wake…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694081/9999"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "Mrs. BLACKBURN. Mr. President, I thank my colleague from Florida for  bringing this resolution forward and for taking the time to honor a  true American patriot Charlie Kirk.\n\nHe was a champion for freedom,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695706/expressing-support-for-the-designation-of-october-as-the-national-day-of-remembrance-for-charlie-kirk"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…crisscrossed over 1,000 miles in my district in west Texas, and the  refrain I heard in one community after another was simple: Thank you.  Thank you for supporting our President. Thank you for delivering on our  mandate. Thank you for fighting for our Nation's future.\n\nMr. Speaker, in Scurry County, we heard how deregulation and historic  tax cuts will…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694789/promises-made-promises-kept"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…unanimous consent that the bill be considered read a third time and  passed and that the motion to reconsider be considered made and laid  upon the table.\n\nMr. GRAHAM. Mr. President, I thank my good friend Senator Padilla.\n\nNo. 1, we are going to have an election in November. Senator Padilla  says that sanctuary policies are not part of the problem. I think…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700070/9999"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…talked to him about it. And he said: No, I am going to listen to my  adviser, and he agreed to it.\n\nThe President has recently changed his mind. Thank you, Mr.  President. Thank you. Thank you. Thank you. Many in the United Kingdom  are starting to question the decision of Prime Minister Starmer.\n\nThe House of Lords, one of the legislative chambers…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699482/9999"}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "…Coast Guard's fleet. And I urge my  colleagues to support the Coast Guard Authorization Act of 2025.\n\nWith that, I yield to my colleague Senator Cantwell.\n\nMr. CRUZ. Mr. President, I thank Senator Cantwell and her staff for  their hard work on this bill. I also want to thank my staff on the  committee as well who have put in many hours. This bill is important…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688519/coast-guard-authorization-act-of-2025"}]