[{"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…Congress has enacted or directed the President to  negotiate trade deals, including authority to negotiate the agreements  and impose or adjust tariffs.\n\nBut I think these Presidents have used this authority correctly by  opening up markets, lowering tariffs, and establishing a rules-based  trading system. The current approach, I believe, is creating…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689522/klobuchar-ms-murkowski-mr-warner-mr-mcconnell-and-mr2024"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…this cycle before. We were very lucky,  but I am terrified we will not make it through again.\n\nThis shouldn't be a partisan issue. It has never been partisan.  Republican Presidents from Dwight Eisenhower to Ronald Reagan to George  W. Bush have all led on arms control agreements.\n\nI have been critical of my own party's approach to nuclear weapons.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699033/expiration-of-new-start"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…sets the example. He is an exemplar and not just an example.  He is an exemplar. He is a supreme and superb exemplar of what behavior  should be like in the country.\n\nEven Presidents make mistakes, but these are not mistakes. These  things are done with intentionality, and they are done almost on a  daily basis. There is something new almost every day.…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697060/no-mandate-to-cut-medicaid"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…Force One. And why does this  matter? Air Force One is not just a random luxury airplane. It is a  symbol of and a projection of American power. It has flown 15 different  Presidents. It carried President John F. Kennedy's body after his  assassination and saw President Johnson be sworn in under unprecedented  circumstances. It rushed George W. Bush back…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690968/qatar"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…own, so I look for and long for that  day.\n\nLet me just start with what I believe is good in the bill that was  negotiated. The Iraq war ended more than a decade ago, yet Presidents  from both parties have cited the 2002 Authorization for Use of Military  Force, or AUMF, to justify military actions completely unrelated to  Iraq. Leaving it on the books…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697809/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…arguments peddled by my colleagues that are hypocritical at best and  intellectually dishonest at worst.\n\nWhere were my colleagues when 14 Federal judges appointed by  Republican Presidents issued injunctions against policies that the  Biden administration was pursuing over the course of the last 4 years?  Where were they? Nowhere to be found.\n\nI don't remember…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689720/no-rogue-rulings-act-of-2025"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…solicited by Jeffrey Epstein and  raped and assaulted. Then they went to the police and the police didn't  do anything because Jeffrey Epstein knew rich people, because he knew  Presidents, because he knew donors.\n\nThis is not a Republican issue. This is not a Democratic issue.  Marjorie Taylor Greene was there speaking out for the survivors. Nancy  Mace was…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694883/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…organized food drives and computer drives.\n\nAttorneys across our State at private law firms took ICE to court to  enforce people's constitutional rights. And judges appointed by  Presidents of both parties, including our conservative chief judge of  the Federal District Court of Minnesota issued opinions, and strongly  worded opinions, demanding that people…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700059/9999"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…Eisenhower. They called it Food for Peace,  and it sent American-grown grain to hungry people around the world. It  has enjoyed bipartisan support from Democrat and Republican Presidents  for 70 years.\n\nThis Republican Congress passed a funding bill to continue to fund  the program, but the Trump administration continues to hold up funding.  Every day they…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693626/restore-funding-for-lifesaving-food-aid"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…over-encroachment of the military. He has been the most rigorous  watchdog in making sure Congress's power to make war and engage in acts  of war are upheld.\n\nThere are many Presidents, as Senator Kaine pointed out, who try to  push the boundaries, but no President has pushed the boundaries more  than President Trump.\n\nAmericans need Kaine here to do just…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696558/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "…without answers and without justice.\n\nTo this day, the MMIP crisis remains the most underreported, under- discussed, and under-resourced tragedy in America, and Congress and  Presidents have promised for decades to do much more to address it.\n\nDespite some progress towards justice for victims and their families,  Trump's budget announced Friday strips millions…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690670/expression-of-outrage-on-national-day-of-awareness-for-missing-and-murdered-indigenous-women-and-girls"}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "…Commission until  his passing earlier this year. Gerry dedicated his life to serving his  community and our Nation and stood for what was fair and just, as did  our former Presidents John and John Quincy Adams.\n\nCongressman Connolly is deeply missed, and the remaining members of  the commission greatly appreciate his work and the work of my  Massachusetts…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697631/adams-memorial-great-american-heroes-act"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…Congress has enacted or directed the President to  negotiate trade deals, including authority to negotiate the agreements  and impose or adjust tariffs.\n\nBut I think these Presidents have used this authority correctly by  opening up markets, lowering tariffs, and establishing a rules-based  trading system. The current approach, I believe, is creating…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689549/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…time to enjoy the quality of life, and less quality of  life.\n\nThat is not a future I want to see. I want to see a future  envisioned, I think, as we heard by Democratic Presidents and  Republicans Presidents alike, in which we invest in the technologies  that can clean our air and clean our water, in which we get ahead of  this tipping point on climate…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691582/hj-res-88"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…life,  widespread radiation poisoning, and destruction on a scale unlike  anything seen in human history. We all, regardless of political  affiliation, must reaffirm what Presidents Reagan and Gorbachev said 40  years ago: ``A nuclear war cannot be won and must never be fought.''\n\nFor the past 80 years, the probability of mutually assured  destruction…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699676/the-new-start-treaty"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…States that requires deliberation and  authorization must be voted upon in Congress.\n\nOur Founders' intent was not a close call open to equivocation.  Pundits argue that Presidents have been ignoring this restriction for  decades. That is true. But that is not an argument. That is just an  excuse, and a lame one at that.\n\nThe Constitution is clear:…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698611/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…Republicans have now confirmed 20--20--members of President  Trump's Cabinet. We confirmed President Trump's Education Secretary  just last evening. So compared to previous Presidents, this is a  remarkable pace. More confirmations than President Obama had at this  point in 2009; more confirmations than President Biden had in 2021. It  surpasses the timeline…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688471/joint-session-of-congress"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…impeachment because of his  successful attack on the Iranian nuclear program.\n\nNational security should be something that unites us. But let's not  forget that Democrats have said Presidents can act without a vote of  Congress. They have said it many times in the past. Recall, when  President Obama struck Libya in 2011, Speaker Nancy Pelosi said  Congress wasn't…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693090/iran"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…indefinite commitment of  U.S. troops abroad. And in shutting that door, the law very  intentionally reaffirmed our Founders' decision to leave another door  open.\n\nThe law grants presidents clear authority for the limited use of  military force. And of the many occasions over the years when  colleagues on both sides of the aisle have invoked the War Powers Act…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698662/venezuela"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…measure that will make  America both wealthier and safer. I am inspired in thinking about the  big, beautiful bill of not only this President but two of my favorite  former Presidents.\n\nThe first would be President John Fitzgerald Kennedy, who realized-- getting the appropriate quote--realized the negative impacts of high  tax rates. Indeed, roughly 60…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693226/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…largely paid for by Iran. Within that 1,200  people, 48 were Americans.\n\nIt leads me to ask this simple question: What if they had had a  nuclear weapon?\n\nFor decades, American Presidents have said Iran can never have a  nuclear weapon. It is a lot of talk but not a lot of action. Over and  over and over again, Iran moved forward, building their bunkers deeper,…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692703/thanking-president-trump-for-saving-the-world"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…Trump take Maduro? It was to protect the homeland  of the United States of America, as he has done with action after  action after action. It is the same reason that two Presidents put a  warrant, a bounty, on Nicolas Maduro--not just President Trump, but  also President Biden. That is why Nicolas Maduro was snatched up,  because of his poisoning of…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699364/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…time of growing  global unrest. China is accelerating its military buildup in the Indo- Pacific. While I remain hopeful that President Trump can help broker  peace between Presidents Putin and Zelenskyy, Russia's brutal war  against Ukraine grinds on. That is why it is more important than ever  that we invest in our servicemembers, protect defense spectrum,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695027/9999"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…congressional inquiries.\n\nTo Attorney General Bondi's and FBI Director Patel's credit, they  have done better in that regard than any of their predecessors of  Republican Presidents and Democrat Presidents. Now, am I fully  satisfied? Of course not, but Bondi and Patel deserve credit. If the  Biden administration had done the same, I would have given…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699769/whistleblowers"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…the same radical leftists who have spent the  last decade trying and failing, trying and failing, and trying and  failing to tear down President Trump, one of the greatest Presidents in  American history?\n\nCan you really trust those same people, who are trying to stop us  from passing the most important cryptocurrency legislation in history  and appropriations…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693544/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "…the need to get geothermal energy  up and going more quickly and more efficiently.\n\nMr. Speaker, I will start with the Antiquities Act. For decades, the  executive branch, Presidents of the United States, mostly Democrats,  have used the Antiquities Act of 1906 to designate vast areas as  national monuments, and that is in an authority that we delegated…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689196/work-highlights-of-western-caucus"}, {"senator": "Joni Ernst", "party": "Republican", "sentence": "…left behind by this stray spirit can be spotted outside the entrance of  the Old Supreme Court Chamber.\n\nFrom poltergeists to apparitions of Abraham Lincoln and other dead  Presidents, Washington has a long history of ghost stories.\n\nThe city itself was transformed into a ghost town when government  workers disappeared from their desks as a result of President…", "date": "2025-10-30", "source_url": "https://justfacts.votesmart.org/public-statement/1696486/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…leader, policy expert, and  political strategist whose faith has guided her throughout a  distinguished 20-year career in public service. She helped elect and  advise two U.S.  Presidents and two U.S. Attorneys General while leading national  grassroots and communications efforts that achieved historic gains  among minority, veteran, and faith voters.\n\nAppointed…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696133/recognizing-jennifer-sevilla-korn-for-her-public-service-and-leadership"}, {"senator": "James Risch", "party": "Republican", "sentence": "…that act exactly as it was put in place by Congress when he took  the single-strike act against Iran.\n\nAlso, the Justice Department has opined to Republican and Democrat  Presidents and created the precedent as to when the President could use  power. This strike is in full compliance with that guidance. The  guidance is very simple. No. 1, if the President…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693132/motion-to-discharge-sj-res-59"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…unserious Democrats are in  this effort.\n\nThey also claim the act to remove Maduro was unconstitutional, which  ignores Article II and decades of bipartisan precedent where Presidents  have undertaken limited military action without a declaration of war.\n\nClinton acted in Kosovo. Obama acted in Libya. Most similarly, George  H.W. Bush captured drug-trafficker…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699365/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}]