[{"senator": "Gary Peters", "party": "Democrat", "sentence": "…done in 30 years: It passed all 12 appropriations bills  before the start of the next fiscal year. One year later, Congress  built on that success by working with then-President Clinton to enact  the Balanced Budget Act and set enforceable budget caps.\n\nAnd what occurred after this series of bipartisan, commonsense  cooperation: a 4-year period of budget…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695675/cloture-motion"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…treatment, children enrolled in public  schools, homebound seniors in need of assistance and companionship.\n\nAmeriCorps was born under President Bush and codified under President  Clinton. Its mission: to improve lives and strengthen communities  through the service of dedicated volunteers.\n\nIt has long enjoyed bipartisan support, and for good reason,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691309/cutting-americorps-deprives-americans"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…Orthodox world and the entire global community.\n\nThis will not be his first visit to the United States. When he came  in 1997, he was received in the Oval Office by President Bill Clinton  and First Lady Hillary Clinton, who hosted a White House reception in  his honor. He was also presented with the Congressional Gold Medal in  the U.S. Capitol Rotunda…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695331/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…which       astound in the scope of the grift and flagrancy of       commitment. Leading ethicists agree, including the White       House ethics ``czars'' for each president since Clinton       (except for Trump's).\n\nTrump once dismissed bitcoin, the most popular crypto, as       ``based on thin air.'' It is a ``scam.'' It can facilitate       unlawful…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693839/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "…Green Patriarch,'' a role he  continues to embrace.\n\nHis relationship with the United States is long and distinguished. He  received the Congressional Gold Medal from President Bill Clinton in  1997 and has since met Presidents George W. Bush, Barack Obama, and Joe  Biden, as well as other U.S. leaders, in recognition of his  contributions to global peace…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695503/welcoming-ecumenical-patriarch-bartholomew-to-washington-dc"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…service.  Following an appointment by Governor Roy Romer as the Executive  Director of the Department of Regulatory Agencies, Chancellor Garcia  was appointed by former President Bill Clinton as Regional Director for  the U.S. Department of Housing and Urban Development. He later served  as Lieutenant Governor and the Executive Director of the Colorado…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692493/congratulating-chancellor-joe-garcia-on-his-retirement"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…were massive tax cuts for the wealthy, the well-off, and the  well-connected.\n\nIn fact, the Republican President at that time in 2001 inherited a  budget surplus from President Bill Clinton and immediately turned  around and took that budget surplus and turned it into a deficit. He  exploded the debt.\n\nDon't ever lecture us about fiscal responsibility--not…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…coverage for  mammograms--work that continues to save lives.\n\nAdvanced protections for America's seniors, authoring legislation to  combat elder abuse and later advising President Bill Clinton at the  White House Conference on Aging.\n\nBeyond her legislative record, Congresswoman Oakar was instrumental  in shaping Cleveland's future--helping bring the Rock…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695548/moment-of-silence-for-mary-rose-oakar"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…some background in this. My father served as a chief judge of  the Western District of Texas in San Antonio. He served as FBI Director  for President Reagan, President Bush, and President Clinton. He  understood firsthand that control of crime has a lot to do with how you  deal with criminals, Mr. Speaker.\n\nThis opportunity that we bring today to the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695616/district-of-columbia-judicial-nominations-reform-act"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…program for millions of Americans.\n\nLet me be very clear about something: This isn't anything radical. We  are restoring the same commonsense work requirements that President  Bill Clinton signed into law in the 1990s, one of the most popular  things he did.\n\nBack then, a Democratic President worked with a Republican Congress  to say that if you are…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693239/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "Mr. GRASSLEY. Mr. President, 32 years ago today, I joined President  Clinton, Governor of Iowa Terry Branstad, and members of the Iowa  congressional delegation to tour catastrophic flood damage in my home  State. The great flood of 1993 ravaged…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693431/central-texas-floods"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…D-day Memorial,  served as its chairman for 7 years, and later wrote a memoir, ``Omaha  Beach and Beyond,'' to commemorate the sacrifices of our D-day  soldiers.\n\nU.S. President Bill Clinton signed legislation designating the  National D-day Memorial in Bedford as the Nation's monument to D-day,  and President George W. Bush dedicated the memorial in 2001.…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692106/national-d-day-memorial-in-bedford-county-virginia"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…to their  families and their communities by doing meaningful work.\n\nFor a long time, there was a bipartisan consensus around work  requirements. In 1996, for example, President Clinton and Newt  Gingrich, when he was Speaker of the House, came together to pass  monumental reforms on the way our welfare system works in America, and  one of the key components…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689668/government-funding"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…win a majority. Hakeem Jeffries' campaign solicited money from  Jeffrey Epstein. That is what we found in the last document batch.\n\nThe files underscore why former President Bill Clinton must appear  for his deposition. We have subpoenaed him. To date, the Democrats have  done nothing to help us secure his appearance.\n\nI support full transparency. The…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696808/epstein-files-transparency-act"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…has never required a declaration of war for every use of  force, national security or law enforcement operation against criminal  actors who threaten the United States.\n\nPresident Clinton acted in Kosovo. President Obama acted in Libya.  President Biden even ordered strikes against terrorist leaders. In none  of those cases did Democrats suddenly discover…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698883/successful-operation-to-arrest-nicolas-maduro"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…individual rules  when they opposed the Midnight Rules Relief Act, where we could have  taken care of these all in one fell swoop.\n\nLet's not forget it was a Democrat, President Clinton, who signed the  Congressional Review Act into law on a bipartisan basis, but our  colleagues have obviously fallen far from those past overtures of  consensus and common…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689054/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers-providing-for-consideration-of-hr-defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…U.S.-Africa Minerals Diplomacy?                 (Critical Questions by Gracelin Baskaran)\n\nThe African Growth and Opportunity Act (AGOA), first signed       into law by President Bill Clinton in 2000, is a unilateral       U.S. trade preference program set to expire in September       2025. Its pending reauthorization has sparked debate over       whether--and…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698908/agoa-extension-act"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…precedent from Presidents  of both parties. What authority did this operation exceed that  President Obama or President Reagan did not exceed in operations in  Libya? Or President Clinton in Kosovo? What makes this time different  than President Biden's strikes in Syria or Yemen? Certainly, there is  little daylight between the legality of this operation…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698662/venezuela"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…Congress and the next White House can  look at it and say: Yeah, that is out of bounds. That is too big. That  needs to be stopped.\n\nIt was actually first used under President Bill Clinton. He put in  what is called an ergonomics rule that literally changed the rules for  every keyboard on every desk in America that would be produced. It was  a giant…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691634/congressional-review-act"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…to go  in and take him down--take him out of Panama and put him in an American  prison. We used ground forces, and we lost people in that endeavor.\n\nThings like this, President Clinton used and threatened military  force to take a military coup in Haiti down and returned power back to  the elected leader of Haiti.\n\nI could go on and on and on about…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698616/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}]