[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…President telling us that strikes on land-based targets may be next, we  ask you to join us in reasserting Congress's vital control over the war  power.\n\nMr. SCHIFF. Mr. President, let me just take this opportunity to  address some of the remarks of my colleague who has, I think, rightly  pointed out the horrors of drug trafficking and those that are…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696120/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…important to the direction of the country, most important to who we  are.\n\nThe topic is about Congress and why Congress is the court of last  resort for an authoritarian President.\n\nLet me start by saying this that I think is exceedingly important.  There are many among us who would manage authoritarianism. They would  want to find a way to work with…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692116/authoritarianism"}, {"senator": "Thomas Suozzi", "party": "Democrat", "sentence": "…restore  the State and local tax deduction. Now, he is the one who took it away.  He said that we have to restore the State and local tax deduction.  Well, let's hold the President to that.\n\nLet's commend our five colleagues who are standing up against their  party to say they want to raise the State and local tax deduction.\n\nLet's be fair to these middle-class…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690627/republican-tax-cuts"}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "Ms. DUCKWORTH. Madam President, let me just say that, at the VA, we  recently passed the PACT Act, which added well over a million veterans  to the rolls to help care for them after they were exposed to toxic…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689816/9999"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "Mr. WHITEHOUSE. Mr. President, let me first thank Senator Kelly for  coordinating this unfortunate commemoration of a truly disgraceful  decision by the Republican appointees of the Supreme Court 16 years…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699104/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…Education Department who thinks it should not exist, who doesn't  care if we have a Department focused on getting our students and  schools the support they need.\n\nMadam President, let me finish with this. I still have in my office a  quilt that my kids in my preschool made for me on the very last day I  taught preschool. It is hung prominently on the…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688363/nomination-of-linda-mcmahon"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…the preamble be agreed to, and that the motions to  reconsider be considered made and laid upon the table with no  intervening action or debate.\n\nMr. BLUMENTHAL. Mr. President, first, let me say I am hopeful that we  can work together--if the chairman of the VA Committee is willing to do  it--to try to arrive at language that calls for the rehiring of…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688443/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "Mr. SCHUMER. Mr. President, so let's talk about what is going to  happen in the Senate in this period, in this work period.\n\nNow, we convene at the start of this pivotal work period. This week,  Republicans…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690192/business-before-the-senate"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…Secretary Rubio because that is not what the letters  say. The letters do not say what has been represented by my colleague.\n\nLet me read what Senator Risch asked the President, and then let me  read Senator Rubio's response.\n\nSenator Risch said: I respectfully request that you provide Congress  with an official correspondence confirming that Operation…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699109/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "Mr. DURBIN. Mr. President, let me pick up where the Republican leader  left off on air traffic controllers.\n\nThe biggest, busiest airport in the United States is O'Hare, when you  count both passengers…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697201/air-traffic-controllers"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…involved  in the case.\n\nI say to the American people: There is a mountain of evidence in  front of your very eyes. Believe your eyes. It is right there in front  of us.\n\nMr. President, let me say this to you: You can run, but you cannot  hide because the survivors know what happened.\n\nTo every woman and little girl who has wept or felt shame or believed…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696853/standing-with-truth-and-justice"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…in what is about to happen here in the Senate.\n\nAnd with that, let me note the presence on the floor of the  Democratic leader and yield the floor.\n\nMr. WHITEHOUSE. Mr. President, let me start with just a quick  overview of the Congressional Review Act which brings us here to the  floor today.\n\nUnder the American legal system, administrative Agencies…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691447/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…that the resolution  be agreed to, that the preamble be agreed to, and that the motions to  reconsider be considered made and laid upon the table.\n\nMr. WHITEHOUSE. Mr. President, let me just remind everyone who is  listening what this resolution resolved--three simple points: One,  climate change is not a hoax. Two, climate science is actually sound…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698993/unanimous-consent-request-s-res-550"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "Mr. SCHUMER. Mr. President, first let me thank our great Senator from  Virginia Senator Kaine. He has been the most vigilant watchdog against  over-encroachment of the military. He has been the most rigorous…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696558/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…the policies  of our colleagues on the other side of the aisle, because of wide-open  borders, and because of tolerance of violent criminals, because of a  Democrat President who has let violent criminals out on the street and  commuted their sentences; because of radical leftist judges promoted by  those that fund my colleagues on the other side of…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691169/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…American interests, no. They are using it to attack President  Trump. This week, they are going to force a vote on another War Powers  Resolution to tie the hands of the President. Let me be clear about  what that resolution does and what it does not do. It does not reassert  Congress's powers. It does not make America stronger. It makes America  weaker…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698571/venezuela"}, {"senator": "John Thune", "party": "Republican", "sentence": "Mr. THUNE. Mr. President, let me just say that the Democrats have  just used the filibuster for the fourth time this year. Why? Well, in  this case, no one really knows.\n\nThis is a bipartisan issue.…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690892/genius-act"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…for the Strategic Petroleum Reserve.\n\nI will be happy, when the time comes when we take up the bill, to  answer questions.                                   Housing\n\nMr. President, let me talk about another subject: housing. You can't  talk about housing if you don't start with supply and demand and the  cost of housing. What determines prices in America?…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699012/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "John Thune", "party": "Republican", "sentence": "Mr. THUNE. I would say to the Senator from South Carolina the answer  to that is yes.\n\nMr. THUNE. The answer is yes.\n\nMr. THUNE. Yes.\n\nMr. THUNE. Mr. President, let me just reiterate what the Senator from  South Carolina said, and that is that this measure that we passed does,  indeed, give important protections to Members. I think…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697049/unanimous-consent-requests"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…generosity. It makes me want to knee someone in the groin. It  just makes me furious, and I think the American taxpayers feel the same  way.\n\nWhat I am about to tell you, Mr. President--let me apologize in  advance--is deeply disgusting. It is deeply disgusting. I mean, it is  clown world on steroids. When I first read about this, I read it a  second time…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697400/welfare-fraud"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…now for  what the American people sent us here to do: Donald J. Trump's America  First agenda backed by 12 appropriation bills passed out of this House,  signed by the President. Let's fund our government.", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699347/department-of-homeland-security-appropriations-act-2026"}]