[{"senator": "Steve Cohen", "party": "Democrat", "sentence": "Mr. COHEN. Mr. Speaker, I am here to talk about two incidents that  shame me as a Member of this House and as an American citizen.\n\nToday, President Trump signed the Epstein documents release bill.  Lots of women were up here who were victims of Jeffrey Epstein's sexual  felonies, and they celebrated when the House passed it…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697016/justice-should-be-required"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…sixth time to call  for the Trump administration to restore funding for lifesaving food aid  for malnourished children.\n\nIt has been 2 months since Congress passed and President Trump signed  a funding bill for fiscal year 2025. It included money that can be used  to continue purchasing ready-to-use therapeutic food, a miracle peanut  paste that saves the…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690809/funding-food-aid-for-malnutrition"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…safe workplaces, holidays, the length of the workweek, and  vacations were negotiated for all of us. We have them because unions  negotiated them.\n\nWe are here because President Trump signed an executive order seeking  to end collective bargaining rights for  unionized Federal employees across several agencies. Congress granted,  not the executive branch,…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697987/protect-americas-workforce-act"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "…supportive.\n\nWe know this bill is a historic win which overcame opposition from  Speaker Johnson and certainly antiworker allies across the government.\n\nIn March, President Trump signed an executive order terminating  collective bargaining rights for Federal police officers, firefighters,  nurses, food safety inspectors, and so many more.\n\nThe nurses…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697981/protect-americas-workforce-act"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…than vague references to  drug interdiction. It was clear then and it is perfectly clear now that  they were preparing for an attack on Venezuela.\n\nBy late summer, President Trump had signed a secret directive  ordering the Pentagon to conduct maritime strikes on drug boats.  Secretary Hegseth then signed an execute order, or EXORD, directing  lethal…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699116/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…irresponsible, immoral, and it is going to wind up with scarred  oilfields all across these refuges that, unfortunately, were completely  and totally avoidable.\n\nYesterday, President Trump signed, in many ways, the death warrant  for all of these precious areas in our country because he pulled out of  the race to increase the fuel economy standards--where we…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697516/hj-res-131"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…I did. I was joined by Chuck Grassley, a Republican of  Iowa, and Mike Lee, a Republican of Utah. We passed a bill called the  FIRST STEP Act, and it was sent to President Trump, who signed it into  law in his first term.\n\nNow comes Cristian Stevens, Judge Stevens, wanting a seat on the  Federal bench. I am concerned about a law review article he wrote…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693940/judicial-nominations"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…fraud by the same extremist who brought  us the January 6 insurrection.\n\nTheir objective of suppressing the vote was made even more clear last  week, Mr. Speaker, when President Trump signed an executive order to  erode voting rights and gave Elon Musk, an unelected, unconfirmed  person, the right to access Americans' personal voter information.\n\nMr. Speaker,…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689343/fighting-voter-suppression"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…a ton of funding that  Congress passed for summer school and afterschool programs. And again  with the ``Big Bad Bill'' that our Republican colleagues just passed,  President Trump signed into law a bill that gutted funding for critical  resources like Medicaid and SNAP, ripping healthcare and food  assistance from millions of Americans, all to cover…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693590/rescissions-act-of-2025"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…entrusts our States--and in the case of  certain core rules of conduct, Congress--with the authority to regulate  elections, not the Executive.\n\nThe Executive order President Trump has signed flips that framework  and purports to vest the President with expansive new powers that he  does not have--not just him but any chief executive.\n\nIt attempts to enact…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690522/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…very concept of safety, repealing numerous rules designed to  protect our communities and workers, and even withdrawing the rule that  was required by law that President Trump himself signed.\n\nThis bill, Mr. Speaker, and other energy bills we considered this  week out of the Committee on Energy and Commerce are not a serious  attempt at a permitting…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698067/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…area in which the Trump administration went       beyond threats to try to use the machinery of government to       punish critics. During his first week in office, President       Trump signed an executive order authorizing federal agencies       to withhold funding from ``sanctuary cities'' that refused to       cooperate with the administration's crackdown…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "John Thune", "party": "Republican", "sentence": "…list.\n\nWe got started by sending the Laken Riley Act to President Trump's  desk during his first week in office to keep criminal illegal  immigrants off our streets.\n\nPresident Trump signed the HALT Fentanyl Act last Wednesday, which  permanently classifies fentanyl analogs as the deadly drugs they are.\n\nOn Friday, he signed the GENIUS Act, the landmark…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693870/trump-administration"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…for their acquisition and a  payment has been made.\n\nMrs. MILLER of West Virginia. Mr. Speaker, I rise today in strong  support of this big, beautiful bill.\n\nIn 2017, President Trump signed the largest tax cut in history into  law.\n\nToday, thanks to the hard work of the Ways and Means Republicans, we  will make those tax cuts permanent and prevent an end-of-the-year…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693189/one-big-beautiful-bill-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…complicate the delivery of water in California  communities. It is already complicating the delivery of water.\n\nPassing this resolution will further the priorities of President  Trump, who has signed two executive orders aimed at removing  unnecessary regulations that prevent water from being delivered to  southern California.\n\nThe current paradigm of having…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690599/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…utilities.\n\nI want to let the families who lost everything know that if there is  anything my office can do to be of any assistance, don't hesitate to  reach out. President Trump has signed a declaration for individual  assistance. FEMA should be on the ground, working with families to try  to help identify any type of assistance that the families in…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690765/recovering-from-north-carolina-floods"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…protect American  children and families by halting so-called gender-affirming care for  children in this country.\n\nAs another testament to his impressive pace, President Trump has also  signed 27 bills into law, the greatest of which, the One Big Beautiful  Bill Act, delivers tax cuts to American families, solidifies funding  for America's Golden Dome,…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694059/six-months-of-america-first-leadership"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…President Trump bolsters  our domestic manufacturing, returning production to the U.S., American  companies need the workforce to support these industries.\n\nLast week, President Trump signed an executive order to modernize our  workforce programs to better prepare the American people for these  high-paying jobs in the trades.\n\nThis Presidential action will…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690194/repealing-green-new-deal-policies"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…in Houston, Texas.\n\n(2) Two illegal aliens who were allegedly members of the       Tren de Aragua gang have been charged with her murder.\n\n(3) On March 4, 2025, President Donald J. Trump signed       Executive Order 14229 (90 Fed. Reg. 11585; relating to       honoring Jocelyn Nungaray) renaming the area known as the       Anahuac National Wildlife Refuge…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693446/jocelyn-nungaray-national-wildlife-refuge-act"}, {"senator": "John Joyce", "party": "Republican", "sentence": "Mr. JOYCE of Pennsylvania. Madam Speaker, I rise today to share the  importance of the One Big Beautiful Bill Act that President Trump  signed into law on July Fourth.\n\nPresident Trump's America First policy is widely popular with the  American public, and the big, beautiful bill took historic steps to  enact…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693458/golden-age-of-america-has-arrived"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…ANWR development and led to the creation of the 2024 ROD.  Fortunately, elections have consequences, and on January 20, his first  day in office of his second term, President Trump signed Executive  Order 14153, ``Unleashing Alaska's Extraordinary Resource Potential,''  which called for the rescission of Biden's illegal cancellation of the  ANWR leases…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697739/9999"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…codifies a  portion of President Trump's Executive Order No. 14172, which directed  the Board on Geographic Names to rename the Gulf of Mexico as the Gulf  of America. President Trump signed this executive order on his first  day in office.\n\nEnacting this legislation will help make President Trump's historic  action permanent and ensure consistency in references…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690939/gulf-of-america-act"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…Senator Britt and from Senator Ted Budd of North  Carolina. It is called the Laken Riley Act. It was the first bill that  we passed this year and the first bill that President Trump signed into  law. It mandates the detention of illegal immigrant criminals.  Amendments from Senator Joni Ernst and Senator John Cornyn made it even  stronger.\n\nWe also passed…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698252/nominations"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…SUPPORT for Patients  and Communities Reauthorization Act. I thank Mr. Guthrie for  introducing this important legislation. This bill reauthorizes the 2018  legislation President Trump signed into law and strengthens it. I am  glad to say that across the country we are seeing a decline in overdose  deaths. Of course, the work is not over. My colleagues are…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691940/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "Mr. GRASSLEY. Mr. President, on July the Fourth, President Trump  signed into law the One Big Beautiful Bill Act. The centerpiece of this  legislation is a permanent extension of the 2017 tax law, thereby  averting the largest tax hike…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694089/one-big-beautiful-bill-act"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…infrastructure, energy, and community health across the North Slope of  Alaska.''\n\nFortunately, elections have consequences, and on his first day in  office of his second term, President Trump signed Executive Order  14153, ``Unleashing Alaska's Extraordinary Resource Potential,'' which  called for the rescission of the 2022 Integrated Activity Plan Record  of Decision…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…are simple: If you allow men to compete in  women's athletics, you will lose your Federal funding.\n\nTo no one's surprise, the order is getting results. Right after  President Trump signed it, the NCAA, which oversees more than 530,000  student athletes, announced that it would comply with the order.\n\nFor more than a decade, the Nation's largest athletic…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688449/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}]