[{"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…the day I was designated as the Acting       Assistant Administrator, Secretary of State Rubio issued a       waiver for Life-Saving Humanitarian Assistance to President       Trump's Executive Order pausing foreign assistance.\n\nFrom Day One, implementing this waiver was my highest       priority. My team recognized it as the only way to mitigate…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691139/us-global-health-programs"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…disastrous regime change war that the  American people do not support.\n\nIt is time for every Member of Congress to go on record and stand  with the Constitution instead of President Trump's executive overreach.  I urge my colleagues to vote in favor of these two war power  resolutions.", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698418/supporting-of-h-con-res-61-and-h-con-res-64"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "Mr. KHANNA. Mr. Speaker, I rise today to introduce as legislation  President Trump's executive order for the most-favored-nation status on  drug pricing.\n\nMy legislation will codify President Trump's executive order, which  basically says that Americans should…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691277/introducing-legislation-on-drug-pricing"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "Ms. BONAMICI. Mr. Speaker, I rise today to condemn in the strongest  terms possible President Trump's executive order that threatens  millions of students and local public schools through the dismantling  of the Department of Education.\n\nThis is an illegal and unconstitutional…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689037/majority-of-americans-support-department-of-education"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…freedoms  of all Americans.\n\nThe No Rogue Rulings Act of 2025 would prevent federal district court  judges from providing nationwide injunction relief when one of  President Trump's executive orders, policies, or actions violates  people's constitutional rights and freedoms. Nationwide injunctions are  issued against the federal government when its actions…", "date": "2025-04-17", "source_url": "https://justfacts.votesmart.org/public-statement/1690122/no-rogue-rulings-act-of-2025"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…administration's continued misuse of the National Guard and active-duty  military for domestic law enforcement purposes. The bill codifies  portions of several of President Trump's executive orders regarding  U.S. military activity on the Southern Border, including the  administration's establishment of new National Defense Areas. It does  not provide…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698005/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…Hawaiian cultural renaissance in the 1970s.\n\nIn 1978, Olelo Hawaii was finally recognized as an official language  of the State of Hawaii--quite the contrast to President Trump's  Executive order designating English as the language of our country.\n\nOlelo Hawaii has been reintroduced to the public education system,  and Hawaiian language immersion schools…", "date": "2026-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1700306/hawaiian-language-month"}, {"senator": "Jared Golden", "party": "Democrat", "sentence": "…resolution, all time yielded is for the purposes of debate only.                                General Leave\n\nThe Protect America's Workforce Act would overturn President Trump's  executive order from March that ended collective bargaining rights for  roughly 1 million Americans who work for the Federal Government.\n\nSince the order was made, the administration…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697864/providing-for-consideration-of-hr-2550-to-nullify-the-executive-order-relating-to-exclusions-from-federal-labor-management-relations-programs-and-for-other-purposes"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…permitted.\n\nSo let's be clear. Spending your time canceling ready-to-go energy  projects isn't doing anything to address the energy crisis.\n\nInstead of fixing any of this, President Trump's Executive order  makes it worse. Here is what his order actually does: hikes energy  costs for millions of Americans by doubling down on expensive fossil  fuels when it makes…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696124/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Donald Norcross", "party": "Democrat", "sentence": "…including the  Department of Defense.\n\nUnions, the collective bargaining agreement, were created by a vote  of the workers--by a vote. They voted overwhelmingly. President Trump's  executive order seeks to silence those workers by overriding this  sacred vote.\n\nMr. NORCROSS. Mr. Speaker, I ask my colleagues to please join me in  voting for this motion…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697802/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…their birth  certificate, which differs from the name on their ID, is because they  got married. They would be unable to register to vote.\n\nHere is what we do know. President Trump's executive order doesn't  want any alternative forms of identification, no alternative State  processes, no additional avenues for voters. Why would we expect the  EAC to disregard…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690001/safeguard-american-voter-eligibility-act"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…ensures America remains prepared  to deter aggression and protect our interests around the world. This  legislation also directly reflects the priorities set forth in  President Trump's executive order on prioritizing military excellence  and readiness, which reaffirmed America's commitment to the military  superiority necessary to counter new and emerging…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697636/public-lands-military-readiness-act-of-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…our  consumers. We should not, Mr. Speaker, squander that opportunity.\n\nThis priority has been agreed to by both President Biden, with his  executive order, and President Trump in his Executive Order 14178.\n\nMr. Speaker, through multiple versions of stablecoin legislation, the  House and Senate have shared ideas and crafted workable approaches. Our  joint…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693834/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…them  effective veto power over a duly elected President with a mandate to  clean up a bloated Federal bureaucracy.\n\nSpecifically, this legislation would nullify President Trump's  executive order titled ``Exclusions From Federal Labor-Management  Relations Programs.'' The executive order wisely designated various  agencies as having a national security…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697995/protect-americas-workforce-act"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…opportunities in the U.S.\n\nH.R. 4090 will provide greater stability and predictability       for mine developers and promote job creation by codifying key       provisions of President Trump's executive orders related to       domestic hardrock mining. This legislation represents an       important step toward a more efficient, predictable and       durable federal…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699694/critical-mineral-dominance-act"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…President Trump's election.\n\nToday, I am thankful that we have the opportunity to reverse this  rule before any permanent damage could be done. Today, we are advancing  President Trump's executive order to expand American energy production  and achieve energy dominance. We are standing up for the people of  Colstrip, for the workers of eastern Montana, and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694891/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Michael Rulli", "party": "Republican", "sentence": "…by putting the grid up  against the wall.\n\nWe have to take into consideration what could come in the future. I  do want to take a moment, and I want to thank President Trump and his  executive order that he knows that this bipartisan committee for coal  was established over the last 30 years, and it was a bipartisan  approach to make sure that national…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695766/national-coal-council-reestablishment-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Greene of Georgia.\n\nThroughout the history of the United States, the executive branch has  renamed our public lands and waters. This legislation codifies a  portion of President Trump's Executive Order No. 14172, which directed  the Board on Geographic Names to rename the Gulf of Mexico as the Gulf  of America. President Trump signed this executive order…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690939/gulf-of-america-act"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…also voiced  their support for reversing this restrictive rule, and the  administration itself has made clear that restoring access to the NPR-A  is a priority.\n\nPresident Trump's Executive Order No. 14153, Unleashing Alaska's  Extraordinary Resource Potential, directs the Secretary of the Interior  to review and rescind the 2022 decision and reestablish…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696835/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…events. It is not just unfair. It is a  betrayal of the young women who dedicate themselves to excellence  through hard work and training.\n\nLike many others, I welcomed President Trump's executive order  earlier this year, keeping men out of women's sports, as a step in the  right direction. However, in Washington State, the law still requires  schools to…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692397/recognizing-lauren-matthew-of-west-valley-high-school-state-champion"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…in ensuring our Nation's Capital is an  ally, not an opponent, in the fight to end this crisis.\n\nSpecifically, H.R. 2056 represents an important step in codifying  President Trump's executive order on making the District of Columbia  safe and beautiful by directly supporting the directive for enhanced  coordination between the Federal Government and law…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692370/district-of-columbia-federal-immigration-compliance-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…this  abundant natural resource to our allies abroad, not burying this  baseload power under layers of bureaucracy.\n\nBy passing this CRA today, we are advancing President Trump's  executive orders on unleashing American energy and reinvigorating  America's coal industry. We are also restoring hundreds of millions of  dollars in future revenue for Wyoming's…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696879/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…greater dependence on foreign nations, including our  adversaries.\n\nI applaud Congressman Downing of Montana for introducing this joint  resolution, which aligns with President Trump's executive orders to  reinvigorate America's clean coal and unleash American energy, restore  strength to our energy policy, and put the needs of his constituents  and all…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694893/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…noncitizens attempted to vote in Iowa.  Five of those attempts were caught before the ballots were counted, but  35 unlawful ballots were actually tallied.\n\nThanks to President Trump's Executive order concerning election  integrity and the U.S. Citizenship and Immigration Service's needed  upgrades to the SAVE system, other States can avoid the uncertainty…", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697595/voting"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…critical that we get the capital necessary for U.S.-owned small  businesses to ensure they have everything they need to expand and grow.\n\nThis bill codifies both President Trump's executive order to end  taxpayer subsidization of open borders and Administrator Loeffler's SBA  7(a) program guardrails put in place earlier this year.\n\nMr. WILLIAMS of Texas.…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692123/american-entrepreneurs-first-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…administration reversed this decision  against the wishes of Alaskans and finalized a new RMP that enshrined  Public Land Order 5150.\n\nOn his first day in office in 2025, President Trump issued Executive  Order No. 14153 on ``Unleashing Alaska's Extraordinary Resource  Potential,'' which directly called for repealing the Biden  administration's central Yukon RMP.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694898/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}]