[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…preemptive strikes in the first place, regardless of whether or not  you support the President generally or you do not, the Constitution  charges the Congress, not the President, with the power to declare war.\n\nNow, there may be a fog of war and a murky uncertainty concerning the  battle damage assessment, but there is no ambiguity here when it comes  to…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693120/motion-to-discharge-sj-res-59"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…seriously look at. We  spend $3.5 million per trip. Tell Mr. Musk to go and ``DOGE'' that  because that is something that is real. That is something that is  within the President's power to be able to stop. Yet, we come in this  Chamber and take pride in firing and announcing the terminations of  hardworking men and women.", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688514/people-not-statistics"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…that the Impoundment Control Act bars this maneuver. The  Government Accountability Office stated unequivocally that ``[t]his  interpretation would, in effect, give the President power to amend or  to repeal previously enacted appropriations merely by calibrating the  timing of the submission of a special message'' and that ``[a]  withholding of this…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694158/senate-amendment-to-hr-4"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…attack on that boat down  in the Caribbean is incredibly problematic. This is an expansion of the  war powers of the President that we have never seen before.\n\nIf the President has the power on his own, without even notifying  Congress, much less with us exercising any oversight of it, to declare  war on any drug cartel in the world whenever he wants to,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695253/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…isn't. And that  is what happens in this special power when it is submitted within 45  days of the end of the fiscal year.\n\nSo however much one may like or dislike a given President in power,  support or oppose, all of us have a responsibility to stand up for our  constitutional power of the purse; that all of America will be served  by the laws we pass and…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696665/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…President  claimed this kind of maniacal power, you would be enraged.\n\nSo I ask you, Mr. Speaker: Where is the outrage now? Where is the  pushback? Do not give this President any more power.", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699022/where-is-the-outrage"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…highways, on agriculture, and on  pollution prevention programs.\n\nWell, of course, this was appealed on a constitutional basis because  the Constitution doesn't give the President the power to impound funds.  Congress, by law--and by law signed by a President--had said: Here is  what must be spent on these programs. And the President came along, and  President…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693589/rescissions-act-of-2025"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…shouldn't hold  public trust.\n\nSir, you should do the honorable thing. You should resign. If you  don't resign, the people of this country, notwithstanding all of the  President's power, the people of this country, we the people, will have  the last word.\n\nYou are going to see protests. You are going to see more protests  because we the people refuse…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689201/and-still-i-rise-censured-but-not-silenced"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…handed to  the President, who as Commander in Chief is responsible for executing  on that declaration.\n\nThe Framers of the Constitution did understand one thing about the  President's power, which is the President as Commander in Chief should  defend the Nation. The President always has the ability to defend the  United States without asking Congress's permission.…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692637/war-powers-resolution"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…Congress.\n\nOur country's Founders feared the possibility of a President engaging  in unnecessary wars. In Article I of the Constitution, the Founders  gave Congress, not the President, the power to declare war. Congress  later passed the War Powers Resolution of 1973, which allows Presidents  to engage in military action for up to 60 days without a vote of…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689063/prevent-president-trump-from-invading-other-countries"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…the vagueness of that statute are the reasons we now need reform.\n\nLimits were imposed, but the limits are filled with loopholes,  practical gaps that fail to check the President's power. The problems  the act was designed to address are no longer commensurate with the  dangers it is now creating.\n\nI reintroduced this legislation for this Congress, and…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696181/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…because,  remember, the Supreme Court can't control this authoritarian President,  and my colleagues on the other side of the aisle won't control this  authoritarian President. They have the power to, but they won't.\n\nMr. Speaker, impeachment and this congressional court of last resort,  Congress is where the court of last resort lies.\n\nI am familiar with…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692116/authoritarianism"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…to decide if we go to war, and then the President  commands our military to go to war.\n\nArticle I gives Congress the power to declare a war and article II  gives the President the power to be the Commander in Chief to execute  the war. Senator Kaine's War Powers Resolution says hostilities in Iran  must be explicitly authorized by Congress, but that…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693126/motion-to-discharge-sj-res-59"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…proposed under the statute  IEEPA.\n\nYesterday on the floor, as I talked about the Brazilian tariffs, I  told everyone what IEEPA was meant to do. It was meant to give the  President power to take action in the event of an international  emergency.\n\nAn international emergency is defined in a pretty significant way so  as to not be used in minor instances.…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696447/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…Well, it is time for us to stand up. This vote is about reasserting  Congress's constitutional role, article I, section 8, of the  Constitution gives Congress--not the President--the power to impose  tariffs and regulate commerce with foreign nations. We must stand up  for American workers, businesses, and consumers and remind our allies  and ourselves…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696446/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…Convention. They wrote about  it in the Federalist Papers, and from Hamilton to Jefferson, the  spectrum of our Founding Fathers concluded they didn't want the  President to have this power. They said the initiation--the declaration  of war shall be vested by Congress in the legislature.\n\nSo what we have is an elaborate song and dance. They know the…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699091/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…and so much of this. It is  Congress's fault for giving it. Over the last 70 years, there are  probably a dozen pieces of legislation where Congress said to the  President: Here, take this power. Create emergencies. Put on tariffs.  Negotiate for us because we are too feeble-minded to do it ourselves.\n\nBut the thing is, the Constitution doesn't let us…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689478/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…section 202 of the  National Emergencies Act with respect to various resolutions declaring  a national emergency. The National Emergencies Act is a statute that  gives the President the power to declare a state of emergency. It also  gives Congress not just the power but the obligation to evaluate every  6 months whether we are still in a state of emergency.…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700046/legislative-calendar-days"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…to give Congress the power to  ``declare war.'' They specified that Congress would have the power to  initiate or declare war, but the execution of a war would be the  President's power.\n\nBut they wanted to make sure that the President would be able to  defend the country against foreign attack without awaiting  congressional action.\n\nThis comes up all…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698611/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}]