[{"senator": "Peter Welch", "party": "Democrat", "sentence": "…they have to come up with trillions of dollars in  savings. The only place you are going to get that is by cutting  Medicaid.\n\nWe have a contradiction here because the President says he loves  Medicaid, but he also says he loves the House bill. And the House bill  does not love Medicaid. What the House bill does is it attacks  Medicaid.\n\nIn Vermont,…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688257/department-of-health-and-human-services"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…unlawful and unethical actions waiting to  be carried out by the Trump administration. There will be no putting  the genie back into the bottle.\n\nIt is going to unleash the President who says he is a stable genius  to continue to perpetrate more of his unconscionable actions on the  people of our country.\n\nSo let's not trigger this nuclear option. Let's not…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691549/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…basic  disability accommodations in the office, like making sure the office  coffee pot is in reach of someone in a wheelchair.\n\nAre these destroying our workforce like the President says?\n\nThese moves are not about fairness. They are about power and about  stripping protections from the most marginalized so that the powerful  can operate without accountability.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695577/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…strive and dream for more,  to stay in a lane that society has set for us.\n\nMr. Speaker, we have so many representations of women who have  decided ``no.'' Like our Vice President says, we just eat ``no'' for  breakfast.\n\nRepresentation matters. The fact that young girls and boys will soon  be able to see the contributions of women and value those contributions…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689366/womens-history-month"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…on five things that are going to happen--five things  that are going to happen because we no longer have to talk about a  House version or a Senate version or what the President says he wants  or if someone says ``If I don't get this, I am going to vote no''; now  we have a law. We have public law, Federal law.\n\nThe first thing that is going to happen…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693485/one-big-beautiful-bill-act"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…Journalism loses its credibility  when the facts being distributed by the White House change all the  time.\n\nTrump says the tariffs are permanent.\n\nJournalists report that the President says the tariffs are permanent.\n\nAn hour later, Trump says: I never said they are permanent. They are  not permanent. I am cutting deals.\n\nThey write that he is cutting deals.…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690111/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…forecast, with its growth outlook about a quarter lower than       last year due to permitting delays, supply chain bottlenecks       and rising costs.\n\nMr. BLUMENTHAL. Mr. President, it says:\n\nThe West's energy watchdog now expects the [United States]       to add nearly 250 gigawatts of new capacity by 2030--down       almost 50% from last year's projections--as…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696127/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…we are all scrambling with the news of a 90-day pause on tariffs  after  President Trump swore up and down he would do no such thing. Sadly, we  cannot trust a word our President says, let alone plan around his  erratic behavior. Mr. Trump's turbulent game of chicken with some of  our closest allies is absurd.\n\nHow does Mr. Trump expect people whose…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690067/tariffs"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…Institute to the Wall Street Journal, to nonpartisan  groups, to the Congressional Budget Office, everyone is pointing to  what is happening as not normal, not what the President says it is, as  something that is going to hurt Americans, something that is going to  cost us more money in the long run--that someone is going to take  people with disabilities…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…demanding we double down on bigger, stronger  horses, because that is what this is--a deliberate attempt to deny the  future because it threatens the status of Big Oil.\n\nThe President says that he is for energy independence. That is their  mantra: Make America energy independent. But that is not what they are  doing. They are killing clean energy all over…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691621/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…States of America.  We are now seen as a country that doesn't honor its word. The President  negotiated a trade deal with Canada and Mexico; he breaks the trade  deal. The President says that he wants Canada to be the 51st State;  Canada is not about to become the 51st State.\n\nI will be quite candid with you, I admire the way the Canadians have  made it…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690093/protecting-the-american-dream"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…won't engage in creative legislative history  reinterpretation of that Republican unanimous vote in 1977 that allowed  Jimmy Carter to become a King on tariffs.\n\nSo the President says it is ``enemies of the country'' who are suing  him. If that is how you view Main Street in America--Kiwanians,  Rotarians, small business, chambers of commerce all across…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696444/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…the rest--not this guy. At a  time when people are about to have their health insurance premiums  double or triple and when food programs are getting taken away, this  President says that his priority is to build a $250 million party room.  That is a lot of money. That is more money than most people will see in  their lives. I mean, heck, $1 million…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696347/trump-administration"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…circumstances just like this.\n\nIn one moment, the Department of Agriculture says they will send just  50 percent of the monthly benefits to SNAP. The next moment, the  President says he will only send out SNAP benefits when the government  reopens. When it comes to feeding 42 million Americans, our most  vulnerable neighbors and friends, suddenly the…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696536/government-funding"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…you doing?\n\nThis is an American energy kill switch. Solar jobs will vanish. Wind  jobs will vanish. Manufacturing jobs will go to China, just the  opposite of what the President says he wants. And people's electric  bills will go up.\n\nSo America, when your electric bill starts going up, talk to Donald  Trump, talk to the Republicans in the House, and…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691671/budget-reconciliation"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…resources, and are facing the largest tax  hike in American history, or we can change course.\n\nThe One Big Beautiful Bill Act ushers in the golden age of America,  as our great President says, where taxpayers, not illegal immigrants,  are put first. It eliminates taxes on tips and overtime and brings tax  relief to seniors. It saves and sustains Medicaid so…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693179/one-big-beautiful-bill-act"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…Senate and House investigated  for seditious behavior, which our President claims is punishable by  death.\n\nMany of my colleagues have said: Pay no attention to what the  President says; pay attention to what he does.\n\nI will say: I am paying attention to what he is doing because, in  addition to a steady stream of late-night rants on social media, we…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699917/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…resolution. It is not a secret. Anybody can read  it.\n\nThe President doesn't have the authority to combat MS-13, Tren de  Aragua, Sinaloa Cartel, take your pick. If the President says they are  terrorists, and they are in the Western Hemisphere, the President can't  touch them.\n\nThat is what they are trying to do. They want to tie his hands and  not…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698249/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "Mr. CARTER of Georgia. Mr. Speaker, I thank the gentleman for  yielding and for hosting this Special Order Hour.\n\nMr. Speaker, America is back and, like the President says, hotter  than ever.\n\nThroughout 2025, Republicans worked to undo the damage of the Biden- Harris administration, resulting in less red tape, bigger paychecks, a  blue-collar…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699063/how-republicans-have-delivered-for-americans"}]