[{"senator": "Joe Courtney", "party": "Democrat", "sentence": "…will       impact providers and patients.\n\n``My best guess is it's not going to be good for hospital       providers and health care in general,'' Vincent Capece,       president and CEO of Middlesex Hospital, an independent       hospital located in Middletown, CT. ``There's going to be       less money available, but exactly how much and how that all…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694776/congress-long-to-do-list"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…almost like the roadless rule was written by fishermen-- because it was.\n\nIn fact, it was written by many hunters and fisherman, actually. One  of them is, today, the President and CEO of Trout Unlimited, who served  as the senior policy and communication advisor to the chief of the  Forest Service when this rule was crafted back in 2001.\n\nWhen my friends…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695667/cloture-motion"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…Mr. Speaker, I rise today to recognize Dr. Kiara  Kuenzler of Denver, Colorado for being named the Nexstar 2025  Remarkable Woman of Denver.\n\nDuring her 7-year tenure as President and CEO, Dr. Kuenzler  positioned the Jefferson Center for Mental Health as a leading  community provider by expanding access to services and growing the  Center's workforce…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692052/recognizing-dr-kiara-kuenzler"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "Mr. TONKO. Mr. Speaker, I rise to recognize and congratulate Abigail  Ross Hopper, who is retiring from her role as president and CEO of the  Solar Energy Industries Association.\n\nFor nearly a decade, Abby has led efforts to develop, to enact, and  defend policies to support solar energy and energy…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699172/congratulating-abigail-ross-hopper"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Columbia.            Sincerely,\n\nThe Washington, DC Business and Civic Community; Anthony       Williams, CEO & Executive Director, Federal City Council;       Jack McDougle, President & CEO, Greater Washington Board of       Trade; Chinyere Hubbard, President & CEO, DC Chamber of       Commerce; Lisa Mallory, President & CEO, Apartment & Office       Building…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699680/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…definitively speak in one voice to ensure that our region's  priorities break through the noise.\n\nOn behalf of Rhode Island, I want to congratulate the New England  Council, president and CEO Jim Brett, the entire board of directors,  and all its members on a well-earned centennial. From working to  address our region's housing shortage and infrastructure…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696048/100th-anniversary-of-the-new-england-council"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…we are not having a long-overdue debate. We are not bringing  together the world's most deliberative body to focus on how to solve  these problems.\n\nMichael Tuffin, the president and CEO of AHIP, America's Health  Insurance Plans:\n\nMedicaid is indispensable to low-income people and working       families. If their Medicaid coverage is disrupted, these…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "Mr. PAPPAS. Mr. Speaker, I rise today in recognition of Tess  Kuenning, president and CEO of Bi-State Primary Care Association. Her  community-based approach to public health and exceptional leadership  have significantly improved both the quality and accessibility…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695528/recognizing-tess-kuenning"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…Kilberg. Bill is president of the mid-Atlantic region of the  AFHU and a member of the board of governors, among many other stops in  his legal and business career. Bobbie is president and CEO emerita of  the Northern Virginia Technology Council, an entity that has done so  much to shape the Virginia economy of today.\n\nAs I reflect on the interweaving strands…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697239/100th-anniversary-of-hebrew-university-of-jerusalem"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…government. The members of USRC's board of directors are the  Federal Railroad Administration, Amtrak, the Federal City Council, the  District of Columbia and the USRC President and CEO. USRC is the only  entity exclusively dedicated to the management and operations of Union  Station and therefore should be eligible for funding under the FSP  Program,…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689966/introduction-of-the-union-station-redevelopment-corporation-funding-eligibility-act"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…surrounding counties.\n\nThose to be honored include:\n\nThe Gabelli Leadership Awards will be given to Paul Adler, chief  strategy officer of Rand Commercial; Adam Hammerman, vice president and  CEO of New York Medical College; and Brad Schwartz, a partner at Zarin  & Steinmetz law firm.\n\nThe Friedland Young Leadership Awards will be given to Samuel Adler  of Rand…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698121/recognizing-jewish-business-network-awardees"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…preserve consumer protections.            Sincerely,                                                     Paul N. Cicio,                                                   President & CEO.\n\nMs. CASTOR of Florida. They say this bill is inconsistent with the  President's pledge to put America first, and it prioritizes gas exports  over U.S. consumers by removing…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697080/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…Ocasio, have lent their talents and  time to creating and growing the National Museum of Puerto Rican Arts  and Culture, also based in Humboldt Park. In Billy's role as president  and CEO, as well as in Veronica's role as director of education and  programming, the Ocasios have nurtured the museum to become a locally,  nationally, and internationally celebrated…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692932/holding-power-accountable"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "Mr. VINDMAN. Mr. Speaker, I am honored to recognize this week's  constituent of the week, Ernisha Hall, on her work as cofounder,  president, and CEO of the Virginia Black Chamber of Commerce.\n\nFor over half a decade, Ernisha has been leading the chamber in  working to foster economic stability for Black businessowners.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694877/constituent-of-the-week-ernisha-hall"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "Mr. FITZPATRICK. Mr. Speaker, I rise today to honor a remarkable  leader, dedicated family man, and proud son of Bucks County--Mr.  Michael J. Mabin, Jr., President and CEO of PennFab, Inc.,  headquartered in Morrisville and Martelli Companies, headquartered in  Ivyland.\n\nMike Mabin is more than a successful businessman--he is a builder…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690252/recognizing-michael-j-mabin-jr-50-years-of-life-leadership-and-service"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…made it a mission to move forward and overcome the challenges  his life presented.\n\nAs one of many accomplishments, in 2019, Mr. Mittman became the first  legally blind president and CEO of Bosma Enterprises, the largest  employer for people who are blind in Indiana.\n\nBeyond that, Mr. Mittman also serves as the president of the National  Association for…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695725/highlighting-the-work-of-jeff-mittman"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…the chance on this same panel to visit with  representatives of the agricultural sector, including Dante Galeazzi--I  am going to butcher Dante's name--Galeazzi, who is president and CEO of  Texas International Produce Association, who emphasized to me how  beneficial the Trump tax cuts were for Texas farmers and ranchers.\n\nThe message I heard from all…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690294/texas"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Sincerely,      Nicole Wojciechowski,\n\nPresident, Inupiat Community of the Arctic Slope.      Josiah Patkotak,\n\nMayor, North Slope Borough.      Rex A. Rock Sr.,\n\nPresident and CEO, Arctic Slope Regional Corporation.\n\nMr. WESTERMAN. Mr. Speaker, I would submit that a recipe for disaster  is when an administration goes out on their own, goes around…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696834/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…Act also protects about 72,000 full-time  jobs in Utah over the next 4 years relative to if the 2017 Tax Cuts and  Jobs Act had been allowed to expire.\n\nDerek Miller, president and CEO of the Salt Lake Chamber of Commerce,  said: ``This vital legislation provides crucial long-term certainty for  Utah's businesses and families. Making these progrowth…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694796/promises-made-promises-kept"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…Warren County, Pennsylvania. Since 1989, he has served in  some capacity with the Warren County Chamber of Business and Industry.\n\nSince 1997, he has led the WCCBI as president and CEO. He also serves  as executive director of the Warren County Development Association.\n\nJim is a native son of Warren County and a 1975 graduate of Warren  Area High School.…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697068/recognizing-jim-decker"}, {"senator": "Tony Wied", "party": "Republican", "sentence": "Mr. WIED. Mr. Speaker, I rise today to recognize the legacy and  esteemed career of Green Bay Packers president and CEO Mark Murphy, who  is set to retire at the end of this week after serving in the role for  more than 17 years.\n\nMark Murphy is a Green Bay Packers legend and a highly…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694121/recognizing-mark-murphy"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "Mr. SMUCKER. Mr. Speaker, I am pleased to honor and congratulate Mr.  Dennis Steiner on his retirement as President and CEO of VisionCorps.\n\nVisionCorps is a non-profit organization that provides  rehabilitative, preventative, educational, and employment services to  the blind and vision impaired.…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696276/congratulating-visioncorps-president-and-ceo-dennis-steiner-on-his-retirement"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "Mr. LaHOOD. Mr. Speaker, today, I rise to recognize Don Johnson for  his decades of dedicated service in the nonprofit sector and his  impactful tenure as President and CEO of Goodwill Industries of Central  Illinois. In this role, Johnson led the organization to expand  workforce development efforts and launched new initiatives aimed at…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693113/congratulating-don-johnson-on-his-retirement-as-the-ceo-of-goodwill-industries-of-central-illinois"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "Mr. THOMPSON of Pennsylvania. Mr. Speaker, I rise today to recognize  Kendra Aucker, president and CEO of the WellSpan Evangelical Community  Hospital in Lewisburg, Pennsylvania. Kendra retired earlier this month  after 30 years of dedicated service.\n\nKendra began her…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698973/congratulating-kendra-aucker"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…homes have been built.  He created the Commission on Crime & Violence in 2018 to help decrease  crime.\n\nA graduate of Southern Union State Community College, Fuller was  President and CEO of Fuller Broadcasting Company, Inc. from 1985 until  1998. His six stations (WKKR, WMXA, WZMG, WTLM, WCJM and WPLV) received  numerous awards for community service and…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696582/recognizing-the-retirement-of-mayor-gary-fuller"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "Mr. SMUCKER. Mr. Speaker, I am pleased to honor and congratulate Mr.  Larry Richardson on his retirement as President and CEO of YMCA of the  Roses.\n\nPrior to his time with the YMCA, Mr. Larry Richardson was an educator  and football coach. He joined the York YMCA in 1994 during a difficult…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692512/congratulating-ymca-of-the-roses-ceo-and-president-larry-richardson-on-his-retirement"}, {"senator": "Randy Feenstra", "party": "Republican", "sentence": "…Houston, on his retirement from Principal Financial  Group after 41 years of service.\n\nFrom starting his first job with Principal in 1984 to eventually  becoming chairman, president, and CEO, Dan exemplifies the power of  hard work and dedication. His decisions have helped more families  achieve financial security and plan for tomorrow.\n\nDan has also committed…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694878/congratulating-dan-houston"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "…defund it because the culture within that entity  is impossibly corrupt. We must end it. Please support my amendment.\n\nMr. LEE. Mr. President, the fact that the acting president and CEO is  a DOGE individual doesn't disqualify him from making this statement. It  is corruption. Sure, it has been going on since the eighties, but so  have a lot of things…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699442/consolidated-appropriations-act-2026"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Matt Hanley on his well-deserved recognition as one of Georgia Trend  Magazine's 100 Most Influential Georgians for 2026.\n\nIn just under a year since assuming the role of president and CEO of  Northeast Georgia Health System, Dr. Hanley has demonstrated  exceptional vision and a relentless pursuit of excellence.\n\nDr. Hanley's seamless transition to leadership…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700076/recognizing-dr-matt-hanley"}]