[{"senator": "Al Green", "party": "Democrat", "sentence": "…address both. Let's start with the genesis of what  occurred last night, and that genesis is a meme in some worlds, but it  was actually something that AI concocted. It had President Obama and  First Lady Michelle Obama being represented as apes, portrayed as apes.\n\nI find this unacceptable, and a good many people of good will found  it unacceptable, as…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700250/peaceful-silent-protest"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…friend and, for that matter,  so is Mr. Newhouse, though I don't know him quite as well.\n\nI think this motion is a serious mistake. I sat here in this House  the night that President Obama made his state of the Union speech, and    Joe Wilson from South Carolina jumped up and said: ``You lie.''\n\nNothing was done about that.\n\nMr. Green engaged in conduct…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688501/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…served in the White House, when it  comes to actually lifting up the people who we are entrusted to  represent. That is what great leaders do, leaders like FDR, President  Johnson, President Obama, and so many others. That is what the track  record says.\n\nThe American people in this country deserve real leadership. What we  have seen from complete Republican…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…obey the requirements of good  membership in the WTO and not manipulate their currencies. That is not  what President Bush was about.\n\nThen, it went up, of course, during President Obama, down during the  first Trump Presidency, and up during the Biden Presidency. Now, of  course, it is trending downward again in the Trump Presidency, so this  is not a…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695605/devastating-harm-caused-by-trump-administration"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…are the watchdogs. They have records of eliminating  waste, fraud, and abuse.\n\nExhibit A is Michael Missal, the inspector general of the VA, hired  and appointed first by President Obama. He served under President Trump  for 4 years and then under President Biden. He has ruffled feathers of  Republican and Democrat administrations because he has uncovered…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688443/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…had no choice--no choice whatsoever than to make that clear. So we went  in and engaged in that battle for one of the longest wars in our  history.\n\nEventually, under President Obama, we found Osama bin Laden and  removed him from this Earth and many of his followers as well. But we  paid a price as well.\n\nThe men and women of the United States stood…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693450/temporary-protected-status"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…on his own.\n\nI will finish where I started. This is not about dissatisfaction with  President Trump. I filed similar resolutions, as my colleague from  Idaho knows, when President Obama was President. I came into the Senate  in 2013 with an absolute obsession because of the military nature of my  State, because one of my kids is a marine--with an absolute…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696123/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…between artists,  musicians, writers, filmmakers, scientists, and students. We can  nurture understanding, build relationships, foster trust, and diplomacy  will follow.\n\nPresident Obama understood this. He knew that insanity was doing the  same thing over and over and expecting different results, so he  loosened restrictions, relieved tensions, and advanced…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692909/do-not-forget-the-crisis-in-cuba"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…indication of what this freeze in funding  means. Take a look at the numbers for funding for competitive grants  and medical research: President Biden, first term President Trump,  President Obama, and now down at the bottom, President Trump in his  current term.\n\nWe need people to speak up in Congress, in the Senate, in the House,  Democrats and Republicans.…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690656/national-institutes-of-health"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…week, before the Christmas recess, we would have a debate and a  vote on extending health insurance.\n\nWhy are we doing this? Because the Affordable Care Act passed under  President Obama provides tax credits, help in premium payments, for  millions of Americans who could otherwise not afford to have it. And  the decision in the Big Beautiful Bill--the…", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697576/department-of-defense"}, {"senator": "Robin Kelly", "party": "Democrat", "sentence": "…daughter's name is Hadiya Pendleton. Hadiya was a bright student  involved in marching band and volleyball. She was on top of the world  when she led her marching band in President Obama's second  inauguration. Just one week later, she was shot and killed in a park  in Chicago.\n\nHadiya should have turned 28 years old yesterday. Hadiya's friends  and family…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691753/national-gun-violence-awareness-month"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…to close?\n\nMr. Speaker, I just want to say, the virtue signaling we are seeing  from Republicans right now is insane. I am sorry. Who was it who  yelled: ``You lie'' at President Obama during his address? A  Republican.\n\nWho was it who heckled President Biden, standing up and ranting like  lunatics? It was Republicans.\n\nGo back and look at the videos.…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688503/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "…history.\n\nLet's be clear about what is happening. We are living through a  reverse Robin Hood story in America.\n\nIt hasn't always been this way. Because of the work of President  Obama, President Biden, and Democrats in Congress, the Black uninsured  rate fell to historic lows last year. That is right. We went from 20  percent of Black Americans being…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696766/stories-from-home-the-human-cost-of-expiring-healthcare-tax-credits"}, {"senator": "Richard Neal", "party": "Democrat", "sentence": "…We don't get to buy life insurance  after we die.\n\nThe idea of what we did here was to spread the notion of risk, an  entirely reasonable consequence, authored by former President Obama  and, by the way, the steadfast determination at the time of Speaker  Pelosi.\n\nThis was negotiated across the board with all members of the  healthcare system, and we…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698788/breaking-the-gridlock-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…States Code.\n\n(4) DACA.--The term ``DACA'' means deferred action granted       to an alien pursuant to the Deferred Action for Childhood       Arrivals program announced by President Obama on June 15,       2012.\n\n(5) Disability.--The term ``disability'' has the meaning       given such term in section 3(1) of the Americans with       Disabilities Act of…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697541/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…thank the chairman for the time.\n\nMr. Speaker, it is interesting to me that our friends across the  aisle say that we already have enough oil. It is also interesting that  President Obama, when he--the gentleman from Georgia, Buddy Carter,  mentioned the Keystone pipeline. It would have come into my district in  Texas, 830,000 barrels of oil a day. That…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697030/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…something that unites us. But let's not  forget that Democrats have said Presidents can act without a vote of  Congress. They have said it many times in the past. Recall, when  President Obama struck Libya in 2011, Speaker Nancy Pelosi said  Congress wasn't needed because the strike was ``limited.''\n\nNow that there is a Republican in the White House, what we…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693090/iran"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…Democrats promised Americans lower costs, more choices, and  better care. More than a decade later, too many families are asking a  simple question: What happened?\n\nFormer President Obama, in pushing the ACA, promised that the bill  would lower healthcare premiums by up to $2,500 per family per year,  but since ObamaCare went into effect, premiums have…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698431/republicans-have-delivered-in-2025"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…magnificent act, and the       competence and resolve that it demonstrated will do more to       shore up American power and world peace than all the best       speeches President Obama ever made.\n\nPresident Trump has made it clear to dictators around the world that  if they try their hands at making mischief, there will be consequences.  And I can guarantee…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698578/trump-administration"}, {"senator": "French Hill", "party": "Republican", "sentence": "…and there was no jaw-jaw with the  Georgians, only tanks, in 2008. There was no jaw-jaw, only propaganda,  corruption, and death in Putin's approach to Ukraine during President  Obama's administration.\n\nUnder President Obama, Putin conducted his overt and covert actions  in Ukraine with some 10,000 Ukrainians killed in the fighting,  including 2,000…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695367/greater-sanction-pressure-on-russia"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…war for every use of  force, national security or law enforcement operation against criminal  actors who threaten the United States.\n\nPresident Clinton acted in Kosovo. President Obama acted in Libya.  President Biden even ordered strikes against terrorist leaders. In none  of those cases did Democrats suddenly discover a constitutional crisis.\n\nThe…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698883/successful-operation-to-arrest-nicolas-maduro"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…projects, which they don't. They  just get money.\n\nMr. Chairman, we have seen how the other commissions have gone.  President Trump urged the elimination of many of them, and President  Obama also recommended the elimination. With that level of bipartisan  criticism of existing commissions, I don't see why we need to dig  ourselves even deeper with another…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694950/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…over 700,000 illegal aliens were apprehended at the border  from October through December of 2023 alone. That was more than any  full year during the Obama Presidency when President Obama famously  stated that over 1,000 illegal border crossings a day would be  considered a crisis.\n\nThe Biden-Harris Harris administration frequently allowed in 6,000 a  day.…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690710/outrageous-government-funded-incentives"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…passage, the average cost for  the individual marketplace for health insurance was $215. Not so any  more. It has more than doubled--more than tripled for many people.\n\nPresident Obama said at that time that ``it will cut the cost of the  typical family's premium by about $2,500 a year.''\n\nIt has not been reduced for the typical family by about $2,500…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697814/9999"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "Mr. BEAN of Florida. Mr. Speaker, I rise today to address the  skyrocketing cost of healthcare. When President Obama signed the  Affordable Care Act, he promised affordable coverage for all.\n\nMr. Speaker, 15 years and trillions of dollars later, all we have  gotten is higher costs and…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697139/skyrocketing-cost-of-healthcare"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…W. Bush wasn't comfortable with Gen. Peter Pace. He is a  marine.  I happen to respect him a lot. He said: Hey, I am not comfortable. I am  moving to another Chairman.\n\nPresident Obama fired two very senior, four-star generals inside of 2  years. One was General McChrystal, one of the most seasoned warriors,  you know, in a generation of warfighters,…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690106/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…this failed experiment in ObamaCare that is now proposing 18  percent premium increases in places like the State of Texas this  upcoming year has been a complete failure.\n\nPresident Obama said that if you like your doctor, you can keep your  doctor; he said that if you like your healthcare plan, you can keep  your healthcare plan; and he also said that…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697200/senate-agenda"}, {"senator": "Darrell Issa", "party": "Republican", "sentence": "…and did give away billions more. That is still  something being worked on by this body.\n\nPresidents push the limits of their authority. President Biden  certainly did. President Obama famously said he didn't have the  authority to do things and then did them later and dared the Court to  stop him.\n\nI think we have to come here and realize if we do our…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689711/no-rogue-rulings-act-of-2025"}, {"senator": "James Risch", "party": "Republican", "sentence": "…done.\n\nI myself for a long time have hoped to see our European partners wake  up to the extreme threat that we all face from a nuclear Iran. Today,  we are 10 years on from President Obama's failed nuclear deal with  Iran. Over the last 10 years, Iran has enjoyed unwarranted sanctions  relief, and time is short before the opportunity expires to snap back…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694081/9999"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…cases. But then  it started to rise.\n\nDuring the George W. Bush administration, there were six nationwide  injunctions that were done in these local district courts. Under  President Obama, there were 12 nationwide injunctions that were issued.  Then under President Trump, the first term, there were 64 nationwide  injunctions.\n\nMore and more individual district…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691654/nationwide-injunctions"}]