[{"senator": "Glenn Ivey", "party": "Democrat", "sentence": "President Trump, Elon Musk, and their billionaire buddies have pushed  a budget that is nothing short of a war on working families.", "title": "Trump's First 100 Days", "date": "2025-05-05"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "Speaker, we will not stop fighting as long as President Trump and  Elon Musk and House Republicans are trying to take away our sacred  right to vote.", "title": "Fighting Voter Suppression", "date": "2025-03-31"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "Make no mistake: President Trump, Elon Musk, and congressional  Republicans have no intention of doing anything to lower energy bills  for Americans, and H.J.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the Environmental Protection Agency Relating to ``Waste Emissions Charge for Petroleum and Natural Gas Systems: Procedures for Facilitating Compliance, Including Netting and Exemptions''", "date": "2025-02-26"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "Since taking office, President Trump and Elon Musk unlawfully have  stolen funds appropriated by Congress, passed by Republicans and  Democrats in the House and in the Senate, and signed into law by the  President, upending the separation of powers and our constitutional  order.", "title": "Rescissions Act of 2025", "date": "2025-06-12"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "This bill will make devastating cuts to our communities in exchange  for massive tax breaks for President Trump, Elon Musk, and their  billionaire buddies.", "title": "One Big Beautiful Bill Act", "date": "2025-07-02"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "President Trump, Elon Musk, and their enablers are  gutting critical Federal services that include scientists.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the United States Fish and Wildlife Service Relating to ``Endangered and Threatened Wildlife and Plants; Endangered Species Status for the San Francisco Bay-Delta Distinct Population Segment of the Longfin Smelt''", "date": "2025-05-01"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "Speaker, I rise to share the story of a Federal  scientist who was fired by President Trump and Elon Musk.", "title": "Fired By President Trump", "date": "2025-02-26"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "Speaker, I rise to share the story of a Federal  scientist who, in his own words, was fired by President Trump and Elon  Musk.", "title": "Fired By President Trump", "date": "2025-02-26"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "They did nothing as President Trump and Elon Musk decimated the land  management workforce, shuttered critical buildings, and froze funding  for critical grant programs designed to safeguard and restore our parks  and our public lands.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the National Park Service Relating to ``Glen Canyon National Recreation Area: Motor Vehicles''", "date": "2025-04-29"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "That is exactly what this program was doing before President Trump  and Elon Musk actively decided that it was not worth continuing.", "title": "Education is of Great Importance to Congressional Black Caucus, Congress, and Constituents", "date": "2025-04-07"}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "But with these mass firings of staff at the VA, President  Trump and Elon Musk are breaking that promise.", "title": "Providing for Congressional Disapproval Under Chapter 8 of Title United States Code, of the Rule Submitted By the Internal Revenue Service Relating to ``Gross Proceeds Reporting By Brokers That Regularly Provide Services Effectuating Digital Asset Sales''--", "date": "2025-03-04"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "physicist in Congress, who  spent most of his career in the national laboratories of the Department  of Energy, to share the story of a research engineer at a national lab  who was recently fired without cause by President Trump and Elon Musk.", "title": "Fired By President Trump", "date": "2025-02-26"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "Speaker, I rise today to share the story of a Federal  scientist who was fired by President Trump and Elon Musk.", "title": "Fired By President Trump", "date": "2025-02-26"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "In their efforts to  root out so-called ``government waste,'' President Trump and Elon are  targeting and illegally terminating the Federal workforce, the  employees who make our country run.", "title": "Recognizing Federal Employees", "date": "2025-03-06"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "Speaker, as a policymaker and citizen, I  unconditionally and absolutely reject President Trump's and Elon Musk's  work to steal American's Social Security benefits, a scheme that hurts  middle-class and working-class families and seniors to pay for tax  handouts to billionaires.", "title": "Opposition to President Trump's and Elon Musk's Theft of Social Security to Pay for Handouts to Billionaires", "date": "2025-04-21"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "The Democratic Party is busy pulling their hair out over President  Trump, Elon Musk, DOGE, whatever else is their outrage of the day.", "title": "Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Department of Energy Relating to ``Energy Conservation Program for Appliance Standards: Certification Requirements, Labeling Requirements, and Enforcement Provisions for Certain Consumer Products and Commercial Equipment''; Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Environmental Protection Agency Relating to ``National Emission Standards for Hazardous Air Pollutants: Rubber Tire Manufacturing''; and Providing for Consideration of S.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Bureau of Ocean Energy Management Relating to ``Protection of Marine Archaeological Resources''", "date": "2025-03-04"}]