[{"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…to be paying for that treatment, or we are going to be mandating  that the insurance company pay.''\n\nHere we are, and the Republican Congress is sending a bill to  President Trump's desk that fails to expand coverage for military  families to do just that.\n\nThe brave servicemembers who put their lives on the line for our  country and our freedoms will…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697966/expanding-access-to-ivf-for-military-families"}, {"senator": "Maggie Hassan", "party": "Democrat", "sentence": "…proceed to its immediate consideration.\n\nMs. HASSAN. Mr. President, the Senate just passed a major bipartisan  package to reauthorize the SUPPORT Act, and it is headed to President  Trump's desk. Today is proof that despite our differences, bipartisan  progress is possible.\n\nI am particularly pleased to be here with my colleague and chair of  the HELP Committee…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695792/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…from Independents, but from the MAGA movement.  That is why I am calling on my colleagues, Republicans and Democrats,  to pass the Drain the Swamp Act and send it to President Trump's desk  so that he can fulfill his promise.                 Deprivation of Medicare Telehealth Services\n\nMr. KHANNA. Mr. Speaker, the Trump administration is stripping  millions…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688124/ban-on-acceptance-of-gifts-from-lobbyists"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…Thankfully, we now have new leadership in the White House, strong,  forceful, America-first leadership, and I look forward to sending this  commonsense legislation to President Trump's desk to restore law and  order in our Nation's Capital and support our brave men and women in  blue. Public safety should not be a partisan issue. It is just plain  common…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696932/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…process hasn't been easy by any means,  but it is worth every single debate we are having to get it over the  finish line. If we fail to get this bill passed and on President  Trump's desk, then middle- and working-class families will be the ones  who pay the price.\n\nSome of my Democrat colleagues continue to lie about what our bill  does. Mr. Speaker,…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692936/peace-through-strength"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…franchise of  American democracy, and that is the right to vote.\n\nMr. Speaker, I urge everybody to pass this bill over to the Senate  and then the Senate to get it to President Trump's desk so we can  strengthen American democracy.", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700016/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…missile  defense systems to keep America safe.\n\nThis bill reflects what Americans want: security, prosperity, and  leadership. The Senate needs to act. Let's get this to President  Trump's desk and deliver real results for the American people.", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691982/recognizing-southern-virginia-universitys-ncaa-division-iii-mens-volleyball-national-championship-victory"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…relief, secure our borders, and ensure American energy dominance.\n\nThis legislation will make the life of the average American better,  and I support getting it to President Trump's desk.\n\nMr. Speaker, I urge all my colleagues to do the same.\n\nMr. SMITH of Missouri. Mr. Speaker, I represent one of the poorest  congressional districts in this country.…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693189/one-big-beautiful-bill-act"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…601, and Senator McConnell for being an original cosponsor of that  legislation. I look forward to working with them to get this bill  across the finish line and onto President Trump's desk.\n\nI also thank Chairman Westerman for his support and I urge passage of  H.R. 1276.", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697652/removing-restrictions-from-a-parcel-of-land-in-paducah-kentucky"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…prescription that will help heal our country and get us back on  track is the beautiful reconciliation bill that Republicans have been  working on diligently to get to President Trump's desk. It cannot be  overstated. Our debt crisis is out of control.\n\nWhen I was first sworn into office in 2010, our Federal Government  had $9 trillion of debt. When I left…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690786/big-beautiful-bill"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…their position in front of the American people. They must  use every tool at their disposal, including the talking filibuster, to  ensure that this bill makes it to the President Trump's desk.\n\nMr. Speaker, we cannot delay securing our elections and defending our  Republic.\n\nMr. STEIL.  Hageman).\n\nMr. STEIL. Mr. Speaker, may I inquire as to how much time…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700014/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…what was once a reality is fast becoming just that, a dream.  The American people are looking to Congress for a solution. Let's give  them one by getting this bill to President Trump's desk as soon as  possible.", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699815/lowering-housing-costs-and-advancing-main-street-community-banks"}, {"senator": "Tom Emmer", "party": "Republican", "sentence": "…all those who left.\n\nThis is not a perfect bill, but it is a perfect bill for this moment.  Congress must keep its eyes on the finish line and send the GENIUS Act  to President Trump's desk this week.\n\nBottom line: The GENIUS Act is a proinnovation, profreedom, and  progrowth piece of legislation. It is a bipartisan solution to a global  challenge, empowering…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693844/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…raised the  loan limit for American manufacturers under the SBA's 7(a) and 504 loan  programs to $10 million. I hope it will quickly move through the Senate  and to President Trump's desk.\n\nMadam Speaker, H.R. 5788 marks a critical step toward identifying and  mitigating risks early, strengthening the long-term viability and  affordability of the 504…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699188/504-program-risk-oversight-act"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…overwhelmingly supports this legislation, and it is  our duty to adhere to the will of the people by swiftly passing this  bill and sending the SAVE America Act to President Trump's desk for  signature.\n\nMr. Speaker, you know me to be a data-oriented individual, so let us  review the numbers before us as we debate this legislation.\n\nMr. Speaker, 83…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699936/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "…mandate we received from the American  people last November. We already have a number of accomplishments on  the list.\n\nWe got started by sending the Laken Riley Act to President Trump's  desk during his first week in office to keep criminal illegal  immigrants off our streets.\n\nPresident Trump signed the HALT Fentanyl Act last Wednesday, which  permanently…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693870/trump-administration"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…the bill in the Senate.\n\nThe House is taking all necessary steps to enable the One Big  Beautiful Bill Act to be considered expeditiously in the Senate and  sent to President Trump's desk under the reconciliation process, which  is what this engrossment resolution does.\n\nMr. Speaker, I will also remind the ranking member and my Democrat  colleagues that…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692391/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…the past 2 years has laid that  foundation for the progress made in both the House and the Senate.\n\nToday, we have an opportunity to send stablecoin legislation to  President Trump's desk. This is a multi-Congress priority item, and it  ensures American competitiveness and strong guardrails for our  consumers. We should not, Mr. Speaker, squander that…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693834/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}]