[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…the power was given to Congress,  to this legislative body. Let's use that power. Let's reassert our  authority. Let's say through this resolution that if the President or  the administration wants to go to war for the purpose of regime change  or any other purpose, that it must come to Congress and make the case  to us and to the American people.…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696564/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…Imposts and Excises.'' In other words, this is our job.  It is not always pretty, but Congress can provide stability and  certainty on trade that last beyond a single President's  administration.\n\nThis body has already signaled bipartisan support for reversing  pointless tariffs. We did that when we passed Senator Kaine's bill to  end the tariffs on Canada.…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690532/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…border is secure, and that is a good thing.  Migrant crossings into the United States from Mexico are at their  lowest level since 1970.\n\nIn August of 2024, during President Biden's administration, there  were 107,000 encounters at the southern border, but in August of 2025,  there were only 9,000. The border is much more secure. I support that.  We must…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700023/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…rebuild. County executives across the State, like me at the time, sent  our resources and our first responders to help with rescue efforts. We  are so grateful we had a President and administration willing to help.\n\nTeam Maryland is just that--a team. We have always been, and we  always will be. That is how you get through moments of crisis-- together. And…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689022/9999"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…real dollars for families and jobs, nearly $900  million in annual economic activity and 8,000 jobs by the latest count.\n\nApparently, this does not matter to the President and his  administration. Unemployment has been rising.\n\nLet's be honest. DRP does not mean Deferred Resignation Program. It  means destroy, ruin, and punish.\n\nMadam Speaker, stop this…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698300/in-support-of-marad"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…Black Caucus can't do it  alone. We need 218 people in the House and 60 in the Senate who are  willing to do something more than thoughts and prayers.  We need a President and an administration that says enough is enough.\n\nIf you don't want to do anything to actually take the guns off the  street, then at least invest in the root causes of violence because…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691754/national-gun-violence-awareness-month"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…chaos and missteps of this administration  are too painful or upsetting to follow. They have tuned it out because  the only guarantee we have is that every day the President or his  administration will have done something dumber or more dangerous than  the day before.\n\nEach day brings its own self-inflicted crisis with this White House,  and millions of…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690745/providing-for-consideration-of-hr-gulf-of-america-act-and-providing-for-consideration-of-hr-dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Judiciary Committee. Justice Jackson's story is one  of breaking barriers and paving the way for future women of color to  follow in her footsteps.\n\nAt a time when the President and his administration are challenging  the rule of law in our country as never before, Justice Jackson's  presence on the highest Court in the land could not be more important.\n\nI am…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689666/justice-ketanji-brown-jackson"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…in court that  the official head of DOGE was unknown to them.\n\nSince that time, a nominal administrator has been named, despite the  repeated avowals from the President and his administration that Mr.  Musk controls and directs DOGE, as confirmed by ample public reporting  and Mr. Musk's own statements.\n\nDonald John Trump has abused the powers of his…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691079/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Rob Menendez", "party": "Democrat", "sentence": "…is safe in Trump's America. Mothers, Capitol Police officers, our  neighbors, Members of Congress, no one, not a single person should feel  safe with him as our President.\n\nThis administration's extreme agenda does not reflect the best of who  we are as a country but, instead, seeks to turn us against each other.  We cannot allow that to happen.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698775/holding-ice-accountable"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…today getting a classified briefing on what  happened in the unauthorized invasion of Venezuela by this  administration and the capture of a foreign leader, as our President  and his administration are threatening to invade other foreign  countries and have failed the most basic constitutional duty of seeking  the consent of Congress and advising Members…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698563/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…chaotic; it has been disorganized; it  has been an unmitigated disaster. Quite frankly--and I know that I am  not alone in this--we are absolutely sick of it.\n\nThis President and this administration rode in with promises of  reducing costs for American families--families like the family I grew  up in, with a father who worked through the night and into the…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690300/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…faith  everywhere.\n\nI rise today to specifically condemn the discrimination our Muslim  and Arab American communities are facing because, unfortunately, this  President and his administration have openly stoked and  institutionalized Islamophobic discrimination.\n\nWe all recall, on November 26, we saw a horrific attack on two  members of the West Virginia…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698866/commerce-justice-science-energy-and-water-development-and-interior"}, {"senator": "Steven Horsford", "party": "Democrat", "sentence": "Mr. HORSFORD. Mr. Speaker, despite repeatedly claiming to be the most  pro-worker President and administration in history, since taking  office, President Trump took action earlier this year that stripped  collective bargaining rights from nearly 1 million Federal employees.…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697986/protect-americas-workforce-act"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…Foundation has kept the U.S. at  the forefront of science and has made us the envy of the world.\n\nThe NSF can claim 268 Nobel Prize winners. Yet now we have a  President and an administration that is antiscience and antiprogress.\n\nJust as we have made investments in projects that are pivotal in  artificial intelligence, quantum, and other leading areas…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691389/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…actually go and create more revenue for our  Nation to become a wealthier nation. This is a priority for  Republicans. It is a priority for House GOP leadership, the President,  his administration, and we are neck deep in the process of getting this  over the finish line.\n\nThis bill will deliver on our conservative agenda and make positive  changes that we…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690787/big-beautiful-bill"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…impugn the character of the President  of the United States and other members of the administration in  connection to an investigation of Jeffrey Epstein, which the  President's administration in 2019 indicted Epstein. They actually  moved forward and federally indicted him in 2019. Ghislaine Maxwell was  arrested by the Trump administration.\n\nI know the…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696887/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…who have come into the country illegally, committed  crimes, and make sure they are expelled. That makes America safer and  better and more secure.\n\nI thank the President and his administration for doing that. I think  we should rally around them and show our support for what they have  done by passing this legislation.\n\nMr. Speaker, I urge my colleagues…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699354/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…important. However, the House bill had core components of  tax-cut extensions for hardworking Americans. The House bill had core  components to give resources to the President, the administration, Tom  Homan, Stephen Miller, and Secretary Noem to secure the border, and,  importantly, to remove people through ICE and enforcement.\n\nThe House bill had core…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693110/tax-cuts-and-spending"}, {"senator": "Rick Crawford", "party": "Republican", "sentence": "…conducted one  of the most daring operations in American history? Not to me. Not to  any American who reads or hears them.\n\nInstead, they seem to revel in demeaning a President whose  administration just accomplished what the Democrats have never been  able to do; that is, executing Maduro's demise.\n\nDespite a long, laundry list of Democratic bills and resolutions…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698882/successful-operation-to-arrest-nicolas-maduro"}, {"senator": "John Thune", "party": "Republican", "sentence": "…nor is this going to prevent  the President's nominees from getting confirmed. Democrats can drag out  nominations all they want, but we are going to fill out the President's  administration and ensure that his nominees get into place so that they  can do their job and that he can do the job that he was elected to do.\n\nI would like to do this the easy…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690974/business-before-the-senate"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…became Americans that day, some of them  underwent a multiyear-long process to come here legally. Instead of  rewarding their efforts, they watched for 4 years as a President and an  administration that were asleep at the wheel allowed our immigration  laws to be abused and taken advantage of month after month as millions  jumped the line by coming here illegally.…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694111/americas-borders-are-safer"}]