[{"senator": "Al Green", "party": "Democrat", "sentence": "…I don't see it.\n\nWhen we have a judiciary that can't seem to control the President  because of some theory associated with a unitary Presidency, meaning  that the President has the authority to just fire and hire anybody who  he wants--we will find out whether he can do that with the Fed soon-- but when you have that and then you have a Congress who…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694943/bloody-sunday-and-voting-rights-act"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…upheld by the Supreme Court for 90 years,  holding that Congress's power ``cannot well be doubted.'' While the  Supreme Court recently struck down restrictions on the President's  authority to remove Agencies led by a single individual, the Supreme  Court declined to revisit precedent about independent Agencies run by  bipartisan, multimember commissions,…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1689985/confirmation-of-mark-meador"}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "…intent on expanding it.\n\nHe has already threatened land strikes against Venezuela, with  seemingly no concern over the fact that only Congress--this body, not  the President--has the authority to declare war.\n\nWe are the ones tasked with deciding when and how we send our troops  into combat. We are the ones the Constitution charged with that most  solemn…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696554/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…to an unconfirmed       nuclear attack;\n\n* Reducing the number of deployed nuclear weapons; and\n\n* Renouncing first use of nuclear weapons and eliminating       the President's authority to launch nuclear weapons without       congressional approval.\n\nSince the 1980s, thanks to negotiators in both countries, the United  States and Russia curtailed an…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699676/the-new-start-treaty"}, {"senator": "Suzan DelBene", "party": "Democrat", "sentence": "…then vote for it, but stop hiding. We are not elected to dodge  important issues just because we are afraid of the President. The  Constitution gives Congress, not the President, authority over trade  policy.\n\nI am grateful for my colleagues who have been fighting with me  against these tariffs since the beginning. I hope that more of them  will find the…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699902/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…sense. This is a roadmap for what the Trump administration  plans to do unless the Federal courts prevent them from proceeding.\n\nTheir expansive and limitless view of the President's authority knows  no bounds. If DOGE wants to cut entire agencies, eliminate programs,  and impound funds, they will do it regardless of the law. The Trump  administration is…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691876/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…lifesavers, literally,  for the people of Connecticut and, I am sure, for others all around  America.\n\nThey are vital to our defense when they are deployed abroad under the  President's authority to use them abroad against our enemies, as they  are now deployed from Connecticut and elsewhere all around the globe.\n\nBut we need to stem the tide of Executive overreach.…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696297/9999"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…carry out  the purposes of this bill, is undermined by the fact that Donald Trump  is examining withdrawing us from the IMF. Setting aside the central  point that the President has no authority whatsoever to withdraw the  United States from international financial institutions, that review,  which is due in August, has not been completed.\n\nWhile the IMF…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692795/taiwan-non-discrimination-act-of-2025"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…Resolution would immediately end  President Trump's extrajudicial boat strikes in the Western Hemisphere,  which have never been approved by Congress and far exceed the  President's authority.\n\nWe are a country of laws. Individuals in the streets have to abide by  our laws. The President of the United States should be abiding by our  laws.\n\nIn our laws,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698248/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…as they emerged, and that is where we begin.  These are dollars that Congress has appropriated, but the precise  mechanism for the transfer of these moneys and the President's  authority to both spend the money and carry out the deportations is  questionable.\n\nThe U.S. Supreme Court, in the case of one of these individuals who  it admits was deported…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691406/motion-to-discharge-s-res-195"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…am bringing out is not about that  legislation. It is about constitutional limits on Presidential power.  No act of Congress--the SAVE Act or otherwise--would give a President  authority to seize control of State-run elections. That power does not  exist; it cannot be created; and it cannot be exercised by Executive  fiat.\n\nSo let us not confuse the…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700022/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…process is carefully designed       to ensure that the over 700,000 residents of our city have a       voice in judicial appointments, while also respecting the       President's authority in nominating individuals for the       critical role of judicial service in the District of       Columbia. We stand in support of the JNC's current role and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695614/district-of-columbia-judicial-nominations-reform-act"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…quickly  to a possible nuclear attack; reducing the number of deployed nuclear  weapons; and renouncing first use of nuclear weapons and restricting or  eliminating a President's authority to launch a nuclear weapon without  congressional approval.\n\nMr. President, since the 1980s, thanks to negotiators in both  countries, the United States and Russia…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694014/new-start-treaty"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…dissembling.\n\nNo reasonable person denies the authority of the President to strike  a terrorist threat on foreign soil. Yet the Democrats are here tonight  questioning the President's authority to do the exact same thing in our  own backyard--in international waters, no less; not even foreign  territory. This is a dangerous double standard.\n\nTherefore, I encourage…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696118/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Richard McCormick", "party": "Republican", "sentence": "…telegraphs weakness to a hostile regime like Venezuela and  encourages them to test U.S. resolve.\n\nThis is not a distant theater. This is our hemisphere. Supporting the  President's authority is not a blank check for war. It is a  recommendation that timely, flexible military posturing is what  prevents war, and in this case protects Americans against the…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698454/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…and the authority of the Commander in Chief. It is legislative  sabotage, and we shouldn't give in to that.\n\nThe Civil Service Reform Act of 1978 explicitly gives the President  authority to exclude agencies from collective bargaining when national  security is at stake. This would undo that.\n\nPresidents from Carter to Reagan to Trump have exercised this…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697990/protect-americas-workforce-act"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "Mr. PAUL. Mr. President, the Constitution is clear: Congress, not the  President, has the authority to declare war. The Founders were  unanimous in proclaiming that the power to declare war belonged  exclusively to Congress.\n\nJames Madison, the father of the Constitution,…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693121/motion-to-discharge-sj-res-59"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…This legislation aligns with the appointment of D.C. judges with the  constitutional process for appointing members of the Federal judiciary.  This bill preserves the President's authority to nominate, with the  advice and consent of the U.S. Senate, anyone deemed appropriate to sit  on the D.C. court.\n\nThe current system, where the President is restricted…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695615/district-of-columbia-judicial-nominations-reform-act"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…They have military  capabilities and use them every day against the American homeland. When  a threat poses immediate danger to Americans, the Constitution gives  the President the authority to act.\n\nMr. MAST. Mr. Speaker, I would let the ranking member know that, just  in the last year in his district, he has lost at least 140 people to  overdose, which…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698249/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…2025,  would ensure this catastrophic policy decision is never made again by  removing DOE from the statutory authorization process.\n\nThis legislation maintains the President's authority to impose  sanctions on foreign governments, prohibiting imports or exports, if  justified. Free trade, open markets, and competitions have resulted in  the U.S. emerging…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697089/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…jurisdiction of the United States by  obeying its immigration laws and who had taken up legal, permanent  residence subject to a treaty ratified by the Senate.\n\nDoes the President have the authority by executive order to clear up  this matter as part of his organic constitutional responsibility to  take care that the laws be faithfully executed? I don't know.…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688130/birthright-citizenship"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…straight number.\n\nWe are still vetting the number because we are doing predictions. All  of this could mean nothing if the Supreme Court tomorrow changes its  rules on the President's authority to  do the enhanced tariffs--let's just call them that--and whatever  authorities the President may have to supplement those tariffs.\n\nWe have to understand our latest…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698698/congress-is-a-math-free-zone"}, {"senator": "Ron Johnson", "party": "Republican", "sentence": "…immediately with the  Senator from Delaware and the Senator from Michigan. Within those  talks--again, 2 weeks ago--they were accusing my bill of giving the  President all this additional authority. In discussions staff to staff,  they admitted there is no additional authority I am giving to the  President in this bill whatsoever.\n\nThis bill is completely…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696605/9999"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…really  don't understand why President Trump seems so intent on harming one of  his signature accomplishments, the USMCA.\n\nI am disappointed because Congress gave the President authority to  impose tariffs in the event of a national security crisis. Congress did  not grant this power to pursue petty grudges against trusted neighbors.\n\nHonestly, how can…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688254/unanimous-consent-request-s-348"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…the President was taking over the State's  law enforcement authority, the Ninth Circuit said otherwise  unanimously. Even a Biden-appointed judge said: The President was  exercising his authority to prevent the disruption of the enforcement  of Federal law.\n\nAs to this notion that the violence was largely confined to downtown  L.A., I can't agree with…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693143/condemning-the-violent-june-2025-riots-in-los-angeles-california"}]