[{"senator": "Pat Fallon", "party": "Republican", "sentence": "Mr. FALLON. Mr. Speaker, I rise today to recognize Mr. Mark Metdker  of Celina, Texas, and present him with the Congressional Patriot Award.  Mark has dedicated himself to faithfully serving our community.\n\nA native of Dallas, Mark graduated from Lewisville High School in  1975 as a…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690240/recognizing-congressional-patriot-award-recipient-mark-metdker"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "Mr. FALLON. Mr. Speaker, I rise today to recognize Mr. Mark Kipphut  of McLendon-Chisholm, Texas, and present him with the Congressional  Patriot Award. Mark has dedicated himself to faithfully serving our  community and country.\n\nAfter graduating from The Citadel with a political science degree…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696968/recognizing-congressional-patriot-award-recipient-mark-kipphut"}, {"senator": "John Carter", "party": "Republican", "sentence": "Mr. CARTER of Texas. Mr. Speaker, it is my privilege to present a  Congressional Veteran Commendation to Lieutenant Colonel Barbara  MacMillan, U.S. Army, Retired. Her life and career reflect hard work,  selfless service, and dedication to her…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689338/9999"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "Mr. FALLON. Mr. Speaker, I rise today to recognize Mrs. Elizabeth  ``Beth'' Terrell of Burr Ridge, Illinois, and present her with the  Congressional Patriot Award. Beth has dedicated herself to faithfully  serving our community and country.\n\nA native of Lake Forest, Illinois, Beth attended Saint Mary's College…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694169/recognizing-congressional-patriot-award-recipient-beth-terrell"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "Mr. FALLON. Mr. Speaker, I rise today to recognize and celebrate Mr.  Steve Ledwell of Texarkana, Texas, and to present him with the  Congressional Patriot Award. Steve has dedicated his life to faithfully  serving his community and country.\n\nBorn and raised in Texarkana, Steve has spent his life building…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696827/recognizing-congressional-patriot-award-recipient-steve-ledwell"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "Mr. FALLON. Mr. Speaker, I rise today to recognize Dr. Walter Eugene  Hunter of Celina, Texas, and present him with the Congressional Patriot  Award. Walter has dedicated himself to faithfully serving our community  and country.\n\nAs a young man, Walter was a decorated Boy Scout and Cub Scout…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690722/recognizing-congressional-patriot-award-recipient-walter-hunter"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "Mr. FALLON. Mr. Speaker, I rise today to recognize and celebrate Mr.  Dennis Lewis of Texarkana, Texas, and to present him with the  Congressional Patriot Award. Dennis has dedicated his life to  faithfully serving his community and country.\n\nBorn in Texarkana, Texas, Dennis attended Maud High School,…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696848/recognizing-congressional-patriot-award-recipient-dennis-lewis"}, {"senator": "John Carter", "party": "Republican", "sentence": "…Sergeant Major Angela Wilson, U.S.  Army, Retired. Throughout her life, she has dedicated herself to her  country, fellow heroes, and neighbors. I am proud to present her with  the Congressional Veteran Commendation.\n\nCSM Wilson's 30 years of service in the U.S. Army exemplify strength,  compassion, and duty. CSM Wilson was and continues to be a trailblazer.…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689348/saluting-the-service-of-command-sergeant-major-angela-wilson"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "Mr. FALLON. Mr. Speaker, I rise today to recognize Mr. Thomas McCall  of Frisco, Texas, and present him with the Congressional Patriot Award.  He has served and uplifted our community through his leadership and  dedication.\n\nTom was born and raised in Yonkers, New York. Due to life hardships,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695482/recognizing-congressional-patriot-award-recipient-thomas-mccall"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "Mr. FALLON. Mr. Speaker, I rise today to recognize Mr. Corbett Howard  of Celina, Texas, and present him with the Congressional Patriot Award.  Corbett has dedicated himself to faithfully serving our community.\n\nCorbett was born in Roswell, New Mexico. He received his Bachelor of  Arts…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690167/recognizing-congressional-patriot-award-recipient-corbett-howard"}, {"senator": "John Carter", "party": "Republican", "sentence": "Mr. CARTER of Texas. Mr. Speaker, it is my privilege to present a  Congressional Veterans Commendation to Lieutenant Brian M. Frick, U.S.  Navy, for his exemplary service. His unwavering commitment to our  Nation and his efforts to improve his…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689331/saluting-the-service-of-lieutenant-brian-m-frick"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "Mr. FALLON. Mr. Speaker, I rise today to recognize Mr. Sean Michael  Terry of Pilot Point, Texas, and present him with the Congressional  Patriot Award. Sean has dedicated himself to faithfully serving our  community.\n\nA native of Gunter, Sean earned his bachelor's degree in Agricultural  Economics…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690277/recognizing-congressional-patriot-award-recipient-sean-michael-terry"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "Mr. FALLON. Mr. Speaker, I rise today to recognize Ms. Catherine  ``Trinka'' Taylor of Dallas, Texas and present her with the  Congressional Patriot Award. Trinka has dedicated herself to faithfully  serving our community.\n\nA sixth-generation Texan, Trinka was born in Dallas, Texas, and grew  up in…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690291/recognizing-congressional-patriot-award-recipient-catherine-trinka-taylor"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "Mr. FALLON. Mr. Speaker, I rise today to recognize Pastor lsiah  Moore, Jr., of Celina, Texas, and present him with the Congressional  Patriot Award. Pastor Moore has dedicated himself to faithfully serving  our community and country.\n\nBorn in Shreveport, Louisiana, Pastor Moore attended Booker…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690155/recognizing-congressional-patriot-award-recipient-pastor-isiah-moore-jr"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "Mr. FALLON. Mr. Speaker, I rise today to recognize Mrs. Kay Akin of  Decatur, Texas, and present her with the Congressional Patriot Award.  Kay has dedicated herself to faithfully serving our community.\n\nKay is originally from Brownwood, Texas, and she earned her  bachelor's degree…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690286/recognizing-congressional-patriot-award-recipient-kay-akin"}]