[{"senator": "Tim Kaine", "party": "Democrat", "sentence": "…the Venezuelan oil  economy.\n\nAnd it is all being done with the active participation of the U.S.  military. The U.S. military assets in place around Venezuela are, as  President Trump said, an armada, 16,000 U.S. personnel. This is open  source reporting as of 2 days ago, arrayed around Venezuela:\n\nThe USS Gerald R. Ford Carrier Strike Group: Carrier Air…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699109/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…to do that because I don't  think this should be sanitized.\n\nLater in his first term at a meeting with top Cabinet officials and  the White House staff and Senators, President Trump said:\n\nWhy do we want all these people from shithole countries       coming here?\n\nNow at the time when that was revealed, the President denied it, said  he had not used…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699611/9999"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…President Trump may even be leaving the  country this weekend. He is leaving for a week as opposed to bringing  people together?\n\nI am reminded, Senator Merkley, that President Trump said not too  long ago in an interview: If there is a shutdown, it is up to the  President to bring people together to prevent the shutdown.\n\nI think, in that same interview,…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696347/trump-administration"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…manipulatable, will more service our interest than the  predecessor, and yet all the corruption of that authoritarian  government, all of the repression left fully in place.\n\nPresident Trump said:\n\nIf she doesn't do what's right, she is going to pay a very       big price, probably bigger than Maduro.\n\nLeave the dictatorship in place. Put a person in charge we…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698617/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "…This is the moment to defend our economy, to defend our Constitution,  and to defend our freedoms and elections.\n\nMadam Speaker, let me close with this. Last week, President Trump  said: I have the right to do anything I want to do. I am the President  of the United States.\n\nHe said it and laid it on the table in plain sight for all of us to  see.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694808/northeast-ohioans-are-getting-squeezed"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "Mr. WELCH. Mr. President, on February 13, President Trump said  something that few expected to hear. He said:\n\nThere's no reason for us to be building brand-new nuclear       weapons. We already have so many. You could destroy the…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694014/new-start-treaty"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…didn't take on words of hate. We have got  to appeal to colleagues of good conscience, not to let--as this person  says, no Medicaid cuts; no Medicaid cuts.\n\nI know President Trump has said that Medicaid cuts are off the table.  He said that over and over and over again. We will see. We will see.\n\nModern Medicaid Alliance:\n\nWith over 70 million children,…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…Connecticut high school students.\n\nThese two remarkable stories are just two examples of the  extraordinary impact that DACA recipients have on our community.\n\nLast December, President Trump said:\n\nWe have to do something about the Dreamers.\n\nHe said:\n\nWe have to do something about the Dreamers. Republicans are       very open to Dreamers.\n\nI call on the administration…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692242/daca"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "Mr. WELCH. Mr. President, on February 13, 2025, President Trump said  something few expected to hear. He said, ``There's no reason for us to  be building brand-new nuclear weapons. We already have so many. . . You  could destroy the world…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699676/the-new-start-treaty"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…Sunday:\n\nThere is no starvation in Gaza.\n\nLet me be clear. That is a lie. The world knows it is a lie. We know  that it is a lie. Donald Trump knows that it is a lie. President Trump  said on Monday:\n\nSome of those kids--that's real starvation stuff, I see it,       and you can't fake that.\n\nThe use of food and water and medicine as a weapon of war against…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694437/providing-for-congressional-disapproval-of-the-proposed-export-of"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…in his second term negotiated the INF Treaty with  the Soviets. He spoke privately with Gorbachev about the elimination of  all nuclear weapons.\n\nEarlier this year, President Trump said from the Oval Office: ``There  is no reason for us to be building brand-new nuclear weapons, we  already have so many. You could destroy the world 50 times over, 100…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694117/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…issued a blanket pardon  and 14 commutations to all of those who had been charged or convicted  for their involvement in the attack on the Capitol.\n\nAnd listen to what President Trump said about his pardons at a recent  press conference ``I pardoned people who were assaulted themselves.  They were assaulted by our government . . . They didn't assault.…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688828/january-6-pardons"}, {"senator": "Jim Costa", "party": "Democrat", "sentence": "…gas, and healthcare. They are drowning  under rising costs while promises to lower the cost of living have  remained unfulfilled by this administration.\n\nOn day one, President Trump said he would put America first and lower  costs. Instead, he pardoned violent insurrectionists, a mob that  attacked this Capitol to overthrow a fair and free election.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698830/putting-americans-first"}, {"senator": "Jared Golden", "party": "Democrat", "sentence": "…Republicans who recognize that collective bargaining is  not a partisan issue. It is about fairness, dignity on the job, and a  voice in the workplace.\n\nIn his order, President Trump said ending collective bargaining was  about protecting our national defense, but in my district and many  others, affected workers build our warships and care for our veterans.…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697864/providing-for-consideration-of-hr-2550-to-nullify-the-executive-order-relating-to-exclusions-from-federal-labor-management-relations-programs-and-for-other-purposes"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…for ethnic minorities.\n\nWhy aren't House Republicans denouncing these dictators when we, as  Congress, can actually do something to stop it? It is probably because  President Trump has said he thinks Putin has done ``a great job,'' and  is ``a genius,'' or maybe because he thinks President Xi ``is really a  friend of mine.''\n\nIn line with these other…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697150/denouncing-the-horrors-of-socialism"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…actually put it on paper.\n\nMy economists did a model over the next 10 years with what is  happening demographically in America. We have a shortage of young  people. President Trump said something that was brilliant on the  campaign trail. He said: It is insane we educate people, then we send  them home with their degrees from the American universities…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693062/stop-bathing-in-folklore-and-start-bathing-in-math"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…that we place on employers, especially those  that don't exist in any other State, and evaluate the impact they have  on the incentive to hire.\n\nTake a cue from President Trump who has said we are going to repeal  10 regulations for every new regulation that we offer.\n\nIf there is any place where the regulatory thicket can rival or even  surpass that…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689211/protecting-medicaid-for-californians"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…healthcare cost, treat their tax  dollars with respect, and ideally lower the cost of the program, we can  work out other issues.\n\nPresident Trump endorses this approach. President Trump has said he  would rather not give money to the insurance companies. He would rather  give it to the people. Actually, he said: Don't give the money to the  money-sucking insurance…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697554/healthcare"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…to do anything  about it, and in the meantime anyone who illegally entered our country  could stay in our country and be supported by American taxpayers.\n\nHowever, as President Trump said in this very Chamber and proved in  his first weeks in office: We didn't new need new laws. We needed a new  President.\n\nThe largest illegal mass migration in history…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697237/no-immigration-benefits-for-hamas-terrorists-act-of-2025"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…healthcare.  And the taxpayers were positively gouged by the fraud and mischief that  occurred under the ObamaCare enhanced subsidy regime.\n\nWe offered an alternative. President Trump said the money shouldn't  go to insurance companies; it ought to go to the consumer, because who  knows better than the consumer what they actually need in terms of  their…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698578/trump-administration"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…Republicans have accomplished so much that they told the  voters they were going to accomplish in the 2024 election. We are  actually doing what we said we are going to do.\n\nPresident Trump said he was going to cut taxes, and he did. President  Trump said he would secure the border, and he did. President Trump said  he would get men out of women's sports, and…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696818/epstein-files-transparency-act"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…blanket cease-fire, but  I will stop bombing infrastructure in Ukraine. He lied like he  breathed. He continued to destroy civilian infrastructure in Ukraine.\n\nThen President Trump said: OK. Let's try for a cease-fire in the  Black Sea.\n\nThat would benefit both Ukraine and Russia, both of which use the  Black Sea for maritime commerce. And, indeed,…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689486/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…expire, without a single Republican vote, to expire them in  the Inflation Reduction Act, which was spent money on the Green New  Deal.\n\nSo when you put in context what President Trump said--when the  premium tax credits were set to expire, we had a hearing on that and we  were talking about it. We asked: Why in the world did the Democrats set  them to…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697890/electric-supply-chain-act"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…stocks. Everybody ought to do like I do and have  my buddy, Tommy Seiler, manage my portfolio of $11,000. I do not trade  any individual stocks. It is all a mutual fund.\n\nPresident Trump said if Congress passed a bill banning stock trading  for Members of this body, he would sign it. I say let's give him that  opportunity. Let's first see if Congress has…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690429/the-first-100-days"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…Trump  has hailed the trade deal as ``a colossal victory for [Iowa] farmers,  ranchers, energy workers, factory workers, and American workers in all  50 states.''\n\nWhat President Trump said there was 100 percent on target when he  made that statement about the value of the USMCA to the U.S. economy.\n\nSince 2019, U.S. agriculture exports have increased by…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699771/9999"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…been really nothing but an attack on President Trump. They are using  this piece of legislation to go at President Trump.\n\nI want to remind everybody of something President Trump has said many  times. He said: ``They are coming after me because I am standing up for  you.''\n\nThat is exactly what is happening today. They are coming after this  piece of…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690939/gulf-of-america-act"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…Congresswoman Ocasio-Cortez got very, very upset, as did the  socialist wing of her party, when the President sent over what is  called a rescission package.\n\nBasically, President Trump said: We want you to take some stuff out  of the budget that we think is a waste.\n\nWe did, and that upset the Congresswoman. She is entitled to be upset  if  she wants to.…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695979/government-funding"}, {"senator": "John Thune", "party": "Republican", "sentence": "…why we are doing this. The Democrats' far-left base said  ``Jump,'' and the Democrat leader said ``How high?'' But the far left's  determination to oppose anything President Trump has ever said or done  is not a good reason for subjecting the American people to the pain of  a government shutdown.\n\nSo I would say to my Democrat colleagues who still care…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695921/continuing-appropriations-and-extensions-and-other-matters-act-2026"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…12 is not enough. We need to get everybody on board  here.\n\nI am glad the Speaker has said that he would support it. I am glad  the President of the United States, President Trump, has said that he  would sign it. Yet, we have to be realistic about what we are talking  about.\n\nWe vote every day on massive issues. We vote about healthcare  policies involving…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691214/stock-trading-ban-for-members-of-congress"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…the high prices of  groceries, of fruits and vegetables, of housing, of housing supplies,  of energy--to deal with high prices. Millions of Americans who voted  for President Trump said they did so out of frustration about high  prices.\n\nWell, today, President Trump has announced he is going to impose  tariffs on virtually every trading partner we have,…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689488/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}]