[{"senator": "Kathy Castor", "party": "Democrat", "sentence": "…mind-boggling.\n\nBack to electric bills. Let's not forget that President Trump  convened oil industry executives and lobbyists at his home last year to  ask for $1 billion for his Presidential campaign. Well, now they are  coming to collect.\n\nEven after almost 2 months, when Speaker Johnson had the House of  Representatives shut down because he didn't want to…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697027/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…I say these strikes--and  they are--not about making Americans safer, that these strikes are  about oil, that they are about another reckless foreign war or  stretching Presidential power toward that of a would-be king--all of  those things happen to be true, by the way--this vote is ultimately not  about whether you agree with the administration's…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698248/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…thoughts that maybe we can merge the two governments in order       to have an election, and then we will have, of course,       parliamentary elections, and then we have a presidential       election, or maybe together,'' Alftise said.\n\n``But what happened is the House of Representatives is       under the control of Mr. Haftar,'' he added. ``They cannot…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697384/recognizing-the-importance-of-libyas-return-to-stability"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…In  response to this simple question: Did President Trump lose the 2020  election? All she could say was:\n\nPresident Biden was certified as the winner of the 2020       presidential election and served as the 46th President of the       United States.\n\nThis is the standard response from this administration's nominees  seeking positions on the Federal…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693415/nomination-of-whitney-d-hermandorfer"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…up, the Trump  Department of Justice pressured Todd Gilbert to fire the chief deputy  who had been the deputy in that office leading criminal prosecutions  during multiple Presidential terms. Todd Gilbert refused to do it, and  Todd Gilbert was forced to resign as a result.\n\nSubsequent reporting by the New York Times laid out the facts that we  believe…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696334/trump-administration"}, {"senator": "Richard Neal", "party": "Democrat", "sentence": "…USMCA. It was a bipartisan  effort.\n\nTariffs, as threatened or imposed, can have an outcome, but not when  we look at Brazil and say that we don't like the result of the  Presidential election and that we are going to impose 50 percent  tariffs, or that we are going to close a bridge as it goes to Canada,  like Canada is an enemy. I have not met anybody…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699969/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "…there was violence. I am from  California. I was present at some of the protests. The scale was  unworthy of Federal condemnation and certainly the scale was unworthy  of Presidential overreach.\n\nIt was the President who overstepped his authority and escalated and  instigated chaos, sending the National Guard and our Marines against  the will of my Governor,…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692811/providing-for-consideration-of-hr-military-construction-veterans-affairs-and-related-agencies-appropriations-act-providing-for-consideration-of-hr-special-interest-alien-reporting-act-of-providing-for-consideration-of-hr-jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-and-providing-for-consideration-of-h-res-condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…Mr. Speaker, I find this exciting and thrilling as a  steward of Michigan and Michigan's economy, as a younger individual who  had worked in a political atmosphere on the Presidential campaigns of  2008, and got to go work in the administration of Barack Obama in the  Treasury Department. I was in the Treasury Department.\n\nMr. Speaker, I know we don't…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689752/reflecting-on-americas-history"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…for him.\n\nHarvey Milk was an American hero, a civil rights leader, and the  first openly gay official in California. He served his country in the  Navy. He was awarded the Presidential Medal of Freedom. He was someone  who stood up for the rights and dignity of all, and he was assassinated  while serving in public office. His memory is worthy of dignity…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692120/stop-renaming-ships"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…voting patterns in the state have undergone tremendous       change, including--as you are certainly aware--Texas's       historic support for President Trump in the 2024 Presidential       Election.\n\nThe Texas Legislature has led the Nation in rejecting race-      based decision-making in its redistricting process--it has       drawn its current maps…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694943/bloody-sunday-and-voting-rights-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…this progress, my Administration established the       Safe and Beautiful Emergency Operations Center to coordinate       public safety and beautification efforts as the presidential       emergency declaration ends. This structure ensures that DC       will remain proactive--bringing together local and federal       partners to sustain momentum on reducing…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696933/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…jurisdiction of such committee; and\n\n(2) would strike provisions that prevent Americans in rural       communities from having access to Wireless Emergency Alerts       or presidential emergency alerts.\n\nMr. Bennet moves to recommit the bill H.R. 4 to the       Committee on Appropriations with instructions to report the       same back to the Senate in…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693642/hr-4"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…stormed the Capitol, drove  Members of the House of Representatives out of our Chamber, drove  Members of the Senate out of their Chamber, and attempted to overthrow  a Presidential election.\n\nNow, the new administration has seen fit to pardon more than 1,500  rioters and violent insurrectionists who attempted to overthrow our  constitutional form of…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691242/leosa-reform-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…those areas. The central area is defined by the concurrent  action of NCPC and the D.C. Council and currently consists of the  Downtown and Shaw Urban Renewal Areas.\n\nUnder presidential executive orders (EOs) and federal law, CFA has  review authority for D.C.-owned parks and buildings, as well as for  certain private land in D.C. Under EOs, CFA has review…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696109/introduction-of-a-bill-to-provide-for-interim-appropriations-for-the-national-capital-planning-commission-and-the-commission-of-fine-arts-with-respect-to-any-fiscal-year-for-which-appropriations-are-not-otherwise-provided-for-the-commissions"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…police  officers who battled for 4 or 5 hours to stop a violent riot and  insurrection unleashed against this Chamber and against the Senate in  an attempt to overthrow a Presidential election.\n\nWe voted to erect a plaque in their honor. That was on March 15,  2022. It was supposed to have been put up on March 15, 2023. We are now  more than 2 years overdue…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693146/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…small schools, Olympic sports, or competitive balance.  That is why tonight I am introducing the Restore College Sports Act. It  replaces the NCAA with a new entity under Presidential authority to  regulate public college sports as a public good. It fixes the NIL  transfer process to eliminate chaos, and it equally shares revenue  across all sports and…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689618/protect-college-sports"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "Mr. BERGMAN. Mr. Speaker, it is my honor to recognize Valerie Prehoda  for being inducted into the Michigan Tech Presidential Council of  Alumnae. This well-deserved honor reflects her steadfast dedication to  her fellow Servicemembers, the communities throughout the Upper  Peninsula, and our Nation.…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696846/recognizing-valerie-prehoda-on-her-induction-into-the-michigan-tech-president-council-of-alumnae"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…increased prices for families and businesses.\n\nThis resolution would overturn the rule implementing the EPA's waste  emissions charge which was published following the 2024 Presidential  election as part of the Methane Emissions Reduction Program established  in the Inflation Reduction Act. Energy produced in the United States  has some of the lowest methane…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688177/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…conducted here in  the Senate Chamber has been made available live to the public, from  memorable moments--including televising 16 Supreme Court nomination  debates and 3 Presidential impeachment trials--to subjects that are  often very mundane.\n\nThanks to C-SPAN2, this public service allows our constituents to see  the swearing-in of newly elected Members,…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691703/senate-resolution-259-recognizing-june-as-the-39th-anniversary-of-c-span-chronicling-democracy-in-the-senate"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…whose imports will be taxed at a  much higher rate.\n\nCongress didn't debate these tariffs. Congress didn't vote to enact  these tariffs. The tariffs are simply imposed by Presidential fiat, by  proclamation.\n\nGovernment by one person who assumes all power by asserting a so- called emergency is the antithesis of constitutional government. It was  Montesquieu…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690543/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…Conduct Medal, Vietnam Service Medal with 5 Bronze  Service Stars and one Silver Star, Vietnam Campaign Medal, Vietnam  Cross of Gallantry, Navy Valorous Service Ribbon, and a Presidential  Unit Citation.\n\nFollowing his military service, Danny pursued higher education at  Hardin Simmons University and earned a B.A. from Wayland Baptist  College. He then dedicated…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696284/recognizing-danny-wallace-smith-with-a-congressional-veteran-commendation"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…and extremely  limited. Because they have been going on for less than 60 days, they  don't even fall within the War Powers Resolution threshold.\n\nI would also note that Presidential action like this is hardly  unheard of or unique. For context, as of the mid-20th century, scholars  identified more than 100 military deployments or actions that lacked…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696118/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…2nd District as my Staff Assistant in the summer of 2024,  where she gave phenomenal tours, treated my constituents with kindness,  and navigated the unpredictable 2025 Presidential Inauguration with  grace. After I became Chairman of the House Committee on Energy and  Commerce, I knew I wanted Emily's optimism and readiness to serve on my  new team.…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693661/recognizing-emily-hale"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…first passed in the early 1970s, it was $10,000. Today,  that number adjusted for inflation is over $81,000. That is who they  were looking for. If you look at the last Presidential administration  under Joe Biden, they wanted to know about your bank account if you had  ever had $600 of transactions in your bank account, so they were going  the other…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693006/central-bank-digital-currency"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Foster and Mr. Huizenga. It is a bipartisan bill, Mr. Speaker, the  Financial Stability Oversight Council Improvement Act, after a decade  of collaboration across four Presidential administrations that has led  to this consensus on this measure.\n\nThe Financial Stability Oversight Council, FSOC, created in the  aftermath of the global financial crisis,…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699822/financial-stability-oversight-council-improvement-act-of-2025"}, {"senator": "John Carter", "party": "Republican", "sentence": "…Base. In 2004, Lt. Col. Davison  took on the role of Director of Combat Operations for the NORAD  Continental Region, where he managed all U.S. alert fighters and  oversaw Presidential support. He earned numerous accolades, including  three Top Gun awards and a Meritorious Service Medal with 3 oak leaf  clusters.\n\nAfter retiring from the Air Force, Lt.…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689349/saluting-the-service-of-lieutenant-colonel-jeff-davison"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…to stop that  from happening.\n\nThe annual thresholds in the DETERRENT Act are simple and align with  other requirements in existing law such as in the CHIPS Act and the  Presidential Memorandum on United States Government-Supported Research  and Development National Security Policy.\n\nShockingly, this amendment includes no differences for America's  biggest…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689032/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "…in half a century; many, many, many hours in  session, substantially exceeding the average of the past 78 years.\n\nWhat do we have to show for all of that? More than 400 Presidential  nominees confirmed, far exceeding the totals of the first year of  President Trump's first term and of President Biden's; repeal of a  number of burdensome Biden rules…", "date": "2026-01-05", "source_url": "https://justfacts.votesmart.org/public-statement/1698482/senate-agenda"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…receiving rental assistance, Social  Security, and SNAP benefits, as well as voter fraud under stolen  identity, voting in several Federal elections, including the 2024  Presidential election, this is a real problem in Massachusetts right  now. I would argue that we need to pass this legislation to actually  take action.\n\nThe time for delay is over.…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699944/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…rather, by an elected Member of the United States Congress. This is  worthy of the harshest sanctions that we can apply.\n\nMr. Speaker, many Members repeatedly interrupted this Presidential  address with catcalls and insults and other gestures of disrespect. A  Member once did this to President Obama. He apologized, and he was  reprimanded.\n\nI didn't hear an…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688497/raising-a-question-of-the-privileges-of-the-house"}]