[{"senator": "Tim Kaine", "party": "Democrat", "sentence": "…and I am completely confident that  all 100 Senators feel the same way in that this is not a good thing and  that there needs to be a path forward. In Virginia, we feel it pretty  strongly. We have the second-most Federal employees of any State in the  country, and we have an awful lot of Federal contractors whose  livelihoods are affected as well.…", "date": "2025-10-01", "source_url": "https://justfacts.votesmart.org/public-statement/1695967/en-bloc-nominations"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…power. It is, in fact, the  most aggressive domestic user and builder of wind power in the world.\n\nI raise this point, Mr. Speaker, not to play gotcha--although this is  a pretty embarrassing gotcha--but rather to remind the House that,  right now, in real life, the Trump bogus attack on wind power, for no  good reason, is destroying good American jobs…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698954/china-is-not-scamming-europe-and-united-states-on-wind-power"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…restrictive. It is not overly burdensome in any sense. It is just truly  a preference if all other conditions are equal.\n\nIn addition to eliminating the preference itself, it is pretty  interesting to see that there are two other provisions in this  amendment that both eliminate even the consideration of noninternal  combustion engine vehicles, even the consideration,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695135/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…percent say a  decent amount of impact on their lives; another 30, a little bit. Only  9 percent say: None at all. It is cool. Electric prices are good with  me.\n\nSo that is a pretty big hit.\n\nEven among Republicans, 25 percent say it hits them a lot, 29 percent  say it hits them a decent amount, and 32 percent say it hits them a  little bit. Only 11 percent…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696122/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…do. Maybe we don't want to  dwell on some of the actions that occurred in the early days of the  117th Congress. There was an attempt to certify the election that is  usually pretty standard. We saw that happen this term. It was, again,  pretty standard.\n\nOn that day, January 6--I know people hear that day a lot--it was not  so standard. It was kind of…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689752/reflecting-on-americas-history"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…Democrats. Congressional Republicans wanted to go it alone when they  passed President Trump's One Big Beautiful Bill Act.\n\nThe American people are now finding out it is really a pretty big,  ugly mess, especially when it comes to their healthcare and their  everyday lives.\n\nRepublicans made devastating healthcare cuts to Medicaid and the  Children's Health…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695715/ensuring-funding-for-communities"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…H.R. 504 would ensure that a historic  Tribal village is protected, while allowing for critical restoration  efforts to move forward without displacing the community.\n\nIt is pretty straightforward. It is noncontroversial. It was broadly  universally bipartisan. It never should have been vetoed.\n\nMr. Speaker, I urge my colleagues to support H.R. 504. Vote…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698657/miccosukee-reserved-area-amendments-act-veto-message-from-the-president-of-the-united-states"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…pass  legislation on commercial refrigerators? It is really important.''  Nobody said that.\n\nThey are really concerned about the Republicans' plan to gut  Medicaid. They are pretty concerned about the Republican plans to  dismantle Social Security offices across the country. They are deeply  concerned about reports that this administration is going to…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689052/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers-providing-for-consideration-of-hr-defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…Speaker, I rise to congratulate Loudon County  High School's football team, led by Head Coach Matt Reidenbaugh, on  making it to the State championship. They have put together a pretty  impressive season, and they will be taking on the Varina Blue Devils.  We wish Coach Reidenbaugh and the team the best of luck this weekend.\n\nGo Captains.                Congratulating…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697707/nationwide-shortage-in-professional-fields"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…that  says that only--you cannot run deficits after that?\n\nYou know, those 30-year estimates, over $30 trillion of additional  debt from this bill. Now, our current debt is pretty high: $37  trillion. This adds another $30 trillion-plus.\n\nAnd the Congressional Budget Office costed out what happens if the  interest rates are 1 percent higher than they…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693102/one-big-beautiful-bill"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…since the Congressional Review Act was first passed--has always been to  address Agency rulemaking under the Administrative Procedures Act.\n\nWell, the fossil fuel industry pretty much runs the Republican Party  here in Washington. And for a long time, it has objected to California  having clean air standards that many States, including my State,  voluntarily…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691447/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…the Congressional  Review Act to strike down a recent regulatory attack on the Affordable  Care Act launched by the Trump administration.\n\nI think my colleagues have done a pretty good job of explaining what  is at stake. Even the Trump administration's own experts at CMS, the  Centers for Medicaid and Medicare Services, say that implementation of  this…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698982/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…Act is making  the airspace less safe. I don't even know how this got in the bill  because I guarantee you, Senator Cruz and I didn't approve of this  being in the bill. I am pretty sure my colleagues in the House,  Congressmen Larson and Graves, didn't approve of this being in the  bill. So how is it that this is now in the bill that we all have to  respond…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697858/national-defense-authorization-act"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…President Trump do that would  be a bridge too far for you? What attack on democracy or the rule of  law could Trump make that would cause you to speak up?\n\nHis answer was pretty simple, and it was pretty confident. He said:  If Trump were to ignore a Supreme Court ruling, that would cross the  line.\n\nHe was reflecting a familiar theme: that until President…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690111/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…is decimated--if you push a legislative agenda of more junk  fees, abusive medical debt collection practices, Big Tech domination,  and predatory lending--then the answer is pretty clear.''\n\nMr. Speaker, S.J. Res. 28 is opposed by nearly 200 consumer, civil  rights, religious, and good governance organizations. It was also  opposed by a bipartisan group…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689953/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…then another  one that changed the end date, in that case, from March 31 to January  30.\n\nJanuary 30 was set to be the agreed upon end day for this accounting  trick. So I was pretty surprised when January 30 comes and goes, and  then we get this new provision saying: No we are actually now going to  extend this all the way out to July 31.\n\nLet's go out…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700046/legislative-calendar-days"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…about that, it can be appealed, and it  goes up to a circuit court, and it takes in a region. If there is a  dispute even there, they take it on to the Supreme Court.\n\nIt is pretty simple--until the last several decades. You see, prior  to 1960, there was no such thing as a nationwide injunction. No one  even considered that. But we started seeing this…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691654/nationwide-injunctions"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…SNAP and WIC  might not get it. A ``no'' vote means the people who allow us to come  here to debate and work won't get paid either.\n\nI can go down the list of horrors. It is pretty simple. This is a  vote about two things: opening the Government of the United States,  which you willfully tried to shut down. Fortunately, you did not  succeed in that in…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696725/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…wanted to highlight what is going on in Alaska, as I usually do  during my ``Alaskan of the Week'' speech and just give a snapshot of  what is happening back home.\n\nIt is still pretty cold, still have a fair amount of snow. Anchorage  just got a bunch of snow that lasted a couple of days. The 53rd  Iditarod just concluded in Nome with a stunning first-time…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690106/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "Mr. DAVIDSON. Mr. Speaker, I thank the ranking member for yielding.\n\nMr. Speaker, I have not seen a perfect bill since I have been in  Congress, but this is a pretty good bill. It is an important bill.  Regulating stablecoins is long overdue at the Federal level, but make  no mistake, stablecoins aren't new.\n\nThe New York Department of…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693835/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "…Staff  immediately, and there is overwhelming support on the Democratic side  and Republican side for this nomination.\n\nOn the other hand, passage of this confirmation would pretty much end  our week, and that would prevent us from getting a lot of work done  later on this afternoon and into tonight and tomorrow if we have to  stay until tomorrow to confirm…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690110/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…right thing  is to continue to investigate Jack Smith for turning the law upside  down, for creating a precedent that should scare every Senator in this  body.\n\nThe law is pretty clear--there is a statute on point--that the  Senate, even with a nondisclosure order, is supposed to notify the  Members when somebody wants our phone records. We are a separate…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699105/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "James Risch", "party": "Republican", "sentence": "…been several and  should be celebrated not denigrated. For instance, recently his work  when India and Pakistan started fighting, he got involved, and he had  that shut down pretty quickly.\n\nThis morning, I had the good fortune to attend, with Secretary Rubio,  an event at the State Department where a peace agreement was signed  between Rwanda and the…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693132/motion-to-discharge-sj-res-59"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…the filibuster was about people  being able to speak. Because on the Senate floor, you can speak, you  can vote, or you can be assessing whether you have a quorum. Those are  pretty much the things that you can do on the Senate floor.\n\nSo guess what. If you have a quorum, if you have 51 Senators sitting  on the floor of the Senate demanding action for…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699673/united-states-fiscal-situation"}, {"senator": "Andy Harris", "party": "Republican", "sentence": "…people without children on Medicaid to agree to  work 20 hours a week or volunteer at a church or train. It doesn't seem  like too much. The average American thinks that is pretty reasonable.\n\nIf we eliminate all the fraud, waste, and abuse--and there is plenty  of it--we are left with at least a 25 percent increase in Medicaid over  the next 10 years…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690807/medicaid-rumors"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…call it, $400 billion for Medicare. We are going to  actually hold a contest shortly to see who can guess the final  borrowing for this year.\n\nThe economy has actually been pretty good. We are tracking customs  receipts. Many of you think of it as tariffs. We may have another $70  billion on top of baseline. It is probably going to come at $2.2  trillion…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694131/dismantling-californias-citizens-redistricting-commission"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "Mr. McCONNELL. Mr. President, my position on government shutdowns is  pretty well-known. There is absolutely nothing to gain in taking basic  government functions hostage for eleventh-hour partisan demands.\n\nI hope our Democratic colleagues will relearn…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695989/9999"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…defense, and secure the border,  which is exactly what we told the voters we were going to do in the  election.\n\nI always say that we make this job way too complicated. It is pretty  darned simple. What did Members tell the voters they were going to do  when they put their name on the ballot? If they get elected, go do what  they said.\n\nThe American people…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688069/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…2026, we  are going to have to borrow--this is what we call virgin borrowing; it  is new issuances--about $470 billion a quarter. That is less than $2  trillion, but it is pretty darn close.\n\nThat is on top of what we have to refinance. When you start to get a  sense of what we are bringing to the bond markets, it is more than just  the borrowing. It…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699257/debt-deficits-and-demographics"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…had insurance  through ObamaCare, but those insurance companies were subsidized,  almost half of them, on the exchanges.\n\nIf Democrats think that is not a problem, that is pretty scary.\n\nI called on the Government Accountability Office to investigate. They  created fictitious ObamaCare applicants with fake documentation, and  100 percent--not some,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698800/breaking-the-gridlock-act"}]