[{"senator": "Kathy Castor", "party": "Democrat", "sentence": "Consumers deserve to see upfront prices when they  plan their budgets and vacations.", "title": "Hotel Fees Transparency Act of 2025", "date": "2025-04-28"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "Sixty-one percent of Americans say that Trump's  policies have worsened economic conditions in this country, and 64  percent of Americans say Trump's policies are raising the prices of  food and groceries.", "title": "Denouncing the Horrors of Socialism", "date": "2025-11-21"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "We have higher electric prices, grocery prices, and housing prices.", "title": "Hospital Inpatient Services Modernization Act", "date": "2025-12-01"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "It might be  ``Trump First'' or it might be ``Chevron First,'' but it is not  ``America First.'' And we just saw the revelation that a major donor to  President Trump bought at bargain basement prices a Chevron subsidiary  and can stand to make literally billions of dollars.", "title": "Providing for Congressional Disapproval Under Chapter 8 of Title United States Code, of the Rule Submitted By the Environmental Protection Agency Relating to ``Air Plan Approval; South Dakota;", "date": "2026-01-07"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "Businesses have begun hiking prices and laying off workers.", "title": "Terminating the National Emergency Declared to Impose Global Tariffs", "date": "2025-04-30"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "It was part of the Inflation  Reduction Act, and it actually says: Hey, this sweetheart deal that  pharma had with Medicare, in which they can't negotiate at all and that  the prices are locked in and so our country--people are paying twice as  much as they do in places like Canada, for the drug.", "title": "Department of Health and Human Services", "date": "2025-02-27"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "The fact is, energy prices are a real emergency for the American  people, and we need more energy on the grid to keep up with the  proliferation of AI and data centers.", "title": "Terminating the National Emergency Declared with Respect to Energy", "date": "2025-10-08"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "Energy prices were  skyrocketing because of the 1973 oil crisis, when barrels of oil--then,  our most in-demand energy source--quadrupled in price.", "title": "Terminating the National Emergency Declared with Respect to Energy", "date": "2025-10-08"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "Instead of lowering prices, Republicans passed a bill to cut nearly a  trillion dollars from Medicaid and the Affordable Care Act, which will  strip healthcare coverage for more than 15 million people.", "title": "-9999", "date": null}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "That is why 20 of the most widely  used drugs' prices have plummeted, because we negotiated with Medicare.", "title": "Prescription Drugs", "date": "2025-05-12"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "This resolution is about drawing a line in the sand and saying you  cannot abuse your emergency powers to start an unjustified trade war;  you cannot abuse your emergency powers to hurt one of the finest  relationships in the world; and you cannot drive up prices, eliminate  jobs, and put in place a national sales tax that experts now predict  will altogether--the tariff tax--cost the average family nearly $2,000  per year.", "title": "Terminating the National Emergency Declared to Impose Duties on Articles Imported From Canada", "date": "2025-10-29"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "They would like to see how the United States Government can do more  for their industry--drill, baby, drill--the claim being that our  government needs this report to increase fossil fuel production with an  implied promise, but no guarantee, of lower energy prices.", "title": "Renewable Energy Means Lower Energy Costs", "date": "2025-11-21"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "After decades of empty promises about lowering the cost  of prescription drugs, the prices of the 10 most expensive drugs under  Medicare will finally fall.", "title": "Healthcare", "date": "2026-01-07"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "Prices are up.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the Department of Energy Relating to ``Energy Conservation Program for Appliance Standards: Certification Requirements, Labeling Requirements, and Enforcement Provisions for Certain Consumer Products and Commercial Equipment''", "date": "2025-03-05"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "Grocery prices continue to climb with essentials like coffee and  beef, with a 19-percent increase and 15 percent increase, respectively,  more expensive than they were a year ago.", "title": "Terminating the National Emergency Declared to Impose Duties on Articles Imported From Canada", "date": "2025-10-29"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "What this does, if you look at the map, and a lot of people have  looked at maps of energy prices, what are the highest cost electric  prices in the country?", "title": "State Planning for Reliability and Affordability Act", "date": "2025-12-10"}, {"senator": "Dan Crenshaw", "party": "Republican", "sentence": "That jeopardizes jobs, increases prices, and makes  American manufacturers less competitive globally.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the Environmental Protection Agency Relating to ``National Emission Standards for Hazardous Air Pollutants: Rubber Tire Manufacturing''", "date": "2025-03-05"}, {"senator": "Roger Marshall", "party": "Republican", "sentence": "Could you imagine going into the McDonald's, and you are trying to  decide if you want the Big Mac or you want the Filet-O-Fish and not  knowing the difference in the prices on that?", "title": "-9999", "date": "2025-12-09"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "In fact, experts are already predicting a decline in gas prices as we  move through the summer months.", "title": "Taking A Step Toward True Energy Dominance", "date": "2025-06-25"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "You may remember prices went up, gas lines  formed, and our Nation's economy was threatened because adversarial  nations took advantage of U.S.", "title": "Securing America's Critical Minerals Supply Act", "date": "2026-02-11"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "This has resulted in energy shortages in certain areas of the  country, exposing consumers to high prices and our grid to increased  vulnerability.", "title": "Improving Interagency Coordination for Pipeline Reviews Act", "date": "2025-12-12"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "We need to be able to produce those critical minerals here in the  United States to put in that reserve, which will insulate against  foreign bad actors dumping in our markets to drive the prices down to  make projects not economically viable.", "title": "Critical Mineral Dominance Act", "date": "2026-02-04"}, {"senator": "Mike Crapo", "party": "Republican", "sentence": "Vertically  integrated health plans, pharmacy benefit managers, and other  intermediaries suppress competition, pocket valuable drug discounts,  and increase prices for consumers--all unrelated to the list price of  the drug.", "title": "Military Construction, Veterans Affairs, and Related Agencies", "date": "2025-07-23"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "Supporting this resolution means supporting American energy jobs,  lower prices, and fostering a regulatory environment where businesses  can thrive while safeguarding the environment.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the Environmental Protection Agency Relating to ``Review of Final Rule Reclassification of Major Sources As Area Sources Under Section 112 of the Clean Air Act''", "date": "2025-05-21"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "His constituents, the dear people of  Colorado, and many other constituents in blue States, like New York and  California, probably are paying record prices for electricity and other  energy products.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the Bureau of Land Management Relating to ``North Dakota Field Office Record of Decision and Approved Resource Management Plan''", "date": null}, {"senator": "Shelley Capito", "party": "Republican", "sentence": "Fracking and shale gas have both revolutionized and transformed  American energy, leading to lower prices, job growth, and increased  American energy security.", "title": "Terminating the National Emergency Declared with Respect to Energy", "date": "2025-02-26"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "President, 1 year ago today, the American people  rejected high prices; they rejected open borders; they rejected the  weakness of Joe Biden and Kamala Harris.", "title": "Government Funding", "date": "2025-11-05"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "In the One Big Beautiful Bill Act, our Republican majority answered  rural America's call by updating reference prices, doubling investments  into crucial trade promotion programs like MAP and FMD, and expanding  crop insurance.", "title": "No Place Like Home", "date": null}, {"senator": "David Schweikert", "party": "Republican", "sentence": "A whole bunch of apparently really smart people  examined Medicare and walked up and down through the growth in spending  and what we could do to modernize it and use technology to stabilize  the prices.", "title": "Tell the Truth About Math", "date": "2025-03-25"}]