[{"senator": "Brian Schatz", "party": "Democrat", "sentence": "…money from the poor to the rich, and I have never  seen my party propose a bill that raises the price of electricity, that  raises the price of food, and that raises the price of healthcare. So  we are going to talk about this today, tomorrow, and for the next 18  months until this thing is repealed from the Federal lawbooks.", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693485/one-big-beautiful-bill-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…expense he can deal with or  that people like him can deal with. He makes a good salary, and he is a  hard-working guy, but he can't afford such a dramatic jump in the price  of his healthcare insurance. That is the kind of financial shock that  Jeremy will have about which I heard over and over and over and over  again.\n\nWhat do you do--sign up for healthcare…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698199/new-york"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…by more than 21 percent.\n\nWhen I go home, my constituents aren't telling me they have an extra  $1,700 to spare. They are asking me to lower grocery prices, lower the  price of healthcare, and make life more affordable. That is what this  is about. It is about the American people and making things affordable  for them.\n\nToday's vote is simple. It is very…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699971/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…quality healthcare.\n\nBut faced with high costs, from expensive medications to specialty  treatment, too many hard-working families  are struggling to keep up with the high price of healthcare.\n\nI have heard my colleagues on the Republican side, who didn't support  the bill when it was created, come in and say: But healthcare is still  too expensive.\n\nThat…", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697576/department-of-defense"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…there. I am willing to negotiate with my  colleagues. I know that plenty of my colleagues on the other side of  the aisle think that it is absolutely insane to raise the price of  healthcare; that they don't want to be associated with that. There are  so many people who feel that way. We have people retiring on the other  side of the aisle.\n\nBut the only…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695610/healthcare"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…giving to millionaires and  billionaires in our country.\n\nBut when it comes to just making sure people in our country, this  Christmas, don't see a dramatic spike in the price of healthcare for  them and their families, they are going: Sorry, I don't have any money.\n\nAnd there is good reason. They are giving it to the Defense  Department. They are giving…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697772/healthcare"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…or rape young girls.\n\nThen they say they don't know if they were 18 or 22. Come on. It is  rotten. Then they say to just care about the price of eggs. Care about  the price of healthcare. What is more important than that? American  values are more important. These rich, greedy men abused American  values. They abused what is sacred about this country.…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696898/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision-providing-for-consideration-of-h-con-res-denouncing-the-horrors-of-socialism-providing-for-consideration-of-hr-unlocking-our-domestic-lng-potential-act-of-providing-for-consideration-of-hr-researching-efficient-federal-improvements-for-necessary-energy-refining-act-providing-for-consideration-of-hr-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-providing-for-consideration-of-hr-district-of-columbia-cash-bail-reform-act-of-and-for-other-purposes"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…with better, faster,  cheaper technology. That is particularly true in healthcare.\n\nWe have done presentation after presentation here showing how you  could crash the price of healthcare legalizing technology. Even today,  I had a little bit of a verbal kerfuffle--love that word--with a Member  who is a doctor, and he is my friend. He despised the concept,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699674/united-states-fiscal-situation"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…this one and see if I can make this make sense. This  is a bit complicated, but we have been trying to do the analytics of  how much the subsidies have screwed up the price of healthcare.\n\nIf you walk through it, we can actually chart where the subsidies  come in and it actually raises the price of healthcare. The way the  insurance companies retain…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697051/facing-fiscal-reality"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…their kids, their grandkids, and their  retirement? It doesn't have to be that way.\n\nGod knows that, over the last couple of years, I have showed how we  can crash the price of healthcare by using technology. Then, the  lobbyists are in our offices, saying that would mean they have to  change their business model.\n\nYesterday, on CNBC, Eric Cantor was,…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688651/a-real-math-problem"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…discussion we are going to  have here is a financing debate--how much more subsidies should we hand  out--and not a discussion of what we are going to do to change the  price of healthcare.\n\nLet's actually take a quick run through this. I am going to try to  explain a couple of basic things about the ACA. Most of us know it as  ObamaCare.\n\nThis chart is…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697873/turning-healthcare-into-financial-engineering"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…instead of  helping our brothers and sisters be healthier. Legalize the technology.  Legalize the processes.\n\nDo you realize that so many things where you could crash the price of  healthcare, this body actually keeps illegal?\n\nWe are going to do a number of healthcare bills. Every single one of  them is wonderful, except for one small problem: There are…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699257/debt-deficits-and-demographics"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…$111  billion.\n\nUnderstand what the left is telling you. They are basically saying  they don't give a damn about healthcare. It is financing. If we wanted  to change the price of healthcare, we would actually be looking at the  innovations that are going on and start to legalize them, but there are  too many damn lobbyists walking up and down our hallways…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698698/congress-is-a-math-free-zone"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…I have been coming behind this mike for over a decade with  presentation after presentation of technologies, new pharmaceuticals,  and new methodologies to crash the price of healthcare. I get the crap  kicked out of me because armies of lobbyists don't like it when we talk  about changing their business model.\n\nRemember, several months ago, I came…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699988/math-is-such-an-anathema"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…or a policy connection or whatever the  hell we are supposed to call it between the left and right saying: What  would happen if we engage in policies that change the price of  healthcare? Instead, we do these debates because everything in  Washington is about the money.\n\nThe people marching up and down our hallways here are not coming to  our office…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690748/the-math"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…us from modernizing the system and bringing us into this century. Just  use the technology. We walk around with a supercomputer in our pocket.\n\nThis could crash the price of healthcare, make you healthier, give  you access, all these things, and there is an army of people trying to  stop us.\n\nRemember, telehealth here was an absolute war. There were…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690586/economic-anxiety"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…the brain trust around here to  come together and say: We are going to take all of these ideas and  build a unified theory, and this unified theory is how we crash the  price of healthcare, instead of spending a couple more years arguing  back and forth on how much more money we should borrow to hand out as  subsidies, particularly to insurance companies.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698412/fun-with-math"}]