[{"senator": "John Mannion", "party": "Democrat", "sentence": "…affordability and giving me the opportunity to speak  today.\n\nAcross central New York and the Mohawk Valley, people are worried,  and they have every reason to be. Grocery prices are going up.  Healthcare costs are rising. Energy bills are spiking. Too many  families feel like they are being asked to absorb the hit while  Washington does nothing to…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699587/stop-the-republican-affordability-crisis"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…overtime, so they are  working an additional 15, 20, 30 hours per week, then they have got to  pay them time-and-a-half under the Fair Labor Standards Act.\n\nTherefore, the prices go up now because they are not able to find  enough workers to satisfy the demand. Their choice at that point is to  either pay the farmers less money, which they can't do…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695361/stop-illegal-entry-act-of-2025"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…2017 tax cut  that the vast majority of that benefit went to the wealthiest, and it  did not trickle down to people. People are already having trouble  affording rent, home prices, food, and other goods.\n\nPutting this kind of financial pressure not just on Medicaid  recipients but on everybody else, because insurance rates and medical  costs are going…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691419/gop-tax-scam-hurts-everyone"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…your emergency powers to start an unjustified trade war;  you cannot abuse your emergency powers to hurt one of the finest  relationships in the world; and you cannot drive up prices, eliminate  jobs, and put in place a national sales tax that experts now predict  will altogether--the tariff tax--cost the average family nearly $2,000  per year.\n\nAnd they…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696446/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…is  the worst economy that a President has had in their first 100 days  since President Nixon.\n\nDespite promises candidate Trump made that he would lower costs on  day one, prices remain high, and, in fact, it is expected that prices  could rise by 6.5 percent by year's end. Trump policies are why prices  remain high, even though he has tried to pin…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690572/new-federal-economic-data"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…Dr. Iyengar also mentioned that we now are less safe in protecting  ourselves during the flu season, particularly with bird flu.\n\nI may insert the question: How much are egg prices today in the  United States of America? People are stealing eggs outside of delivery  trucks and engaging in fights in supermarkets across this country. This  is the United…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688410/a-serious-and-profound-moment"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "…time.\n\nThe majority has hit the American people with the largest tax  increase on the middle class in at least 50 years. We have watched  markets around the world plummet, prices spike, and our trading  partners hit back with tariffs on American goods that are attacks on  the American people.\n\nHardworking Americans are paying more for food, clothes,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690420/put-hardworking-american-families-first"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…people.\n\n$40 billion to Argentina; hurting our farmers and ranchers, importing  more beef from South America.\n\nBombing Venezuela, threatening to invade NATO allies.\n\nMeanwhile, prices are not down. Prices are up because of the stupid  tariffs and lousy economic policies.\n\nThey promised to release all of the Epstein files. They still haven't  done that. In…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699593/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…and their secret meat grinder called DOGE hurting working Americans?\n\nInflation is going up, unemployment is up, the stock market is  rickety and went down again today, egg prices are up, and Walmart sales  are down.\n\nSo far, there is little evidence that DOGE is helping families.  Indeed, they are causing more unemployment. They are not keeping us…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687903/draconian-doge-cuts"}, {"senator": "Suzan DelBene", "party": "Democrat", "sentence": "…plan went up by over 40 percent;  and Mitch, who is looking at a 420-percent increase for him and his  wife.\n\nRepublicans and the Trump administration promised to bring down  prices. Instead, they have made healthcare a luxury that only some can  afford.\n\nI believe everyone should have affordable, quality, accessible  healthcare. Because of that, I will…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698803/breaking-the-gridlock-act"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…fact, in Washington State, average  electricity rates are up nearly 17 percent since Trump took office less  than 1 year ago.\n\nWith energy demand skyrocketing in the region, prices have continued  to climb.\n\nLet me be clear. This is a direct result of the harmful and reckless  policies of this President and Republicans in Congress. They have  canceled…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697885/state-planning-for-reliability-and-affordability-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "Mr. Speaker, I rise in strong opposition to H.J. Res. 20, the second  Republican resolution in just 2 days that will raise energy prices on  Americans. This harmful resolution guts a Department of Energy  efficiency rule on gas instantaneous, or tankless, water heaters.\n\nEnergy efficiency standards, like the…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688293/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…driving up home energy bills for families by as much as 30  percent.\n\nI cannot support this bill, and I urge my colleagues to vote NO.  Instead of working with Democrats to lower prices and invest in  technology that promotes our energy independence, House Republicans are  pushing a bill that raises energy costs for families and businesses,  and eliminates…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694862/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "Mr. Speaker, I rise in opposition to H.J. Res. 35, a resolution that  will drive up energy prices in the United States. It is a radical  measure that will gut one of the Inflation Reduction Act's most  critical programs: the Methane Emissions Reduction Program.\n\nWith this…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688180/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…that the President thumbs his nose at what the Supreme Court has  told him and is now inflicting new pain and new taxes on Americans, new  tariffs, that is going to keep the prices of appliances elevated at a  time when people are really under the gun and feeling the squeeze. They  are going to make it harder to replace or upgrade big-ticket items.\n\nThe…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700223/homeowner-energy-freedom-act"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…everything from groceries, to smartphones, to  washing machines, to just about every conceivable product.\n\nVoters in the last election indicated they were fed up with high  prices. Every time Americans went to the grocery store, they were  reminded that inflation and putting food on their family's table was  more difficult and left them with less money…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690543/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "Mr. BARRASSO. Mr. President, 1 year ago today, the American people  rejected high prices; they rejected open borders; they rejected the  weakness of Joe Biden and Kamala Harris. One year ago today, the  American people voted to get America back on track, and they…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696537/government-funding"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…math. With the average 3.15 people in  that household, that is nearly 79 million, with an m, 79 million people  affected. Mr. Speaker, that doesn't even account for higher prices or  the hit to our energy security or the actual possibility that our  energy security will be severely damaged.\n\nMr. Speaker, if we want reliable power and lower costs, we…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698071/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Jim Banks", "party": "Republican", "sentence": "…what it was just a little  over a year ago when President Trump came back into office. Inflation  is at its lowest level in more than 5 years, thanks to President Trump.  Gas prices are down below $2.30 in most States. Incomes are rising  again. The stock market has set 53 alltime record highs since President  Trump's election in 2024. Fentanyl moving…", "date": "2026-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1700296/state-of-the-union-address"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I move to suspend the rules and pass the  bill (H.R. 1479) to prohibit unfair and deceptive advertising of prices  for hotel rooms and other places of short-term lodging, and for other  purposes.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690200/hotel-fees-transparency-act-of-2025"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…drawn-out State reviews,  undermining otherwise federally authorized projects.\n\nThis has resulted in energy shortages in certain areas of the  country, exposing consumers to high prices and our grid to increased  vulnerability.\n\nIn fact, a recent study estimated that pipeline blockades have  already driven average natural gas prices up by 160 percent in major…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698073/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…I am not quite sure understand, but what they  do understand is that they cannot afford their health insurance. They  cannot, if you will, afford the cost of being insured. Prices of health  insurance and of healthcare are up for everybody. It is not  sustainable, and they are looking to us--they are looking to Congress-- for solutions.\n\nAs a physician,…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697554/healthcare"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…decreased to 14 as of last  year, with two additional refineries slated to close in early 2026.\n\nThese anticipated closures will disrupt fuel supplies and increase  energy prices for consumers, businesses, and farmers.\n\nAn analysis by the University of Southern California anticipates  retail gas prices in the State could increase by as much as 75 percent…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697029/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…be borne by providers or passed on to consumers, to       predict how providers might respond to higher costs, or to       predict how consumers might respond to increased prices.''       However, with no analysis conducted on the compliance costs       of the proposal, the rule later certifies that the proposal       ``would not have a significant…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689949/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…families, and protect the American Dream.\n\nMs. LEGER FERNANDEZ.\n\nMr. Speaker, America is suffering. Americans don't recognize the  country we live in. Trump's tariffs have caused prices to soar. We have  the highest unemployment rate in 4 years so fewer people have jobs.  Those out of work can't even afford those expensive groceries, housing,  and appliances.…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698949/providing-for-consideration-of-hr-protecting-prudent-investment-of-retirement-savings-act-providing-for-consideration-of-hr-flexibility-for-workers-education-act-providing-for-consideration-of-hr-empowering-employer-child-and-elder-care-solutions-act-providing-for-consideration-of-hr-tipped-employee-protection-act-and-providing-for-consideration-of-hr-save-local-business-act"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…final rule are also  duplicative of existing reporting requirements by certain States, EPA,  and Energy Star. This increase in red tape will do nothing to lower  appliance prices, and it will do nothing to lengthen product lifetimes  or to bring real energy savings to the American homeowner.\n\nAccordingly, Mr. Speaker, I thank my colleague from Georgia…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688547/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…the Department of Energy was organized in 1977, Mr. Speaker, the  American people were suffering from the energy security fallout of  OPEC's oil embargoes. You may remember prices went up, gas lines  formed, and our Nation's economy was threatened because adversarial  nations took advantage of U.S. reliance on energy imports for their own  interests,…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699990/securing-americas-critical-minerals-supply-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…companies want to go to the most affordable energy.  That is what they want to produce.\n\nWhat this does, if you look at the map, and a lot of people have  looked at maps of energy prices, what are the highest cost electric  prices in the country? I know my friend from Colorado  pointed out to my other friend from Colorado that Colorado is up in the  grid with…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697882/state-planning-for-reliability-and-affordability-act"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…many cases, often resulting in  insufficient infrastructure to transport our clean natural gas.\n\nThe result is an electric grid that is less reliable and increased  utility prices for hardworking Americans. While natural gas demand is  expected to reach an all-time high, accounting for more than 40 percent  of electric generation in the U.S. next year,…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698069/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…unemployment. California leads the Nation in homelessness. California  leads the Nation in poverty. California leads the Nation in illiteracy.  California leads the Nation in gas prices. California leads the Nation  in electricity prices. California leads the Nation in housing prices.  California leads the Nation in debt and deficits. Just this week, we  learned…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698654/california-is-the-most-popular-state-to-leave"}]