[{"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…for facilitating over $5  trillion of maritime commerce in our waterways. The Coast Guard is also  the sole operator of icebreakers in our polar regions, and they are our  primary force charged with the stopping of pirate fishing from China,  Russia, and other dark fishing fleets that are stealing American  fishing jobs. The issues in the Arctic are…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688520/coast-guard-authorization-act-of-2025"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…deserts, maternal  health deserts, mental health deserts, worker shortages, and more limit  people's access to care, sometimes forcing residents to travel 1 hour  or longer for primary and emergency care.\n\nThese communities that already need help accessing affordable,  quality care now face a growing crisis due to draconian cuts to  Medicaid and the big,…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697097/national-rural-health-month"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…potential closure.  Within the last month, a prominent health provider in the Shenandoah  Valley of Virginia--a rural part of our State--announced that they were  closing three primary care clinics in small Virginia communities  because of the reconciliation bill. The cuts made to Medicaid in the  reconciliation bill made them realize that they could no…", "date": "2025-10-01", "source_url": "https://justfacts.votesmart.org/public-statement/1695967/en-bloc-nominations"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…leadership by making its administrator an  undersecretary within the Department of Commerce. Taking these  important steps will better reflect NTIA's importance as the  President's primary adviser on telecommunications and technology  policy. This bill also includes important provisions to codify NTIA's  current work and responsibilities.\n\nMr. Speaker, I thank…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690254/national-telecommunications-and-information-administration-reauthorization-act-of-2025"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…to you the preservation of the  other.\n\nThese considerations speak a persuasive language to every reflecting  and virtuous mind and exhibit the continuance of the Union as a primary  object of patriotic desire. Is there a doubt whether a common  government can embrace so large a sphere? Let experience solve it. To  listen to mere speculation in such a…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700163/reading-of-washingtons-farewell-address"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…you some crazy  statistics. The United States' total GDP divided by the total amount of  energy that the United States uses, we generate about $200 of GDP per  million Btu of primary energy.\n\nThe United Kingdom generates almost 350 million Btu, almost twice as  much as we generate. The Danes generate over 500. Their economies are  vastly more efficient…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700229/winners-of-the-global-energy-race-are-being-decided"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…students afford the cost  of higher education so that they can focus on their coursework.  Republican changes would force students with disabilities, students  with jobs, and primary caregivers to increase their course load or risk  losing their Pell grant awards.\n\nOver 5,000 students in the district I represent in northern  California receive Pell grants.…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693064/cuts-to-pell-grants"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…Marketplace  Virginia in my State.\n\nThe more people have insurance, the more we know when they need care  they can get it and not go bankrupt. More importantly, they can get  primary care and preventative care so that when they get sick--because  they will--they don't show up in the hospital when it is too late or  more expensive to treat. Also, when more…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696767/stories-from-home-the-human-cost-of-expiring-healthcare-tax-credits"}, {"senator": "Brad Schneider", "party": "Democrat", "sentence": "…with ultrasound machines and  employees wearing lab coats, but the coats are for show, and the  employees are not medical professionals.\n\nMr. Speaker, don't be fooled. The primary purpose of these centers is  to deceive women, and the organizations promoting these centers are the  same organizations advocating for a national abortion ban.\n\nHere is what…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699230/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…Harlem, east Harlem, Washington Heights, Inwood, and the northwest  Bronx, more than  one-half--close to 500,000 of my constituents--are Medicaid recipients.  They receive primary and emergency healthcare. Almost 4 million  residents in New York City, one-half of the city, rely on Medicaid.\n\nMr. Speaker, this discussion that will be held in the middle…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691482/medicaid-and-social-security-cuts"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…that is required daily. Medicaid funding means my son receives the  incontinence supplies he needs, the internal feeding supplies he needs  to live, and medications that his primary insurance won't cover.  Medicaid matters because, without it, my son and millions of others  like him may not survive.''\n\nLet me speak directly to Gwendolyn from Arizona:…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…that President Trump himself voted by  mail in the 2020 election when he cast his ballot in Florida.\n\nIn some States, such as Oregon and Washington, mail-in ballots are  the primary mechanism used by voters. Attempting to illegally strip  States of this right will decimate the way our citizens are heard and  the foundational principle of States' rights.…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696440/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Republicans love to find ways to justify kicking  millions of working people off of healthcare. The chairwoman of the  Rules Committee talked about fraud. If fraud is your primary concern,  how about you start with President Trump, who has pardoned or commuted  not one, not two, but 12 people. He pardoned 12 people convicted of  healthcare fraud. My…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698312/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…their National Guard to reside in the state, and it  is highly likely that every state and territory only appoints residents  as the top official in their National Guard. The primary reason  residency requirements exist is so that government officials have a  connection to the residents they serve and knowledge of the unique  issues and challenges faced…", "date": "2025-07-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694307/introduction-of-the-district-of-columbia-national-guard-commanding-general-residency-act"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…constituents  living in the heart of New York City.\n\nI value Matt's hard work, his impressive skill set, and his  friendship. He has been by my side when I faced the toughest primary  challenge of my career, when we fought together to pass the Respect for  Marriage Act into law--ensuring marriage equality for LGBTQ+ families  across the country, and to…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693380/recognizing-matt-jansen-and-his-service-to-the-house-of-representatives"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "…most: into  lifesaving biomedical research and resilient medical supply chains,  classrooms and training that prepare the next generation for success,  and rural hospitals and primary care to end the chronic disease  epidemic.\n\nThese measures are part of an agreement that keeps the FY26 spending  levels below the level projected under the current continuing…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699576/consolidated-appropriations-act-2026"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…government in China censors content  about domestic drug sales, but leaves export-focused narcotic content  untouched.\n\nWe know that China has historically been and remains the primary  source of fentanyl in global circulation through the production of  these precursor chemicals and outsourcing the final production to  cartel labs in Mexico. That is why…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694828/stop-chinese-fentanyl-act-of-2025"}, {"senator": "Morgan Luttrell", "party": "Republican", "sentence": "…jobs in this  fast-growing field.\n\nUnder her leadership, the SHSU College of Osteopathic Medicine is  making a name for itself in the medical field. Training predominantly  Primary Care Physicians, they will serve throughout Texas and the U.S.  in underserved communities. Since Dr. White coming to the helm, the  medical school secured an investment from…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691515/recognizing-dr-alisa-white-president-of-sam-houston-state-university"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…dozen countries that can sell a 10- year bond cheaper than the United States today, Greece being one of  them.\n\nLet's get into some of the complications. When I say one of the  primary drivers is interest and demographics, remember, if you have $38  trillion--and remember, we play this game. The United States does this.  Other countries don't do this.\n\nHere…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697051/facing-fiscal-reality"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…The simple truth is we  believe in patients going to doctors. We believe in being able to share  costs across Medi-Share, health-sharing ministries, other options,  direct primary care, and getting bureaucrats out of your way.\n\nWe believe in ensuring that you will, in fact, have coverage that you  can actually afford. We do that through the expansive…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697130/congress-is-back"}, {"senator": "Laurel Lee", "party": "Republican", "sentence": "…integrity and security of their elections.\n\nCongress must commit to supporting election officials and voters by  making voting accessible and secure.\n\nWhile States are the primary authority on how elections are conducted  on election day, it is our role here in Congress to ensure that we  support them, provide resources to them, and promote uniformity…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1689997/safeguard-american-voter-eligibility-act"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…United States Representative Martha Roby as her Military Legislative  Counsel. Mac's military and legal background perfectly positioned him  for his role in the office. His primary responsibilities included  serving as the Congresswoman's Veterans affairs, national security, and  foreign policy advisor. Mac was instrumental in creating and managing…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695496/thanking-john-mcintyre-mac-tolar-for-his-dedicated-service-to-our-nation"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…he earned his first star as a deputy program executive  officer at PEO Missiles and Space. His second star came in 2019 when he  took over the PEO role. He is credited as a primary driver for the  modernization and integration of fires within the Army.\n\nHe earned his third and final star in 2022, becoming the director of  the Army's Rapid Capability…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695727/congratulating-lieutenant-general-robert-a-rasch-jr"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…the investor--that  retiree, that person who is desperate for returns so that they can  retire--first, not second, behind social issues that bureaucrats have  decided is the primary goal.\n\nThis amendment requires the Government Accountability Office, the  GAO, to submit a report to Congress comparing brokerage window  investments in the context of defined…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699155/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…member of the  City of Opelika Zoning Board, Member of 100 Black Men of America. Inc.,  Greater Auburn-Opelika Chapter, where he served as All Pro Dad's  Chairperson for Carver Primary School and West Forest Intermediate  School, Longtime coordinator of the Lions Tamers Social and Civic  Club's Family Fun Day/Juneteenth Celebration, Certified Member and…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693602/recognizing-the-birthday-of-wilbert-d-payne-jr"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…prominent criminal gangs in Haiti as       well as the leaders thereof, and describe their criminal       activities including coercive recruitment, and identify their       primary geographic areas of operations;\n\n(2) list Haitian political and economic elites who have       direct links to criminal gangs and any organizations or       entities controlled…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694815/haiti-criminal-collusion-transparency-act-of-2025"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…have the meanings given such terms in section       3452 of this title.\n\n``(2) The term `school certifying official' means an       employee of an educational institution with primary       responsibility for certifying veteran enrollment at the       educational institution.''.       SEC. 6. NOTIFICATION OF SCHOOL CERTIFYING OFFICIALS OF…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699511/veterans-education-and-technical-skills-opportunity-act-of-2025"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…the time when we think about job creators, we think  about Fortune 500 companies, but the fact is, in Texas and across the  Nation, it is our small businesses that are the primary engine of job  creation.\n\nIn the Dallas area, I met with Andy Ellard, the owner and general  manager of Manda Machine Company, a third-generation, family-owned  company in…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690294/texas"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…the Coast Guard, Dave served as the deputy Federal security  director for Minnesota at the Minneapolis-Saint Paul International  Airport. He also played a pivotal role as a primary field leader for  Super Bowl LII.\n\nFrom assistant Federal security director roles to active director  positions, Dave has consistently delivered strong leadership and  results…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698763/recognizing-david-mcmahon"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…State and Oregon, I rise today to warn of the  danger they continue to pose for hunters, farmers, and livestock.\n\nGray wolves can consume up to 7 pounds of meat a day. Their primary  food sources include deer, elk, and cattle. In August 2025 alone, the  Washington Department of Fish and Wildlife reported that three calves  were killed and two injured…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697671/support-for-rural-schools"}]