[{"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…Joseph  Francis Rummel, was relegated to competing in the Louisiana  Interscholastic Athletic and Literary Organization (LIALO) during the  closing era of segregation.\n\nIts principal, Josephite Father Robert Grant, wanted more for his  athletes. He wanted them to compete against the city's other Catholic  schools, who were members of the Louisiana High…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695287/recognizing-the-50th-anniversary-of-an-historic-athletic-achievement-in-the-history-of-the-louisiana-high-school-athletic-association-lhsaa"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…Executive Calendar #132--Justin Overbaugh, of Florida,       to be a Deputy Under Secretary of Defense.\n\n7. Executive Calendar #133--Scott Pappano, of Pennsylvania,       to be Principal Deputy Administrator, National Nuclear       Security Administration.\n\n8. Executive Calendar #135--Michael Cadenazzi, of Rhode       Island, to be an Assistant Secretary…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695711/s-res-377"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…Throughout his career, Cliff pursued continuous improvement through  advanced studies in school administration at both Auburn and Tuskegee  Universities. He served as a teacher and principal at Susie E. Allen  Elementary School and later became the Director of Community Education  for the Phenix City Public Schools, overseeing Head Start and Adult  Education…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688153/in-memory-of-clifford-odell-rutledge"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…Today, NASA maintains that ``there is unequivocal evidence''-- unequivocal evidence--``that Earth is warming at an unprecedented  rate'' and that ``[h]uman activity is the principal cause'' of this  warming. That is what NASA scientists say.\n\nNASA scientists are pretty good. We are driving remotely controlled  vehicles around the surface of Mars that…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698993/unanimous-consent-request-s-res-550"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…to not only be a leader in innovation and  broadband expansion but a central player in securing the Nation's  digital infrastructure against these emerging threats.\n\nAs the principal adviser to the President on telecommunications and  information policy, NTIA must be equipped to identify risks early,  coordinate effectively across agencies, and shape…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693498/ntia-policy-and-cybersecurity-coordination-act"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…entity, which was not created or funded by any law,  without a formal title or office. These actions have been in direct  violation of the Constitution's requirement that principal officers of  the United States must be created by law and their appointees confirmed  by the Senate, and that inferior offices must be created by law with  their appointment…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691079/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…resource regarding all benefits and services furnished by  the Department to survivors and dependents of deceased veterans and  members of the Armed Forces.\n\nOSA also serves as a principal adviser to the Secretary and promotes  the use of VA benefits, programs, and services to survivors. VA moved  the supervision of OSA from the Office of Outreach, Transition…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689686/prioritizing-veterans-survivors-act"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…Master Sergeant Haynes served as the Senior Enlisted Airman for  Space Base Delta 2 at Buckley Space Force Base in my home state of  Colorado. In this crucial role, she was the principal advisor to the  installation commander, overseeing the morale, welfare, training,  climate, readiness, and professional development of over 1,000  personnel. Her leadership…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692495/recognizing-the-service-of-chief-master-sergeant-sharma-j-haynes"}, {"senator": "Eric Swalwell", "party": "Democrat", "sentence": "…generation of  educators to pursue equity, access, and excellence in every classroom.\n\nOver the course of her distinguished career, Superintendent Ahmadi  has served as a teacher, principal, director, assistant superintendent,  and superintendent--holding the latter position for 15 years.  Throughout her journey, she has built inclusive learning environments…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691728/recognizing-parvin-ahmadi"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…or eliminate Iran's nuclear development  capabilities. However, as The Washington Post reported last week, U.S.  intelligence agencies assess that only one of Iran's three principal  nuclear facilities was destroyed by the U.S. attacks. This tells us  that military action is not a reliable way to counter nuclear threats.  In 80 years of the nuclear era,…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694117/risk-of-conflict-with-nuclear-weapons"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…Public Library and president of the Mount Vernon PTA  Council, leads the school as executive director with exceptional  experience and vigor.\n\nJennifer Ciavirella is school principal, leading a talented team of  professionals. We salute Amani Charter Public School on its 15th  anniversary. May there be many more years to come.                   Saluting…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696952/amani-public-charter-school"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…contrary to the whole  flow of human history, and they invested the power to declare war in  the legislative branch, in Congress.\n\nAnd my colleague read Madison's exchange as the principal drafter of  the provision with Jefferson, many years later, about why they had done  it. They wanted, with studied care, to vest the question of war in the  legislative branch.…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696123/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…themselves and the Commonwealth that the town of Randolph has  the talent, commitment, and the tenacity to succeed on and off the  field.\n\nI thank Superintendent Stovell Herndon, Principal Licorish, Head  Coach Jon Marshall, the players, and the entire team for putting  teamwork on display at the highest level.\n\nCongratulations on earning the Division 8 Super…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698836/aca-tax-credits-extension"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…educational needs of  students with limited financial means based on his personal whims about  curricular content. Title I assists 26 million children across the  nation and is a principal tool to address the disparities that impact  marginalized groups, such as Black and brown students. Further, the  Republicans Budget plans seek to dramatically cut education…", "date": "2025-04-21", "source_url": "https://justfacts.votesmart.org/public-statement/1690128/alarm-at-the-trump-administrations-dangerous-attack-on-education"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…in national       stories about the revolution.\n\n``So much focus is put into Massachusetts history, and       Rhode Island gets overlooked,'' said Kathy Abbass, the       principal investigator of the Rhode Island Marine Archaeology       Project, which is working to locate the wreckage of the       Gaspee off the shore of Warwick, R.I. ``Partly that's…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691707/253rd-anniversary-of-the-gaspee-raid"}, {"senator": "James Risch", "party": "Republican", "sentence": "…absorbing this equipment into its armed forces.\n\nThe proposed sale of this equipment and support will not       alter the basic military balance in the region.\n\nThe principal contractor will be BAE Systems, Inc., located       in Falls Church, VA. At this time, the U.S. Government is not       aware of any offset agreement proposed in connection…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688927/arms-sales-notification"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…anniversary, a  proud milestone for an institution dedicated to cultivating excellence  through student engagement.\n\nJames Wood High School, established in 1950 and led by Principal Paul  Beable, became the sole high school serving Frederick County. Prior to  its opening, the county supported five smaller high schools located in  the rural communities…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691575/recognizing-the-75th-anniversary-of-james-wood-high-school"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…McCormick, Schumer, Sullivan, Fetterman, and others for  their partnership on this legislation.\n\nI especially want to recognize the chairman of the Banking Committee,  which has principal jurisdiction over this subject matter, Senator Tim  Scott, and thank him for working with me and cosponsoring this  legislation.\n\nLast but not least, President Trump has…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688824/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Georgia Joint Development Authority.\n\nMr. Harris brings a strong track record of innovation and leadership  in education and community development. Previously, he served as  principal and coordinator of innovation for Walker County Schools,  where he led Gilbert Elementary to national recognition by establishing  Georgia's first public school forest kindergarten…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697167/recognizing-matt-harris"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "…person or entity that received such payment.\n\n``(II) The amount paid to such person or entity.\n\n``(III) The country in which such person or entity resides       or has its principal place of business.\n\n``(IV) A detailed account of the circumstances to justify       such payment.\n\n``(iv) Sunset.--The expenditure authority under clause (i)       shall…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696951/combatting-international-drug-trafficking-and-human-smuggling-partnership-act-of-2025"}, {"senator": "James Risch", "party": "Republican", "sentence": "…difficulty absorbing this equipment into its armed forces.\n\nThe proposed sale of this equipment and support will not       alter the military balance in the region.\n\nThere are no principal contractors involved with this       potential sale. At this time, the U.S. government is not       aware of any offset agreement proposed in connection with       this potential…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697340/arms-sales-notification"}, {"senator": "French Hill", "party": "Republican", "sentence": "…the       Association (including any guaranty by the Association,       whether or not limited in scope) and any securities       guaranteed by the Association as to both principal and       interest shall be deemed to be exempted securities within the       meaning of section 3(a)(2) of the Securities Act of 1933 (15       U.S.C. 77c(a)(2)) and section…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693973/aligning-sec-regulations-for-the-world-banks-international-development-association-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…difficulty absorbing these articles into its armed forces.\n\nThe proposed sale of this equipment and support will not       alter the basic military balance in the region.\n\nThe principal contractor will be Lockheed Martin Missiles       and Fire Control, located in Orlando, FL. At this time, the       U.S. Government is not aware of any offset agreement proposed…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699396/arms-sales-notification"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…Executive Calendar No. 132, Justin Overbaugh, of Florida,       to be a Deputy Under Secretary of Defense\n\nExecutive Calendar No. 133, Scott Pappano, of Pennsylvania,       to be Principal Deputy Administrator, National Nuclear       Security Administration\n\nExecutive Calendar No. 135, Michael Cadenazzi, of Rhode       Island, to be an Assistant Secretary of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695696/authorizing-the-en-bloc-consideration-in-executive-session-of-certain-nominations-on-the-executive-calendar"}, {"senator": "French Hill", "party": "Republican", "sentence": "…subsection (b)(3) prior       to the death of an owner of such housing shall continue to       qualify as affordable housing under this title if--\n\n``(A) the housing is the principal residence of an heir or       beneficiary of the deceased owner, as defined by the       Secretary; and\n\n``(B) the heir or beneficiary, in accordance with terms       established…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…as a result of a more resilient and rapid       repair cycle.\n\nThe proposed sale of this equipment and support will not       alter the military balance in the region.\n\nThe principal contractor(s) will be determined from       approved vendors. At this time, the U.S. Government is not       aware of any offset agreement proposed in connection with…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699891/arms-sales-notification"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…ground maneuver       operations, as well as manned Intelligence, Surveillance, and       Reconnaissance,'' the statement adds.\n\nMoreover, the State Department noted that the ``principal       contractor will be Sierra Nevada Corporation [SNC], located       in Sparks, NV'', adding that at this time, the ``U.S.       Government is not aware of any offset…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693688/department-of-defense-appropriations-act-2026"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…eventually retiring in 1992.\n\nFollowing his military retirement, Lt. Col. Matthews settled in  Mexia, Texas, where he launched a second career in education. He earned  teaching and principal certifications from Tarleton State University.  Beginning in 1994, he taught 7th grade science in Mexia ISD and went on  to become principal at Mexia Intermediate and later…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696269/recognizing-lieutenant-colonel-william-bill-patterson-matthews-usa-retired-with-a-congressional-veteran-commendation"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…students and  staff can thrive.\n\nThis achievement reflects the collective teamwork at Mary Lee Clark  Elementary where everyone works together to ensure student success.\n\nPrincipal Rika Dow has praised Marlon for his unwavering dedication  and innovative approach, making him a model for others to follow.\n\nOn behalf of the community and as his Congressman,…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687985/mourning-the-loss-of-john-reginald-murphy"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "Mr. NUNN of Iowa. Mr. Speaker, I rise today to recognize Mr. Dan  Houston on the occasion of his retirement and to honor his more than 40  years of service at Principal Financial Group. From his first role in  the retirement division to serving as Chairman, President, and Chief  Executive Officer, Dan has exemplified steady leadership, a…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695028/recognizing-the-service-and-leadership-of-dan-houston"}]