[{"senator": "Jacky Rosen", "party": "Democrat", "sentence": "…America. And by stopping it from  passing, you and your Republican colleagues--well, I am afraid you are  telling the American people that their kitchen table isn't your  priority and that Washington Republicans would rather bow to Trump than  pass legislation to lower at least one section of grocery prices and  make food more affordable for their constituents.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698816/9999"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…among us and make it easier for them. That is what we should  be talking about here tonight.\n\nNearly 20 million people are at risk of losing coverage and that  should be our priority. Chuy, myself, and Luis Correa, we call  ourselves the three amigos because we have so much in common, although  I am from New York, he is from Illinois, and Luis is from…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696778/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…joke?\n\nThey are so concerned about China funding our schools. Well, here is  a novel idea. Why don't we have America fund our schools? Why isn't  funding our schools a bigger priority in this Congress? There is a  crazy idea for my Republican friends. If they really care about public  education, let's be the wind at the backs of our teachers and our  schools.…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697303/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…resolution, which is one  of the first steps to eliminating these Trump-induced costs on  households and businesses.\n\nPassage today would signal to Americans that Congress's priority is  their financial well-being, not the well-being of the wealthy, the  well-connected, and Donald Trump's personal pals.\n\nMost importantly, it would start the process of…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696448/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…terrorist groups in the Middle East,  then they should seek new authorization from Congress. If they feel  that military action in the Western Hemisphere is a national security  priority, then they should seek authorization from Congress as well and  let the representatives of the people decide as our Constitution  states.\n\nFourth, this bill continues to embrace…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698005/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…and subgrantees, such as coordinating with political       subdivisions and Tribal governments; targeting engagement       efforts at underrepresented communities; giving priority to       projects based in part on a demonstrated record of and plans       to be in compliance with federal labor and employment laws;       and demonstrating that the Eligible…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698437/us-government-accountability-office-opinion-letter"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…information to better  understand and enhance officer safety.\n\nLaw enforcement officers deserve to return home safely to their  families, knowing their well-being is truly a priority. Federal, State,  local, and Tribal officers face very long hours, immense pressure, and  unpredictable dangers every day. Over time, the constant strain of the  job can take…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691321/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…with a 36- inch culvert? Can we do the bridge over Hartland Road? Or can we make a  change because the bridge over Route 5 is more important to get fixed  and that is the priority?\n\nOne of the problems that our communities had is that the program  managers--those are the people assigned by FEMA to serve communities as  the bridge between the local community…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693402/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…4.8 million Americans. They play a  critical role in regional economies and in maintaining supply chain  resilience.\n\nThere is no doubt that reshoring manufacturing is a top priority. We  all lived through the pandemic and saw the downsides of streamlined  just-in-time supply chains. When it comes to industries critical to our  economic and national security,…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697219/made-in-america-manufacturing-finance-act"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…advocate focuses  on.\n\nNo matter where they are located and no matter who owns them, small  businesses are the backbone of our economy. They should be and are a  bipartisan priority, and this bill is a step in the right direction.\n\nWith the understanding that we will be able to deal with the other  bills that are scheduled to come before us even after…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692757/expanding-access-to-capital-for-rural-job-creators-act"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…Republicans  here in the United States of America. In fact, costs have gone up.\n\nWe believe that America is too expensive, that the cost of living is  too high, and that that is a priority that should be worked on in a  bipartisan way.\n\nFrom the very beginning of this Congress, our Republican colleagues  have shown no interest in addressing the high cost of…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…completely out of touch with the concerns of everyday  Americans. They are out of touch with the manufacturers and out of  touch with the average American.\n\nThe only Republican priority is pleasing President Trump with  whatever he wants. They give in to his every wish, even if it means  driving up utility bills for American families.\n\nMr. Speaker, I urge…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698564/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…bipartisan BURMA Act. I  recently cosigned signed a letter to Secretary Rubio with eight of my  Senate colleagues calling for the Trump administration to make Burma a  diplomatic priority in the coming months.", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697902/burma"}, {"senator": "Scott Peters", "party": "Democrat", "sentence": "…Coronado, Imperial Beach, the  San Diego Regional Chamber of Commerce, San Diego Coastkeeper,  WILDCOAST, and other San Diegans who have made stopping this  catastrophe a top priority.", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692166/international-boundary-and-water-commission-authority"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…credits.\n\nIt is time for us to do something for American families that makes a  difference. Help them pay their health insurance. For goodness' sake,  that should be a high priority not only for the Senate but because it  is a high priority for every family.\n\nI hope we can work on a bipartisan basis to extend these tax credits  and to make sure the American…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697242/the-economy"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "…promotes maritime safety.\n\nIt also establishes a Secretary of the Coast Guard, an important step  in the right direction to ensure that the Coast Guard men and women  remain a priority for many administrations to come.\n\nThe other armed services have this position, and they also do much  better and they have a better track record in getting the assets  necessary…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694193/coast-guard-authorization-act-of-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…education  system in the wrong direction. They have had the wrong policies.\n\nI believe Republicans have generally had the right policies, but the  questions are: What kind of priority are we going to place on those  policies? What kind of priority are we going to give education? What  kind of priority and sense of urgency are we going to bring to the fact…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…operations in Los  Angeles that have been very standard across administrations, Democrat  or Republican.\n\nPresident Obama, after all, carried out millions of deportations, and  the priority has always been to focus on those who have a criminal  record and who pose a risk to the public. That is precisely what ICE  was doing in Los Angeles. Among those targeted…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693143/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…spending. So we have to find a way to reduce our  spending, not only on the discretionary side but on the mandatory side,  so we can fund our Nation's priorities.\n\nAnd our top priority as the Federal Government has to be to defend  and protect the American people and our way of life. But we can do this  without tampering with essential programs like Social…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689668/government-funding"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…strongly support this bill.\n\nMr. COMER. Mr. Speaker, I remind the gentlewoman that we believe on  this side of the aisle that lowering the crime rate is a big issue. It  is a priority for the American people.\n\nThe gentlewoman from New Mexico mentioned the government shutdown. I  would like to remind the gentlewoman from New Mexico that she voted to  shut…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696981/district-of-columbia-cash-bail-reform-act-of-2025"}, {"senator": "Scott Fitzgerald", "party": "Republican", "sentence": "…to make, easy to transport, and so potent. Just a  few milligrams can be lethal.\n\nAddressing the spread of illicit and illegal fentanyl-related  substances has been a top priority not only for myself but for many  other colleagues in this House. It is hard for me to believe what I am  hearing from the minority right now.\n\nOne of the first pieces of…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692348/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…that child with a mental impairment there is no money  to do it and that we have to put the money toward somebody who is not  sure about what sex they are?\n\nIt is just not a priority in the military. The funding should not be  set aside for that. There is a set amount of dollars that have to go  toward this valuable appropriations process, and it is not…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695252/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "James Risch", "party": "Republican", "sentence": "…standoff ranges. The       SDB system employs a smart carriage capable of carrying four       250-lb class guided air-to-surface munitions. It is capable       of destroying high-priority fixed and stationary targets from       Air Force fighters and bombers in internal bays or on       external hard-points. SDB increases aircraft loadout,       decreases the…", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697584/arms-sales-notification"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…benefit from the ability to       recruit students with this expertise from their other school       experiences.\n\n(9) Mathematical modeling has been a strong educational       priority globally, especially in China, where participation       in United States mathematical modeling challenges in high       school and higher education is orders of magnitude…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688976/mathematical-and-statistical-modeling-education-act"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…Rico closes.\n\nMr. GARBARINO. Madam Speaker, I yield myself the balance of my time.\n\nAs the chairman of the Homeland Security Committee, preventing  another 9/11 is my top priority.\n\nBeing a Member from New York, I congratulate my colleague on his  authorship and sponsorship of H.R. 2261. I urge all of my colleagues to  support it, and I yield back the…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696751/strengthening-oversight-of-dhs-intelligence-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…and supporting endangered species. The park's success has  significantly contributed to Madison's economy by attracting tourists  from across the Nation.\n\nAccessibility is a priority with wheelchair-friendly amenities  ensuring all guests can fully enjoy the experience. TIME highlights  Georgia's commitment to preserving natural wonders while promoting…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689617/commending-jekyll-island-club-resort-and-sea-island"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…preferred method of communication  in this day and age.\n\nMr. Speaker, I thank Chairman Smith for his leadership and for making  tax administration and improved efficiencies a priority within the Ways  and Means Committee.\n\nMr. Speaker, I also thank my bipartisan co-leads on this bill,  Representatives DelBene, Feenstra, Schneider, Fitzpatrick, and Panetta.…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689375/electronic-filing-and-payment-fairness-act"}, {"senator": "Paul Gosar", "party": "Republican", "sentence": "…demand as we were hit by a heat wave.  Luckily, Arizona did not have a blackout, but we must meet the growing  needs for electricity.\n\nMr. Speaker, this has been a legacy priority of mine since 2015. In  2019, the House passed the first allotment of this land for the county,  and now my bill conveys the remaining acres to provide the maximum  benefit…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693918/la-paz-county-solar-energy-and-job-creation-act"}, {"senator": "Todd Young", "party": "Republican", "sentence": "…and  transmission get built faster. That is what we should do. Let's not  write off active megawatts and then act surprised when bills rise and  lights flicker.\n\nSo if your priority is reliability and protecting American families  from price spikes, the choice is clear: Keep what works today so we can  build what we need for tomorrow.\n\nI urge my colleagues…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695511/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-emissions-budget-and-allowance-allocations-for-indiana-under-the-revised-cross-state-air-pollution"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…Speaker, I move to suspend the rules and pass the  bill (H.R. 659) to amend title 38, United States Code, to direct the  Chairman of the Board of Veterans' Appeals to give priority to  individuals with certain professional experience in recommending such  individuals to serve as members of the Board of Veterans' Appeals, and  for other purposes.\n\nThe…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699210/veterans-law-judge-experience-act-of-2025"}]