[{"senator": "Joe Neguse", "party": "Democrat", "sentence": "…some  point, but my colleague from Minnesota I think said the word ``Biden''  eight times, if I am not mistaken.\n\nMr. Speaker, if you couple that with references to the prior  administration, then that jumps up to 12 or 13.\n\nIt is unclear to me when Republicans are going to stop complaining  and actually do something to address the challenges that face…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694889/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "Mr. Speaker, I thank my colleagues, Representatives Latimer, Alford,  and Mfume, for their work on this important legislation.\n\nMr. Speaker, prior to this administration, government contracts  provided small businesses with stability and predictability. The  government was considered a reliable partner that could be trusted to  keep…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691759/transparency-and-predictability-in-small-business-opportunities-act"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…university. I will never run away from that. I will never  run away from that.\n\nWe can check the record, but we are proud of the fact that over the  last few years prior to this administration, there has been historic  investment in Hispanic-Serving Institutions, historically Black  colleges and universities, and higher education.\n\nThat is part of who…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…not up for  debate.\n\nThe problem is that Republicans have decided to disapprove, to use  this blunt instrument of this particular allotment, or rather access  that the prior administration as was noted, included in this resource  management plan. We have no idea how a Federal court is going to  construe the actions of the Congress as it relates to the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694899/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…resolutions to reverse the  disastrous Biden administration's policies, and I urge my colleagues to  join me in supporting these resolutions today.\n\nMr. Speaker, the prior administration was the most antimining, anti- oil and gas administration in the history of this country. I was just  up in the great State of Alaska. In the national refuge, they are…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694892/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…Getting to this issue today, I think it is so important, and  Congressman Barr has put it perfectly. This is consumer protection.  This is fair competition because the prior administration's OCC rule  burdened businesses with excessive red tape, particularly targeting  small banks and limited beneficial mergers.\n\nReversing this rule allows for essential…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691497/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…law ensures that a substantially similar bad  rule can never be reintroduced in the future without scrutiny.\n\nWe obviously know that there are bad regulators from the prior  administration that prevented healthy mergers that would have prevented  bank failures. There is no guarantee that we are not going to have an  equally bad regulator in the future.…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691498/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…previous administration.\n\nAs our filing made clear: ``The amended RMP is not only unlawful and  unwise but it is also emblematic of everything that was wrong with the  prior administration's approach to cooperative federalism.''\n\nAmen. That is exactly why we are here.\n\nThe truth is because of the checkerboard nature of Federal land and  minerals across…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694907/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…compliance cost for businesses in the United  States is about $3 trillion per year. As has been mentioned, about $1.8  trillion of that was added in just the 4 years of the prior  administration. To put that in context, the entire Federal budget is  about $7 trillion per year.\n\nDo you know what the difference is between a tax and a regulatory  command, Mr.…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697331/small-business-regulatory-reduction-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Mr. Speaker, what is ironic is the fact that Secretary Burgum, when  he was the Governor of North Dakota, vehemently opposed this resource  management plan, but the prior administration just brushed him off.  They didn't care what he thought or what the people of North Dakota  thought, just like they didn't care what the Governor of Montana  thought,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694908/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…electricity. There are also hardworking families  in my Commonwealth of Kentucky who work in the coal industry and have  been really hurt by the policies that came out of the prior  administration.\n\nThis has been reinstated by the Trump Presidency. This ensures a  future President can't again undo what we experienced in the last 4  years. That is the difference…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695764/national-coal-council-reestablishment-act"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…rather than supporting an all-of- the-above energy strategy, Mr. Speaker, the Biden administration sought  to stop traditional forms of energy like oil and gas.\n\nPrior to the Biden administration's rule, oil and gas companies were  only required to complete these reports when BOEM, the Bureau of Ocean  Energy Management, had a reason to believe an archeological…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688634/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…strike  while the iron is hot.\n\nSo far, in the House, we have used that tool to propose undoing 15  new regulations that were adopted in  roughly the last 6 months of the prior administration. Of those 15 that  we have approved here, 3 have been signed into law by the President. We  have done three. Another six have been approved by the Senate and are  currently…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690784/big-beautiful-bill"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…the damage done by the last administration, and he is going to remove  many, many of these people. One has to remember, the reason he is  removing them is because the prior administration, with a lot of  encouragement from people on the other side of the aisle, were bringing  people here who were coming here on false pretenses.\n\nThe next issue we have…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689603/diversity-equity-and-inclusion"}, {"senator": "Mike Simpson", "party": "Republican", "sentence": "…need to pass this bill that efficiently invests in our priorities,  supports the programs our communities care about, and reduces the  bureaucratic overreach of the prior administration. This bill does just  that, and it makes sensible cuts across 28 bureaus and agencies and  closing one agency that has completed its mission.\n\nThoughtful cuts were made…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698758/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…that if they just talk about enough other things long enough, the clock  will run out and that the American people will forget the disaster that  the policies of the prior administration created not just on our border  but throughout our communities in this country for the prior 4 years.\n\nThey are mistaken. We are not going to forget. We are not going…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695358/stop-illegal-entry-act-of-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…these risks to privacy or surveillance. Let's stick with the  approach of private-sector solutions.\n\nWe have already seen small glimpses of this possibility under the  prior administration. The chair of the House Financial Services  Subcommittee for Oversight and Investigations,  Dan Meuser of  Pennsylvania, has been having a robust discussion about the…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693731/anti-cbdc-surveillance-state-act"}]