[{"senator": "Peter Welch", "party": "Democrat", "sentence": "…I have mentioned to  reduce the chance of a catastrophic mistake or miscalculation resulting  in the use of nuclear weapons should be among our highest national  security priorities.", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699676/the-new-start-treaty"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…Republican Members to save healthcare for  millions and millions of Americans and save food assistance for  millions more.\n\nI think it is clear, Mr. Speaker, the difference in priorities  between this side of the aisle and the other side. It is the Members on  this side of the aisle that are fighting to save healthcare for the  American people, and it is…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691513/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…provide  real opportunities for fellow Americans.\n\nI think it is time that all of us in this Chamber take a moment to  reflect about what we are doing here and what our true priorities are.\n\nMr. Speaker, I thank you for the opportunity to elevate this  important issue. I thank my colleagues who have added their voice to  this issue. I hope that as the Senate…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691770/151-days-without-a-vote-to-lower-costs"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…benefits, and this means Social  Security plays a huge role economically in northwestern Ohio's economy.\n\nStanding up for our region and our seniors is one of my highest  priorities in Congress, and that is why last year, when Social Security  celebrated its 90th birthday, I introduced a resolution to demonstrate  continued support from Congress for…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699878/protecting-social-security"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…into the new job. She was with me last  night, and she had to sit here and listen, along with me--and I had  spent the day with her--to Donald Trump saying one of their top  priorities is to fight childhood cancer, and she got sacked on that  Valentine's Day massacre.\n\nNow they want to censure the gentleman from Texas. Why? Because he  challenged the President…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688507/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…Americans will be poorer. They  will be sicker because my Republican colleagues  are falling in line instead of standing up for their people back home.\n\nThis bill shows us their priorities, and it is not the American  people. They are taking away Americans' healthcare to give more money  to the very wealthy. This bill is for billionaires and not for  Americans.", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693172/one-big-beautiful-bill-act"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…times as much to renovate our  office building as we were spending a year to save the lives of  thousands and thousands of children suffering from malnutrition. What  kind of priorities are those?\n\nHere is the thing: The good news is that Trump administration  officials, including Secretary Rubio, have said over and over that they  are going to restore funding…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692267/calling-on-trump-administration-to-restore-food-aid"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…unique talent of being able to quickly learn the names of everyone  in her meetings.\n\nSupported by her afternoon Diet Cokes, Alison assisted with many of  my key legislative priorities over the past few years. She worked  diligently to support the implementation of my Pregnant Workers  Fairness Act, working to ensure it was protected in the appropriations…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695684/recognizing-alison-cohen-and-her-service-to-the-us-house-of-representatives"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…for  countless Legislative Staffers.\n\nAndrew has been a leader on transportation issues in my office,  staffing me on the Committee and advancing critical infrastructure  priorities such as the Cross Harbor Rail Project and the Gateway  Tunnel, helping ensure that New York City remains the public transit  capital of the world. He led our efforts to establish…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698824/recognizing-andrew-heineman-and-his-service-to-the-united-states-house-of-representatives"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…immensely from this important work.\n\nFounder Joseph Newton Pew and his wife, Mary Anderson Pew initially  focused their philanthropic work on anonymously providing grants to  priorities such as cancer research, the Red Cross, and a pioneering  project to assist historically Black colleges. Over the years, this  institution has evolved into a much more expansive…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695547/recognizing-the-pew-charitable-trusts"}, {"senator": "Ilhan Omar", "party": "Democrat", "sentence": "…roof safety, and  training.\n\nEven respiratory and chemical safety standards in hazardous  workplaces are being rolled back.\n\nThese changes represent a fundamental shift in priorities, putting  corporate convenience over worker safety. Eliminating all of these  rules is a clear signal from the Trump administration that they view  workers' lives as expendable.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695573/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…disapproval  resolution 10 months into the Trump Presidency, laser focused on  passing resolutions of disapproval of agency actions by the Biden  administration--real sense of priorities. It is disappointing, Mr.  Speaker, deeply disappointing.\n\nIf one digs into this particular resource management plan, I think  you will find that using this blunt instrument,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694909/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…connects individuals with the service and long-term  support that they need.\n\nThe safety and prosperity of communities in the San Fernando Valley  are among my most critical priorities. I am working with stakeholders  and leaders across my district to ensure that all people feel safe and  welcome in my district.\n\nMr. Speaker, I am proud to bring these resources…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699916/funding-for-los-angeles"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…constituents, to give tax breaks to those who need them the       least.\n\nSo in addition to health care, we are not just talking       about Democratic environmental priorities. We are talking       about cutting funding for programs that will impact districts       across the country, and that is why everyone should support       this amendment…", "date": "2025-07-09", "source_url": "https://justfacts.votesmart.org/public-statement/1693322/greenhouse-gas-reduction-fund"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…Sergeant Parker Gordon Fox  Suicide Prevention Grant Program, or Fox grants, for fiscal year 2026.\n\nAs the ranking member of the Veterans' Affairs Committee, one of my  top priorities has been and will continue to be veteran suicide  prevention. The Fox grant program is an important tool in our arsenal  for this work.\n\nCommunity-based programs are a crucial…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691508/no-wrong-door-for-veterans-act"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…Senate's passage of the Protection of Women and Girls  in Sports Act, a bill that simply ensures fairness and common sense in  athletics. Instead, Senate Democrats made their priorities clear. Mr.  Speaker, 45 Senate Democrats voted against protecting women's sports,  45 Senate Democrats voted against keeping women's spaces safe, and 45  Democrats voted…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688462/america-deserves-president-trump"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…to fund government  through the end of January with three appropriations bills, which we  worked through regular order, to keep spending relatively flat. It  advances the priorities the American people sent us here to advance, to  back up the President who is securing the border, which he was sent to  Washington to do; to restore military to focusing…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696681/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…a farm bill that reflects the realities on  the ground is vitally important, and I will continue pushing for a  fiscally conservative, 5-year farm bill that reflects the priorities of  our producers who feed, fuel, and clothe the world.\n\nWhile real wages are rising and inflation is nearing a 5-year low,  there is more to be done to lower costs for families…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698651/following-through-on-americans-priorities"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…of school choice in  many areas that would compel improvements in traditional school  districts as well.\n\nThis is really a moment when we need to ask ourselves what our  priorities are because in general--this isn't true of all of them--the  Biden administration and Democratic majorities have moved our education  system in the wrong direction. They…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…Critical Mineral Dominance Act.\n\nFor decades, domestic mineral producers have operated in a       regulatory environment marked by uncertainty, as permitting       priorities and interpretations have changed between       administrations. This lack of consistency disincentivizes       long-term capital investment and discourages development…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699694/critical-mineral-dominance-act"}, {"senator": "Mark Amodei", "party": "Republican", "sentence": "…consideration today  furthers this administration's goals of undoing the damage caused by  the previous administration, starting with the border. This funds the  President's priorities, codifies reductions and efficiencies, and  operationalizes border security and immigration enforcement investments  in the reconciliation process.\n\nMr. Speaker, let's start…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699349/department-of-homeland-security-appropriations-act-2026"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…and supports businesses of all sizes. Their work is helping to  build a community where Ohioans can achieve the American Dream.\n\nEconomic development remains one of my top priorities in Congress,  and I look forward to continuing to work with the Clermont County  Chamber on projects that make a difference in southern Ohio.\n\nMr. Speaker, I congratulate…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699834/recognizing-carl-and-nancy-schneider"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…signature. There are many different players across  both the House and the Senate, and they have to come together to make  this happen.\n\nOf course, we all have different priorities, but our main priority  ought to be the welfare and the training and the equipment of our men  and women in the military and their ability to protect all of us. But  we can't…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697555/china"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…Riley has excelled in these roles and has been a key player in  helping me establish the Congressional FFA Caucus, craft sound food and  farm policy, and fight for Kansas priorities in the next farm bill.  Those who know Riley know that that just scratches the surface of who  he is.\n\nRiley is an incredible friend, a loyal advocate and mentor for his…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688493/america-is-back"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…for our servicemembers, and ensures America remains prepared  to deter aggression and protect our interests around the world. This  legislation also directly reflects the priorities set forth in  President Trump's executive order on prioritizing military excellence  and readiness, which reaffirmed America's commitment to the military  superiority necessary…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697636/public-lands-military-readiness-act-of-2025"}, {"senator": "Andy Harris", "party": "Republican", "sentence": "…Administration, and  Related Agencies Appropriations Act.\n\nRepublicans have effectively locked in disciplined, flat spending  levels while supporting the Trump administration's policy priorities.\n\nThe Agriculture bill provides $26.65 billion in discretionary  spending, which is level with the current amounts while also including  community project funding.\n\nThis…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696739/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…members on the Transportation  Committee on both sides of the aisle.\n\nOver the years, he has played an integral role in shepherding through  Congress numerous major legislative priorities to improve America's  transportation network and build our infrastructure. This includes: the  FAA Reauthorization Act of 2024 and other important aviation safety  legislation;…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692224/designating-the-house-press-gallery-in-the-united-states-capitol-as-the-frederick-douglass-press-gallery"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…their ability to invest in expanding, growing, and hiring more people.  It has the same effect as taking another dollar of tax out of their  pocket to pay not for their priorities, their community's priorities,  or their employees' priorities, but for the government's priorities.  That is true whether it is a dollar taken out of their pockets  collected…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690784/big-beautiful-bill"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "…process that  emphasizes transparency, accountability, and timely consideration.\n\nThe Labor-HHS bill before us demonstrates the will of the American  people who want new priorities and accountability in government,  including priorities to Make America Healthy Again and Make America  Skilled Again.\n\nInvestments in this bill are directed to where they…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699576/consolidated-appropriations-act-2026"}, {"senator": "Markwayne Mullin", "party": "Republican", "sentence": "…to try  an experimental drug that may extend their life 1 week, 1 day, or may  even cure it, and you are willing to take that away from the family  because you have other priorities, because you want to hold it hostage  so you can try to do something with community healthcare centers?\n\nI support community healthcare centers. I want them. They are  important…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698335/9999"}]