[{"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…about  people, and this bill, as currently written, does not prioritize the  needs of our people. Instead, it is laced with ideological provisions  drawn from Project 2025, prioritizing political ambition over the well- being of those who have dedicated their lives to serving this country.\n\nLet me be clear. Healthcare for veterans should not be an ideological…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692954/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…in the  watershed of the Boundary Waters. It is known as the most toxic  industry in America, and it has never been done in Minnesota before.\n\nThe Republican majority is prioritizing the interests of an  international Chilean mining conglomerate that has no interest or stake  in the economy or well-being of Minnesotans.\n\nThey will extract our resources.…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691611/boundary-waters-canoe-area-wilderness"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "…administration has  continually lied about what they are going to do on immigration.  According to a CBS poll, a majority of Americans believe that the Trump  administration is not prioritizing the removal of dangerous criminals  and public safety threats, and nearly 60 percent disapprove of how the  Trump administration is using immigration detention facilities.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695359/stop-illegal-entry-act-of-2025"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…resources currently available to  our officers, there is still so much more that we can and should be  doing to ensure their wellness and, most definitely, their safety.\n\nBy prioritizing data-driven approaches to officer safety and  wellness, we can address systemic risks, reduce preventable tragedies,  and build a stronger, more resilient law enforcement…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691321/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…country, and canceled enough renewable energy. As we know, renewable  energy is cheap. It is clean. It helps American families.\n\nPeople would think that Republicans would be prioritizing legislation  to address affordability, but that is not the case. Look at what is  happening here today. Right now, this bill that we have before us is a  retread from last…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700165/dont-mess-with-my-home-appliances-act"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…detention, about half of them have criminal records. That is 300,000  people who are detained and who do not have criminal records at all.\n\nThis administration is not actually prioritizing the most dangerous  people, even though President Trump promised on the campaign trail that  that is exactly what he would do.\n\nMr. Homan also said that this administration…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693662/weaponization-of-ice"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…the  largest regional airport in Virginia and ranked in the top 25 percent  of busiest general aviation airports, it oversaw over 100,000 flights  in 2024. In addition to prioritizing the safety of all flights moving  through the airport, Manassas Tower is committed to providing  mentorship and professional development for all its staff. Their  impeccable…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697601/recognizing-manassas-regional-airports-air-traffic-control"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…Thousands were fired without cause. Our adversaries couldn't  be happier, and they may be profiting from those mistakes right now.\n\nThese cuts come at a time when we are prioritizing--we in the U.S.  Senate--funding to expand our nuclear triad and to counter China's  growing nuclear capabilities. These workforce reductions undermine our  goals across…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691398/motion-to-discharge-s-res-195"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…nuclear testing, to  shrink bloated stockpiles, and to prioritize communication over  conflict.\n\nYet today we are close to forgetting that profound blessing. Instead  of prioritizing deescalation, we see a resurgence of the same Cold War  mindset that once pushed us to the brink of annihilation. We see  hawkish perspectives pushing the U.S., Russia,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699035/expiration-of-new-start"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…time  an individual is booked into a jail or prison. This means nothing is  preventing ICE from picking up individuals when they are released from  custody.\n\nBut instead of prioritizing picking up the dangerous, violent  criminals they talk so much about, what is ICE doing instead? They are  out roving streets in communities across the country and arresting…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700066/9999"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…H.R. 5214 would also override the will of DC voters and       increase costs to DC residents. DC's current risk-based pre-      trial detention system has been effectively prioritizing       safety since 1992; if the current system begins failing       District residents, DC's democratically elected       representatives are well-positioned to respond.…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696958/opposition-letter-led-by-tzedek-dc-on-the-district-of-columbia-cash-bail-reform-act-of-2025-hr-november-2025"}, {"senator": "Lori Trahan", "party": "Democrat", "sentence": "…Republicans in  Congress don't have real solutions. Rather than addressing the issues  that matter, like lowering grocery costs and helping families get  ahead, they are prioritizing a bill that disenfranchises millions of  American women.\n\nRoughly 69 million women, about 25 percent of eligible voters in our  country, have IDs that do not match their…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689394/gop-creating-chaos-in-electoral-system"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…promised that he would lower costs  for American families on day one. He promised to cap interest rates on  credit cards at 10 percent, and so what is it that the Senate is  prioritizing today? Making it easier for banks to merge, raising the  cost of credit for small businesses and households, and eroding banking  services in local communities.\n\nThis resolution…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690769/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…Criminal Justice, but in 2019 the first Trump administration handed a  contract to a private prison company to convert it into an ICE  detention center. Today, instead of prioritizing dangerous criminals,  those who commit rape, murder, or trafficking drugs, people who pose  real threats to our communities, ICE is filling this facility with  people who…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695521/visit-to-bluebonnet-detention-facility"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…fossil coal plants. So it  is no surprise that in 2024, 94 percent of the new energy on the grid  came from renewables, from harnessing the power of the sun and the  wind.\n\nPrioritizing expensive fossil fuels over cheap renewables drives up  the price of energy that families pay on their bills every month. That  is Trumpflation.\n\nExporting more fossil fuels…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688159/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…the North Slope Inupiat.\n\nWhile our leaders over fifty years ago were initially wary       of any development on our lands, our Inupiaq leaders have       spent decades prioritizing open communication and       transparency in planning with industry. We have exercised       true self-determination through a unique framework of Alaska       Native governance--a…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696449/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…It overturns a 2022 Biden administration rule that increased  manufactured housing costs, again, without regard for what consumers  want or how the market actually works prioritizing energy efficiency  under the Green New Deal and directly contributing to the housing  affordability issues we see today.\n\nThe objective here is clarity so manufacturers…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698637/providing-for-consideration-of-hr-saving-homeowners-from-overregulation-with-exceptional-rinsing-act-providing-for-consideration-of-hr-affordable-housing-over-mandating-efficiency-standards-act-and-providing-for-consideration-of-hr-commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Byron Donalds", "party": "Republican", "sentence": "…dystopia.\n\nI will remind my colleagues on the other side of the aisle that some  of their colleagues have been victimized by the crime here in  Washington, D.C. Rather than prioritizing the safety of law-abiding  citizens and protecting the lives of innocent residents and visitors,  District officials have actively facilitated dysfunction and chaos  through…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695561/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Mario Diaz-Balart", "party": "Republican", "sentence": "…counter-fentanyl and synthetic drug  programs to stop these deadly poisons from crossing our borders and  coming to the United States.\n\nIt puts American businesses first, prioritizing diplomatic engagement  to favorably resolve commercial disputes, disputes abroad, some of them  that have been going on for years, to promote American business and  American…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699051/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…approval. I respect the  administration's views on this legislation and its commitment to fiscal  responsibility. President Trump's record demonstrates a commitment to  prioritizing unleashing abundant water supplies across the West.\n\nMr. WESTERMAN.  Boebert), the lead sponsor of this legislation.\n\nMr. WESTERMAN. Mr. Speaker, I respect the administration's…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698703/finish-the-arkansas-valley-conduit-act-veto-message-from-the-president-of-the-united-states"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…and, in turn, our national security, all while providing the best  and most effective return on taxpayer dollars.\n\nWe cannot afford to put our food security at risk by not prioritizing  adequate investments in animal health research when we pass the next  iteration of the farm bill. I urge this body to get this right.", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693761/getting-animal-health-research-right-in-farm-bill"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…working with  President Trump and the U.S. Department of Agriculture as we continue  to support the American farmer by bringing down costs, securing new  trade deals, and prioritizing American crop production.    Honoring Franklin County Board of Commissioners and Agricultural Land                             Preservation Board\n\nMr. JOYCE of Pennsylvania.…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698173/lowering-healthcare-costs-for-all-americans"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…from Middle Eastern  countries and go by our laws and assimilate with our culture, but if  you come here otherwise, it is time to go home.\n\nThe Trump administration is also prioritizing the deportation of  Afghans who are already here illegally. You know, I am 100 percent  behind President Trump's effort to get rid of all Islamists who hate  our country,…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697927/immigration"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…enacted by the Senate and House of Representatives of       the United States of America in Congress assembled,       SECTION 1. SHORT TITLE.\n\nThis Act may be cited as the ``Prioritizing Veterans'       Survivors Act''.            SEC. 2. CLARIFICATION OF ORGANIZATION OF THE OFFICE OF                     SURVIVORS ASSISTANCE OF THE DEPARTMENT OF…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689687/prioritizing-veterans-survivors-act"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…then his Chief of Staff. Following Congressman  Herger's retirement, Derek served as Chief of Staff to Representative  Brad Wenstrup of Ohio. As Chief, Derek was known for prioritizing  first-in-class constituent services, a focus he has maintained  throughout his career in the House.\n\nAfter a short time off the Hill, Derek returned to the House as the…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696851/thanking-derek-harley-for-his-service-to-the-house"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…being approved by this body by Memorial Day.\n\nThe legislation that committees are marking up this week and next is  going  to usher in the new golden age of America by prioritizing a  revolutionary, conservative agenda that will improve the efficiency of  government and finally get a handle on runaway spending that has gone  unchecked for far too long.…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690786/big-beautiful-bill"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…not by building condition,  security, or even the need for more space for current judges, but by  the court's projection of future judges. The court's own methodology  for prioritizing the need for a new courthouse, for example,  relegated security concerns to just 10 percent of a weighted formula,  but in contrast courtrooms and chambers account for 50…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695378/courthouse-affordability-and-space-efficiency-act-of-2025"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…Department in 1992, and he  has faithfully served our community  for 32 years. Marshal Lacey was instrumental in helping protect our  community through his leadership in prioritizing structure and  vegetation management, as he established a nationally renowned wildfire  mitigation program.\n\nMarshal Lacey was onsite and led the efforts to combat the Waldo…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689254/recognizing-the-retirement-of-colorado-springs-fire-marshal-brett-lacey"}, {"senator": "Chuck Fleischmann", "party": "Republican", "sentence": "…unleash American energy  dominance.\n\nThe bill delivers strong support for our national defense and  provides $25.4 billion for the National Nuclear Security  Administration, prioritizing the continued modernization of the nuclear  weapons stockpile and the United States Navy nuclear fleet.\n\nThe bill strengthens our Nation's energy security by advancing…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698750/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Gary Palmer", "party": "Republican", "sentence": "…While making a speech  last week, the Secretary of Energy, Chris Wright, even mentioned how  absurd this rule is.\n\nMr. Speaker, in conclusion, H.J. Res. 20 is essential for  prioritizing consumer choice, protecting natural gas appliances,  keeping prices affordable, and undoing the damage inflicted on the  American people by the Biden-Harris administration…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688292/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters"}]