[{"senator": "Lou Correa", "party": "Democrat", "sentence": "…Anne School.\n\nShe served as a teacher for 31 years and principal for 19 years at  Saint Genevieve and Saint Anne School. She also worked to improve the  lives of incarcerated prisoners at the California Institute for Women  in Chino, California. She also co-directed the Get on the Bus program  that connected children with their incarcerated parents.\n\nMr.…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693061/recognizing-sister-teresa-lynch"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…Donald Trump and Secretary Noem, policies that are  ripping families apart, wasting taxpayer dollars, and making our  communities less safe.\n\nBluebonnet was built to house prisoners under the Texas Department of  Criminal Justice, but in 2019 the first Trump administration handed a  contract to a private prison company to convert it into an ICE  detention…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695521/visit-to-bluebonnet-detention-facility"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…people to a  nation where our actions have set off a new wave of oppression.\n\nIn Venezuela, that means pushing for an end to that repression. It  means the release of political prisoners, including journalists and  civil society leaders. It means freedom of expression and freedom of  the press. We must also ensure that Venezuela's future is decided by  Venezuelans.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698765/venezuela"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…The State Department's 2023 Human Rights Report highlights troubling  allegations regarding the Government of the People's Republic of China  forcibly harvesting organs from prisoners of conscience, including  religious and spiritual adherents.\n\nMr. Speaker, I worry deeply about the administration's proposed State  Department reorganization plans that…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690629/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…sworn to uphold the Constitution, sworn to obey the  laws of armed conflict. That dedication is to ensure that when our  personnel are disabled in the water, when they are prisoners of war,  they are treated with the legal requirements of the Geneva Convention  and of other legal constraints. If we kill people with impunity, how  can we object to the…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697387/caribbean-boat-strike"}, {"senator": "Brad Schneider", "party": "Democrat", "sentence": "…smuggler       betrayed her, and she was arrested. She was then sent to       Drancy, an infamous rail juncture and holding town just north       of Paris. From there, its prisoners were transported to       concentration or death camps.\n\nGrandmother and I stayed hidden in my mother's apartment       for a year, never leaving for fear of being arrested…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690804/rose-helene-spreiregen"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "Ms. PRESSLEY. Mr. Speaker, I thank Ranking Member Garcia for  yielding.\n\nMr. Speaker, I rise in strong opposition to this legislation. This  bill seeks to create 14-year-old prisoners in the adult criminal legal  system. We know this approach doesn't improve public safety. It only  traumatizes our babies. History tells us as much.\n\nAntron McCray, 15 years…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695594/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…protested for over 150 consecutive days and  are still protesting today, especially on Sundays. They are calling for  free and fair elections and the release of political prisoners.\n\nThe United States has long supported freedom in Georgia and now is no  different. The MEGOBARI Act is an expression of that support.\n\nAs ranking member of the Helsinki…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690701/mobilizing-and-enhancing-georgias-options-for-building-accountability-resilience-and-independence-act"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…prison during his twenties. Yet Frank has  always been an organizer and educator.\n\nFrank taught himself law and launched a movement to desegregate the  prison, where Black prisoners had faced brutal and inhumane treatment.  The bars in prison didn't break him or limit his spirit. On the  contrary, it propelled him to fight for the liberation of those…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698984/recognizing-frank-chapman"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…forcible harvesting of organs, a  grave violation of human rights and bodily autonomy. The PRC has been  accused of forcibly harvesting organs from victims who range from  prisoners of conscience, including religious and spiritual adherents,  to ethnic minorities. Shining a spotlight on these crimes and the  people that perpetrate them while advancing…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690646/falun-gong-protection-act"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…to  CECOT.\n\nI was of the opinion that a congressional delegation needed to  urgently go to CECOT in El Salvador and check on the health and well- being of all the political prisoners who we have sent to that heinous  place.\n\nMy Republican colleagues disagreed, and Chairman Mark Green said that  my official request to conduct oversight in my capacity as…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692932/holding-power-accountable"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…political reasons. They  ought to be removed from that list. He banned travel and blocked  remittances. He has cut off our ability to negotiate for the release of  political prisoners. He continues to insist on sanctions to  economically starve the country. We should instead lift the embargo. By  closing off American engagement, he has opened the door…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692909/do-not-forget-the-crisis-in-cuba"}, {"senator": "Maria Salazar", "party": "Republican", "sentence": "…many people on this floor who  have seen the horrors of communism. They have been to Cuba. They have  been friends with Fidel Castro. They have seen the jails full of Cuban  prisoners. They have seen people preparing rafts to die in the middle  of the ocean, eaten by sharks.\n\nThere are many people in the Democratic Party who have witnessed that  and have…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697160/denouncing-the-horrors-of-socialism"}, {"senator": "Mike Crapo", "party": "Republican", "sentence": "Mr. CRAPO. Mr. President, in acknowledgement of National POW/MIA  Recognition Day this September 19, 2025, I honor Idaho's and all of  America's prisoners of war, POWs, and missing in action, MIA, as I  extend my support and gratitude to their loved ones.\n\nIn February, the Defense POW/MIA Accounting Agency, DPAA, the Agency…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695075/national-powmia-recognition-day"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…remember the 150,000 who were wounded in battle and  bear the visible scars of post-traumatic stress and Agent Orange  exposure. We remember those who faced brutal captivity as prisoners of  war, and the 1,200 servicemembers still missing in action from Vietnam.\n\nMr. Speaker, we may never be able to repay our debt to those who have  given the last measure…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689202/saluting-vietnam-veterans"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…in accordance with the Universal Declaration of  Human Rights: disbanding all agencies in charge of censorship and  inquisition, and seeking justice for massacred political prisoners,  prohibition of torture, and the abolishment of the death penalty.\n\nFour of the 10-point plan, separation of religion and state, and  freedom of religions and faiths.\n\nFive,…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697723/free-iran"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…women and children, and sent them to Siberia.\n\nDuring Stalin's rule, more than 220,000 innocent people were deported  to cold Siberia. This doesn't even include political prisoners sent to  the gulag camps.\n\nThis day is observed by those Baltic countries of Estonia, Latvia,  and Lithuania by lighting candles in the memory of these deportees.\n\nThe reason…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689062/russia"}, {"senator": "French Hill", "party": "Republican", "sentence": "…River in  North Little Rock.\n\nDuring World War II, the Balao-class submarine completed five war  patrols in the Pacific, sinking multiple Japanese vessels, capturing  enemy prisoners, and rescuing downed American airmen, even being  present in the Tokyo Bay for the Japanese surrender.\n\nBy the time she was decommissioned in 1970 the Razorback had earned…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694812/marking-80th-anniversary-of-v-j-day"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…required under       subsection (a) shall include--\n\n(1) a summary of de jure and de facto policies toward organ       transplantation in the PRC, including with respect to       prisoners of conscience (including Falun Gong) and other       prisoners;\n\n(2)(A) the number of organ transplants that are known to       occur or are estimated to occur on an annual…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690648/falun-gong-protection-act"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…2021 coup, nearly 3  million Burmese have been driven from their homes; more than 75,000  people have been killed; and the military has swept up more than 30,000  political prisoners into detention, silencing those who oppose them.\n\nThe Burmese military has left a trail of devastation, damaging or  destroying at least 343 Christian churches and numerous…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699832/bringing-real-accountability-via-enforcement-in-burma-act"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…Venezuela  today know what we expect of them: Stop the drug trafficking and the  weapons trafficking. Accept the return of their refugees and migrants.  Release political prisoners. Expel the Iranians, the Cubans, the  Islamic terrorists, like Hezbollah operatives, who have turned  Venezuela into a launching pad for regional instability and threats…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698556/venezuela"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…acknowledged their authority were sinners, that it was  their right and duty to make war upon them wherever they could be found  and, to make slaves of all they could take as prisoners, and that every  Musselman''--Muslim--``who should be slain in battle was sure to go to  paradise.'' That is Jefferson, 1786.\n\nOur Founders knew that sharia law was not consistent…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698106/bringing-america-back-to-its-roots"}, {"senator": "French Hill", "party": "Republican", "sentence": "…churches, have  limited representation in government, and, tragically, have been  targets of violence and persecution. They are attacked in the streets,  held as political prisoners, and have little recourse.\n\nThe discrimination they face not only violates their basic human  rights, but also undermines Egypt's rich cultural diversity and  history, as…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698914/warmth-of-collectivism"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…of Uyghurs and other minority communities       in the XUAR;\n\n(7) the Government of the People's Republic of China should       immediately and unconditionally release all prisoners that       have been detained for their ethnic, cultural, religious, and       linguistic identities, for expressing their political or       religious beliefs in the XUAR,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694799/uyghur-policy-act-of-2025"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…human rights atrocities of our time. It is amazing that  we have to speak about this. It is the State-sponsored, forced  harvesting of human organs.\n\nInnocent people, often prisoners of conscience, are being killed so  that their vital organs can be removed and sold. This is a billion- dollar black market built on murder. It is a direct assault on every…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690630/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…relentless Chinese pressure, and that  deserves our deepest commendation.\n\nOur alliance with the Philippines is rooted in shared sacrifice.  During World War II, U.S. and Filipino prisoners of war endured the  horrors of the Bataan Death March, and, together, we fought to liberate  the islands from Japanese occupation.\n\nGeneral MacArthur's famous return symbolized…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694962/national-defense-authorization-act-for-fiscal-year-2026"}]