[{"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "When the Federal, State, and local governments work together with the  private sector, our research hospitals, the nonprofit community, when  we work together to identify the reasons for the disparities and put  policies in place that address them, people's lives are saved.", "title": "Health Disparities in Minority Communities", "date": "2025-04-28"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "Last week, he announced that the administration is sending $20  billion in bailout money to Argentina and perhaps another $20 billion  in private funding.", "title": "Trump Administration", "date": "2025-10-21"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "We also noticed that the DOGE effort of Elon Musk, who apparently  fortunately has returned most of his attention to his private  businesses, not only illegally cut millions of dollars from U.S.", "title": "Agricultural Risk Review Act of 2025", "date": "2025-06-23"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "the liberty of a  democracy is not safe if the people tolerate the growth of private  power to a point where it becomes stronger than the democratic state  itself.''\n\nHouse Democrats recognize the fierce urgency of this warning.", "title": "Citizens United 16th Anniversary", "date": "2026-01-21"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "We do when our insurance premiums go up or when the price of care goes  up to recover the cost from private insurers.", "title": "Better is Possible", "date": null}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "This weekend, I was struck by the images of President Trump's private  meeting with President Zelenskyy at the Vatican, which took place as  the world mourned the passing of Pope Francis.", "title": "Supporting Ukraine's Independence", "date": "2025-04-28"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "Cal Poly SLO consistently ranks higher year after year in the top 500  public and private not-for-profit universities in the United States,  coming in 55th place just last year.", "title": "Recognizing the California Polytechnic State University, San Luis Obispo", "date": "2026-02-05"}, {"senator": "John Larson", "party": "Democrat", "sentence": "Speaker, as you know--and it has to be as much a concern to you  as it is to me--having more than 127,000 Social Security recipients in  your district whose information is private and secure, is being  rummaged through by twentysomethings who have no accountability, have  never been vetted, and who will not come before Congress.", "title": "Accountability for Doge", "date": null}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "And, of course, at the last minute, the anti-choice radicals snuck in  a new provision, penalizing enrollees in private plans on ACA exchanges  covering reproductive care.", "title": "Budget Reconciliation", "date": "2025-05-22"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "This crisis that has been precipitated  has led to the fact that every single American--everyone watching,  everyone listening--is either facing losing their health insurance or  paying more, and that includes people on private, employer-provided  insurance.", "title": "Continuing Appropriations and Extensions Act, 2026", "date": "2025-11-10"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "Let's improve SNAP benefits, support public-private partnerships to  make healthier choices possible, build a healthier and more resilient  Nation, and finally end hunger now.", "title": "End Hunger Now with Innovative Ways to Feed Hungry People", "date": "2025-04-01"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "Every day for the last 6 weeks, we have heard horror stories of mass  firings across the Federal Government, funding freezes, and Elon Musk  and his minions having access to every American's private, personal  financial and healthcare information.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the Department of Energy Relating to ``Energy Conservation Program for Appliance Standards: Certification Requirements, Labeling Requirements, and Enforcement Provisions for Certain Consumer Products and Commercial Equipment''", "date": "2025-03-05"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "It is deeply regrettable that this misguided legislation will not  only strip away these healthcare benefits, but it also increases  private healthcare costs and reduces services for everyone.", "title": "Opposing Medicaid Cuts", "date": "2025-06-03"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "Earlier this week in the Rules Committee, we heard Republicans  claim that we need to weaken oversight of private crypto because doing  so will help cross-border payments.", "title": "Anti-Cbdc Surveillance State Act", "date": "2025-07-17"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "It just means you might get paid by private  insurance 30 percent, you might get paid by Medicaid 45 percent, you  might have a little VA, and you might have a little private pay; it  adds up to 100 percent.", "title": "One Big Beautiful Bill Act", "date": "2025-07-14"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "Oscar John  Jefferson Upham was a private serving in the United States Marine Corps  during the Boxer Rebellion and Spanish-American War, ultimately earning  the Medal of Honor for his service in Peking, China, in the summer of  1900.", "title": "Oscar J. Upham Post Office", "date": "2025-12-09"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "These groups use social media or other popular platforms such as  Roblox or Discord to elicit private information or sexual images from  minors, and they use that information and that material to blackmail  victims into mutilating themselves or taking other violent action  against friends, family members, or pets.", "title": "Coercion and Sexual Abuse Free Environment Act", "date": "2026-01-12"}, {"senator": "Laurel Lee", "party": "Republican", "sentence": "Sextortion is a form of exploitation that occurs when  someone threatens to distribute another person's private, sensitive  material unless that person complies with a demand for additional  sexual content, sexual favors, or money.", "title": "Combating Online Predators Act", "date": "2026-01-12"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "In addition to her  legal education, she has already engaged in a range of professional  roles, including legal research, legislative policy, and campaign work  in both the private and public sectors.", "title": "Recognizing the Graduation of Carter Forrest", "date": "2025-05-21"}, {"senator": "Mike Johnson", "party": "Republican", "sentence": "The Congress-Bundestag/Bundesrat Exchange is highly regarded in  Germany and the United States and is one of several exchange programs  sponsored by public and private institutions in the United States and  Germany to foster better understanding of the politics and policies of  both countries.", "title": "Announcement of the 2026 Congress-Bundestag/Bundesrat Exchange", "date": "2026-02-04"}, {"senator": "Thomas Massie", "party": "Republican", "sentence": "It is a solemn reminder of the  human cost of war and our obligation, not the obligation of a single  executive or a private circle of special interests, to decide when to  go to war.", "title": "Removal of the Use of United States Forces for Hostilities Within or Against Venezuela", "date": "2026-01-22"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "One-half of the equation is the Educational Choice for Children Act  which will expand private school choice to 2 million kids and has been  included in the text of the reconciliation bill.", "title": "Universal School Choice", "date": "2025-05-14"}, {"senator": "Ashley Moody", "party": "Republican", "sentence": "He served from 1944  to 1945 as a private in the U.S.", "title": "-9999", "date": "2026-02-12"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "I am confident that my colleagues share this sentiment and can agree  that no American, whether elected official or private citizen, should  live in fear of being targeted for their beliefs, their vote, or their  service.", "title": "Condemning the Attacks on Minnesota Lawmakers in Brooklyn Park and Champlin, Minnesota, and Calling for Unity and the Rejection of Political Violence in Minnesota and Across the United States", "date": "2025-06-24"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "This bill empowers parents with scholarships for tutoring, private  and parochial schools, and special needs, keeping the Federal  Government out of the way.", "title": "Delivering on Educational Freedom", "date": "2025-06-25"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "I was just watching a commercial on TV yesterday where the Cookie  Monster was actually doing an advertisement for Netflix because a  private company is paying money to run ``Sesame Street.'' It is not  going away.", "title": "Rescissions Act of 2025", "date": "2025-06-12"}, {"senator": "Victoria Spartz", "party": "Republican", "sentence": "Private First Class  Bradley was honorably discharged from the U.S.", "title": "Congratulating Mr. Bronice Odell Bradley", "date": "2025-03-27"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "It causes private healthcare costs to go up.", "title": "Outrageous Government-Funded Incentives", "date": "2025-05-06"}, {"senator": "French Hill", "party": "Republican", "sentence": "Contains private-sector mandate?", "title": "Improving Access to Small Business Information Act", "date": "2025-07-21"}]