[{"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "These cuts mean the closure of rural hospitals in Arizona,  job losses in our healthcare sector, higher healthcare costs for those  with private insurance, and the overall stress to an already stretched  thin healthcare system.", "title": "Protecting Healthcare for Millions of Americans", "date": "2026-01-08"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "Private insurance companies are now buying up your local healthcare  clinics and doctors' offices.", "title": "Economic Populism", "date": "2025-03-25"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "She requires       constant supervision, behavioral support, and medical care       beyond what private insurance covers.", "title": "H. Con. Res. 14", "date": "2025-04-03"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "It just means you might get paid by private  insurance 30 percent, you might get paid by Medicaid 45 percent, you  might have a little VA, and you might have a little private pay; it  adds up to 100 percent.", "title": "One Big Beautiful Bill Act", "date": "2025-07-14"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "Because of the drastic cuts that are made to healthcare in this one  big, ugly bill, people with private insurance all across America are  going to experience increases in their premiums, co-pays, and  deductibles.", "title": "One Big Beautiful Bill Act", "date": "2025-07-02"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "Even if you are on private insurance, monthly costs are estimated to  rise across the board by 21 percent in Washington because of the  overall strain on our system.", "title": "Protecting Healthcare for Millions of Americans", "date": "2026-01-08"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "Even if you are not on Medicaid,  as I think about my patients with private insurance, they are going to  be waiting in that emergency department line, too.", "title": "Gop Tax Scam Hurts Everyone", "date": "2025-05-20"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "So to every American watching, whether you are on healthcare.gov or  you are on private insurance, if you are getting those letters, if you  are getting those notifications of an increase of your bill of $200,  $500, $800 starting January 1, my peers on the other side of the aisle  are the ones--you should lay it at their feet because they have put us  in this place.", "title": "Continuing Appropriations and Extensions Act, 2026", "date": "2025-11-10"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "That will increase premiums and costs for every single  American, even those with private insurance, those who are not on  Medicaid.", "title": "Medicaid is A Lifeline", "date": "2025-05-06"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "Without Medicaid  reimbursement, hospitals, clinics, doctors' offices, and urgent care  centers will close, leaving even those with private insurance without  access to healthcare.", "title": "Republican Tax Cuts", "date": "2025-05-05"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "I am very grateful that I had the ability to have private insurance,  group insurance, where I could pay for all of my healthcare and didn't  have to sit there and worry about how I was paying the bills while I  was getting healthy and well.", "title": "Medical Bills Are Too High", "date": "2025-12-01"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "She writes to me that ``Our private insurance is not enough to cover  our son's complex medical needs.", "title": "Privileges of the Floor", "date": "2025-03-31"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "Sitting in the Energy and  Commerce Committee, I heard the rationale for this was that everybody  needs to have skin in the game, and if I pay a copay with my private  insurance, then why can't the expansion population pay a copay?", "title": "Raising Awareness About Men's Health", "date": "2025-06-09"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "This bill would require private insurance  companies to plan to cover preventive prostate cancer screening for men  at high risk, including African Americans and those with a family  history of the disease.", "title": "Raising Awareness About Men's Health", "date": "2025-06-09"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "And, now, Michiganders on the other side of the ledger--those who  have private insurance--are starting to feel the heat, because if you  cut those other programs, if you cut Medicaid and Obamacare--and maybe  you say to yourself: Well, I am not on Medicaid.", "title": "Healthcare", "date": null}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "It is actually very difficult, in some cases, if you  are on private insurance to get a doctor's appointment in California.", "title": "California's Disastrous Policies", "date": "2025-05-08"}]