[{"senator": "Ron Wyden", "party": "Democrat", "sentence": "…law that almost every one of them voted for  just a few years ago. How times change.\n\nLet me talk about Mr. Bell's supposed qualifications. Once in a  while, I get called a privacy hawk, and I never consider that an  insult. I have worked for decades, often with my Republican colleagues,  to safeguard the privacy of Oregonians and all Americans. I have…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697900/9999"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…administration that is  trying to systematically dismantle it. It will protect benefits. It  will stop the privatization of benefits. It will stop staffing cuts and  closures, protect privacy and data, and protect the proud men and women  who go to work every day to serve our seniors at the Social Security  Administration.\n\nMr. Speaker, these are the American people's…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694191/hands-off-our-social-security"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…disposal.\n\nThat is why this resolution of inquiry is necessary to demand an  investigation into what DOGE and Elon Musk are doing with our data, how  it is impacting American privacy, and how it is impacting our national  security. We will not back down until we get those answers.\n\nMr. Speaker, I humbly say to the Members of this House: We demand  answers,…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689400/demanding-answers"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…nonexistent.\n\nThis type of national voter roll collection is totally unprecedented  in our history. Nothing like it has ever been done before. Nothing like  this invasion of privacy and promises to voters would have been  imaginable before January of this year.\n\nThe information he is requesting includes your driver's license  number, your Social Security…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696440/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…has aggravated this problem in, literally,  just recent weeks. On June 19, 2025, a Trump-appointed Federal judge  struck down a Biden administration rule that strengthened privacy  protections for information related to productive healthcare, such as  abortion and gender-affirming care.\n\nOn March 5, 2025, President Trump announced his administration…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692840/9999"}, {"senator": "Sara Jacobs", "party": "Democrat", "sentence": "…they are in a war against the idea that the  American life is something that includes all of us, that we can all  belong.\n\nTheir proposed facilities ban is a huge violation of privacy and  would make all women and girls less safe. Will Republicans require  menstrual monitoring, checking reproductive organs, as has happened, as  my colleague pointed out?…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695241/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…banks, credit cards, debit  cards, Zelle, Venmo, cash, money market funds, and pursuant to the bill  that it looks like we are going to pass today, they will have  stablecoin, a privacy device specifically designed for criminals and  tax evaders. Then they will have mixers to make it impossible for even  the most advanced law enforcement, even with a warrant,…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693738/anti-cbdc-surveillance-state-act"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…Security bills that are under consideration today, this bill does not  fix the crisis that this Trump administration has inflicted on Social  Security when it comes to data privacy and customer service. Thumb  drives went into our central data computers by DOGE employees, people  who had not been confirmed by any Senate or anything else, and our  Social…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697187/improving-social-securitys-service-to-victims-of-identity-theft-act"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…harmful  to minors.\n\nBy the way, with all the crocodile tears coming down from my  colleagues on the other side about their concern for children, I have  had a children's online privacy protection act pending here in the  Senate for years that gives total privacy protection to children under  the age of 17 in our Nation, and we can't get it passed.\n\nWhy can't…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690803/addressing-the-homework-gap-through-the-e-rate-program"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "I rise in support of H.R. 2808, the Homebuyers Privacy Protection  Act, and I commend Representatives Rose and Torres for introducing it.  I thank the sponsors for their good work on this bipartisan bill, and I  appreciate that…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692804/homebuyers-privacy-protection-act"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…himself to evade oversight. He was able to help place key personnel in  agencies that now are looking to benefit his companies financially.\n\nMr. Speaker, going back to the data privacy point, Elon Musk and DOGE  have allegedly used Musk's AI chatbot, Grok, within Federal agencies.  This model has likely been trained on nonpublic data by incompetent  DOGE…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692038/consequences-of-doge"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…California. Mr. Speaker, I thank the gentlewoman for  yielding.\n\nMr. Speaker, I rise today in opposition to this legislation that  prioritizes a partisan agenda over the health, privacy, and autonomy of  women.\n\nMost of these so-called pregnancy centers are not licensed medical  clinics. What does that mean? It means they can and often do share  women's private…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699226/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…or details that have been shared to support this claim. This  claim reportedly came from DOGE, which immediately sets off alarm bells  given the well-documented issues with privacy and accuracy since its  inception.\n\nIt is also troublesome that Republicans are blindly relying on the  SBA Administrator's word. At our committee hearing the day before…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692125/american-entrepreneurs-first-act-of-2025"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…bill is really another missed opportunity. The protections that  are most urgently needed are not these new guardrails, but guardrails  to protect our inalienable right to privacy.\n\nThrough the Privacy Act and other means, this Congress has long set  limits on what the government can and cannot do with intimate details  that it collects about each American.…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698920/ending-improper-payments-to-deceased-people-act"}, {"senator": "Laura Gillen", "party": "Democrat", "sentence": "…Secretary Duffy publicly  committed to implement this law and help save lives.\n\nMr. Chair, I am happy to work with the gentlemen on the other side  who are concerned about privacy. Together, we can implement technology  that addresses their privacy concerns.", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699283/amendment-no-1-offered-by-mr-massie"}, {"senator": "Josh Hawley", "party": "Republican", "sentence": "…soliciting her for various sexual acts. It caused him to  ask himself: What are we doing at these tech companies? Is there no  amount of decency? Is there no respect for the basic privacy and  security of our children? Our children are not safe online.\n\nAnd I also want to say that this bill is based on another important  principle, a simple one, which is that…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697735/9999"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…to our Nation.\n\nThe decision was not rooted in the text of the Constitution. Instead,  the Court invented a constitutional right grounded in a vague,  undefined concept of privacy that the Court itself struggled to  explain.\n\nRoe silenced voters, sidelined legislatures, and eroded respect for  the judiciary by turning judges into policymakers. Worst…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699374/roe-v-wade-anniversary"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…should not be there, either.\n\nHowever, despite these warnings, Covered California proceeded. I  believe this raises a serious issue under HIPAA, a law designed to  protect the privacy of individuals' personal health information.\n\nI have written to Secretary of Health and Human Services, Robert F.  Kennedy, Jr., to ask for an investigation into what happened…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690562/gas-prices-are-lower-for-everyone-except-californians"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…grant of remote, electronic access to hospital electronic       health records of potential donors by organ procurement       organizations, in a manner that complies with the privacy       regulations promulgated under the Health Insurance       Portability and Accountability Act of 1996, at part 160 of       title 45, Code of Federal Regulations, and…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697276/mikaela-naylon-give-kids-a-chance-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…intelligence companies.\n\n(C) Financial institutions.\n\n(D) Institutions or organizations engaged in research.\n\n(E) Institutions or organizations focused on individual       privacy and civil liberties.\n\n(4) Such additional individuals as the Secretary of the       Treasury may appoint as necessary to accomplish the duties       described under subsection…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693963/financial-technology-protection-act-of-2025"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…track, monitor, and mitigate threats posed by UAS       operated by malign actors at or near the borders.\n\n6. The guidance, policies, and procedures that address the       privacy, civil rights, and civil liberties of persons who       lawfully operate UAS at or near the borders.\n\n7. Current authorities of the United States Government to       counter…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698262/explanatory-statement-for-the-intelligence-authorization-act-for-fiscal-year-2026"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…the Chinese Communist Party thinks CBDC is a good idea, I think  that tells us exactly how we should vote, against CBDC.\n\nThese bills promote free market innovation, protect privacy, and  ensure the next generation of finance is built on American values, not  Federal overreach.\n\nMr. Speaker, I urge my colleagues to support this legislation.", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693545/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…reduce redundancy, and ensure       compliance and coordination with other laws, including--\n\n(A) section 552a of title 5, United States Code (commonly       referred to as the Privacy Act of 1974), and subchapter II of       chapter 35 of title 44, United States Code;\n\n(B) the Federal Risk and Authorization Management Program       established under section…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697679/epermit-act"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…professional standing       of an individual, or otherwise to expose an individual to       public contempt or obloquy, or will represent a clearly       unwarranted invasion of privacy of an individual;\n\n(4) will disclose the identity of any informer or law       enforcement agent or will disclose any information relating       to the investigation or prosecution…", "date": "2025-03-12", "source_url": "https://justfacts.votesmart.org/public-statement/1688786/joint-committee-of-congress-on-the-library-rules-of-procedure"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…payment rails.\n\nAs the United States grapples with modernizing our own payment  systems, we are confronted with a choice. Do we empower free-market  solutions that protect privacy and protect individual liberty, or do we  centralize control over payments in the hands of the Federal  Government?\n\nMr. Speaker, the choice is clear to me. Federal Reserve…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693734/anti-cbdc-surveillance-state-act"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…AI models work, how businesses can identify  tasks that AI can effectively perform, and the best practices for  coordinating with third-party providers and protecting data privacy.\n\nMadam Speaker, I thank my colleague, Representative Scholten, for co- leading this legislation with me. The AI-WISE Act will ensure small  businesses have the information…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699207/artificial-intelligence-wisdom-for-innovative-small-enterprises-act"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…well-regulated stablecoin market eliminates any  justification for a government controlled Central Bank Digital  Currency, or CBDC, which jeopardizes Americans' access to freedom,  privacy, and apolitical private capital.\n\nThis is an important point for all of my colleagues on my side of the  aisle who share my concern and opposition to a CBDC. If you want to…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693841/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…discrediting, or punishing you  based on your personal behavior, and restricting that behavior with the  tap of a button. Nothing could be more inimical to the liberty and  privacy on which American greatness depends.\n\nMr. Speaker, I am proud to be a sponsor of this critical legislation  and look forward to its passage on the House floor today.", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693728/anti-cbdc-surveillance-state-act"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…seize my personal phone and my official  phone when I was Senate Judiciary chairman? What did I do?\n\nThere was an order issued that said if I was notified of this breach  of my privacy, I am likely to intimidate witnesses or destroy evidence.  Based on what?\n\nThere are 10 of us involved here. What did we do to justify having  Jack Smith issue a subpoena…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697058/unanimous-consent-requests"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…coordinate transparent, consensus-based,       multistakeholder processes to create guidance for and to       support the development and implementation of cybersecurity       and privacy policies with respect to the internet and other       communications networks;\n\n``(D) promote increased collaboration between security       researchers and providers of communications…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693497/ntia-policy-and-cybersecurity-coordination-act"}]