[{"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…creator with certain inalienable rights: life,  liberty, and the pursuit of happiness. Life is number one.\n\nWhen the Federal, State, and local governments work together with the  private sector, our research hospitals, the nonprofit community, when  we work together to identify the reasons for the disparities and put  policies in place that address them, people's…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690243/health-disparities-in-minority-communities"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…simply fails to find them  worthy.\n\nLast week, he announced that the administration is sending $20  billion in bailout money to Argentina and perhaps another $20 billion  in private funding. What he is doing in tariffs has been eclipsed by  all the other stuff, but it hits Americans in their pocketbooks.  Groceries are skyrocketing in price. Americans…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696345/trump-administration"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…nutrition to families that might otherwise  go hungry.\n\nWe also noticed that the DOGE effort of Elon Musk, who apparently  fortunately has returned most of his attention to his private  businesses, not only illegally cut millions of dollars from U.S.  Department of Agriculture activities but would deprive the Department  of Agriculture with the expertise…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692798/agricultural-risk-review-act-of-2025"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…In a 1938 address to Congress, President Franklin  D. Roosevelt issued a stark warning: `` . . . the liberty of a  democracy is not safe if the people tolerate the growth of private  power to a point where it becomes stronger than the democratic state  itself.''\n\nHouse Democrats recognize the fierce urgency of this warning. At the  request of Leader Hakeem…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699248/citizens-united-16th-anniversary"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…to treat them. It will be uncompensated care. Guess who pays for that?  We do when our insurance premiums go up or when the price of care goes  up to recover the cost from private insurers.\n\nAll of these jobs that are lost, that is also employer-provided  health insurance. That is even more uninsured.\n\nMy colleagues on the Energy and Commerce Committee…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695041/better-is-possible"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…Putin's will by ceding their  sovereign territory is beyond disgraceful. It is disgusting, and it is  un-American.\n\nThis weekend, I was struck by the images of President Trump's private  meeting with President Zelenskyy at the Vatican, which took place as  the world mourned the passing of Pope Francis. Pope Francis was a  global leader of humility, of empathy,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690214/supporting-ukraines-independence"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…as one of the top public  universities, not only in California, but in the entire Nation.\n\nCal Poly SLO consistently ranks higher year after year in the top 500  public and private not-for-profit universities in the United States,  coming in 55th place just last year. In the state of California, Cal  Poly SLO has continued to climb, ranking 12th overall…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699776/recognizing-the-california-polytechnic-state-university-san-luis-obispo"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…Speaker, as you know--and it has to be as much a concern to you  as it is to me--having more than 127,000 Social Security recipients in  your district whose information is private and secure, is being  rummaged through by twentysomethings who have no accountability, have  never been vetted, and who will not come before Congress.\n\nI asked Chairman Estes…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695514/accountability-for-doge"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…Republicans are prioritizing a repeal on tanning bed taxes.\n\nAnd, of course, at the last minute, the anti-choice radicals snuck in  a new provision, penalizing enrollees in private plans on ACA exchanges  covering reproductive care. Defunding Planned Parenthood wasn't enough.  The radicals got their pitchforks and added a provision to effectively  ban…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691671/budget-reconciliation"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…to the fact that every single American--everyone watching,  everyone listening--is either facing losing their health insurance or  paying more, and that includes people on private, employer-provided  insurance.\n\nWhen we take a step back and we look at all the people that are going  to fall off healthcare, all the healthy young people that are not going…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696657/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…make  it a little bit easier for families in need to make healthier choices,  while also supporting local jobs and agriculture.\n\nLet's improve SNAP benefits, support public-private partnerships to  make healthier choices possible, build a healthier and more resilient  Nation, and finally end hunger now.", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689401/end-hunger-now-with-innovative-ways-to-feed-hungry-people"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…last 6 weeks, we have heard horror stories of mass  firings across the Federal Government, funding freezes, and Elon Musk  and his minions having access to every American's private, personal  financial and healthcare information. This is what I hear about when I  go home. The list goes on. Now, there is a looming government shutdown  next week.\n\nRather…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688549/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…individuals with  disabilities, and children.\n\nIt is deeply regrettable that this misguided legislation will not  only strip away these healthcare benefits, but it also increases  private healthcare costs and reduces services for everyone.\n\nTake Jake, a high school student who uses a wheelchair. He relies on  a Medicaid waiver for school support and depends…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691781/opposing-medicaid-cuts"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…cross-border transactions every year if a wholesale CBDC is  adopted. Earlier this week in the Rules Committee, we heard Republicans  claim that we need to weaken oversight of private crypto because doing  so will help cross-border payments.\n\nI ask my colleagues across the aisle: Why should we abandon any  research into making the greenback ready for the…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693736/anti-cbdc-surveillance-state-act"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…revenue stream for really all hospitals but especially rural hospitals.  It can be up to about half of the payer mix.\n\nWhat is a payer mix? It just means you might get paid by private  insurance 30 percent, you might get paid by Medicaid 45 percent, you  might have a little VA, and you might have a little private pay; it  adds up to 100 percent. As you…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693485/one-big-beautiful-bill-act"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…Upham Post Office''.\n\nMr. Speaker, I rise in support of this bill, which would rename a  post office in Guthrie, Oklahoma, for Oscar J. Upham. Oscar John  Jefferson Upham was a private serving in the United States Marine Corps  during the Boxer Rebellion and Spanish-American War, ultimately earning  the Medal of Honor for his service in Peking, China, in…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697638/oscar-j-upham-post-office"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…acts of violence against themselves, against others, and  even against animals.\n\nThese groups use social media or other popular platforms such as  Roblox or Discord to elicit private information or sexual images from  minors, and they use that information and that material to blackmail  victims into mutilating themselves or taking other violent action…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698880/coercion-and-sexual-abuse-free-environment-act"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…people.\n\nI do not know why, if we think it is the Federal Government's  business to provide housing to people--which, of course, it is not--we  would set up a system in which a private developer gets such a large  chunk of money that the Federal Government is laying out.\n\nRight now, as a matter of fact, the money is so great, even though  new projects are…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690921/big-beautiful-bill"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "Ms. HAGEMAN. Mr. Speaker, I rise today in support of H.R. 6019.\n\nIncluded in the Senate amendment to H.R. 5371 was a section providing  for a private right of action for those Senators who were targeted by  the Biden administration to access their cell phone data.\n\nI support repealing this particular provision, not because…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696923/repeal-of-senate-notification-requirements-relating-to-legal-process-on-disclosures-of-senate-data"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…leadership in 6G technology is critical for both our  economic and national security.\n\nThis bill would direct the FCC to establish a 6G Task Force made up  of both public and private-sector participants to develop a report on  the standards development process and possible uses of sixth-generation  technology. This task force will ensure that the United…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690229/future-uses-of-technology-upholding-reliable-and-enhanced-networks-act"}, {"senator": "Mike Johnson", "party": "Republican", "sentence": "…delegation.\n\nThe Congress-Bundestag/Bundesrat Exchange is highly regarded in  Germany and the United States and is one of several exchange programs  sponsored by public and private institutions in the United States and  Germany to foster better understanding of the politics and policies of  both countries. This exchange is funded by the U.S. Department…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699719/announcement-of-the-2026-congress-bundestagbundesrat-exchange"}, {"senator": "William Timmons", "party": "Republican", "sentence": "…supervisory training, including how to effectively  manage employees with unacceptable performance.\n\nThese are basic, nonpartisan concepts that are generally available to  private-sector business supervisors and, if implemented, would advance  the interests of good government and strengthen the Federal workforce  on behalf of the American taxpayer.…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698216/federal-supervisor-education-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…agencies, public benefit programs, public       health programs, and other public programs as a result of the       financial exploitation of senior citizens;\n\n(C) incurred by the private sector as a result of the       financial exploitation of senior citizens; and\n\n(D) any other relevant costs that--\n\n(i) result from the financial exploitation of senior…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693935/national-senior-investor-initiative-act-of-2025"}, {"senator": "Ashley Moody", "party": "Republican", "sentence": "…Honoring their service while they are still with  us is both a privilege and a responsibility.\n\nWhen his country called, Duane Brewton answered. He served from 1944  to 1945 as a private in the U.S. Army during the Second World War. He  was stationed in Vire, France, where he was wounded in the line of duty  and later returned home.\n\nFor his sacrifice, he…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700061/9999"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…State, here are a few suggestions:\n\nRepeal AB 5, which has effectively banned independent contracting in  our State and has put countless freelancers out of work.\n\nOverturn the Private Attorneys General Act, PAGA, which is the bane  of many small businesses' existence and accounts for the nonexistence  of many that have been forced to close because of the…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689211/protecting-medicaid-for-californians"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…legacy. I want that same legacy and opportunity for my  17 grandkids and millions of schoolkids across the country.\n\nThis bill empowers parents with scholarships for tutoring, private  and parochial schools, and special needs, keeping the Federal  Government out of the way.\n\nMr. Speaker, school choice funds students, not systems. Let's pass  the one big,…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692895/delivering-on-educational-freedom"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…Street'' is somehow going to go away.\n\nI was just watching a commercial on TV yesterday where the Cookie  Monster was actually doing an advertisement for Netflix because a  private company is paying money to run ``Sesame Street.'' It is not  going away. It is doing just fine. It is very lucrative.\n\nWhat will go away is some of the far-left radical views…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692544/rescissions-act-of-2025"}, {"senator": "James Risch", "party": "Republican", "sentence": "…members of the staff shall not accept public speaking       engagements or write for publication in the field of foreign       relations.\n\n(2) The staff shall not discuss their private conversations       with members of the committee without specific advance       permission from the Senator or Senators concerned.\n\n(3) The staff shall not discuss with anyone…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691700/us-senate-committee-on-foreign-relations-rules-of-procedure"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…to traffic cops not writing enough tickets, we all have to prove our  worth. It's real life.\n\n``I've had friends and colleagues over the years,'' he adds,  ``working in the private sector, who actually had to reapply for their  own jobs and then get interviewed by outside human resource  professionals in order to try and keep their positions. Many didn't.''…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688492/demanding-transparency-efficiency-and-accountability-from-our-government-is-not-extreme"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…District. Now, it is written very carefully and in  very close cooperation to make sure there is no eminent domain for the  Federal Government; there is no Federal takeover;  private property rights are all protected. But it puts a recognition in  this area that it is a Federal designation, just a recognition, no  property is taken over, but to say: We…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691662/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}]