[{"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…with all due haste, and, somehow, time  and time again, the money never reaches the people who need it most.\n\nSo if I were a farmer, I wouldn't count on this money. It is probably  more of Donald Trump's big talk without really delivering. That is what  has happened over and over again.\n\nSecond, a one-time payment for farmers is cold comfort for all…", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697574/department-of-defense"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…Ms. DeLAURO. Mr. Speaker, I have the greatest honor to yield 2  minutes to the gentlewoman from California (Ms. Pelosi), the  distinguished Speaker Emerita and, I might add, probably the epitome of  the best Speaker that  this Nation has ever had, in addition to which millions of Americans  have healthcare coverage through the Affordable Care Act because…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696741/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…massive Mission Control for a  U.S. space launch. Video screens, hundreds of employees, and a full  color, smiling portrait of former President and oil man George Bush  Senior--probably 5 feet by 6 feet plastered on the wall of the secure  entryway. So, another U.S. President also from Texas supported another  crude, dirty oil kingdom war in the complex Middle…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698837/reflecting-on-impact-of-illegal-action-in-venezuela"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…bill was going to be, I didn't have to worry about it.\n\nIf I didn't have health insurance, I would have been forced to wait  until Wednesday to go to the clinic, and his hand probably would have  been infected.\n\nAfter a 3-hour ambulance ride, a week in the burn unit, and all the  medication, the bill was $15,000. In the blink of an eye, my son's  injury…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698225/healthcare-affordability-crisis"}, {"senator": "Jacky Rosen", "party": "Democrat", "sentence": "…they are never going  to meet it, and they are still going to be paying out of pocket in ways  they can't afford.\n\nYou know, more than 38,000 people in my State alone are probably  going to lose their coverage right away, all because Washington  Republicans just refuse to extend this tax credit allowing them to  purchase their own insurance.\n\nFamilies,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695919/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…affordable housing. Finally, I tried to attach my bill to  stop Trump family's crypto corruption, which now exceeds $7.7 billion.\n\nRepublicans won't bring these ideas to the floor, probably because  Republicans are scared that they would pass. It is why Republicans also  jammed in their ban of a digital dollar. They know that most Americans  reject what they…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695151/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…Americans.\n\nIn my State of New York alone, more than 140,000 people relied on the  tax credits. These credits also supported an additional 1.7 million New  Yorkers who would probably otherwise not be able to afford health  insurance.\n\nOne constituent of mine who lives in public housing and holds a good  job told me that without these tax credits, her monthly…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698671/protecting-healthcare-for-millions-of-americans"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…Houthi militia will almost certainly       resume striking ships in the Red Sea, the officials said.       They added that pro-Iranian militias in Iraq and Syria would       probably try to attack U.S. bases there.\n\nOther officials said that in the event of an attack, Iran       could begin to mine the Strait of Hormuz, a tactic meant to       pin American…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692637/war-powers-resolution"}, {"senator": "Seth Moulton", "party": "Democrat", "sentence": "…getting  hit, he didn't seem to care. One marine told a story of him showing up  on a stack of marines going into a room, and the marine turned around  and said: Father, you probably shouldn't be right here.\n\nFather Shaughnessy never met a marine who didn't respect him, just  like he never met an R he could pronounce. Yes, every time he opened  his mouth,…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692558/recognizing-father-paul-shaughnessy"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…themselves what this bill  means for them and their families and their communities. They will see  how Republicans are gutting regular order to jam this thing through.  They will probably see them walk in with a huge amendment at the last  minute. It will be one that could dramatically change the bill,  including accelerating the timeline for kicking millions…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691512/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Jacky Rosen", "party": "Democrat", "sentence": "…increased your costs at  the grocery store. You are paying more for the essentials you rely on  most: coffee, produce, meat, so much more. Trump and his billionaire  buddies, who probably haven't gone grocery shopping for themselves in  years, don't care about the price of groceries. Well, they might not  care about paying more, but seniors on fixed incomes…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698816/9999"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…magazine.\n\nMr. Goldberg is the person who had messages sent to him that he did  not seek and that he did not ask for. According to the reports that I  have read and you have probably seen and heard televised, he was there  minding his own business when he received messages, messages that were  intended for a select group of people, many of whom I will…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689201/and-still-i-rise-censured-but-not-silenced"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…They have people whose job it is to find how we are going to meet  everybody's needs, so when you flick that switch, everything just  works. There are technicians in front of probably three or four screens  figuring out ``OK. I am going to buy this. This is the overnight price.  This is the backup,'' all that.\n\nWhat has changed over the last couple of years…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699020/energy-costs"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…was decades ago. `I don't think  anybody thinks that you could bring the Lehigh Valley back to what it  was,' Higgins said. `Could we bring some manufacturing back there?  Probably, but not to the extent that people believe.'\n\n`` `I just think it is going to cost more money, and then it is going  to hurt us with retaliatory tariffs,' said Higgins, a…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "Eric Swalwell", "party": "Democrat", "sentence": "…from New York (Mr. Garbarino), who has helped me shepherd  this bill through the Homeland Security Committee, has given me a good  snicker and a smirk over there because he probably sees me as the least  likely person to bring this bill forward and he is the least likely  ally that I have on the other side, but the two of us are smart enough  to listen…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696792/bottles-and-breastfeeding-equipment-screening-enhancement-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…hurting today because  he lost his wife 1 year ago suddenly. My prayers are with Thomas. My  prayers are with his family. I know Rhonda is in Heaven looking down on  Thomas, probably laughing at him a little.\n\nI know my colleagues all wish Thomas well. He is a dear friend, and  we will be thinking and praying about him today even as we go about  doing…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693110/tax-cuts-and-spending"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…That is  discretionary. That is all you and I get to vote on. As Members of  Congress, we only vote on the discretionary portion, and this was a  2025 chart. Today, it is  probably only 25 percent, not 26 percent, of the total spending. Every  dime of that is borrowed.\n\nMr. Speaker, the math for last year, for every dollar we took in, in  tax receipts,…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699257/debt-deficits-and-demographics"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…checks  out the door. We also pay them interest.\n\nLast year, we spent $1.133 trillion in interest. Our best estimate  right now is your government will spend just a little shy probably of  about $1.3 trillion  in interest this year. Why that is important: Realize that is more than  defense. Let's take a look at this. Think about that.\n\nStarting at about…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690748/the-math"}, {"senator": "John Thune", "party": "Republican", "sentence": "…closed  doors in the Capitol basement. I didn't notice the Democrat leader  objecting to a lack of transparency when we approved packages of Biden  nominees, some of which probably did happen in the dark of night,  albeit in the full light of the C-SPAN cameras.\n\nOf course, I should also mention that, before any floor  consideration, all of these nominees…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695295/rules-change"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…northwestern Pennsylvania region, and his legacy will be felt for  generations.\n\nWhile it is bittersweet to see Jim retire, I know that we will still  see him around Warren, probably on his mountain bike, enjoying the  outdoors. I wish him the best as he starts this new chapter of life.", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697068/recognizing-jim-decker"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…and then  setting up October 10 as the day that would be American Girls in Sports  Day and continuing to recognize that year after year.\n\nNow, my colleague from Connecticut probably knows that this issue of  protecting women and girls in sports is very, very popular in  Connecticut. One of Connecticut's biggest track stars is a Conrad High  School senior…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688449/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "Mr. GROTHMAN. Mr. Speaker, today in a committee hearing, in which  there were probably very few people in the room, the Republican  majority voted to expand the low-income housing tax credit.\n\nFirst of all, the low-income housing tax credit doesn't really  benefit…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691140/low-income-housing-tax-credit"}, {"senator": "Troy Nehls", "party": "Republican", "sentence": "…tourniquets to stop the bleeding of the young  boy until the ambulance arrived.\n\nWithout the swift actions of Mr. Van Orden, along with those also on  the scene, the young boy probably would have died.\n\nMay the actions of Mr. Van Orden and the folks who assisted in saving  the young boy inspire all Americans to lend a helping hand to those in  need. You…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695712/recognizing-derrick-van-orden"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…Western States like  Montana.\n\nI had the opportunity to return home last week, and I heard about  these issues firsthand from miners across the Second District. In fact,  I probably spent more time below ground than I did above it. Actually,  I really enjoyed that.\n\nI am going to talk first about Stillwater County. In Stillwater  County, the miners of…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689193/work-highlights-of-western-caucus"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…in the thick of it. My wife and I are very much in the thick of it. We  could not be more grateful for the support that we have back home with  our teachers. It has been probably one of the most positive things in  our lives as we see those boys progress.\n\nHouse Republicans are also continuing to assess our education system  this week by advancing…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689152/advancing-america-first-policies"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…and Gallego's, and  just an hour ago: Nope. We are going to leverage these Vietnam vets  against you, Dan Sullivan, to get more.\n\nNow, look, the Senator from New Mexico is probably going to say: Hey,  I want to move more bills.\n\nAll right. I will help you move more bills. You just saw I worked  Gallego's bill. But these two bills are ready to go to the…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696959/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-extension-of-deadlines-in-standards-of-performance-for-new-reconstructed-and-modified-sources-and-emissions-guidelines-for-existing-sources-oil-and-natural-gas-sector-climate"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…costs of gas and groceries  and how it was pinching away because of Biden's inflation and what it  had done to the purchasing power of everyday Americans' accounts.\n\nPeople in probably both of our districts said the same exact thing,  that they were watching the American Dream slip away from our kids and  grandkids because we couldn't necessarily be certain…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688464/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing-and-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…actually show what is happening. As we are refinancing  our debt, we are having to spend a lot more money. We calculate that  just interest this year, Mr. Speaker, will be probably about $1.2  trillion.\n\nThink about this hierarchy. Let's do this together: Social Security,  $1.5 trillion; interest, $1.2 trillion; Medicare, maybe $1.1 trillion;  Medicaid…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699674/united-states-fiscal-situation"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…reminded me that we were moving from brass, in this case, to  plastic, and so I have kept it on my desk all these years.\n\nWho knew it would become important today because probably some kind  of a label should have been on here if we had today's standards in  place. I don't know. All I do know is that when you are trying to get  something replaced, Mr.…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688547/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…uncomfortable  or unwelcome. Just this week, I was at three committee hearings and had  three members of the Cabinet in front of me. Did they want to answer my  questions? Probably not, but they did.\n\nIf a Senator of the United States who identifies himself as a  Senator--in at least the video I just saw--gets handled this way, gets  thrown to the ground…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692447/alex-padilla"}]