[{"senator": "Dick Durbin", "party": "Democrat", "sentence": "Mr. DURBIN. Mr. President, today we honor the 100th anniversary of  the Federal Probation Act of 1925, the pivotal law that established our  Federal probation system, thereby helping to reduce unnecessary  detention and crime. This is a prime example of criminal…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688628/100th-anniversary-passage-of-the-federal-probation-act-of-1925"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…Rehabilitation Act (YRA) from 24 to  18. It seeks to eliminate judicial discretion to impose sentences below  mandatory minimums, and would restrict vital alternatives like  probation, community service, and the ability to seal the records of  young adult offenders. This proposal is particularly egregious because  it undermines a program that works. The…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695721/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…program that looked into transit safety hazards across  the Nation.\n\nBut after President Trump took office, he started to receive strange  emails about his job. He was still on probation, but his performance  was excellent, and even his managers did not know who was sending the  emails. That was until February 14, when he was emailed that he had  been terminated…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688591/recognizing-federal-employees"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "Mr. WHITEHOUSE. Mr. President, I rise today to mark the centennial of  the Probation Act, which was signed into law on March 4, 1925. The law  allowed Federal judges to include probation as part of a person's  sentence, leading to the creation of the Federal…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688716/centennial-of-the-probation-act-of-1925"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Committee  on Oversight and Reform passed this bill in the 117th Congress.\n\nCSOSA and PSA are federal agencies that focus exclusively on D.C.  CSOSA supervises individuals on probation, parole or supervised release  for violations of D.C. law. PSA makes recommendations regarding  pretrial release and supervises defendants for the D.C. Superior Court  and…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690239/introduction-of-the-requirement-of-the-director-of-the-court-services-and-offender-supervision-agency-for-the-district-of-columbia-and-the-director-of-the-district-of-columbia-pretrial-services-agency-to-reside-in-the-district-of-columbia"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…As a young man, he went through pretrial diversion for misdemeanor  marijuana possession. As an adult, yet younger than 24, he was charged  with and ultimately placed on probation for felony bribery charges,  which ultimately were, too, expunged.\n\nHe was given a third chance, and now he is the face of a bill that  would not afford young people in Washington,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695555/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…individuals contribute to society, while holding them  accountable for their actions. They remain mindful of their role in  protecting public safety.\n\nIn honor of Pretrial, Probation and Parole Supervision Week 2025,  whose theme is ``Heroes Behind the Mission: Transforming Lives,  Enhancing Public Safety,'' we salute all those who have chosen this  important…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693630/recognizing-the-nations-community-supervision-professionals"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…College Law Enforcement Academy                                   MONTANA\n\nMissoula Police Department\n\nMontana Department of Corrections: Offers training courses       for ``new probation and parole officers and others needing       TASER 10 Certification.''\n\nBillings Probation and Parole Officers training to prepare       for use.\n\nLake County Forest Preserves…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700033/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…let go on a personal reconnaissance bond but failed  to show up.\n\nThe Bexar County DA downgraded the DWI. He pled guilty to obstructing  a passageway, but he violated the probation. He got arrested again. He  was let go after posting a bond of $1,500. He failed to show up.\n\nHe was arrested a fourth time in November of 2024. He was sentenced  to time…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695203/people-are-sick-and-tired"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…participants at the educational       institution.\n\n(3) With respect to any unit of the Coast Guard Junior       Reserve Officers' Training Corps suspended or placed on       probation pursuant to section 2031(h) of title 10, United       States Code--\n\n(A) a description of the unit;\n\n(B) the reason for such suspension or placement on       probation;…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "Mr. COONS. Mr. President, today, Tuesday March 4, is the 100th  anniversary of the Probation Act of 1925. The act created our Nation's  Federal probation system and, for the first time, authorized Federal  judges to impose a sentence of probation as an alternative…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688481/probation-act-of-1925"}, {"senator": "Barry Moore", "party": "Republican", "sentence": "…victims' vehicle, causing it to then  crash into a tree. Despite having five previous DUI convictions, a  Boulder, Colorado, county judge sentenced this illegal alien to  probation, community service, and work release on December 8, 2023, in  relation to two of those convictions, just 4 days before the drunk  driver crashed and killed the mother and…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693084/jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-2025"}, {"senator": "Laurel Lee", "party": "Republican", "sentence": "Ms. LEE of Florida. Mr. Speaker, I rise in support of the Safer  Supervision Act, a bipartisan bill backed by Federal law enforcement,  probation officers, and public defenders. This broad coalition shares a  common goal: a supervision system that improves public safety and  supports successful reentry.\n\nToday, more…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697108/supervision-system-that-improves-public-safety-and-supports-successful-reentry"}]