[{"senator": "Jack Reed", "party": "Democrat", "sentence": "…infrastructure that creates good jobs;  provides affordable, clean power; increases our energy independence;  and reduces climate-destroying greenhouse gases in the process. And it  is clear Trump's energy emergency is a sham, and I am proud to join my  colleagues' efforts to overturn it.\n\nMr. REED. Mr. President, I would like to move to the topic before…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696129/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…negotiations now continue.\n\nI want to focus right now on the 5 bills we just passed, which fund  95 percent of the remaining Federal budget. From the start of this  process, I made clear we needed to tear up Trump's budget and reassert  Congress' power of the purse to make the voices of our constituents  heard.\n\nThese are not the bills I would write…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699453/appropriations"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…to help those who needed help. A truly selfless  leader, Ms. Noble was a strong advocate for bringing in government and  non-profit resources to aid in the recovery process.\n\nIt is clear that Carol Noble has made a profoundly positive impact on  our community, and I am grateful for her service. May we all strive to  serve our communities with the same…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690136/recognizing-carol-noble"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…to help those who needed help. A truly selfless  leader, Ms. Frazier was a strong advocate for bringing in government  and non-profit resources to aid in the recovery process.\n\nIt is clear that Jami Frazier has made a profoundly positive impact  on our community, and I am grateful for her service. May we all strive  to serve our communities with the same…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690794/recognizing-jami-frazier"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…to help those who needed help. A truly selfless  leader, Mr. Hutton was a strong advocate for bringing in government and  non-profit resources to aid in the recovery process.\n\nIt is clear Ronnie Hutton has made a profoundly positive impact on  our community, and I am grateful for his service. May we all strive to  serve our communities with the same…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691912/recognizing-ronnie-hutton"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…help those who needed help. A truly selfless  leader, Ms. Phillips was a strong advocate for bringing in government  and non-profit resources to aid in the recovery process.\n\nIt is clear that Tasha Phillips has made a profoundly positive impact  on our community, and I am grateful for her service. May we all strive  to serve our communities with the…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692158/recognizing-tasha-phillips"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…strong support for H.R. 3898, the       PERMIT Act, which will provide necessary clarity and       confidence required under the Clean Water Act (CWA)       permitting process. Because clear and predictable permitting       leads to the creation of attainable housing, NAHB has       designated support for passage of H.R. 3898 as a KEY VOTE.\n\nRegrettably,…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698026/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…to help those who needed help. A truly selfless  leader, Mr. White was a strong advocate for bringing in government and  non-profit resources to aid in the recovery process.\n\nIt is clear Mr. Harry White has made a profoundly positive impact on  our community, and I am grateful for his service. May we all strive to  serve our communities with the same…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690669/recognizing-harry-white"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…to help those who needed help. A truly selfless  leader, Ms. White was a strong advocate for bringing in government and  non-profit resources to aid in the recovery process.\n\nIt is clear that Lynn White has made a profoundly positive impact on  our community, and I am grateful for her service. May we all strive to  serve our communities with the same…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691191/recognizing-lynn-white"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…help those who needed help. A truly selfless  leader, Mr. Youngblood was a strong advocate for bringing in government  and non-profit resources to aid in the recovery process.\n\nIt is clear Glen Youngblood has made a profoundly positive impact on  our community, and I am grateful for his service. May we all strive to  serve our communities with the same…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690716/recognizing-glen-youngblood"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…to help those who needed help. A truly selfless  leader, Mr. Verosic was a strong advocate for bringing in government  and non-profit resources to aid in the recovery process. It is clear  Brody Verosic has made a profoundly positive impact on our community,  and I am grateful for his service. May we all strive to serve our  communities with the same…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690146/recognizing-brody-verosic"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Lacoochee, Trilby, Ridge Manor area. A truly  selfless leader, Pastor Buzzie was a strong advocate for bringing in  government and non-profit resources to aid in the recovery process.\n\nIt is clear that Pastor Kenny Buzzie has made a profoundly positive  impact on our community, and I am grateful for his service. May we all  strive to serve our communities with…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690644/recognizing-pastor-kenny-buzzie"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…to help those who needed help. A truly selfless  leader, Mr. Lastra was a strong advocate for bringing in government and  non-profit resources to aid in the recovery process.\n\nIt is clear Mike Lastra has made a profoundly positive impact on our  community, and I am grateful for his service. May we all strive to  serve our communities with the same dedication…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691772/recognizing-mike-lastra"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…services to help those who needed help. A truly selfless  leader, Casey was a strong advocate for bringing in government and non- profit resources to aid in the recovery process.\n\nIt is clear that Casey ``KC'' Gabelli has made a profoundly positive  impact on our community, and I am grateful for Casey's service. May we  all strive to serve our communities…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690275/recognizing-casey-kc-gabelli"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…help those who needed help. A truly selfless  leader, Ms. Hoffland was a strong advocate for bringing in government  and non-profit resources to aid in the recovery process.\n\nIt is clear that Kay Hoffland has made a profoundly positive impact  on our community, and I am grateful for her service. May we all strive  to serve our communities with the same…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691124/recognizing-kay-hoffland"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…help those who needed help. A truly selfless  leader, Mr. Phillips was a strong advocate for bringing in government  and non-profit resources to aid in the recovery process.\n\nIt is clear Mike Phillips has made a profoundly positive impact on  our community, and I am grateful for his service. May we all strive to  serve our communities with the same…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691726/recognizing-mike-phillips"}]