[{"senator": "Al Green", "party": "Democrat", "sentence": "…speaking of legacies that have been stolen, we  annually honor General Gordon Granger for going into Galveston and  informing the enslaved persons there that the Emancipation Proclamation  applied to them and that they were free people, liberated people.\n\nWhen we do this, however, we do not acknowledge the people who made  it possible for General Gordon Granger…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700075/black-history-stolen-legacies"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "Mr. DAVIS of Illinois. Mr. Speaker, I include in the Record the  following Proclamation commending the Mu Mu Lamda Chapter of Alpha Phi  Alpha Fraternity, Inc. on its 50th Anniversary.\n\nWhereas, Alpha Phi Alpha Fraternity, Inc., founded on       December 4,…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697509/commending-the-mu-mu-lamda-chapter-of-alpha-phi-alpha-fraternity-inc-on-its-50th-anniversary"}, {"senator": "Robin Kelly", "party": "Democrat", "sentence": "Ms. KELLY of Illinois. Mr. Speaker, I include in the Record the  following proclamation recognizing Ecumenical Patriarch Bartholomew I,  Archbishop of Constantinople-New Rome.\n\nWhereas, on September 15, we will welcome His All-Holiness       Ecumenical Patriarch…", "date": "2025-08-26", "source_url": "https://justfacts.votesmart.org/public-statement/1694760/recognizing-his-all-holiness-ecumenical-patriarch-bartholomew-i-archbishop-of-constantinople-new-rome"}, {"senator": "Al Green", "party": "Democrat", "sentence": "Mr. GREEN of Texas. Mr. Speaker, and still I rise. I include in the  Record the following Proclamation recognizing Dr. Dana Carson for 40  years of service:\n\nWhereas, Apostle Dr. Dana Carson hails from Chicago,       Illinois, and is the Founder & Senior Pastor of the…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692044/certificate-of-congressional-recognition-proclamation-presented-to-apostle-dr-dana-carson-in-honor-of-40-years-of-ministry"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…legislation. Last week was National Park Week, an annual tradition  meant to honor our deep connection to national parks. President Trump  carried on the tradition by issuing a proclamation to officially  designate the week--this is one of the few noncontroversial actions in  the first 100 days of this administration--because all Americans love  and value and…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690404/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…Speaker, I rise to commemorate Korean War  Armistice Day and to honor the millions of servicemembers who fought  during the Korean war.\n\nThis year marks the 16th anniversary of Proclamation 8399, a  proclamation to establish National Korean War Veterans Armistice Day.\n\nI am proud to have introduced legislation in this Congress to help  reunify families who…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693866/recognizing-the-remarkable-work-of-sewa-international"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "Mr. THOMPSON of Mississippi. Mr. Speaker, I include in the Record the  following proclamation commemorating the Multi-Year Reunion of Amanda  Elzy High School located in Greenwood, Mississippi, and recognizing the  pivotal role it played in the Civil Rights Movement.…", "date": "2025-08-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694753/recognizing-the-amanda-elzy-high-school-multi-year-reunion"}, {"senator": "Sheila Cherfilus-McCormick", "party": "Democrat", "sentence": "Mrs. CHERFILUS-McCORMICK. Mr. Speaker, I include in the Record the  following proclamation honoring Band CaRiMi.\n\nWhereas, music has long been a unifying force that       transcends borders and generations, preserving culture and       celebrating heritage. Few…", "date": "2025-08-12", "source_url": "https://justfacts.votesmart.org/public-statement/1694734/9999"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "Ms. BROWN. Mr. Speaker, include in the Record the following  proclamation:\n\nWhereas, Delta Sigma Theta Sorority, Incorporated was       founded in 1913 on the campus of Howard University by 22       visionary collegiate women committed to public…", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691694/recognizing-the-greater-cleveland-alumnae-chapter-of-delta-sigma-theta-sorority-incorporated-on-their-centennial-anniversary"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "Mr. SUBRAMANYAM. Mr. Speaker, I include in the Record the following  proclamation recognizing National Dynamic Random Access Memory (DRAM)  Day:\n\nWhereas, Dynamic Random Access Memory (DRAM) has been a       cornerstone of technological innovation since…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691950/recognizing-dynamic-random-access-memory-dram-day"}, {"senator": "André Carson", "party": "Democrat", "sentence": "…would also like to recognize Dr. Claire A. Nelson, Founding  President of the Institute of Caribbean Studies, as the chief architect  behind the movement for the official proclamation of June as National  Caribbean American Heritage Month. Dr. Nelson has convened a network of  volunteer leaders through the National Caribbean American Heritage  Month Commemorative…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693058/introduction-of-resolution-recognizing-the-significance-of-national-caribbean-american-heritage-month"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "Ms. KAPTUR. Mr. Speaker, I include in the Record the following  proclamation:\n\nI have the honor of representing Ohio's 9th Congressional District, a  region that embodies the industrious spirit, deep-rooted history, and  rich educational traditions…", "date": "2025-03-18", "source_url": "https://justfacts.votesmart.org/public-statement/1688913/proclamation-for-defiance-colleges-demisemiseptcentennial"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…recommitment to celebrate a day of delayed liberation,  but not undeniable triumph.\n\nOn June 19, 1865, more than 2 years after President Lincoln signed  the Emancipation Proclamation, Union soldiers arrived in Galveston,  Texas, with the news that the last enslaved Black Americans were  finally free.\n\nFreedom did not come easily. It came slowly, unevenly,…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692430/2025-juneteenth-major-league-baseball-events-in-birmingham"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…1865, the day Union troops arrived  in Galveston, Texas, and informed over 250,000 enslaved Black people  that they were free--more than two years after the Emancipation  Proclamation. Juneteenth is a reminder that freedom and equality remain  delayed for Black Americans. For generations, this history of  intentional continuation of slavery was ignored,…", "date": "2025-06-20", "source_url": "https://justfacts.votesmart.org/public-statement/1692688/commemoration-of-juneteenth-amid-the-erosion-of-black-history"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…SAMARC Foundation Award, which honored him as a community legend in  2012. In 2020, the City of Phenix City recognized him with a  Trailblazer award during a Black History Proclamation Event, and in  2023, the Alabama State Conference of the NAACP honored him with their  esteemed Humanitarian Award.\n\nCliff loved his family deeply and held his faith close…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688153/in-memory-of-clifford-odell-rutledge"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…council, Betty was honored  for the steady and reliable leadership that she provided to the  community.\n\nServing in the role of Council Vice President, Betty was presented a  proclamation that highlighted her service on the borough's union and  police contract committee and a design committee that facilitated the  creation of a mural for the new borough building.…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698629/recognizing-the-dedicated-public-service-of-betty-bucher"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…that 1969 was a  life changer for so many people. When you ask those folks alive in 1969  what it was like to see a man on the Moon, Neil Armstrong, making that  famous proclamation, it was a game changer. We proved that anything is  possible here in America. We moved forward from that with shuttle  technology and, more recently, with some of the amazing…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687924/space-dominance"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "Mr. CARTER of Georgia. Mr. Speaker, I include in the Record the  following proclamation:\n\nWhereas, for millennia, the Jewish people have sustained their shared  religious, cultural, and ethnic identity and traditions in the face of  enslavement, persecution,…", "date": "2025-03-21", "source_url": "https://justfacts.votesmart.org/public-statement/1688926/designating-april-29-as-endjewhatred-day"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…of Celina, the Community Builder Award, and the Celina Varsity  Cheer Parent of the Year Award. He has also been recognized by the  Celina Fire Department and received a proclamation from the Collin  County Commissioners Court for the State of Texas. Sean's leadership  and community advocacy have made a profound impact on the City of  Celina and the…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690277/recognizing-congressional-patriot-award-recipient-sean-michael-terry"}, {"senator": "French Hill", "party": "Republican", "sentence": "…presentation supporting the larger ACC       proposed list of areas. In February 1982, Arkansas Governor       Frank White (R-AR), an avid hiker and canoeist, issued a       Proclamation in favor of the ACC Plan and urged action by       Congress.\n\nGovernor White's favorable view of wilderness was echoed by       another strong conservative voice in the…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691095/flatside-wilderness-additions-act"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "Mr. PATRONIS. Mr. Speaker, I rise to include in the Record the  following proclamation recognizing Holy Family Catholic Academy:\n\nWhereas, Holy Family Catholic Academy in Niceville,       Florida, opened its doors on August 8, 2025, marking the only…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699458/recognizing-holy-family-catholic-academy"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…and the thousands of  law enforcement officers who wake up every day to step on that thin  blue line to defend and protect us.\n\nIn 1962, President John F. Kennedy signed a proclamation which  designated May 15 as Peace Officer Memorial Day, and the week in which  that date falls as Police Week.\n\nYesterday, my staff and I got the opportunity to welcome…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691169/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "…restricting the areas that are open for use, withdrawing them from  mineral exploration, oil and gas exploration, and energy production.\n\nThe original intent of the Presidential proclamation authority in the  Antiquities Act was for the President to be able to move quickly and  declare a national monument in an area with antiquities, or an area of  scientific…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689196/work-highlights-of-western-caucus"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…taxed at a  much higher rate.\n\nCongress didn't debate these tariffs. Congress didn't vote to enact  these tariffs. The tariffs are simply imposed by Presidential fiat, by  proclamation.\n\nGovernment by one person who assumes all power by asserting a so- called emergency is the antithesis of constitutional government. It was  Montesquieu that our Founding…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690543/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…Month'' has its origins       in 1980, when Congress enacted a Joint Resolution entitled       ``joint resolution to authorize and request the President to       issue a proclamation designating April 21 through April 28,       1980, as `Jewish Heritage Week' '', approved April 24, 1980       (Public Law 96-237; 94 Stat. 338);\n\nWhereas, on April 24,…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691192/calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism-and-educate-the-public-on-the-contributions-of-the-jewish-american-community"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…have been killed in the line of  duty, as well as those who bravely serve their communities every single  day.\n\nMore than 60 years ago, President John F. Kennedy signed a  proclamation that designated May 15 as Peace Officers Memorial Day and  the week in which that day falls as Police Week.\n\nThousands of law enforcement officers are visiting Washington,…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691031/expressing-support-for-local-law-enforcement-officers"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Appreciation Week, I wanted to take an opportunity to highlight  the service of some of the truly amazing educators in California's  Third Congressional District.\n\nIn his 1988 proclamation, Ronald Reagan said: ``Our country's great  teachers often make many sacrifices as they fulfill their countless  responsibilities. They have earned, and truly deserve, the…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…Gen. John Lejeune, in 1921  issued this message, and ever since then, since 1921, every single  Marine Corps birthday celebration for over a hundred years has had this  proclamation read. It was read last night in Anchorage; it was read  last night in DC; and for the Marine Corps balls today and tomorrow on  November 10, it will be read there. Here…", "date": "2025-11-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696624/recognizing-the-250th-anniversary-of-the-united-states-marine-corps"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…treatment after that date       and before the date of the enactment of this Act as a result       of revisions to the Harmonized Tariff Schedule.\n\n(c) Effective Date of Proclamation.--A proclamation under       subsection (a) shall take effect not earlier than 2 business       days after the President submits to the Committee on Finance       of the…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698853/haiti-economic-lift-program-extension-act"}]