[{"senator": "Al Green", "party": "Democrat", "sentence": "…prevent  Texas from doing what the Justice Department alleges Texas did and what  the Texas Attorney General said: No, we didn't do that. We don't draw  lines like that.\n\nTexas proceeded to honor the request of the United States Justice  Department and proceeded to honor the request that it said was  unlawful. In a sense it was an unlawful request because…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694943/bloody-sunday-and-voting-rights-act"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…know who you were. I want people to know that you left  big tracks--big tracks--in the sands of time. I want people to know  that you came from one direction and that you proceeded to another, a  righteous direction. I want people to know who you are.\n\nI want people to know who Jessica Denson is, who is the mother and  founder of the Removal Coalition;…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698076/liberty-and-justice-for-all"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…Vernon district supervisor,  but he was no ordinary public servant. After getting his LLB from  George Washington School of Law, he decided that was not taxing enough  and proceeded to earn a master's of law in taxation from George  Washington School of Law.\n\nGerry was a man who wore many hats, from Air Force colonel to lawyer,  but it was his role as…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687959/congratulating-dame-karen-pierce"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…the home of a woman from Oklahoma was mistakenly targeted  by ICE agents. They broke into her home, forced her and her children  outside at gunpoint in their underwear, and proceeded to ransack their  home.\n\nThe people who ICE were looking for didn't even live there, but that  didn't stop them from traumatizing the current residents, confiscating  their…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690506/trump-immigration-policies"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…of success.\n\nGeorgia, strategically located on the Black Sea, is no stranger to  larger geopolitical forces. Russia invaded Georgia in 2008 during the  Beijing Olympics and proceeded to occupy 20 percent of its territory.  Despite the persistent threat from Russia, Georgians continued to forge  forward with democratic reforms and even made significant…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690699/mobilizing-and-enhancing-georgias-options-for-building-accountability-resilience-and-independence-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "Mr. MERKLEY. Mr. President, I have come to the floor to say I am  extremely outraged that the executive branch's security team has shoved  a U.S. Senator out of a room, has proceeded to put that U.S. Senator on  the ground and to handcuff that Senator. This is what we expect to see  in authoritarian nations that can't tolerate a question, and they start…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692551/alex-padilla"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…pages. We know that they blocked  out whole pages in order to disguise, apparently, the protection of  powerful men they don't want drawn into this discussion.\n\nThen they proceeded to not redact the names of victims, as the law  required. Let us not forget what this entire Epstein scandal is about.  It is about powerful, wealthy men grooming, abusing,…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699772/9999"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…being injured. But it happened.\n\nThe end of that day was a good story because we returned to this  Chamber, and we re-paraded over to the House and continued the counting  and proceeded to establish who would be the next President of the  United States of America.\n\nBut it feels particularly important today to honor those who defended  this Capitol. It was…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698521/anniversary-of-january-6"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…deaf.  And he has been working at a carwash 6 days a week for the last 5  years.\n\nImmigration officials confiscated his identification. They  confiscated his cell phone. They proceeded to handcuff him, put his  hands behind his back in handcuffs, leaving him no way of  communicating. You need to be able to use your hands to communicate  with sign language.…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694421/daca"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…foreign aid and public broadcasting.\n\nJust this morning, the OMB Director suggested that he was just  getting started and didn't care whether or not the appropriations  process proceeded as our Founding Fathers and the Constitution imagined  it. He said it should be more partisan and that he would continue to  send rescissions packages like the one that they…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693677/department-of-defense-appropriations-act-2026"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…our taxation authority by an unprecedented series of tariff  announcements.\n\nA great gauge of how corrupt things are right now is by seeing how  much litigation has already proceeded against the Trump administration.  We have seen over 220 lawsuits brought against them in their first 100  days. That is clearly a record.\n\nIt is also a record of how many…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690818/gross-violations-of-law-by-trump-administration"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…Rules Committee last night, but multiple Republicans were  denouncing it, that is, before they were summoned into a side room and  instructed to vote for it, which they all proceeded to do.\n\nNow they are telling us: Vote for it today and they will repeal it  maybe next week or maybe the week after that or maybe before Christmas.  I have a solution. If…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696679/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…ordinary person, is being  torched by these megadonations. You saw what Trump calls this Big  Beautiful bill. It was really a big, ugly betrayal of American  families. It proceeded to cut nutrition. It proceeded to cut healthcare  to deliver, well, trillions of dollars of tax breaks for the richest  Americans, and it even will run up the debt by $30…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699084/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…like what happened last year if you remember, Mr. Speaker.  In June of 2025, Trump said that Iran was weeks away from getting a  nuke.\n\nWhat happened?\n\nThe administration proceeded to bomb Iran.\n\nThe White House spent the entirety of last summer telling the world  that Iran's nuclear facilities had been obliterated in a strike that  the U.S. conducted.…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700195/providing-for-consideration-of-hr-dont-mess-with-my-home-appliances-act-and-providing-for-consideration-of-hr-homeowner-energy-freedom-act"}, {"senator": "Alexandria Ocasio-Cortez", "party": "Democrat", "sentence": "…Congress in this tragedy with one of the many  bipartisan options to condemn political violence in Kirk's murder as we  did with the late Melissa Hortman. Instead, the majority proceeded with  a resolution that brings great pain to the millions of Americans who  endured segregation, Jim Crow, and the legacy of bigotry today.\n\nWe should be clear about who…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695806/censured-but-not-silenced"}, {"senator": "Jim Banks", "party": "Republican", "sentence": "The PRESIDING OFFICER (Mr. Banks). The clerk will call the roll.\n\nThe senior assistant legislative clerk proceeded to call the roll.", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697556/china"}, {"senator": "Ashley Moody", "party": "Republican", "sentence": "The PRESIDING OFFICER (Mrs. Moody). The clerk will call the roll.\n\nThe bill clerk proceeded to call the roll.", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693096/immigration"}, {"senator": "Pete Ricketts", "party": "Republican", "sentence": "The PRESIDING OFFICER (Mr. Ricketts). The clerk will call the roll.\n\nThe bill clerk proceeded to call the roll.", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699096/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Tim Sheehy", "party": "Republican", "sentence": "The PRESIDING OFFICER (Mr. Sheehy). The clerk will call the roll.\n\nThe senior assistant legislative clerk proceeded to call the roll.", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697768/caribbean-boat-strike"}, {"senator": "Claudia Tenney", "party": "Republican", "sentence": "…his remarkable service to  our country.\n\nRick grew up in Lyndonville, New York, a small town in Orleans  County. After graduating from Lyndonville High School in 1962, he  proceeded to enroll in the United States Air Force Academy.\n\nAfter graduating from the Academy and marrying his high school  sweetheart, Nancy, he went on to serve 26 years in the…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693663/recognizing-colonel-john-peyton-swain"}, {"senator": "Bill Hagerty", "party": "Republican", "sentence": "…joint resolution (S.J. Res. 88) terminating the national       emergency declared to impose global tariffs.\n\nThereupon, the committee was discharged, and the Senate       proceeded to consider the joint resolution.", "date": "2025-10-30", "source_url": "https://justfacts.votesmart.org/public-statement/1696489/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…offering specific health-related or financial services or  products to consumers,'' that should not be there, either.\n\nHowever, despite these warnings, Covered California proceeded. I  believe this raises a serious issue under HIPAA, a law designed to  protect the privacy of individuals' personal health information.\n\nI have written to Secretary of Health…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690562/gas-prices-are-lower-for-everyone-except-californians"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…SMITH of Missouri. Mr. Chair, I want to thank Mr. Arrington for  yielding.\n\nMr. Chair, 4 years ago, President Trump left Joe Biden a blueprint  for success, and then Democrats proceeded to open our borders,  undermine American energy, and spend trillions of dollars on handouts  to the wealthy.\n\nThey created the highest inflation in 40 years that made it…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688028/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Jon Husted", "party": "Republican", "sentence": "The PRESIDING OFFICER (Mr. Husted). The clerk will call the roll.\n\nThe senior assistant legislative clerk proceeded to call the roll.", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693890/national-defense-authorization-act"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…After he murdered Kayla, he left her on the floor, and he went to  Target with his half-brother to spend the $6 he stole from her. Then  because he was a minor, the Biden HHS proceeded to place him in a group  home with other children and enrolled him in a local public high school  without telling the high school that he was the prime suspect in that  murder…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699689/immigration"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…has done nothing to justify the hope that he might be  persuaded to end this war. To the contrary, despite Putin's declared  cease-fire over the Easter holiday, Russia then proceeded to launch  attacks into Ukraine that killed innocent civilians. More recently,  Russia launched two ballistic missiles and 165 drones, wounding 11  people, including 2 children.…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690955/ukraine"}]