[{"senator": "Ron Wyden", "party": "Democrat", "sentence": "…indefinitely.  Field offices, which bore the brunt of those staffing cuts, are now  forced to backfill the staffing shortages with other employees at the  expense of timely processing benefit claims and assisting seniors who  come into the field offices. Simply put, SSA is having to do more with  less resources and fewer staff.\n\nAs my colleagues know,…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697776/claiming-age-clarity-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…privilege of representing part of it for a  long time. There, their water and wastewater purification systems are  the highest cost for that city.\n\nThe energy cost of wastewater processing is the largest cost in any  city. Think about that. Every year, the purified water is thrown back  into the lake when it leaves the plant. That city throws into Lake Erie…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694099/trumps-reckless-tariff-policies"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…having more research that  is more objective and consider the full cost to changing our energy.\n\nAlmost 50 million Americans live within a mile of a refinery or a  heavy processing plant. Their public health costs are  disproportionately affected by what we know from traditional  pollutants, particulate matter, and smog. Then when you add carbon into…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697035/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…something about the Dreamers.\n\nHe said:\n\nWe have to do something about the Dreamers. Republicans are       very open to Dreamers.\n\nI call on the administration to resume processing initial DACA  applications outside of Texas, in line with the ruling from the Fifth  Circuit. I call on this administration to do the right thing, to do  what is legally…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692242/daca"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…fuels off yesterday; or that we are going to turn fossil fuels  off next week; or that we don't respect the men and women who work in  our energy fields or in our energy processing across the country.\n\nIf there are Democrats who feel that way, I disagree with them,  because the worst thing we could do at this moment when we have the  energy abundance…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688166/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…there.\n\nWe support the Iranian people and their efforts to determine their  own futures, and we will continue to support them.                      Banning Immigrant Visa Processing\n\nMr. SUBRAMANYAM. Mr. Speaker, the administration has decided that,  starting tomorrow, January 21, they are going to implement an  indefinite ban on immigrant visa processing…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699204/ongoing-protests-in-iran"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "Mrs. RAMIREZ. Mr. Speaker, last week, I joined Representative Chuy  Garcia, Representative Jonathan Jackson, and Representative   Danny  Davis at the ICE Processing Center in Broadview to investigate ICE's  inhumane and unlawful detention of immigrant families and our  constituents.\n\nThe visit to the processing center comes after credible…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692932/holding-power-accountable"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…ensures the industry stays competitive. It is long  overdue.\n\nIn fact, the Court ruling required the EPA to finalize this rule to  close the loophole that allowed rubber processing facilities to spew  unlimited hazardous air pollution. When fully implemented, the rule  will cut these harmful emissions by 171 tons per year. That includes  over 100 tons…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688531/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…hurt, not help, the American  people, including those in Ohio's 13th. From cutting phone helplines,  to requiring certain services be conducted in person, to slowing down  processing times, and closing offices, the American people are not  getting the service they earned from the Social Security  Administration.\n\nNow, to add insult to injury, the Trump…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690424/social-security-administration-is-there-to-help-not-hurt-americans"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…plans to study engineering at the university.       With continued regular monitoring, he was able to attend       university, but the trauma of his diagnosis and the       processing of the impact of what it might mean for his life,       coupled with the stress of engineering studies, brought on       significant mental health challenges.\n\nHe did go…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…Program, a temporary administrative fix that  allows these veterans to request parole for their children or siblings.  Under this policy, they can live in the U.S. pending processing of  their permanent resident applications, which may still take years if  not decades. However, as these veterans near the end of their lives,  they deserve the certainty…", "date": "2025-05-23", "source_url": "https://justfacts.votesmart.org/public-statement/1691684/introduction-of-the-filipino-veterans-family-reunification-act-of-2025"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "Mr. Speaker, I rise in support of H.R. 3854, the Modernizing All  Veterans and Survivors Claims Processing Act, as amended.\n\nWe are living in an era of remarkable technological advancement. It  seems every day that there is a new story about how artificial  intelligence is shaping…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695486/modernizing-all-veterans-and-survivors-claims-processing-act"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…limitation strategies both here in the United States and back in his  home in Australia.\n\nHe negotiated a critical minerals agreement that is already spurring  new mining and processing projects to benefit both our countries.\n\nHe also spearheaded a cutting-edge tech partnership that is unlocking  billions of dollars in bilateral investments, including for…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699544/9999"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…roster. She had so many interests and talents and loved to       share them with all of us.\n\nIn the past few days, I have been seeking some comfort and       wisdom in processing the loss of a woman that all of us loved       so much and loved you all in return.\n\nTwo such examples have resonated with me, and I hope they       can do the same for you.…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688362/eulogy-by-sam-iacobellis-for-dorothy-christiana"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…billion of  Trump's USD1 stablecoin. And then President Trump says: Oh, do you know  what? You can have these AI chips after all. We will help you establish  an advanced AI processing--artificial intelligence--center in Abu  Dhabi, one of the UAE Emirates. That is corruption laid out as black  and white as you could ever see it. This is incredible. This…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692355/motion-to-discharge-sj-res-54"}, {"senator": "Tom Tiffany", "party": "Republican", "sentence": "…Link Snacks, Incorporated, on his induction into the Wisconsin  Manufacturing Hall of Fame.\n\nBorn and raised in Minong, Wisconsin, Mr. Link learned the  fundamentals of meat processing at an early age in his family's butcher  shop.\n\nBy the mid-1980s, after the family meatpacking business closed, Jack  identified an opportunity to improve the quality and…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700132/congratulations-to-jack-link-founder-of-link-snacks-inc"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…or 552a of title 5 concerning the       victim's case shall be determined to have a compelling need,       and the records request shall be processed under expedited       processing procedures, if in the request for such records the       victim indicates that the records concerned are related to       the covered misconduct case;\n\n``(C) in applying…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…that involves--\n\n``(A) agricultural land;\n\n``(B) agriculture biotechnology; or\n\n``(C) the agriculture industry, including agricultural       transportation, storage, and processing.''.       SEC. 3. CONSIDERATION OF CERTAIN AGRICULTURAL LAND                     TRANSACTIONS.\n\nSection 721(b)(1) of the Defense Production Act of 1950 (50       U.S.C. 4565(b)(1))…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692799/agricultural-risk-review-act-of-2025"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…pray for the swift recovery of my friend, Senator  John Hoffman, and his wife, Yvette. I was honored to serve with both of  them in the Minnesota Legislature.\n\nWe are still processing this senseless act, and I stand with my  colleagues today as we say that there is no place for politically  motivated violence in this country.\n\nThese victims committed themselves…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692863/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…(Mr.  Ezell) for bringing this bill forward.\n\nMr. Speaker, our country is at a point where we need more energy and  every form of energy when we look at the demands for data processing,  when we look at transportation demands, when we look at demands for  energy to grow our economy and to produce more things here. I don't  think anybody on either side of…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688630/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…rise today to recognize a significant  milestone in America's push for critical mineral independence.\n\nLast week, I joined Talon Metals to celebrate the new Beulah Minerals  Processing Facility, which will process high-grade nickel and copper,  just like this, from Talon's high-tech, environmentally friendly mine  in Minnesota.\n\nThey will turn it into materials…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691909/north-dakotas-greatest-resource"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…taking inspiration from Jewish cooking traditions in Europe;\n\nWhereas Sylvan Goldman invented the shopping cart;\n\nWhereas Evelyn Berezin invented the first true word-      processing computer and automated airline reservation system;\n\nWhereas Ralph Baer invented the ``Brown Box'', a prototype       for the first multiplayer, multiprogram video game system;…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691192/calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism-and-educate-the-public-on-the-contributions-of-the-jewish-american-community"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "…a center of diverse agricultural production. In  addition to citrus, settlers in Coleman raised cotton, cattle, sheep,  and hogs, with wool even shipped to Baltimore for processing. By 1923,  Coleman had earned national recognition as the ``Cabbage Capital of the  World'', attracting buyers from across the country.\n\nToday, the City of Coleman is in…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693103/recognizing-the-100th-anniversary-of-the-city-of-coleman-florida"}, {"senator": "James Risch", "party": "Republican", "sentence": "…targets. The AIM-120D-3 features a quadrangle target       detection device and an electronics unit within the guidance       section that performs all radar signal processing, mid-course       and terminal guidance, flight control, target detection, and       warhead detonation.\n\n2. AIM-120C-8 AMRAAM is a supersonic, air launched, aerial…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692629/arms-sales-notification"}, {"senator": "Tom Tiffany", "party": "Republican", "sentence": "…(1) purchase capital and expendable equipment, fish tags,       and other items necessary to support and carry out tagging       and tag recovery operations, including data processing and       data dissemination relating to those operations; and\n\n(2) hire additional personnel, as necessary.\n\n(c) Required Collaboration.--In carrying out the Program,…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693992/great-lakes-mass-marking-program-act-of-2025"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…applications approved by the       Administrator or such a national certifying entity since the       date of the enactment of this Act;\n\n(4) the timelines associated with processing such       applications by the Administrator or such a national       certifying entity between submission and approval;\n\n(5) the administrative costs to the Administration…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691798/wosb-accountability-act"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "Mr. EDWARDS. Mr. Speaker, I thank Mr. Valadao from California for his  leadership on Modernizing All Veterans and Survivors Claims Processing  Act. This important legislation streamlines the VA claims process,  helping veterans and their families receive the benefits that they have  earned and deserve.\n\nI am especially…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695483/modernizing-all-veterans-and-survivors-claims-processing-act"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…adjustment reflects the estimate of the law  provided by the Congressional Budget Office on July 21, 2025.\n\nThis adjustment supersedes the adjustment I previously made for the  processing of amendment No. 2848 to H.R. 1.\n\nCon. Res. 14, the Concurrent Resolution                 on the Budget for Fiscal Year 2025)------                          ($ in billions)-------…", "date": "2025-07-31", "source_url": "https://justfacts.votesmart.org/public-statement/1694525/budgetary-revisions"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…licensing and registration requirements, and even       more stringent recordkeeping standards.\n\nThis provision will significantly reduce the administrative       burdens and processing delays for less-than-lethal projectile       devices presently designed in a configuration that brings it       under the regulatory purview of the NFA.      H.R. 2189 establishes…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700037/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…Pennsylvania Department of  Agriculture.\n\nCecilia Partsch's grandfather, Frank, purchased the farm in April  1924. Frank Partsch was a dairy farmer who supplied milk for processing  at Sani Dairy in Johnstown, Pennsylvania.\n\nThe original barn and house are still in use today. Cecilia Partsch's  father, Harold, took over the farm in 1972. Currently,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695049/supporting-the-stop-of-chinese-fentanyl"}]