[{"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…long ago as to violate any reasonable reading of the time  bounds in the CRA. To accept these three submissions as rules would be  to reject the principle that the privileged procedure in the CRA should  be closely examined and strictly limited.\n\nAgencies could submit any final action, going back to the enactment  of the CRA in 1996--including adjudications,…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691581/hj-res-88"}, {"senator": "Katherine Clark", "party": "Democrat", "sentence": "…he has strengthened our institution, always  leading with values and integrity, bringing a steady hand to his work  along with his encyclopedic knowledge of parliamentary procedure.\n\nI thank Ray for his 13 years of extraordinary service. He is the  model of what it means to be a public servant, waking up every day to  work for the American people. We…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699262/farewell-ray-salazar"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…trauma and suffering are very much intended consequences of  their policies. Cruel indifference to constitutional rights and human  dignity have become standard operating procedure for DHS.\n\nThere could be no more stark proof than the list of names behind us.  It is consistent with the harrowing firsthand accounts that I have  received directly from…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699669/horrific-ice-abuses"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…purposes of the  Congressional Review Act. And a powerful special interest that controls  a powerful party can ram whatever it wants through this body without  constitutional procedure, without judicial safeguards, and without  compromise.\n\nSo they broke wide open the window of what can be brought through the  Congressional Review Act in time. It used to…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691656/congressional-review-act"}, {"senator": "Richard Neal", "party": "Democrat", "sentence": "…This  is not to be about an end-zone dance. This is about to declare a major  victory for the American people.\n\nDespite what I have heard, they have used every maneuver and  procedure to prevent the very debate that we are going to have for the  next hour. All these years later, they never even had a plan or an  alternative.\n\nWe can finally choose families,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698788/breaking-the-gridlock-act"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "Ms. BONAMICI. Mr. Speaker, I rise today to condemn the decision of my  colleagues to block the House from  considering resolutions of inquiry, a procedure that is designed to get  Members of Congress factual information from the executive branch.\n\nEducation Committee Ranking Member Scott and I introduced a  resolution of inquiry…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690500/blocking-resolutions-of-inquiry"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…Centers for Medicaid &  Medicaid Services, the administrator, Dr. Oz--yes, that guy--decided  they should curb waste by letting the government use AI to decide if  your medical procedure is really necessary.\n\nThat means for-profit companies will use bots to deny care for  seniors and working people and will get rich doing it at your expense.  Right now, there…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695746/fighting-for-affordable-quality-healthcare"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…it did in 1961.\n\nBut once Congress acts again, pursuant to its express grant       of constitutional authority, and repeals the legislation that       creates the existing procedure for District residents to       select presidential electors, that will remove the       legislative provision providing for the District's       participation in presidential…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695641/district-of-columbia-policing-protection-act"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…discrimination against  people with disabilities in the organ transplant system. Specifically,  it prohibits eligible individuals from being denied a lifesaving  transplant procedure based solely on their disability status. It is  unthinkable that people with disabilities are passed over for  lifesaving transplants based on discriminatory and subjective…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692715/charlotte-woodward-organ-transplant-discrimination-prevention-act"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…the Notices of Decision at       issue here because the notices themselves stated that CRA did       not apply. After receiving your request, we followed our       regular procedure and sent a formal letter to EPA on February       25, 2025, seeking factual information and the agency's legal       views on this matter. Although EPA resubmitted the Notices…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691583/hj-res-88"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…agency must submit the rule to both       the House of Representatives and the Senate, as well as the       Comptroller General. CRA incorporates the Administrative       Procedure Act's (APA) definition of a rule for this purpose,       with three exceptions. We conclude that the Barred Owl ROD is       a rule for purposes of CRA because it meets the…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693338/us-government-accountability-office-legal-opinion"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…awarded--first of all, they  were vetted inside these departments and awarded, then, based on merit  back in March of 2024. In essence, they were legal, following standard  procedure, and were regulated by Federal agencies with receivables  awarded and contracts signed.\n\nThe recent appointees to the Cabinet agencies, however, reneged on  all of these…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695604/devastating-harm-caused-by-trump-administration"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…are trying to justify it by  creating this balancing effort to suggest that Republicans are not  cutting Medicaid but are just going to put in place some seven-bank  shot procedure where the $880 billion is still at risk but Republicans  can do it without voting to say that the majority actually cut  Medicaid.\n\nMy colleagues can't just hide the ball.…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690628/republican-tax-cuts"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…daily warehouse department in shipping,  selection, loading, and storage. Mr. Jennings was also crucial in  assisting with the training of SpartanNash teams during changes in  procedure, and worked with warehouse leads to coordinate the day-to-day  scheduling of associates. Our West Michigan Community is fortunate to  have lived and worked alongside Mr.…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689251/recognizing-the-retirement-of-robert-jennings"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…cost.  The HSA is a thousand-dollar average. Look at the average cost for  heart surgery. Just the surgery, not even the stay, is between $30,000  and $200,000 just for the procedure. I don't even know how much my  cancer surgery cost because I had health insurance. I didn't have to  check it like that. We had to pay some deductible, but nothing  dramatic.…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697216/medical-bills-are-too-high"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…working his way all the way up to the position he serves today: floor  director of the House of Representatives for the last 6 years.\n\nNobody knows the ins and outs of floor procedure better than Ben, and  he is a trusted presence and a familiar face on the floor to all  Members. Ben has had a hand in every piece of legislation that has  crossed the floor…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690848/recognizing-ben-napier"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "…rule to both       the House of Representatives and the Senate, as well as the       Comptroller General. CRA adopts the definition of ``rule''       under the Administrative Procedure Act (APA) but excludes       certain categories of rules from coverage. We conclude that       the North Dakota RMP meets the APA definition of a rule, and       no CRA exception…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693059/us-government-accountability-office-legal-opinion"}, {"senator": "Mike Crapo", "party": "Republican", "sentence": "Mr. CRAPO.  348, the STABLE Trade Policy Act.\n\nSenator Coons is a good friend and a great ally, and, reluctantly, I  stand to oppose this motion on this particular procedure.\n\nFirst, Senator Coons and I agree about much on trade policy,  including the need for the United States to have more high-standard  free-trade agreements, like the United…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688256/unanimous-consent-request-s-348"}, {"senator": "Steve Daines", "party": "Republican", "sentence": "…rule to both       the House of Representatives and the Senate, as well as the       Comptroller General. CRA adopts the definition of ``rule''       under the Administrative Procedure Act (APA) but excludes       certain categories of rules from coverage. We conclude that       the Miles City RMPA meets the APA definition of a rule, and       no CRA exception…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693085/us-government-accountability-office-legal-opinion"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…the basis       of demonstrated competence and qualification for the type of       professional services required and at fair and reasonable       prices.\n\n``(b) Selection Procedure.--The following procedures shall       apply to the procurement of Level 1 or Level 2 acquisition       project or program under this subchapter:\n\n``(1) Statements of qualification…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…in the Judiciary Committee today make a  great point. That uniform now includes a bulletproof vest. They know  what they have signed up for. They wear that as a matter of procedure  because every single day they go out there, they assume they may be  shot at.\n\nI am asking my colleagues to consider the importance of this  legislation and encourage them…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691402/motion-to-discharge-s-res-195"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…this Act shall preempt       rights or obligations under subchapter II of chapter 5 of       title 5, United States Code (commonly referred to as the       ``Administrative Procedure Act'').\n\nMr. WESTERMAN.  1001, the bill now under  consideration.\n\nMr. Speaker, I rise in support of H.R. 1001 sponsored by  Congresswoman Hageman. This bill requires the…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691060/memorandum-of-understanding-to-address-potential-impacts-of-a-certain-record-of-decision-on-the-upper-colorado-river-basin-fund"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…other day, a piece of healthcare  paperwork. I think it might have been from the Indian Health Service.  It was a three-part NCR paper for a purchase order for a healthcare  procedure that you fill out and, I think, faxed it in. Have we lost our  minds?\n\nYet, we get protesters from the left saying: Don't use technology.\n\nYou have seen article after article…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690586/economic-anxiety"}, {"senator": "Dan Newhouse", "party": "Republican", "sentence": "Mr. NEWHOUSE. Mr. Speaker, due to a previously scheduled medical  procedure, I was unable to vote today. Had I been present, I would have  voted NAY on Roll Call No. 263 and YEA on Roll Call No. 264.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695336/stop-illegal-entry-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…(iii), by adding ``or'' at the end.       SEC. 10. FINDINGS BY SECRETARY.\n\n(a) Order To Leave Waters Upon Failure To Submit to       Jurisdiction of Pacific Island Party; Procedure Applicable.--      Section 11(a) (16 U.S.C. 973i(a)) is amended--\n\n(1) by striking ``, all Limited Areas,'';\n\n(2) in paragraph (1)--\n\n(A) in subparagraph (A), by striking…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691006/south-pacific-tuna-treaty-act-of-2025"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…courts in action. That is almost  totally true of Federal courts. I believe most States do allow cameras  in the courtrooms, although not necessarily required under State  procedure in State courtrooms.\n\nI have long held that cameras should be present in the Federal  courts, including the Supreme Court, because what I said about State  courts is not…", "date": "2025-11-04", "source_url": "https://justfacts.votesmart.org/public-statement/1696518/cameras-in-the-courtroom"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "…rule to both       the House of Representatives and the Senate, as well as the       Comptroller General. CRA adopts the definition of rule under       the Administrative Procedure Act (APA) but excludes certain       categories of rules from coverage. We conclude that the Grand       Staircase RMP meets APA's definition of a rule, and that no…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700255/us-government-accountability-office-decision"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "Mr. PAUL. Mr. President, Senate Standing Rule XXVI requires each  committee to adopt rules to govern the procedure of the committee and  to publish those rules in the Congressional Record not later than March  1 of the first year of each Congress. On February 27, 2025, a majority  of…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688278/us-senate-subcommittee-on-disaster-management-district-of-columbia-and-census-rules-of-procedure"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…and thank Representative Wied for his leadership on this  crucial deregulatory initiative.\n\nIn addition to regulations that are promulgated pursuant to the  Administrative Procedure Act, there exists a vast scope of additional  regulatory documents that impact small businesses. These are guidance  documents, memoranda, bulletins, circulars, letters,…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697347/destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…along the way. When United Way activated its FRC in  Ridge Manor, Donna oversaw operations for distribution at the center-- prepackaging food and toiletry bags, creating a procedure to collecting  and filling the needs, and organizing all items donated to us and  distributed out. This effort took place daily for 30 days. Without  Donna and her ability…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692146/recognizing-donna-telesco"}]