[{"senator": "Ed Case", "party": "Democrat", "sentence": "…and resilience in our  environment. They provide critical habitats for wildlife, including  pollinators like bees and butterflies, which are essential for  agricultural productivity. They also help reduce our reliance on  chemical fertilizers and pesticides, prevent soil erosion and improve  water quality. Beyond their environmental benefits, native…", "date": "2025-03-21", "source_url": "https://justfacts.votesmart.org/public-statement/1688920/supporting-the-designation-of-april-2025-as-national-native-plant-month"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…communities. The figures are  staggering, and here are just a few highlights.\n\nIn 2026, dirty diesel is projected to cause nearly 500,000 lost  workdays, impacting our Nation's productivity; over 3,500 heart  attacks; thousands of cases of respiratory illness; and, yes, over  8,000 deaths. Dirty diesel will cost Americans over $90 billion in  health damages.…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690432/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-nox-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "Zoe Lofgren", "party": "Democrat", "sentence": "…Science, Space, and Technology Committee generated substantial  momentum through the bipartisan CHIPS and Science Act, which included  research support towards agriculture productivity improvement goals.  The DOE and USDA Interagency Research Act would sustain and strengthen  this momentum in its entirety, by empowering deeper collaboration  between these…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689015/doe-and-usda-interagency-research-act"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…qualities; they are tangible assets that veterans bring to our  businesses, our communities, and to our government. They are qualities  that drive innovation. They boost productivity and foster a culture of  excellence. Employing our Nation's veterans when they transition to  civilian life is not just a responsibility; it is a smart business  decision.…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688440/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…owners on how to  evaluate artificial intelligence. I commend Mr. Alford and Ms. Scholten  for working together on this bipartisan legislation.\n\nAI has the potential to boost productivity, enhance customer service,  and save costs. While it is becoming increasingly common for small  businesses to use AI to streamline their operations, many still do not  know…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699178/ai-for-main-street-act"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "Mr. COURTNEY. Mr. Speaker, we are now in the eighth week of the 119th  Congress, which has distinguished itself with incredibly low  productivity and low effort.\n\nSo far, we have brought up just a bunch of moldy old leftovers from  the last Congress. We have been averaging roughly about two votes a day  since the…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687944/republican-budget-betrays-middle-class"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…up, the actual economy slows down.  This is what is taken in.\n\nThe secret is: How do we adopt regulations and modernize it? How do  we adopt tax policy that incentivizes productivity? How do we do the  whole thing and get them to interact?\n\nWe maximize economic growth, and that growth becomes tax collection  stability and gets us to the top of the total…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690586/economic-anxiety"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…believe in free markets. I actually believe in the elegance of  competition. We are actually going to touch a little bit on the  economics of creative destruction. If you want productivity--because I  am going to show in these charts where we are demographically, if we  don't have an explosion of productivity, we can't make wages go up.\n\nIf you are a working…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694915/facts-and-math"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…people to compete  with your working poor. That is the cruelty of what the last  administration did. They crushed working people's wages.\n\nI want to grow the economy, grow productivity, and make this society  wealthier. We are the only country in the entire industrialized world  that hasn't moved to a talented-based immigration system so that we can  grow…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692327/math-always-wins"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…tasks and functions that artificial       intelligence can reliably and effectively perform, including       whether artificial intelligence can improve operations,       productivity, or customer service; and\n\n``(10) how to determine whether an artificial intelligence       tool adequately fills a need and is worth adopting.\n\n``(c) Accuracy and Maintenance.--…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699206/artificial-intelligence-wisdom-for-innovative-small-enterprises-act"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…dominant leader in artificial intelligence. AI has  applications across financial services, education, medicine,  pharmaceutical development, and manufacturing efficiency and  productivity. We have only begun to see all its potential. AI will help  us deter our adversaries through the applications that AI presents by  strengthening the capabilities of our…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699277/highlighting-republican-successes-in-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…what is in the law, where everyone's taxes go up. It  maintains consumption, but you don't get the same type of economic pop  of doing things that create investments in productivity and those  things.\n\nThis is your reason that we have to battle through this, and the  absolute absurdity I get from some of our brothers and sisters out  there, you can't…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691811/actual-solutions"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…interagency data system for  environmental permitting and integrate AI into agencies' permitting  processes.\n\nAs the world increasingly adopts new technology solutions to boost  productivity and improve project outcomes, the Federal Government must  do the same or risk being left behind.\n\nThe ePermit Act takes a strong step in the right direction by  modernizing…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697679/epermit-act"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…far? Inflation  is at the lowest it has been in 5 years. More Americans are working-- millions more--and wages are going up. The economy continues to see  robust growth. Productivity grew twice as fast last year as it has over  the past decade. That is what we have been able to deliver. These are  the facts and figures.\n\nLet me put it in personal terms.…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700171/state-of-the-union-address"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…that is decades out of date with what we are  demographically. This is happening over the entire industrialized  world, but in our society here, if I can raise wages and productivity  of those who are in the workforce, I have resources to cover the  promised benefits, because we made a deal. We have a societal deal that  we are going to cover Medicare…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699988/math-is-such-an-anathema"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…to deduct 100 percent of their  expenses for manufacturing purchases. That means that manufacturers of  every variety will add equipment to their plants, increasing the  productivity and the pay of existing workers, and adding new jobs to  make that equipment.\n\nBy opening America's vast energy resources, domestic production is  about to rev up, a declaration…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693629/democrats-big-mistake"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…connection.\n\nFarmers in rural Ohio also know that reliable broadband connections  are essential to their operations. After all, it helps deploy  technologies that increase productivity, produce higher yields, and  minimize operating costs.\n\nToday's smart agriculture technology, from autonomous tractors to  distributed soil sensors, rely on internet connections…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693469/precision-agriculture-satellite-connectivity-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…all over the industrialized world.\n\nThis is why getting tax policy, regulatory policy things, so  correct--because we are going to have to be able to find a way to have  productivity grow and grow so we can raise people's wages because so  many of our brothers and sisters are poorer today. The way you raise  wages is two things: inflation--well, that…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697051/facing-fiscal-reality"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…competitors just did it, so the next year, we have to  do it again.\n\nThat was one of the reasons, particularly prepandemic, we had that  sudden spike of capital expenditures and productivity. The punch line  on that is that does not exist now. It is our fading out for those C  corporations, which had their rates already locked in, but also for all  those other…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688035/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Cliff Bentz", "party": "Republican", "sentence": "…and they are serious. At a time when even the  President is concerned about beef prices, these losses affect everyone  by reducing the size of the cattle herds and their productivity.\n\nThere has been legislation enacted, both in the One Big Beautiful  Bill Act and at the State level, to try to bring some reimbursement  equity into play by providing at…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697857/unfair-enforcement-of-endangered-species-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…able to more expeditiously resolve cases as the  legislation enhances the efficiency of its judicial review to the  benefit of the taxpayer. This will increase the court's productivity,  and Tax Court judges will also be held to the same disqualification  standards as other judges. Finally, the court will now have the ability  to extend taxpayer deadlines…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697269/tax-court-improvement-act"}]