[{"senator": "Steve Cohen", "party": "Democrat", "sentence": "…building a relationship. And relationships  are what all of this is built upon.''\n\nI congratulate Dean McClellan for a stellar career advancing legal  education and helping produce the talented legal professionals for  which the university is known.", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693637/congratulating-sue-ann-mcclellan-on-her-retirement"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…not. I am troubled by that. We will see how the  amendment process goes.\n\nAgain, beneath all of that is a really good bill that a lot of very  good people worked very hard to produce. I hope that when we get  through the end of this process and actually pass the bill and send it  off to the President, we get that bill back, because it is really  important…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695253/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…Internet of Things. In short and simply, it is the digitization of our  manufacturing process.\n\nNow a lot of people are calling it artificial intelligence, how we  design, produce, manufacture, and ship capital-intensive, large-scale  equipment made of steel. Now, I happen to know enough about the auto  industry and how complex and interconnected it…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689752/reflecting-on-americas-history"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…by the Department of Energy but by the National Petroleum  Council, an industry advisory body for Big Oil and Gas. I have no doubt  that the National Petroleum Council will produce a biased report that  will likely complain about every environmental regulation that they  don't like, but that protects the American people. That is what  Republicans have…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697034/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…to the  CEO of Target, to take one example, consumers could see higher prices  within days. This is not something 6 months out. That includes  everything: the price of gas, produce, cars, cheese, dairy products,  coffee, even chocolate.\n\nAmerican farmers will pay more for fertilizer, which means food  prices go up. New furniture will become more expensive,…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688408/joint-session-of-congress"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…container now costs $13,000. How do you deal with that? A hit to the  margin is--no business can absorb that.\n\nVermont is also home to one of two businesses in the world that  produce these unique snow globes, and they have been in business for 25  years. It is a modest business, but it is one that was created by a  Vermont entrepreneur, and it has been…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690522/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Chellie Pingree", "party": "Democrat", "sentence": "…wouldn't be standing here today if they and so many others on both  sides of the aisle hadn't put in this work.\n\nI am pleased we were able to reach a bipartisan agreement to produce  a bill that protects Tribal lands and the environment, invests in our  Tribal communities, supports the arts, and rejects billions in extreme  cuts proposed by the administration.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698754/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…You are wasting energy, and you are wasting water.\n\nThe bottom line is that manufacturers didn't want this. They largely  rejected this move by President Trump  and didn't produce showerheads that exceeded the limit that existed.  That was because they knew that consumers value money-saving and water  conservation showerheads that are good for both…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698564/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…crisis?\n\nThere is a healthcare crisis. The Democratic Party has passed this on  to me. I want to give them full credit for it. I am going to adopt it  as my own, but I did not produce it.\n\nIt says here--this is a part of the crisis--slashing Medicaid with  the largest cut in history. I said that. I am repeating myself. Some  things bear repeating. Slashing…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695807/censured-but-not-silenced"}, {"senator": "Rob Menendez", "party": "Democrat", "sentence": "…Further, my colleagues across the aisle should tell the Trump  administration to get Revolution Wind, which is off the coast of Rhode  Island, back on track. That is how we produce more energy in this  country. Doing so would bring down prices for American families in the  process.\n\nMr. Speaker, I am strongly opposed to this bill, and I urge my  colleagues…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697095/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…narcotraffickers, they have had the ability the entire time to bring a  resolution before us and have that debate in front of the American  public. I have a feeling that debate would produce some positive votes  if it were limited enough, but to allow a President to do it by secret  without Congress having the guts to have the debate and vote about  whether the…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696123/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…14th in the  world for solar panel manufacturing. Today, we are third.\n\nThis happened in large part due to Congress providing long-term  certainty for tax incentives to both produce and deploy American-made  energy technologies.\n\nClearly, this strategy was working, but the Republicans' big, ugly  tax scam is putting hundreds of thousands of American energy…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692366/american-energy-jobs-at-risk"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…evaporating retirement savings, businesses losing  capital, cars not being sold, and rising unemployment that has started  in industrial and agricultural America.\n\nOur people produce real products for market, and we know what pink  slips are. Too many families are fearing for their financial futures,  with senior citizens unable to meet the rising cost…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689621/quelling-us-financial-markets"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…formula for their babies and folks who need help buying food so that  maybe their children's bellies aren't empty when they are going to  school. Services by farmers who actually produce goods that are sold  into this agricultural program would be cut.\n\nThey are cutting funding to the Small Business Administration. Most  people in my district are interested…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695040/better-is-possible"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…market for U.S.-made wines, costing American brands tens of  millions in sales.''\n\nVirginia is one of the top 10 States in the country in the volume of  wine production. We also produce a lot of whiskey and other spirits.  And Canadians like to buy American products. But the retaliation and  the anger at the United States has caused many to decide to pull…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696447/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…two minority amendments that  required DOI to report to Congress on barriers to byproduct mineral  production on Federal lands and to examine projects with the potential  to produce hard rock minerals from coal ash and coal byproducts.\n\nMr. Speaker, the alternative to American mineral dominance is buying  foreign minerals from supply chains controlled…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699695/critical-mineral-dominance-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…American households. Frozen food is more than just a convenient  option. It is a solution to food waste and a way to save families  hundreds of dollars.\n\nStudies show that frozen produce is less likely to be wasted compared  to fresh produce that spoils over time, giving consumers access to  affordable, nutritious food year-around.\n\nBy freezing food at its…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689069/frozen-food"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…the most hate mail.  It also is the truth. This is the 30-year projection. If my colleagues  look at the 30-year projection from the Congressional Budget Office--I  didn't produce this. They did, and we believe it is already way out of  date because of the change in interest rates--Social Security and  Medicare and their interest carry are responsible…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688088/republican-budget"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…sophisticated computing, and  advanced microchips. Intellectual property is also foundational for  movies, music, publishing, and much more.\n\nIntellectual property industries produce almost 80 percent of U.S.  commodity exports. Many of these industries even have trade surpluses  since the United States is the world's top intellectual property  exporter,…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691132/world-ip-day-and-inventions-caucus"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…publicly       available information to construct our applications for       coverage and subsidies. We also used publicly available       hardware, software, and materials to produce counterfeit       documents that we submitted, if appropriate for our testing,       when instructed to do so. We then observed the outcomes of       the document submissions,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698800/breaking-the-gridlock-act"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "…to its logical conclusion and repeated, over and  over again, and applied even to noncontroversial bills, this ends up  being sort of extortive in its effect, and it doesn't produce a good  outcome--not for people of either party, not for people of either  legislative Chamber, and, certainly, not for the American people.\n\nJust yesterday, we were able…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698423/unanimous-consent-requests-the-calendar"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…of the commission would not be compensated. Lastly, the bill       would award the medal to three officers.\n\nCBO estimates that the cost to design, manufacture, and       produce each medal would be about $250, and based on the       number of officers killed in the line of duty in recent       years, that about 150 officers would be eligible to receive…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699505/medal-of-sacrifice-act-of-2025"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…the 116th  Congress and 163 in the 117th Congress. Contrast this to the 200 total  rules in the Republican-led 118th Congress. For the 119th, we are on  pace to once again produce nearly 200 rules for the Congress.\n\nMr. Speaker, we are doing our job. We are not closing out debate. We  are having plenty of debate. There are plenty of opportunities for…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696900/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision-providing-for-consideration-of-h-con-res-denouncing-the-horrors-of-socialism-providing-for-consideration-of-hr-unlocking-our-domestic-lng-potential-act-of-providing-for-consideration-of-hr-researching-efficient-federal-improvements-for-necessary-energy-refining-act-providing-for-consideration-of-hr-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-providing-for-consideration-of-hr-district-of-columbia-cash-bail-reform-act-of-and-for-other-purposes"}, {"senator": "Troy Balderson", "party": "Republican", "sentence": "…already required  to meet.\n\nSimply put, there is no reason that the United States Government  should make it easier to manufacture these critical products abroad  than it is to produce them here at home.\n\nTo be sold in interstate commerce, the Department of Transportation  requires compressed gas cylinders to be manufactured to specific  standards and properly…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692180/compressed-gas-cylinder-safety-and-oversight-improvements-act-of-2025"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…in place and have the  regulations that follow and turn the entrepreneurs and innovators loose  in this country, we are number one in the world--number one in the  world. We produce more natural gas. It is the cleanest.\n\nThis is what we are looking at. We had a hearing early this year with  our RTOs and ISOs that regulate across the energy grid out there.…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698073/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…really nothing about  worldwide CO2 production. That is the truth. China and India  are pumping it out.\n\nMeanwhile, my colleagues love to ignore the slave labor in China to  produce the batteries that they drive around in their EVs while they  pat themselves on the back and go to cocktail parties talking about how  fantastic it is that they drive their…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690387/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…Biden administration, Mr. Speaker, on  December 8, mere weeks before the transition to the Trump  administration.\n\nLast Congress I was proud to introduce the Alaska's Right to Produce  Act which reversed many of these same anti-American energy policies of  the Biden administration and passed the House with bipartisan support.\n\nAlaska is blessed with a tremendous…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696829/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…annually for our State's  economy.\n\nIt is important that in addition to recognizing the success and  strength of this industry, we also acknowledge the challenges it takes  to produce the dairy products that we all know and love.\n\nRising costs, outdated Federal regulations, and policies that don't  reflect the realities on the ground have all hurt this…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692463/national-dairy-month"}, {"senator": "Nathaniel Moran", "party": "Republican", "sentence": "…more effectively, and it helps taxpayers find  resolution more easily and quickly.\n\nFirst, this bill modernizes the court's subpoena rules. Today, if  someone is subpoenaed to produce documents before the Tax Court, they  must show up in person. This wastes time, adds expense, and clogs an  already full docket. Other Article I and Article III courts already…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697270/tax-court-improvement-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…will put in a shameless plug for our bipartisan legislation that is  not only tech neutral, but it is agnostic to the project, the project  type.\n\nIt would definitely help us produce more energy in America, and it  will also help us to build things in America again, something we  desperately need to do. We will debate that Thursday, and, hopefully,  some…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696879/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}]