[{"senator": "Jim McGovern", "party": "Democrat", "sentence": "…have partnered  to help thousands of low-income New Yorkers with diet-driven chronic  diseases purchase more nutritious food. The United Way of New York City  is anchoring one produce prescription project, Connect2Food, that  provides hungry people with $80 per month to purchase fresh fruits and  vegetables.\n\nThis innovative work is teaching us that increased…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689401/end-hunger-now-with-innovative-ways-to-feed-hungry-people"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…You are wasting energy, and you are wasting water.\n\nThe bottom line is that manufacturers didn't want this. They largely  rejected this move by President Trump  and didn't produce showerheads that exceeded the limit that existed.  That was because they knew that consumers value money-saving and water  conservation showerheads that are good for both…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698564/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…occurred along the  Korean Peninsula, which still remains divided but which accesses oil  from multiple fields along the eastern rims of both nations. Today,  South Korea does not produce oil, but it has the fifth largest refining  capacity in the world after the U.S., China, Russia, and India.\n\nIn Vietnam, over 58,280 conscripted U.S. troops died near the…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698837/reflecting-on-impact-of-illegal-action-in-venezuela"}, {"senator": "Rob Menendez", "party": "Democrat", "sentence": "…Further, my colleagues across the aisle should tell the Trump  administration to get Revolution Wind, which is off the coast of Rhode  Island, back on track. That is how we produce more energy in this  country. Doing so would bring down prices for American families in the  process.\n\nMr. Speaker, I am strongly opposed to this bill, and I urge my  colleagues…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697095/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…Williams, who are the  two members of the staff who worked on acquisition reform and worked on  all of those nitty-gritty details that are very difficult to understand  to help us produce such a great product. I publicly thank both of them  for their incredible work on this issue.\n\nMr. Speaker, I do support this bill. That does not mean that I don't  have concerns.…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697790/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…finance Arctic drilling projects. Yet, here we are.\n\nThe Coastal Plain is too remote, too costly, and too risky to make  drilling financially feasible, especially when we already produce  record oil and gas volumes elsewhere at a far lower cost to taxpayers,  including in my district, the Permian Basin.\n\nLet's be clear, Arctic drilling will not lower gas prices.…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696880/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "Mr. HIMES. Mr. Speaker, I thank the gentlewoman from California for  this opportunity to speak because this is one of the most ignorant  things I have seen this House produce in a very long time.\n\nIt stuns me, frankly, that my good friends, Congressmen Hill, Steil,  and Barr, are associating themselves with this bill.\n\nLet's be super clear about…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693726/anti-cbdc-surveillance-state-act"}, {"senator": "Nelida Pou", "party": "Democrat", "sentence": "…serving Lodi students, Melanie's lessons  encourage critical thinking and creativity.\n\nShe also pioneered an academic yearbook course allowing students to  design, write, and produce the school's yearbook, building  collaboration and pride in their work. Colleagues praise her  exceptional ability to make every student feel seen and valued.\n\nBoth Christine…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698570/lodi-teachers-recognition"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…growth, now reaching over 6  million weekly listeners across 138 different countries. Miller's  leadership and judgement is apparent in the more than 20,000 segments  he helped produce. This expertise was especially critical as he led the  program through unprecedented periods of technological transition.\n\nThanks in large part to Miller, Fresh Air has become…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697682/recognizing-the-retirement-of-danny-miller-as-co-executive-producer-of-fresh-air"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…the top 20  percent; everybody else gets peanuts. That is what this cut is aimed at  trying to offset, the impact, the fiscal impact, on the deficit that  these tax cuts will produce over the next 10 years.\n\nThe Committee for a Responsible Federal Budget issued their report  last night and they conclude that this plan is going to add $4 trillion  to the…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1690996/budget-reconciliation-bill"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…dramatically increase premiums for more  than 198,000 Oregonians, including my constituent Teresa from Clatsop  County. Teresa, a small business owner, runs a small flower and produce  farm. Like many small business owners, she purchases her coverage on  the Oregon health care exchange. Because of Republicans' refusal to  protect health care, her premium…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696722/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…be worked up in the international community  that will help slow down the Russian war machine. They are an  incredibly large country, and they have built huge factories to produce  cruise missiles, and so, nightly, Ukraine is hammered with hundreds  now. So it just means more resolve by the United States, more resolve  by Europe.\n\nI am surprised to…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…market for U.S.-made wines, costing American brands tens of  millions in sales.''\n\nVirginia is one of the top 10 States in the country in the volume of  wine production. We also produce a lot of whiskey and other spirits.  And Canadians like to buy American products. But the retaliation and  the anger at the United States has caused many to decide to pull…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696447/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…to close and another one is in the process of closing.  Two others have spent billions of dollars to work on transitional  fuels, to put investment into those refineries to produce biofuels that  are part of the transition to cleaner, safer, more economical energy  sources. The last one, Chevron, is doing both.\n\nI must say I am reminded, as I sit here,…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697035/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…are thousands of  Americans that are dying every year due to overdose.\n\nBut those overdoses, as people know, are mainly from a drug called  fentanyl. Well, Venezuela doesn't produce any fentanyl. What Venezuela  produces and ships is cocaine.\n\nNow, cocaine can kill you. But that cocaine isn't even coming to the  United States. Reports are that 90 percent…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698610/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…outright, creating long-term certainty for this project.\n\nConstructing this road and allowing access to the Ambler Mining  District is expected to create thousands of new jobs and produce $1.1  billion of revenue for Alaska. Road construction alone will create more  than 350 jobs, creating economic opportunity desperately needed in  rural Alaska.\n\nKeep in mind,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694898/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…investment of $100 billion  for our national defense after years of underinvestment.\n\nAs chairman of the Transportation and Infrastructure Committee, we  are ready to do our part to produce a bill that fulfills President  Trump's border security agenda by providing funding for the United  States Coast Guard for drug and migrant interdiction.\n\nThe Coast Guard…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688038/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…the Biden administration because, right as they  were putting sanctions on Alaska, they were taking them off of places  like Iran and Venezuela to free up those nations to produce more.\n\nLet me reiterate how the Biden administration went about doing this.  The 2022 plan replaced the 2020 plan, which was put in place after an  environmental review process…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696449/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…publicly       available information to construct our applications for       coverage and subsidies. We also used publicly available       hardware, software, and materials to produce counterfeit       documents that we submitted, if appropriate for our testing,       when instructed to do so. We then observed the outcomes of       the document submissions,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698800/breaking-the-gridlock-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…American households. Frozen food is more than just a convenient  option. It is a solution to food waste and a way to save families  hundreds of dollars.\n\nStudies show that frozen produce is less likely to be wasted compared  to fresh produce that spoils over time, giving consumers access to  affordable, nutritious food year-around.\n\nBy freezing food at its…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689069/frozen-food"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…new  energy development, which the energy and water bill does, and ways that  we can burn that coal and our natural gas even cleaner than we are  doing today, even though we produce electricity cleaner with our fossil  fuels than any other country in the world.\n\nGuess what we can do, Mr. Speaker. If we can continue to move forward  and build new plants…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694880/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…refinery in L.A. by  the end of 2025, and the Valero refinery by April 2026.\n\nAccording to a letter from Senate Minority Leader Brian Jones in  California, these two facilities produce about 20 percent of  California's in-State gasoline supply.\n\nAccording to a recent study by USC Professor Michael Mische, the  effect of this is going to be an increase in…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…the 116th  Congress and 163 in the 117th Congress. Contrast this to the 200 total  rules in the Republican-led 118th Congress. For the 119th, we are on  pace to once again produce nearly 200 rules for the Congress.\n\nMr. Speaker, we are doing our job. We are not closing out debate. We  are having plenty of debate. There are plenty of opportunities for…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696900/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision-providing-for-consideration-of-h-con-res-denouncing-the-horrors-of-socialism-providing-for-consideration-of-hr-unlocking-our-domestic-lng-potential-act-of-providing-for-consideration-of-hr-researching-efficient-federal-improvements-for-necessary-energy-refining-act-providing-for-consideration-of-hr-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-providing-for-consideration-of-hr-district-of-columbia-cash-bail-reform-act-of-and-for-other-purposes"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…wind and solar, which are  actively destroying the power grid. They are the least reliable sources  of power and the most expensive. Nobody would use them, and nobody  would produce them, if they weren't subsidized by your tax dollars. It  funds zero-emission vehicles that only the wealthy can afford and  depends on supply chains dominated by China.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694950/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…with  representatives of the agricultural sector, including Dante Galeazzi--I  am going to butcher Dante's name--Galeazzi, who is president and CEO of  Texas International Produce Association, who emphasized to me how  beneficial the Trump tax cuts were for Texas farmers and ranchers.\n\nThe message I heard from all of these impressive Texas entrepreneurs,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690294/texas"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…flexibility to  serve a broader variety of milk in the school lunchroom.\n\nDairy farmers in Pennsylvania's 15th Congressional District and  across our country work hard every day to produce nutritious milk for  our families and communities.\n\nI am proud to lead this legislation that would allow schools to serve  flavored and unflavored whole and reduced-fat milk…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698178/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…Farmers in rural Ohio also know that reliable broadband connections  are essential to their operations. After all, it helps deploy  technologies that increase productivity, produce higher yields, and  minimize operating costs.\n\nToday's smart agriculture technology, from autonomous tractors to  distributed soil sensors, rely on internet connections to…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693469/precision-agriculture-satellite-connectivity-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…action that has  the support of local North Slope communities and Native Villages.\n\nLast Congress, we held a bipartisan legislative hearing on H.R. 6285,  ``Alaska's Right to Produce Act,'' where we heard from Tribal  representatives, including Inupiat leadership from the Native Village  of Kaktovik, the only indigenous Tribal community within ANWR.\n\nIn…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696830/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…energy strategies.\n\nDeveloping countries don't want to force their people to live in  poverty because of a lack of energy, so they are going to use coal.  What we can do is produce that coal. We can help them if we unleash our  technological advantages and help find better ways to use coal and  natural gas more cleanly. We should use our expertise in…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694868/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…funds--we spent $1.2 trillion on interest last year.  Interest was the second biggest expense in this government last year,  and it is getting worse.\n\nWhat happens when we produce economic growth? We see this in red  here. Our debt projections are actually every bit as bad as last year.  That means for every dollar we take in, in tax receipts--remember…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698698/congress-is-a-math-free-zone"}]