[{"senator": "Tim Kaine", "party": "Democrat", "sentence": "…sinister and pernicious motives. The peace  often, sometimes perhaps the liberty, of nations has been the victim.\n\nSo likewise, a passionate attachment of one nation for another  produces a variety of evils. Sympathy for the favorite nation,  facilitating the illusion of an imaginary common interest in cases  where no real common interest exists and infusing…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700163/reading-of-washingtons-farewell-address"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…Shockingly, Vice President Vance himself helped cancel this hydrogen- based modern steel project in his own hometown of Middletown, Ohio.\n\nOur Ohio community knows that China produces way too much steel and  knows exactly how to wipe out elements of production. Thus, the Vice  President's actions make absolutely no sense.\n\nMr. Speaker, also joining us this…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695604/devastating-harm-caused-by-trump-administration"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…devastating wildfires and hurricanes that we have seen, fueled by  climate change, aren't just our children's problem. They are here  today. The pollution that this methane gas produces affects our  children's health today. It affects their respiratory health, among  other things.\n\nWhile Republicans are pushing tax breaks for billionaires and  corporate polluters,…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688185/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…shipped around the world.  You don't need to add water, and it saves the lives of children.\n\nEdesia Nutrition in North Kingstown, Rhode Island, is one of the  factories that produces Plumpy'Nut. From that factory alone, over the  last decade, 25 million children have been saved with this treatment.\n\nFunding was cut off at the beginning of the Trump administration…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691610/global-report-on-food-crisis"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…school-age Girl Scouts must identify  and investigate an issue they care about, devise a plan, and then lead  a team of experts and community members to implement a project that  produces lasting change. Over the course of 1 to 2 years, Gold Award  Girl Scouts demonstrate significant initiative, commitment, and  leadership, distinguishing them from their peers.…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693242/recognizing-adelyn-kim"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…value-added impacts.\n\nAnd the list goes on and on and on.\n\nA study by the American Meteorological Society found that every  dollar invested in the National Weather Service produces $73 in value  to the American people.\n\nNOAA isn't a creature of Washington, DC. It is in Norman, OK, where  NOAA's Storm Prediction Center tracks severe weather and tornado…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688171/national-oceanic-and-atmospheric-administration"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…collapsing into their arms  from hunger.\n\nFor years, the United States has stepped up in the face of these  tragedies. Edesia, an organization in my district in Rhode Island,  produces ready-made, ready-to-use food therapeutics called Plumpy'Nut  that has saved millions of lives in Sudan and more than 60 other  countries.\n\nThe Trump administration has stopped…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690624/support-for-edesia"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "…me in celebrating the  remarkable life and accomplishments of M. Casey D. Younger, Sr. He is a  shining example of the talent, discipline, and integrity that  Mississippi produces and a role model for future generations.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695590/9999"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…corporations to avoid paying  the taxes they owe under existing law.\n\nNevertheless, this bill is better than it would have otherwise been.  IRS data indicates that every $1 produces $7. A Harvard study shows  that for the top 10 percent, every dollar invested in enforcement  brings us $12 in additional revenue in taxes owed but not paid. Who  will have…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699056/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Jim Costa", "party": "Democrat", "sentence": "…honor Joel Nelson, a proud son of  the San Joaquin Valley who served 37 years as the head of California  Citrus Mutual.\n\nMr. Speaker, you should understand that California produces 80  percent of all the citrus consumed in the United States: navels,  Valencias, mandarins, and lemons.\n\nJoel was the leader for the voice of our citrus growers and a fierce…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693899/denouncing-cuts-to-k-12-schools"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "Ms. KAPTUR. Mr. Speaker, as Representative of the Ohio region that  produces the most eggs in our Nation, I rise to say happy National Egg  Day: Easter eggs, chocolate eggs, egg yolks, egg whites, egg souffle,  meringue pie, egg salad, and so much…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691814/recognizing-national-egg-day"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…next generation, making it less likely that  we can effectively provide the programs, the foundation of healthcare  and housing and education and the investment in R&D that produces good- paying jobs for the next generation to thrive.\n\nThat is wrong. It is wrong to proceed to borrow and compromise the  next generation in order to give tax breaks to billionaires.…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693102/one-big-beautiful-bill"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…administration, we produced more oil than any country in the history of  humanity.\n\nThe same is true for natural gas. The same is true for LNG exports.  The United States produces more oil than any other country in the  world. We produce more natural gas than any other country in the world.  We are the leading exporter of liquefied natural gas, which,…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688166/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…Beer,''  evaluates beers from around the world and recognizes the top brewers  and their beers. Founded in 2012 and nestled in the Heart of the  Rockies, Elevation Beer Company produces seasonal Belgian ales,  specialty brews, and barrel-aged beers that put a twist on traditional  styles of brewing.\n\nSmall businesses like Elevation Beer Company help drive…", "date": "2025-08-08", "source_url": "https://justfacts.votesmart.org/public-statement/1694717/recognizing-elevation-beer-company"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…if such there are, who would sever them from their brethren  and connect them with aliens?''\n\nMr. BEYER. ``So likewise, a passionate attachment of one nation for  another produces a variety of evils. Sympathy for the favorite nation,  facilitating the illusion of an imaginary common interest in cases  where no real common interest exists, and infusing…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700271/president-washingtons-farewell-address"}, {"senator": "Richard McCormick", "party": "Republican", "sentence": "…Around 21 percent of the global trade passes through the  Taiwan Straits, including 40 percent of the world's container fleet.  The Taiwan Semiconductor Manufacturing Company produces 90 percent of  the world's AI chips, which are crucial to the American economy.\n\nA war in this region would be a global catastrophe. Our Taiwanese  allies are already awaiting…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695256/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…their beekeeping operation. Today, with the guidance of Mr. Bundrick  and the leadership of Jennifer's father, Ken, the Tomlins manage about  400 hives annually. Their farm produces honey, provides pollinator  services, and serves the community through both wholesale and retail  operations, including a storefront offering honey and beekeeping  supplies.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695268/congratulating-the-tomlins-the-2025-okaloosa-county-farm-family-of-the-year"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…our most affordable, reliable, and abundant sources  of energy on the planet. And in America, we can use that coal cleaner  than ever before.\n\nWyoming's Powder River Basin produces the cleanest burning coal in  the world. Nearly half of all coal produced in America comes from the  Powder River Basin in Wyoming and our neighboring State of Montana.  Wyoming's…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689762/coal"}, {"senator": "Richard McCormick", "party": "Republican", "sentence": "…actually taken into consideration. I  don't think this is a partisan issue at all. I definitely want to see  people have access to those very funded things. This actually produces  funds. This actually is a moneymaker for the government and is well- funded and should be well-staffed.\n\nThere shouldn't be any objections to this from the standpoint of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694870/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Paul Gosar", "party": "Republican", "sentence": "…these projects that taxpayer dollars benefited.\n\nOne is called the ``Potential Benefit of Superbrewed Food's  Sustainable Postbiotic Protein on Warfighter Health.'' That one  produces lab-grown protein to shorten recovery time and improve the  concentration of servicemembers. Another is the ``Development of a  Sustainable, Low-Cost, Oil Process for Heart-Healthy…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693694/department-of-defense-appropriations-act-2026"}, {"senator": "Steve Daines", "party": "Republican", "sentence": "Mr. DAINES. Mr. President, hydropower produces affordable, reliable,  and clean baseload power in Montana and across the United States. For  years, I have worked with my colleagues to grow our hydropower  portfolio in…", "date": "2025-07-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694335/requiring-the-federal-energy-regulatory-commission-to-extend-the-time-period-during-which-licensees-are-required-to-commence-construction-of-certain-hydropower-projects"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…44 percent of Federal land.\n\nNorth Dakota is a top 10 coal-producing State and the number 3 oil  and gas producer in the Nation. According to State estimates, North  Dakota produces 400 million barrels of oil, 1.1 trillion cubic feet of  natural gas, and 27.5 million tons of lignite coal annually.\n\nTo put this in perspective, North Dakota produces enough…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694908/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…school-age Girl Scouts must identify  and investigate an issue they care about, devise a plan, and then lead  a team of experts and community members to implement a project that  produces lasting change. Over the course of 1-2 years, Gold Award Girl  Scouts demonstrate significant initiative, commitment, and leadership,  distinguishing them from their peers.…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690422/recognizing-krysta-fowler-gold-award"}, {"senator": "Carlos Gimenez", "party": "Republican", "sentence": "…we become more and more dependent on battery technology, we need  to ensure that these batteries are sourced from nonadversarial  countries. As it stands, Communist China produces approximately 80  percent of the world's batteries and roughly 70 percent of the world's  lithium ion batteries. This dependence puts U.S. supply chains at risk  and threatens…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688683/decoupling-from-foreign-adversarial-battery-dependence-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…critical resource of baseload power as electricity demands  continue to skyrocket. If your State has coal, we should be developing  it, not burying it under bureaucracy. No one produces coal cleaner or  more responsibly than the United States. Nobody understands this better  than President Trump, who is reversing the war on American energy and  ushering in…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694888/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…national security, and Wyoming's energy industry  remains indispensable to ensuring that America stays energy dominant.  Wyoming's Powder River Basin, with its low-sulfur coal, produces the  world's cleanest burning coal. We should be focused on exporting this  abundant natural resource to our allies abroad, not burying this  baseload power under layers of…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696879/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…of owning the Thistle Creek Farms in Warriors Mark.\n\nGeorge has transformed his family's 600-acre farm into a nationally  recognized regenerative livestock operation which produces a premium  beef brand.\n\nMotivated to help owners of small farms succeed, George also devotes  time to mentoring fellow beef farmers.\n\nMr. Speaker, I thank George Lake for…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699740/confronting-the-disease-of-addiction"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…harvest and controlled burns have left many of our forests  dangerously overgrown and chronically undermanaged. We need to harvest  more timber for the economic revenue it produces and for the reduced  fire danger it creates.\n\nGood environmental stewardship means empowering these professionals  to be part of the solution and to help manage our Federal…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697671/support-for-rural-schools"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…individually licensed  earth station or a blanket-licensed earth station, if the license,  grant of market access, or authorization would be held or controlled by  an entity that produces or provides any covered communications  equipment or service or an affiliate of such an entity, and for other  purposes.\n\nThe Clerk read the title of the bill.\n\nThe text of…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690259/secure-space-act-of-2025"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…school-age Girl Scouts must identify  and investigate an issue they care about, devise a plan, and then lead  a team of experts and community members to implement a project that  produces lasting change. Over the course of 1-2 years, Gold Award Girl  Scouts demonstrate significant initiative, commitment, and leadership,  distinguishing them from their peers.…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690867/recognizing-hannah-dickinson-gold-award"}]