[{"senator": "Susie Lee", "party": "Democrat", "sentence": "…forward-thinking civic  development.\n\nI would also like to extend heartfelt gratitude to the dedicated  staff of the Silverado Ranch Community Center. Their tireless efforts,  professionalism, and welcoming spirit have made this first year a  resounding success.\n\nAs we celebrate this anniversary, let it serve as a testament to what  can be accomplished when…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691298/recognizing-the-one-year-anniversary-of-the-silverado-ranch-community-center-in-clark-county-nevada"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…excellence and  innovation within Mission Delta 4. He has consistently inspired  and mentored his team, empowering them to achieve the highest levels of  performance and professionalism. His genuine care for the well-being of  his personnel has created a strong and cohesive unit, dedicated to the  mission and each other.\n\nUnder Colonel Schmitt's command,…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693489/recognizing-colonel-ernest-r-bobby-schmitt"}, {"senator": "Nikki Budzinski", "party": "Democrat", "sentence": "…hearings, briefings, and stakeholder meetings. Regardless of what  policy issue she was tasked with solving, Aleksi approached every task  with a sense of dedication, professionalism, and passion for public  service.\n\nAs the daughter of central Illinois farmers, Aleksi brings to her  role not only technical expertise but also lived experience. She…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695855/thanking-aleksi-knepp-for-her-service-to-illinois-13th-congressional-district"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "…Nick demonstrated  remarkable versatility by engaging across a wide range of fields, from  security and defense to economic and cultural initiatives. Nick's  dedication, professionalism, and unwavering commitment to public  service exemplify the very best of diplomatic tradition. Nick is  transitioning back to the Foreign Office in London, and I wish…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698086/recognizing-nick-alton"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…safety, mental health, and wellness. It means supporting their  families, and it means ensuring they have the tools and resources to  serve our communities with dignity and professionalism. Choosing a life  of service and law enforcement is not easy. It comes with risks that  most of us will never know, but because of officers like Roberto,  Jonah, and Justin,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691300/national-police-week"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…the killings of Alex Pretti and Renee Good are  indefensible, and they cannot stand. They violate the public trust and  stand in direct opposition to the values and the professionalism of  many Federal law enforcement officers who follow the law and serve with  integrity every day.\n\nSince these tragic events, people from every corner of America have…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699402/9999"}, {"senator": "Susie Lee", "party": "Democrat", "sentence": "…II, where she served as an  operational plans officer at the 13th Corps Support Command.\n\nI want to thank Major General Kotulich for her distinguished service,  and her professionalism and passion for service in every role she has  filled throughout her prestigious career. Part of what makes the U.S.  military the greatest in the world is that servicemembers,…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692707/recognizing-deputy-chief-of-army-reserve-major-general-deborah-deb-kotulich-on-her-retirement-from-the-us-army-reserve"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…Middle East, the flashpoint now  is Iran, and we came within an eyelash of getting dragged into yet  another war where the goal was regime change.\n\nI want to acknowledge the professionalism of our Air Force and our  men and women in the military. The strike they were ordered to perform  they executed flawlessly. To them, I extend my congratulations.\n\nBut…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693128/motion-to-discharge-sj-res-59"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…his retirement from SpartanNash in  Byron Center, Michigan. Mr. Jennings was an outstanding associate of  SpartanNash, with  his retirement marking 25 years of incredible professionalism and  service to his coworkers and community. His commitment to excellence in  his role is to be commended, and it is my honor and privilege to  recognize Mr. Jennings…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689251/recognizing-the-retirement-of-robert-jennings"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…constitutional duty. Regardless of what people may think of the  military's execution of its mission last weekend--and our  servicemembers performed with courage, with professionalism, with  extraordinary precision--or their views of its effectiveness--and I  hope and pray the mission was effective--Iran is a malevolent regime,  it is the paramount…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693120/motion-to-discharge-sj-res-59"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…communities safe in the  face of danger.''\n\nI want to be clear. I commend local law enforcement, including the  Orange County Sheriff's Department, which I represent, for their  professionalism and courage. It is a tough job, and I am so grateful  for the men and women who go out there every day and risk their lives  to keep our communities safe.\n\nTo extend these…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692896/condemning-violence-by-ice"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…ultimately became Press  Secretary for both my office and the House Judiciary Committee from  2023 to 2025.\n\nThroughout his tenure, Matt brought an impressive blend of  professionalism, creativity, and humor to the role. As Press Secretary,  he worked tirelessly behind the scenes, ensuring that my office's  messages were clear, concise, and timely. He…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693380/recognizing-matt-jansen-and-his-service-to-the-house-of-representatives"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…difficult, working in close proximity to this tragedy and seeing the  recovery efforts while completing their jobs. My heart goes out to  them, and we thank them for their professionalism in this trying time.\n\nMr. Speaker, in sorrow and shared humanity, I wholeheartedly support  this resolution.", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688368/expressing-condolences-to-the-families-friends-and-loved-ones-of-the-victims-of-the-crash-of-american-eagle-flight-5342-and-pat-25"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…proud and,  frankly, not surprised that all elements of our military worked  together to successfully execute such a dangerous and difficult mission  in Caracas. The skill, professionalism, and courage are beyond question  of these men and women.\n\nBut military capability is not the same as strategic wisdom. The  ability to achieve tactical objectives does…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698780/venezuela"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…Congress, Dr. Carla Hayden.\n\nLast week, she was ruthlessly fired by President Donald J. Trump. Dr.  Hayden is a model public servant who led the Library with dignity and  professionalism for 8 years.\n\nDr. Hayden was the first professional librarian to oversee our  Nation's largest Library, and, yes, I still have too many overdue  Library books.\n\nI worked…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691312/recognizing-dr-carla-hayden"}, {"senator": "Ronny Jackson", "party": "Republican", "sentence": "…office and  service to the people of Texas' 13th Congressional District during  2025. Since being assigned to my office, Major Hanson has made a  profound impact, bringing professionalism, insight, and dedication that  have delivered exceptional results for the constituents I represent.\n\nMajor Hanson entered my office with critical knowledge and experience…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697563/recognizing-and-expressing-gratitude-to-defense-fellow-major-evan-hanson"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "…operational  readiness of the Army Reserve medical community and shaped the careers  of countless soldiers. Her legacy is one of dedication, leadership, and  unwavering professionalism. I ask my colleagues to join me in honoring  her exceptional career and in wishing her continued success and  fulfillment in retirement.", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693420/recognizing-jennie-fregoso-and-her-distinguished-military-career"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…across the country, they earned the prestigious Inspire Award, which  recognizes excellence in programming, robot design, engineering  portfolios, judged presentations, professionalism, as well as community  outreach.\n\nThe Inspire Award is the highest honor presented at the competition,  and it also means that Rebel Robotics secured a world championship…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690724/recognizing-first-national-bank-of-omaha"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…comfort.  Despite daunting challenges and limited equipment, the WREC team  completed a demanding project in just eight days--far ahead of  expectations--demonstrating professionalism, humility, and unwavering  commitment to this life-changing mission.\n\nThe impact of WREC's work goes far beyond electricity; it represents  a bridge to connection, opportunity,…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692424/recognizing-john-blaho"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…comfort.  Despite daunting challenges and limited equipment, the WREC team  completed a demanding project in just eight days--far ahead of  expectations--demonstrating professionalism, humility, and unwavering  commitment to this life-changing mission.\n\nThe impact of WREC's work goes far beyond electricity; it represents  a bridge to connection, opportunity,…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692594/recognizing-clint-jackson"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…October 18, 2024, the team managed an overwhelming volume of calls-- 1,194 through their direct line and another 1,214 through work phones.  Yet every call was met with care, professionalism, and actionable  solutions, reflecting the team's deep commitment to being a lifeline  for the community. The Pasco County Human Services Team exemplifies  what it means…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691971/recognizing-rebecca-seils"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…BOP's biggest obstacles, including addressing chronic  staffing shortages plaguing these and other facilities nationwide.\n\nMr. Speaker, correctional officers serve with professionalism and  courage. As we recognize these important law enforcement officers this  week, I remain committed to resolving these challenges to protect those  who protect our communities.…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690778/recognizing-national-correctional-officers-week"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…protect the people, reduce fear,  and maintain order.\n\nIn every position that he has held, he has embodied the values of  public service and law enforcement with passion, professionalism, and  courage.\n\nBefore his career in law enforcement, Mr. Camhi began his public  service journey as a chief of staff for the New York State Assembly. In  that capacity,…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689427/recognizing-david-camhi"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…advancing business  recruitment, strengthening site and infrastructure readiness, and  fostering prosperity across northwest Georgia. The board of directors  noted his professionalism and commitment as key reasons for his  selection.\n\nPlease join me in congratulating Matt Harris on this important  appointment and thanking him for his service to our…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697167/recognizing-matt-harris"}, {"senator": "Adrian Smith", "party": "Republican", "sentence": "…broadcaster.\n\nDoug's service as a reporter and news director for KWBE in Beatrice  has spanned a remarkable seven different station ownerships. During  that time, his accuracy and professionalism earned the trust of his  listeners and the respect of his colleagues.\n\nDoug's list of accolades features more than 100 awards from the  United Press International and…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692922/recognizing-doug-kennedy"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…dedicated public service to Avery County, North  Carolina, as County Manager.\n\nPhillip's career reflects a lifetime commitment to serving his  community with integrity, professionalism, and an unwavering sense of  responsibility. He began his career as Avery County's Tax  Administrator, a role he held for 19 years, earning the respect of  colleagues…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699450/recognizing-phillip-barrier"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…comfort.  Despite daunting challenges and limited equipment, the WREC team  completed a demanding project in just eight days--far ahead of  expectations--demonstrating professionalism, humility, and unwavering  commitment to this life-changing mission.\n\nThe impact of WREC's work goes far beyond electricity; it represents  a bridge to connection, opportunity,…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692515/recognizing-cody-thomas"}, {"senator": "Mike Kelly, Jr.", "party": "Republican", "sentence": "…positions, Ms. Krzysiak has also served as the  appointed Tax Collector for current county real estate taxes for the  City of Titusville--duties she has carried out with professionalism and  integrity.\n\nThroughout her tenure, Ms. Krzysiak has demonstrated a commitment to  public service and to the residents of Crawford County. Her extensive  knowledge,…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689885/recognizing-christine-krzysiak-as-a-community-champion-in-pennsylvania-16"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…comfort.  Despite daunting challenges and limited equipment, the WREC team  completed a demanding project in just eight days--far ahead of  expectations--demonstrating professionalism, humility, and unwavering  commitment to this life-changing mission.\n\nThe impact of WREC's work goes far beyond electricity; it represents  a bridge to connection, opportunity,…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692444/recognizing-stephanie-wilson"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…on WLNS-TV 6 in  Lansing.\n\nSince 1987, Sheri has been more than a news anchor--she's been a  steady, reassuring presence in our homes. Her warm demeanor and  unwavering professionalism have made her a beloved figure across mid- Michigan. Whether reporting breaking news or moderating debates. Sheri  brought clarity, dignity, and heart to every story she…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690456/recognizing-sheri-jones"}]