[{"senator": "Jan Schakowsky", "party": "Democrat", "sentence": "…to recognize Kathryn  Angell, a dedicated public servant who has spent years serving the  residents of Illinois' 9th Congressional District with skill,  compassion, and professionalism.\n\nKathryn has been a member of my staff since January 2022, after  having previously served with distinction as an intern in the office.  From her earliest days here,…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699929/recognizing-the-service-of-kathryn-angell"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…Rochester Riverside  Convention Center.\n\nJim Brown began his tenure at the Convention Center on April 4, 1994,  and over the course of 30 years, built a career defined by  professionalism, integrity, and unwavering commitment to the success of  Rochester's premier event facility. He held several key positions,  including Event Manager, Director of Operations,…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697211/recognizing-jim-brown"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…Middle East, the flashpoint now  is Iran, and we came within an eyelash of getting dragged into yet  another war where the goal was regime change.\n\nI want to acknowledge the professionalism of our Air Force and our  men and women in the military. The strike they were ordered to perform  they executed flawlessly. To them, I extend my congratulations.\n\nBut…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693128/motion-to-discharge-sj-res-59"}, {"senator": "Nikki Budzinski", "party": "Democrat", "sentence": "…hearings, briefings, and stakeholder meetings. Regardless of what  policy issue she was tasked with solving, Aleksi approached every task  with a sense of dedication, professionalism, and passion for public  service.\n\nAs the daughter of central Illinois farmers, Aleksi brings to her  role not only technical expertise but also lived experience. She…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695855/thanking-aleksi-knepp-for-her-service-to-illinois-13th-congressional-district"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…predecessor, former Congresswoman and now  Governor Abigail Spanberger.\n\nHe has continued to deliver results for central and Northern Virginia  on my team with the same professionalism and care. From day one, his  dedication has made a real difference in the lives of the people we  serve. Always calm, steady, and deeply knowledgeable, Marc has been a…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699632/recognizing-marc-rabourdin"}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "…that as a U.S. Navy SEAL,  I myself as a pilot flying off of an aircraft carrier in the first gulf  war. No nation--at least today--matches the combat capability, the  professionalism, the effectiveness of the U.S. Navy, Air Force, Army,  Marine Corps, and now Space Force. And I will include the Coast Guard,  too, because we like to count the Coast…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696346/trump-administration"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…and integrity  as a police officer for the city of Edina. He then continued his  service as chief of police for the South Lake Minnetonka Police  Department, leading with professionalism and courage.\n\nA graduate of the University of St. Thomas and the FBI National  Academy, Chief Tholen exemplified Minnesotan excellence throughout his  law enforcement…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693614/recognizing-brian-tholen"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…Congress, Dr. Carla Hayden.\n\nLast week, she was ruthlessly fired by President Donald J. Trump. Dr.  Hayden is a model public servant who led the Library with dignity and  professionalism for 8 years.\n\nDr. Hayden was the first professional librarian to oversee our  Nation's largest Library, and, yes, I still have too many overdue  Library books.\n\nI worked…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691312/recognizing-dr-carla-hayden"}, {"senator": "Susie Lee", "party": "Democrat", "sentence": "…II, where she served as an  operational plans officer at the 13th Corps Support Command.\n\nI want to thank Major General Kotulich for her distinguished service,  and her professionalism and passion for service in every role she has  filled throughout her prestigious career. Part of what makes the U.S.  military the greatest in the world is that servicemembers,…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692707/recognizing-deputy-chief-of-army-reserve-major-general-deborah-deb-kotulich-on-her-retirement-from-the-us-army-reserve"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…safety, mental health, and wellness. It means supporting their  families, and it means ensuring they have the tools and resources to  serve our communities with dignity and professionalism. Choosing a life  of service and law enforcement is not easy. It comes with risks that  most of us will never know, but because of officers like Roberto,  Jonah, and Justin,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691300/national-police-week"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…constitutional duty. Regardless of what people may think of the  military's execution of its mission last weekend--and our  servicemembers performed with courage, with professionalism, with  extraordinary precision--or their views of its effectiveness--and I  hope and pray the mission was effective--Iran is a malevolent regime,  it is the paramount…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693120/motion-to-discharge-sj-res-59"}, {"senator": "Brad Schneider", "party": "Democrat", "sentence": "…and excited  to see her step into  a new opportunity with Chairman Pete Aguilar and the House Democratic  Caucus. I have no doubt Emma will bring the same compassion,  professionalism, and excellence to the House Democratic Caucus that  made her so effective with the New Dems.\n\nEmma's tenure with the New Dems has been--by any measure--an immense  success.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695553/recognizing-emma-weir"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…excellence and  innovation within Mission Delta 4. He has consistently inspired  and mentored his team, empowering them to achieve the highest levels of  performance and professionalism. His genuine care for the well-being of  his personnel has created a strong and cohesive unit, dedicated to the  mission and each other.\n\nUnder Colonel Schmitt's command,…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693489/recognizing-colonel-ernest-r-bobby-schmitt"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…ultimately became Press  Secretary for both my office and the House Judiciary Committee from  2023 to 2025.\n\nThroughout his tenure, Matt brought an impressive blend of  professionalism, creativity, and humor to the role. As Press Secretary,  he worked tirelessly behind the scenes, ensuring that my office's  messages were clear, concise, and timely. He…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693380/recognizing-matt-jansen-and-his-service-to-the-house-of-representatives"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…communities safe in the  face of danger.''\n\nI want to be clear. I commend local law enforcement, including the  Orange County Sheriff's Department, which I represent, for their  professionalism and courage. It is a tough job, and I am so grateful  for the men and women who go out there every day and risk their lives  to keep our communities safe.\n\nTo extend these…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692896/condemning-violence-by-ice"}, {"senator": "Ronny Jackson", "party": "Republican", "sentence": "…the  smooth and effective operation of my office. From travel,  events, and meeting coordination to office administration, she  consistently demonstrated precision and professionalism. She also  greatly contributed to the culture and environment of my office by  bringing her dog, Moose, in on out-of-session days. While working in my  office, Kathy continued…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697542/recognizing-and-expressing-gratitude-to-former-director-of-operations-kathy-zhu"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "…Transportation  Authority, the San Bernardino Council of Governments, and the Victor  Valley Wastewater Reclamation Authority. Her service on these bodies  has been marked by professionalism, collaboration, and a deep  commitment to transparency and good governance.\n\nDebra's accomplishments would not have been possible without the  support of her family. Her…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696324/recognizing-the-service-of-debra-jones-on-her-retirement"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…Florida,  where he served as the First Sergeant for Headquarters Company, U.S.  Marine Corps Forces Central Command. In this leadership role, he  continued to exemplify professionalism, mentorship, and unwavering  dedication to the mission and his Marines.\n\nIn recent years, Timothy served as First Sergeant of Headquarters and  Service Company, 2nd Tank…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693985/recognizing-united-states-marine-sergeant-major-timothy-babcock-as-august-2025-veteran-of-the-month"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…systems, and the implementation of long-term strategic planning  efforts.\n\nColleagues, elected officials, and staff throughout Michigan have  come to respect Karry Hepting's professionalism, integrity, and  tireless work ethic. She has set a high bar for public administration  in county government and leaves behind a legacy of collaborative  leadership.…", "date": "2025-10-31", "source_url": "https://justfacts.votesmart.org/public-statement/1696497/commending-karry-hepting-for-her-exemplary-leadership-and-dedication-to-st-clair-county-michigan"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…fellow volunteers and staff with kind words and hugs, and lead  with quiet strength. Team SAF can always rely on them to take  initiative, represent the Red Cross with professionalism, and bring  their signature warmth to every event. They give so much of themselves  and ask for nothing in return. Their dedication, humility, and  boundless compassion…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691268/recognizing-martha-narvaez-and-vincent-leandry"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…comfort. Despite daunting  challenges and limited equipment, the WREC team completed a demanding  project in just eight days--far ahead of expectations--demonstrating  professionalism, humility, and unwavering commitment to this life- changing mission.\n\nThe impact of WREC's work goes far beyond electricity; it represents  a bridge to connection, opportunity,…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692595/recognizing-theodore-gomez"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…throughout Kern County. Guided by compassion  and an unwavering commitment to delivering exceptional care, he  established a new standard of care--one defined by innovation,  professionalism, and attention to detail. His leadership helped  transform emergency medical services in the region, from requiring  attendants to accompany patients during transport…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699607/recognizing-hall-ambulance"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…John Wajdowicz has made through his work at The  Pasco County Sheriff's Citizen Service Unit (CSU). A truly dedicated  public servant, John always carries himself with professionalism and is  quick to offer a helping hand to anybody who needs one. John has been  volunteering with the Pasco Sheriff's Office since 2021. He usually  volunteers at least…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690801/recognizing-john-wajdowicz"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…not only to his skill as a physician but to  the trust and respect that he has earned from colleagues and patients  alike.\n\nWe thank Dr. Connelly for his compassion, his professionalism, and  his unwavering commitment to healing others.", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699008/dr-tim-connelly-receives-2025-georgia-physician-hero-award"}, {"senator": "Adrian Smith", "party": "Republican", "sentence": "…broadcaster.\n\nDoug's service as a reporter and news director for KWBE in Beatrice  has spanned a remarkable seven different station ownerships. During  that time, his accuracy and professionalism earned the trust of his  listeners and the respect of his colleagues.\n\nDoug's list of accolades features more than 100 awards from the  United Press International and…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692922/recognizing-doug-kennedy"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…dedicated public service to Avery County, North  Carolina, as County Manager.\n\nPhillip's career reflects a lifetime commitment to serving his  community with integrity, professionalism, and an unwavering sense of  responsibility. He began his career as Avery County's Tax  Administrator, a role he held for 19 years, earning the respect of  colleagues…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699450/recognizing-phillip-barrier"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…refused payment for his services. Mr. Lancaster  always says it's his way of giving back to the community. Since his  ``tryout'', Mr. Lancaster has offered his talents, professionalism, and  enthusiasm to every home Boys Basketball game at Springstead High  School. Over the years, he has agreed to do the same for every home  Varsity Football and Baseball…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691109/recognizing-dean-lancaster"}, {"senator": "Vern Buchanan", "party": "Republican", "sentence": "…and retired fire and rescue  personnel living in the district:\n\nAssociate Service Award: Adam Nover of Manatee County       Department of Public Safety.\n\nDedication and Professionalism Award: Firefighter Rob Day       of East Manatee Fire Rescue, Firefighter/Paramedic--Company       Fire Captain Ralph Mascaro of Hillsborough County Fire       Rescue,…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697424/recognizing-floridas-16th-congressional-district-fire-and-rescue-ems-awards-recipients"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…October 18, 2024, the team managed an overwhelming volume of calls-- 1,194 through their direct line and another 1,214 through work phones.  Yet every call was met with care, professionalism, and actionable  solutions, reflecting the team's deep commitment to being a lifeline  for the community. The Pasco County Human Services Team exemplifies  what it means…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690698/recognizing-fernando-serrano"}, {"senator": "Morgan Luttrell", "party": "Republican", "sentence": "…correct that.\n\nMs. Lee has helped shape legislation, supported veterans, solved real  problems for real people, and strengthened this institution. She has  done so with professionalism, humility, and unwavering commitment.\n\nOn behalf of the constituents of the Eighth Congressional District of  Texas, on behalf of my staff, and on behalf of a Member of…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699672/recognizing-christine-lee"}]