[{"senator": "Sam Liccardo", "party": "Democrat", "sentence": "…service  awards from the American Psychiatric Nurses Association, among many  other honors. While caring for thousands of veterans, she also inspired  and guided younger professionals pursuing careers in the practice of  psychiatric nursing.\n\nMary Ann's dedication to the community didn't stop with her day job.  She also served on the Pacifica City Council…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699748/recognizing-mary-ann-nihart"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…universities, it is a sign of a democracy in decline.\n\nNo. 3, when an administration, when a ruler goes after the right of  representation by attacking lawyers, law firms, legal professionals and  says: Thou shall not represent this cause which is deeply unpopular to  me, you shall not take on this client who is antagonistic to me, you  shall not hire this lawyer…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696336/trump-administration"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "…leaders for their leadership in their ongoing response to this  senseless tragedy.\n\nWe are grateful to the first responders for their prompt action on  the scene and medical professionals for caring for the wounded.\n\nAs law enforcement continues their work, we thank them for their  efforts and wish them strength in their pursuit to bring to justice  whoever…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698196/moment-of-silence-in-honor-of-victims-of-brown-university-mass-shooting"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…Health Improvement Act, which provides tens of  millions of dollars annually to expand our behavioral health workforce,  helping to train, recruit, and retain mental health professionals  across the country.\n\nIt is a commonsense solution that will bring resources directly to  communities like mine and yours, Mr. Speaker, helping to address  addiction, reduce…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691943/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…By giving so much to those who served  our Nation, she has made her community a better place. Granite staters  are grateful that our brave veterans may receive care from  professionals like Janette, and I wish her all the best in the years to  come.", "date": "2025-03-18", "source_url": "https://justfacts.votesmart.org/public-statement/1688916/recognizing-janette-gibb-for-her-service-at-the-manchester-va-medical-center"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…to make sure that we have adequate systems  in place to take care of them. This means a fully staffed and funded  Department of Veterans Affairs. This means mental health professionals  are in place to assist these veterans through traumatic and life- changing diagnoses. This means updated infrastructure in place to care  for these veterans. For those…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690651/aces-act"}, {"senator": "Brad Schneider", "party": "Democrat", "sentence": "…They  might look like a normal doctor's office with ultrasound machines and  employees wearing lab coats, but the coats are for show, and the  employees are not medical professionals.\n\nMr. Speaker, don't be fooled. The primary purpose of these centers is  to deceive women, and the organizations promoting these centers are the  same organizations advocating…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699230/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…advance the interests and ideals of America.''\n\nSince such time the DACOR Bacon House has served as the headquarters  of DACOR, a premier organization of foreign affairs professionals,  whose members include ambassadors, Foreign Service Officers, military  and intelligence officials, political appointees from both major  parties, Members of Congress…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692065/recognizing-the-dacor-bacon-house-bicentennial-day"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…enforcement officers and factory  workers. They are hurting teachers and students. They are hurting  factory workers and union members. They are hurting doctors and medical  professionals and researchers.\n\nAcross the political spectrum and across all demographics, the only  thing we have to show for the first 100 days is losing, the kind of  losing that…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690300/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…nationwide.\n\nTo me, that means reducing the stigma for those seeking care,  addressing the growing problem of the youth behavioral health crisis,  and giving our healthcare professionals the resources they truly need  to adequately recognize and address the challenges those who live with  mental illness must grapple with each and every day.\n\nIt also means…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692435/timothy-oclair-and-mental-health-parity"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…the  country. Forty-six percent of our ag workers are immigrants; 43 percent  of our construction workers are immigrants. Health aides--more than 20  percent of our health professionals are immigrants. I notice this  particularly when I visit rural Virginia; that if it weren't for  immigrant-trained doctors and workers and allied health professionals,…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699611/9999"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…healthcare; to invest congressional funds into building clinics; to  sponsor legislation to address the fentanyl crisis; to recruit and  train more nurses and healthcare professionals; to recruit more  counselors to fix the Medicaid and Medicare system; to expand  telehealth and broadband; and, yes, to finally put this country on a  track to universal…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696976/district-of-columbia-cash-bail-reform-act-of-2025"}, {"senator": "Marc Veasey", "party": "Democrat", "sentence": "…community members alike.\n\nBeyond her judicial service, Judge Hicks has been a dedicated mentor  and role model, investing in the growth and advancement of future legal  professionals. Her influence extends far beyond the courtroom, leaving  an enduring mark on the legal landscape through her advocacy, guidance,  and commitment to ensuring equal access…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699927/recognizing-the-honorable-judge-maryellen-hicks"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…health of the dedicated women and men on the front  lines of ensuring the traveling public reaches their final destination  safely every day.\n\nFor far too long, many aviation professionals suffer in silence. That  silence is because of the fear that disclosing a mental health  diagnosis or treatment could derail their careers, possibly ending it.\n\nMany of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695006/mental-health-in-aviation-act-of-2025"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…leading legislation that will tackle  these challenges. Our Graduate Medical Education bill will add  thousands of residency slots, creating a pipeline of qualified health  professionals to serve patients in rural America.\n\nOur Save America's Rural Hospitals Act takes important steps to  ensure that rural hospitals are fairly reimbursed for their services.…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697076/observing-world-pancreatic-cancer-day"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…Federal, State, and local.\n\nBeyond his operational leadership, Mr. Camhi has proven to be a  respected mentor and instructor, shaping the next generation of law  enforcement professionals. His commitment to training ensures that  officers are not only ready for the dangers they face but are also  guided by the highest ethical standards as they serve their…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689427/recognizing-david-camhi"}, {"senator": "Abraham Hamadeh", "party": "Republican", "sentence": "Mr. HAMADEH of Arizona. Mr. Speaker, I rise today in strong support  of my bill, H.R. 3767, the Health Professionals Scholarship Program  Improvement Act of 2025.\n\nAs too many taxpayers well know, the VA spends millions of our hard- earned taxpayer dollars training healthcare professionals…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695432/health-professionals-scholarship-program-improvement-act-of-2025"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…backgrounds  can have problems with drug abuse. Right now, we have over 100,000  people a year dying of drug abuse. It can happen everywhere, but again,  when I talk to the professionals who deal with this,  disproportionately, the 100,000 people who die every year are from  difficult family backgrounds. This drug culture, I think, would be less  strong…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688328/destruction-of-the-nuclear-family"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…Centre County Crisis Intervention Team Training  Program.\n\nSince 2011, this initiative has brought together law enforcement,  EMS, corrections officers, and mental health professionals for 40 hours  of specialized training.\n\nThese first responders are now better equipped to recognize mental  health crises, use deescalation techniques, and connect individuals…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693519/recognizing-centre-county-crisis-intervention-team"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…every mile.\n\nThat 1,954 miles of southern border on the American side of our  border, the northern side of that border, is patrolled by some of the  finest law enforcement professionals that the world has ever known. It  is absolutely within the reach of those law enforcement professionals  to effectively enforce our laws on American territory and American…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695204/people-are-sick-and-tired"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…recognize  National Public Works Week, which takes place from May 18-24, 2025, and  to offer a special greeting to the City of Oxford Public Works  Department.\n\nOur public works professionals dedicate their time and talent to  maintaining the infrastructure and facilities essential to public  health and our quality of life. In Oxford, that work is carried out…", "date": "2025-05-23", "source_url": "https://justfacts.votesmart.org/public-statement/1691680/recognizing-the-national-public-works-week-may-and-the-city-of-oxfords-public-works-department"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…CARTER of Georgia. Mr. Speaker, I rise today to recognize the  newly appointed Georgia State and Superior Court judges. These judges  are all accomplished attorneys and legal professionals who are stepping  into vital roles within Georgia's judicial system.\n\nAmong those appointed is a native of Brunswick, Georgia, in my  district, Steven Blackerby.\n\nMr. Blackerby,…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699982/governor-kemp-appoints-new-judges-to-superior-and-state-courts-in-georgia"}, {"senator": "French Hill", "party": "Republican", "sentence": "…opportunities for  women to serve in the armed and uniformed services. WACs, as its  members were called, served in a variety of roles, including as  mechanics, medical professionals, photographers, and clerks. As for  Mary, she served as a phone operator and translator.\n\nWomen like Mary were integral to our victory, as they worked  tirelessly to support…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694812/marking-80th-anniversary-of-v-j-day"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…expend resources to train and upskill       employees.\n\n(2) According to the Bureau of Labor Statistics, the United       States will need 1,000,000       additional STEM professionals than it is on track to produce       in the coming decade.\n\n(3) The field of data science, which is relevant in almost       every workplace, relies on the ability to work…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688976/mathematical-and-statistical-modeling-education-act"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…somewhere in short order, it is a very good chance it  is passing through UPS Worldport in my hometown of Louisville.\n\nNone of this is possible without teams of devoted professionals.  Louisville is home to logistics experts, warehouse workers, aircraft  crews, and maintainers. They take pride in their work, and their  community takes pride in them.…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696544/9999"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…material risk of an investment. Like the 2020 Trump  rule, H.R. 2988 recognizes that ESG factors can present an economic  risk or opportunity, which qualified investment professionals would  appropriately treat as material economic considerations under generally  accepted investment principles.\n\nH.R. 2988 neutrally applies these principles to all investment…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699160/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "…Greenwood District, also known as Black Wall Street, as a  national monument.\n\nThe Greenwood District in Tulsa was once a thriving community of  Black-owned businesses, professionals, and families until the Tulsa  Race Massacre of 1921 tragically burned it to the ground.\n\nHundreds were killed, and thousands were left homeless. Designating  this site…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691666/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Max Miller", "party": "Republican", "sentence": "…treatment can prevent the cancer from spreading to other body organs,  significantly improving long-term survival rates.\n\nWe must also recognize the dedicated healthcare professionals, as  well as world-renowned expertise, seeking effective treatments of  Prostate Cancer and other forms of Cancer, both in my congressional  district in Northeast Ohio…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695861/recognizing-september-as-national-prostate-cancer-awareness-month"}, {"senator": "Scott DesJarlais", "party": "Republican", "sentence": "…in space.\n\nAs we develop those space systems, we are going to need both better- trained acquisition Guardians and more of them. The joint force will be  looking to these professionals to deliver significant portions of the  Golden Dome architecture. This bill helps them do that.\n\nWe also ensure that the National Security Space Launch enterprise is  led…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697798/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Ted Budd", "party": "Republican", "sentence": "…clear to drug traffickers  they will find no refuge in the mountains of our beautiful Western  North Carolina.\n\nIt is my honor to represent a State whose law enforcement  professionals lead with tremendous integrity and commitment to our  citizens. I will continue working in the U.S. Senate to ensure that  they have the tools, resources, and support they…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693099/operation-uptown-funk"}]