[{"senator": "Marc Veasey", "party": "Democrat", "sentence": "…Speaker, I rise today to honor the Honorable Judge  Maryellen Hicks and to recognize the renaming ceremony held in her  name, a tribute to a trailblazing jurist whose legacy has profoundly  shaped Tarrant County and the State of Texas. This historic occasion,  led by the Black Women Lawyers Association, reflects Judge Hicks's  extraordinary impact on the legal…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699927/recognizing-the-honorable-judge-maryellen-hicks"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…suggestive text.\n\nI debated putting that letter up. There is a chart of it in the door  behind me. But it has already been made public. The public has seen it.  I find it a profoundly offensive letter.\n\nAnd as I passed by a stack of newspapers today, I saw a series of  examples of Donald Trump's signature because Trump has said to the  world, ``That is…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695214/jeffrey-epstein"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…inherently local matters such as       criminal prosecutions, landlord-tenant cases, probate       proceedings, civil cases, and divorce proceedings, all of       which have profoundly important impact on our community. For       more than 50 years, the Judicial Nomination Commission (JNC)       has successfully allowed DC residents to have a voice in…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695596/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…the Great Lakes.\n\nThis restoration means cleaner water, aquatic and wildlife habitats  renewed, and a healthier Lake Erie. As co-chair of the Great Lakes Task  Force, I am profoundly grateful that our citizens united to restore the  heart of our islands along the mighty Maumee by, quite literally,  constructing bridges for the future. Our  community keeps…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695469/resisting-the-temptation-to-divide"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…inherently local matters such as       criminal prosecutions, landlord-tenant cases, probate       proceedings, civil cases, and divorce proceedings, all of       which have profoundly important impact on our community. For       more than 50 years, the Judicial Nomination Commission (JNC)       has successfully allowed DC residents to have a voice in…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695641/district-of-columbia-policing-protection-act"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…has countenanced the spirit of criticism, the constancy of your support  was the essential prop of the efforts and a guarantee of the plans by  which they were effected. Profoundly penetrated with this idea, I shall  carry it with me to my grave as a strong incitement to unceasing vows  that Heaven may continue to you the choicest tokens of its beneficence;…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700163/reading-of-washingtons-farewell-address"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…Why,  despite the fact that this bill passed unanimously in the House and in  the Senate, Mr. Speaker? Why did the President veto this bill?\n\nWe are here, unfortunately and profoundly, because the President has  declared war on our State. In the last 40 days, he has taken step after  step to harm the people whom I serve and whom I represent. He is  denying…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698702/finish-the-arkansas-valley-conduit-act-veto-message-from-the-president-of-the-united-states"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "Mr. KAINE. Mr. President, I oppose H.R. 4 and believe it reflects  profoundly misplaced priorities for America. Accordingly, it is my  intention to make the following motions to recommit the bill:\n\nA motion to recommit the bill to the Committee on…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693627/hr-4"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…none of us-- none of us can imagine what it is like.\n\nYou are so special.\n\nIt is amazing to be her colleague, isn't it? It really is.\n\nBut what you are speaking about is so profoundly moving to me because  you understand better than any of us ever can how significant a  decision it is to go to war. You experienced it. You have seen, as you  call them,…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696567/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…inherently local matters such as       criminal prosecutions, landlord-tenant cases, probate       proceedings, civil cases, and divorce proceedings, all of       which have profoundly important impact on our community. For       more than 50 years, the Judicial Nomination Commission (JNC)       has successfully allowed DC residents to have a voice in…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696979/district-of-columbia-cash-bail-reform-act-of-2025"}, {"senator": "Nikki Budzinski", "party": "Democrat", "sentence": "…civility, and an  unwavering advocate for collaboration.\n\nIn today's era of division and political turmoil, his example of  steady leadership and his voice of wisdom will be profoundly missed.  His passing is a loss felt across the political spectrum and throughout  Illinois.\n\nMr. Speaker, my thoughts are with his wonderful family, especially  Brenda, Brad,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695630/in-memory-of-the-honorable-jim-edgar"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…Center (DEC) to the  health and well-being of the residents of Texas' 30th Congressional  District. For almost two decades, these dedicated healthcare  professionals have profoundly impacted our community through their  commitment to providing exceptional, cost-effective outpatient surgical  services, including colonoscopies and endoscopies.\n\nThe founders'…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695923/recognizing-the-physicians-at-dallas-endoscopy-center"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "…something that this Chamber  has been debating for generations, which is the push and pull between  the Congress and the Chief Executive on the use of our military.\n\nI was profoundly disturbed to hear the chairman denigrate the ranking  member. To suggest that he doesn't care about the losses in his  district, to suggest that we want the President to…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698242/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Eric Swalwell", "party": "Democrat", "sentence": "…Speaker, I rise today to recognize and celebrate  the outstanding contributions of Parvin Ahmadi, a lifelong educator  whose 36 years of service in public education have profoundly shaped  the lives of students, families, and educators across California.\n\nParvin Ahmadi began her career as a classroom teacher in San Jose  before taking on administrative…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691728/recognizing-parvin-ahmadi"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…costs to buy a Presidential jet--to  rehab a jet that was given to the President so that he could actually  send it on to his personal library after he leaves office. It is  profoundly disturbing, and I appreciate the way you framed it.\n\nThere is enough money for luxury glitz--for a megaballroom. I can't  even imagine how anything could cost that much to…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…events, and consistently pitches  in whenever needed. The students know her and look forward to seeing  her around campus.\n\nIt is clear Mercedes Anderson-Brando has made a profoundly positive  impact on our community, and I am grateful for her service. May we all  strive to serve our communities with the same dedication and humility.", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691793/recognizing-mercedes-anderson-brando"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…selfless  leader, Mr. Smith was a strong advocate for bringing in government and  non-profit resources to aid in the recovery process.\n\nIt is clear Travis Smith has made a profoundly positive impact on our  community, and I am grateful for his service. May we all strive to  serve our communities with the same dedication and humility.", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692197/recognizing-travis-smith"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Commerce, and  president of Ardsley Park Neighborhood Association, among countless  other accomplishments.\n\nDick will be missed. May his memory live on in the smiles of those he  profoundly impacted.                 Recognition of Arrowhead Pointe Golf Course\n\nMr. CARTER of Georgia. Mr. Speaker, I rise today to recognize  Arrowhead Pointe Golf Course, a well-kept,…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691783/recognition-of-richard-dick-wallace"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…it. I talked to the Prime  Minister yesterday before I went on television, and I asked him: What  would you like me to tell America, Bibi?\n\nHe said: Three things. We are profoundly grateful to the American  people for what you do to help the Jewish State. We couldn't be here  without you. We are profoundly grateful to President Trump for his  strong…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692780/iran"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…dedication to long-term recovery and cutting-edge  approaches to disaster management, have left an indelible mark on Pasco  County.\n\nIt is clear Rebecca Seils has made a profoundly positive impact on  our community through her work as part of the Pasco County Human  Services Team, and I am grateful for her service. May we all strive to  serve our communities…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691971/recognizing-rebecca-seils"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…exemplifies the spirit of service and is a shining example of what can  be achieved when a community comes together to make a difference.\n\nIt is clear Ann Wilkinson has made a profoundly positive impact on  our community, and I am grateful for her service. May we all strive to  serve our communities with the same dedication and humility.", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690139/recognizing-ann-wilkinson"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…selfless  leader, Tyrone was a strong advocate for bringing in government and  non-profit resources to aid in the recovery process.\n\nIt is clear that Tyrone Young has made a profoundly positive impact  on our community, and I am grateful for his service. May we all strive  to serve our communities with the same dedication and humility.", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692468/recognizing-tyrone-young"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…but  all year round. She embodies the four key values of Metro's culture,  including: Character, Chemistry, Competency, and Calling.\n\nIt is clear Carol Brisbois has made a profoundly positive impact on  our community, and I am grateful for strive to serve our communities  with the same dedication and humility.", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690148/recognizing-carol-brisbois"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…but  all year round. She embodies the four key values of Metro's culture,  including: Character, Chemistry, Competency, and Calling.\n\nIt is clear Ellen Tantillo has made a profoundly positive impact on  our community, and I am grateful for her service. May we all strive to  serve our communities with the same dedication and humility.", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690680/recognizing-ellen-tantillo"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…their dedication to long- term recovery and cutting-edge approaches to disaster management, have  left an indelible mark on Pasco County.\n\nIt is clear Kyle Smith has made a profoundly positive impact on our  community with his work as part of the Pasco County Human Services  Team, and I am grateful for his service. May we all strive to serve our  communities…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691008/recognizing-kyle-smith"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…our community while still caring for our nation's heroes. Mrs.  Gaston is that rare human being who is dedicated to helping humanity.\n\nIt is clear Tami Gaston has made a profoundly positive impact on our  community, and I am grateful for her service. May we all strive to  serve our communities with the same dedication and humility.", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692210/recognizing-tami-gaston"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…for youth mental  health, organizing community events, or mentoring families, Joanne is a  voice of wisdom, patience, and grace.\n\nIt is clear Joanne Gillespie has made a profoundly positive impact on  our community, and I am grateful for her service. May we all strive to  serve our communities with the same dedication and humility.", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690799/recognizing-joanne-gillespie"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…with ``Love and Sacrifice: A tribute  to the Heart of Opera Roanoke,'' which also marked the retirement of  Maestro Steven White, whose more than 20 years of service have  profoundly shaped the company's artistic excellence.\n\nAs Opera Roanoke looks ahead to its 50th anniversary season and  upcoming  production of ``Hansel and Gretel,'' I congratulate…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696845/recognizing-50th-anniversary-of-opera-roanoke"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…selfless  leader, Ms. White was a strong advocate for bringing in government and  non-profit resources to aid in the recovery process.\n\nIt is clear that Lynn White has made a profoundly positive impact on  our community, and I am grateful for her service. May we all strive to  serve our communities with the same dedication and humility.", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691191/recognizing-lynn-white"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…truly a blessing. Mr. Lancaster is one of a  kind, and is now a true part of what Springstead Athletics is, and  forever an Eagle.\n\nIt is clear Dean Lancaster has made a profoundly positive impact on  our community, and I am grateful for his service. May we all strive to  serve our communities with the same dedication and humility.", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691109/recognizing-dean-lancaster"}]