[{"senator": "John Larson", "party": "Democrat", "sentence": "…and you are willing to do it on the backs of the  American people.\n\nYou would rather see them--thank God for the people who are standing  up on your side. They deserve the Profile  in Courage award because they are able to stand up to a President who  would rather see 15 million people lose insurance and another 20  million see their prices double.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698786/breaking-the-gridlock-act"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…our country.\n\nIn the latest example of how this administration's disastrous  immigration agenda is at odds with reality, last week, ICE was directed  to make a flashy, high-profile raid at a Hyundai plant in Georgia,  arresting over 400  South Korean nationals whom we had explicitly invited to invest in  manufacturing here and bring jobs to the United…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695109/providing-for-consideration-of-hr-streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-and-providing-for-consideration-of-hr-stop-illegal-entry-act-of-2025"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…threats Capitol Police reported in 2024.\n\nWe are witnessing disturbing incidents of politically motivated  violence across the Nation, targeting elected officials and high- profile individuals associated with both political parties.\n\nWhether it is the horrific assassination of Charlie Kirk at a college  campus in Utah or the tragic assassination of former…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695686/authorizing-the-use-of-funds-from-the-senators-official-personnel-and-office-expense-account-for-security-enhancements-and-services-provided-to-senators"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…turned  Citigroup into a financial powerhouse, could make the bank vulnerable  to  costly and potentially damaging missteps.''\n\nThey were too big to manage.\n\n``A recent high-profile error--Citigroup's accidental $900 million  payment to creditors of cosmetics company Revlon, Inc.--gave credence  to their concerns.''\n\nThat is right. The bank lacked sufficient…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691499/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Eric Swalwell", "party": "Democrat", "sentence": "…The Naismith Basketball Hall of Fame has rightly recognized Michelle  Smith-McDonald as a trailblazer and visionary whose work has broadened  opportunities and raised the profile of women's sports. As a resident  of the Bay Area for over three decades, Michelle also has celebrated  and supported the talent emerging from local programs like Stanford,…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689730/9999"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…Not a single week went by in which press coverage wasn't at       least 70 percent negative. And amid swirling rumors about the       Trump campaign's ties to Russia, a high profile special       counsel, Robert Mueller, was appointed to oversee       investigations into the case. Just a few months into his       presidency, President Trump faced talk…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…debated whether FSOC should focus on mitigating the specific activities  that pose the greatest risk, or if FSOC should take a broader, entity- wide view of the firm's risk profile. Both activities-based and entity- based approaches can be appropriate, depending on circumstances.\n\nAs someone who was present on the Financial Services Committee during…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699823/financial-stability-oversight-council-improvement-act-of-2025"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…disease that researchers had virtually eliminated--he has  pressed forward with firing thousands of vital workers in our health  Agencies. This is not efficient, and it is not a profile in competent  leadership. What it is, instead, is absolutely dangerous, and it is  putting sensitive information and decisions between life and death in  the hands of grossly…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690300/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…back after he was  disarmed.\n\nFor the countless others who could not be there yesterday because  they were killed or they were injured, the courage of these witnesses  was a profile in bravery and in eloquence. They were the voices and  faces of those countless Americans who have suffered at the hands of  their own government.\n\nTheir stories are about…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699650/9999"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…highest bidder as exports. These fossil fuel  exports actually increase energy costs here for Americans. This is what  Senator Kaine has been talking about, trying to raise the profile of  these issues.\n\nLast week, the Trump administration announced that they are killing  nearly $8 billion in grants for grid development and energy innovation,  targeting…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696132/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Ilhan Omar", "party": "Democrat", "sentence": "…are we hearing little from that side about  the States' rights.\n\nI wonder, when unaccountable rogue agencies are partnering with tech  companies like Palantir to surveil and profile Americans, why are we  hearing so little from the other side about civil liberties.\n\nI also wonder, when people are being arrested, stripped of their  green cards, and deported…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692431/ice-surveillance-and-trump"}, {"senator": "Marilyn Strickland", "party": "Democrat", "sentence": "…students a chance to learn how government works. She  passed Home in Tacoma, which expanded key and necessary housing  opportunities across the entire city. She also raised our profile  nationally by serving as president of the National League of Cities,  promoting the platform of people, partnership, and possibilities. She  launched the Growing Resilience…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698197/recognizing-retiring-tacoma-mayor-victoria-woodards-for-her-years-of-service"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…spray, Ryan Nichols, Sr.,  identified in a Twitter post ``officers in the D.C. Jail who need to be  investigated for corruption and abuse,'' adding the names and LinkedIn  profile photos of two DC Jail employees.\n\nThe men and women who bravely defended us on January 6 deserve better  than this--and we should honor them for their heroic efforts that…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688828/january-6-pardons"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…focusing on  rural and underserved communities, small manufacturers, or small  businesses critical to national security.\n\nDue to their capital-intensive nature and early revenue profile,  these small businesses operating in the critical technology sector need  institutional investors with longer term time horizons to raise  capital.\n\nThat is why this bill…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697258/investing-in-all-of-america-act-of-2025"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…healthcare and beyond, he has shaped debates in  higher ed, politics, journalism, and more through the years. Ben did  this all at a young age. Even though he has a very public profile, he  and his wife, Melissa, have built a vibrant family. All of this made  the cancer diagnosis seem almost unthinkable.\n\nWhile this is hard news for all of us to hear, we…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698932/recognizing-mayor-david-black"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…``groomers'' to connect with children on its platform. These are users  who the Meta-owned company identified as potential child predators.\n\nThink about this. Looking at the profile, they think: That might be a  child predator. What do they do? They do nothing. They encourage them  to connect with young girls and boys. And what we know is that children…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691286/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Andy Ogles", "party": "Republican", "sentence": "…known as the PILLAR Act.\n\nThis legislation is about strengthening the first line of defense in  our Nation's cybersecurity. While we often focus on Federal networks  and high-profile national systems, the reality is that many of the  services Americans depend on every single day are run by State and  local governments.\n\nWhen a resident pays a utility bill…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696789/protecting-information-by-local-leaders-for-agency-resilience-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…absolutely beyond belief. In the  aftermath of these fires, which destroyed 18,000 homes and tragically  killed 30 people, there was a FireAid concert in which a number of  high-profile musicians generously agreed to perform and people  responded in an amazing way. Tens of thousands of people donated,  raising $100 million for what they were told was direct…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694134/investigation-into-the-fireaid-concert-in-los-angeles"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…banned member of the online dating service.\n\n(2) Required contents.--A fraud ban notification under       paragraph (1) shall include the following:\n\n(A) The username or other profile identifier of the banned       member, as well as the most recent time when the member to       whom the notification is being provided sent or received a       message through…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692730/romance-scam-prevention-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…is home to pristine beaches, miles  of walking paths and trails, ice cream shops, and award-winning  restaurants. Despite this, St. Simons has still managed to keep a low  profile and is often overlooked by out-of-State beachgoers.\n\nI am proud that St. Simons Island, my new home, is being recognized  for the stunning views and coastal relaxation it…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692260/recognizing-st-simons-island"}, {"senator": "Barry Loudermilk", "party": "Republican", "sentence": "…civilian auxiliary of  the United States Air Force.\n\nBart attended Tyler Junior College on a music scholarship, where he  played in the school's band and performed at high-profile events,  including the Cotton Bowl, as well as Dallas Cowboys games. He later  transferred to the University of Oklahoma, Edmond, where he graduated  in 1968, commissioning…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698432/republicans-have-delivered-in-2025"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…reducing hazardous air pollutant emissions, but the Biden-era ``once  in, always in'' rule locks them into compliance regimes that do not  reflect their improved emissions profile.\n\nFinally, let's not forget our small and rural manufacturing  facilities in communities across this country, including in my own  district in New York's southern tier. These…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691514/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "French Hill", "party": "Republican", "sentence": "…``(ii) establish procedures for reviewing insured       depository institutions that--\n\n``(I) experience material changes in financial condition or       operational risk profile between scheduled examinations; or\n\n``(II) have failed to comply with Federal or State banking       laws and regulations; and\n\n``(iii) balance the goals of streamlining the…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…crucial duties is to steward public       funds by assuring they are spent in accordance with the law       and not siphoned off by criminals. Unfortunately, several       high-profile incidents of fraud in recent years have shown       the inability of some States to adequately protect public       money. In particular, California has had difficulty stopping…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699473/illegal-bio-lab-in-las-vegas"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…Reporting suggests that the individual may have overstayed his visa  that the Biden administration gave him and was then in the country  illegally.\n\nThis is the third high-profile attack on the Jewish community in the  last 2 months. This sort of hate is completely unacceptable in our  society, and, of course, we all know it needs to stop.\n\nI commend…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691714/boulder-colorado-attack"}, {"senator": "John Rose", "party": "Republican", "sentence": "…The experts in the manufactured housing space tell us that allowing  manufacturers to design a single-family home without a permanent  chassis will bring about modern low-profile builds, multistory  construction, and urban-friendly designs. It will also improve  efficiency and eliminate unnecessary steel, waste, and cost.\n\nWe cannot sit by while 50-year-old…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699802/housing-for-the-21st-century-act"}]