[{"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…technological innovations and  competitiveness and, most importantly, our national security.\n\nWhile I am proud to be a part of this effort, I would be remiss in  not highlighting that programs like the wireless supply chain  innovation grant program may be negatively affected by reconciliation  decisions made by the administration.\n\nThis is a pivotal step toward…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693487/open-ran-outreach-act"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…dying. Bill  Gates said this is the richest man in the world, Musk, taking advantage  of and killing the poorest children in the world. They are not going to  be getting PEPFAR programs created by George Bush. They are not going  to get the sustenance they need which is rotting in ships right now.\n\nDon't end it, mend it. This is a terrible bill. This is Musk's…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692546/rescissions-act-of-2025"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…beautiful day.\n\nWe must remember that nearly one in four American adults live with  mental health conditions, yet the majority do not receive the care they  need. Peer-based programs have been really successful. They are a very  affordable way of getting that care.\n\nHappy Mental Health Awareness Month to everyone, and I am grateful  for groups like Loudoun…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691279/mental-health-awareness-month"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…video clips to informative electronic updates, to printed  newsletters. Matt worked to prepare me for appearances on MSNBC, NY1,  and other local New York City television news programs. He worked  closely with reporters to book interviews with major news outlets like  the New York Times and the Washington Post.\n\nMatt's commitment to learning led him to be…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693380/recognizing-matt-jansen-and-his-service-to-the-house-of-representatives"}, {"senator": "Chellie Pingree", "party": "Democrat", "sentence": "…like Maine, local stations and networks like Maine  Public are often the most accessible and sometimes the only source of  news and information.\n\nWhether it is children's programs like Sesame Street and Daniel  Tiger, high school basketball tournament coverage, or trusted news  shows like Maine Calling, public media has been a vital part of  Mainers'…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692523/rescissions-act-of-2025"}, {"senator": "Zoe Lofgren", "party": "Democrat", "sentence": "…able to chart a  path toward. But the opportunities that helped me are stripped away for  the next generation in this bill. With cuts to federal student aid and  Pell Grant programs, the opportunity I had will be gone for those in  the normal kind of family I grew up in if this bill becomes law.\n\nThe cuts to nutrition assistance in this bill are cruel.…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693156/one-big-beautiful-bill-act"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…hurt millions of Americans and create irreversible  damage to our communities.\n\nMr. Speaker, it will hurt my community, where tens of thousands of  people benefit from these programs, but this is going to impact every  community across every district and across Virginia and across the  country. Is it because the richest country in the world can't feed…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687964/proposed-cuts-to-medicaid-and-snap-benefits"}, {"senator": "Marc Veasey", "party": "Democrat", "sentence": "…Texas, is among the oldest  U.S. retailers in America--and remains a vital part of military  readiness. 100 percent of Exchange earnings support critical Quality- of-Life programs. In the last 10 years, the Exchange delivered $15  billion in value to the military community.\n\nCongratulations to the Exchange on 130 years of serving those who  serve. Here's…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693374/recognizing-the-army-and-air-force-exchange-service"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…endless amounts of money to invest in death and destruction.  They want us to fund Medicaid, housing, and Head Start. They want  access to clean water and so many critical programs that our  communities desperately need.\n\nWe have seen our government manufacture consent for the invasion of  Iraq that killed and displaced millions of people, our loved…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692911/no-more-wars"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…prices for everyday  Americans.\n\nToday, we are finally considering priorities Democrats fought for,  including authorization of policies and increased funding for important  programs. Community health centers, hospitals that care for underserved  communities, and teaching health centers will all benefit from these  Democratic initiatives in the bill.…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699331/consolidated-appropriations-act-2026"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…funding is drying up and educational support is being pulled out from  under them.\n\nDallas ISD alone has over 150,000 students, many from middle-class  families. Cuts to programs like Head Start, Title I, and after-school  STEM enrichment don't just hurt, they derail students' futures.\n\nTexas colleges and universities share one of the largest enrollments…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692286/sounding-the-alarm-on-a-crisis-threatening-americas-future"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…endangering  the health of the American public with potentially unsafe and rushed  drug reviews.\n\nThe Trump administration is also decimating our vaccine  infrastructure, from the programs that cover our vaccines and ensure  that patients can afford them to destroying the pipeline to future  vaccines through their ideological, pseudoscience agenda.\n\nMr. Speaker,…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697277/mikaela-naylon-give-kids-a-chance-act"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…I go home and I talk to a working mother, a person who wakes up  at 7 in the morning and works two jobs every day and has to send her  kid to school and relies on the food programs just to keep her family  healthy, just to have something in the stomach of that 7-year-old who  is going to first grade, and to know that their food assistance  programs could…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688084/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…a billionaire, he is telling you the  truth. But if you are not rich, Donald Trump and Republicans' signature  legislation is to cut Medicaid and Social Security and other programs  by hundreds of billions of dollars in order to pay for tax breaks for  the billionaires club.\n\nLet's look at another claim by Donald Trump:\n\nThe next economic boom will begin…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688408/joint-session-of-congress"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…Co-Founder and Director of KC Dance  Center, she has trained students across Virginia, Maryland, and  Washington, D.C. in dance, yoga, aerobics, and Nepali-inspired fitness  programs. Luna's work is driven by her passion for preserving and  sharing Nepali traditions in America and giving young performers the  opportunity to showcase their skills on stages…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695611/recognizing-navin-kc-luna-shrestha-and-nabaraj-kc"}, {"senator": "Mary Miller", "party": "Republican", "sentence": "…reserved  for American citizens.\n\nIn Illinois, JB Pritzker and the Democrats rolled out the red carpet  and actively enticed illegals and those covered by Biden's bogus asylum  programs to settle in my State, to the tune of over 500,000 people.  They received welfare benefits, CDL licenses, and State identification.  The Democrats have even voted to allow…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1689996/safeguard-american-voter-eligibility-act"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…chose politics over people. They refused to support a  commonsense measure, and American families paid the price.\n\nThis bill restores stability to our national nutritional programs,  which were put under unnecessary strain during the shutdown. It will  fund WIC and SNAP, ensuring that low-income mothers and their babies  have access to healthy and nutritious…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696682/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…also has one of the highest Medicaid  populations in the Nation.\n\nI have heard from countless constituents who tell me the only way  they can afford healthcare is through programs like Medicaid, and I  will not support a final reconciliation bill that risks leaving them  behind.\n\nMedicaid cuts are deeply unpopular with the American families who  sent…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688025/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…today, we became the beneficiaries of seeing the Corps  of Engineers from the Fort Worth District visit us to talk about the  water needs and the infrastructure of our water programs in Texas.\n\nToday, I rise to recognize Kathleen Spillane, chief of the Civil  Works Branch for the United States Army Corps of Engineers, Fort Worth  District.\n\nIn this role,…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691207/recognizing-kathleen-spillane"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…spending  flat, but history would say we wouldn't. Our budget assumes that we  hold discretionary spending flat. That is Defense, DOJ, DHS, all the  spending on all the various programs in Commerce, and go down the list.\n\nWhat else? I read a story yesterday that because of tariff policy--by  the way, I support the President using tariff policy to isolate…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690594/fiscal-responsibility"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…1975, the Wood County Committee on Aging was established  to provide comprehensive services to the county's seniors. These  services have grown over the decades to include programs for home- delivered meals, medical transportation, health and wellness  initiatives, caregiver support, and much more. With senior centers  across the county, the Committee…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695853/recognizing-the-semicentennial-of-the-wood-county-committee-on-aging"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…from relevant documentation and interviews of agency       officials against relevant leading practices in GAO's A       Framework for Managing Fraud Risks in Federal Programs (Fraud       Risk Framework).\n\nTo support all three objectives, we interviewed CMS       officials and representatives from seven stakeholder       organizations that represent…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698381/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…will train for the next few years.\n\nIn Iowa, our State continues to lead in producing top medical talent.  At Des Moines University, 32 students were matched to residency  programs in Iowa--the State with the highest number of matches for the  Des Moines University Class of 2025. At the University of Iowa, about  25 percent of the students matched in…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690631/medical-student-match-day-achievement"}, {"senator": "Rob Wittman", "party": "Republican", "sentence": "…$38 billion for development, procurement, and  modification of aircraft. This includes full funding for the Air  Force's F-47 and the Navy's F/A-XX sixth-generation aircraft programs,  as well as 47 additional F-35 aircraft. These investments will  guarantee America's air superiority around the globe.\n\nThe legislation also supports shipbuilding. It supports…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697794/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…Education, achieved a  93.7 graduation rate, and eliminated all D-rated schools in the county.  Her innovative approach of focusing on college and career technical  pathways programs, which specify teaching students practical skills for  their next steps, has paid dividends for the education of all Volusia  County students.\n\nMr. Speaker, Superintendent…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697751/recognizing-lady-lake-florida"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…detailee from another office of the Federal       Government shall be considered an employee of the House.\n\n(3) Exception for participants in new member orientation       programs.--If an individual completed a program of training       required under paragraph (1) during the new       Member orientation program administered by the Committee on…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692190/mandatory-completion-of-program-of-training-in-workplace-rights-and-responsibilities"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…co-chair of the  bipartisan Career and Technical Education Caucus, I am proud to be an  advocate for CTE and the work we do to support job training,  apprenticeships, and CTE programs.\n\nSkills-based education provides learners of all ages with career- ready skills, giving individuals the tools to succeed and restoring the  rungs on the ladder of opportunity.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695635/career-and-technical-education-caucus"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…move to suspend the rules and  pass the bill (H.R. 1642) to amend the Small Business Act to include  requirements relating to graduates of career and technical education  programs for small business development centers and women`s business  centers, and for other purposes.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691731/connecting-small-businesses-with-career-and-technical-education-graduates-act-of-2025"}, {"senator": "Mike Johnson", "party": "Republican", "sentence": "…organized by the  members of the U.S. delegation.\n\nThe Congress-Bundestag/Bundesrat Exchange is highly regarded in  Germany and the United States and is one of several exchange programs  sponsored by public and private institutions in the United States and  Germany to foster better understanding of the politics and policies of  both countries. This exchange…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699719/announcement-of-the-2026-congress-bundestagbundesrat-exchange"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…former Sudanese refugee  who survived political torture and violence, Dr. Elsheikh came to  Pennsylvania in 2001, where she rebuilt her life and impacted thousands  through programs that serve children with autism, train and employ  caregivers, and create educational media. She also mentors women and  youth throughout Pennsylvania in leadership, business,…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693665/recognizing-dr-hagir-elsheikh"}]