[{"senator": "John Mannion", "party": "Democrat", "sentence": "…the costs  for hardworking Americans.\n\nThe good news is that solutions do exist. We need smart investments  in generation and transmission, expanded energy-efficiency programs  that help families use less and pay less, and a balanced approach to  create more affordable energy options, including renewables and clean,  reliable nuclear  power. We also…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699587/stop-the-republican-affordability-crisis"}, {"senator": "Jim Costa", "party": "Democrat", "sentence": "…policies are increasing the costs of  essential goods. My farmers are struggling, as well as American  consumers. Healthcare costs are skyrocketing for millions. Critical  programs that help families stay afloat are under attack. The cuts in  Medicaid and the Affordable Care Act, as well as SNAP and other  programs, are taking their toll.\n\nTake healthcare…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698830/putting-americans-first"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…potentially adversarial countries,  green energy can also help us advance national security interests. As  for my role in this effort, I have focused on supporting federal  programs that help advance these goals.\n\nThese unique energy resilience challenges in remote and Tribal areas  are the focus of the U.S. Department of Energy's Energy Transitions  Initiative…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692645/introduction-of-the-energy-transitions-initiative-authorization-act"}, {"senator": "Raja Krishnamoorthi", "party": "Democrat", "sentence": "…crucial to our  competition with the CCP.\n\nSecond, these cuts will likely jeopardize our ability to enforce  critical export controls with the Chinese as well as gutting programs  that help us reshore manufacturing from China.\n\nWhile we have got to restore our fiscal house, these cuts to critical  programs amount to the GOP's perverted version of DEI, devastating,…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688048/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…know that the Department of Education was created by an act of  Congress, and only Congress can eliminate it.\n\nWe look at what is happening with all of these programs--the programs  that help low-income students, students with disabilities, and higher  ed.\n\nI got through community college and college and law school because I  had Federal support. Programs…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698126/dismantling-the-department-of-education"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…solutions. We need to be addressing the addiction crisis;  investing in behavioral health and addiction recovery programs;  investing in diversion and community-based programs that help people  who are hurting and living on the edge get back on their feet;  investing in our children and pipelines for young people to have lives  that they can only dream…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696976/district-of-columbia-cash-bail-reform-act-of-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…exacerbates the problem.\n\nIn the President's budget, they propose to cut SAMHSA programs that  assist with harm reduction strategies to help those in need, as well as  programs to help prevent Americans from using controlled substances.  The President's budget also calls for reducing opioid overdose  prevention and surveillance by $29 million.\n\nI think…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692341/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "…administration and Republicans in Congress are doing  everything they can to stop clean energy that will help lower costs for  the American taxpayer.\n\nThey are rolling back programs that help build low-cost power. They  are making it harder to build new wind, solar, and transmission  projects. Projects that were already planned, financed, and under  construction…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699895/prices-are-too-high"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…in this building working on a tax package behind closed doors all  around us that will further take away the rights of the American  people, that will decimate basic programs that help people put food on  the table and a roof over their heads.\n\nAll around us, our colleagues are refusing to say out loud the things  they will say to us in private: that…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690395/attacks-and-threats-on-democracy-and-rule-of-law"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…systems  by freezing critical funding.\n\nFrom day one, DOGE has been one big excuse to reward Trump's wealthy  donors, gut public services, and funnel resources away from programs  that help ordinary people and into the pockets of the wealthy and well- connected.\n\nLet's not forget: This is the same DOGE review that cut off funding  to USDA bird flu experts…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692385/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…and even public broadcasting.\n\nAs a member of the Foreign Affairs Committee, I am particularly  disturbed by the $8.3 billion in cuts to foreign assistance targeting  programs that help the most vulnerable people across the world. These  cuts include a $9 million cut to the President's Emergency Plan for  AIDS Relief, which has saved over 26 million…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692398/rescissions-package"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…not only hurting people but screwing them over. That is sad.\n\nThen, look at today. Some of the bills at one time were bipartisan.  H.R. 2483 reauthorizes funding for programs that help communities fight  the opioid crisis. It is something I support and something I voted for  in the past.\n\nMr. Speaker, over 20,000 lives have been lost in my home State…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691944/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…up. You name it, Mr. Speaker.\n\nSo far, the funding actions of the President and Congress have made  it worse. We passed an energy bill last week that gutted the very  programs that help people weatherize their homes to reduce their energy  costs. We cut in half the very department that has that program.\n\nPeople ask me: Weren't you elected to help people…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695041/better-is-possible"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…hydrogen energy, batten,  recycling, and energy improvements in public schools, as well as  support for public-private clean energy projects.\n\nTheir bill undermines the very programs that help us stop the spread  of nuclear weapons, detect nuclear activity, and uphold arms control  efforts that make America and the world safer--and it underfunds  efforts to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694862/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…that goal.\n\nIf this bill is passed, SBA offices will be relocated as political  payback, away from public access in major cities. In fact, that is the  point: to reduce programs that help small businesses gain access to  capital, professional services, and predictable tariff policies.\n\nThat is why I introduced an amendment to prohibit SBA from relocating…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692104/save-sba-from-sanctuary-cities-act-of-2025"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…There is no reason at all that this should have happened. There is no  reason for the American taxpayer to have to fund the incarceration of  this person or any other programs to help him get back on the streets  of Georgia.\n\nThough my example is the worst outcome possible, illegal aliens  should not be able to stay in America with a minor penalty for…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693081/jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-2025"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…communities face in obtaining the infrastructure needed to  survive. When water infrastructure ages well past its intended  lifespan, Congress should support and advocate for programs that help  rural communities, not leave them behind.\n\nI thank my friend and colleague, Representative Figures, for joining  me in this effort, and I urge my colleagues to vote…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695402/water-resources-technical-assistance-review-act"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…be riddled with  fraud and abuse, intentionally mismanaged, and undermined all for the  sake of scoring political points.\n\nHouse Republicans are committed to ensuring our programs help the  most vulnerable Americans, slashing wasteful, fraudulent, and abusive  spending, and preventing American families from seeing a $2,200 tax  increase next January.…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691361/dignity-of-the-american-dream"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…Pennsylvania. Madam Speaker, I rise today to  recognize Career and Technical Education Month, celebrated every  February. This month allows us to highlight the value of CTE programs,  which help prepare students for the workforce. These are programs that  are about learning to earn.\n\nDuring this month, we can look at the immense impact of CTE programs  on learners…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700190/recognizing-career-and-technical-education-month"}, {"senator": "John Thune", "party": "Republican", "sentence": "…get their products to the market.  I am glad to see support for processing capacity for meat, poultry, and  egg products. And I am pleased that this bill also promotes programs  that help State-inspected plants operate across State lines, which  provides producers with more options for their products and supports  smaller processors.\n\nThe bill also includes…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693501/agriculture-appropriations"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…percent.\n\nThere are so many wonderful single parents out there. I know people  who have done a great job of raising children as a single parent. Of  course, we do have programs to help people who are widows or widowers  in Social Security. That is not, I think, what is normally meant by a  single parent.\n\nOverall, when we go down this path, we have more…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700071/issues-of-the-day"}]