[{"senator": "Andy Barr", "party": "Republican", "sentence": "This bill applies that same America First,  progrowth approach to housing.", "title": "Lowering Housing Costs and Advancing Main Street Community Banks", "date": "2026-02-09"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "We have to have  progrowth policies in place that will unleash growth and prosperity,  and we have to get serious about the first and most important job of  the Federal Government, which is providing for the common defense.", "title": "Concurrent Resolution on the Budget for Fiscal Year 2025", "date": "2025-04-09"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "I also recognize President Trump's administration, crypto czar David  Sacks, and SEC Chair Paul Atkins for  their efforts to reverse the Biden-era irrational opposition and  misguided regulations that we lived with for 4 years toward innovation  and now we are setting America back on a progrowth America First  course.", "title": "Guiding and Establishing National Innovation for U.S. Stablecoins Act", "date": "2025-07-17"}, {"senator": "Ashley Hinson", "party": "Republican", "sentence": "Republicans continue to advance  progrowth, proworker policies that expand opportunity, reward hard  work, and help Americans to get ahead.", "title": "Flexibility for Workers Education Act", "date": "2026-01-13"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "I thank Chairman French Hill for his leadership in confronting the  housing affordability crisis with practical and progrowth reforms.", "title": "Lowering Housing Costs and Advancing Main Street Community Banks", "date": "2026-02-09"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "I appreciate my  colleagues for taking time to reflect on these past 100 days and how  House Republicans are joining the administration to implement a  progrowth, profamily, conservative agenda that will deliver for  Americans across the country.", "title": "The First 100 Days", "date": "2025-04-30"}, {"senator": "Tom Emmer", "party": "Republican", "sentence": "Bottom line: The GENIUS Act is a proinnovation, profreedom, and  progrowth piece of legislation.", "title": "Guiding and Establishing National Innovation for U.S. Stablecoins Act", "date": "2025-07-17"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "That is why I am committed to cutting government red tape, lowering  taxes, and fighting for progrowth policies that empower our  entrepreneurs to thrive, not just survive.", "title": "Recognizing Hard Workers Driving Our Economy", "date": "2025-05-08"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "This is going to be a key factor to making sure that we maintain a  progrowth and profamily tax policy amongst the other aspects of  securing our border, bolstering our economy, supporting domestic energy  production, promoting peace through strength, and making our government  more efficient and effective.", "title": "Advancing America First Policies", "date": "2025-03-26"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "This was a reconciliation bill that included monumental  progrowth and profamily legislation that lowers costs for American  families.", "title": "How Republicans Have Delivered for Americans", "date": "2026-01-14"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "That is why the Trump administration has been championing progrowth  and pro-American policies that are fueling a domestic manufacturing  comeback.", "title": "Made in America Manufacturing Finance Act", "date": "2025-12-01"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "With our community  leaders, we had conversations that focused on the need to extend the  progrowth policies of the Tax Cuts and Jobs Act.", "title": "All Policy is Local", "date": "2025-03-27"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "Under President Trump, our economy is booming, thanks to progrowth  policies that help workers, students, and taxpayers prosper.", "title": "One Big Beautiful Bill Act", "date": "2025-07-02"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "If we do nothing, the Trump tax  cuts, the most progrowth tax reforms in generations, will expire.", "title": "Providing for Consideration of Senate Amendment to H.R. One Big Beautiful Bill Act", "date": "2025-07-02"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "We have an opportunity to reestablish and to make  permanent where we can some of the really progrowth, positive  provisions that come out of that piece of legislation.", "title": "Events This Week", "date": "2025-05-14"}]