[{"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…homes on Connecticut  Avenue were purposely priced to keep working families out, and  covenants were later added to many of the property deeds in Chevy Chase  explicitly prohibiting the land from ever being owned by African  Americans or Jews. These covenants have since been declared void.  Newlands went further to keep Black and White Americans separate.…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694054/francis-g-newlands-memorial-removal-act"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…attend community college, then college, then law school.\n\nImportantly, the Department of Education is a civil rights agency.  The Office for Civil Rights enforces Federal laws prohibiting  discrimination and harassment, investigating thousands of civil rights  cases every year, primarily from students with disabilities. This work  will be more difficult,…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689037/majority-of-americans-support-department-of-education"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…and a 30-day congressional review  and comment period. This bill would help maintain the independence of  the CFO by establishing a permanent floor on the CFO's pay and by  prohibiting the Council from reducing the CFO's pay during the CFO's  term.\n\nAlthough the D.C. CFO is the most powerful non-elected official in  D.C., a number of D.C. employees are…", "date": "2025-12-23", "source_url": "https://justfacts.votesmart.org/public-statement/1698470/introduction-of-the-district-of-columbia-chief-financial-officer-salary-home-rule-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…the Armed Services Committee  and the ranking member of the Veterans Affairs Committee.  Servicemembers and their families in particular have a higher stake in  this rule prohibiting exploitive overdraft fees.\n\nAnd the reason is--despicably, disgustingly--servicemembers are often  targeted by bad actors and financial institutions for abusive and  predatory…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689109/9999"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…the rest of the year, the  Congressional Hispanic Caucus is unified in demanding real  accountability provisions, including requiring ICE agents to identify  themselves, prohibiting agents from wearing masks during enforcement,  restricting the use of deadly force, strengthening hiring and training  standards, enforcing humanitarian standards in ICE…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699655/horrific-ice-abuses"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…force States to allow for the concealed carry of  firearms in gun-free school zones. It also allows the off-duty and  retired officers to completely disregard State laws prohibiting high- capacity magazines.\n\nThis legislation not only supersedes the considered policy judgments  of the States, but it threatens the safety and security of Federal  agencies…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691242/leosa-reform-act"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "Ms. DEAN of Pennsylvania. Mr. Speaker, ``Congress shall make no law  respecting an establishment of religion, or prohibiting the free  exercise thereof; or abridging the freedom of speech, or of the press;  or the right of the people peaceably to assemble.''\n\nI read these words today, the very…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699729/violating-core-tenets-of-our-united-states"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…almost all of them.\n\nWe sought to prevent any funds from being used to detain or deport  U.S. citizens, a commonsense measure. They refused to commit to that.\n\nWe proposed prohibiting interior enforcement by non-ICE personnel,  like the Border Patrol. That was rejected, as well.\n\nWe put forward a provision to ensure that Members of Congress can  continue…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699345/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…enacted by the Senate and House of Representatives of       the United States of America in Congress assembled,       SECTION 1. SHORT TITLE.\n\nThis Act may be cited as the ``Prohibiting Tianeptine and       Other Dangerous Products Act of 2026''.       SEC. 2. NEW PROHIBITED ACTS RELATING TO DIETARY SUPPLEMENTS.\n\n(a) In General.--Section 301 of the Federal…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699792/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…our country's history in the  beginning, only White, landowning men could vote.\n\nThat was changed in 1870 when the 15th Amendment opened the door for  Black men to vote by prohibiting the Federal Government and States from  denying or abridging a citizen's right to vote on the account of race,  color, or previous condition of servitude.\n\nDuring Reconstruction,…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689341/fighting-voter-suppression"}, {"senator": "Katherine Clark", "party": "Democrat", "sentence": "…that he won his Senior Club  Championship golf tournament.\n\nWhat are House Republicans doing?\n\nAre they voting to cancel these taxes? No, they are carving them into  stone, prohibiting us from revealing them, no matter how painful they  get. Then they are pushing the costs even higher. Today, they are  voting to raise overdraft fees.\n\nAfter crashing the…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689842/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…881, the DHS  Restrictions on Confucius Institutes and Chinese Entities of Concern  Act.\n\nH.R. 881 is a solution in search of a problem. In 2018, Congress  passed provisions prohibiting the Department of Defense from providing  funds to any U.S. institution of higher education that hosts a  Confucius Institute, unless that institution receives a waiver…", "date": "2025-05-09", "source_url": "https://justfacts.votesmart.org/public-statement/1690950/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…clinic, Eric uses  litigation advocacy to advance housing equity in Illinois and beyond.  His work with the Illinois Fair Housing Coalition led to the passage of  a State law prohibiting discrimination against housing choice voucher  holders.\n\nEric co-led the Partnership of Just Housing, a national coalition  that improved housing access for people with…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699030/recognizing-eric-sirota"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…DEFIANCE  Act, which provides victims with a civil remedy--a remedy in court-- builds on the progress of the TAKE IT DOWN Act.\n\nThe vast majority of American people support prohibiting  nonconsensual, sexually explicit, deepfake images, with one survey  finding that 85 percent of Republicans and Democrats support this  measure. That is why I am hopeful…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698999/disrupt-explicit-forged-images-and-non-consensual-edits-act-of-2025"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…members. While this conferenced version of the NDAA does not  include all the culture war related provisions from House version, it  does retain some. That includes a provision prohibiting transgender  Americans from participating in sports at the U.S. service academies,  which is an unnecessary attack on transgender Americans who are already  prevented from…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698005/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Shelley Capito", "party": "Republican", "sentence": "…overwhelmingly clear: Source  reclassification reduces hazardous air pollution in our communities.\n\nWe need to take every opportunity available to rightsize regulatory  requirements prohibiting our ability to revitalize American  manufacturing and achieve energy dominance, while taking steps that  reduce emissions through innovative technologies that I have advocated…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690524/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Ken Calvert", "party": "Republican", "sentence": "…rise today to urge my colleagues to  approve my bipartisan legislation, H.R. 252, the Secure Our Ports Act.\n\nThis bill is designed to strengthen our national security by  prohibiting foreign adversaries from owning and operating critical  infrastructure in the United States.\n\nChina's influence and access to critical infrastructure around the  world continues…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692207/secure-our-ports-act-of-2025"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…recognized the threat, but had zero  support from the Colorado legislature, who at the same time passed more  laws to make it worse. The Colorado legislature passed laws prohibiting  law enforcement from honoring ICE detainers. The Colorado legislature  restricted data sharing with Federal immigration agencies. The  legislature also passed a law that…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692103/save-sba-from-sanctuary-cities-act-of-2025"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "…Secretary of State or the Secretary of the Treasury, as       the case may be, pursuant to Executive Order 13224 (50 U.S.C.       1701 note; relating to blocking property and prohibiting       transactions with persons who commit, threaten to commit, or       support terrorism).\n\nMr. GUEST.  1327.\n\nMr. Speaker, I rise in support of H.R. 1327, the Syria Terrorism…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697015/syria-terrorism-threat-assessment-act"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…American taxpayers aren't saddled with covering these  costs.\n\nIt protects family farmers.\n\nIt ends abusive financing practices in Medicaid by freezing provider  taxes and prohibiting new provider taxes.\n\nIt reins in the Consumer Financial Protection Bureau, and it rolls  back harmful Biden-era regulations that increase costs and  administrative burdens…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692263/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…fintech sector.\n\nThis package brings regulatory clarity to the digital asset  ecosystem, promotes market innovation, and protects Americans'  financial freedom and privacy by prohibiting the Federal Reserve from  issuing a CBDC without congressional approval.\n\nThese bills are the product of years of thoughtful, collaborative  work, some of which I was proud…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693549/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…necessary--\n\n(A) for applicable time periods specified in subsection       (b), (c), or (d) of section 36 of such Act, during which       Congress may enact a joint resolution prohibiting the       approval of such application; or\n\n(B) for such time as may be required to receive a decision       from the Secretary of Defense with respect to an application…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694830/international-traffic-in-arms-regulations-licensing-reform-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…totaling over $60 billion in  costs and regulating nearly every appliance in Americans' homes. Part  of this effort focused on complicating the definition of a showerhead  by prohibiting multi-nozzle shower systems if the whole system  collectively delivers more than 2.5 gallons of water per minute,  instead of following the straightforward statutory definition…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698566/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…by striking ``and'' at the end;\n\n(2) in paragraph (4) by striking the period at the end and       inserting ``; and''; and\n\n(3) by adding at the end the following:\n\n``(5) prohibiting a representative of a government of       country that the Secretary of State has determined has       repeatedly provided support for acts of international       terrorism…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…forgotten about their for the politicians act in  the 117th Congress, where they basically codified a COVID-era and  fraud-ridden election law. They included, ironically, prohibiting voter  ID essentially. It also included ballot harvesting, promoting mass  voting by mail, and taking taxpayer dollars to fund political  campaigns.\n\nLet's be clear. Democrats…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700003/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "John Rose", "party": "Republican", "sentence": "…managed  and micromanaged by the Federal Government.\n\nPresident Trump understands the dangers of more government and more  surveillance. It is why he issued an executive order prohibiting a  CBDC. The vote before the House would make that ban permanent, and I  urge my colleagues to support this bill.\n\nMr. Speaker, today the House will vote on the GENIUS Act,…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693729/anti-cbdc-surveillance-state-act"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…biggest  foreign adversary to exploit breakthroughs for Chinese strategic  advantage.\n\nThis bill protects our institutions of higher education from the  dangers of the CCP by prohibiting American universities that receive  Department of Homeland Security funding from continuing relationships  with Chinese entities of concern.\n\nToday, foreign language and…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690825/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "…20 years.\n\nDespite vocal objections from the State, the people who actually use  the  land, the final plan prohibits coal leasing on over 4 million acres by  inexcusably prohibiting all future development outside of a 4-mile  radius from current development--over 90 percent of North Dakota's  affordable, reliable coal, out of touch. It is gone.\n\nIt…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696136/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…never made again by  removing DOE from the statutory authorization process.\n\nThis legislation maintains the President's authority to impose  sanctions on foreign governments, prohibiting imports or exports, if  justified. Free trade, open markets, and competitions have resulted in  the U.S. emerging as a global energy superpower. Lifting these  restrictions…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697089/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…voter ID.\n\nMr. Speaker, I am about to yield 2 minutes to my friend from Arizona,  but I will just note that, as one of the lead sponsors of the  legislation to deal with prohibiting Members of Congress from engaging  in the act of trading in stocks, we are working on a bipartisan basis.  We have legislation we are going to move. There will be a time…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699943/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}]