[{"senator": "Shomari Figures", "party": "Democrat", "sentence": "…guards who support them  risk their lives every day to protect Federal workers and the public by  controlling access to government facilities and screening visitors for  prohibited items. As part of these efforts, FPS investigators have  covertly tested security at Federal buildings to ensure the accuracy of  these systems and have developed a tracking…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695059/personnel-oversight-and-shift-tracking-act-of-2025"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…million people who are presently not allowed to  possess or buy firearms in this country--convicted domestic abuses,  convicted felons in every State, fugitives, and other prohibited  purchasers--would legally be able to buy these dangerous weapons, like  tasers, that are designed to incapacitate their targets.\n\nA convicted domestic felon, who has been…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700036/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…worst, and it could have some unintended  consequences as we will discuss in the course of this debate.\n\nWhen Congress uses the CRA to repeal a rule, then the agency is  prohibited by law from issuing a substantially similar rule on the same  topic. The decision to repeal this rule could lead to some unintended  consequences that would backfire on the…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690404/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "…measures increased accountability for bad apples with  independent civilian oversight, clean disciplinary process, and  mandatory reporting for overuse of force incidents.\n\nIt prohibited the hiring of officers with prior misconduct, and it  prohibited choke holds. They improved training for officers. The Mayor,  the D.C. City Council, and the community all…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696935/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…opened her own  place on 5th Street in Louisville. She called it Dixie's Elbow Room.  Although Dixie was allowed to own and run a bar, a two-hundred-year-old  Kentucky law prohibited women from working as bartenders or even  sitting at bars. Dixie decided that just  wasn't right, and, in 1968, she hired her very first woman bartender  and served a woman…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695585/recognizing-the-extraordinary-life-of-dixie-demuth"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…programs will help improve their management skills, communicate with  their colleagues, and mentor fellow employees. It will also help them  when it comes to knowing what is prohibited when it comes to personnel  practices, employee rights, and how those rights must be protected.\n\nA lot of these Federal agency supervisors actually live in my  district.…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698217/federal-supervisor-education-act"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…theological venue.\n\nUnlike prior iterations of this bill, the current bill prohibits demo  days from taking place at facilities owned by religious institutions.  That is what is prohibited. It allows both Native American Tribes and  startup incubators to host them.\n\nI am aware of several instances where bad actors took advantage of  the halo, if you will, of…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692724/helping-angels-lead-our-startups-act-of-2025"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…jurisdictions in neighboring Maryland. It continues to be       unlawful for non-citizens to vote in federal elections in the       District. In fact, federal law has prohibited non-citizens       from voting in federal elections since 1996. Our local law       cannot and does not attempt to change that.\n\nFinally, we oppose H.R. 2056, which attempts…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692373/district-of-columbia-federal-immigration-compliance-act-of-2025"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…disclose or use       information provided in applications filed under this Act or       in requests for DACA for the purpose of immigration       enforcement.\n\n(b) Referrals Prohibited.--The Secretary may not refer any       individual who has been granted permanent resident status on       a conditional basis or who was granted DACA to U.S.       Immigration…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697541/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…markup of this bill:\n\nJust because you have $1 million doesn't mean you       understand the complexities of the private markets. On the       other hand, you shouldn't be prohibited from investing in       products if you have full knowledge of the risks involved but       don't happen to have $1 million.\n\nI would add to that that our definition of ``accredited…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692775/fair-investment-opportunities-for-professional-experts-act"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…my colleagues on the other side of the aisle want zero consumer  protection and the Trump administration to have an excuse.\n\nThe excuse is: Congress passed the CRA. We are prohibited from  writing a regulation in that area.\n\nThe Republican administration could rewrite these rules. Congress  could overwrite these rules. Instead, we are erasing the rules…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689952/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…getting a firearm,  and this dangerous loophole is designed to ensure that they now will  see a giant sign saying, ``Come get your weapon,'' because they no  longer will be prohibited from getting one of these weapons, while the  police officers, the law enforcement officers across this country, get  no benefit. In fact, their job is made more difficult…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700030/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…In doing so, this administration is turning back the clock on  disability rights. Multiple States, including the State I live in and  represent, California, have already prohibited subminimum wages for  workers with disabilities. Good for them. These subminimum wage laws  federally have been used to justify paying people just a few cents per  hour for…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695575/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…there, he called it pro-life counseling  services.\n\nActually, this just does not fit within the four core purposes of the  TANF bill, which is why the Biden administration prohibited this. No  more that we provide moneys for abortion counseling, which if you stop  and think about it, it would fit more neatly into the core provisions  of the TANF bill,…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699222/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…ensure that pipelines are safe before making it  easier to build more of them. Mr. Speaker, my colleague Ranking Member  Castor filed an amendment to this bill that would have prohibited this  bill from taking effect until Congress reauthorized the pipeline safety  bill.\n\nUnfortunately, Republicans blocked it from coming to the floor.  Apparently, they are…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698067/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…the 2020 Record of Decision       made approximately 18.6 million acres, or 82 percent, of the       NPR-A's subsurface estate available for oil and gas leasing       and prohibited new infrastructure on approximately 4.3       million acres.\n\nThe ROD adopts other management approaches that differ from       the 2020 Record of Decision. For example,…", "date": "2025-07-28", "source_url": "https://justfacts.votesmart.org/public-statement/1694269/us-government-accountability-office-legal-opinion"}, {"senator": "Steve Daines", "party": "Republican", "sentence": "…B-329065, Nov. 15, 2017, we       concluded that four BLM RMPs had a substantial effect on non-      agency parties where the plans limited the use of public land       and prohibited mining and operation of off-highway vehicles       in the areas they governed.\n\nConsistent with our caselaw on other RMPs, the Miles City       RMPA has a substantial effect…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693085/us-government-accountability-office-legal-opinion"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…is not about politics. It is not about trying to  make half of 1 percent of the population happy for the rest of us.\n\nUnder this amendment, the Secretary of War would be prohibited from  collecting information for a form or survey related to gender identity.  ``Male'' and ``female'' are the only two options that should be listed  for questions about…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695260/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…announces bills that will be considered under suspension of       the rules in that chamber. Under suspension, floor debate is       limited, all floor amendments are prohibited, points of order       against the bill are waived, and final passage requires a       two-thirds majority vote.\n\nAt the request of the Majority Leader and the House…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697267/expanding-wksi-eligibility-act"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…on making sure that we have a conversation around how do  we prevent this from happening again. Unfortunately, in sanctuary  States like Colorado, local law enforcement is prohibited from sharing  information with their Federal counterparts, Mr. Speaker. This terror  attack in Boulder is an example of why these sanctuary policies are  dangerous to the…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692192/denouncing-the-antisemitic-terrorist-attack-in-boulder-colorado"}, {"senator": "William Timmons", "party": "Republican", "sentence": "…ensure that the purchase by the agency of any software       is based on publicly available criteria that are not unduly       structured to favor any specific vendor, unless prohibited by       law (including regulation);\n\n(6) include any estimates for additional resources,       services, or support the agency may need to implement the       plan;\n\n(7)…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698153/strengthening-agency-management-and-oversight-of-software-assets-act"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…Federal Regulations (or a successor regulation), if       the following requirements are met:\n\n(A) The FMOC attests that none of the cylinders made by the       FMOC are prohibited from entry to the United States under       section 307 of the Tariff Act of 1930 (19 U.S.C. 1307).\n\n(B) The FMOC certifies that--\n\n(i) the information provided pursuant…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692179/compressed-gas-cylinder-safety-and-oversight-improvements-act-of-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…spouses, dependent children, and trustees from owning, buying, or  selling individual stocks, securities, commodities, or futures.\n\nUpon enactment, covered individuals are prohibited from purchasing  covered assets and must divest from all covered assets at fair market  value within 180 days for current Members and 90 days for incoming  Members.\n\nIndividuals…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…Secretary in accordance with the       laws and regulations generally applicable to property held in       trust by the United States for an Indian Tribe.          (c) Gaming Prohibited.--Land taken into trust under this       section shall not be used for any class II gaming or class       III gaming under the Indian Gaming Regulatory Act (25 U.S.C.…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698137/pit-river-land-transfer-act-of-2025"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…sports, dating, marrying, and having kids of their own.\n\nToday, that number is estimated at over 2.6 million children not  aborted, all because abortion subsidies have been prohibited by the  Hyde amendment in Federal Medicaid programs and other HHS programs.\n\nIt is time to add the Hyde amendment to the ACA.\n\nI believe it is time, as well, for all of us…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698800/breaking-the-gridlock-act"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…study the oil and gas potential of the  1.57-million-acre Coastal Plain, a designated area of ANWR that held  great promise of oil and gas resources. However, section 1003  prohibited oil and gas production or leasing in ANWR unless authorized  by an Act of Congress.\n\nOver the following years, DOI completed assessments of the area's oil  and gas potential…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697739/9999"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…activity is specifically authorized pursuant to       subsection (b).\n\n(b) Specific Authorization.--The Secretary of State may       specifically authorize an activity otherwise prohibited by       subsection (a) if--\n\n(1) the Secretary--\n\n(A) obtains in writing an assurance from the relevant       program partner, implementor, or contractor that such…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690654/no-dollars-to-uyghur-forced-labor-act"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…Authorization Act of 2018 (Public Law 115-282) is amended by       adding at the end the following:       ``SEC. 904. INFORMATION ON TYPE APPROVAL CERTIFICATES.\n\n``Unless otherwise prohibited by law, the Commandant of the       Coast Guard shall, upon request by any State, the District of       Columbia, any Indian Tribe, or any territory of the United       States,…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…options of a United States CBDC.''\n\nPresident Trump understands a CBDC's threat to our American freedoms.\n\nIn his January 2025 executive order, President Trump explicitly  prohibited any Federal agency from issuing or advancing a CBDC without  direct congressional authorization.\n\nIn a free society, Mr. Speaker, financial privacy and private  property…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693734/anti-cbdc-surveillance-state-act"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…whatsoever on the criminal activities of Jeffrey  Epstein, no participation. Their lives are forever ruined.\n\nI am reading specifically from the petition's language that  ``prohibited grounds for withholding'' information in this file are  ``embarrassment, reputational harm, or political sensitivity.''\n\nI would just submit that if you were going to be…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696815/epstein-files-transparency-act"}]