[{"senator": "Jim Himes", "party": "Democrat", "sentence": "…vegetables, pasta sauce, pasta, televisions, automobiles, and  burgundy, a fine French claret for my Republican friends over there.\n\nNumber two: Stop canceling generation projects, which will make  electricity cheaper.\n\nThat was my speech. Instead, we are here to denounce the horrors of  socialism. That is not what I was prepared to talk about. If I…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697156/denouncing-the-horrors-of-socialism"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "…today to join millions of American  women in condemning Trump's attempt to gut funding for women's health  research.\n\nThe Trump administration has rescinded women's research projects at  an alarming rate. These projects include lifesaving research on early  breast cancer detection and so much more. Trump even shut down the  Women's Health Initiative, our…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690578/protecting-womens-health-research"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…top priority for millions of acres of public land across the  country, no matter the cost. They are picking winners and losers here,  blocking affordable renewable energy projects, and sacrificing our  public lands in the process.\n\nMr. Speaker, I urge my colleagues to reject these reckless  resolutions that would upend millions of acres of public land…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696881/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Marc Veasey", "party": "Democrat", "sentence": "…enduring commitment to service  and empowerment. From its collaboration with Arlington ISD on the  annual Back to School Kick-off at AT&T Stadium, to its many ``Done in a  Day'' projects, JLA consistently answers the call to serve families,  women, and children in need.\n\nAs the League begins a new chapter in its new home at Wellspring on  Main--The Arlington…", "date": "2025-10-28", "source_url": "https://justfacts.votesmart.org/public-statement/1696424/recognizing-the-junior-league-of-arlington-empowering-women-strengthening-community"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…inquiring on their behalf are still  waiting for answers.\n\nMy office has heard that in some cases the Department of Energy can't  even determine who is responsible for certain projects because too many  experienced staff have been pushed out of office. With the Department  of Energy already struggling to meet its current obligations, how can  we pretend…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697891/electric-supply-chain-act"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…world.\n\nThe NSF can claim 268 Nobel Prize winners. Yet now we have a  President and an administration that is antiscience and antiprogress.\n\nJust as we have made investments in projects that are pivotal in  artificial intelligence, quantum, and other leading areas at NIH, NOAA,  NASA, the CDC, EPA, and, tragically, the National Science Foundation,  now is…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691389/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…also be Muslim. This individual had been doing a lot of  work all across Northern Virginia, working with local governments and  others, trying to develop affordable housing projects.\n\nHe was working specifically with a county in outer Northern Virginia.  He had been assured everything was set. He was going out to the meeting  where it was going to be…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698866/commerce-justice-science-energy-and-water-development-and-interior"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…subject to Council approval. The National Capital  Planning Commission (NCPC), which is the central planning agency for  the federal government in D.C. and approves federal projects in D.C.,  is responsible for the federal elements of the comprehensive plan. This  bill would not alter the comprehensive plan process or the authority of  NCPC and the Commission.…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692763/introduction-of-the-district-of-columbia-zoning-commission-home-rule-act"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…stuff. They don't want to go back to  the ``Farmers' Almanac'' in order to make key business decisions.\n\nWe see hundreds of millions of dollars in water supply infrastructure  projects suddenly in limbo because of DOGE, while our colleagues across  the aisle say nothing.\n\nWe see the entire rural healthcare safety net, including nursing home  care, including…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690601/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…ambiguity we afford them, the more they will exploit it. One of the  best ways to rein in this reckless administration is by providing  precise spending levels for specific projects that they are bound by  law to carry out.\n\nThat is exactly what this bill does.\n\nMs. DeLAURO.  Kaptur), the distinguished ranking member of the Energy and  Water Development…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698760/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…per state based on the monthly electricity bill data released       by the federal Energy Information Administration (EIA) for       January-August of 2025. The Committee projects that annual       electricity costs will be at least 5 percent higher than last       year in 37 states plus D.C., and at least 10 percent higher       than last year in 10…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697034/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…role in the pipeline  process, and serve absolutely no one, except the worst corporate  polluters, all while the Trump administration blocks and cancels new  clean energy projects across the country.\n\nMr. Speaker, these bills basically double down on failed Republican  energy policies that have already driven up energy bills on American  families and…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698067/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…nontraditional  government contractors to more quickly obtain cutting-edge emerging  technologies that addressed evolving threats.\n\nSince September 2024, the lapse in OTA, 50 projects have been  disrupted, including 1 that led to identifying fraudulent documents,  improving passenger screening, and enhancing disaster response.\n\nFurthermore, 26 projects…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688702/producing-advanced-technologies-for-homeland-security-act"}, {"senator": "Jimmy Panetta", "party": "Democrat", "sentence": "Mr. PANETTA. Mr. Speaker, I rise as a co-lead of the Studying NEPA's  Impact on Projects Act.\n\nAs we have heard, this is a bill that would require the Council on  Environmental Quality to provide annual reports that evaluate the  efficiency and effectiveness of…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697712/studying-nepas-impact-on-projects-act"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…bipartisan bill to support the completion of this  project.\n\nThe administration has no problem subsidizing water for certain  stakeholders, including large-scale agricultural projects, yet when it  comes to a tailored bill to ensure access to safe drinking water for  rural communities, unfortunately, the President has taken a different  path.\n\nNow, we are…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698699/finish-the-arkansas-valley-conduit-act-veto-message-from-the-president-of-the-united-states"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…worked diligently to improve the quality of life for  residents. His time on the Council was marked by his advocacy for local  businesses, support for community development projects, and dedication  to preserving the town's historic charm. He was always accessible,  listening to the concerns of citizens and striving to make decisions  that benefited the…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690159/recognizing-casey-thieryung"}, {"senator": "Brad Finstad", "party": "Republican", "sentence": "…industry, relied upon by federal, state, and  local partners, as well as commercial and private customers who have  trusted Brian and his family business to bring these important projects  to completion.\n\nHis leadership has grown the now-fourth-generation company into one  of southern Minnesota's leading employers. Brian has contributed in  many ways to the…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688312/recognizing-brian-mathiowetz"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…death in States like mine.\n\nIf we want affordable and dependable energy in our country, then we  must build the infrastructure that delivers it. However, too often  these projects are delayed or blocked by a Federal permitting process  that is far too inconsistent. When one State can derail an interstate  pipeline, then entire regions pay the price.…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698057/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Ryan Zinke", "party": "Republican", "sentence": "…but I have actually read the documentation. I have actually  read the mining plans. I have a degree in geology and looked closely at  it. Do you know what. There are good projects, and there are bad  projects. We don't mine like we used to.\n\nIn Montana we have Virginia City. They took a paddleboard up the  river stream, took everything, turned it around.…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699276/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…for 9 years in a row. Now, there is a time value of money,  but even given the time value of money, it means that the government is  paying for 70 percent of some people's projects.\n\nThere are some requirements as to whom they rent these to, but the  requirements are not stringent. Some people point out that they can  almost take people at random in…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691328/the-big-beautiful-bill"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…China. This is what Democrats are for. This is how they  are wanting to spend your money.\n\nWith $38 trillion in debt, they will keep on spending and spending on  their pet projects. President Trump is calling an end to it.\n\nMr. Speaker, of this, we are talking about $9.4 billion in  rescissions, funds that should never have been appropriated in the…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692389/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…on the Hill. This was an opportunity for Scouts  to meet with Representatives and showcase what they have learned or  built as a Scout. It was an honor to see the various projects Scouts  have completed. All of them demonstrated the important values of  service, community, and character.\n\nScouting demands physicality, innovation, curiosity, and for…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699723/national-scouting-day"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…a cornerstone of  service in our community since 1950.\n\nFor 75 years, the St. Mary's Rotary Club has exemplified the Rotary  motto  of Service Above Self through countless projects supporting local  schools, awarding scholarships, and promoting youth leadership.\n\nTheir commitment to bettering our community is unwavering, and to  mark this milestone,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690205/recognizing-st-marys-rotary-clubs-75th-anniversary"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…North Carolina. Mr. Speaker, if we can't unite and say  no to exporting transgender ideology abroad, say no to taxpayer-funded  leftwing propaganda, and say no to funding pet projects that put  America last, then what is the point of being called a Republican?\n\nMr. Speaker, I rise today to urge my colleagues to defund NPR, PBS,  and USAID. For decades,…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692534/rescissions-act-of-2025"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…the actions the Small Business Administration will       undertake to establish and implement policies and procedures       to govern information technology modernization projects of       the Administration. Such policies and procedures shall, with       respect to each project--\n\n(1) for each risk identified, explicitly state the source       of such…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697273/sba-it-modernization-reporting-act"}, {"senator": "Rudy Yakym III", "party": "Republican", "sentence": "…erection, proudly serving not only Indiana but also throughout  the Midwest.\n\nOver the past five decades, the company has completed countless high- quality metal building projects, as well as specialty installations,  demonstrating excellence and innovation at every turn.\n\nLeMaster's growth is a testament to their hard work, skill, and  dedication to…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693965/9999"}, {"senator": "Nathaniel Moran", "party": "Republican", "sentence": "…United States State Department  contracts with companies tied to forced labor in the Xinjiang region of  China.\n\nOur bill would ensure that U.S. funds are not used to finance  projects in partnership with companies or organizations that import  products mined or manufactured in the Xinjiang Uyghur Autonomous Region  of the People's Republic of China.\n\nMany…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690655/no-dollars-to-uyghur-forced-labor-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…this bill were championed by our committee.\n\nMy bill, H.R. 1474, the International Nuclear Energy Financing Act,  expands U.S. financing tools for civilian nuclear energy projects  abroad, helping U.S. companies compete globally while promoting safe  and reliable energy as an alternative energy source from opposing  nations.\n\nIt requires the Treasury…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699048/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…(including costs associated       with emergency actions covered by a contingency plan under       paragraph (2)(K)); and\n\n``(H) the proposed project is not in a category of projects       that would require a permit under title V.\n\n``(2) Project submission.--The State shall submit a request       for approval to the Secretary that shall include--\n\n``(A)…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691092/community-reclamation-partnerships-act-of-2025"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…growth mindset and  are willing to take on the challenges brought by fluctuating markets.  You both strive to progress into new areas but are willing to take time  for one-off projects in order to help an individual in your hometown.\n\nFor Wyoming's business community and small businesses across our  great Nation, I am committed to ensuring that we pass legislation…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690788/big-beautiful-bill"}]