[{"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…million people currently insured. Now, all of a  sudden, uninsured, means cost to the system, to say nothing of the cost  to these individuals. Just as eye-popping is the projection that this  proposal will drive up premiums and out-of-pocket spending for millions  of people struggling to afford private insurance plans through the ACA  marketplace or…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692972/one-big-beautiful-bill"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…Middle East. It  is unfortunate that the Department of Defense has failed to provide the  Appropriations Committee with a full account of operational costs in  SOUTHCOM and a projection of what future costs may be incurred.  Military units supporting Operation Southern Spear are incurring a  different type of cost, lost time training for missions that they…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698418/supporting-of-h-con-res-61-and-h-con-res-64"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…come out a week ago so people could  look on the exchange and see what their policies are going to cost. We  don't have a new, comprehensive analysis. The preanalysis, the  projection, was that the average cost would go up not 5 percent or 10  percent or 15 percent but about 68 percent. That is because the premium  goes up, the tax credits come down, and…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…Services Committee.\n\nAfter 17 years, this is Phil's last week on the committee. Phil  joined the committee staff in 2009 and has been the Democratic lead for  the Seapower and Projection Forces Subcommittee since 2011. He has made  indispensable contributions to the committee's work and the security of  our Nation, spearheading reforms to improve safety,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699643/services-committee"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…shipbuilding above the administration's request, including $1.9 billion  to address glaring OMB budget request shortfalls in the Virginia  submarine account. The Seapower and Projection Forces Subcommittee also  strengthened the industrial base by replenishing last year's wage  improvement authorities with 615 million new dollars to continue  progress in…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697788/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…aircraft to  the President of the United States but Air Force One. And why does this  matter? Air Force One is not just a random luxury airplane. It is a  symbol of and a projection of American power. It has flown 15 different  Presidents. It carried President John F. Kennedy's body after his  assassination and saw President Johnson be sworn in under…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690968/qatar"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…also for the West, for       NATO,'' he added. ``Libya used to be the flank of NATO.''\n\nAnd elsewhere on the continent itself, he predicted that       inaction on Russia's projection of influence through the       deployment of personnel in regions like the Sahel could       precipitate a broader geopolitical shift for Africa at a time       when many…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697384/recognizing-the-importance-of-libyas-return-to-stability"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…crippled by staff cuts.\n\nIn Foreign Affairs, this bill provides continued security assistance  to our friends and allies throughout the world. It maintains some  effective projection of presence out there into the world. It funds the  Countering PRC Influence Fund that is so important to us.\n\nIn transportation, the Federal Aviation Administration, it…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699571/consolidated-appropriations-act-2026"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…state of Hawaii. Located  in the middle of the Indo-Pacific, Hawaii is not just a remote island  economy dependent on maritime commerce. It is the linchpin of U.S.  power projection and force posture across the Indo-Pacific. Any  disruption to Hawaii's shipping system is not only an economic risk to  our residents but a direct vulnerability in America's…", "date": "2025-08-01", "source_url": "https://justfacts.votesmart.org/public-statement/1694572/introduction-of-the-merchant-marine-allies-partnership-act"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…rank of Commander and  received well deserved commendations and medals for his outstanding  service.\n\nMr. Speaker, as both the Chair and Ranking Member of the Seapower and  Projection Forces Subcommittee to which Phil devoted much of his time  on the Hill, I had the privilege of seeing up close his work in action.  The Seapower Subcommittee has a long…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699522/9999"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…conflict will likely be a test of lethality at very long  distances.\n\nThat is why I have spent years urging successive administrations to  rebuild--rebuild--our global power projection and long-range fires. It  is why I criticized the Biden administration for talking about China as  the ``pacing threat'' but turning in defense budget requests that  didn't…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695989/9999"}, {"senator": "Trent Kelly", "party": "Republican", "sentence": "…year's bill.\n\nI thank my friend and Seapower Ranking Member   Joe Courtney for his  commitment to bipartisanship and his continued collaboration toward  stronger naval and projection forces.\n\nFinally, I thank Kyle Noyes, Kelly Goggin, Phil MacNaughton, and Abby  Snyder, the subcommittee staff. I also thank my personal staff, Semaj  Redd, and my fellow,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695143/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Cindy Hyde-Smith", "party": "Republican", "sentence": "…levels of education of such faculty members;\n\n``(iii) the number of nursing faculty member vacancies at       the entity at the time of application, and the entity's       projection of such vacancies over the ensuing 5-year period;       and\n\n``(iv) a description of the entity's plans to identify       funding sources to sustainably continue, after the…", "date": "2026-01-27", "source_url": "https://justfacts.votesmart.org/public-statement/1699386/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Trent Kelly", "party": "Republican", "sentence": "…Chairman Rogers and Ranking Member Smith for their leadership on  the critical acquisition reforms in this bill. I also thank my good  friend, Subcommittee on Seapower and Projection Forces Ranking Member    Joe Courtney, for his dedication to supporting our naval and projection  forces.\n\nAmerica's Navy and Air Force are incredible assets for our country,…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697808/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Better Medicare, has been introduced. It is in the  process of being scored. Yet, when you start to see these sorts of  dollars--and, yes, it would change the current spending projection by  about 10 percent to 10.7 percent according to the Joint Economic  Committee economists. Yet, you already had the MedPAC saying it is  already 25 percent more expensive…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691518/truth-telling-with-math-and-facts"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…CEOs of the rail authority outnumber the passengers 5-0. Mr.  Speaker, $17 billion has been spent already, and literally nothing has  been built.\n\nBy the way, the initial projection was that this thing was going to  be done in 2020. That is what we were told when it was proposed in  2008, that by the year 2020, we will have a high-speed rail system,…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…when you hear people say, current policy baseline, just do it.\n\nWe have been trying to do the math. The Congressional Budget Office,  a couple of months ago, actually did a projection saying that if we  want to maximize economic growth over the next 10 years, what you do is  extend those tax cuts but pay for them. The basic idea is that by  paying for…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689025/tell-the-truth-about-math"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…important--and see if I  can make this make sense.\n\nThis is last year. The red is spending. The blue is tax receipts.  That gap is debt. You will notice, actually, that our projection for  the fiscal year 2026 is our tax receipts--so tax collections are  actually up. They are actually up almost 17.8 percent, which is  wonderful. Most of it is capital gains.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698412/fun-with-math"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "Ms. FOXX. Mr. Speaker, I thank the gentlewoman for yielding.\n\nMr. Speaker, psychologists have a word for the things the Democrats  accuse us of: ``projection.''\n\nMr. Speaker, I sure hope you did not watch all 7 hours of the  Democrat group therapy session last night in the Rules Committee, but  if you did, you saw what a clown…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696692/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…concerned. It sounds like she was trying to quote what she actually  thought she heard on cable news.\n\nMr. Speaker, I had to walk her through saying, okay, here is the best  projection. Remember, some of this fraud may have happened over a  decade. We are still getting all the numbers. There have already been a  number of prosecutions, ``Minneapolis woman…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698698/congress-is-a-math-free-zone"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…chain shock;\n\n(B) critical supply chain risk mitigation and recovery       planning with respect to a supply chain shock, including any       planned or past assessment, projection, or estimate of a       vulnerability within the critical supply chain, including       testing, supplier network assessments, production       flexibility, supply chain…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690188/promoting-resilient-supply-chains-act-of-2025"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…critical role in America's space  strategy.\n\nAlaska's geostrategic location in the Arctic makes it an  indispensable asset in America's national defense and global power  projection. As the closest U.S. State to both Russia and China, Alaska  provides unparalleled access to the Arctic, a region rapidly growing in  economic and military significance.…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687923/space-dominance"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…stability. Maybe  that is what we just did a few minutes ago.\n\nOnce again, this is the single board that gets me the most hate mail.  It also is the truth. This is the 30-year projection. If my colleagues  look at the 30-year projection from the Congressional Budget Office--I  didn't produce this. They did, and we believe it is already way out of  date because…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688088/republican-budget"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…of future judges.\n\nProposals for new courthouses are driven not by building condition,  security, or even the need for more space for current judges, but by  the court's projection of future judges. The court's own methodology  for prioritizing the need for a new courthouse, for example,  relegated security concerns to just 10 percent of a weighted…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695378/courthouse-affordability-and-space-efficiency-act-of-2025"}]