[{"senator": "Darren Soto", "party": "Democrat", "sentence": "…Her passion led her to preserve one of Orlando's unique landmarks,  the Wells'Built Hotel. During the days of segregation, it provided  lodging to some of America's most prominent citizens, including Justice  Thurgood Marshall, Ray Charles, and performers on the chitlin circuit.  Today, that landmark is known as the Wells'Built Museum of African  American…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689507/recognizing-geraldine-f-thompsons-service-to-the-great-state-of-florida"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…social  cost of carbon calculations, damages that the EPA acknowledges as  important but has not yet included in social cost of carbon  calculations. It includes some pretty prominent impacts like on  fisheries and mariculture and tourism and recreation and, of course,  aesthetic values. That is a pretty big suite of harms.\n\nAt the end of the day, the…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699613/9999"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…His musical journey included  working at WJIZ, where he earned the title ``No. 1 Soul Wax Man,''  famously known as ``The Love Man--6 Foot 2.'' He also collaborated with  prominent organizations such as Atlantic Recording Company in New York,  WDAS Radio Broadcasting Station in Pittsburgh, PA, and WOAK in Atlanta,  Georgia.\n\nAs an astute entrepreneur,…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692741/in-memory-of-overseer-roosevelt-carter-i"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…described her own reaction being depicted  this way without her consent. She said:\n\nThere's a shock to seeing images of yourself that someone       could think are real.\n\nWhile prominent women are often the target for nonconsensual, sexual  deepfakes, sadly, the victims can be virtually anyone.\n\nThere are distressing reports of high school students struggling…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698999/disrupt-explicit-forged-images-and-non-consensual-edits-act-of-2025"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…four Republicans saved  this House from disgrace. We almost passed a resolution to remove a  Member from committees for the sin of exercising free speech.\n\nCharlie Kirk was a prominent figure, beloved by many, disliked  heartily by others.\n\nIf the First Amendment means anything, it means the ability to say  anything we want, short of actionable libel, with…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695637/first-amendment-is-keystone-of-our-liberties"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "Mr. BEYER. Mr. Speaker, I rise to recognize and include in the  Record, three prominent community members in the Nepali American  community who have contributed to cultivating arts, culture, and  business around the country.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695611/recognizing-navin-kc-luna-shrestha-and-nabaraj-kc"}, {"senator": "Katherine Clark", "party": "Democrat", "sentence": "…to address famine,  control disease, and build infrastructure in developing nations, you  are ceding our power to our rivals. You are planting the seeds of  future wars.\n\nA prominent Republican said this week that he just couldn't justify  these investments. In this debate, I have heard that this is about  putting America first. What are Republicans talking…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692545/rescissions-act-of-2025"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…increase when the economy is growing       and to decrease when it is not. The significant reduction in       the trade deficit during the Great Recession is the most       prominent recent example.\n\nAs the Supreme Court considers the Trump Administration's       argument that the trade deficit represents an extraordinary       threat, we respectfully…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699566/opposing-the-trump-administrations-sweeping-national-tariffs"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…capacity, thereby  corrupting both the executive branch and the judiciary. To advance this  end, Donald John Trump solicited and received $940 million in pro bono  services from prominent law firms to help causes he personally  supports.\n\nDonald John Trump has refused to divest himself or take any steps to  prevent conflicts of interest in his substantial…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691079/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…story around this because before the  challenge to the Gaspee that led to that shooting, the Gaspee had been  harassing other Rhode Island shipowners. One of them was a very  prominent individual.\n\nThe Gaspee seized a boat called the Fortune, and this reading is from  the chapter ``The Dark Affair, The Gaspee Incident'' from ``An Empire  on the Edge'' by…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691707/253rd-anniversary-of-the-gaspee-raid"}, {"senator": "Kweisi Mfume", "party": "Democrat", "sentence": "…and Comcast. Allen is  also a noted philanthropist, helping to raise tens of millions of  dollars for charitable causes.\n\nOver the years, Allen has established himself as a prominent Black  entertainment mogul who holds the principle of equity in extremely high  regard. He recognizes the disadvantages that underrepresented  communities face, and he has…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696283/recognizing-a-magnanimous-media-mogul-mr-byron-allen"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…in those countries, whom no other  Christian hierarch has ever visited. As a result, the Patriarch has  created more bridges between Christianity and Islam than any other  prominent Christian leader.\n\nThe Patriarch's concerns are not just limited to interfaith conflicts  but have expanded to embrace all of God's creation. He has shown such  concern for…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695407/welcoming-his-all-holiness-bartholomew-i-ecumenical-patriarch-of-constantinople"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…brought to the United States a  deep commitment to culture, education, and service. After arriving in  Rochester, she transitioned from her role as a schoolteacher to become  a prominent voice for the Caribbean American community.\n\nNorma is a founding member of The Rochester West Indian Festival  Organization, a nonprofit that has celebrated and promoted…", "date": "2025-06-13", "source_url": "https://justfacts.votesmart.org/public-statement/1692568/recognizing-norma-thom"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…hospitals that are in danger by the reconciliation bill are  rural hospitals.\n\nIt is not just hospitals that are on the list of potential closure.  Within the last month, a prominent health provider in the Shenandoah  Valley of Virginia--a rural part of our State--announced that they were  closing three primary care clinics in small Virginia communities…", "date": "2025-10-01", "source_url": "https://justfacts.votesmart.org/public-statement/1695967/en-bloc-nominations"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…of 1812.\n\nFormer Maryland Governor Samuel Sprigg purchased the property for his  daughter and nephew William Thomas Carroll, Clerk of the Supreme Court  and member of the prominent Carroll family. William Thomas Carroll  provided President Abraham Lincoln with the Bible that was used for his  first inauguration, which has since become known as the ``Lincoln…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692065/recognizing-the-dacor-bacon-house-bicentennial-day"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…dissolve, making it difficult to determine leadership  structure. Many criminal actors are located overseas, and many of these  offenders are also minors themselves.\n\nThe most prominent example is the online extremist network known as  764. Mr. Speaker, 764 is a decentralized online network that glorifies  violence and encourages participation in criminal…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698880/coercion-and-sexual-abuse-free-environment-act"}, {"senator": "John Rose", "party": "Republican", "sentence": "…first introduced audiences  around the world to country music and to Nashville.\n\nMy home state of Tennessee is known for many things. If you had to  list some of the most prominent, you might think of the Great Smoky  Mountains of Elvis Presley, but you would most certainly include the  Grand Ole Opry.\n\nNashville is known around the world as Music City…", "date": "2025-03-18", "source_url": "https://justfacts.votesmart.org/public-statement/1688915/congratulating-the-grand-ole-opry-on-100-years"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…``The complete destruction of traditional marriage  and the nuclear family is the `revolutionary or utopian' goal of  feminism.''\n\nEventually, Angela Davis, another person prominent in the revolutions  that were taking place in the 1960s, was very antifamily. Even since I  have been in Congress, we had the Black Lives Matter movement, who came  out against…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689133/educating-young-people"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…no longer sufficient. With my bill, the CVF  will also receive, through fiscal year 2029, the unobligated civil  penalties collected through antifraud law.\n\nOne of the most prominent Federal antifraud laws is the False Claims  Act. The False Claims Act allows the Federal Government to sue entities  that defraud government programs and seek up to three…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698841/crime-victims-fund-stabilization-act-of-2025"}, {"senator": "Keith Self", "party": "Republican", "sentence": "…inadequate to the government of any other.''\n\nWe are witnessing the reality of Adams' wisdom in the clash of  cultures as outsiders stream into our country without assimilating. A  prominent Muslim attorney argued in the U.S. court: Islam is sharia;  sharia is Islam. The two cannot be separated.\n\nThere are acceptable actions in sharia that are illegal in America:…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697017/sharia-is-dangerous"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…around the country: ``The  complete destruction of traditional marriage and the nuclear family is  the `revolutionary or utopian' goal of feminism.''\n\nLinda Gordon, another prominent feminist: ``The nuclear family must  be destroyed. . . . Whatever its ultimate meaning, the break-up of  families now is an objectively revolutionary process.''\n\nMichelle…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688328/destruction-of-the-nuclear-family"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…faculty working in crucial and sensitive  research, areas our adversaries have targeted time and time again.\n\nThis is not just an abstract problem. Just in the last 2 years,  prominent research faculty at Harvard, Stanford, the University of  Maryland, and the University of Delaware were found to not have  disclosed foreign funding from Chinese sources,…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689032/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…inches (such as an individually packaged wipe in tear-top       packaging) and sold as part of a combined product, if a       symbol and label notice are placed in a prominent location       reasonably visible to the user of the covered product, such       covered product shall be considered to be labeled clearly and       conspicuously.\n\n(c) Reasonable…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692751/wastewater-infrastructure-pollution-prevention-and-environmental-safety-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…at the age of 77.\n\nFrom 1977 to 2013, he served as the University of Georgia's 21st  president, transforming our State's flagship university into one of the  Nation's most prominent public institutions.\n\nUnder his visionary leadership, enrollment grew from nearly 30,000 to  35,000 students, Federal research expenditures nearly tripled, and the  endowment…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699886/mark-burns-inducted-into-living-legends-of-aviation"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…Congressional District of Nebraska.\n\nBrenda Council has been described as a pure force, a trailblazer, a  fighter, and a leader who has paved the way for so many in Omaha. As a  prominent politician and community leader from North Omaha, she has  established a historic career marked by several firsts for African- American women in Nebraska.\n\nShe was the first…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699725/happy-90th-birthday-to-beth-ragland"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…appropriate congressional committees regarding       the ties between criminal gangs and political and economic       elites in Haiti. The report shall--\n\n(1) identify and list prominent criminal gangs in Haiti as       well as the leaders thereof, and describe their criminal       activities including coercive recruitment, and identify their       primary…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694815/haiti-criminal-collusion-transparency-act-of-2025"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…president-elect of the National Association of Biology Teachers, was  traveling to our Nation's Capital to advocate for the issues that  mattered to her.\n\nBob and Lori Schrock, a prominent and very well-liked couple of  farmers from Kiowa, KS, were on their way to visit their daughter in  college in Pennsylvania.\n\nGrace Maxwell, an engineering student from…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699417/9999"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…Keystone project would       ``immediately vanish.''\n\nAnother 10,000 construction jobs expected to be created by       the project have also been nixed by Biden's decision.\n\nA prominent union leader and Biden ally, AFL-CIO president       Richard Trumka, lashed the decision in Axios on HBO interview       Sunday, saying Biden should have also announced where…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688523/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Dell'Orto for Teacher Appreciation Week\n\nMr. KILEY of California. Mr. Speaker, in the spirit of National  Teacher Appreciation Week, I wish to recognize an outstanding and  prominent educator in California's Third Congressional District. I  would like to highlight, in particular, a teacher from the Roseville  Joint Union High School District, Brandon…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…days, I look ahead to one of the most  important things to accomplish going forward, and that is a  reconciliation piece of legislation. This discussion that has been very  prominent here in the beltway is the talk of reconciliation. To put it  in plain terms, this is just making sure that, at the end of this year,  American families don't pay a significant…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690427/the-first-100-days"}]