[{"senator": "Jack Reed", "party": "Democrat", "sentence": "…cooperation and understanding between Christians, Muslims, and  Jews, he has cosponsored international peace conferences and advocated  for peace-building efforts in order to promote mutual respect and  religious tolerance on a global scale. Sometimes known as the ``Green  Patriarch,'' he has also championed environmental protection efforts,  including…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695453/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…vulnerable amongst us: special needs kids.\n\nOne of the most cruel things I have seen in my time in Congress and  with this administration is the attack on the public servants who  promote and have never had the resources to really protect special  needs kids.\n\nThis President has cut public servants at the Department of  Education. Mr. Speaker, 1,315 workers…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689920/department-of-education"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…colleagues to pass this  straightforward legislation to better manage the land in and around  Ackerson Meadow.                               By Mr. DURBIN:\n\nS. 2889. A bill to promote minimum State requirements for the  prevention and treatment of concussions caused by participation in  school sports, and for other purposes; to the Committee on Health,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695778/by-mr-padilla"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "…of public sector leaders. He founded the Hassenfeld  Child Health Innovation Institute at Brown University to improve family  mental health and created RI For Gun Safety to promote commonsense gun  reform.\n\nPerhaps most notably, he provided the vision and the founding  donation for Hasbro Children's hospital in Providence.\n\nThanks to Alan, Rhode Island…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693984/recognizing-arthur-coia-of-rhode-island"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…under severe fire risk.\n\nIt is why major utilities in California are building their lines with  advanced  conductors and why States across the country are passing new laws to  promote their adoption.\n\nI am proud to actually represent two of the largest manufacturers of  advanced transmission conductors in my district: CTC Global and TS  Conductor. These…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697895/electric-supply-chain-act"}, {"senator": "Valerie Foushee", "party": "Democrat", "sentence": "…innovators, and  the U.S. Government that will enhance existing production methods,  unlock new and innovative techniques, and offer technical assistance to  entities seeking to promote the application of low-emission cement,  concrete, and asphalt.\n\nTogether, the IMPACT Act--alongside IMPACT Act 2.0, introduced in the  House earlier this month by Congressman…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688939/innovative-mitigation-partnerships-for-asphalt-and-concrete-technologies-act"}, {"senator": "John Fetterman", "party": "Democrat", "sentence": "…spiritual authority for nearly 300 million Eastern Orthodox  Christians, he has cosponsored international peace conferences;  convened Christian, Muslim, and Jewish leaders to promote cooperation  and mutual understanding; and advanced the cause of religious freedom  around the world.\n\nEnvironmental stewardship has been a consistent theme of His All  Holiness's…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697378/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…Arab partner. We need to  nurture and maintain it.\n\nWe have deployed military personnel to Jordan to support operations  that defeated ISIS to enhance Jordan's security and to promote regional  stability. Jordan air bases have been particularly important for the  U.S. to conduct intelligence, surveillance, and target acquisition and  reconnaissance missions…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693686/department-of-defense-appropriations-act-2026"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…with a car or a truck, so roads vastly increase the probability  of wildfires rather than reducing them.\n\nThe roadless rule specifically allows for the removal of fuels that  promote unnaturally intense wildfire. This helps to create a healthier  forest and reduce wildfire risk.\n\nThe bottom line is that when we build new roads in protected areas,  we risk…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695667/cloture-motion"}, {"senator": "Joshua Gottheimer", "party": "Democrat", "sentence": "…both the  Democratic Party and American values.\n\nAfter all, socialists aren't Democrats. They are socialists.  Democrats are about common sense, problem-solving ideas that promote  public safety, opportunity for all, and lower costs for all Americans.\n\nI urge all Republicans to work with us on those pressing issues.\n\nAmerica is the land of opportunity.…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697158/denouncing-the-horrors-of-socialism"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…ranking member of the Financial Services  Committee (Ms. Waters), which requires the SEC's Office of Small  Business Advocate to provide educational resources and host events to  promote capital-raising options for small businesses.\n\nHer bill would also require the Small Business Office to coordinate  on an annual basis with State securities commissions to…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692705/promoting-opportunities-for-non-traditional-capital-formation-act"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…hands-on  project-based lessons that teach teamwork, and a wide range of career  and technical education classes. We must invest in, not cut,  educational research, and we need to promote, rather than politicize,  family, parental, and community engagement.\n\nTo fully learn and thrive, students need to have enough food to eat,  and they deserve the best physical…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697292/trump-administration-dismantling-department-of-education"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…Americans who are already  prevented from serving in the military by President Trump. Republicans  must stop injecting partisan politics into the NDAA because these  provisions promote only division and will continue to discourage  Americans from serving our Nation.\n\nFifth, this NDAA authorizes expanded military cooperation between the  United States and…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698005/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Mike Levin", "party": "Democrat", "sentence": "…are struggling to pay their  electricity bills, and according to a recent report in The New York  Times, this bill will make it worse.\n\nThe big, ugly bill ends tax credits to promote clean energy and will  increase household energy costs by up to $415 a year.\n\nOn top of that, ending the tax credits will lead to thousands of job  losses nationwide, in red…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691967/big-ugly-bill-clean-energy-tax-credits"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…new generations of  local musicians.\n\nThis is why I am pleased to support the American Music Tourism Act.  This bill would direct the National Travel and Tourism Office to  promote domestic and international travel and tourism to U.S. venues  like The Stone Pony and the Count Basie Theatre. It will help expand  the already significant economic contributions…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690270/american-music-tourism-act-of-2025"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…debate and discuss and vote on this week  makes targeted investments in the Federal Agencies and Departments that  conduct critical scientific research, bolster economic growth, promote  U.S. energy independence, and strengthen our Nation's national  security. These priorities are achieved while also making thoughtful  reductions in spending to ensure that…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699098/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…more of  the fiscal year 2026 appropriations bills by a strong bipartisan vote.  These bills support State and local law enforcement, invest in vital  scientific research, promote economic development, help protect our  national security, and assist our coastal communities.\n\nThis fiscally responsible package includes the Commerce-Justice- Science bill,…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699144/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…preserving its  ecological health through stewardship, education, and outdoor  recreation.\n\nWhile serving as chairman, Dr. Clark was instrumental in expanding  the park's mission to promote tourism and education. Under his  leadership, the park strengthened partnerships with organizations such  as the University of Georgia, focusing on conservation efforts to…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690751/recognizing-dr-william-clark"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…200-year anniversary of those words that Daniel Webster spoke in  1825 when he said: ``Let us develop the resources of our land, call  forth our powers, build up its institutions, promote all its great  interests, and see whether we also, in our day and generation, may not  perform something worthy to be remembered.''\n\nMr. Speaker, the House Committee on Natural…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689889/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…passed, with bipartisan support,  led by our chairman of the Committee on Financial Services, French  Hill, from the great State of Arkansas, a bill, with a 390-9 vote, to  promote the idea of home affordability, the ultimate American Dream.  Sadly, as we have recognized over the last few years, that dream has  become further and further away for too…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699813/lowering-housing-costs-and-advancing-main-street-community-banks"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…hearts. They  wondered why this had to happen because it wasn't something they saw  when they were children. It happened because our education system and  our popular culture promote this lifestyle.\n\nIt is a good thing if President Trump tries to get this stuff out of  our institutes of public instruction.\n\nI think it is really too bad if people feel it…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689603/diversity-equity-and-inclusion"}, {"senator": "Kat Cammack", "party": "Republican", "sentence": "…administration.\n\nThe Unlocking Our Domestic LNG Potential Act stands as a pivotal  piece of legislation poised to bolster United States energy security,  foster economic growth, and promote environmental sustainability. At  its very core, the bill aims to streamline the regulatory process  surrounding the exportation of LNG, thereby unleashing the full  potential…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697086/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…which you preside is emblazoned the  prayer from Daniel Webster, which reads: ``Let us develop the resources  of our land, call forth its powers, build up its institutions, promote  all its great interests and see whether we also in our day and  generation may not perform something worthy to be remembered.''\n\nYet, for 50 years, the environmental left…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699690/critical-mineral-dominance-act"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…could exploit Taiwan's  financial system by raising tariffs, short-selling stocks, and freezing  bank transfers. Joining the IMF would allow Taiwan to access resources  that promote financial resilience and deter China's economic coercion.\n\nIt has been the longstanding U.S. policy toward Taiwan to support its  membership in international organizations…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692794/taiwan-non-discrimination-act-of-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…always stepping up to help  organize community events, support charitable initiatives, and lend a  hand wherever needed. His volunteerism  has been instrumental in projects that promote economic growth,  cultural enrichment and social well-being in Brooksville. One of  Casey's most notable contributions is his unwavering support for local  charities and nonprofit…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690159/recognizing-casey-thieryung"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…1923, and directed by Congress       in the Naval Petroleum Reserves Act of 1976, specifically for       natural resource development, balanced with conservation, to       promote America's national security through energy resources,       and it is an asset to the State of Alaska. Responsible       development in the NPR-A supports our nation's energy…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "Mrs. BICE. Mr. Speaker, I move to suspend the rules and pass the bill  (H.R. 1234) to direct the Librarian of Congress to promote the more  cost-effective, efficient, and expanded availability of the Annotated  Constitution and pocket-part supplements by replacing the hardbound  versions with digital…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689324/repeal-requirement-for-congressional-research-service-to-prepare-annotated-constitution-and-supplements-in-hardbound-version"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…support the pregnancy centers across  America, including Life Network in my home of Colorado Springs,  Colorado. Pregnancy centers offer hope, and they offer opportunity.  They promote life and give necessary and lifesaving resources to  struggling mothers and fathers. It is these very pregnancy centers  whose only focus is for the enrichment and support…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699216/providing-for-consideration-of-hr-supporting-pregnant-and-parenting-women-and-families-act-providing-for-consideration-of-hr-pregnant-students-rights-act-and-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…Taxpayer Advocate Enhancement Act, introduced by my Committee on Ways  and Means colleagues, Representatives Feenstra and Davis.\n\nThe National Taxpayer Advocate exists to promote and defend the  rights of American taxpayers. In order to achieve these goals, not only  should the advocate be independent from the IRS, but the staff  assisting the advocate…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689378/national-taxpayer-advocate-enhancement-act-of-2025"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…in the pipeline right now for NPR and PBS, two outlets  that routinely spew anti-American and anti-Christian propaganda. They  sow racial division in this country, and they promote weird, woke  values that most Americans find disgusting.\n\nMr. Speaker, this is something that we have talked about for a long  time, and finally, we have a President who is…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692310/ending-taxpayer-funded-propaganda"}]