[{"senator": "Jim McGovern", "party": "Democrat", "sentence": "…I don't have time to  address all the BS coming from my colleagues across the Chamber, but it  is clear this Republican leadership is not only failing to deliver on  their promises but they are selling out at the expense of the basic  needs of the American people.\n\nMr. McGOVERN. Mr. Speaker, I don't think we ought to be lectured by  somebody who, over…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696693/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…will increase bank fees, and it will  impact 23 million households, or roughly 1 in 5 households, that incur  overdraft fees each year.\n\nDespite Trump and Republican campaign promises to lower prices, the  President decided to launch a global trade war just last week that  wiped out a 2-day record of $6.6 trillion of wealth, affecting the  retirement savings…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689845/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…was  included in last year's continuing resolution and ensured Congress is  now committed to covering the full cost of replacing the bridge. The  Baltimore BRIDGE Relief Act promises that Federal taxpayers will be  reimbursed through proceeds from insurance payments and litigation  taken on by the Department of Justice, the Maryland attorney general,…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689022/9999"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…colleagues to join me in recognizing CRi for 50  years of leadership, compassion, and impact. Their history is a  testament to the power of community action, and their future promises  to carry forward the values of choice, respect, and independence for  generations to come.", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696045/9999"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "Ms. WARREN. Mr. President, I rise today to talk about the vote we  just had on the motion to proceed on the GENIUS Act.\n\nDespite promises that the GENIUS Act's fundamental flaws would be  fixed ahead of any vote, we still don't have the new bill text.\n\nNow, many of my colleagues have made clear that they want…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690905/genius-act"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "Ms. BROWN. Mr. Speaker, it has been 100 days of broken promises,  cuts, and chaos from the Trump administration.\n\nThe damage has been done from my district in Cleveland to rural  America.\n\nHere is how Trump has hurt the farm economy in…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690373/first-100-days"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…the floor rather than working on really helping the  American people.\n\nThe only labels we should be talking about today are the lies  stickered across Trump's empty campaign promises. He continues these  misleading claims and lies to the American people, and Democrats are  not going to stand idly by while he loots the U.S. Government for his  own benefit.…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688544/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…the grid--solar energy. They cut it  out in obeisance to the oil industry. It was disgraceful.\n\nThat is what is wrong with this government--the corruption. The oil  industry promises Donald Trump that Harold Hamm will raise him a ton of  money, so Trump cuts out clean energy, and these guys went right along  with it. The cost of groceries is up. Rent is…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698255/nominations"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…getting things done for  the American people. Our bill is the type of bipartisan work that is  needed to tackle the crisis facing Americans. Among meaningless tweets,  empty promises, costly tariffs, and ridiculous policies like the 50- year mortgage, while this affordability crisis rages on, Congress can  act tonight to support Americans who are looking…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699799/housing-for-the-21st-century-act"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…trafficking.\n\nThe administration's answer? Make it harder to investigate them; make  it harder to kick these abusive recruiters out of the H-2A system; and,  against their own promises, let the trafficking continue.\n\nLet's be clear again. The H-2A program is one of the largest sources  of labor trafficking in the United States.\n\nThe safety regulations the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695577/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…them that Congress has a job to do and that we will  not concede the power of the people.\n\nI ask my colleagues, again: Why did you come here?\n\nThey made a lot of campaign promises. Perhaps while you are  campaigning you actually listen to some people. Perhaps what they heard  from people was, we are tired of a government that doesn't deliver to  the…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692932/holding-power-accountable"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…are helping  make America stronger by building goodwill around the world.\n\nThe Trump administration has promised repeatedly that they are going  to restore this program, but promises do not save the lives of starving  kids. Only nutrition can do that.\n\nI will continue to speak on this floor every day until the Trump  administration honors its word and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695636/government-funding-and-healthcare"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…Trump's Achilles heel when it comes to costs  and so much else. He talks about a lot of things that may sound nice,  but he never follows through or delivers on any of his promises.  Whether it is costs or Epstein or ending forever wars, the pattern is  the same. Donald Trump talks about credit cards one day, food prices  the next, housing the day after,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699088/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…of decisions made about their healthcare and  their benefits. They were promised healthcare, and they were promised  benefits. And now this administration is breaking those promises, not  by coming to Congress and asking for a rescission or changing the PACT  Act, which we passed in a bipartisan way, but simply by firing the  people who were supposed…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690353/9999"}, {"senator": "Jacky Rosen", "party": "Democrat", "sentence": "…per capita than any other State.  So this bill would mean immediate financial relief for countless hard- working families.\n\nNo tax on tips was one of President Trump's key promises to the  American people, which he unveiled in my State of Nevada. And I am not  afraid to embrace a good idea wherever it comes from. So I agreed we  need to get this done.…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691423/no-tax-on-tips-act"}, {"senator": "Mary Miller", "party": "Republican", "sentence": "Mrs. MILLER of Illinois. Mr. Speaker, it is a great day in America.  We heard from President Trump last night. Clearly, he loves our  country. He is amped up to fulfill his promises and get things done  that matter to Americans.\n\nThank God for a landslide victory. We can only imagine the dreadful  consequences if Kamala would have been our President.…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688490/president-trump-is-getting-it-done-for-the-american-people"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…the  bills to implement not only the continuation of the current tax  provisions but also the spending cuts that are so important and to help  the President keep his other promises that he made on the campaign  trail. And we are on our way to what President Trump likes to call  ``one, big, beautiful bill.''\n\nWell, a lot of important conversations have…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689668/government-funding"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…political opportunity of a lifetime.\n\nMr. Speaker, I rise today with a simple message to my colleagues:  This is a baby step, but if we don't take it, we are not living up to  our promises. We all ran on fiscal responsibility, so let's be  responsible now and for future rescission packages.\n\nThis is low-hanging fruit in the eyes of America, but it breaks the…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693717/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…delight. But the CCP leaders clearly  had other plans: to unleash policies that continued their rampant  intellectual property theft of American businesses; to never keep their  promises and commitments that they make to Americans; forcing U.S.  companies to hand over proprietary technology in order to gain access  to China's market; aggressively subsidizing…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690106/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…earlier this  week during the Rules Committee hearing that she was one of the first  to raise questions when the SBA lifted the licensing moratorium.\n\nBiden's SBA hid behind promises of lender oversight and stronger  borrower protection yet still awarded a license to an unqualified  entity. This entity, which was seeking to sell its business when it was…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692069/capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…certainty and direction. It allows vital agencies to plan, make  decisions, and do their jobs based on today's realities and not  policies from the past. That is how we move from promises to action and  carry out the America-first agenda mandated by the people.\n\nMr. Chair, those priorities are reflected throughout the measure  before us. Through the Financial…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699054/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Mike Collins", "party": "Republican", "sentence": "Mr. COLLINS. Mr. Speaker, campaign promises made and soon to be  campaign promises kept.\n\nI spent my entire career in the private sector. I know what those  Trump tax policies did for me and for my business, my community,…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693155/one-big-beautiful-bill-act"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…for his leadership.\n\nIt is now time for the Iranian regime to negotiate in good faith,  bring peace to the region, and end the conflict with Israel.                         Promises Made, Promises Kept\n\nMr. JOYCE of Pennsylvania. Mr. Speaker, my colleagues in the U.S.  Senate will vote this week on President Trump's One Big Beautiful Bill  Act, moving…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692792/operation-midnight-hammer-success"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…actions in  Georgia.\n\nHowever, this bill also provides Georgia with an alternative. Once  the President certifies that Georgia has returned to its pro-Western  trajectory, it promises enhanced people-to-people ties, military  cooperation, and encourages an improved bilateral relationship.\n\nThe United States should reward partners for good behavior. This…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690702/mobilizing-and-enhancing-georgias-options-for-building-accountability-resilience-and-independence-act"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…adversaries. We have put veterans first by  expanding access to care and ensuring the benefits that they have  earned. Our country has made that promise to them. We are honoring  promises, Mr. Speaker.\n\nFinally, we have brought transparency and common sense back to our  institutions, dismantling DEI mandates, and restoring fairness, merit,  and basic common…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699278/highlighting-republican-successes-in-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…gives  law enforcement the tools they need to secure our southwest border. It  strengthens energy security. It reduces government spending.\n\nMr. Speaker, it delivers on the promises that we made to American  voters. I strongly support this bill, and I urge a ``yes'' vote.", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693152/one-big-beautiful-bill-act"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…Speaker, I urge my colleagues to support H.J. Res. 106 to  strengthen America's energy and mineral dominance, to strengthen our  economic and national security, and to keep our promises to the people  of Alaska.\n\nMr. BEGICH. Mr. Speaker, fewer than 20 Alaska native Vietnam-era  veterans have received their conveyances. A big part of the reason why  so few…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694897/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "John Rose", "party": "Republican", "sentence": "…for R&D will  accelerate more than $20 billion in investment. I have seen this  firsthand in my own small business that I continue to operate. This  bill is further proof of promises made, promises kept, and I was proud  to support the One Big Beautiful Bill Act.\n\nMr. Speaker, the men and women who put a badge on every morning,  every afternoon, every…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693037/benefits-of-the-one-big-beautiful-bill"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…young people.  Today, that is reversed. Today, we spend $1 on young people and $7 on  those over 65. It is the deal. It is part of our societal commitment.\n\nFine. Keep our promises. The way you keep your promises is to know  your math because, at some point, you have to finance it.\n\nSo, Medicare, Medicare Advantage, Part C, deal with the waste and  fraud…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691811/actual-solutions"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…American people voted to return our Nation to fiscal  sanity with the election of President Trump in November. Now it is time  that we fully deliver on President Trump's agenda.\n\nPromises made, promises kept.                        The Scourge of Deadly Fentanyl\n\nMr. JOYCE of Pennsylvania. Mr. Speaker, I rise today to strongly  support the HALT Fentanyl Act.…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692145/doge-rescissions-package"}]