[{"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…could not meet.\n\nFor example, as you just heard, married women who have changed their  last names could not use their birth certificates with their maiden  names as proof of citizenship. Neither could those born to military  parents stationed abroad.\n\nWhile many of my Republican colleagues may be globetrotting jet- setters, many of my constituents in…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689339/fighting-voter-suppression"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…It  is already illegal for noncitizens to vote in federal elections. Now,  Republicans want to force every American to provide burdensome and  expensive ``documentary proof of citizenship''--similar to what  Minnesotans already rejected--in order to exercise their right to vote.\n\nCongress should be following Minnesota's lead and working to make it  easier…", "date": "2026-02-13", "source_url": "https://justfacts.votesmart.org/public-statement/1700083/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…Alternatively, the SAVE Act would change that by requiring that all  American citizens, whether registering for the first time or updating  their registration, to present proof of citizenship in person, largely  in the form of a passport or a birth certificate. In other words,  government issued driver's licenses and military and Tribal  identifications would…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690528/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…rural voters  would have to travel long distances to try to register to vote.\n\nWe don't have to guess what would happen if this bill were to pass.  In 2011, Kansas had a proof-of-citizenship requirement.\n\nMs. BONAMICI. Mr. Speaker, in Kansas, more than 30,000 U.S. citizens,  12 percent of everyone seeking to register to vote, were barred from  voting.\n\nOther…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690002/safeguard-american-voter-eligibility-act"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "…opposition to the SAVE Act,  which is a transparent attempt to disenfranchise millions of voters.\n\nThe SAVE Act would change voter registration guidelines to require  proof of U.S. citizenship in very narrow ways. However, those  documents, as we have heard, a birth certificate or a passport, are not  always easy to come by for certain Americans.\n\nThis…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690015/safeguard-american-voter-eligibility-act"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…fair, and secure.\n\nUnder the guise of election integrity, the Republicans' H.R. 22 would  require Minnesotans and every American to provide burdensome  ``documentary proof of citizenship''--similar to what Minnesotans  already rejected--in order to participate in federal elections.  Standard REAL IDs, Tribal IDs and military IDs alone do not meet this…", "date": "2025-04-17", "source_url": "https://justfacts.votesmart.org/public-statement/1690125/safeguard-american-voter-eligibility-act"}, {"senator": "Laura Friedman", "party": "Democrat", "sentence": "…tax targeting American women and low- income Americans.\n\nThis bill bans voter ID. It bans using driver's licenses as a voter  ID unless they are backed by additional proof of citizenship, a  requirement that excludes nearly all driver's licenses and REAL IDs  issued today.\n\nFor women who have changed their names, often through marriage, this  means showing…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690000/safeguard-american-voter-eligibility-act"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…between millions of  voters and the ballot box.\n\nAccording to the Brennan Center, more than 9 percent of voting-age  American citizens, 21 million people, don't have proof of citizenship-- typically a birth certificate or a passport--readily available to show  as they try to vote.\n\nAnd 4 million Americans don't have these documents available at all--…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690531/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…movement gave us the right to  vote.\n\nYet, here we are in 2025, and it feels like we are back at square  one. This week, the President signed an executive order requiring proof  of citizenship to vote in Federal elections. He cut off mail-in ballots  unless they arrive on time as he cuts the postal workforce. He says  that you cannot have ballots that don't…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689342/fighting-voter-suppression"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…well. In a Home Depot  parking lot, a Latina--Hispanic woman--gets out of the car and starts  to walk into the store and is stopped by ICE agents who want her to  show proof of her citizenship. That kind of thing is not what we expect  in America but, rather, in authoritarian regimes, which have no respect  for individuals.\n\nThey cannot detain Americans…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699485/department-of-homeland-security"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…will be forced  to drive hours and cross hundreds of miles to present documentary  proof. This includes senior citizens who are particularly likely to  lack documentary proof of citizenship, including passports, copies of  their birth certificates, or other documents.\n\nWhat about the men and women in uniform who serve our country all  over the world?\n\nCan…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690001/safeguard-american-voter-eligibility-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Safeguard American Voter  Eligibility Act, or the SAVE America Act, which builds upon the SAVE  Act introduced in previous Congresses that requires States to obtain  proof of citizenship for Federal elections, ensuring only U.S. citizens  are voting in those elections. In addition, the SAVE America Act  requires individuals to present a valid photo identification…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699943/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…interference.\n\nI have news for my colleagues on the other side of the aisle:  American elections are for Americans.\n\nThe SAVE Act restores this vital principle by requiring proof of  citizenship and identity in the Federal elections that affect every  American. Americans should pay close attention to this vote, for it  will reveal those who would subvert their…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690012/safeguard-american-voter-eligibility-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…boxes with illegal votes.\n\nI am more determined than ever to secure our elections, but in an age  of progressive, suicidal empathy, basic concepts such as voter ID and  proof of citizenship have been attacked as suppression. Let me be  clear: Nothing could be further from the truth.\n\nVoter ID, voter identification, is arguably the single most  commonsense…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699673/united-states-fiscal-situation"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…vaccination just to eat at a  restaurant or pick up food.\n\nWhen it comes to the most sacred act in our Republic, voting, they  fight tooth and nail against requiring proof of citizenship. Why? It is  blatant hypocrisy, and the American people see right through it.\n\nThe SAVE Act ensures that only American citizens can register to vote  and vote in Federal…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689398/supporting-american-elections"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…Republic  relies on free, fair, and secure elections.\n\nThankfully, this legislation bolsters election integrity by requiring  a government photo ID to vote, requiring proof of U.S. citizenship to  register to vote, and directing States to remove noncitizens from  existing voter rolls.\n\nThese are not controversial issues. In fact, leftwing CNN's own  recent…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699940/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Gary Palmer", "party": "Republican", "sentence": "Mr. PALMER. Mr. Speaker, I rise today in support of this rule and the  SAVE America Act. This essential legislation would require, as we have  said previously, proof of citizenship when registering to vote and the  presentation of a valid ID when at the ballot box. Currently, only 13  States do not require any form of voter ID. Having this requirement…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699945/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "John Rose", "party": "Republican", "sentence": "…citizens to  have their votes properly counted without illegal dilution is vital to  determining the rightful winner.\n\nThis legislation is straightforward. It requires proof of citizenship  for voter registration and voter ID for Federal elections. It ensures  only American citizens participate in American elections and provides  States with tools to determine…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700015/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…this resolution it shall be in       order to consider in the House the bill (H.R. 22) to amend       the National Voter Registration Act of 1993 to require proof       of United States citizenship to register an individual to       vote in elections for Federal office, and for other purposes.       All points of order against consideration of the bill…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689405/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "David McCormick", "party": "Republican", "sentence": "…Act. This bill will not fix every issue with our elections, but  it does three critical things.\n\nFirst, it prevents noncitizens from voting by requiring people to  show proof of citizenship when registering to vote and to show a  government-issued photo ID when casting a ballot.\n\nSecond, it directs the States to remove noncitizens from their voter  rolls…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700069/9999"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…enough to  figure out how to get IDs. I can assure my colleagues that we are, even  if we get married.\n\nThe SAVE America Act requires individuals to provide documented proof  of U.S. citizenship along with a valid photo ID when registering to  vote. This commonsense legislation strengthens election integrity  through practical measures, including voter ID…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700005/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…The  people that made up the fake applications never provided any  documentation at all.\n\nThat is insulting to taxpayers.\n\nIn another case, the system never requested proof of citizenship.  That is how we know, for a fact, that ObamaCare subsidies go to illegal  immigrants. They don't ask if you are a citizen. It is easy for  noncitizens to apply.\n\nOh,…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697878/healthcare"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…Americans say we need to do this.\n\nLet me just say that I come from a State that is the most unique  State in the country because we have been, for years, requiring proof  of citizenship when a person registers for a State ballot. We have to  do that in Arizona, and we have had no suppression. We are the only  State that does it because the Supreme…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699942/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…integrity in our country's history. S. 1383, the SAVE America Act, will  require voters to present photo identification to vote in Federal  elections and to provide proof of U.S. citizenship when registering to  vote.\n\nPublic opinion overwhelmingly supports this legislation, and it is  our duty to adhere to the will of the people by swiftly passing this…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699936/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…America Act has two key principles, both of which are common  sense. The individuals who want to vote in U.S. elections should be  U.S. citizens, and we should have a proof of citizenship when  individuals register to vote. The second principle is that individuals  when they vote show voter ID. Both of these are commonsense principles.\n\nWe know there…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700014/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Andy Harris", "party": "Republican", "sentence": "…suggest that anyone who feels that just read the bill. It  says an accommodation has to be made in every State for people whose  name changed from an otherwise valid proof of citizenship such as a  birth certificate.\n\nThe bottom line is that Americans expect that only American citizens,  and not the 12 million illegal aliens who entered under the last…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689429/laws-have-loopholes"}]