[{"senator": "Alex Padilla", "party": "Democrat", "sentence": "…(or a       series of related transactions)--\n\n``(A) the entity completes after May 8, 2014, the direct or       indirect acquisition of--\n\n``(i) substantially all of the properties held directly or       indirectly by a domestic corporation, or\n\n``(ii) substantially all of the assets of, or substantially       all of the properties constituting a trade…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699933/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…incredibly       hard doing that, especially now with so much uncertainty       about our status. Bank financing is very important to my       business. I need loans to purchase properties and to help       finance       the upgrades and repairs I make to those properties. How can       I get a loan to finance one of my development projects when I       don't…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699630/constituent-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…door  to new passenger services for the residents.\n\nI am also grateful for the HUD funding that will allow Gary and  Michigan City to tackle long-neglected vacant and unsafe properties.\n\nThis investment helps local leaders do what they already committed to  doing by clearing blight, stabilizing neighborhoods, and putting land  and buildings back to use.…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699321/consolidated-appropriations-act-2026"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…weather risk, you  can't predict the insurability of a piece of property. The original  concern was about coastal risk--flooding, hurricanes, rainstorms,  damage to coastal properties. Now wildfire is just as dangerous. And  when you can't predict it, you can't insure it.\n\nAnd we are right now, in the United States, in the middle of an  insurance crisis.…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691581/hj-res-88"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…complete collapse, propped up by taxpayers to try to hold it  together. You are seeing a mortgage market that is in disarray as  people find they are unable to sell their properties. And Florida led  the country last year in the decline in property values. It was the top  State in property value decline.\n\nThis is coming at us, and it is coming at us…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698993/unanimous-consent-request-s-res-550"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…capital for the development of major fixed  assets like land, buildings, equipment, and machinery. As part of the  program, loans are guaranteed for so-called special use properties like  amusement parks, car washes, bowling alleys, and gas stations.\n\nWhen the special use designation was created in 1996, Congress  required businesses developing these…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699165/main-street-parity-act"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…affordable housing bills included in this overwhelmingly  bipartisan package.\n\nOne of my bills makes key provisions to the HOME program at HUD to  ease compliance for small properties and to recognize community land  trusts as eligible HOME fund recipients.\n\nThe package also expands foreclosure mitigation counseling to  delinquent borrowers and raises…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699805/housing-for-the-21st-century-act"}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "…operations, and employ Main Street neighbors throughout our community.\n\nUnder the current law, not all small businesses are treated the same.  Owners of so-called small purpose properties are required to put up  significantly more cash up front, often 5 to 10 percent more than  standard property owners. These include places like bowling alleys, car  washes,…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699167/main-street-parity-act"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "…worst impulses of the Trump  administration, like private jets for the Secretary and securing the  President's many multi-million-dollar golfing vacations at his branded  properties.", "date": "2025-05-23", "source_url": "https://justfacts.votesmart.org/public-statement/1691679/one-big-beautiful-bill-act"}, {"senator": "Suzan DelBene", "party": "Democrat", "sentence": "…character.\n\nMayor Holtzclaw has lived in Mill Creek since 2003 and is deeply  engaged in the community he serves. He helped advance the South Town  Center Project and the DRCC properties, which include four city-owned  parcels the city is exploring for a new community campus. He is also an  avid cyclist, a hobby he pursues with energy and enthusiasm. His…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697194/recognizing-mayor-brian-holtzclaw-for-twelve-years-of-leadership-in-mill-creek"}, {"senator": "Chellie Pingree", "party": "Democrat", "sentence": "…Department of Marine Resources,  Pat spearheaded countless initiatives--from restoring passage for sea- run fish species like Atlantic salmon to rebuilding working waterfront  properties after historic storms ravaged our coast. His efforts have  strengthened our environment, commercial fisheries, and coastal  communities.\n\nWhile Commissioner, Pat engaged…", "date": "2026-02-20", "source_url": "https://justfacts.votesmart.org/public-statement/1700092/recognizing-patrick-keliher"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…Reform:\n\n``Due to the town's ZIP Code configuration, Scotland residents face  daily frustration with packages being misdelivered, service providers  being unable to find their properties, and digital ordering or  registration systems refusing to accept their address information. But  the issue goes beyond inconvenience. People have paid taxes to the  wrong…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693853/improving-community-zip-codes"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…be some of the President's personal  friends and campaign donors. This is corruption happening in broad  daylight, right in front of our eyes.\n\nMr. Speaker, these Federal properties belong to the American people,  not to Trump's real estate empire.\n\nMy amendment, which is based on the bill that I will file in the  coming days, is urgent. It stops the…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697854/providing-for-consideration-of-hr-promoting-efficient-review-for-modern-infrastructure-today-act-providing-for-consideration-of-hr-increasing-investor-opportunities-act-providing-for-consideration-of-hr-electric-supply-chain-act-providing-for-consideration-of-hr-state-planning-for-reliability-and-affordability-act-providing-for-consideration-of-hr-improving-interagency-coordination-for-pipeline-reviews-act-providing-for-consideration-of-s-disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-and-for-other-purposes"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…they have huge risks from flooding, sea level  rise, hurricanes, and storms. Their whole insurance market is melting  down. Where else? Out West, where wildfires are making properties  uninsurable.\n\nI tell you what, if you know somebody in Florida, ask them about  their home insurance. Just do that for me. If you know somebody who  lives in Florida, ask…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696122/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…bloc,  highlights the importance of an optimal runtime for the Continuous  Electron Beam Accelerator Facility, or CEBAF. CEBAF is a world-leading  facility studying the inner properties of nuclei, such as the quark and  gluon structure of protons and neutrons. The research conducted at this  facility has vastly improved our understanding of the fundamental…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694942/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…However, if  a small business is seeking financing to build something like a surgery  center or a nursing home, the SBA imposes additional equity  requirements because these properties are deemed limited purpose.\n\nThis initial equity injection was required because limited purpose  properties were believed to be at a higher risk of default. Years of  data…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699166/main-street-parity-act"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…resolution does nothing to weaken the National Historic  Preservation Act. These developers will still be required to take  necessary steps to ensure they do not harm historic properties or  archeological sites.\n\nAs was the case before the Biden rule, BOEM will still have the  authority to require operators to perform these additional surveys and  reports…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688634/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…pay to elevate their  home, successfully preventing flooding; despite that, they are having  to pay much higher insurance premiums.\n\nLet's put up the chart of prices. Two properties. This is before they  elevated their home, after they elevated their home. At first, it  worked. They go from $12,000 a year to $758, from $4,500 to $751. This  is an investment…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691629/risk-rating"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…became the first stations in Alabama to earn the National  Association of Broadcasters Crystal Award for community service. He was  also Managing General Partner for Fuller Properties, LTD and former  host of the Lee County Report.\n\nHe's served as past President of The United Way of Lee County,  Opelika Rotary Club and The Opelika Chamber of Commerce.…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696582/recognizing-the-retirement-of-mayor-gary-fuller"}, {"senator": "Joni Ernst", "party": "Republican", "sentence": "…other government  buildings are completely vacant. Thousands are uninhabited by a single  soul in Washington, DC.\n\nDeserted and left in a state of disrepair for years, many properties  have been condemned to a fate worse than death. One was described as a  ``roach-infested mold dungeon.'' Bugs were spotted crawling out of  faucets and creeping across the…", "date": "2025-10-30", "source_url": "https://justfacts.votesmart.org/public-statement/1696486/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Dave Joyce", "party": "Republican", "sentence": "…Finally, $2.8 billion is provided for the SEC, FTC, FCC, GSA, SBA,  and more than 20 independent agencies.\n\nThis bill will enable the GSA to reduce the number of Federal  properties on the Federal Government's deferred maintenance list. It  provides critical funding for national security, including the Office  of Terrorism and Financial Intelligence…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699055/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…real estate. He worked at  Augusta National Golf Club, Sea Island Company, and Brunswick Country  Club. Joe later became a top producing realtor, specializing in luxury  properties.\n\nA devoted church leader, Joe served as an elder and deacon,  supporting organizations like Manna House of Brunswick and contributing  to community events. He was known…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687985/mourning-the-loss-of-john-reginald-murphy"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…foreign territories. Sec. 213. Modification of treatment of minor construction and                improvement project management. Sec. 214. Preparedness plans for Coast Guard properties located in                tsunami inundation zones. Sec. 215. Additional Pribilof Island transition completion actions. Sec. 216. Scientific mission for USCGC Storis. Sec.…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…projects consisting of new construction,       rehabilitation, or development of residential housing units.\n\n(VII) Buyouts, defined as the voluntary acquisition of       properties located in--\n\n(aa) a floodway;\n\n(bb) a floodplain; or\n\n(cc) an other area, clearly delineated by the grantee, that       has been impacted by a predictable environmental…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…to invade or bomb.\n\nTrump and Kristi Noem have militarized our streets. Masked men in  full military gear roam the streets of our cities. These masked men  invade church properties and schools, knock down doors without  warrants, ram cars, and assault pastors and people of faith. These  masked, armed men have arrested hundreds of citizens just for looking…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698949/providing-for-consideration-of-hr-protecting-prudent-investment-of-retirement-savings-act-providing-for-consideration-of-hr-flexibility-for-workers-education-act-providing-for-consideration-of-hr-empowering-employer-child-and-elder-care-solutions-act-providing-for-consideration-of-hr-tipped-employee-protection-act-and-providing-for-consideration-of-hr-save-local-business-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…origination;\n\n``(6) an analysis of the program risk for loan guarantees       made under this title for loans that were originated for       limited or special purpose properties;\n\n``(7) steps taken by the Administrator to mitigate the       risks identified in paragraphs (1), (2), (3), (4), (5), and       (6);\n\n``(8) the number of development companies,…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699188/504-program-risk-oversight-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…vote on. That is why we end  up having to use what we call these reconciliation budgets.\n\nThe 1974 Budget Control Act allows us to move a bill, if it has  certain fiscal properties to it, through the Senate without having to  get 60 votes. It is all a dance to deal with the 60 votes. If we were  actually a little more honest about math, maybe we wouldn't…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694131/dismantling-californias-citizens-redistricting-commission"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…Tennesseans. I think that one of the reasons is that  people have seen fraud play out in their local communities. They have  seen title theft, where forgers go in and steal properties. Then  someone finds out their property is going to be sold on the courthouse  steps. They all know of contractors who take deposits. They are fly-by- night, and they never…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699102/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}]