[{"senator": "Ilhan Omar", "party": "Democrat", "sentence": "Ms. OMAR. Mr. Speaker, I rise today in recognition of the Minnesota  Assistance Council for Veterans (MACV) for their grand opening of the  newly renovated Robin property. Formerly the Robin Hotel, MACV has  transformed the century-old property into 14 units of safe, stable  housing for Veterans working to rebuild their lives.\n\nI am immensely…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694978/recognizing-the-minnesota-assistance-council-for-veterans"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…members appointed by the D.C. mayor, subject to D.C. Council approval.  Federal officials are members of the Commission even though the  Commission has no authority over federal property.\n\nLand use is a quintessential local matter. Despite the D.C. Home Rule  Act, which gave D.C. authority over local matters, 40 percent of the  members of the Commission are…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692763/introduction-of-the-district-of-columbia-zoning-commission-home-rule-act"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…they would never receive.\n\nWe remember Victor Shaw, who resided in his beloved Altadena home for  60 years and who died with a garden hose in his hand, fighting to save  his property.\n\nThese are just a few of the stories of those we lost, all of whom  were taken far too soon. That is why, today, I have introduced a  resolution with Representative Sherman…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698642/marking-anniversary-of-los-angeles-fire"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…our Constitution is the  right to due process. The Due Process Clause in the Fifth Amendment and  14th Amendment demands that you cannot be deprived of life, liberty, or  property without the due process of law. That means a fair hearing, a  chance to be heard, and a chance to defend yourself in court. That is  the standard.\n\nMr. Speaker, our immigration…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690511/trump-immigration-policies"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…standards--\n\nThis is Richard Nixon--       and strengthen enforcement procedures--and we shall do it       now.\n\nWe can no longer afford to consider air and water common       property, free to be abused by anyone without regard to the       consequences. Instead, we should begin now to treat them as       scarce resources, which we are no more free to contaminate…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691582/hj-res-88"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…better protect both individuals and their communities.\n\nThe results speak for themselves. After Illinois eliminated       cash bail, violent crime dropped by 7 percent and property       crime by 14 percent. New Jersey's reforms led to a 20 percent       reduction in violent crime while maintaining high court       appearance rates. In Harris County,…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696985/opposition-letter-by-the-southern-poverty-law-center-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…the United  States of America began. Yet, 250 years ago, I could not be standing  where I am today. Women did not have the right to vote, to hold public  office, or to own property 250 years ago. Some women were property 250  years ago. Women were a footnote to the story of our country's founding  250 years ago.\n\nToday, 250 years later, women make up…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689165/womens-history-month"}, {"senator": "Nelida Pou", "party": "Democrat", "sentence": "…overflows, stormwater discharges, or flooding risks. Unfortunately, the  amendment was blocked by the House majority.\n\nThese terrible and horrible hazards endanger personal property,  businesses, local economies, critical infrastructure, and, most  importantly, human life and safety. This bill allows irreparable,  preventable damage in our communities,…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698035/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…President says he wants to impose conditions on the aid.  They want to abolish the California Coastal Commission which takes  steps to prevent billionaires with beachfront property to not wall off  the beach and prevent anybody else from getting in the sand. I can see  why Donald Trump would identify with those billionaires. That is the  condition he…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688265/problems-caused-by-doge-cuts"}, {"senator": "Jahana Hayes", "party": "Democrat", "sentence": "…Disabilities Education Act are the children who are the most  vulnerable. In nearly every State, public schools are primarily funded  by State and local governments with local property taxes playing a  crucial role.\n\nWithout IDEA and Federal resources, these students could end up in  underfunded schools that lack resources, expertise, or accountability…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698939/protecting-education-for-children-with-disabilities"}, {"senator": "Sylvia Garcia", "party": "Democrat", "sentence": "…voted: YEA on S.  284--Congressional Award Program Reauthorization Act (Sen. Lummis-- Education and Workforce); and YEA on H.R. 3187--Conveyance of specified  Forest Service property to Perry County, Arkansas (Rep. Hill--Natural  Resources).                             personal explanation\n\nMr. GOLDMAN of New York. Mr. Speaker, I was unable to vote today…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698155/conveyance-of-specified-forest-service-property-to-perry-county-arkansas"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…including surveying, and the conveyance would be executed by quitclaim  deed.\n\nMr. Speaker, I thank the majority for working with us to include  language that guarantees the property is used by the City for the  public in perpetuity. With this important update, the legislation  offers a practical, bipartisan solution to address clear infrastructure  need…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697753/dalles-watershed-development-act"}, {"senator": "Rick Larsen", "party": "Democrat", "sentence": "…manufactured to  American or even United Nations standards and lacked certification  markings.\n\nUsing these unsafe compressed gas cylinders could cause significant  damage to property, physical injury, or even death. PHMSA determined  that the unmarked empty cylinders being sold in the United States on  major commercial websites are primarily manufactured…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692181/compressed-gas-cylinder-safety-and-oversight-improvements-act-of-2025"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…this initiative.\n\nOne of the Coast Guard's primary missions is search and rescue. In  fiscal year 2025 alone, their efforts saved more than 2,200 people and  $40 million in property. To keep up this important work, they need  robust funding and support, which is just what this bill delivers.\n\nWith the administration's aggressive funding and staffing cuts,…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694198/coast-guard-authorization-act-of-2025"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…next  vote, Linda McMahon's nomination for Secretary of Education, they  should remember that a vote for Mrs. McMahon is a vote for draconian  cuts to education and rising property taxes for middle-class and  suburban American families. That is why I am so proud that every  Democrat will vote no to stand up for our schools, for our kids, for  our teachers,…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688393/nomination-of-linda-mcmahon"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…animals--an extraordinary feat  of operational precision and compassion. Despite personal hardships,  including one case manager losing her home while another lost her  rental property, the team prioritized the welfare of the community,  working tirelessly to ensure safety and stability for all. Post-storm,  the team was responsible for helping shelter residents…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691971/recognizing-rebecca-seils"}, {"senator": "French Hill", "party": "Republican", "sentence": "…following       persons meet the criteria for sanctions described under       subsection (a) or under Executive Order 14014 (86 Fed. Reg.       9429; relating to blocking property with respect to the       situation in Burma):\n\n``(A) Any Burmese state-owned enterprise described in       subsection (c)(1).\n\n``(B) Myanma Economic Bank.\n\n``(C) Any foreign…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699831/bringing-real-accountability-via-enforcement-in-burma-act"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…prohibited any Federal agency from issuing or advancing a CBDC without  direct congressional authorization.\n\nIn a free society, Mr. Speaker, financial privacy and private  property rights must be protected. The American economy thrives on  choice, competition, and liberty, not on coercion and control.\n\nMr. Speaker, I urge all Members to support this…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693734/anti-cbdc-surveillance-state-act"}, {"senator": "Darrell Issa", "party": "Republican", "sentence": "…fact, Mr. Speaker, they do it in civil cases. They do  it all over the place. Lawyers are very good at it, but as the chairman  of the Subcommittee on the Courts, Intellectual Property, Artificial  Intelligence, and  the Internet and with the ranking member of the full committee here  today, it is our obligation to fine-tune the law so that, in fact,  these…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689711/no-rogue-rulings-act-of-2025"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…Project Defined.--In this section, the term       ``homeporting project''--\n\n(1) means the facility infrastructure modifications,       upgrades, new construction, and real property and land       acquisition associated with homeporting new or modified       cutters; and\n\n(2) includes shoreside and waterfront facilities, cutter       maintenance facilities,…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…service associated with the covered services that may be       selected by a purchaser of covered services.\n\n(9) Short-term rental.--The term ``short-term rental''       means a property, including a single-family dwelling or a       unit in a condominium, cooperative, or time-share, that       provides covered services (either with respect to the entire…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690200/hotel-fees-transparency-act-of-2025"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…clause (ii) and inserting ``, or'' and       by inserting after clause (ii) the following new clause:\n\n``(iii) the entire amount received (including money and any       other property) is paid in a direct trustee-to-trustee       transfer to a designated Roth account (within the meaning of       section 402A)--\n\n``(I) from an eligible Roth IRA, or\n\n``(II)…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697537/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…for championing this bill in the Senate.\n\nMr. Speaker, I urge my colleagues to join me in supporting H.R.\n\nMr. Speaker, H.R. 2876 resolves an unnecessary cloud over this  property by confirming the valid use of the University of Utah's prized  Research Park, which has served the public for decades.\n\nThis commonsense bill will allow the park to keep…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698135/university-of-utah-research-park-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Jesse Zhu.  After running various state-connected companies in China, Zhu moved to  Canada where he set up dozens of corporations to steal valuable  American intellectual property and unlawfully transfer it to China. The  Supreme Court of British Columbia found that he committed fraud on an  epic scale, resulting in a $330 million judgment.\n\nHe then…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699473/illegal-bio-lab-in-las-vegas"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…to respond to requests for documents, reports, and  many other types of information. The presumption under this law is that  government actions, rules, and work is public property. Putting this  information in public hands helps us hold our government accountable.  The Freedom of Information Act is one of the strongest tools we have to  ensure that…", "date": "2025-03-12", "source_url": "https://justfacts.votesmart.org/public-statement/1688777/sunshine-week"}, {"senator": "Mike Crapo", "party": "Republican", "sentence": "…agreements are respected.\n\nThe last administration not only refused to negotiate new trade  agreements but undermined U.S. rights under them when it waived our  intellectual property rights under the WTO TRIPS Agreement and without  informing Congress, attempting to remove the rights of American  investors under the USMCA.\n\nSecond, I also agree that we…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688256/unanimous-consent-request-s-348"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…Pike's  Landing cemented itself as a landmark in the Fairbanks community.\n\nWhen Jay purchased Pike's Landing in 2000, he found himself wondering  about the history of the property and the man who established the  landmark location of Pike's. The original owner had sort of disappeared  from history. So Jay asked around, collecting oral histories from…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690106/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…advance, but it still bears the  scars of over 100 years ago of the incredible fire and massacre that  happened there.\n\nWhat we did today with unanimous consent didn't change the property  rights of any person in Tulsa or in Oklahoma. It didn't add eminent  domain. It didn't change codes. It didn't give the Federal Government  control of any square inch of…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691673/historic-greenwood-district-black-wall-street-national-monument-establishment-act"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…companies, which take 20 percent of that for  profit and overhead.\n\nNow, I am not knocking insurance companies. We all have insurance for  our cars, for flood insurance, for property and casualty, et cetera. I  am just pointing out that they do take 20 percent of what we give them  for profit and overhead.\n\nBy giving the money to the insurance companies,…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697554/healthcare"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…defines the role of the SEC  and CFTC, establishes clear rules of the road for responsible  innovation, and protects the rights of Americans to hold and use their  own digital property.\n\nAt the same time, the Anti-CBDC Surveillance State Act, which I  cosponsor, defends the foundational principles of financial freedom. A  government-run central bank digital…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693545/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}]