[{"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…263,000 households that receive food  stamps.\n\nThis bill would put their lives and health in danger, Madam Chair.  This is about life and death.\n\nAs the Republican majority proposes to cut Medicaid across this  country to give a massive $4.5 trillion, with a capital T, trillion- dollar cut in taxes to the very rich, who would that go to? Fifty  percent…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688045/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…in our State. Let me remind  you, this is a State of 32 million people. Half of the children in our  State rely on Medicaid, one out of every two kids in Texas.\n\nWhen Trump proposes gutting it, he is not just slashing spending, he  is taking away critical healthcare from children, from seniors in  nursing homes, and people with disabilities who depend…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689782/defending-social-services-and-programs"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Public Health Service Act (PHSA), of which the Energy and       Commerce Committee has sole jurisdiction. Yet, contrary to       the statute, the HHS FY 2026 Budget in Brief proposes to       eliminate SAMHSA and move some of its functions to a new       Administration for a Healthy America (AHA). If this becomes       reality, there will no longer be…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692341/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…Unfortunately, the Trump administration has failed to see the  importance of this Federal investment in science for our country's  future.\n\nThe President's fiscal year 2026 budget proposes cutting the NSF  budget by 55 percent, including fundamental research, education, and  broadening participation efforts.\n\nOther agencies have been impacted by the funding…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691390/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…yield big details that  could further our understanding of what is happening and by whom in  sanctions evasion and money laundering investigations.\n\nWe need what this bill proposes because as the global anti-money  laundering and countering the financing of terrorism regime has become  increasingly effective in detecting and deterring the abuse of the…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693941/ofac-licensure-for-investigators-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Police oversight is       crucial to preventing and holding officers accountable for       misconduct against the very people they have sworn to       protect.\n\nH.R. 5214 proposes drastic, harmful changes to D.C.'s       pretrial laws, which ensure that pretrial release decisions       are based on assessments of true risk, rather than wealth. It…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696914/letter-led-by-the-leadership-conference-on-civil-and-human-rights-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…Unfortunately, in its fiscal year '26 budget request, the  administration proposed to virtually eliminate funding for clean water- related infrastructure projects, but it also proposes to cut the  Technical Assistance for Treatment Works Grant Program by over 60  percent.\n\nThese cuts ignore the water infrastructure needs of our most  vulnerable communities,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695403/water-resources-technical-assistance-review-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…but obstruction, opposition, resistance, evasion,  distraction, and diversion from the other side, and now we get one more  resolution like this.\n\nThe resolution actually proposes a disciplinary censure against  Representative Stacey Plaskett but, amazingly, alleges no misconduct.  It does not allege a violation of the Constitution. It does not allege…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696885/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…they need to make sacrifices to pad their profit  margins even further. How does that make any sense?\n\nTo pay for these tax cuts for the ultrawealthy, the Republican budget  proposes to cut programs Americans rely on to afford healthcare and to  put food on the table.\n\nAlmost 100 million Americans, including seniors, children, families,  and those from…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688065/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…species, making  coordinated, science-based efforts more critical than ever.\n\nTo address these pressing challenges, our Hawaii Native Species  Conservation and Recovery Act proposes a competitive grant program to  support the conservation and recovery of these species. This grant  program will provide vital funding to local organizations, government…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688377/the-hawaii-native-species-conservation-and-recovery-act"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…As another example of moving programs out of the Department of  Education as part of the dismantling of the Department--I could not  resist this example--President Trump proposes to move the student loan  portfolio to the Small Business Administration, which has neither the  capacity nor the expertise needed to handle this massive program. The  SBA…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697008/9999"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…actively  dismantling our ability to respond to the opioid crisis moving forward.\n\nThe administration recently sent over more details about Trump's  ``skinny'' budget, which proposes very large cuts to health programs  that American families rely on. These include eliminating programs of  regional and national significance at the Substance Abuse and Mental…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691944/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…Congressional Hispanic Caucus to call out the partisan Republican  budget resolution that passed last night for what it is. It is a rip- off of the American people. Their budget proposes reckless spending to  support billionaires and make everyday Americans foot the bill.\n\nIt cuts over $1 trillion, including $880 billion from Medicaid, in  order to partially…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688133/republican-budget-betrayal"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…cosponsored by my colleagues  Representative McClain and Representative Sherman.\n\nThis bill supports Taiwan in combating Chinese provocations against  Taiwan. This bipartisan bill proposes to restrict top officials in  China from having significant transactions or engagement at American  financial institutions and aims to expose hidden funds of Chinese  officials…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693875/taiwan-conflict-deterrence-act-of-2025"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…researchers working on a cure for a disease that will affect  someone in your family? It is quite possible.\n\nOn Friday, the President released a preview of his budget, which  proposes to slash NIH's medical research budget nearly in half, wiping  out all the gains we have made in the last 10 years. That is  heartbreaking. These actions are devastating to…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690656/national-institutes-of-health"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…(FLPMA) planning requirement. BLM       acknowledges this in the proposed rule but goes onto to say       that it ``nonetheless'' intends to do so. In another example,       BLM proposes to change the authority of officers making oil       and gas related decisions from what currently must be       exercised consistent with current law and after consultation…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…resolution.\n\nThere are several Iranian groups fighting the Iranian dictatorship,  and it will ultimately be up to the people of Iran to chart their own  future, as the 10-point plan proposes.\n\nOne cause should unite us all, and that is the collapse of the  current regime. To this end, we have organized the Iran Human Rights  and Democracy Caucus within the House…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691210/supporting-a-free-democratic-and-secular-iran"}, {"senator": "French Hill", "party": "Republican", "sentence": "…entrepreneurial immigrant families or Korean families  with the beautiful bodegas and flower shops around the city. They are  now somehow doing an inadequate job. The mayor proposes that the  government step into those businesses or run those grocery stores, for  example.\n\nMr. Speaker, he proposes even more difficult rent controls that have  already driven…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697143/denouncing-the-horrors-of-socialism"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…the  countless criminal investigations left unsolved because there aren't  enough FBI agents.\n\nMr. Speaker, when you cut funding for the FBI, as Republican  President Trump proposes in his budget, you are not cutting duplicative  funding. You are cutting essential investigative services. It is a  guarantee that crimes will go unsolved.\n\nThe partnership…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691169/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "…proposing to create a new restricted area over this airspace  which would restrict the public's access to that effectively full time,  despite the fact that the Marine Corps only proposes to make use of  this airspace 60 or fewer days every year. That is less than 20 percent  of the time, Mr. Speaker.\n\nThe problem with this is it is going to have a devastating…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695111/providing-for-consideration-of-hr-streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-and-providing-for-consideration-of-hr-stop-illegal-entry-act-of-2025"}]