[{"senator": "Jack Reed", "party": "Democrat", "sentence": "…consumers. These tariffs are part of the President's effort to  use trade policies to benefit his friends and himself at the expense of  American families.\n\nHe has used trade to prop up Argentina's President before a key  election because that country's President has said nice things about  President Trump, hardly the basis for a fundamental economic decision…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696448/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Chellie Pingree", "party": "Democrat", "sentence": "…about  whether this is a renovation at all or something far more drastic.\n\nLet's take a step back. The Kennedy Center is not a private real  estate project. It is not a campaign prop. It is not a vanity  playground for demolition. It is a national cultural institution,  created by Congress in 1958, and later dedicated to President John F.  Kennedy after…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699704/changes-at-the-kennedy-center"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…asked why I don't join moments of silence that  include Republicans for gun violence, and the reason why is because  they refuse to do anything about it. I am not going to be a prop in  some social media video that is posted later to placate constituents  about ending gun violence. I am going to continue to honor them with  action, not just with thoughts…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692458/pulse-shooting-anniversary"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…alone had over $400 million in funding canceled.\n\nAre the Republicans stopping there? No way. They have derailed  management of our public lands, and now they want to do it to prop up  coal. Oregonians see this for what it is--a gobsmacking attempt to hurt  American families just to score points with campaign folks they have  been close to.\n\nNow, the United…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696128/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…American families, Republicans  are bringing a bill to the floor that does absolutely nothing to lower  prices. Instead, Republicans are using this affordability crisis to  prop up junk health insurance plans that discriminate against people  and leave them hanging when they get sick.\n\nMr. Speaker, the American people are desperate for our help, and…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698391/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…the right thing to do for  the American people. That means no more forever wars, no more military  escapades without congressional authorization, no more tens of billions  to prop up foreign regimes while American families struggle right here  at home.\n\nI want to thank Senator Kaine, I want to thank Senator Schiff, and I  want to thank Senator Paul for…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699088/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…moves.\n\nLess than a week later, my son, Jackson, showed up at school to find  out one of his classmates was dead. He had killed himself accidentally  using a loaded gun as a prop to film a music video. My son was  devastated.\n\nHe was devastated again when 2 months later the school year abruptly  came to an end when Shawn Jackson was shot and killed minutes…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691754/national-gun-violence-awareness-month"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…all-black hair  because that was back in 2002. I was a new Member of Congress, trying  to work together with diplomacy from the very beginning.\n\nMr. Speaker, I didn't come here with prop photos because I am here to  debate substance. I am here to find out why the President of the United  States pardoned convicted drug dealers. I have not gotten an answer to…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698456/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…colleagues' big, ugly bill will cost American taxpayers $3.4 trillion.\n\nThis resolution is the latest attack from my Republican colleagues to  undercut our public lands, to prop up fossil fuel polluters, and the  expensive energy sources that they peddle and leave people out of the  decisionmaking process, all while driving up energy prices for the…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696832/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "…and Medicaid to make ends meet. Even with assistance, he lives on $120  a month. That is $30 a week.\n\nIt is not fear-mongering to say that Republicans' plans would hurt Al  to prop up billionaires.\n\nI will be voting ``no'' for the middle class, for families, for  seniors, and for folks like Al.", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689908/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…we just going to throw that all away?\n\nMr. Speaker, I strongly oppose H.J. Res. 130, which would repeal the  current balanced RMP for BLM's Buffalo Field Office in order to prop up  the coal industry in Wyoming's Powder River Valley. The plan targeted  by this resolution ended new coal leasing in the region because of its  harm to the climate and public…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696881/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Nathaniel Moran", "party": "Republican", "sentence": "…the bill  for a broken system that lacks proper guardrails and has been grossly  mismanaged. The ACA is just another example of this, and we should not  spend more money to prop up a failing program, certainly not a COVID- era, temporary program that they put in place and they, the Democrats,  set to expire this year.\n\nWaste, fraud, and abuse in this…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698806/breaking-the-gridlock-act"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…sports are a highly publicly subsidized  enterprise. It runs on Federal exemptions, tuition subsidies, land  grants, student fees, and State dollars. Yet, as public dollars prop up  the system, the money is ballooning and concentrating.\n\nAccording to a 2023 report from the Knight Commission, annual  revenues across all FBS athletic programs are expected…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691270/preventing-iran-from-obtaining-nuclear-weapons"}, {"senator": "Andy Ogles", "party": "Republican", "sentence": "…colleges and universities more than the  People's Republic of China. They use this all-access pass to steal our  intellectual property, abuse our student visa programs, and prop up  Communist-inspired Confucius Institutes.\n\nThis places the Chinese authorities in a real position of influence  among our young people, all the more so because our own government…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689026/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…Americans' hard-earned tax dollars are being used to  support these programs and organizations under the guise of necessary  foreign aid.\n\nIn addition to this, Congress continues to prop up the Corporation  for Public Broadcasting to promote public media stations like PBS and  NPR. Taxpayer dollars should not be used to promote a narrative that  demonizes one…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692496/rescissions-package-is-first-step"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…believe that we can defeat Newsom's effort  to defraud and disenfranchise California voters. The reason I believe  that is because we just did so last year.\n\nWhat happened with Prop 36, which is the initiative to make crime  illegal  again in California, is a perfect case study into how the Governor of  California has tried to undermine democracy in order…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…honest discussion of how do we get  the incentives lined up.\n\nI saw what Senator Grassley published yesterday--and I was going to  bring the report out here and use it as a prop and show it to you, but  it is like this. It basically talks about hundreds and hundreds and  hundreds of billions of dollars.\n\nLook, the report, I am only a third through it,…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699000/growing-the-gdp"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…rules and work requirements,  combined with lowering that abusive Federal match rate subsidizing blue  States to game the system when they are using Federal borrowed money to  prop up their weak State budget? Why wouldn't we fix that?\n\nI don't have a single constituent I know who thinks we ought to  continue doing that. Even more so, my colleagues are…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690594/fiscal-responsibility"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…superglued themselves to their temporary COVID  subsidies that they themselves concocted and stamped an end date on, as  my colleague has said.\n\nI suppose all they know how to do is prop up a failed program that is  littered with waste, fraud, and abuse, like cancerous lesions.\n\nDon't take my word for it. Just look at the GAO report: Its estimates  show millions…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698305/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…up their streets, and we are starting to  actually see the situation improve.\n\nNumber Four, when it comes to crime, we had an enormous victory last  November when it came to Prop 36, an initiative that I helped to lead  and qualify for the ballot that has made crime illegal again in  California by restoring some basic consequences for theft and open…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…coming about threatening force in  the future to have a transition to make Venezuela free and fair and if  you don't like taking the assets of the country and selling them to  prop up a failing economy, then limit the President's ability to do  that by denying funding for those operations. That would be lawful.\n\nThe War Powers Act, in my view, is unconstitutional…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698616/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…conflict to take Taiwan any day,  week, or month in the future.\n\nSo why in the world would we engage in willful blindness, not knowing  what American investors are doing to help prop up the Chinese economy  and the Chinese military?\n\nFailure to address outbound investment transparency is to pretend  that national security doesn't matter. And we don't have…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697200/senate-agenda"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…less.                                Proposition 50\n\nMr. KILEY of California. Mr. Speaker, this is the first opportunity I  have had to address the House since the passage of Prop 50 in  California to re-gerrymander our State and to return us to the era of  political gerrymandering.\n\nOf course, I was against the proposition because I am against  gerrymandering…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697101/highlighting-the-state-of-california"}]