[{"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…messed with and  asked them to do something they felt were unethical, and as a result,  all of the prosecutors that were heading up the righteous fraud  investigations and prosecutions are no longer in that office.\n\nSo you tell me how these actions have made our State more safe. It is  the opposite: School attendance down; families living in fear; people…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700059/9999"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…without the tools needed to respond effectively. Our  bill would require the Attorney General to submit an annual report to  Congress on gang activity investigations and prosecutions.\n\nWhile recent FBI data show violent crime trending downward, we know  progress does not mean the work is all done. This legislation  strengthens public safety, supports…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698650/reporting-gang-activity"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…and the Attorney General for the       District. The judges on the DC Court of Appeals and DC       Superior Court rule on inherently local matters such as       criminal prosecutions, landlord-tenant cases, probate       proceedings, civil cases, and divorce proceedings, all of       which have profoundly important impact on our community. For…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695596/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "André Carson", "party": "Democrat", "sentence": "…timely resolution also holds accountable all state security forces  that perpetrate atrocities against the civilian population by  conducting transparent investigations and prosecutions and taking all  additional necessary measures to prevent further atrocities continue  progress toward the disarmament, demobilization, reintegration,  reparation, and resettlement…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699456/reintroduction-of-the-resolution-to-condemn-the-ethnic-violence-in-the-democratic-republic-of-the-congo"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…Only a small percentage of Palestinian children in the military  courts are released on bail. Custodial pre-trial--and often pre- charge--detention is the norm. Almost all prosecutions of children in  military courts are resolved with plea agreements, which are the  fastest way for a Palestinian child to be released from detention.  Entering a not guilty…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697313/palestine"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…and the Attorney General for the       District. The judges on the DC Court of Appeals and DC       Superior Court rule on inherently local matters such as       criminal prosecutions, landlord-tenant cases, probate       proceedings, civil cases, and divorce proceedings, all of       which have profoundly important impact on our community. For…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695614/district-of-columbia-judicial-nominations-reform-act"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…for office, to deal with the costs of living, the  costs to live. What we see is a short attention span focusing on  sending troops into American cities and on political prosecutions and  on the firing of career prosecutors in Virginia and all kinds of  distractions. And the thing he promised the American public he would  do--bring down costs--he is…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696123/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…border of Canada, as if it is coming across in a cluster  like it is an emergency, is just an out-and-out lie.\n\nThe fact of the matter is that if you look at the Federal  prosecutions--this just came out not too long ago--for narcotics in the  United States of America, it just came out that, under the Trump  administration, Federal drug prosecutions fell…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699971/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…and the Attorney General for the       District. The judges on the DC Court of Appeals and DC       Superior Court rule on inherently local matters such as       criminal prosecutions, landlord-tenant cases, probate       proceedings, civil cases, and divorce proceedings, all of       which have profoundly important impact on our community. For…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696933/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…and the Attorney General for the       District. The judges on the DC Court of Appeals and DC       Superior Court rule on inherently local matters such as       criminal prosecutions, landlord-tenant cases, probate       proceedings, civil cases, and divorce proceedings, all of       which have profoundly important impact on our community. For…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695641/district-of-columbia-policing-protection-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…disclosure be immediate, as this legislation would  require.\n\nThat Deputy Attorney General also happens to be the President's  personal lawyer, or he was in all his criminal prosecutions. That is  unprecedented as well.\n\nThe American people deserve an end to this stonewalling and stalling.    2557; further, that the bill be considered read a third time and…", "date": "2025-08-02", "source_url": "https://justfacts.votesmart.org/public-statement/1694635/9999"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…criminal offenses. Thanks to this bill, we will know the  specific elements of each offense, the potential criminal penalties,  the mens rea requirement, and the number of prosecutions that have  taken place each year for the preceding 15 years for every listed  offense.\n\nNow, what is the danger of having too many criminal offenses? Some  people might…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697205/count-the-crimes-to-cut-act"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…accountability? Are we going to call to account the rich and powerful  people who broke the law or cavorted with a pedophile, a convicted  pedophile?\n\nAre we going to have prosecutions for billionaires who went to this  island and either raped underage girls or saw underage girls being  raped and didn't say anything? Are we going to have investigations?…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699892/decoding-epstein-files"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "…enforcement is not the answer. I don't know why my  colleagues are having such a hard time with this.\n\nThe first Trump administration actually tried to weaponize unlawful  entry prosecutions by separating over 5,000 children from their  parents. The entire country--Republican, Independent, and Democrat--was  horrified at this, and the administration, ultimately,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695359/stop-illegal-entry-act-of-2025"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…because of crimes  they had nothing to do with is just plain wrong and inhumane.\n\nThe Trump administration has tried to politicize this fraud  investigation, but the first prosecutions for this fraud began in 2022  during the previous Biden administration.\n\nThe administration says their immigration policies are intended to  protect America. I am calling…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699112/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Nicole Malliotakis", "party": "Republican", "sentence": "…be done. We still need the DOJ  and our law enforcement partners to continue their investigations to  find and prosecute these fraudsters. We are hearing of arrests and  prosecutions on a regular basis, but we urge them to continue their  good work.\n\nThis is an essential first step in addressing the increasing  frequency of mail theft. I am encouraged…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689293/recovery-of-stolen-checks-act"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…heinous individuals are  prosecuted.\n\nThe conduct of groups such as the 764 network do not always fit  neatly into existing criminal statutes, which potentially jeopardizes  prosecutions.\n\nThe Coercion and Sexual Abuse Free Environment Act, CSAFE,  criminalizes compelling or enticing a minor to engage in self-harm,  engage in animal crushing, or to commit…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698880/coercion-and-sexual-abuse-free-environment-act"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…attention to what he is doing because, in  addition to a steady stream of late-night rants on social media, we  have seen actions--actions--by Federal Agencies: investigations,  prosecutions, persecution, labeling protesters as domestic terrorists,  reclassifying dissent as something punishable by law.\n\nIn an event just last week, our President spoke at the…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699917/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…Crimes to Cut Act forces the DOJ to produce a complete  list of every Federal criminal statute with the specific legal  elements, the authorized penalties, and the number of prosecutions for  each offense over the last 15 years.\n\nRight now, we literally cannot tell the American people how many  Federal crimes exist. I called the Congressional Research Service…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697204/count-the-crimes-to-cut-act"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…including the Federal Bureau of       Investigation and United States Attorneys' Offices, that       relate to:\n\n(1) Jeffrey Epstein including all investigations,       prosecutions, or custodial matters.\n\n(2) Ghislaine Maxwell.\n\n(3) Flight logs or travel records, including but not       limited to manifests, itineraries, pilot records, and customs…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696818/epstein-files-transparency-act"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…these victims.\n\nThis fund does not use taxpayer dollars. It is solely financed by the  fines, settlements, and other monetary penalties collected from Federal  criminal prosecutions. From 2017 to 2023, the balance of CVF dropped by  over 92 percent. It was almost completely wiped out.\n\nCongress attempted to correct this decline in 2021 with the  bipartisan…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698841/crime-victims-fund-stabilization-act-of-2025"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…the Federal  Reserve is the pot calling the kettle black. We can't come here and  talk appropriately about the Arctic Frost investigation, we can't talk  about the various prosecutions under the Obama era and the Biden era as  being bad if we actually condone what I believe, in many cases, are the  same sorts of behavior today.\n\nI am a Republican. I voted…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700062/9999"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Massachusetts tries to dismiss the supposed trivial or anecdotal or  cherry-picked cases, there are so many that it would take me more time  than I have to read through them all of prosecutions for voter fraud  and individual instances of voter fraud.\n\nWe have one here of Angelica Maria Francesco in Alabama in 2024, an  illegal alien charged by Federal authorities…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699943/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…(2) for each criminal statutory offense listed under       paragraph (1)--\n\n(A) the potential criminal penalty for the criminal       statutory offense;\n\n(B) the number of prosecutions for the criminal statutory       offense brought by the Department of Justice each year for       the 15-year period preceding the date of enactment of this       Act; and…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697203/count-the-crimes-to-cut-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…okay, here is the best  projection. Remember, some of this fraud may have happened over a  decade. We are still getting all the numbers. There have already been a  number of prosecutions, ``Minneapolis woman pleads guilty in $250  million Feeding Our Future fraud scheme.'' She stole $250 million.  There are a number of these articles that I have here, but…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698698/congress-is-a-math-free-zone"}]