[{"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…outside of the United States. That means the global  middle class includes almost 4 billion people. Those are markets for  American businesses, for farmers to reach to grow and prosper.\n\nAccording to the World Bank, in the recent decade, trade has lifted 1  billion people out of poverty. My colleagues here, who have worked on  deals in the past that opened…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689549/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…for it. It provides  healthcare coverage, for example, for 17 million women of reproductive  age so they can have the healthcare they need. And it helps families  grow and prosper. And by making seniors and people with disabilities  get the care they need, we are, I think, living up to the aspirations  of this country, which is to ensure that those…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689546/h-con-res-14"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…also a necessary step to ensure the  development of African economies and generate greater prosperity  through stability in Somalia. No country can be expected to grow and  prosper while facing serious piracy threats. We cannot allow violent  criminals and terrorists to continue stunting the economic development  of Somalia and the surrounding region.…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692721/sanction-sea-pirates-act-of-2025"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "Mr. CASE. Mr. Speaker, I rise today in support of my Promoting  Regional Opportunities for Sustainable Prosperity and Economic  Resilience in the Pacific Act, or PROSPER in the Pacific Act, to  advance the U.S.-Pacific Islands relationship to include an economic  partnership built on shared values and principles.\n\nThe Pacific Islands, spread…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697950/supporting-the-prosper-in-the-pacific-act"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…stable water supply are not mutually exclusive. They can be  done in a way where both delta communities and delta species, and,  indeed, the entire West Coast and the country, prosper from protecting  this endangered species.", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690598/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…includes at least three elements: Iran does not  develop a nuclear weapon; second, Iran stops funding militias across  the region; and, third, Iran's economy is freed up to prosper. Those  are the three elements that need to be addressed.\n\nLet me begin, first, by addressing in some greater detail Congress's  need to reassert its constitutional authority.…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693126/motion-to-discharge-sj-res-59"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…community a legacy that promotes civic engagement at the       local, state, and national levels of government. It is my       greatest hope that the APAPA-SOC Chapter continues to prosper       in the years ahead. I look forward to seeing APAPA-SOC       interns grow into tomorrow's leaders of California and       beyond.\n\nThe APAPA-SOC's 10th Anniversary and…", "date": "2025-07-25", "source_url": "https://justfacts.votesmart.org/public-statement/1694253/congratulating-the-asian-pacific-islander-american-public-affairs-solano-county-chapter-ahead-of-their-10th-anniversary"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…have much; it  is whether we provide enough for those who have too little.''\n\nIt is our intention to create a level playing field upon which every  American can advance and prosper. Republicans are doing neither of  these. Worse yet, the majority will provide nothing for those who have  little and give everything to those who already have so very, very…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688233/democratic-proposals"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…outside of the United States. That means the global  middle class includes almost 4 billion people. Those are markets for  American businesses, for farmers to reach to grow and prosper.\n\nAccording to the World Bank, in the recent decade, trade has lifted 1  billion people out of poverty. My colleagues here, who have worked on  deals in the past that opened…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689522/klobuchar-ms-murkowski-mr-warner-mr-mcconnell-and-mr2024"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…people by passing the One Big Beautiful  Bill Act.\n\nUnder President Trump, our economy is booming, thanks to progrowth  policies that help workers, students, and taxpayers prosper. By passing  this bill, we have a chance to seize on a generational opportunity to  help put more Americans back on the path to the American Dream.", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693154/one-big-beautiful-bill-act"}, {"senator": "Ryan Mackenzie", "party": "Republican", "sentence": "…in order to enforce their policy of  maximum pressure. In order to achieve peace and stability in the  region, we have to remind Tehran that they will not be able to grow,  prosper, or effectively do business until they end their nuclear  ambitions and stop supporting terrorism. Today's legislation achieves  that by empowering our administration during…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690689/solidify-iran-sanctions-act-of-2025"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…private sectors, in China and the United States, work together, and if  we do that, ``Americans, working in partnership with benevolent Chinese  capital and technology, will prosper just like the Chinese benefited  from American capital and technology in the last four decades.''\n\nAnd Tom Friedman has the nerve to call President Trump's thinking  ``magical.''…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690106/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…never forget to thank  those who make that sacrifice.\n\nI thank him; his wife, Tawny; and his children, Dallas, Ashlynn, and  Teagan, for making sacrifices so our Nation can prosper.\n\nChief Jason, Aim High and have a happy retirement.", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694125/recognizing-usaf-chief-master-sergeant-jason-q-shaffer"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…gratitude, and honor.\n\nTheir guiding principle and their guiding belief is simple but  powerful: When fathers are present and engaged, children do better and  entire communities prosper. Time and again, families across Spokane  have been reunited, and lives have been changed for the better, one  dad, one child, and one family at a time.\n\nEarlier this month,…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697297/recognizing-ron-hauenstein"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…businesses in my home state of Indiana.\n\nMr. Speaker, I would like to congratulate the PEO industry for all  they do to help our nation's small businesses, and their employees  prosper.", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690397/recognizing-national-peo-week"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…United States has  to be doubled just to maintain baseline spending.\n\nIs that moral? Mr. Speaker, you have kids. Is this the America where  the  next generation always gets to prosper more? That is not the model now.  The next generation is going to be poorer, and it doesn't have to be.\n\nWe are on the cusp of amazing technologies--synthetic biology, cures…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699257/debt-deficits-and-demographics"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…this self-destructive lunacy is not going to end well.\n\nThat brings us to this bill to reduce the regulatory burdens that the  left has imposed upon our Nation's ability to prosper and advance. It  codifies President Trump's executive orders that identify the resources  that we can develop and calls forth the powers of prosperity that those  resources…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699690/critical-mineral-dominance-act"}, {"senator": "Keith Self", "party": "Republican", "sentence": "…Plano TX; Reed       William Hisle, McKinney TX; Blake Ryan McKenna, Plano TX;       Owen Younghoon Ryu, McKinney TX; Dillon Avery Watt, Plano TX;       Anna Faith Williams, Prosper TX; Matthew Sumin Wooton,       McKinney TX.                              u.s. naval academy\n\nBrandon Preston De Vun, McKinney TX; Aden Tye Lewis,       Greenville TX; Sophie…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692978/saluting-our-soldiers-of-tomorrow"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "Mr. FALLON. Mr. Speaker, I rise today to recognize Mr. John  ``Johnny'' Rothfus of Prosper, Texas, and present him with the  Congressional Patriot Award. Johnny has dedicated himself to faithfully  serving our community and country.\n\nJohnny was born in Sachse, Texas,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690292/recognizing-congressional-patriot-award-recipient-john-johnny-rothfus"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…The Ways and Means Committee is also delivering on  President Trump's agenda by permanently extending the President's 2017  tax cuts. Our small businesses will continue to prosper. Also included  in this big, beautiful bill is the removal of taxes on tips. It removes  taxes on Social Security. It removes taxes on overtime, finally giving  relief to…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1690998/delivering-on-president-trumps-agenda"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "Mr. FALLON. Mr. Speaker, I rise today to recognize Mr. Nate Pike of  Prosper, Texas, and present him with the Congressional Patriot Award.  Nate has dedicated himself to faithfully serving our community.\n\nA native of Denison, Texas, Nate attended Denison…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690209/recognizing-congressional-patriot-award-recipient-nate-pike"}]