[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…President calls this energy dominance, but dominance over what? the  laws of physics? the carbon cycle?\n\nHere is what has actually happened: We are sacrificing long-term  prosperity for short-term profit. We are driving up costs for American  families through higher insurance premiums, higher food prices, and  higher disaster recovery expenses.\n\nWe are…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700133/climate-change"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…shared my fascination with science.\n\nOver the past 75 years, the NSF has stayed true to its mission to  promote the progress of science; to advance the national health,  prosperity, and welfare; and to secure the national defense.\n\nUnderpinning this has been its commitment to a merit-based and peer- reviewed grant process that has ensured that good…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691390/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…our economy so that they can keep sales and stay afloat.  Sharp increases propose a major threat to that economy.\n\nInflation and high costs are a threat to stability and prosperity of  American  businesses of all size, to our farmers, and to our consumers. We live  now in an interconnected world--a global economy--and advances in  technology and transportation…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689549/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "Mr. CASE. Mr. Speaker, I rise today in support of my Promoting  Regional Opportunities for Sustainable Prosperity and Economic  Resilience in the Pacific Act, or PROSPER in the Pacific Act, to  advance the U.S.-Pacific Islands relationship to include an economic  partnership built on…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697950/supporting-the-prosper-in-the-pacific-act"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…In this month and this year, the Pax Americana, the rules-based  international order established in the aftermath of World War II, an  order that has delivered peace and prosperity to the United States, has  been brought to a dishonorable end.\n\nIn this month, Trump ordered the U.S. Representative to the U.N. to  vote with autocrats and against democracy.…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688107/marking-third-anniversary-of-unprovoked-russian-invasion-of-ukraine"}, {"senator": "Steven Horsford", "party": "Democrat", "sentence": "…govern with our values, we can  revive it for Nevada and for our entire Nation. That is how we honor  Dr. King's legacy: by building an America of equal opportunity, shared  prosperity, and dignity for all.\n\nI encourage all of my colleagues, regardless of party lines, to do  their part in honoring Dr. King through their actions. That is how we  carry on…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699199/building-a-beloved-community"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…tariffs is going to give any kind of lifeline to  those family farms that have been so much a part of our heritage, who  do so much for the well-being of our country, and whose prosperity is  so essential to the well-being of our whole country.\n\nFarmers like to feed people. They like to work hard. They don't want  a bailout, and they don't want a handout.…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696342/trump-administration"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…Civil Rights Act of 1964 that so many died and bled for.\n\nMr. Speaker, this is not just about policy disagreement. This is  about direct attacks on Black futures, Black prosperity, and Black  freedom. This is about right versus wrong, point blank. But here is  what they don't understand. We have seen this playbook, and every time  they have attempted…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690636/trumps-first-100-days"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…entrepreneurship. Critically, it will remain home  to the beloved Sal's Italian Restaurant.\n\nThis is a model of public and private partnership coming together to  create shared prosperity. With local, State, Federal, and private  investments, the future of Seaford is exactly what we should hope for  in our small cities and towns across America. The leaders…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689020/food-banks-facing-urgent-crisis"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…proven international rules-based orders that have kept the  peace and stability for three generations now. This is a world he hopes  for that has forgotten that true peace and prosperity are built on both  strength and democratic values.\n\nYes, the desertion of Ukraine and its sheer ripple effects shows Xi  that he finally has the willing partner he has sought,…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687987/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…you. It is justly so; for it is a main pillar in the edifice of  your real independence, the support of your tranquility at home, your  peace abroad, of your safety, of your prosperity, of that very liberty  which you so highly prize. But as it is easy to foresee that, from  different causes and from different quarters, much pains will be taken,  many artifices…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700163/reading-of-washingtons-farewell-address"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…peace and security.\n\nSadly, it just doesn't end at our borders. Peace and security in the  world is in the best interests of the American people, and we see the  economic prosperity that we have enjoyed because of it. That is what  Ukraine is about and why we should continue to support them.\n\nMr. Chair, I yield back the balance of my time.\n\nMr. SMITH…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695253/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…leader in IFIs like the World Bank.  Our leadership in these institutions provides us with a strong voice to  improve global economic stability, decrease poverty, and boost  prosperity.\n\nThrough our membership, we advocate for high standards, push for  transparency, and drive economic reforms that benefit not only  developing nations but our own national…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693972/aligning-sec-regulations-for-the-world-banks-international-development-association-act"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…meeting people where they are, CIRCLE helps prevent crises from  escalating and connects individuals with the service and long-term  support that they need.\n\nThe safety and prosperity of communities in the San Fernando Valley  are among my most critical priorities. I am working with stakeholders  and leaders across my district to ensure that all people…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699916/funding-for-los-angeles"}, {"senator": "Derek Tran", "party": "Democrat", "sentence": "…with nothing. Boat  people did not let the hardship of the journey define the life that  they built in America. We have built communities that are unparalleled  in strength, prosperity, and commitment to preserving our history.\n\nMr. Speaker, as we reflect on the past 50 years since the fall of  Saigon, we do so in solemn remembrance but in celebration of…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690347/recognizing-black-april"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…signal not only respect for their importance but also  our determination to work alongside them as equal partners in tackling  shared challenges.\n\nFrom advancing security and prosperity to fostering innovation and  confronting global health threats, these organizations are central to  addressing pressing issues that do not stop at our borders.\n\nIf the United…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694822/providing-appropriate-recognition-and-treatment-needed-to-enhance-relations-act"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…expected to retire  over the next few years, U.S. electricity demand is projected to  increase by over 170 gigawatts.\n\nThese job-creating industries remain vital to economic prosperity and  our national security. We cannot sit idly by while our adversaries seek  to gain competitive advantage to control the next-generation economy.\n\nThis legislation takes…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697897/electric-supply-chain-act"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…creates  injustice.\n\nThe CLEAN DC Act is essential to restoring public safety in our  Nation's Capital. For far too long, Washington, D.C., a city meant to  embody freedom and prosperity, has been overwhelmed by violent crime.  As millions of people visit D.C. every year, it is imperative that our  Nation's Capital is safe for all residents and visitors.…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696932/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…President Trump's April 8, 2025, executive  order to reinvigorate America's clean coal industry recognizing that  coal must remain part of our future if we want to ensure future  prosperity, meet rising electricity demands, and lower costs for  families.\n\nBy reestablishing the National Coal Council, Congress will ensure  that reliable, affordable baseload power…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695524/providing-for-consideration-of-hr-dc-criminal-reforms-to-immediately-make-everyone-safe-act-providing-for-consideration-of-hr-district-of-columbia-policing-protection-act-providing-for-consideration-of-hr-lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia-providing-for-consideration-of-hr-district-of-columbia-judicial-nominations-reform-act-providing-for-consideration-of-hr-guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act-providing-for-consideration-of-hr-national-coal-council-reestablishment-act-providing-for-consideration-of-hr-promoting-cross-border-energy-infrastructure-act-and-for-other-purposes"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…That is the Democrats' vision of America's  future. It is a dangerous vision. It is a destructive vision.\n\nOne year ago, Americans chose a better path. They chose safety,  prosperity, and common sense. As a result, today, America is moving in  the right direction, and we are going to continue to fight to get  America back on track.", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696537/government-funding"}, {"senator": "Kevin Hern", "party": "Republican", "sentence": "…significant milestone. I join the congregation and Tulsa  community-at-large in celebrating this centennial anniversary, and I  sincerely wish the Church sustained success and prosperity for years to  come.", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690557/holy-trinity-greek-orthodox-church-centennial-celebration"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…multi-chronic sick people to pay  their bonds. Think about that.\n\nEverything is about the money here, not about the morality of having  a society that is growing and prospering. Prosperity, I would argue,  Mr. Speaker, is moral.\n\nHow much of the crap we do here is not just satiating today's  Twittersphere screaming at us or something that is completely made…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690586/economic-anxiety"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…the incredible contributions that future  FFA leaders will make. Their passion, knowledge, and dedication give us  confidence in the future of American agriculture and the prosperity of  our Nation.", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687891/national-future-farmers-of-america-week"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…believe that regulations should be simple to understand,  achievable, and easy to follow. Good process often leads to good  decisionmaking, more consistent outcomes, and prosperity, and that is  what this bill seeks to achieve.\n\nThe partnership between the private sector, States, and the Federal  Government envisioned by the Clean Water Act has worked…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698041/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…destabilized entire regions; displaced tens of millions of people; and  fueled terrorism, repression, and violence.\n\nWhere civil law is subordinated to Islamic authority, freedom,  prosperity, and security collapse. Sharia law is not a personal creed.  It is a political and legal system and one that rejects equality before  the law, suppresses dissent, and fuses…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699120/sharia-free-america-caucus"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…you. It is justly so; for it is a main pillar in the  edifice of your real independence, the support of your tranquility at  home, your peace abroad, of your safety, of your prosperity, of that  very liberty which you so highly prize. But as it is easy to foresee  that, from different causes and from different quarters, much pains  will be taken, many artifices…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700269/president-washingtons-farewell-address"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…need to make America work, and when Washington works, we all  thrive.\n\nI applaud our President for keeping his campaign promises, pushing  forward this agenda of peace and prosperity to make not only America  great again but make the world a much safer place.", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692814/elections-matter"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…Speaker   Mike Johnson, and House  Republicans.\n\nMake no mistake, more is to come.\n\nAs the Sun rises, we are ushering in America's golden age: a time of  renewed strength, prosperity, and opportunity for every citizen in  every community across this great land. The best days of our Nation are  still ahead, and together, we will make America stronger,…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699278/highlighting-republican-successes-in-2025"}, {"senator": "Mike Kelly, Jr.", "party": "Republican", "sentence": "…let us not only honor  our past but also embrace the opportunities ahead. Let us work together  to ensure that Mercer County continues to be a place of growth, unity,  and prosperity for generations to come.", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689795/recognizing-mercer-county-pennsylvanias-225th-anniversary"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…if the advance of Islam and the importation of  sharia law are consistent with Western civilization, the Western  civilization responsible for providing more peace, more prosperity,  better living conditions, and more freedom for more people than the  world has ever seen. His answer was, of course, no, it is not.\n\nOur friends across the pond can barely…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695203/people-are-sick-and-tired"}]