[{"senator": "Lucy McBath", "party": "Democrat", "sentence": "…standards nationwide and restore consistency in how these horrific  offenses are prosecuted, ensuring that justice does not depend solely  on geography or jurisdiction.\n\nThe protection of our children from monstrous crimes transcends  political television. I call on each and every one of my colleagues to  pass this legislation and send a very clear and…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698896/child-predators-accountability-act"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…absent for rollcall vote No. 298, the motion to  invoke cloture on Executive Calendar No. 49, David Fotouhi, of  Virginia, to be Deputy Administrator of the Environmental Protection  Agency. Had I been present, I would have voted no.\n\nI was necessarily absent for rollcall vote No. 299, the confirmation  of Executive Calendar No. 49, David Fotouhi, of…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692470/vote-explanation"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…like  $2.80. That is a far cry from $2.\n\nMr. Speaker, if we defeat the previous question, I will offer an  amendment to the rule to bring up H.R. 12, the Women's Health  Protection Act, to restore the rights of women to an abortion  nationwide and undo extremist abortion bans in States across the  country.\n\nMr. Speaker, since the Supreme Court's Dobbs…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699220/providing-for-consideration-of-hr-supporting-pregnant-and-parenting-women-and-families-act-providing-for-consideration-of-hr-pregnant-students-rights-act-and-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "Mr. McGARVEY. Mr. Speaker, I rise today to thank the Okolona Fire  Protection District for their bravery and heroism in response to the  tragic crash of UPS Airlines Flight 2976 in Louisville, Kentucky.\n\nOn Tuesday, November 4th, a cargo jet bound…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696618/recognizing-the-bravery-and-heroism-of-okolona-fire-protection-district"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to congratulate Chief Don  Lombardi of Golden,  Colorado, on his retirement following 33 years of service to the West  Metro Fire Protection District.\n\nThroughout his career, Chief Lombardi went above and beyond the line  of duty, and focused on growing programs that saved Coloradans money  and protected the health…", "date": "2025-08-08", "source_url": "https://justfacts.votesmart.org/public-statement/1694720/recognizing-chief-don-lombardi"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…approved, which holds the  promise of screening for up to 40 types of cancers with a single blood  draw.\n\nWhen it comes to cancer, we know that early detection is our best  protection, and that is exactly what this bill will do. It is about  ensuring that those who are most at risk can catch cancer early and  stop it before it spreads.\n\nThanks to the advocacy…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695554/american-cancer-society-fly-in"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…of 37 federally recognized Tribes and villages across the Yukon  River Basin. These Tribes served as cooperating agencies in the RMP  development process working to ensure protection for critical salmon  habitat and other interests, and they endorsed the RMP after extensive  consultation. They oppose this resolution, among many others.\n\nMr. Speaker, I…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694899/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…States that do not have such a cap, predatory  lenders can offer loans with triple-digit APRs that trap individuals in  cycles of debt. For instance, the Consumer Financial Protection Bureau  found that 80 percent of payday loans are rolled over or renewed within  2 weeks. This practice can subject borrowers not just to high nominal  interest rates but…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699782/9999"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "Mr. Speaker, I rise to speak in support of H.R. 1442, the Youth  Poisoning Protection Act.\n\nSodium nitrite is a highly toxic substance. Ingesting even a small  amount is likely to be fatal. Unfortunately, online forums are  providing detailed instructions…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690218/youth-poisoning-protection-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…having their emotions exploited for financial gain.\n\nI encourage my Republican colleagues to support this legislation as  well as the bipartisan FTC that ensures consumer protection measures  like this one are fully and fairly enforced for all Americans. I thank  Representatives Pettersen and Valadao for their leadership on this  legislation.\n\nMr. Speaker,…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692728/romance-scam-prevention-act"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…Water Resources Development Act of 2024 authorized  projects across the United States for water and wastewater  infrastructure that are critical to strengthening the flood protection  and resiliency of our communities and to complete ecosystem restoration  that maintains America's vital natural resources.\n\nThis legislation specifically authorized $49…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694842/massive-cuts-to-energy-and-water-infrastructure"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…Meanwhile, the Chinese and others, they were getting on the speedway.  They were getting ready to catch up to us. And starting in 2009, the  Obama administration's Environmental Protection Agency and Department  of Transportation built upon that law to negotiate a historic agreement  with the State regulators, with the automakers, with labor unions, and  the…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691549/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…Amendment by increasing funding for  Federal public defenders by $315 million. This helps to ensure due  process is not just a privilege reserved for the wealthy few, but a  protection guaranteed to all of us, regardless of status.\n\nThis package not only supports democracy at home but advances it  abroad. It protects funding to fully meet our treaty obligations,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699057/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…case, the benefits to public safety are unclear, while we       have amply demonstrated the risks. Perhaps an individual       seeks to acquire such a device for self-protection. If the       individual does not have a prohibiting record, they should be       able to pass a firearms background check with no       inconvenience to themselves--most…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700033/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…incorrect  when she claimed that SBA didn't issue regulations to make sure that  people accessing the money from PPP will not commit crime, abuse, or  fraud.\n\nThe Paycheck Protection Program imposed significant compliance  burdens on small businesses, but I believe we can all attest to the  fact that the PPP helped millions of small businesses stay afloat…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697332/small-business-regulatory-reduction-act-of-2025"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…themselves  as family members. I think 45 minutes is worth it to save the life of a  child.\n\nAnd my PRINTS Act, which has been reintroduced, would give Customs  and Border Protection the authority to fingerprint noncitizens under  the age of 14 to combat the horrific practice called child recycling.\n\nJust this week, I also sent a letter to FBI Director…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688161/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "Mr. BARR. Mr. Speaker, I thank my friend, Chairman Hill, for bringing  this important resolution of disapproval to the House floor, nullifying  the Consumer Financial Protection Bureau's disastrous overdraft rule.\n\nLet me set the record straight, Mr. Speaker. This resolution of  disapproval doesn't increase fees, as my friends on the other side of…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689846/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…Administration.\n\n``(cc) The Director of the Office of Management or the       Chief Financial Officer.\n\n``(dd) The Assistant Secretary for Accountability and       Whistleblower Protection.\n\n``(ee) The General Counsel.\n\n``(ff) Such other officers as the Secretary determines       appropriate.\n\n``(ii) In the case of an employee of the Department       employed…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693967/protecting-regular-order-for-veterans-act-of-2025"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…the House  and Senate Leadership and to receive the revered Templeton Prize.\n\nKnown as the ``Green Patriarch,'' he is well known for his efforts to  promote ecology and the protection of the environment. He has been at  the forefront of religious freedom and bringing together others from  many faiths to work towards better cooperation and understanding.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695924/welcoming-the-ecumenical-patriarch-of-constantinople-his-all-holiness-bartholomew"}, {"senator": "James Risch", "party": "Republican", "sentence": "…used in the       development of a system with similar or advanced       capabilities.\n\n4. A determination has been made that Australia can provide       the same degree of protection for the sensitive technology       being released as the U.S. Government. This proposed sale is       necessary in furtherance of the U.S. foreign policy and       national…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695912/arms-sales-notification"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…call  up the joint resolution (H.J. Res. 89) providing congressional  disapproval under chapter 8 of title 5, United States Code, of the rule  submitted by the Environmental Protection Agency relating to  ``California State Motor Vehicle and Engine and Nonroad Engine  Pollution Control Standards; The `Omnibus' Low NOX  Regulation; Waiver of Preemption;…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690434/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-nox-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…all the people of Iran in a free-market  economy: restoration of the rights of blue-collar workers, farmers,  nurses, white-collar workers, teachers, and retirees.\n\nNine, protection and rehabilitation of the environment, which has  been absolutely massacred under the mullahs.\n\nFinally, 10 of her 10-point plan, a nonnuclear Iran that is also  devoid of…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697723/free-iran"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…Mr. Speaker, I thank Chairman Hill for his  leadership on this, as well as Ranking Member Waters.\n\nI rise today in strong support of H.R. 2384, the Financial Technology  Protection Act of 2025, a bill that I am honored to both lead and  author that was created out of a vast network of partnership on both  sides of the aisle.\n\nMr. Speaker, as you know,…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693961/financial-technology-protection-act-of-2025"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…including in Public Laws 107-10, 107-158, 108-28,       108-235, 113-17, and 114-139, and the unanimous House and       Senate passage of the Taiwan Allies International Protection       and Enhancement Initiative (TAIPEI) Act of 2019.\n\n(9) In its fact sheet, entitled ``U.S. Relations with       Taiwan'', published on August 31, 2018, the Department…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692796/taiwan-non-discrimination-act-of-2025"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…reliquidation may be made       under paragraph (1) with respect to an entry only if a       request therefor is filed with the Commissioner of U.S.       Customs and Border Protection not later than 180 days after       the date of the enactment of this Act that contains       sufficient information to enable such Commissioner--\n\n(1) to locate the entry;…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698853/haiti-economic-lift-program-extension-act"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…of Greater Lee County.\n\nMayor Fuller has served the Alabama Municipal Electric Authority  (Chairman), Alabama League of Municipalities (Past President), Alabama  Monument Protection (Vice Chair), Auburn-Opelika Tourism Bureau, Lee- Russell Council of Governments, Opelika Planning Commission, Auburn  University Regional Airport, Master Mason and member…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696582/recognizing-the-retirement-of-mayor-gary-fuller"}, {"senator": "Shelley Capito", "party": "Republican", "sentence": "…background about how we  got here. Typically, the Clean Air Act stops State laws that regulate  emissions for motor vehicles in favor of a national standard by the  Environmental Protection Agency. This allows automakers to build the  same vehicles for use by drivers all across the country.\n\nSince 1966, the Clean Air Act has given California, and only  California,…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691584/hj-res-88"}, {"senator": "Steve Womack", "party": "Republican", "sentence": "…Mark brought this to  my attention, and I wouldn't be standing here today without his  encouragement.\n\nIn 2008, Congress passed the Ryan Haight Online Pharmacy Consumer  Protection Act to address the rise of rogue online pill mills and the  potential for abuse in prescribing controlled substances. At the time,  it was the right step to safeguard public…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695454/protecting-veteran-access-to-telemedicine-services-act-of-2025"}, {"senator": "Keith Self", "party": "Republican", "sentence": "…of law. A woman's testimony is equal to  one-half of that of a man. Non-Muslims living in majority Islamic  societies are second-class citizens with few rights and little  protection under the law.\n\nThe Sixth Amendment speaks of an impartial jury, but the testimony of  a non-Muslim is deemed inadmissible. In an Islamic sharia court, the  only testimony…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697017/sharia-is-dangerous"}, {"senator": "Frank Lucas", "party": "Republican", "sentence": "…the first Trump  administration and former Agriculture Secretary Vilsack under the Biden  administration agreed that having a permanent seat at the table is  vital to the protection of our farmland and food supply.\n\nI am also pleased to boast bipartisan support from the leadership of  the House Financial Services Committee. This bill has passed  unanimously…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692797/agricultural-risk-review-act-of-2025"}]