[{"senator": "Doris Matsui", "party": "Democrat", "sentence": "…dedicated to raising  awareness about the importance of source plasma collection, recognizing  the valued contributions of donors, and increasing understanding about  plasma protein therapies and the rare diseases they treat.\n\nAs co-chair of the Congressional Rare Disease Caucus and a member of  the Congressional Plasma Caucus, this annual event, celebrated…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696010/recognizing-international-plasma-awareness-week-2025"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "…are  overcrowded, and people are sleeping on the ground next to toilets.  Folks are denied medical care. If the private prison companies running  the facilities provide any protein in meals, it is often undercooked  and, yes, sometimes bloody. Dinner is often served after midnight.\n\nSo it is no surprise that these conditions are so poor because about…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697449/fighting-dhs-immigration-raids"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…store, and you  are shopping for what you are going to prepare for dinner. You have  readily accessible information--nutritional information--not just  calorie information, protein information, but ingredients of what is in  the product you are about to buy. There are certain things that we  cannot control, like the ingredients in the air we breathe.…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691583/hj-res-88"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…remote corners of the world. Ready-to-use therapeutic  food, or RUTF, is a nutrient-packed peanut butter paste.\n\nRUTF, also known as Plumpy'Nut, delivers the fat, sugar, and protein  that children with malnutrition need to survive and grow. It requires  no refrigeration, and kids show improvement and are saved within weeks.\n\nEdesia Nutrition, based in…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690379/edesia-nutrition-saves-malnourished-children"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…Wildlife Service  conducts proper environmental assessments as it renews the program.\n\nThis bill will help U.S.-based aquaculture producers deliver healthy  and affordable protein for American families.\n\nMs. RANDALL. Mr. Speaker, I urge my colleagues to support this  legislation, and I yield back the balance of my time.", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697640/cormorant-relief-act-of-2025"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…Ohio and across our Nation are seeing shelves go bare, school meal  programs, senior nutrition, and food pantry lifelines short. The boxes  going out to seniors don't have protein.\n\nWhen Federal food dollars are cut off, it doesn't just hurt the  hungry, it hurts the producers. Congress must restore these funds to  feed our people, support the farmers,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690437/empty-shelves-at-food-banks"}, {"senator": "Julia Brownley", "party": "Democrat", "sentence": "…are scaling up production, while countries  like Singapore, Israel, Australia, and the U.K. are moving forward, as  well.\n\nIf cultivated meat helps deliver cheaper, scaleable protein solutions  worldwide, do we really want China setting the standards, dominating  the intellectual property, and reaping the jobs this burgeoning  industry creates?\n\nMr. Chair,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695257/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…like, and it is  the leading cause of death for children under 5.\n\nThere is treatment. Ready-to-use therapeutic food is a nutrient-rich  peanut paste that delivers the fat, protein, and vitamins that starving  children need to survive. It can save a child's life in just 8 weeks.\n\nThe Edesia factory in Rhode Island has helped save 25 million lives  with…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690758/biology-of-hunger"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…this week--Mr. Speaker, and it is  something we in our office have been working on for years now--they  call it a fentanyl vaccine. It is not technically a vaccine. It is a  protein binder that attaches to the drug making it so it can't pass the  brain-blood barrier. There is an entire article in Wired magazine.\n\nWe did some research. I had trouble believing…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697873/turning-healthcare-into-financial-engineering"}, {"senator": "Paul Gosar", "party": "Republican", "sentence": "Mr. GOSAR. Mr. Chair, my amendment No. 106 prohibits funds for the  DOD's bioindustrial manufacturing and design ecosystem, or BioMADE,  that funds lab-grown meat and protein products for the military from  feeding our men and women. How disgusting does that sound?\n\nWith a national debt of over $37 trillion, we can't afford to litter  sensible…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693694/department-of-defense-appropriations-act-2026"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…about a University of Houston drug that basically takes fentanyl in  your system--and I am sure I am describing it partially wrong, but I am  doing my best--and attaches a protein to it, and, therefore, the drug  can't pass the blood-brain barrier. It lasts for 6 months to a year.\n\nWhat would happen if I came to you and showed you some of the  economic…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698412/fun-with-math"}, {"senator": "Roger Marshall", "party": "Republican", "sentence": "…future for our farmers.\n\nWhole milk delivers 13 essential nutrients and has enough fat content  to help students absorb vitamins like A, D, E, and K. It is also packed  with protein that helps keep the student full all the way through those  long afternoon math classes and then on through gym and on through  their sports activities, until they get home…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697062/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…nutritional standards       established by the Secretary (which shall, among other       requirements to be determined by the Secretary, include       fortification of calcium, protein, vitamin A, and vitamin D       to levels found in cow's milk); and''; and\n\n(B) in clause (iii), by striking ``physician'' and       inserting ``physician, parent, or legal…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698178/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…Cystic fibrosis is a genetic lung disease that primarily affects  young people. Dr. Welsh's research has been instrumental in  understanding the function of a critical CFTR protein and how it causes  cystic fibrosis, which has led to the creation of lifesaving therapies.  Aided by his medical team, Dr. Welsh created a triple drug combination  that treats…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695572/congratulating-dr-michael-welsh"}, {"senator": "John Moolenaar", "party": "Republican", "sentence": "…yielding.\n\nToday, I rise in support of the Whole Milk for Healthy Kids Act. Milk  has long been a cornerstone of children's diets in this country. It  provides high-quality protein, calcium, vitamin D, and other essential  nutrients that growing bodies and young minds need to thrive. For many  kids, milk is the most reliable source of vital nutrients…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698184/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "Roger Marshall", "party": "Republican", "sentence": "…program is now going to require all the  grocery stores to double the amount of opportunities of choices that  you are going to have from this real food selection.\n\nReal food is protein. It is whole grains, and it is healthy fat. The  previous pyramid probably required that 50 percent of your calories  come from carbohydrates. We know that was probably a…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698680/9999"}]