[{"senator": "Jim McGovern", "party": "Democrat", "sentence": "…gouging, nothing to bring down rent, nothing  to help people buy a home, nothing to lower prescription drug costs,  nothing to raise wages, nothing to strengthen workplace protections,  and nothing to create jobs. Just culture war garbage and corporate  giveaways is all the GOP knows how to do.\n\nAfter 1 year of total power, there is nobody else to blame.…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699220/providing-for-consideration-of-hr-supporting-pregnant-and-parenting-women-and-families-act-providing-for-consideration-of-hr-pregnant-students-rights-act-and-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…incarcerated  compared to White kids, despite committing crimes at the same rate.\n\nThis Republican bill is flawed. By treating children as adults, Mr.  Speaker, you deny them protections from abuse from adults in prison,  including bullying, physical violence, sexual assault, and rape.\n\nThis Republican bill makes children's lives worse. Unlike in other…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695594/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…bill allows employers       to label training as ``voluntary,'' even when workers feel       pressured to attend to keep their jobs or advance, and       removes current protections that ensure training closely tied       to a worker's job is paid. As a result, employers could push       essential training outside of regular work hours and off the…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699005/empowering-employer-child-and-elder-care-solutions-act"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…seeing special education under direct and  deliberate attack. We have seen repeated efforts to slash education  funding, weaken civil rights enforcement and chip away at the  protections IDEA guarantees to our students with disabilities.\n\nEvery dollar we fail to invest in IDEA is a cost shifted onto our  schools, our local communities, our families, and…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698946/protecting-education-for-children-with-disabilities"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…brings much-needed  oversight and standards to the $250 billion stablecoin market. It also  creates guardrails for responsible innovation and will enact sensible  consumer protections for payment stablecoins. As an early supporter and  negotiator of the final version of the bill, I pushed for provisions  which clearly preserve State consumer protection…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692628/genius-act"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…the right to be safe at school,  at the grocery store, and at home.\n\nThe Trump administration is making this much harder. This White House  has worked to unwind the very protections that are designed to keep us  safe. They have cut critical funding for gun  violence prevention programs at the Department of Justice and have  weakened the ATF, making…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690394/attacks-and-threats-on-democracy-and-rule-of-law"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…that are canceled or postponed more  than 6 months into the future, and cracks down on fraudulent ticketing  websites.\n\nAmerican consumers need and deserve these commonsense protections.\n\nYet, these protections are meaningless without strong and consistent  enforcement. House Republicans are standing by in silence as the  Federal Trade Commission, the agency…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690174/transparency-in-charges-for-key-events-ticketing-act"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…rural areas and  programs to help build drinking and wastewater infrastructure in rural  communities that need it most.\n\nHouse Republicans are using this bill to eliminate protections for  small meat and poultry producers against large corporations that have  dominated the market, forced small producers out of business, and price  gouged consumers.\n\nWe…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695289/9999"}, {"senator": "Sheila Cherfilus-McCormick", "party": "Democrat", "sentence": "…them.\n\nWhy wasn't any grace extended to Afghans, who helped our soldiers at  war and risked their lives for the American people? This administration  ended their deportation protections on the same day they welcomed  Afrikaners.\n\nFor those Haitians who fled instability and gang violence, why were  TPS and humanitarian parole ripped away from them?\n\nAround…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691340/make-refugee-policy-same-for-all"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…Park, and Avondale, Carlos championed policies  to expand affordable housing and resist gentrification and  displacement. He has also led unapologetic efforts to expand  protections for immigrants, LGBTQ+ people, and workers in Chicago.\n\nCarlos shifted the dynamics of local politics by making sure that  neighbors and constituents had power over land…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690325/national-fair-housing-month-amisha-patel"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…their  healthcare, all so they can shower these giant tax breaks on  billionaires and big corporations.\n\nUsing the Congressional Review Act hatchet to carve away critical  protections from an agency that has already been decimated by DOGE's  indiscriminate firing demonstrates how unserious Republicans are about  keeping Americans safe from dangerous pollution,…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688531/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…Earth we are here to  preserve, and we only use. We have taken away from women the right to  go to Planned Parenthood to have health care that they need. We have  taken away protections for clean energy to change the rate of growth of  global warming that affects our planet and affects our future with  hotter and hotter summers, flash floods, fires and…", "date": "2025-07-25", "source_url": "https://justfacts.votesmart.org/public-statement/1694255/condemning-chaotic-and-harmful-failings-of-this-congress"}, {"senator": "Rob Menendez", "party": "Democrat", "sentence": "…our friends and neighbors are under continuous attack  from the Trump administration including by cutting HIV treatment and  prevention and rolling back antidiscrimination protections.\n\nMore than 1.3 million Americans have sought lifesaving help by making  the call to 988. Yet this administration has eliminated funding for  those specialized services.…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693017/fighting-for-lgbtq-rights"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…ACA, that       coverage is dissolving. The fear is a cold, suffocating       blanket. My wife's cancer care is a complex, costly, and       continuous reality. With the protections and financial       assistance of the ACA gone, her medical bills--for       chemotherapy, hospice, hospital stays, and medication--could       easily become astronomical,…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696975/stories-from-home-the-human-cost-of-expiring-healthcare-tax-credits"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…that in the strongest possible terms.\n\nThis will slash support for students with disabilities, undermine  schools in rural communities, and also eliminate the civil rights  protections that people fought and died for.\n\nThis executive order will be an illegal and unconstitutional abuse of  power. An act of Congress created the Department of Education and…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688596/we-need-the-department-of-education"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…guidance or no guidance at  all on how to navigate classes while pregnant. In many cases, women  feel pressured to end their pregnancies or risk academic failure  despite protections that exist now under Federal law.\n\nThe Pregnant Students' Rights Act requires schools to clearly  communicate what accommodations and protections pregnant and parenting…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699316/pregnant-students-rights-act"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…BDCs. This improves both accuracy and transparency. This  is a smart and bipartisan solution that removes an intended barrier to  capital formation without reducing investor protections.\n\nMr. Speaker, I urge my colleagues to support the bill, and I reserve  the balance of my time.\n\nMrs. WAGNER. Mr. Speaker, in closing, this is a smart and bipartisan  solution…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692712/access-to-small-business-investor-capital-act"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…sensitive information of U.S. citizens.\n\nThis legislation will mandate that all DHS intelligence products  undergo comprehensive reviews to ensure compliance with constitutional  protections.\n\nMr. GARBARINO. Madam Speaker, I have no more speakers, and I am  prepared to close after the gentleman from Puerto Rico closes.\n\nMr. GARBARINO. Madam Speaker, I yield…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696751/strengthening-oversight-of-dhs-intelligence-act"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "…identifies specific pastures as       unavailable for grazing or open only for trailing,       distinguishes recreational shooting from game hunting, adds       explicit protections for old-growth trees, and institutes       protection measures for migratory birds. To protect sensitive       resources, the Grand Staircase RMP creates new Areas of…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700255/us-government-accountability-office-decision"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…accountability to the American people  while retaining reasonable FOIA--for those who don't understand what  ``FOIA'' is, that is the Freedom of Information Act--and Sunset Act  protections.\n\nI have always advocated for more transparency at TVA, first in the  State legislature, then as a mayor, and now as a Congressman.\n\nI thank my good friend, Representative…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692212/tennessee-valley-authority-transparency-act-of-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…in this constitutional amendment. It says  that everything else in our Constitution does not apply. Partisan  gerrymandering will be the supreme law of the land.\n\nAll the protections in our Constitution right now that are manifested  in the existing congressional map will be thrown out, which means the  protections where we had extensive public input…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}, {"senator": "Cindy Hyde-Smith", "party": "Republican", "sentence": "…complications such as  sepsis, hemorrhage, infection, and emergency surgery within 45 days of  ingesting the pills.\n\nThe SAVE Moms and Babies Act would restore commonsense safety  protections, including requiring an in-person doctor visit before  mifepristone is prescribed. This drug should never be administered  through the mail, where abusers and traffickers…", "date": "2026-01-27", "source_url": "https://justfacts.votesmart.org/public-statement/1699386/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…adopted plan better serves the policy set forth in Executive       Order No. 13990 than the plan adopted by the 2020 Record of       Decision ``by providing greater protections to environmental       values and subsistence uses in the NPR-A while still allowing       for oil and gas exploration and development consistent with       BLM's management…", "date": "2025-07-28", "source_url": "https://justfacts.votesmart.org/public-statement/1694269/us-government-accountability-office-legal-opinion"}, {"senator": "Scott Fitzgerald", "party": "Republican", "sentence": "…The CLARITY Act fixes this. It establishes clear, functional rules  for digital assets, drawing a bright line between the SEC and the CFTC  and creating strong, enforceable protections for consumers.\n\nIt ensures the digital assets developers and consumer-facing firms  play by the rules, disclosing who owns what, segregating customer  funds, and avoiding…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693792/digital-asset-market-clarity-act-of-2025"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…the remaining leftover funds are unobligated.\n\nThe Crime Victims Fund Stabilization Act only redirects these  leftover, unobligated funds to the CVF. We include specific protections  for government reimbursement and whistleblower rewards. Those dollars  remain untouched. This bill simply ensures that the surplus damages  collected from those found liable…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698841/crime-victims-fund-stabilization-act-of-2025"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…supervisor must provide  written approval at the initial determination of a penalty, ensuring  proper oversight from the start. This simple clarification strengthens  the taxpayer protections and promotes a consistent and reliable penalty  process.\n\nMr. Speaker, Americans deserve a tax system that is fair,  predictable, and transparent. This bill moves us closer…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697249/fair-and-accountable-irs-reviews-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…hinder innovation  and make the United States' financial system less competitive as a  result.\n\nThis bill will impose rigorous procedural guardrails and enhance due  diligence protections and a stronger analytic framework before a firm  can be designated as a systemically important financial institution, or  SIFI.\n\nI thank, again, the gentleman from Illinois…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699822/financial-stability-oversight-council-improvement-act-of-2025"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…regulatory landscape       that adds costs and reduces the availability of buildable       lots--making housing more unattainable. This legislation       respects environmental protections and provides pragmatic       solutions to Section 404 and Section 402 of the CWA.\n\nUnder Section 404--dredge and fill permitting--home       builders pull some of the highest…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698026/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…service. As a sheriff and a  firsthand law enforcement officer, I have seen the harmful effects that  happens to these victims.\n\nI am pleased that the bill before us strengthens protections for  members of the Coast Guard from sexual assault, provides support to  victims, and increases transparency within the service about the manner  in which such cases are…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694195/coast-guard-authorization-act-of-2025"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…has created confusion within the academic research community. H.R. 1318  will eliminate confusion around the implementation of research security  requirements and increase protections of our R&D enterprise.\n\nMr. Speaker, I urge my colleagues to support this simple and  noncontroversial bipartisan legislation, and I yield back the balance  of my time.", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688931/united-states-research-protection-act"}]