[{"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…Commissioners Slaughter and  Bedoya is not only illegal; it hurts consumers and small businesses by  undermining the independence of the Agency that Congress established to  protect consumers from fraud, scams, and monopoly power. An independent  FTC is critical for protecting consumers and has done so in a  bipartisan manner for over 110 years.\n\nJust last…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1689985/confirmation-of-mark-meador"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…aren't here.\n\nThe CLARITY Act provides us with an opportunity then to change that,  to lead, to establish thoughtful and balanced guardrails that support  innovation, protect consumers, and foster confidence in our markets.\n\nYou see disclosures and reports dealing with so many provisions,  antifraud, manipulation. You can't commingle funds.\n\nBut let…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693791/digital-asset-market-clarity-act-of-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…market,  display, or otherwise offer the short-term lodging for sale.\n\nBy ensuring everyone in the short-term lodging ecosystem displays the  full price of a stay, we will protect consumers from being caught  paying extra when they go to check out.\n\nMr. Speaker, I thank Representatives Castor, Mullin, Kim, and Fry for  their bipartisan leadership on this…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690199/hotel-fees-transparency-act-of-2025"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…people who administer Social Security and  undermine it for our seniors, costs will go up. If you continue the  brain drain in our government and fire Federal workers who protect  consumers or do critical safety or health research, you will make us  less safe and costs will go up.\n\nMr. Speaker, this administration's policies will directly lead to  costs…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688637/the-actions-of-this-administration-will-actually-raise-costs-for-every-american"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…opportunity to vote on administrative regulations. During  the Biden administration, Republicans in the Senate forced 35 rollcall  votes to try to kill rules that sought to protect consumers' public  health and public lands--35 to 0. It was an astonishing record. Now  that the Trump administration is in power, it has engaged at breakneck  speed to tear down…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698620/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "…services.\n\nI welcome the opportunity to work with my colleagues to thoughtfully  legislate oversight of and implement necessary guardrails around  digital assets so that we protect consumers--especially Black and Brown  entrepreneurs, small investors, and working people--and promote  innovation.", "date": "2025-03-14", "source_url": "https://justfacts.votesmart.org/public-statement/1688902/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Joshua Gottheimer", "party": "Democrat", "sentence": "…proportionally ranks second nationwide in ownership of  cryptocurrency.\n\nWhile cryptocurrency has tremendous economic potential, we  desperately need rules of the road to protect consumers, ensure the  success of American entrepreneurs, and ensure that America leads the  way, not other nations around the world, but that America leads the way  in this growing…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693783/digital-asset-market-clarity-act-of-2025"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…is       shipped to NFTA countries. The public interest includes       impacts to prices of natural gas and reliability. Section 3       gives DOE wide latitude to protect U.S. consumers now and in       the future as larger amounts are exported.\n\nH.R. 1949 removes Section 3 and the protection that it       affords. The bill removes DOE's authority…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697080/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…or store their  dollars in crypto. Rather than considering the three bills before us  this week, Congress should consider legislation that puts guardrails in  place to protect consumers, prevent fraud, and establish an effective  regulatory framework for crypto. Instead, these H.R. 3633, S. 1582, and  H.R. 1919 fall short of creating an effective regulatory…", "date": "2025-07-25", "source_url": "https://justfacts.votesmart.org/public-statement/1694254/9999"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…winners and losers, and the  biggest winner is the President of the United States.\n\nWhy is that office exempt from all of the rules? It undermines the  SEC's ability to protect consumers and fast-tracks deregulatory  loopholes without addressing core issues like transparency, fraud  prevention, or equity and access. The SEC doesn't even like this bill.…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693782/digital-asset-market-clarity-act-of-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Republican colleagues to recognize that restoring the FTC  as an independent agency, as this Congress intended, is essential to  ensuring this bill and similar efforts to protect consumers are fully  effective and enforced without fear or favor.\n\nI thank the wide range of stakeholders who worked on this bill, and  particularly the consumer groups for their…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690174/transparency-in-charges-for-key-events-ticketing-act"}, {"senator": "Joshua Gottheimer", "party": "Democrat", "sentence": "…The GENIUS Act is smart bipartisan legislation that backs stablecoins  through the U.S. dollar on a 1-to-1 basis and allows States to make  future safeguards to further protect consumers.\n\nThe GENIUS Act, as I said, protects consumers and gives clear rules  of the road to allow America to lead the way in a space that is key to  our economy. It cracks…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693833/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Kirsten Gillibrand", "party": "Democrat", "sentence": "…economy. Both  administrations have recognized that for the United States to remain  the financial capital of the world, Congress needs to pass clear  regulatory rules that protect consumers and foster innovation here at  home.\n\nI started working on this legislation 3 years ago with Cynthia  Lummis. This is not a bill written quickly for any reason but to…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692380/9999"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…created the       Consumer Financial Protection Bureau (CFPB) and strengthened       financial regulations through the Dodd-Frank Act.\n\nThe GENIUS and CLARITY Acts do not protect consumers,       workers or the financial system and instead they expose all       to more risk. The GENIUS Act would allow tech companies to       become de facto banks or issuers…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693839/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Darren Soto", "party": "Democrat", "sentence": "…need to be able to use this, too. We also heard in committee that  this could help make the CPSC more efficient by the use of this  technology, and it is critical that we protect consumers.\n\nThe bill also requires the Department of Commerce and other agencies  to study blockchain technology in the context of consumer products and  safety. Right now, blockchain…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693413/consumer-safety-technology-act"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…frontier. This assures us of that.\n\nIn the early days, caution was certainly prudent. Stablecoins are a  novel technology with significant questions regarding how to protect  consumers, like what happens in the event of bankruptcy and how to  ensure that the issuers live up to the technology's namesake by  providing a truly stable asset, the dollar.…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693846/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…Administration Policy supporting  H.J. Res. 20. Congress should pass H.J. Res. 20 to right the wrongs of  the previous administration, execute President Trump's agenda, and  protect our consumers.\n\nI thank the gentleman from Alabama's Sixth District for his  leadership.\n\nMr. Speaker, I urge my colleagues to vote ``yes,'' and I reserve the  balance of my time.…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688289/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters"}, {"senator": "French Hill", "party": "Republican", "sentence": "…consideration in the House.\n\nThe Clerk read the title of the joint resolution.\n\nMr. Speaker, I rise in support of this joint resolution of  disapproval.\n\nToday, we can protect consumers and ensure continued access to  financial services by voting to nullify the Consumer Financial  Protection Bureau's disastrous rule on overdraft fees.\n\nIn a time burdened…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689849/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…regulatory inaction, or  regulatory indecision. That is not consumer protection, but healthy  mergers that allow for greater competition of the big banks. That is  the way to protect consumers.\n\nI will make one other point before I reserve, as well. When we say  that large banks are not inherently bad, what we mean by that is that  when you allow for a merger,…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691498/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Speaker, I thank my colleagues, Representative Torres,  Representative Langworthy, Representative Clarke, and Representative  Garbarino, for their bipartisan leadership to protect consumers and  first responders.\n\nMr. Speaker, I urge my colleagues to join me in voting in favor of  H.R.\n\nMr. BILIRAKIS. Mr. Speaker, I encourage a ``yes'' vote, and I  congratulate…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690261/setting-consumer-standards-for-lithium-ion-batteries-act"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…study.--In conducting the study       required by paragraph (1), the Secretary shall examine--\n\n(A) existing and emerging uses of blockchain technology       that could help protect consumers, including by preventing or       mitigating fraud and other unfair or deceptive acts or       practices within the meaning of section 5 of the Federal       Trade Commission…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693414/consumer-safety-technology-act"}, {"senator": "Scott Fitzgerald", "party": "Republican", "sentence": "…reduce or eliminate overdraft  programs altogether.\n\nBecause of the CFPB's rule on overdrafts, consumers will lose  options. The resolution will repeal the CFPB's rule and protect  consumers.\n\nMr. FITZGERALD. Mr. Speaker, many people will face declined payments,  higher minimum balance requirements or, worse, be pushed toward riskier  unregulated products.…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689839/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…under the Congressional Review Act.\n\nI will be proud for this body to vote on and pass my resolution,  which is a commonsense step to keep government overreach at bay,  protect consumers, and support America's free markets. With the passage  of the House version of this resolution and with the passage of the  Senate's version today, it will head to the…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691668/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…stablecoins.\n\nStablecoin legislation has been in the works for over 4 years and has  been called for by Democratic and Republican administrations. The  status quo fails to protect consumers from fraud. That is an untenable  situation in a market growing by the billions.\n\nFor too long, the United States has operated without a clear Federal  framework for…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693840/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…certainty means that all parts of the ecosystem can  engage with digital assets with confidence. It promotes healthy markets  by establishing commonsense requirements to protect consumers. Those  are all built on the existing requirements in the financial services  markets.\n\nSecondly, the CLARITY Act protects good actors from government  overreach. By…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693788/digital-asset-market-clarity-act-of-2025"}]