[{"senator": "Lateefah Simon", "party": "Democrat", "sentence": "…responsibility to guarantee basic fairness in education?\n\nWe cannot meet the demands of the future by returning to a past-- returning to a past--where only the privileged are protected. The work  of the Department of Education was never about charity. It has always  been about justice.\n\nAs bell hooks taught us in ``Teaching to Transgress,'' teaching is…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693636/in-defense-of-children"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…March 15, 2022, to put a plaque up in Congress to  honor them, and it reads: ``On behalf of a grateful Congress, this  plaque honors the extraordinary individuals who bravely protected and  defended this symbol of democracy on January 6, 2021. Their heroism  will never be forgotten.''\n\nAlas, Mr. Speaker, their heroism seems already to have been forgotten…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691349/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…people, to take on corporate greed, and to lower everyday expenses.  They have done nothing.\n\nInstead, they have defended Trump's tariffs, passed tax cuts for  billionaires, and protected the special interests while regular  families are getting screwed. They have shoveled subsidies and  giveaways to greedy CEOs while  families struggle to pay for groceries…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697303/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…FBI public corruption squads has       paved the way for government graft. Cancelling hundreds of       millions of dollars in grants has left at-risk communities       less protected and crime victims less supported. The list       could go on.\n\nAs for its treatment of its employees, the current       leadership's behavior has been appalling. This…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…of a Trump  administration that is trying to open these lands once again to oil and  gas drilling.\n\nCan you imagine, one of our most sacred sites, which Secretary  Haaland protected in 2023, which the New Mexico delegation is trying to  permanently withdraw, a place the Pueblo leaders say holds the  footprints of their ancestors and countless generations;…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696913/protect-chaco-canyon"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…represent you and not to try to  make themselves richer, not run some scam, and call you a sucker; the  basic ideals of our Nation that everyone's rights will be equally  protected, and everyone will be held accountable under the law. Right  now, all of this--things that make our country different--are under  attack. Our constituents are asking us to…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…I even have constituents, a husband and wife who both worked for the  U.S. Forest Service. They were both let go. They both did that work and  trail maintenance. They also protected people during snow season in  snow parks. These are year-round, family-sustaining jobs, and these are  people without whom we all suffer.\n\nThere is another worker from my…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689811/cuts-to-forest-service-endanger-millions"}, {"senator": "Ruben Gallego", "party": "Democrat", "sentence": "…January 6.\n\nI urge my colleagues to support this amendment and to remember the  men and women who have defended this country honorably--those who  upheld their oaths, who protected our democracy--and those who continue  to serve with courage and sacrifice.", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698491/anniversary-of-january-6"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…country.\n\nFirst, we ask that you vote in favor of the Epstein       transparency act and that you help us ensure with its passing       that the identities of survivors are protected and the       identities of the perpetrators or enablers are not. Remind us       that America is the country that we thought it was when we       were little girls, before…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695788/a-letter-from-survivors-of-jeffrey-epstein-and-ghislaine-maxwell"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…natural systems disaster. As another report pointed out, some of the  benefits that our natural systems provide to humankind ``are not  substitutable, meaning they must be protected as they cannot be  replaced by technology when they are gone.'' Irreplaceability is one  danger; irreversible acceleration is another.\n\nSome of the harms fossil fuel emissions…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699613/9999"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…legislators during the 2023 legislative session, Minnesota's  students have free meals in school. Families have access to paid family  leave. Women's reproductive rights are protected. All Minnesota  individuals and families are supported and protected--with no  exceptions.\n\nMelissa was the best of Minnesota. She cared about others, treated  everyone with…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693118/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…medical complications, such as an ectopic  pregnancy.\n\nThey don't tell her that this is not a medical clinic at all. In  fact, because it is not, this woman's privacy is not protected, and her  information could be shared with the public.\n\nThe real world of the crisis pregnancy centers is exemplified by an  OB/GYN in Iowa, who has seen patients who visited…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699223/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…testimonies:  Testimony of Attorney Mirian Albert of Lawyers for Civil Rights to the\n\nCongressional Field Hearing on the Termination of Haitian Temporary                              Protected Status\n\nLawyers for Civil Rights (``LCR'') advocates for       communities of color and immigrants through legal action,       education, and economic empowerment. On March…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699638/expert-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…threat to the individual liberties of people in those  cities but also the credibility and reverence that the American people  have for this venerable institution that has protected us from  aggression and threats abroad.\n\nBy pursuing political goals with our young men and women in uniform,  he risks recruitment for the military; he risks the respect…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696181/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…manhandled, shoved to the ground, and cuffed. He  identified himself:\n\nI am Senator Alex Padilla.\n\nThat should be enough. That should be enough. A U.S. Senator who is,  by the way, protected by the speech and debate clause of the  Constitution of the United States and a specific statute that allows  him to oversee immigration facilities, and he says: I am a Senator,…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692449/alex-padilla"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…everything, seven people were shot,  and two were killed.\n\nH.R. 2243 would say that if any one of them were a retired or an off- duty law enforcement officer, they could have protected themselves.\n\nWhen these horrific things happen, the fact of the matter is that it  will take law enforcement time to get there. Mr. Speaker, the only way  for you to defend…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691168/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Abraham Hamadeh", "party": "Republican", "sentence": "…day of delay is another day a veteran waits for  care. It is another day a qualified professional can't serve. It is  another day the system fails those who have served and protected us  all. It is another day the swamp wins and our heroes lose.\n\nWe ask our veterans to wait for many things. Quality healthcare  shouldn't be one of them, not in President…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695432/health-professionals-scholarship-program-improvement-act-of-2025"}, {"senator": "Dan Newhouse", "party": "Republican", "sentence": "…and rightsizes the agency to preserve critical  functions. This includes funding to counter threats from adversarial  nations and ensure critical infrastructure systems are protected from  these threats.\n\nMr. Speaker, this Homeland Security bill is the last piece in  completing 12 fiscally responsible, bipartisan spending bills. It is a  testament to--…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699356/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…over to a division in the Department  of Health and Human Services to do it.\n\nIn the recent 4 or 5 years, we have had lots of cases where the lives  of these children aren't protected because the Department of Health and  Human Services isn't properly vetting the adults these children are  placed with.\n\nSo once again, I am here to give you some updates…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699108/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…in the United States. It encourages the  innovation and development of Web3 businesses here in the United  States. It establishes clear rules to ensure that consumers are  protected and businesses have clear regulations to responsibly  participate in the digital asset ecosystem.\n\nBy requiring issuers to maintain a one-to-one reserve in cash and  high-quality…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693840/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…she read in the media or  the scary texts that were coming out.\n\nA few days later, I heard back from her. She said: You were right. It  is in the bill. My son will still be protected.\n\nThat was a really happy day for me because people were seeing the  true story. They were moving beyond some of the bogus headlines and to  the truth. We owe it to those…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693529/read-the-bill"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Congress to serve our indigenous       constituents. For millennia, Inupiaq ingenuity has       transformed our relationship with industry into a partnership       that has both protected our environment and our way of life       and has brought significant economic benefits to the region       that would have otherwise been absent. Our North Slope       residents…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696834/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…look at what those votes have resulted in. Those votes say we  should honor the police who suffered when the insurrectionists beat  them, that we should honor the police who protected our democracy and  indeed protected every single one of us. Whether you are Republican or  Democrat, a House Member or a Senator, you were protected by the  police.\n\nAre…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691169/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Barry Moore", "party": "Republican", "sentence": "…genital mutilation and chemical  castration on our children. This bill expands the covered offenses to  include body mutilation and chemical castration of minors. Victims are  protected by ensuring that they cannot be arrested or prosecuted if one  of these, or other prohibited procedures, are performed on them.\n\nThis legislation continues President Trump's…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698346/protect-childrens-innocence-act"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…orbiting around our world today, providing the  telecommunications necessary not only for commercial use but for  military use, as well, to make sure that our men and women are  protected when GPS is essential.\n\nTonight, we will have yet another launch into the sky as SpaceX is  propelling this movement forward.\n\nAs we recognize, space is important for our…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687924/space-dominance"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…He said this 5 years ago: ``My position is that even hate speech  should be completely and totally allowed in our country. The most  disgusting speech should absolutely be protected. . . . The ACLU used  to hold this viewpoint. The American Civil Liberties Union, they sued  so that legitimate Nazis could march through downtown Skokie. . . . Why  would…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695787/beating-heart-of-democracy-is-freedom-of-speech"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…friend and  colleague.\n\nThis bill would protect servicemembers' homes from squatters while  they are away on Active Duty. Under current law, servicemembers are not  clearly protected under various State adverse possession laws. Due to  this lack of protection, a squatter might be able to move in and make a  claim to that servicemember's home when that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695471/servicemember-residence-protection-act"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…cultures.\n\nMr. Speaker, let us express our sincerest appreciation to Scott Gatto  for his outstanding military service and for his excellent acts of  leadership that have protected our country and also helped his local  community. His story is a testament to the American spirit of service,  sacrifice, and leadership, and it is an honor to recognize…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692240/recognizing-scott-gatto-as-june-2025-veteran-of-the-month"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…nothing in this provision shall be       construed to require the Commandant to publicly release       confidential, classified, law enforcement sensitive, or       otherwise protected information.''.\n\n(b) Clerical Amendments.--\n\n(1) Title 14.--The analysis for chapter 5 of title 14,       United States Code, is amended by inserting after the item…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…indicator that matters is the answer  Americans give to this question: Are you better off today than you were  2 years ago?\n\nNow, Americans may never realize that this bill protected them from a  22 percent income tax increase that was set to take effect on January  1. A family making $75,000 a year won't feel its taxes rise $1,500, so  it won't feel…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693629/democrats-big-mistake"}]