[{"senator": "Al Green", "party": "Democrat", "sentence": "…concentration of power in a leader or an elite not  constitutionally responsible to the people.''\n\nI am among those who have pointed out President Trump's failure to  preserve, protect, and defend the Constitution by flouting  constitutional law, as well as the orders of Federal courts, including  the Supreme Court of the United States of America.\n\nI am among…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691346/proud-to-be-an-unbought-unbossed-liberated-democrat"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…urge every Oregonian watching to hold me accountable in a shared,  unshakable belief in the sanctity of human life. We are our brother's  keeper. I will do all I can to protect and defend each person's right  to freedom, safety, and self-determination.", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697114/genocide-in-gaza"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "Ms. KAPTUR. Mr. Speaker, I rise today to sound the alarm for our  Republic and our Constitution.\n\nEvery one of us here in Congress swore a solemn oath to protect and  defend our Constitution against all enemies foreign and domestic. We  did not give any President a blank check for war.\n\nPresident Trump is over his skis. Article I of our…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697914/venezuelan-strikes-and-congressional-war-powers"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…John Trump, in violation of his constitutional oath to  faithfully execute the office of the President of the United States  and, to the best of his ability, preserve, protect, and defend the  Constitution of the United States, and in violation of his  constitutional duty to take care that the laws be faithfully executed,  has unfaithfully, dangerously,…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697872/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…of these United States. That means that he may have to do a  little bit of research and decide that he wants to understand that he  swore an oath, and this oath was to protect and defend the  Constitution. That is the oath that he was supposedly taking on January  20.\n\nWe may want as well that the President look into what the Declaration  of Independence…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690636/trumps-first-100-days"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…people's  House.\n\nRepublicans must also stand up to their billionaire bosses and do  what is right, what they were elected to do: represent their  constituents. We must protect and defend the federally funded social  programs and services that the American people rely on.\n\nMr. Speaker, I will yield to my colleagues who will share about the  programs and…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689781/defending-social-services-and-programs"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…that, and they are afraid it is  not going to get better.\n\nWe answer to our constituents. When we all took our oath of office,  we took an oath of office to preserve, protect, and defend the  Constitution of the United States and to do our jobs to the best of our  ability.\n\nWhen we see people who are hurting and we have the ability to help,  our job--or…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695041/better-is-possible"}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "…on Greenland.\n\nI have told you I worked in Afghanistan. I worked on a NATO military  base alongside military servicemembers from Denmark who were there to  be able to protect and defend us with the work we do. I was there as  part of that NATO mission that was part of the article 5 response that  was about protecting the United States and supporting…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698621/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…they try to  shutter the CFPB, every day, we are fighting, whether it is at agency  headquarters or in the court.\n\nAs Members of Congress, we have the serious duty to protect and  defend the American public. Since the Republican majority refuses to do  its job, I am determined to shed light on these critical issues.\n\nNow, I will move from the Consumer…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…That is conducting unlawful military  operations in service of regime change and threatening further actions,  including troops on the ground.\n\nOur military is meant to protect and defend our homeland and our  citizens, not carry out actions against them. It must be governed by  the rule of law, not undermine it. I am opposing the NDAA because we  must…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698254/nominations"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…crazy, but I think if we abdicate that power, we are not only  doing a disservice to the people we represent but we are violating our  sacred oath of office, our oath to protect and defend the Constitution  of the United States.\n\nThe last time I brought up this resolution, I was told it was  premature because there had been no strikes in Venezuela. Let…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699359/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…democracy. He has done things that would cause us to  conclude, those of us who have observed closely, that he disrespects  the Constitution. He took an oath to preserve, protect, and defend the  Constitution. He disrespects the Constitution.\n\nHe disrespects the notion that a person should have the right to say:  You have the wrong person; and to say to…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690862/and-still-i-rise-impeaching-president-trump"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…right of schoolchildren to  learn without fear of being shot, and defending government of the  people, by the people, and for the people.\n\nI have taken many oaths to protect and defend our country and our  Constitution, first as a soldier and now as a Member of Congress.\n\nI often think back to the start of my service to this Nation as a  young paratrooper…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695733/why-i-came-to-congress"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…States,  and in violation of his constitutional oath to faithfully execute the  Office of the President of the United States and to the best of his  ability preserve, protect, and defend the Constitution of the United  States, and in violation of his constitutional duty to take care that  the laws be faithfully executed, Donald John Trump has abused…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691079/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…the United  States Air Force on this national Women Veterans Day to tell Secretary  Hegseth and President Trump that women who raise their hand and swear  an oath to protect and defend this Nation are not going anywhere and we  will not be silent.\n\nFrom the earliest days of our Nation, women have always served, both  officially and unofficially, facing…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692563/women-in-the-military"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…still missing and remain unaccounted for from World War II, the Korean  War, the Vietnam War, the Cold War, and the Gulf wars.\n\nOur servicemembers answered the call to protect and defend our  country in times of war and in times of peace. We have a sacred compact  with the men and women who serve, and we will never stop searching for  the ones who remain…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695819/national-powmia-recognition-day"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…officers, along with thousands of others across the country,  deserve not only our gratitude but our unwavering support. May God  bless them, their families, and all who protect and defend our  communities.\n\nMr. MOORE of Utah. Mr. Speaker, I thank the gentleman from Florida.\n\nHe took over for a good friend of mine. We  have a very common district. I represent…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691166/events-this-week"}]