[{"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…supervision for low-level youth  offenders, which has led to a significant reduction in the state-level  committed population and millions of dollars in cost savings while  protecting public safety. Juvenile arrests in Texas dropped by 27  percent between 2007 and 2011 following these changes.\n\nSimilarly, in Utah, Republican Governor Gary Herbert signed a…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695783/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…that? After all, it is  our responsibility. It is our job. Are they afraid that if it comes to  the floor for a vote, they will lose?\n\nThen we get a bunch of bills about protecting public schools. Give me  a break. My sisters are public school teachers. I talk to parents and  students all the time. What do they tell me? We need to reduce class  size, support…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697303/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…Federal baseline. For 50 years, both Democrat and Republican  administrations have granted these Clean Air Act waivers that are  essential for reducing toxic air pollution, protecting public health,  and cutting greenhouse gas emissions that dangerously warm our planet.  No Congress has ever dared to revoke these waivers--until now.\n\nMy Republican colleagues…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691549/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Jim Costa", "party": "Democrat", "sentence": "…my colleagues to join me in supporting legislation that I have  introduced from the House committee recommendations. They are the  Preventing Illegal Laboratories and Protecting Public Health Act and  the STOP Health Threats Act.\n\nMany of us became aware of this issue in the San Joaquin Valley in  2023 when an illegal biolab was discovered operating…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699754/stopping-unregulated-biological-laboratories"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…regulations were all going to destroy  whatever clean air or clean water we have.\n\nInstead, they are worried about the next time we have a President who  actually cares about protecting public health and the environment, a  President who wants to restore the bedrock environmental laws that the  Republicans have gotten rid of.\n\nRepublicans then want to use this…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698275/reliable-power-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…opportunities and services to help justice- involved individuals contribute to society, while holding them  accountable for their actions. They remain mindful of their role in  protecting public safety.\n\nIn honor of Pretrial, Probation and Parole Supervision Week 2025,  whose theme is ``Heroes Behind the Mission: Transforming Lives,  Enhancing Public Safety,''…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693630/recognizing-the-nations-community-supervision-professionals"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…regular check-ins,       targeted social-service referrals, and text message reminders       consistently outperforms cash bail systems at securing       appearance and protecting public safety. Maintaining housing,       employment, child-care, and medical care substantially       reduces recidivism and promotes community safety. D.C.'s       current…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696949/opposition-letter-led-by-the-american-civil-liberties-union-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…the line every day when they went  to work. I will happily work with my Republican colleagues to defend  police and firefighters and make sure not to defund them by protecting  their public pensions, collective bargaining rights, cancer prevention,  training grants, and grants to our local police departments that are  now being frozen, putting us in limbo.…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693929/law-enforcement-officer-and-firefighter-recreation-pass-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…grown by about 70 percent in the last  few years.\n\nBy applying the Secure and Trusted framework to the satellite  industry, we will take another crucial step toward protecting the  public from untrusted entities and our foreign adversaries. The  requirements in this legislation will not only benefit our Nation but  will also help further the United States'…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690258/secure-space-act-of-2025"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…that are in this one big, ugly bill  were dismissed out of hand.\n\nAmendments introduced by Ranking Member Huffman, Andrea Salinas,   Dave Min, Emily Randall, and others protecting public lands were  dismissed out of hand.\n\nAmendments on energy introduced by Members like Luz Rivas were  dismissed out of hand.\n\nI think I will end this portion of my presentation--Mr.…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…multibillion-      dollar for-profit bail industry, all without improving public       safety.      Money bail creates a two-tiered system of justice without           protecting public safety\n\nMoney bail has created a two-tiered justice system--one       that privileges wealth over safety. It allows people with       money to purchase their freedom…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696985/opposition-letter-by-the-southern-poverty-law-center-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…critical programs and offices just puts millions of lives battling  substance abuse in jeopardy.\n\nMr. Speaker, I wish my colleagues would spend time on these issues of  protecting public health and coming up with solutions instead of  retreading a bill that prioritizes this criminal justice approach,  which I think doesn't work.\n\nMr. Speaker, we had this…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692341/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…into our communities. We advance American  strength by unleashing energy dominance, securing critical minerals,  and investing in nuclear power. We uphold stewardship by protecting  public lands, supporting wildland firefighters, ensuring responsible  resource management, and fulfilling our obligations to our Tribal  nations.\n\nAll of this is achieved while…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698749/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…distribution.  Now let's deal with the things in the tax code that add bureaucracy and  costs. If we both support the fact that these should be in the hands of  people protecting our public, then let's remove some of the bureaucracy  that makes it more expensive.", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700037/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…believe we can come together  around a set of reforms that will advance and focus the mission of  Immigration and Customs Enforcement while protecting our officers and  protecting the public.\n\nHowever, such reforms must go hand in hand with a commitment to stop  jurisdictions like Minnesota and California from releasing dangerous,  wanted individuals as…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699574/consolidated-appropriations-act-2026"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…plan       following its determination that the 2020 Record of Decision       was inconsistent with the policy direction set forth in       Executive Order No. 13990, Protecting Public Health and the       Environment and Restoring Science to Tackle the Climate       Crisis, issued on January 20, 2021. The ROD states that the       adopted plan better…", "date": "2025-07-28", "source_url": "https://justfacts.votesmart.org/public-statement/1694269/us-government-accountability-office-legal-opinion"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…of the  Members to vote for it.\n\nMr. HARRIS of North Carolina. Mr. Speaker, a little over 1 year ago,  four law enforcement heroes in North Carolina lost their lives  protecting the public from an armed and highly dangerous felon. They  showed up to work that morning like it was just another day. They gave  the ultimate sacrifice for the Charlotte, North…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691319/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Eric Burlison", "party": "Republican", "sentence": "…serving the people of southwest Missouri.\n\nDeputy Ramirez was murdered during a traffic stop while doing what  law enforcement officers across this country do every day: protecting  the public and enforcing the law.\n\nHe was a United States Army veteran who continued his service at  home, serving nearly 1 year as a deputy.\n\nWhat followed was a dangerous manhunt…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700214/moment-of-silence-for-deputies-michael-hislope-and-gabriel-ramirez"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…to the events that occurred last month in Los Angeles, which  explains that Federal agents were conducting immigration enforcement,  according to the law.\n\nMr. Speaker, protecting public safety should not be controversial.  This resolution is very simple. It recognizes a right to assemble and  protest peacefully, and it condemns unequivocally the violence…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693138/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Representatives Costa and Valadao,  to find any other such labs that exist across the country and assure  that they are shut down.\n\nThe Preventing Illegal Laboratories and Protecting Public Health Act  would address gaps in Federal law outlined in this Congressional  report.\n\nSpecifically, it would require distributors of highly pathogenic  agents to maintain…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699473/illegal-bio-lab-in-las-vegas"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…scientific developments;\n\n(3) access to human cell and tissue products regulated       under section 361 of the Public Health Service Act (42 U.S.C.       264); and\n\n(4) protecting public health.\n\nMr. Speaker, I rise today in strong support of H.R. 1082, the Shandra  Eisenga Human Cell and Tissue Product Safety Act, led by my good friend  Chairman Moolenaar…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692768/shandra-eisenga-human-cell-and-tissue-product-safety-act"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…protect our communities can enjoy free access to  our Nation's most treasured public lands.\n\nLaw enforcement officers and firefighters also play a critical role  in protecting our public lands by responding to wildland fires,  conducting search and rescue operations, responding to criminal  activity, and preventing vandalism and resource destruction.…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693931/law-enforcement-officer-and-firefighter-recreation-pass-act"}]