[{"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…from affecting human communities is  patently wrong and inaccurate. The reality is that the Federal  Government should be spending its scarce resources to focus on  protecting communities closer to roads because that is where the  people, homes, and towns are.\n\nCan I talk for just a minute about the economics of building roads in  roadless areas? The…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695667/cloture-motion"}, {"senator": "Ami Bera", "party": "Democrat", "sentence": "…District and the  Sacramento County Fire Protection District reorganized to form what we  now know as Metro Fire, uniting 16 fire agencies into one force  dedicated to protecting our communities.\n\nToday, Metro Fire serves more than 720,000 people across 359 square  miles. With 41 fire stations and more than 700 dedicated members, they  stand ready around…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700044/recognizing-sacramento-metropolitan-fire-district"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…celebrate the progress made over the past hundred years and  look ahead to its future. I extend my sincere gratitude to our Federal  probation workers for dutifully protecting the communities they serve  and for their commitment to promoting the fair administration of  justice. As we mark this important anniversary, let us reaffirm our  commitment to a…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688716/centennial-of-the-probation-act-of-1925"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…democracy and existence.\n\nAs the Trump administration seeks to continue to take our country  back in time, the Congressional Black Caucus stands at the front lines  of protecting our communities and calling out these and other thinly  veiled attempts to erase centuries of progress for Black America.\n\nThis administration's recent actions aimed at taking away…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687900/black-history-month"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…veteran, I understand the mission  that our men and women in uniform take on every day. They serve knowing  that their work is bigger than any one person. It is about protecting  our communities and upholding the law for our families and loved ones.\n\nMr. Speaker, today, I thank the brave law enforcement officers of  Spotsylvania and Fredericksburg and all…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691301/commending-virginias-seventh-district-law-enforcement-officers-for-their-bravery"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…also must provide local and Federal law enforcement with the  resources they need to fight against the highly armed cartels.\n\nThese Agencies are on the frontlines protecting our communities from  fentanyl and other opioids. But detection is getting more difficult.  Fentanyl is so potent and moved in quantities so small that high-value  shipments are…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688848/halt-fentanyl-act"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…projects in the long-term save  $6 for every $1 in upfront spending.\n\nYet, on this Earth Day, and just before we are about to enter  hurricane season, instead of protecting our communities from sea level  rise, the Trump administration ended this program.\n\nWhen we talk about government cuts to environmental programs, I will  caution that rising seas…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690467/cuts-to-fema-bric-grants"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…the  additional support that they need to remain physically and mentally  safe.\n\nFederal law enforcement officers dedicate themselves to protecting  our Nation, to protecting our communities, and it is our responsibility  in this body to ensure that they receive the protection that they  deserve.\n\nLaw enforcement officers face unparalleled risks every…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691321/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…partisan politics  into research, censoring scientists, punishing experts, and pulling  funding from projects that challenge their narrow ideology. They don't  care about protecting communities from the climate disaster, and we are  going to continue to write checks for disaster aid if we continue this  ignoring of climate change.\n\nThey don't care about preventing…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691396/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…single day and are staunchly opposed because the people  targeted are an inseparable part of the fabric of their communities.\n\nMinnesotans are fiercely dedicated to protecting their communities.  They see themselves in their neighbor--not because of a shared language  or a shared place of birth but because they hold steadfast to their  shared humanity and…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699669/horrific-ice-abuses"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…Act of  1965, and passing the Freedom to Vote Act.\n\nThis is not a partisan issue; this is an American issue about  protecting our democracy, protecting our people, protecting our  communities, and protecting our planet.\n\nMr. Speaker, let's do the right thing. Let's ban stock trading and  restore our faith in American democracy.", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691225/stock-trading-ban-for-members-of-congress"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "…engagement.\n\nMy bill ensures that the Urban Area Security Initiative and the State  Homeland Security Program grants are responsive to local needs and  truly effective in protecting our communities.\n\nThe coordination between local, State, and Federal Government is all  the more important as we face increasing threats to our homeland, and  this bill would help…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696945/enhancing-stakeholder-support-and-outreach-for-preparedness-grants-act"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…Florida. Mr. Speaker, diamonds are rare and among the  most sought-after treasures in the world--but so are police officers.  Their courage, dedication, and commitment to protecting communities  make them priceless. Unlike diamonds, their shine comes not from the  way they reflect light, but from the way they reflect honor, integrity,  and sacrifice every…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690845/recognizing-clay-county-police-memorial-day-and-law-enforcement-appreciation-week"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…can never be allowed to happen again, regardless of which party  controls the executive branch. While we have a President who is  committed to securing our borders, protecting our communities, and  restoring the enforcement of our immigration laws, now is the time to  act.\n\nMr. McCLINTOCK. Madam Speaker, the gentleman says that the bill is  unnecessary…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697237/no-immigration-benefits-for-hamas-terrorists-act-of-2025"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…resolution is prudent.  President Trump must be given the leeway to negotiate on a global scale  parameters that will make good on his promises of securing the border,  protecting our communities, and leveling the global playing field to  ensure fair trade for American producers.\n\nMs. FOXX. Mr. Speaker, I do have some other Members who wanted to  come down…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689862/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…and retired  law enforcement officers the ability to conceal carry firearms where it  may normally be restricted.\n\nOur law enforcement officers are committed to protecting their  communities and their fellow citizens, and they receive rigorous  training throughout their careers. By allowing these brave men and  women the opportunity to conceal carry…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1690998/delivering-on-president-trumps-agenda"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…Paso County, my county, is not a sanctuary  jurisdiction. Despite the policies from Denver, we are committed to  working with Federal immigration authorities and protecting our  communities.\n\nMr. Speaker, I thank Chairman Williams and his staff for working with  me and working with my county. El Paso County is ready and willing to  host the SBA office.…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692103/save-sba-from-sanctuary-cities-act-of-2025"}, {"senator": "Rick Scott", "party": "Republican", "sentence": "…political points by attacking President Trump. President Trump  and Republicans are working to deliver on our promises to the American  people: securing our border, protecting communities and elections, and  bringing down the cost of living despite Democrats fighting us on every  turn.\n\nMr. SCOTT of Florida. If my colleague from western Massachusetts…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700025/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "…equipment  for our servicemembers, empowering them to disrupt the cartels and  criminal networks fueling this epidemic.\n\nThe National Guard is on the front lines of protecting our  communities, and this investment will ensure they have the tools to  stop these lethal drugs before they reach our streets.\n\nMy second amendment redirects $2 million of wasteful…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693651/department-of-defense-appropriations-act-2026"}, {"senator": "Neal Dunn", "party": "Republican", "sentence": "…Floridian who demonstrates  the best that our state has to offer. Deputy May's courageous actions  underscore the dangers that law enforcement faces every day while  protecting our communities. I believe I can speak on behalf of the  constituents of Florida's second congressional district in saying that  we are deeply moved by Deputy May's sacrifice in…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689979/mourning-the-loss-of-walton-countys-sheriff-deputy-william-will-paul-thomas-may"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…in honor of National  Police Week 2025, I recognize Detective Dan Heaton of the Sacramento  County Sheriff's Office for his unwavering commitment to serving and  protecting the communities of Sacramento, California.\n\nDetective Heaton began his career with the Sacramento County  Sheriff's Office in 2014. He spent 2 years in corrections before moving…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…the New York State Assembly and the  Department of Environmental Protection.\n\nAs Robi retires from her role, I am proud to recognize her unwavering  commitment to protecting our communities. Having worked with her in  County Executive Astorino's administration, I am deeply grateful for  her public service and her friendship. I wish her all the best in…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699731/recognizing-extraordinary-service-of-cardinal-timothy-dolan"}]