[{"senator": "Andrea Salinas", "party": "Democrat", "sentence": "…students who can help guide  them through activities, as well as special equipment and necessary  modifications, like shorter hoops for athletes using wheelchairs.\n\nI am so proud of the students and faculty at West for their  dedication to ensuring that every one of their peers can participate  and make friends through sports, regardless of their abilities.…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689229/recognizing-west-salem-highs-inclusive-sports-programs"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…markets can do is provide capital for  growing American enterprise, particularly small- and medium-sized  businesses.\n\nBusiness Development Companies play a vital role, and I am proud to  work with a bipartisan group of Members. As I pointed out earlier, we  have a substantial number of cosponsors, 25 in all, including 13  Democrats on the Committee.\n\nWe…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692711/access-to-small-business-investor-capital-act"}, {"senator": "Henry Cuellar", "party": "Democrat", "sentence": "…is a cultural  cornerstone. From the Washington's Birthday Celebration, one of the  oldest and largest of its kind in the country, to our strong  educational institutions and proud neighborhoods, Laredo remains rooted  in tradition while embracing innovation and growth.\n\nMr. Speaker, Laredo is a city of hardworking families, a city rich in  heritage,…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691267/recognizing-the-270th-birthday-of-laredo-texas"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…Pennsylvania, alone employed 30,000 people.  Manufacturing is still the biggest industry in the Lehigh Valley, with  investment booming in recent years. At the same time, leaders are proud  that they managed to diversify their economy after Bethlehem Steel  collapsed decades ago.\n\n``Brian Higgins, a longtime Republican commissioner in Lower Macungie  Township,…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…Awareness Day.\n\nNKH is a rare genetic disorder, and there are only 500 kids in the  world living with it, four of them calling the Commonwealth of Virginia  home.\n\nToday, I am proud to be joined by one of these incredible kids, my  constituent Luka, and his family.\n\nJackie and her dad, Eddy, are also important advocates in Virginia  dealing with this disease.…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690619/recognizing-nkh-awareness-day"}, {"senator": "Laura Gillen", "party": "Democrat", "sentence": "…Secretary Duffy testified before the  Transportation and Infrastructure Committee earlier this year, I asked  him to work with Congress to fully implement this lifesaving law. I am  proud to say that thanks to my questioning, Secretary Duffy publicly  committed to implement this law and help save lives.\n\nMr. Chair, I am happy to work with the gentlemen on the…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699283/amendment-no-1-offered-by-mr-massie"}, {"senator": "Joaquin Castro", "party": "Democrat", "sentence": "…by  communities in San Antonio and South Texas. Through cutting edge- research, the new generation of public health workers will drive our  nation forward.\n\nMr. Speaker, I am proud to recognize and bring attention to this  special celebration.", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689417/recognizing-national-public-health-week-and-the-ut-school-of-public-health-san-antonio"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…Congratulating Madison Whitbeck\n\nMr. SUBRAMANYAM. Mr. Speaker, congratulations to former Ms. Loudoun  County, now Ms. Virginia, Madison Whitbeck.\n\nMadison is a proud graduate of Riverside High School in Loudoun  County where she cultivated a love for the arts. Madison will spend the  year traveling to over 70 elementary schools, teaching…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693568/congratulating-military-academy-appointees"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…Norm Van Lier. Mickey Johnson lives in the same  neighborhood as I do. Scottie Pippen and Bob Love both grew up in rural  America near where I grew up, and we are extremely proud of their  accomplishments. Scottie was born in Arkansas, and Bob was born in  Louisiana.\n\nCongratulations to Derrick Rose, who is also actively involved in  community affairs…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699336/congratulating-derrick-rose"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…that came before it, Vince is  a shining example of why Ohio's 13th Congressional District is known as  the ``Birthplace of Champions.'' He has certainly made our community  proud.", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696703/recognizing-vince-marchetta-as-the-champion-of-the-week-for-ohios-13th-congressional-district"}, {"senator": "Jimmy Panetta", "party": "Democrat", "sentence": "…community.\n\nWith encouragement from their parents, Amy and Kevin, Bryce is  furthering our democracy by stepping up and speaking up. As Bryce said:  ``We will be loud. We will be proud--for our rights, for our families,  and for our LGBTQ community.''\n\nMr. Speaker, the actions of Bryce and all students and allies on the  Day of Silence demonstrate that our…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690886/commending-leadership-of-bryce-grossman"}, {"senator": "Ami Bera", "party": "Democrat", "sentence": "…and pride show up in every setting. Last year, Station  26 took first place in the inaugural HERO Act Chili Cookoff that my  office hosted at the California State Fair. I was proud to visit the  station to present ribbons to Captain Adam Huckaby and Firefighter  Taylor Edwards.\n\nAs we celebrate this milestone, we also have a responsibility to  support…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700044/recognizing-sacramento-metropolitan-fire-district"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…penny-wage nations. It is slave labor, really, where people make  hardly anything, if $1 an hour, maybe $2 an hour, competing against a  First World economy like ours.\n\nAs the proud daughter of union workers, I know that the road to  rebuilding American manufacturing runs straight through our heartland,  through the working class, the people who work hard,…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690052/trump-tariffs"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…management, we should look at this resource in a larger sense, in my  view, as somebody who has represented the delta for decades.\n\nThe San Francisco Bay-Delta Estuary, which I am proud to represent a  significant part of, provides economic benefits to the entire State of  California and, as the chairman said, to larger areas of the West Coast  and the country…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690598/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt"}, {"senator": "Rob Menendez", "party": "Democrat", "sentence": "…speaking up for them? If we say nothing, then  what does that say about us?\n\nThis can't be what we stand for as a country. As a grandson of  immigrants and the Representative of a proud immigrant community, it is  something that I will always fight against.                GOP Attempting to Undermine Separation of Powers\n\nMr. MENENDEZ. Mr. Speaker, in recent…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689390/president-trumps-immigration-enforcement-policies"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…long.\n\nMr. Speaker, it is time to put the interests of the American worker,  the small business owner, and the retiree ahead of the interests of  Washington bureaucrats. I am proud to support this rule, and I am glad  that I was able to speak about the rule and about the  bills, instead of talking points. I urge my colleagues to do the same.\n\nThe material…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698949/providing-for-consideration-of-hr-protecting-prudent-investment-of-retirement-savings-act-providing-for-consideration-of-hr-flexibility-for-workers-education-act-providing-for-consideration-of-hr-empowering-employer-child-and-elder-care-solutions-act-providing-for-consideration-of-hr-tipped-employee-protection-act-and-providing-for-consideration-of-hr-save-local-business-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "Mr. GUTHRIE. Mr. Speaker, I am proud to have supported the 2026  National Defense Authorization Act. This bill is a generational  investment in our national defense.\n\nHouse Republicans, alongside President Trump,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695348/ndaa-restores-peace-through-strength"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…Committee on Energy and Commerce, one of my  top priorities is ensuring that America has the energy needed to win  the race for AI against China and power our future.\n\nI am proud to report that the One Big Beautiful Bill Act unleashes  American energy dominance through strategic investments and eliminating  wasteful subsidies. Our bill begins to refill…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694788/promises-made-promises-kept"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…is good. These are important debates that  we should have. But, today, I rise because I want to speak about the  past.\n\nI am speaking as an American but, in particular, as a proud  Missourian, a boy from Bridgeton. My folks--they weren't wealthy. My  grandfather was an infantryman in World War II and returned from the  war with an eighth grade education…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690533/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "John Boozman", "party": "Republican", "sentence": "Mr. BOOZMAN. Mr. President, I am proud to join my colleagues in  emphasizing the importance of whole milk in a healthy school lunch and  taking Senate action to ensure a balanced diet for school-age children.\n\nI…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697061/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "John Carter", "party": "Republican", "sentence": "Mr. CARTER of Texas. Mr. Speaker, I am proud to honor Lt. Col. Jeff  Davison, U.S. Air Force, Retired, with a Congressional Veteran  Commendation. Over his two-decade long career in the Air Force, he  embodied the courage,…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689349/saluting-the-service-of-lieutenant-colonel-jeff-davison"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "Mr. EVANS of Colorado. Madam Speaker, I am proud to stand here today  in strong support of my bill, the State Planning for Reliability and  Affordability Act, to help drive down the cost of energy for Coloradans  and Americans.…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697881/state-planning-for-reliability-and-affordability-act"}, {"senator": "John Carter", "party": "Republican", "sentence": "Mr. CARTER of Texas. Mr. Speaker, I am proud to award Master Sergeant  Duane C. Bygum, Jr., USMC and USAF, Retired, with a Congressional  Veteran Commendation. His unwavering commitment to our country and  community is…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689326/saluting-the-service-of-master-sergeant-duane-c-bygum-jr"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "Ms. BOEBERT. Mr. Speaker, I thank the chairman so much for yielding.  Mr. Comer has been an amazing advocate in helping get this bill over  the line once again. I am proud to stand here today and explain why  this piece of legislation is so important.\n\nI rise with a deep sense of purpose and conviction to advocate for  the passage of H.R. 3095,…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693904/single-unique-zip-codes-for-certain-communities"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "Mr. OWENS. Mr. Speaker, I am proud to recognize Utah's State Teacher  of the Year, Sayre Posey, an outstanding educator who embodies the  mission of the Merit Caucus: excellence, innovation, and high  expectations.…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692425/sayre-posey-utahs-state-teacher-of-the-year"}, {"senator": "Claudia Tenney", "party": "Republican", "sentence": "…Colonel Swain's lifelong commitment from cadet to congressional  liaison made Civil Air Patrol stronger, more visible, and better  equipped to serve the Nation.\n\nI have been proud to work with Colonel Swain to fight for Civil Air  Patrol funding throughout my time in Congress and thank him for his  service.\n\nI am also thankful that my son, Trey, who…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693663/recognizing-colonel-john-peyton-swain"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…in my district was ranked among the top  VAs in the Nation for many years in a row. That is something we  certainly take pride in and something this bill supports.\n\nI am also proud to represent Fort Indiantown Gap, the second largest  Army helicopter training facility in the U.S. In total, the Gap trains  more than 130,000 military personnel each year.…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692937/american-economy-gaining-momentum"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…are  where we are. But now these bills are going to be going to the  President for his signature.\n\nTwo of the bills we just passed are important for Alaska Natives, and  I am proud to have been able to work on these important measures. It  has been a multiyear effort to get them to the President's desk. Again,  I don't care, really, if we send an H.R.…", "date": "2025-06-18", "source_url": "https://justfacts.votesmart.org/public-statement/1692655/salem-maritime-national-historical-park-redesignation-and-boundary-study-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…alongside. My team is stronger  today because of his judgment and the example his work ethic sets for  the rest of my team. He has not only been my most trusted adviser, but  I am proud to also call him a true friend.\n\nMark began working in the House of Representatives just over 20 years  ago for his hometown Congresswoman, Ms. Nancy Johnson, from  Connecticut.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699705/historic-tax-relief-for-families"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…challenging  moments a person or community can face. I can say with certainty that  these professionals are heroes in every sense of the word.\n\nHere in Pennsylvania, we are especially proud to recognize one of our  own. Chief Fred Ferguson of Moshannon Valley Emergency Medical Services  was recently named the recipient of the 2025 Pennsylvania EMS Educator  of…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691586/recognizing-national-ems-week"}]