[{"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…wanting to take us back to that history that I thought we had gotten  beyond.\n\nI am proud to pledge allegiance to the flag of the United States of  America, but I am also proud to work in this body with people whose  backgrounds are different from mine, trying to find common ground and  how we can make what this country is all about accessible and  affordable…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689638/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Grace Meng", "party": "Democrat", "sentence": "…but not least, every single one of the extreme, partisan policy  riders contained in the previous House CJS bill has been removed from  the bill before us today.\n\nI am proud of the work we have done in this bipartisan package. I  thank Chairman   Tom Cole and his team, and our subcommittee Chairman  Hal Rogers and his team, for their cooperation. I thank…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698751/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…Affairs requested this change, which has  bipartisan support and incurs no cost. I thank Mr. Davis for his work  on veterans' issues during his time in Congress. I am proud of his work  to open doors at the VA for more veterans so they may access the  benefits they have earned through their service.\n\nMr. TAKANO.  2625.\n\nMr. DAVIS of North Carolina.…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693934/veterans-employment-readiness-yield-act-of-2025"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Government           Reform, Washington, DC.\n\nDear Chairman Comer and Ranking Member Garcia: As Mayor and       Chief Executive Officer of the District of Columbia, I am       proud of the work we have accomplished to invest in our       people, strengthen our neighborhoods, and drive down crime.       Building on this progress, my Administration established…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695596/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…Vietnamese  Americans have become an integral part of our community, from public  service and the arts to groundbreaking work in science, business, and  education.\n\nI am proud of the work being done to support Vietnamese refugees  right here in Virginia.\n\nOne example is Boat People SOS, an organization founded to help  Vietnamese refugees. They have rescued…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690520/election-integrity"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…people of Wisconsin deserve to have qualified, experienced, impartial judges working for them – and I am confident that’s just what we will get with Byron Conway. I was proud to work with Senator Johnson to stand up our bipartisan nominating commission and earn the support from both Democrats and Republicans alike in the Senate. Byron Conway has a proven…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1681935/senate-confirms-baldwin-johnson-nominee-for-us-district-court-for-the-eastern-district-of-wisconsin"}, {"senator": "Darren Soto", "party": "Democrat", "sentence": "…the Pulse nightclub, a safe place for  the LGBTQ community located just south of downtown Orlando. At the  time, it was the deadliest mass shooting in U.S. history.\n\nI was proud to work on both sides of the aisle in June 2019 to  introduce the National Pulse Memorial. In June 2020, it passed the  House but did not pass the Senate. Finally, in June 2021,…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692469/moment-of-silence-in-memory-of-pulse-nightclub-victims"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…a squad car or a jail cell.\n\nBy investing in training, we protect our communities and ensure those  in crisis are met with highly trained law enforcement officers.\n\nI am proud to work along with Congresswoman Bice and our colleagues  to help our country become a safer, more healthy place for all.", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689347/help-our-country-become-a-safer-healthier-place-for-all"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Government           Reform, Washington, DC.\n\nDear Chairman Comer and Ranking Member Garcia: As Mayor and       Chief Executive Officer of the District of Columbia, I am       proud of the work we have accomplished to invest in our       people, strengthen our neighborhoods, and drive down crime.       Building on this progress, my Administration established…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695614/district-of-columbia-judicial-nominations-reform-act"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…congratulate the  gentlewoman from Ohio (Mrs. Sykes) on the success of her amendments in  the legislation. The National Defense Authorization Act is something  that I am proud to work on year-round on the Armed Services Committee.\n\nI give a lot of credit to Ranking Member Adam Smith, Chair   Mike  Rogers, and the members of the House Armed Services Committee…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697853/providing-for-consideration-of-hr-promoting-efficient-review-for-modern-infrastructure-today-act-providing-for-consideration-of-hr-increasing-investor-opportunities-act-providing-for-consideration-of-hr-electric-supply-chain-act-providing-for-consideration-of-hr-state-planning-for-reliability-and-affordability-act-providing-for-consideration-of-hr-improving-interagency-coordination-for-pipeline-reviews-act-providing-for-consideration-of-s-disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-and-for-other-purposes"}, {"senator": "Nikki Budzinski", "party": "Democrat", "sentence": "…time with  my office was cut short, these five individuals have shown an immense  desire to learn and serve others, regardless of the circumstance.\n\nBack in Illinois, I was proud to work with Keziah Gragg in my  Springfield Office and Addison Merritt and Ryan Miller in my Champaign  Office. Especially following a turbulent government shutdown, these  three…", "date": "2025-12-19", "source_url": "https://justfacts.votesmart.org/public-statement/1698463/recognizing-the-class-of-interns-for-their-service-to-illinois-13th-congressional-district"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…afford the  Trump administration greater leeway to abuse the budget process, which  they have shown an eagerness to do from the moment they took office.\n\nMr. Chairman, I am proud of the work that was done in a bipartisan  fashion to produce this funding package. I look forward to voting for  it, and I encourage my colleagues to vote for it.\n\nMs. DeLAURO.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699057/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…Their earnings have been hurt instead of boosting them. H.R.  2312 puts an end to this and shields workers from the misguided actions  of unelected bureaucrats.\n\nI am proud of the work my Republican colleagues and I have done this  Congress to implement policies like no tax on tips that let working  Americans and tipped workers keep more of what they…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698965/tipped-employee-protection-act"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…all Americans by  advancing this important legislation and putting energy policy in this  country back on track.\n\nAs a member of the Energy and Commerce Committee, I was proud to work  to advance this legislation to the House floor, and I look forward to  seeing it passed through Congress on the way to being signed into law  by President Trump.    Commemorating…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696753/improving-domestic-energy-market"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…cars to wounded veterans. A devoted  man of faith, he attends the Stonebriar Community Church in Frisco,  where he has led Bible study classes for over 33 years. I am proud of  the work Corbett has accomplished, and I wish him continued success for  many years to come.\n\nIt is an honor to bestow Corbett with the Patriot Award for his  exceptional service…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690167/recognizing-congressional-patriot-award-recipient-corbett-howard"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "…Speaker, this conference agreement reflects a responsible use of  taxpayer dollars while strengthening public safety, water security, and  critical infrastructure. I am proud of the work we have accomplished,  and I strongly urge my colleagues to support this package.", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698633/providing-for-consideration-of-hr-saving-homeowners-from-overregulation-with-exceptional-rinsing-act-providing-for-consideration-of-hr-affordable-housing-over-mandating-efficiency-standards-act-and-providing-for-consideration-of-hr-commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Claudia Tenney", "party": "Republican", "sentence": "…Colonel Swain's lifelong commitment from cadet to congressional  liaison made Civil Air Patrol stronger, more visible, and better  equipped to serve the Nation.\n\nI have been proud to work with Colonel Swain to fight for Civil Air  Patrol funding throughout my time in Congress and thank him for his  service.\n\nI am also thankful that my son, Trey, who now…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693663/recognizing-colonel-john-peyton-swain"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…instills. It is a moral  benchmark, one that teaches young people to serve their communities,  respect others, and become engaged, responsible citizens.\n\nThat is why I am proud of the work we are doing with the bipartisan  Congressional Scouting Caucus. This group exists to strengthen and  support Scouting programs across the country and to highlight the…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694209/recognizing-the-congressional-scouting-caucus"}, {"senator": "Laurel Lee", "party": "Republican", "sentence": "…elections workers across the country  and saw their commitment to ensuring strong elections.\n\nNow, as the chair of the House Administration Subcommittee on  Elections, I am proud to work alongside Chairman Steil to advance  policies that lead to stronger elections across our country.\n\nThese tools will help the States ensure their rolls are accurate and…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1689997/safeguard-american-voter-eligibility-act"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…Youth  Council for their outstanding performance this year. These students,  along with their families and those in their lives who support them,  should be incredibly proud of the work they have done.", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689362/recognizing-the-accomplishments-of-the-ninth-district-congressional-youth-council"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…has never happened before.\n\nWith respect to passing an America First agenda, the first step in  that was what we voted on last week, a budget reconciliation bill. I  was proud to work with our House Oversight and Government Reform  Committee as a major committee of jurisdiction on the budget  reconciliation bill. We pledged to come up with $50 billion…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688348/draining-the-swamp-in-order-to-put-america-first"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…capabilities of our military.\n\nMr. Speaker, as President Trump would say, the golden age is here. We  must continue to support our President as he leads this Nation forward.  I am proud to work with him to make America great again.", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699277/highlighting-republican-successes-in-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…concern for them? My great-great-grandfather was a Texas Ranger.  I was proud to be in the U.S. Attorney's Office, proud to be the first  assistant attorney general, and proud to work with law enforcement.\n\nDoes every member of law enforcement always get it right? No. They  are human beings. Do we have ways to go through and punish, rectify,  review,…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "…deserve attention when the spouse has passed.  Placing the OSA directly under the Secretary will help to recognize the  importance of this population.\n\nMr. Speaker, I was proud to work alongside Chairman Bost on this to  ensure survivors have a seat at the table.  I urge my colleagues to support and pass this commonsense legislation  again in the 119th…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689688/prioritizing-veterans-survivors-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…for his strong work and  commitment to election integrity and to working with us on this bill,  in particular, the SAVE Act. He has done an extraordinary job, and I am  proud to work with him and work with the rest of my colleagues on it.\n\nI am also proud to work with my friend, Cleta Mitchell, who had a  significant hand in what we are doing here.…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690006/safeguard-american-voter-eligibility-act"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "…economic creation.\n\nI appreciate these listen-and-learn opportunities with our local  small businesses and constituents. All policy is so very local.\n\nMr. Speaker, I am proud to work with businesses across Indiana's  Sixth District to bring business sense to Washington. The American  people expect results, and we must deliver.", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689234/all-policy-is-local"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…Colorado and all across the Nation.\n\nFirst and foremost, I extend my gratitude to the gentlewoman from  Illinois (Ms. Kelly) for helping to introduce this bill with me. I am  proud to work with her in a bipartisan fashion to advance this bill  first through the Energy and Commerce Committee and now onto the House  floor.\n\nIn Colorado alone, there are more…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692695/global-investment-in-american-jobs-act-of-2025"}]