[{"senator": "Robert Garcia", "party": "Democrat", "sentence": "…created a child tax credit and  expanded the earned income tax credit. These credits will significantly  reduce child poverty in D.C.\n\nD.C.'s act temporarily paused several provisions of Trump's larger  bill from applying to D.C.'s tax code. Now, H.J. Res. 142 will deprive  D.C. of $600 million in revenue over the next 4 years. This could force  D.C. to…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699683/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…include phasing out clean energy production and investment tax credits  and ending longstanding home energy efficiency tax credits.\n\nIf these aren't bad enough, they also add provisions to require the  accelerated sale of public lands for oil and gas drilling and to  rescind funding from the Greenhouse Gas Reduction Fund that protects  America from pollution…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691602/environmental-protections"}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "…refused to include a single amendment preventing a  Federal taxpayer bailout of the crypto industry.\n\nThat is what this bill does.\n\nAdditionally, this bill includes zero provisions to prevent the  President, who has a $620-million conflict of interest, from continuing  his ability to accept emoluments from foreign governments like Abu  Dhabi.\n\nMr. Speaker,…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693784/digital-asset-market-clarity-act-of-2025"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…pitchforks and added a provision to effectively  ban every insurance premium on every ACA exchange for covering  abortion.\n\nThis is catastrophic and even increases the anti-choice provisions in  the bill by a dramatic amount. It will mean that nearly one in seven  Americans who has been insured through ACA since 2014 will be subject  to this change.\n\nAnd while…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691671/budget-reconciliation"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…drags VA into  MAGA Republicans' culture war.\n\nThis bill contains numerous dangerous policy riders that hinder VA's  ability to serve all veterans. Especially harmful are provisions that  deny women veterans the full range of necessary medical care, including  necessary reproductive healthcare which includes abortion care and  counseling.\n\nOn top of…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692950/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…to homeownership, expedite  new construction, and lay the foundation for more cost-effective  housing developments across the Nation.\n\nThis legislation includes 25 housing provisions that were introduced  by Democrats and 12 banking provisions that passed our committee with  broad bipartisan support.\n\nTo support local lenders and access to financing,…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699803/housing-for-the-21st-century-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…the quality of life for everybody in this  country. That is not what this big, ugly bill is about.\n\nMr. Speaker, I have to say the Senate has actually made the Medicaid  provisions worse, if that was possible. Even more people will lose it.  That is not me saying it. It is the CBO, the Congressional Budget  Office, saying that. It is not  Jim McGovern…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692813/providing-for-consideration-of-hr-military-construction-veterans-affairs-and-related-agencies-appropriations-act-providing-for-consideration-of-hr-special-interest-alien-reporting-act-of-providing-for-consideration-of-hr-jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-and-providing-for-consideration-of-h-res-condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Doris Matsui", "party": "Democrat", "sentence": "…really a  basic right. Now, Republicans in this Chamber are doing everything they  can to roll back and repeal what is left of the Clean Water Act.\n\nAmong the many disastrous provisions in this bill, the PERMIT Act  would give President Trump the authority to declare any body of water  exempt from Clean Water Act protections. It is just a stunning betrayal…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698023/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Joaquin Castro", "party": "Democrat", "sentence": "…gap in U.S. law by ensuring the African Union's  observer  mission to the United Nations in New York receives the same recognition  as the AU itself.\n\nTaken together, these provisions make clear that the United States  values our partnerships and will invest in multilateral cooperation  that advances our interests and our American values.\n\nMr. Speaker,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694823/providing-appropriate-recognition-and-treatment-needed-to-enhance-relations-act"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…to H.R. 881, the DHS  Restrictions on Confucius Institutes and Chinese Entities of Concern  Act.\n\nH.R. 881 is a solution in search of a problem. In 2018, Congress  passed provisions prohibiting the Department of Defense from providing  funds to any U.S. institution of higher education that hosts a  Confucius Institute, unless that institution receives…", "date": "2025-05-09", "source_url": "https://justfacts.votesmart.org/public-statement/1690950/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…the  Lobbyist Loophole Closure Act with Representatives Mullin and Williams.\n\nThat bill addresses the loopholes created by the Lobbyist Disclosure  Act. The bill includes provisions to increase transparency and  accountability by broadening the definition of lobbying and by also  lowering the time threshold for registration.\n\nMr. Speaker, I will close…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699241/restoring-election-integrity"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…that re-exports and retransfers within the  geographic territory of the United States, the U.K., and Australia are  permitted under the previously exempted defense trade provisions.\n\nImportantly, it also preserves Congress' oversight authority and  continues to ensure the protection of the most sensitive technologies  that underpin our security.\n\nI…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694781/aukus-reform-for-military-optimization-and-review-act"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…in 1776 that the  Nation would need to always be on guard against tyranny.\n\nAnd in the formation of the Constitution--and my colleague has done a  great job of looking at provisions of the Constitution--we invested a  lot of power in the hands of an Executive, but then we put checks-- Congress, the courts, a free press. You shouldn't go to war without…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696334/trump-administration"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…it was really all about here,  about the Senate's sense that we should only drop to 60 votes for bills  that reduced the deficit.\n\nEmbedded in this were three fundamental provisions, three pillars of  the architecture of getting control of deficits and debt. The first was  that in the first 10 years that are presented in a reconciliation bill,  the sum…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693102/one-big-beautiful-bill"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…about weapons and strategy. It is about  people, and this bill, as currently written, does not prioritize the  needs of our people. Instead, it is laced with ideological provisions  drawn from Project 2025, prioritizing political ambition over the well- being of those who have dedicated their lives to serving this country.\n\nLet me be clear. Healthcare…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692954/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…as the weakest link, and right now, the CCP has a real tool to  sidestep these prohibitions. We need action now.\n\nMy bill defines ``remote access'' and adds remote access provisions  into existing law. It provides the Commerce Department with the  authority to regulate controlled items through the cloud and finally  close this loophole.\n\nThe Remote Access…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698857/remote-access-security-act"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…civil service protections for employees, what  exactly do Federal unions bargain over? They bargain over conditions of  employment like telework.\n\nUnions also seek contract provisions that limit management's ability  to hold employees accountable through disciplinary procedures or  performance management processes.\n\nI urge my colleagues to buck Federal…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697996/protect-americas-workforce-act"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…commitment to strengthening  America's engagement with our allies and partner organizations  worldwide by granting tailored immunities and privileges.\n\nOf note is the inclusion of provisions from the PARTNER Act with the  ASEAN Act and the Pacific Partnership Act, which together elevate U.S.  cooperation with our Indo-Pacific allies.\n\nThe Indo-Pacific is home…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694824/providing-appropriate-recognition-and-treatment-needed-to-enhance-relations-act"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…Riverside, and San Bernardino Counties.\n\nEarlier this Congress, I worked with President Trump to secure  historic SALT relief for Californians. That relief, combined with the  provisions in the Housing for the 21st Century Act, will bring the  dream of homeownership closer to reality for working families in my  district.\n\nFor far too long, working-class Americans…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699800/housing-for-the-21st-century-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…people's lives. It is a bipartisan bill.  Everything in it is bipartisan and has been discussed. I just encourage  my colleagues to vote for this bill, reauthorize these provisions,  fight to get them through the Senate, put them on the President's desk,  and then fight for their authorization through the appropriations  process, as well. I am committed…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691874/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Jim Justice, Jr.", "party": "Republican", "sentence": "…state.\n\nThe senior assistant legislative clerk read as follows:                               Cloture Motion\n\nWe, the undersigned Senators, in accordance with the       provisions of rule XXII of the Standing Rules of the Senate,       do hereby move to bring to a close debate on the nomination       of Executive Calendar No. 90, Brian Nesvik, of Wyoming,…", "date": "2025-08-01", "source_url": "https://justfacts.votesmart.org/public-statement/1694589/9999"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…commercial and government suborbital and orbital launch missions, as  well.\n\nAdditionally, H.R. 1368 requires the Secretary and the Administrator  to implement research security provisions consistent with the CHIPS and  Science Act of 2022. Given the transformational nature of these  emerging technologies and their impact on national security, this  language…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688986/doe-and-nasa-interagency-research-coordination-act"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…points of       order against consideration of the joint resolution are       waived. The joint resolution shall be considered as read. All       points of order against provisions in the joint resolution       are waived. The previous question shall be considered as       ordered on the joint resolution and on any amendment thereto       to final passage…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689703/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…will go a little less than 10 minutes, if  anybody is planning around it.\n\nMr. Speaker, I would like to talk a little bit about the big bill  that we just passed and some provisions that should be monitored as we  work our way not only through the big reconciliation bill but through  the appropriations bills, as well.\n\nFirst of all, I think it is important…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692064/monitoring-big-beautiful-bill-provisions"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…Committee on Foreign Affairs,      House of Representatives, Washington, DC.\n\nDear Chairman Mast: I write regarding H.R. 747, the Stop       Chinese Fentanyl Act of 2025. Provisions of this bill fall       within the Judiciary Committee's Rule X jurisdiction, and I       appreciate that you consulted with us on those provisions.       The Judiciary Committee…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694826/stop-chinese-fentanyl-act-of-2025"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…incomes at or above 400 percent of the       federal poverty level. Public Law 117-169--commonly known       as the Inflation Reduction Act of 2022--extended these       provisions through the end of tax year 2025. See table 1.\n\nIn 2013, CMS developed the Data Services Hub (Hub) to help       verify applicant eligibility in an automated manner. To do…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698381/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…acres of land.\n\nAlaska is crucial to our national security and economic prosperity.  In 2020, President Trump announced a draft RMP for the central Yukon  that, among other provisions, revoked Public Land Order 5150 and  unleashed American energy.\n\nFor more than a decade, the State of Alaska has worked on this RMP to  revoke Public Land Order 5150, which…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694898/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Steve Daines", "party": "Republican", "sentence": "…concluded that       four RMPs issued by BLM prescribed policy by establishing       available uses for the areas that each RMP covered. We noted       that each RMP implemented provisions of FLPMA and other       applicable statutory and regulatory provisions.\\38\\ The same       can be said of the Miles City RMPA at issue here. The Miles       City RMPA implements…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693085/us-government-accountability-office-legal-opinion"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…in rural America. These are just a few of the reasons Americans will  see significant increases in their upcoming tax returns.\n\nMr. Speaker, that doesn't even include the provisions that strengthen  small business and encourage investment in American industry.\n\nThis year, House Republicans are keeping more hard-earned dollars in  working families' pockets,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699064/how-republicans-have-delivered-for-americans"}, {"senator": "French Hill", "party": "Republican", "sentence": "…determine the appropriate scope for rezoning and ensure       development that does not disproportionately burden residents       of economically distressed areas;\n\n(vi) provisions regarding review of by-right development       proposals to streamline review and reduce uncertainty,       including--\n\n(I) nondiscretionary, ministerial review; and\n\n(II)…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}]