[{"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…retired and are full-time care  providers for her.\n\n``I am not sure why anyone would want to take this help and service  from people whose very life depends on the help it provides.''\n\nThat is a powerful and profound question: Why would anyone in this  House vote to take away Medicaid from the American people amongst the  most vulnerable here in the…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…funding constraints we faced this year, but I fought hard, and we got  this done.\n\nThis bill also rejects Trump's dream of slashing public education  funding and instead provides a bit more for our K-through-12 schools.\n\nAll told, we rejected $12 billion in proposed cuts at the Department  of Education and President Trump's request to abolish the Department.…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699453/appropriations"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…to this amendment.\n\nMs. McCOLLUM. Mr. Chair, this program is designed to assure that our  allies and partners of the U.S. are supported in times of trouble. This  funding provides basic humanitarian aid and essential services to the  populations in need.\n\nLet's talk about what it does for America's national security. This  program is an important tool…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693686/department-of-defense-appropriations-act-2026"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…jury as the only anchor,  yet ever imagined by man, by which a government can be held to the  principles of its constitution.'' Indeed, the way a courtroom pursues  truth provides a blueprint for encouraging trustworthiness in our  public servants.\n\nAt the beginning of jury selection, potential jurors take a solemn  oath to truthfully answer questions…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690041/valuing-truth-fullness-lessons-from-jury-trials"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…economic  advantages, but it would also control the information narrative about  the entire planet, from the environment to natural resources to human  conflict.''\n\nSo this bill provides Congress the transparency and insight we need  to oversee the licensing and regulation of private remote sensing  systems. It modifies the timeline for completing licenses…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688973/commercial-remote-sensing-amendment-act-of-2025"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…Republicans are, once again, to  Americans' concerns because a majority of Americans want to keep the  Department of Education that funds programs for kids with disabilities,  provides student loans, and makes sure poorer schools can hire enough  teachers.\n\nIf Republicans were truly worried about national security, they would  look at how this administration…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689052/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers-providing-for-consideration-of-hr-defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Sam Liccardo", "party": "Democrat", "sentence": "…President ``shall take care that the  laws be faithfully executed,'' so says Article II.\n\nIf the President wants to spend differently than the law dictates,  the Constitution provides him with a couple of options.\n\nFirst, he can introduce a bill, and he can ask Congress to change its  spending priorities. It shouldn't be hard to persuade this Congress…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691336/pocca"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…tireless efforts have  brought together artists, volunteers, and supporters from across  Colorado, all united in a common cause.\n\nThe Colorado Professional Firefighter Foundation provides vital  support to firefighters and their families, offering assistance in  times of crisis and honoring the sacrifices of these brave men and  women. The Make-A-Wish Foundation…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692442/recognizing-and-commending-the-service-of-corey-rose"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…service and strengthen the highest ideals of public service in  America. Established in 1988 in honor of the late Senator John C.  Stennis of Mississippi, the Stennis Center provides a variety of public  service programs and development opportunities for young people,  leaders in local, state, and federal government, and congressional  staff. In addition…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692884/stennis-center-for-public-service-winter-2024-public-service-review"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…General who represents the public interest. Changes to these       charter agencies would significantly undercut the already       thin ties to autonomy that limited home rule provides.\n\nFinally, I urge you not to up end our three-part eduction       funding SOAR Act. I have long supported the program to expand       opportunity for DC students. However,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695614/district-of-columbia-judicial-nominations-reform-act"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…launching into a new age of relatively cheap energy that will  power their data centers and their infrastructure.\n\nRhode Islanders deserve infrastructure that creates good jobs;  provides affordable, clean power; increases our energy independence;  and reduces climate-destroying greenhouse gases in the process. And it  is clear Trump's energy emergency is a…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696129/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…in the United  States.\n\nOhio's 13th Congressional District has long been a trailblazer in  polymer science and polymer engineering. Akron's polymer manufacturing  ecosystem provides a local pipeline from education and training to the  workforce.\n\nTo build on Akron's generations of success, my second amendment  requires the Secretary of Defense to establish…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697853/providing-for-consideration-of-hr-promoting-efficient-review-for-modern-infrastructure-today-act-providing-for-consideration-of-hr-increasing-investor-opportunities-act-providing-for-consideration-of-hr-electric-supply-chain-act-providing-for-consideration-of-hr-state-planning-for-reliability-and-affordability-act-providing-for-consideration-of-hr-improving-interagency-coordination-for-pipeline-reviews-act-providing-for-consideration-of-s-disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-and-for-other-purposes"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…different than many of my  other constituents', a mother working hard to provide for her daughter  who was born and lives with a condition that requires the care that  Medicaid provides.\n\nMariah is fighting to make sure that her daughter is able to keep  receiving that care alongside the 200,000 people in Ohio's 13th  Congressional District.\n\nWhat makes this…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691524/gop-tax-scam-hurts-women-and-families"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…chooses progress over  retreat, American energy independence in perpetuity inside our borders,  not dependence on foreign energy supplies.\n\nAt $63.3 billion, this legislation provides a critical $2.4 billion  increase over last year. Our bill aims to help address significantly  rising energy and water bills coast to coast for families, as well as  climate-caused…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698752/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…implementation of  the Paris Climate Agreement, and saved the Global Environment Facility  from elimination.\n\nThe fiscal year 2026 Financial Services and General Government bill  provides critical assistance to small businesses in the Twin Cities by  rejecting cuts to Community Development Financial Institutions (CDFI)  Fund. The CDFI Fund promotes economic…", "date": "2026-01-27", "source_url": "https://justfacts.votesmart.org/public-statement/1699388/supporting-hr-7006"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…employment opportunities.\n\nThe Secretary of Transportation will develop the action plan in  consultation with the Secretaries of Defense, Veterans Affairs, and  Labor.\n\nThis bill provides veterans and those soon-to-be-discharged from the  armed services with the support that they deserve and addresses the  continued labor shortages in our Nation's critical…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695018/transitioning-retiring-and-new-service-members-to-port-ocean-rail-and-truck-jobs-act"}, {"senator": "Barry Loudermilk", "party": "Republican", "sentence": "…readiness tool could track fatigue, deliver  tailored solutions for the wearer, and integrate with military health  systems all while keeping data secure.\n\nAdopting this amendment provides a targeted solution to the  challenges we face and ensures that American warfighters remain the  most prepared, most adaptable, and most resilient force on Earth.\n\nMr. Chair,…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693650/department-of-defense-appropriations-act-2026"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…development funds various  initiatives across the State, including education, infrastructure, and  community services. It feeds our families, sustains our communities,  and provides livelihoods for the thousands of Alaskans who work to  responsibly develop the vast timber, mineral, material, and oil and gas  resources that Alaska is blessed with.\n\nIn…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696162/hj-res-106"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "…story to the fabric of Ocoee.  Today, with a growing population, over 50,000 people currently call  Ocoee home. The City of Ocoee prides itself on the quality of life it  provides its citizens. Ocoee's unique location in the heart of Central  Florida makes it a wonderful place to live, work and play.\n\nThe City of Ocoee will host their Centennial Celebration…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690916/recognizing-the-100th-anniversary-of-the-city-of-ocoee"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…and  reported a rule, House Resolution 580, providing for consideration of  four measures: H.R. 1919, the Anti-CBDC Surveillance State Act, under a  closed rule.\n\nThe rule provides 1 hour debate, equally divided and controlled by  the chair and ranking member of the Committee on Financial Services or  their respective designees and provides one motion…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693544/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Dave Joyce", "party": "Republican", "sentence": "…and more than 20 independent agencies.\n\nThis bill will enable the GSA to reduce the number of Federal  properties on the Federal Government's deferred maintenance list. It  provides critical funding for national security, including the Office  of Terrorism and Financial Intelligence and the Committee on Foreign  Investment.\n\nThe bill funds bipartisan…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699055/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…The charm and nostalgia are everywhere.\n\nWith more than 200,000 visitors coming to Centre County every year,  attendees immerse themselves in the rich traditions this fair provides.\n\nIt is more than just a weeklong fair. It celebrates Pennsylvania  agriculture. This year, I was honored to be named ``friend of the  fair'' for my work on behalf of our…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694934/recognizing-centre-county-grange-fair"}, {"senator": "Ken Calvert", "party": "Republican", "sentence": "…the  administration expressed any slight disagreement with our bill was  wanting more money for Taiwan. The administration has proposed  including $1 billion while this bill provides $500 million.\n\nMr. Chair, had OMB delivered budget materials to us in time for  consideration, we would have certainly taken a look at providing what  they requested, but…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693682/department-of-defense-appropriations-act-2026"}, {"senator": "Paul Gosar", "party": "Republican", "sentence": "…completed.\n\nMr. Speaker, I support this bill, and I reserve the balance of my  time.\n\nMr. GOSAR.  Boebert), the lead sponsor of this bill.\n\nMr. GOSAR. Mr. Speaker, this bill provides increased financial  flexibility for the construction of the long-overdue water  infrastructure improvements in rural Colorado. I thank Ms. Boebert for  her diligent work…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693879/finish-the-arkansas-valley-conduit-act"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…primarily from satellite and cable providers.\n\nSenator Klobuchar of Minnesota and I have introduced a bipartisan  resolution to recognize C-SPAN2 and the public service it provides the  American people through its live, nonpartisan coverage. Our resolution  calls for television providers, including streaming services, to make  C-SPAN public affairs programming…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691703/senate-resolution-259-recognizing-june-as-the-39th-anniversary-of-c-span-chronicling-democracy-in-the-senate"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…to access what can be the  complicated and sometimes frustrating process of being in the queue to  provide support for our military men and women in our armed services.\n\nIt provides for a focus on additional training space and support for  unmanned systems, which is vitally important. It is important to us in  Kansas where we have a lot of assets clustered…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695108/providing-for-consideration-of-hr-streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-and-providing-for-consideration-of-hr-stop-illegal-entry-act-of-2025"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…to commend  President Trump on his announcement of $12 billion in farmer bridge  payments for American farmers.\n\nThe establishment of the Farmer Bridge Assistance program provides  critical relief to crop farmers across the United States, including  many in Pennsylvania's 13th Congressional District.\n\nThe FBA program will make one-time direct payments…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698173/lowering-healthcare-costs-for-all-americans"}, {"senator": "Tom Tiffany", "party": "Republican", "sentence": "…program; and\n\n(7) the Great Lakes are an important and valued resource       that--\n\n(A) supports a robust regional economy valued at more than       $7,000,000,000; and\n\n(B) provides stability to the economy of the United States.       SEC. 3. DEFINITIONS.\n\nIn this Act:\n\n(1) Director.--The term ``Director'' means the Director of       the United States…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693992/great-lakes-mass-marking-program-act-of-2025"}, {"senator": "William Timmons", "party": "Republican", "sentence": "…Code, is amended by striking ``section 4305'' and       inserting ``section 4306''.\n\nMr. Speaker, the American public relies on Federal supervisors to  lead a workforce that provides high-quality customer service and  faithful execution of the law.\n\nThese expectations and standards require a level of professionalism  that can be improved by strengthening…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698216/federal-supervisor-education-act"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…time.\n\nMr. Speaker, I rise in support of the bipartisan Tennessee Valley  Authority Transparency Act.\n\nTVA is a congressionally chartered American public power company that  provides electricity to over 10 million people in Tennessee and six  surrounding States.\n\nDespite TVA's significant role in our daily lives, it holds most of  its meetings behind closed…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692212/tennessee-valley-authority-transparency-act-of-2025"}]