[{"senator": "Richard J. Durbin", "party": "Democrat", "sentence": "This compromise bill will provide much needed support and relief for workers, small business owners, hospitals and health care providers as well as finally reimburse the state of Illinois and our local governments for the massive costs they've incurred to keep our citizens safe while helping prepare our state for recovery,\" said Duckworth."}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "I believe increasing awareness of opioid prescription rates as well as how often providers are querying PDMP databases will help continue to improve the way we treat veterans' pain and decrease reliance on powerful opioids."}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "I look forward to the President signing this important, bipartisan legislation into law.\" \n\nThe bipartisan Broadband Deployment Accuracy and Technological Availability (DATA) Act would direct the Federal Communications Commission (FCC) to improve its broadband coverage maps by requiring the FCC to gather more detailed coverage data from service providers, a move that would improve the agency's data collection and reporting."}, {"senator": "Christopher Murphy", "party": "Democrat", "sentence": "We know that many of our providers are taking care of a higher proportion of COVID-19 infected patients than some of the hospitals that received funding in this allocation."}, {"senator": "Benjamin L. Cardin", "party": "Democrat", "sentence": "We urge HHS to provide hospitals, nursing homes, and other essential community health providers with the financial support necessary to prevent, prepare for, and respond to the coronavirus pandemic immediately."}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "This week, Shaheen led the New Hampshire delegation in calling on the Department of Health and Human Services to urgently provide guidance to health care providers in New Hampshire and across the country on the steps being taken to deliver personal protective equipment (PPE), ventilators and other essential supplies to hospitals as they prepare for an increase of coronavirus patients in the weeks to come."}, {"senator": "Jon Tester", "party": "Democrat", "sentence": "Senator Jon Tester applauded the Senate's quick passage of the Secure and Trusted Communications Networks Act, which will help rural broadband providers rip and replace Chinese telecommunications infrastructure that could pose a national security threat to the United States."}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "However, regardless of where individuals are receiving care, cancer  treatment is often very complex and requires veterans to regularly see  many different providers for various treatments, as well as different  specialized labs and imaging centers."}, {"senator": "Richard J. Durbin", "party": "Democrat", "sentence": "Representative Jan Schakowsky's (D-IL-09) to address health care workforce challenges and entice promising students from diverse backgrounds--physicians, dentists, mental health professionals, nurses, and physician assistants--into primary health careers in underserved communities by providing historic new funding levels for scholarship and loan repayment options in exchange for a service commitment in an urban or rural area with a shortage of providers."}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "Dear Chairman Blunt and Ranking Member Murray:\n\n \n\nAs already overburdened child care providers face increased strain during this outbreak, it is critical that our federal government invest in increasing the capacity of our child care providers."}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "I will continue working to ensure that our state has the resources necessary to respond to this health and economic crisis.\"\n\n\"Nursing homes and long-term facilities across New Hampshire continue to be devastated by COVID-19, and my heart goes out to the residents and care providers who are on the front lines of this pandemic,\" said Congressman Chris Pappas."}, {"senator": "Benjamin L. Cardin", "party": "Democrat", "sentence": "The delegation has previously announced funding for Maryland through the CARES Act including $45 million for child care centers, $45 million for the Governor's emergency education relief fund, $170 million for Maryland's institutions of higher education, $107 million for airports, $742 million for hospitals and health care providers, $15.6 million for community health centers and $48 million to Maryland local government jurisdictions."}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "The program has had longstanding  success in both ensuring prospective providers can complete their  training and bolstering VA's workforce, especially in difficult-to-hire  areas and for difficult-to-recruit professions."}, {"senator": "Rob Portman", "party": "Republican", "sentence": "I have watched some of these first responders in action with  social workers and treatment providers who are going into people's  homes and getting people into treatment who previously were not."}, {"senator": "Steve Daines", "party": "Republican", "sentence": "\"In Montana, telehealth is a powerful tool for our providers to expand access to care, especially in vulnerable communities during this public health crisis,\" Daines said."}, {"senator": "Ben Sasse", "party": "Republican", "sentence": "Senator Ben Sasse, a member of the Senate Finance Subcommittee on Health Care, has introduced two amendments to relief legislation that would help Nebraska's health care providers combat coronavirus."}, {"senator": "Cory Gardner", "party": "Republican", "sentence": "Brave health care providers are fighting around the clock against this outbreak and are selflessly risking their personal health."}, {"senator": "Patrick J. Toomey", "party": "Republican", "sentence": "The next category is the resources we're sending directly to health care providers."}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "Senate today unanimously cleared a bipartisan package to provide immediate and prolonged economic relief to American families, workers, employers and health care providers coping with the coronavirus pandemic."}, {"senator": "Cory Gardner", "party": "Republican", "sentence": "On March 24, the Colorado Department of Health Care Policy and Financing, the State's Single State Medicaid agency, submitted an 1135 waiver, designed to reduce administrative burdens on: clients seeking access to care; on the state's Medicaid program; and, on providers seeking to participate in Medicaid."}, {"senator": "Susan M. Collins", "party": "Republican", "sentence": "It also provides $60 billion for Economic Injury Disaster loans and grants Senator Collins advocated for, as well as $75 billion for hospitals and providers, and $25 billion for COVID-19 testing efforts."}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "Surge of Investment for Healthcare and Medical Professionals: $150 billion to ensure healthcare providers and hospitals continue to receive the support they need for COVID-19 related expenses and lost revenue, as well as $1.32 billion in additional funding for community health centers."}, {"senator": "Cory Gardner", "party": "Republican", "sentence": "In addition to their irreplaceable role in serving the everyday health needs of our rural communities, some of these health care providers are actively responding to COVID-19 as we speak and others may be activated soon."}, {"senator": "Lamar Alexander", "party": "Republican", "sentence": "\"As America combats coronavirus, we're rapidly working to provide resources and relief for Americans and health care providers that care for them."}, {"senator": "Mike Rounds", "party": "Republican", "sentence": "From offering complimentary fixed and mobile broadband services to families with school-aged children and college students to taking the Federal Communications Commission's \"Keep Americans Connected Pledge,\" hundreds of broadband providers have committed to prioritizing their customers in this time of uncertainty."}]