[{"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…Seven months ago, her 6- year-old son died while awaiting medical evacuation. He suffered from a  kidney condition, and the decimated medical system in Gaza could not  provide him the care he needed to survive.\n\nNow her daughter, Lana, who suffers from the same kidney condition,  is on the wait list for medical evacuation. Each day that goes by  without…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697473/president-trump-is-a-threat-to-our-republic"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…112, located in the Edenwald neighborhood of  the Bronx.\n\nLynne spent her entire career in public education and felt it was her  responsibility not only to educate but to provide care and safety for  children who were often underserved and overlooked, either due to their  race or economic status.\n\nLynne's love for her family was her foundation, and she…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695505/recognizing-the-life-of-millie-ortiz-sheehan"}, {"senator": "Maggie Hassan", "party": "Democrat", "sentence": "…is a perinatal  peer support educator and coordinator for Dartmouth Health. She helps  families every day. Because she got care when she needed it, she is now  working to provide care for others, touching untold and unknown numbers  of lives through her work. And she was my guest this year at the  President's joint address to Congress. But none of her…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689509/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…in the       form of deferred maintenance that occurred during the       pandemic crunch.) Inevitably it seems that we are going to       end up spending more money to provide less care to our       residents. If we are not able to pivot and find replacement       workers this will lead to nursing home closing and hospitals       being stuck with the…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699720/witness-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…requirements it  decided not to implement because when it looked at the other States  that did, the administrative costs of the work requirements cost more  than the cost to provide care.\n\nThese States are facing significant cuts to rental assistance and  affordable housing funding. Oh, by the way, these are the same people  who are now going to get their…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691771/151-days-without-a-vote-to-lower-costs"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…abortion and gender-affirming care.\n\nOn March 5, 2025, President Trump announced his administration would  no longer enforce a Federal law that requires hospitals to provide  women abortion care in an emergency when their lives are threatened.  When, literally, they could die, no longer will emergency rooms be  required to provide that care.\n\nOn April 1…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692840/9999"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…limited, and it saps the morale and capabilities of the infected  individuals and their communities.\n\nDOD's HIV-AIDS prevention program pairs health and security  assistance to provide care and treatment in concert with military  training, exercises, and humanitarian activities.\n\nThis amendment would eliminate a successful military-to-military HIV- AIDS prevention,…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693686/department-of-defense-appropriations-act-2026"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…even in the community, is  extremely limited, given the lack of such services in the territories.\n\nThis legislation authorizes the VA to appoint traveling physicians to  provide care to veterans residing in American Samoa, Guam, the  Commonwealth of the Northern Mariana Islands, the Commonwealth of  Puerto Rico, the U.S. Virgin Islands, and any other…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695430/territorial-response-and-access-to-veterans-essential-lifecare-act"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…will receive Head Start services, supporting early childhood learning,  development, and health. These centers rely on us to make sure we keep  that Federal funding to provide the care for our children.\n\nAgain, I know earlier this year we were all thrown into a panic when  the Trump administration recklessly decided to cut off the Federal  funding. I…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691869/job-corps-cuts"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…engineering officer in the Army. He suffered from lung cancer caused by  burn pit exposure.\n\nWe all know about Iraq and Afghanistan burn pit exposure. We passed  the PACT Act to provide care and benefits for victims of those burn  pits and exposure to other toxic chemicals.\n\nThey led to his retirement and his death in 2021. He was 51 years  old. Until  his death,…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696112/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…uninsured people per  capita and became one of the most insured. Because of that expansion,  people were able to get care and help.\n\nAs for those rural health clinics that also provide care to so many  of our Medicaid beneficiaries in New Mexico, all of a sudden, when  Federal Medicaid dollars go away, they might close.\n\nSo I am going to go back to my stroke.…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696347/trump-administration"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…of its response to the one big, ugly big.\n\nIt is not hyperbole. You have rural hospitals that are already  operating on the margins who now are going to have to provide more  uncompensated care.\n\nMr. Speaker, when people come off of Medicaid and when the Enhanced  Premium Tax Credits for purchasing insurance on the Affordable Care Act  Exchange expire…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695041/better-is-possible"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…to  close less lucrative units, such as maternity wards. That means women  driving further for prenatal checkups or to give birth.\n\nFor the hospitals left and places that provide care, there has  largely been one saving grace: Medicaid. Medicaid--and Medicaid  expansion, in particular--is a crucial funding source for cash-strapped  rural hospitals. And…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689545/h-con-res-14"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…put your life in danger abroad, you  will be respected and taken care of. You will be cherished and honored  and not forced to worry that the Federal employees who provide you with  care, many of whom were veterans themselves, will be fired or the  benefits that you rely on will be denied or that your healthcare needs  won't be met; basic American principles…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…who may have difficulty leaving the house or who live  in extremely rural areas.\n\nWe can clearly recognize that after the pandemic, we must be open to  changing the way we provide care to everyone, especially veterans, to  reflect technological advancements, individual preferences, and the  necessity of expanding access to care. In fact, telehealth is…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695455/protecting-veteran-access-to-telemedicine-services-act-of-2025"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…staff have  improved the health and quality of life for countless patients.\n\nFounded in 1950, Mercer Health, known then as Our Lady of Mercy  Hospital, was established to provide care to the citizens in Coldwater,  Ohio and surrounding area. Seeing a need for a hospital, concerned  citizens banded together to open the forty-eight-bed hospital. In 1969,…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697414/recognizing-mercer-health-on-their-75th-anniversary"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…simply  because of covering insurance premiums, which are going into the  pockets of insurance companies to provide you substandard options in  healthcare.\n\nThey don't provide you care. They don't. They are a middleman, a  funding mechanism that gets in the way of you going to the doctor of  your choice.\n\nRepublicans have plans to fix that. We have put…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697130/congress-is-back"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…contacted by the alleged victim based on programmatic       eligibility criteria or any other reason that affects the       ability of such appropriate individual to provide care and       support (such as being stationed at a remote unit or serving       on a vessel currently underway) the alleged victim shall       receive, with the permission…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Mark Messmer", "party": "Republican", "sentence": "…address an issue affecting  both families and businesses in Indiana and across the United States,  which is the expensive, but essential, financial support workers need  to provide care for their young children and elderly parents.\n\nCurrent law discourages employers from helping their workers pay for  onsite childcare or elderly dependent care because of…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699003/empowering-employer-child-and-elder-care-solutions-act"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "…not ``standing in the President's       shoes'' when it developed a land use plan for the GSENM.       Although the proclamation directs the Secretary and BLM to       provide for the care and management of the monument, such       directives do not expand the President's statutory authority       under the Antiquies Act or displace BLM's obligations under…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700255/us-government-accountability-office-decision"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…of title 38, United States Code,       who has entered into a contract or agreement to furnish       hospital care, medical services, or extended care services to       provide care related to breast or gynecologic cancer to       veterans under section 1703 of title 38F, United States Code.\n\n(3) The term ``breast cancer'' has the meaning given such…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695420/women-veterans-cancer-care-coordination-act"}]