[{"senator": "John Garamendi", "party": "Democrat", "sentence": "…thing we will do  to support working families is to expand the child tax credit.\n\nRanking Member Rosa DeLauro's American Family Act will cut child  poverty in half and provide critical relief for middle-class and low- income families by providing a $6,000 refundable tax credit to help  families with the high cost of a child's first year of life.\n\nDemocrats…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688233/democratic-proposals"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…Federal officers have earned over the  course of the time that they have served their communities and this  country and ensuring that every Federal agency can continue to provide  critical assistance to our State and local law enforcement.\n\nWe can do a lot better. They deserve so much better from us. Let's  please work to do better.\n\nMrs. McBATH. Mr. Speaker,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691321/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…recognized for their  thoughtful design and emphasis on supporting residents. I look forward  to seeing what the next 50 years will bring for FRH as they continue to  provide critical housing resources for our community.\n\nOn behalf of the people of Colorado's 7th Congressional District, it  is my honor to congratulate Foothills Regional Housing on their…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695831/recognizing-foothills-regional-housing"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…February to May 2017.\n\nThrough her work overseeing a budget of more than $70 billion for  ACF, Ms. Barlow has played a key role supporting the programs and  services that provide critical assistance to vulnerable populations,  including Head Start and Child Care services for millions of children  and families, and the heating and cooling of millions of…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692562/recognizing-amanda-barlow-on-her-retirement"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…basically to better understand the causes of  addiction and identify treatments and interventions that reduce  overdoses.\n\nTrump also halted all federally funded programs that provide critical  opioid-related services, including federally qualified health centers,  which serve a high proportion of patients disproportionately impacted  by the opioid crisis.…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692341/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…10. The Child Nutrition Programs, which include the       National School Lunch and Breakfast Programs, Summer Food       Service Program, and Summer EBT (SUN Bucks), provide       critical, nutritionally-balanced meals and food assistance       benefits to millions of children every day. Through the       National School Lunch Program alone, approximately…", "date": "2025-11-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696499/unanimous-consent-request"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…Nation. From  supporting biodiversity to enhancing local ecosystems, native plants  play a crucial role in promoting sustainability and resilience in our  environment. They provide critical habitats for wildlife, including  pollinators like bees and butterflies, which are essential for  agricultural productivity. They also help reduce our reliance on  chemical…", "date": "2025-03-21", "source_url": "https://justfacts.votesmart.org/public-statement/1688920/supporting-the-designation-of-april-2025-as-national-native-plant-month"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…all evacuees were able to  return home safely. Nathan's commitment to public service extends  beyond Jefferson County--he also deployed to Sarasota County, Florida  to provide critical support during Hurricane Milton.\n\nNathan has led the way in adapting innovative technology and  strategies that have strengthened our community's preparedness and  resilience.…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689320/recognizing-nathan-whittington"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…market manipulation and other  anticompetitive practices.\n\nThe bill creates a National Port Advisory Committee and a National  Ocean Carrier Advisory Committee which will provide critical informed  insight to ensure a more fair and efficient international ocean freight  system.\n\nI support this legislation, and I thank my colleague from South  Dakota, Congressman…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698123/federal-maritime-commission-reauthorization-act-of-2025"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…D.C. Judicial Nomination  Commission and the D.C. Criminal Justice Coordinating Council. With one  exception, these agencies are not under D.C.'s control. These agencies  provide critical local services to D.C., including law enforcement, and  should continue to function as usual during a Federal Government  shutdown.\n\nI urge my colleagues to support this…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695983/introduction-of-a-bill-to-provide-for-interim-appropriations-for-the-district-of-columbia-courts-and-related-agencies-with-respect-to-any-fiscal-year-for-which-appropriations-are-not-otherwise-provided-for-such-courts-and-agencies"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…aisle: Why do you want people to suffer?\n\nThe ACA tax credits ensure that families, seniors, young adults, and  workers have access to quality healthcare. These tax credits provide  critical financial relief for millions who rely on health insurance  coverage.\n\nAffordability remains a top concern for Americans, and it baffles me  that Republicans would cause…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696975/stories-from-home-the-human-cost-of-expiring-healthcare-tax-credits"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…just. This bill would address the  fluctuations in deposits that continue to threaten the fund and our  ability to provide vital support to victims of crime.\n\nIt would provide critical stabilization of the fund by authorizing an  infusion of unobligated funds collected through the False Claims Act to  halt the immediate bleeding. This stopgap measure…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698840/crime-victims-fund-stabilization-act-of-2025"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…reproductive  rights, in safeguarding access to clinics where abortion services are  provided, in fighting for Planned Parenthood funding, in protecting  doctors who provide these critical services to women coming from other  States that may actually criminalize that kind of care.\n\nBut we know now what the challenge is and what we must do. The  Women's…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692840/9999"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…and alumni who  are kama`aina, born and raised in our islands, including 89 Kanaka  Maoli. They embody the sense of kuleana and community responsibility  necessary to provide critical education support for our keiki.\n\nThe impacts of our TFA Hawaii kumu--or teachers--have lasted far  beyond their initial commitment, with over 500 alumni remaining in…", "date": "2025-10-14", "source_url": "https://justfacts.votesmart.org/public-statement/1696215/congratulating-hawaii-teach-for-america-teachers"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…the Child Care and Development Fund, and the Social Services  Block Grant program. This move threatens over $3.4 billion in annual  funds that New York depends upon to provide critical resources,  including childcare, public assistance, domestic violence services,  homeless shelters, and emergency payments for families and children.\n\nThis action only…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699265/recognizing-the-scarsdale-forum"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…faith, Place of Hope has dedicated its mission to breaking  cycles of abuse, poverty, and homelessness. With five campuses across  Palm Beach and Martin Counties, they provide critical services like  neighborhood foster care, maternity care, independent living programs,  human trafficking prevention, and family outreach.\n\nOver the past 25 years, Place…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694742/recognizing-place-of-hope"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…In the 1970s, Wyoming lawmakers recognized the need to create a  statewide system to standardize emergency medical services. The Wyoming  EMS Office was established to provide critical training, support, and  continuing education for first responders. It is also responsible for  EMS licensing across the State.\n\nThe trauma conference came from humble…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694419/50th-anniversary-of-the-wyoming-trauma-and-emergency-medical-services-conference"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…Crime Victims Fund.\n\nMr. Speaker, I am beyond proud to rise in support of my bill H.R.  909, the Crime Victims Fund Stabilization Act.\n\nThis bipartisan legislation will provide critical support to over 7  million crime victims throughout every State in this country, without  spending a single taxpayer dollar.\n\nMr. Speaker, across the United States, domestic…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698841/crime-victims-fund-stabilization-act-of-2025"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…statute of limitations from 5 years to 10 years for fraud with  respect to SBA's Restaurant Revitalization Fund and the Shuttered Venue  Operators Grant. This extension will provide critical time for law  enforcement to track down criminals who have defrauded the U.S.  Government and hold them accountable.\n\nSmall businesses across our country, including in…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697225/sba-fraud-enforcement-extension-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…that 25 percent of the revenue  generated through timber sales in national forests is returned to the  local county. These funds are then used by local governments to provide  critical support services for schools, roads, and other essential  needs.\n\nTimber harvesting in the national forest system reached its peak in  the late 1980s, then dramatically…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697653/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…policy to invest in our Nation's future  and ensure students with disabilities have access to a high-quality  education. It is the right thing to do.\n\nFull funding will provide critical resources to schools, enabling  students with disabilities to receive services and support that they  need. It will reduce financial strain on States and local districts,…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689683/supporting-our-nations-children-with-disabilities"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…didn't like, students are throwing it away and losing out on the 21  essential minerals and 13 vitamins necessary for healthy development.\n\nSchool nutrition programs provide critical access to the nutrients  growing children need, including those provided by milk. In fact,  school meals provide 77 percent of the total daily milk consumption for  low-income…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698178/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…to close the bad-actor loophole, then what does being an advocate  actually mean?\n\nThis package funds a significant portion of the Federal revenue, from  Agencies that provide critical resources to our farmers to law  enforcement, military, and our veterans, just to name a few.\n\nWe need the appropriations process to function. Congress needs to do  its…", "date": "2025-08-01", "source_url": "https://justfacts.votesmart.org/public-statement/1694557/9999"}]