[{"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…progress over  retreat, American energy independence in perpetuity inside our borders,  not dependence on foreign energy supplies.\n\nAt $63.3 billion, this legislation provides a critical $2.4 billion  increase over last year. Our bill aims to help address significantly  rising energy and water bills coast to coast for families, as well as  climate-caused…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698752/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…accomplishments, Ms. McClain is  deeply committed to her community. She previously served as the  chairperson of Big Brothers Big Sisters of McHenry County, an  organization that provides critical mentorship services to children,  helping them develop the confidence they need to succeed. Since 2018,  she has been a passionate advocate for the organization, opening…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690883/recognizing-rhienna-mcclain-for-receiving-the-athena-international-leadership-award"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…the elderly; and Medicaid, a  health insurance program for people with limited incomes.\n\nToday, nearly 80 million Americans receive healthcare through  Medicaid, which provides critical care throughout all stages of life.  It covers childbirth and nursing home care and everything in between.\n\nIn my congressional district, there are 180,678 people on…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690244/health-disparities-in-minority-communities"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…implementation of  the Paris Climate Agreement, and saved the Global Environment Facility  from elimination.\n\nThe fiscal year 2026 Financial Services and General Government bill  provides critical assistance to small businesses in the Twin Cities by  rejecting cuts to Community Development Financial Institutions (CDFI)  Fund. The CDFI Fund promotes economic development…", "date": "2026-01-27", "source_url": "https://justfacts.votesmart.org/public-statement/1699388/supporting-hr-7006"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…provides our first responders, the  first line of defense, the people that go in and risk their lives at a  time when it is most dangerous. They can't do it alone, and FEMA  provides critical training, resources, and supplementation.\n\nFEMA is designed to have an immediate response within a minimum of 15  hours. However, under President Trump and his canceling…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693655/tragic-storms-in-texas"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…die, it is one of our strongest assets to  saving money by decreasing military conflict risk.\n\nI also want to speak up for the Corporation for Public Broadcasting,  which provides critical kids' educational programs.\n\nMr. Speaker, this bill is bad for America. People will die.", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692547/rescissions-act-of-2025"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…well-deserved pay increase for our servicemembers  and ensures DOD cannot arbitrarily RIF its employees.\n\nThis bill includes crucial support for our allies like Ukraine and  provides critical checks on this administration's power.\n\nI spent most of this year, including yesterday, visiting every  military installation in Maryland, meeting with and listening…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697801/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…Senate.\n\nThe Blue Heron, a research vessel operated by the University of  Minnesota Duluth, is the only U.S. Academic Research Fleet vessel  operating in the Great Lakes. It provides critical research that  informs science-based decisions to protect Michigan's gift to the  country, our Great Lakes. These vessels represent a global network of  essential research…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691439/accelerating-networking-cyberinfrastructure-and-hardware-for-oceanic-research-act"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…to maintain our global leadership and protect U.S. national  security interests.\n\nWhile foreign assistance represents less than 1 percent of the  Federal Government, it provides critical benefits to our Nation. These  strategic investments help save American lives, reinforce our global  leadership, and support economic growth here in our country. Foreign…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693590/rescissions-act-of-2025"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…Mrs. BEATTY.\n\nH.R. 6644 represents an important first step, a strong bipartisan  one, in our fight to ensure affordable, decent housing for everyone in  America. It provides a critical foundation for us to end the affordable  housing and homelessness crisis.\n\nThis bill would update and improve existing Federal housing programs  by expanding local development…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699805/housing-for-the-21st-century-act"}, {"senator": "Andy Harris", "party": "Republican", "sentence": "…Agriculture bill provides $26.65 billion in discretionary  spending, which is level with the current amounts while also including  community project funding.\n\nThis bill provides critical funding support to America's farmers,  ranchers, and rural communities. It ensures both USDA and FDA can  safeguard our Nation's food and drug supply and fully fund nutrition…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696739/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…are being effective and  overall impact.\n\nThis is going to provide real relief to American families, workers,  and businesses. The bill expands the child tax credit, provides  critical tax breaks for small businesses and the working class, and  makes America more competitive on the global stage. It also makes the  Tax Cuts and Jobs Act permanent, like…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691166/events-this-week"}, {"senator": "Frank Lucas", "party": "Republican", "sentence": "…also be helpful in humanitarian relief  efforts and monitoring treaty compliance, among other national security  and foreign affairs applications.\n\nThis technology provides us with critical information for a number of  fields. As the industry is constantly evolving and growing, we must  make sure that Congress is receiving timely and comprehensive reports…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688972/commercial-remote-sensing-amendment-act-of-2025"}, {"senator": "Dave Joyce", "party": "Republican", "sentence": "…more than 20 independent agencies.\n\nThis bill will enable the GSA to reduce the number of Federal  properties on the Federal Government's deferred maintenance list. It  provides critical funding for national security, including the Office  of Terrorism and Financial Intelligence and the Committee on Foreign  Investment.\n\nThe bill funds bipartisan programs…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699055/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…credibility, and confidence.\n\nFinally, Mr. Speaker, this rule provides for consideration of H.R.  4016, the Department of Defense Appropriations Act of 2026.\n\nH.R. 4016 provides the critical funding necessary to ensure the  readiness, modernization, and global strength of the United States  Armed Forces. This bill reflects Congress' enduring commitment…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693544/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…unfortunately, because of the House's lack of  action, has been allowed to expire. Even though the Senate did pass it  last year, the House failed to do so.\n\nSecure Rural Schools provides critical funding for a number of  counties in my district and across the country. It was enacted in the  year 2000, and it compensates counties with large amounts of national…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690562/gas-prices-are-lower-for-everyone-except-californians"}, {"senator": "Russ Fulcher", "party": "Republican", "sentence": "Mr. FULCHER. Mr. Speaker, the Secure Rural Schools Reauthorization  Act provides critical funding for rural communities.\n\nThis measure is of particular importance for my home state of Idaho,  as 62 percent of our land is owned by the federal government.\n\nEvery…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697656/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…Speaker, I thank the gentleman from Ohio's  12th Congressional District, Troy Balderson, for sponsoring this  important legislation.\n\nH.R. 3616, the Reliable Power Act, provides a critical tool to  protect the public from future Federal rules that would force the  premature retirement of power generation that is absolutely essential  to keeping our grid…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698274/reliable-power-act"}, {"senator": "John James", "party": "Republican", "sentence": "…Reauthorization Act of 2025. The bipartisan Road to Recovery Act  reauthorizes lifesaving resources vital to addressing opioid addiction  and substance abuse across the country.\n\nIt provides critical resources for SAMHSA's National Helpline, a  free, confidential, 24/7, 365-day-a-year treatment referral and  information service for individuals and families facing…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691886/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…Mr. BABIN. Mr. Speaker, I have no further requests for time, and I am  prepared to close.\n\nMr. BABIN. Mr. Speaker, as I said previously, commercial remote  sensing provides us with critical information related to a number of  fields important to U.S. competitiveness.\n\nH.R. 1325 will ensure that Congress receives the updates necessary to  monitor industry…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688971/commercial-remote-sensing-amendment-act-of-2025"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…programs, Kansas wheat, Arkansas rice, and Iowa  soybeans are feeding the hungry around the world who are facing famine,  war, and national instability.\n\nFood for Peace also provides a critical market for our producers.  This is an issue that matters to Kansas farmers and farmers around the  country. It allows them to sell nearly $2 billion worth of excess…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691403/motion-to-discharge-s-res-195"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…highly processed  foods, whole milk does not fit into this category. In fact, many  schoolchildren are at risk of dairy underconsumption, not  overconsumption.\n\nWhole milk provides critical nutrition for growing minds. We need to  follow the science and pass the Whole Milk for Healthy Kids Act.", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698186/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "Dan Newhouse", "party": "Republican", "sentence": "…Chairman Cole for yielding.\n\nMr. Speaker, the fiscal year 2026 Homeland Security appropriations  bill is the culmination of the hard work of our committee and our staff  and provides critical investments to protect the American homeland.\n\nAs a member of the Subcommittee on Homeland Security, I know that  this bill champions public safety and preparedness.…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699356/department-of-homeland-security-appropriations-act-2026"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…commend  President Trump on his announcement of $12 billion in farmer bridge  payments for American farmers.\n\nThe establishment of the Farmer Bridge Assistance program provides  critical relief to crop farmers across the United States, including  many in Pennsylvania's 13th Congressional District.\n\nThe FBA program will make one-time direct payments to…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698173/lowering-healthcare-costs-for-all-americans"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…It safeguards the Second Amendment by removing tax and registration  requirements for firearm silencers and eliminating silencers from the  National Firearms Act.\n\nIt provides critical disaster recovery funding to farmers, producers,  and ranchers.\n\nIt provides funding to rebuild America's military.\n\nIt expands health savings accounts to give Americans…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692263/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}]