[{"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…Honoring Sydney Boisselle\n\nMs. KAPTUR. Mr. Speaker, I rise tonight with a heavy heart and deep  gratitude to remember Sydney M. Boisselle, a young woman whose life  proved that impact is not measured in years but in courage, character,  and how we lift others.\n\nSydney shattered expectations. She became a leader in the  International Brotherhood…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699337/applauding-president-zelenskyys-address-in-davos"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…sought to impose. During the Vietnam War,       his innovative supply chain systems didn't just move       materials--they saved lives. His mastery of military       logistics proved that excellence and leadership flow from       capability, not ancestry. For those of us who still face       skepticism about our place in military leadership, his       technical…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688378/recognizing-virginias-fourth-district-black-history-month-essay-contest-1st-place-high-school-winner-tanvi-palavalas"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…them being pulled out of cars, generally speaking. There may  be an exception, and the press will take that exception to prove a  rule, but that is not the way the rules are proved. You don't see it.\n\nYou see people of color, people from south of the border, people from  these 18 countries, that are being discriminated against with this  policy that he…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697472/president-trump-is-a-threat-to-our-republic"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…that under the  United States law--and we are a country of laws--does not carry the  death penalty.\n\nThat is a profound escalation, and one Congress has neither debated  nor proved. They openly covet Venezuelan oil. That is what this is  about. The President is coveting Venezuelan oil.\n\nDespite promises to end wars, this President is threatening military…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698248/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…tenure has strengthened the bonds between Australia and the United  States and upheld the values we share.\n\nFrom the day Ambassador Rudd arrived in Washington on March 2023, he  proved to be a driving force in advancing our mutual national  interests. During his accomplished career in the Australian Parliament  and as Prime Minister, he understood the importance…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699544/9999"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…his famous book ``1984'' wrote of a time when ``The  party told you to reject the evidence of your eyes and ears. It was  their final, most essential command.'' His warning proved pressing  because today the Trump administration asks the American people to  ignore what they see with their own eyes and what they hear with their  own ears, which is the…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699746/it-is-time-for-the-corruption-to-end"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…contributor to the Federal Treasury. California didn't get  there by sticking our head in the sand as the clean energy transition  blossomed elsewhere. We leaned in, and we proved that what is good for  the air is good for business. What is good for the planet and public  health is good for the economy.\n\nBut, meanwhile, the cost of inaction continues…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691454/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…and to  elevate excellence in the Armed Forces. She publicly championed the  Tuskegee Airmen, whose skills and discipline shattered the lies used  to justify exclusion, and proved that racism, not readiness, was the  real barrier. You see, they were Black, for anyone who might not know  that, and by flying with one of them as her pilot, Roosevelt sent…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699864/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…relationship with her. I  tried to say: Hey, as someone from a border State, we have got to make  this work. I have got to have a relationship with this person.\n\nBut she has proved, over and over again, up until this weekend, that  she does not deserve the title of Cabinet Secretary. This week, when  Alex Pretti was killed on the ground, shot 10 times,…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699401/9999"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…immediately predicted our economy would crash. One of the world's  biggest ports was instantly shut off to traffic, and we would be  challenged to recover. But Team Maryland proved them wrong. We were  quickly and efficiently able to perform a controlled demolition in May.  By June, we reopened the Fort McHenry Federal Channel and the Port of  Baltimore,…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689022/9999"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…the  interference of politicians.\n\nIt allowed women to make those decisions in consultation with their  own faith, their own doctor, and the people they love. Roe v. Wade  proved that when women have that freedom to make our own healthcare  decisions, we live healthier and fuller lives.\n\nSadly, after Roe v. Wade was overturned, 22 States implemented…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699220/providing-for-consideration-of-hr-supporting-pregnant-and-parenting-women-and-families-act-providing-for-consideration-of-hr-pregnant-students-rights-act-and-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Raphael Warnock", "party": "Democrat", "sentence": "…them with you.\n\nBristeria was excited to learn that she would be expecting her first  child, but her initial excitement quickly gave way to fear and anxiety  as her pregnancy proved to be most difficult.\n\nDuring the pregnancy, doctors needed to perform an emergency  operation, followed by an unexpected C-section delivery. And at the  time of her pregnancy,…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689540/h-con-res-14"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…with me.      Good is the promise      that night doesn't win,      that Sunday still comes      after Friday's grim.      So yes, He is good--      not loud, not rushed, not proved in a day--      but faithful, and near,      and already making a way.                             Moments of Silence                                By Lucas Hogan       A…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699130/senate-pages"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…Rosies taught me what a riveter was. I didn't  realize what it was until I was by that plane, and I went: Oh, that is  what a riveter is.\n\nThey were also welders, and they proved to themselves and the world  that Americans can do it.\n\nI am blessed to have many Rosies in my life. I have gone to many  birthday parties for 100-, 102-, and 103-year-olds…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697725/world-war-ii-womens-memorial-location-act"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…Rehabilitative Services  and the Office for Civil Rights.\n\nEducation Secretary McMahon--herself one of Trump's billionaire  buddies--has made the preposterous claim that the shutdown proved the  Education Department is unnecessary. This is the kind of  unsubstantiated--I can hardly believe that she would consider this  proof of any kind, but this is the kind of…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697008/9999"}, {"senator": "Claudia Tenney", "party": "Republican", "sentence": "…lawful  action. This was an act of justice against an indicted narcotrafficker  who believed he could evade accountability while ordinary people paid  the price. President Trump proved him wrong.\n\nThis operation also demonstrated what strong leadership looks like.  Our military, intelligence community, and law enforcement agencies  worked seamlessly together,…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698881/successful-operation-to-arrest-nicolas-maduro"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "…to advise  and consent.\n\nBoy, when I think of supporting Lloyd Austin for Secretary of  Defense, a decision I came to regret--not because I didn't like him but  because he proved to be a pretty bad Secretary of Defense--nonetheless,  nonetheless, Joe Biden had won the election, and that is who he chose.  When I supported Pete Buttigieg for Secretary…", "date": "2025-08-02", "source_url": "https://justfacts.votesmart.org/public-statement/1694711/9999"}, {"senator": "Dave Joyce", "party": "Republican", "sentence": "…2018, fentanyl-related  substances could only be controlled individually, allowing cartel  chemists to easily create new uncontrolled compounds. This temporary  rescheduling proved to be effective as the number of new compounds  since then has significantly declined.\n\nThe prevalence of fentanyl-related substances and continued  trafficking of dangerous…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692347/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Ronny Jackson", "party": "Republican", "sentence": "…Kissimmee, Florida, for her exceptional service, tireless  dedication, and unwavering commitment to the people of Texas' 13th  Congressional District. Over the years, Kathy proved to be an  invaluable asset to my office, where her attention to detail was  crucial in my ability to represent and serve my constituents.\n\nKathy discovered her passion for…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697542/recognizing-and-expressing-gratitude-to-former-director-of-operations-kathy-zhu"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…in Washington,  D.C. It supports community banks. It focuses on supply-side solutions,  not failed subsidies that only drive prices higher.\n\nUnder President Donald Trump, we proved that when we cut regulations,  unleash private investments, and trust American workers, the economy  grows and families thrive. This bill applies that same America First,…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699809/lowering-housing-costs-and-advancing-main-street-community-banks"}, {"senator": "Gary Palmer", "party": "Republican", "sentence": "…baseball State championship.\n\nIn the fourth inning, the Panthers were tied with Leroy High School  4-4. Ross Hudson, who was named MVP, singled, driving in the go-ahead  run that proved to be the difference. Pitchers Maddox Vickery and  Blaise Vickery held Leroy scoreless for the remainder of the game,  securing the 1A championship. This was Hackleburg's second…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692105/congratulating-vincent-high-school"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…policy that even Governor Newsom has  admitted is fundamentally unfair. That policy is one that allows for  biological males to compete in women's sports.\n\nToday, that warning proved well-founded as the Department of  Education concluded its investigation, finding that California is in  blatant violation of Title IX. As a result, our State could lose its…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692907/warning-californias-political-leadership"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…Trump acted, and it was brilliant, it was bold, and it will live in  history. To all those who took part in this, God bless you. We have the  finest military on Earth. We proved that yet again. But you can have  the best military, and if you don't have the right Commander in Chief,  nothing happens. We got the right Commander in Chief married up with…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692780/iran"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…their successful bombing of the three nuclear  facilities in Iran over the weekend.\n\nImagine flying 37 hours in a B-2 bomber to defang a nuclear Iran.  These successful strikes proved to the world yet again that the United  States military is the best and most capable in the world.\n\nI thank the men and women of U.S. Northern Command and Cheyenne  Mountain…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692889/congratulating-the-united-states-military"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…``cannot, and [does] not, discount the possibility that Hamas . . .  could exploit the conflict to call on their supporters to conduct  attacks on our own soil.'' These words proved to be prophetic.\n\nOn June 1, 2025, Mohammed Sabry Soliman, an Egyptian national,  attacked pro-Israeli demonstrators who were marching in Boulder,  Colorado, in  support of…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697237/no-immigration-benefits-for-hamas-terrorists-act-of-2025"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…with or convicted of crimes were  deported and over 2 million self-deportations, ending Biden-era release  incentives and restoring credible consequences.\n\nThis administration proved what Washington refused to admit for  years: that border security works when the law is enforced. President  Biden used to say that Congress needed to pass bipartisan legislation.…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699277/highlighting-republican-successes-in-2025"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…Representatives as Policy Advisor and Counsel to  Congressman David McKinley (WV-01) before becoming General Counsel to  Senator Dan Sullivan of Alaska. Through these roles, Jake proved his  expertise in energy and environmental policy. As Chairman of the House  Committee on Energy and Commerce, I was pleased to have him as a member  of my team as Chief Counsel…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689859/recognizing-jake-tyner"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…the dignity of work, and the hope that comes with it.\n\nAt a time when much of our Nation's industrial foundation has eroded,  Mike made a different choice--he reinvested. He proved that American  manufacturing can still thrive, that ``Made in Bucks County'' still  matters, and that a business rooted in values can lift entire  neighborhoods.\n\nMike's commitment…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690252/recognizing-michael-j-mabin-jr-50-years-of-life-leadership-and-service"}, {"senator": "Brad Finstad", "party": "Republican", "sentence": "…Associated General Contractors last  Tuesday.\n\nBrian joined the family business, Mathiowetz Construction, full-time  in 1981, working for his father Richard.\n\nBrian quickly proved to be a driving force behind the company's  growing success, recognizing early on that good businesses invest in  good people.\n\nAcross southern Minnesota, Mathiowetz Construction…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688312/recognizing-brian-mathiowetz"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…second-place winners of the  69th Annual Tevis Cup, a grueling 100-mile endurance trail ride from  Robie Park to Auburn, held on July 12 of this year.\n\nThis year's competition proved even more challenging than usual, with  the heat and rocky road providing unforgiving conditions for all  competitors.\n\nOf the 105 entrants, only 43 were able to complete the…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694130/dismantling-californias-citizens-redistricting-commission"}]