[{"senator": "Al Green", "party": "Democrat", "sentence": "…what we call due process. In two venues,  he said it.\n\nNow, the President didn't come out and say, I am not going to honor  due process, no. He has said what a reasonable and prudent person can  conclude as his indication of not going to honor due process of the  law, which is something the Constitution requires if you are going to  take life, liberty,…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690560/a-message-to-the-cabinet"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…program and fundamental humanitarian principles.\n\nWe urge Congress and the Administration to extend and       redesignate Haitian TPS. This decision is lawful,       economically prudent, and deeply humane--and it affirms the       dignity and indispensable contributions of the Haitian       community in Massachusetts.                                __________…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699720/witness-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…we are just beginning to  broadly deploy it, as there is still much to learn about its potential.  This is especially true for smaller communications providers who must  be prudent about their resources and refrain from taking unnecessary  risks in introducing new technology into their networks.\n\nWe know Open RAN can both help introduce competition into…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693486/open-ran-outreach-act"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…what will happen to these important programs with  the administration's plan to eliminate ACL. We are a coequal branch of  government, and we need this information to make prudent decisions on  behalf of our constituents. Yet, as of yesterday, the majority blocked  our ability to get those questions answered.\n\nUnfortunately, the Republican majority…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690500/blocking-resolutions-of-inquiry"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…enabled by a complacent Republican-led Congress, to  systematically weaken VA, we must reevaluate whether it remains  appropriate to rely on this offset. I believe it would be prudent to  discuss with the Senate whether a more appropriate offset can be  identified before this bill becomes law.\n\nMr. Speaker, with those caveats I have identified, I support…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689624/vietnam-veterans-liver-fluke-cancer-study-act"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…Congressional Budget and  Impoundment Control Act does not permit the withholding of funds  through their date of expiration and notes the President's  responsibility in ensuring prudent obligation of funds.''\n\nRepublicans and Democrats alike should reject this ploy for what it  is: a direct assault to Congress's Article I power. Allowing any  Administration…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694158/senate-amendment-to-hr-4"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…peacock around, parading about  how atrocious the deficit is. This bill is going to add $4 trillion to  the deficit. It is not conservative. It is not principally, financially  prudent, responsible legislation. It is outrageous and borderline  criminal against the people of this country.\n\nLet's talk about food assistance. Mr. Speaker, one in seven Texans…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691436/republican-budget-bill"}, {"senator": "Rick Larsen", "party": "Democrat", "sentence": "…deliberately to give the agency's investigators the room to pursue  every lead and vet every theory, especially when it comes to complex  accidents.\n\nThis patience proved to be prudent. For instance, the hypothesis that  ADS-B In coupled with the right interface could have given more warning  was in fact correct.\n\nHowever, some of the NTSB's initial theories…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700110/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "Mr. Speaker, I rise in opposition to H.R. 2988, the Protecting  Prudent Investment of Retirement Savings Act. This bill is premised on  the Republicans' mistaken belief that they know best when it comes to  investing workers' retirement savings.…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699154/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…that they want to add,  and it directly conflicts with the provisions in the law right now that  require States to maintain a diverse portfolio of electricity and  engage in prudent resource planning.\n\nWho loves this? Oil and gas companies love it. Investor-owned  utilities love it. They will profit at the expense of hardworking  Americans. Energy generated…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697883/state-planning-for-reliability-and-affordability-act"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…with wisdom and virtue; that, in fine, the happiness of the people of  these states, under the auspices of liberty, may be made complete by so  careful a preservation and so prudent a use of this blessing as will  acquire to them the glory of recommending it to the applause, the  affection, and adoption of every nation which is yet a stranger to it.…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700163/reading-of-washingtons-farewell-address"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…on the backs of  working Americans to give those benefits to the wealthiest.\n\nNow, Biden, who shrunk the deficit a bit--didn't eliminate it--still  spent what any fiscally prudent person might say is really problematic.  Let's not make this blindly partisan. But for anybody who would  criticize Biden and follow Trump into what he is doing with this…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…America today. From Arkansas to Colorado to Minnesota  and everywhere in between, more coal is their prescription, Mr.  Speaker.\n\nIn Colorado, we certainly don't think that is a prudent approach. I  will say I regret that the Speaker didn't indulge me in the colloquy  that I had hoped I could engage in with the chairman whom, of course, I  greatly respect.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694889/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…House Republican leadership prevented the amendment  from being approved in the committee.\n\nMr. Speaker, we should trust the professionals who are legally  obligated to make prudent decisions on behalf of retirement plan  participants, not undermine their ability to make sound investment  decisions.\n\nMr. Speaker, I urge my colleagues to oppose H.R. 2988.…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699157/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…relationships that we have with community banks.\n\nMoreover, I do not know why Republicans rushed this bad resolution to  the floor, bypassing a committee markup. That would have been prudent.  As I would point out, this resolution is actually a giant waste of  time, as it would rescind a rule that was already rescinded by the OCC.\n\nYou heard me right. President…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691499/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…ask  for its immediate consideration.\n\nThe Clerk read the title of the bill.\n\nMr. WALBERG.  2988.\n\nMr. Speaker, I rise today to speak in support of H.R. 2988, the  Protecting Prudent Investment of Retirement Savings Act, introduced by  Representative Rick Allen, chairman of the Subcommittee on Health,  Employment, Labor, and Pensions.\n\nAt its core, this…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699160/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…tireless work on behalf of American workers, and specifically  for his support of the legislation before us today.\n\nMr. Speaker, I rise in support of H.R. 2988, the Protecting Prudent  Investment of Retirement Savings Act, legislation I introduced earlier  this year to ensure hardworking Americans do not have their retirement  savings jeopardized by politically…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699156/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…bank transactions. It can reduce the  effectiveness of M&A activity that preserves the presence of community  banks in underserved areas, prevent institutions from pursuing prudent  growth strategies, and actually undermine competition by preventing  firms from growing to a larger scale, effectively creating a `protected  class' of larger institutions.''…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691498/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…meet while the program is unauthorized, however,  so reauthorization is essential to get the committee working again.\n\nWhile we cannot stop volcanic eruptions, we can take prudent steps to  minimize damage and loss of life. That is precisely what this program  is intended to do.\n\nI ask my colleagues to join me in supporting this bill, and I reserve…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698113/southcentral-foundation-land-transfer-act-of-2025"}, {"senator": "Mike Crapo", "party": "Republican", "sentence": "…against Americans,  against our farmers, and against our businesses.\n\nThe President's decision to pause the full reciprocal tariffs for 90  days, other than for China, was a prudent move in that respect. It  helped mitigate the impact. It discouraged retaliation but also  continued the serious negotiations by our trading partners to address  longstanding…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690537/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…risks that could ripple through the broader financial  system. Also reinforcing the primacy of the U.S. dollar, this bill  ensures that dollar-backed stablecoins are subject to prudent oversight  and sound risk management.\n\nAt a time when other nations are rapidly moving to define the future  of digital finance, S. 1582 ensures the United States takes a…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693544/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…and  regulate the value thereof, implicitly denying to the executive branch  or to the Fed the ability to do this without congressional authority.\n\nThat said, I think it is prudent to explicitly deprive the Fed of the  authority to do this for a variety of reasons.\n\nAs has been said, Americans' financial privacy is at stake here, and  we should not try…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693730/anti-cbdc-surveillance-state-act"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…no qualms  with supporting it in their last majority on a much broader and open- ended scale as it related to COVID.\n\nThis is why delaying the NEA disapproval resolution is prudent.  President Trump must be given the leeway to negotiate on a global scale  parameters that will make good on his promises of securing the border,  protecting our communities,…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689862/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…Child and Elder Care  Solutions Act; H.R. 2312, the Tipped Employee Protection Act; H.R.  4366, the Save Local Business Act, under a closed rule; and H.R. 2988,  the Protecting Prudent Investment of Retirement Savings Act, under a  structured rule.\n\nOne hour of debate each for H.R. 2262, H.R. 2270, H.R. 2312, H.R.  2988, and H.R. 4366 shall be equally divided…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698949/providing-for-consideration-of-hr-protecting-prudent-investment-of-retirement-savings-act-providing-for-consideration-of-hr-flexibility-for-workers-education-act-providing-for-consideration-of-hr-empowering-employer-child-and-elder-care-solutions-act-providing-for-consideration-of-hr-tipped-employee-protection-act-and-providing-for-consideration-of-hr-save-local-business-act"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…with wisdom and virtue; that, in  fine, the happiness of the people of these States, under the auspices  of liberty, may be made complete by so careful a preservation and so  prudent a use of this blessing as will acquire to them the glory of  recommending it to the applause, the affection, and adoption if every  nation which is yet a stranger to it.…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700269/president-washingtons-farewell-address"}, {"senator": "Robert Bresnahan, Jr.", "party": "Republican", "sentence": "…Reserve, the nonbank SBLCs are primarily regulated by the SBA,  meaning they are not subject to the same regulations and requirements.\n\nTogether, the limited number of SBLCs and prudent lending standards  that used to be in place at the SBA were necessary guardrails to ensure  that the 7(a) program remained zero-subsidy, costing taxpayers zero  dollars.…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692066/capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…it all through my early career when  I couldn't make payments between paychecks. A young family, one income,  lots of children, a lot of expenses, you do it. It is a good, prudent  practice.\n\nAs a community banker for decades, I can promise you families were  smart about it. There is nothing hidden about it. It is fully present.  Consumers opt in to…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689849/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…Adversaries like China.\n\nWe want to have a presence on the Continent of Africa. That is the  next frontier. This assures us of that.\n\nIn the early days, caution was certainly prudent. Stablecoins are a  novel technology with significant questions regarding how to protect  consumers, like what happens in the event of bankruptcy and how to  ensure that the…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693846/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}]