[{"senator": "Alma Adams", "party": "Democrat", "sentence": "…public broadcasting was there when traditional communication failed.  Widespread power, cellular, and internet outages meant that, for  thousands of North Carolinians, public radio was how they received  their news.\n\nOur local public broadcasting stations provided lifesaving updates  for our residents, broadcasted emergency resource information like…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693723/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…a basketball game  or two.\n\nNow, over the past several weeks, I have received texts, calls, and  people coming to my office pleading with us in the U.S. Senate to save  public radio and public broadcasting. New Mexicans who work at radio  stations are calling in to say that they are worried about  losing their jobs. From every corner of our State, New…", "date": "2025-07-09", "source_url": "https://justfacts.votesmart.org/public-statement/1693299/9999"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…rescissions that would undermine the public  broadcasting infrastructure that supports the access of communities to  emergency alert systems. Senator Alsobrooks knows the role of public  radio and television in ensuring communities have access to information  and emergency alerts.", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693616/hr-4"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "Ms. BALDWIN. Mr. President, the rescissions package before us reduces  access to educational programming for children and locally produced  public radio and television programming. It diminishes America's global  leadership while eliminating lifesaving aid from the world's most  vulnerable populations.\n\nI want to spend a…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693591/rescissions-act-of-2025"}, {"senator": "Ruben Gallego", "party": "Democrat", "sentence": "…Committee on       Appropriations to modify the proposed rescission of funds       from the Corporation for Public Broadcasting to exclude       amounts designated to support public radio or television       stations that are licensed to or primarily serve rural areas       or Tribal communities.", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693638/hr-4"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…rescission package.\n\nThe GOP is canceling $9.4 billion, yes, billion, in funding for  programs that fund lifesaving work across the world. It is funding for  public television and public radio, for agriculture and research jobs,  in my own district, and to codify the DOGE cuts that two-thirds of  Americans oppose. Our own President asked his other Cabinet…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692386/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…legitimize and validate the views of this man.\n\nMr. Martin's weak protests that he didn't know anything about what  his views really were were debunked not only by National Public Radio  but by the record of Martin's involvement with other extremists.\n\nFor example, Mr. Martin has also praised Jack Posobiec, an anti- Semitic conspiracy theorist with links…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691194/calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism-and-educate-the-public-on-the-contributions-of-the-jewish-american-community"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…soft  power is at risk with this strategy of canceling these programs.\n\nI think about rural Oregon, where so often the warnings on floods or  fires is broadcast over the public radio system, and all kinds of  different channels have different programs that people become quite  attached to. So there are simply good humor programs that are fun to  listen…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693589/rescissions-act-of-2025"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…country's only  local, no-cost, commercial-free, nonprofit news and information  service, and passing this bill puts this service at great risk. For  stations like Minnesota Public Radio, valued services will be eroded.  For many smaller stations in rural communities across the country,  these cuts will prove utterly devastating. They will not survive,…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692634/rescissions-act-of-2025"}, {"senator": "Tina Smith", "party": "Democrat", "sentence": "…afraid to send them to school.\n\nIt is in Mankato, MN, which is in the southern part of the State. It  is another regional center, a farming community. I heard today on the  public radio station that the local immigrant rights organization is  getting 400 calls a day from people who are trying to figure out what  their rights are, what to do: A family member…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699416/9999"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…primarily two major elements. One element was foreign  aid, humanitarian assistance around the world paid for by the United  States. The other element was public broadcasting--National Public  Radio, for example. So $8 billion was taken out of foreign aid, and $1  billion was taken away from public broadcasting.\n\nIt was a close vote in the Senate. Two…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693932/rescissions"}, {"senator": "Jacky Rosen", "party": "Democrat", "sentence": "…which the Senate is not in session, with changes that--\n\n(1) are within the jurisdiction of such committee; and\n\n(2) strike provisions that would lead to cuts to the Public       Radio Satellite System, which enables national emergency       alerts.\n\nWhen the Senate considers the rescissions bill it is my intention to  make the following motion to recommit…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693632/hr-4"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…LEGER FERNANDEZ. Mr. Speaker, Republicans are destroying that  which is good and kind in America. Abraham Lincoln said that America is  ``the last best hope of Earth.''\n\nOur public radio and TV and our work across the globe for public  health and peace are what is the best of America. They are taking Elmo  off the air because they gave billionaires a tax…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693718/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…learn about our democratic system of government.\n\nThis legislation would cut $1.1 billion in funding for the  Corporation for Public Broadcasting, which supports over 1,500 public  radio and television stations across the country, including over 50 in  Colorado. Colorado outlets stand to lose over $7.6 million in funding-- with a disproportionate effect…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693642/hr-4"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…today to congratulate  Danny Miller on his retirement as Co-Executive Producer for WHYY's  Fresh Air with Terry Gross & Tonya Mosely, one of the most successful  national public radio shows in the Nation.\n\nMiller, who joined the Fresh Air team in 1978 as an intern, has been  an integral part of the show's tremendous growth, now reaching over 6  million…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697682/recognizing-the-retirement-of-danny-miller-as-co-executive-producer-of-fresh-air"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…Africa; cut  $10 million for male circumcision in Mozambique; cut $20 million for  the Arab ``Sesame Street'' in the Middle East; and we cut $600 million  from National Public Radio. Free enterprise in America is alive and  well.\n\nPresident Donald Trump is the President of peace, ending eight wars  in 8 months. Tell me who in history has ever done this.…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697390/providing-an-update-to-the-american-people"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…$1 too many in our view.\n\nThen there is NPR. I honestly don't even know where to begin on that  one. Even if someone were to accept the premise that we need to finance  a public radio outlet, then certainly we can all agree that it simply  cannot be NPR any longer. NPR's own CEO testified before Congress that  she has never seen any political bias at…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692391/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…extremely critical of the Governor, for example, of not doing that, of  exaggerating the amount of fire protection work done by almost 700  percent, according to Capital Public Radio. We have made good progress  in terms of bringing Federal resources to get this work done, and I  will continue to advocate for that here in every way that I can.", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688626/finding-common-ground"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…people of Texas want their money to be  used for the things they care about.\n\nWe have listened to the minority leader come to the floor and lecture  us about the virtues of public radio and public broadcasting.\n\nYet, nevertheless, the truth is it took NPR through Texas public  radio 19 hours to post anything about the flooding on its social media  pages…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693712/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "Adams, Douglas: PBS NewsHour; Adams, Jacob: THE DAILY       SIGNAL; Adams, Jonas: NATIONAL PUBLIC RADIO (NPR); Adams,       Kimberly: MARKETPLACE RADIO; Adams, Lori: FOX NEWS; Adkinson,       Nicholas: ABC NEWS; ADLERBLUM, ROBIN: ABC NEWS; Adly, Jill:       NEXSTAR MEDIA GROUP;…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698150/members-entitled-to-admission-to-the-119th-congress-radio-and-television-correspondents-gallery"}]