[{"senator": "Becca Balint", "party": "Democrat", "sentence": "…in the  Navy. He was awarded the Presidential Medal of Freedom. He was someone  who stood up for the rights and dignity of all, and he was assassinated  while serving in public office. His memory is worthy of dignity and  respect.\n\nRemoving his name from a ship is small and it is petty. It is  obviously an attempt to erase the history of anyone who shows…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692120/stop-renaming-ships"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…mourn the unbearable loss of one of  our Nation's finest public servants.\n\nI first Melissa Hortman in 1998 when we knocked doors together during  her first campaign for public office. Back then, I was a member of the  Minnesota House of Representatives and Melissa was a young, determined  candidate running in a district that would be difficult for any…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693118/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…War, and our journey as the United  States of America began. Yet, 250 years ago, I could not be standing  where I am today. Women did not have the right to vote, to hold public  office, or to own property 250 years ago. Some women were property 250  years ago. Women were a footnote to the story of our country's founding  250 years ago.\n\nToday, 250 years…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689165/womens-history-month"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…tariffs, is he protecting American  consumers and small businesses? No, not so much. More likely, he is  cutting deals for his crypto friends. That is the essence of selling  public office, and it is corruption.\n\nBut put aside the criminal violations of law that may be involved  because the U.S. Supreme Court has given him immunity for what he is  doing in…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691548/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…officials from holding financial stakes in stablecoin issuers. It  doesn't address the foreign investors piling into these ventures. It  doesn't even try to draw a line between public office and private  banks.\n\nThis isn't a framework for innovation. It is a framework for more  corruption.\n\nIf we are serious about protecting consumers and about protecting our…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693830/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "…wrong. This is not putting our country first. And I have to  say, I hope we can turn things around here in the coming weeks. But in  my lifetime, and certainly in my time in public office and in my time  serving this country, I have never seen anything like I have seen this  week.", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692559/alex-padilla"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "Ms. BYNUM. Mr. Speaker, I first ran for public office to make all of  our  kids' futures brighter, and our government hasn't done the same.  Millions of young Americans have done exactly what has been asked of  them, but our…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699836/empowering-americas-next-generation"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…more inclusive Rochester. She embodies the very essence of public  service, leading with empathy and an unshakable belief in the power of  community.\n\nLong before she held public office, Rose was deeply embedded in the  Rochester community through her longstanding work helping Jamaican  immigrants navigate complex landscapes of services and programs. She…", "date": "2025-06-13", "source_url": "https://justfacts.votesmart.org/public-statement/1692570/recognizing-rose-bonnick"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…Member of Congress, but as a healthcare  practitioner. Like so many of my fellow healthcare workers, I became an  occupational therapist to help people. Before entering public office, I  spent over a decade working with seniors and children to help them  achieve independent, full lives.\n\nLast week, the Trump administration made it harder for our healthcare…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689781/defending-social-services-and-programs"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…unambiguous public statements  threatening media outlets, current and  former officeholders, and advocacy organizations. He has pursued  meritless litigation, leveraged his public office for private gain, and  perverted the course of justice and the integrity of the judicial  system to extract tens of millions of dollars in putative settlements,  effectively…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691079/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…profit.\n\nIn the past year alone, Donald Trump has doubled his fortune from  $2.3 billion to $5.1 billion. He now has over $5 billion. How is he  doing that? By treating public office like a personal business  opportunity.\n\nCrypto investments make up $2.9 billion of the Trump family's net  worth. Just days after the inauguration, Trump announced a Trump…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691208/ending-pay-for-play-political-gifts"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…responsibility that accompanies public service.\n\nAs public officials across the country are sworn into office, each  affirms a commitment to faithfully execute the duties of public office  and defend the Constitution of the United States. But more and more  Americans are losing faith that the actions of our public officials are  principally guided by our…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690041/valuing-truth-fullness-lessons-from-jury-trials"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…system is rigged for wealthy  elites and insiders. Most troubling, however, is that Citizens United  threatens to compromise the incentives of those of us who serve in  public office.\n\nHouse campaigns now require previously unimaginable sums of money.  Members spend far too much time courting wealth or corporate donors  rather than engaging with constituents.…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699248/citizens-united-16th-anniversary"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…dangerous,  weaponized apathy that says Islamophobia is somehow acceptable at the  highest levels of government. All of us, but especially those of us who  serve in this body, in public office, have a duty to end that silence  and loudly and resolutely condemn Islamophobia and anti-Arab hate.\n\nAnd while others seek to divide and distort circumstances to advance…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698866/commerce-justice-science-energy-and-water-development-and-interior"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…M.D. degree and became the first Filipino American to       start a medical practice in Hawaii in 1952.\n\nPeter Aduja became the first Filipino American elected to       public office in the United States when he was elected to the       Hawaii Territorial House of Representatives in 1954.\n\nLarry Ramos became to first Filipino and Asian-American to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695943/recognizing-filipino-american-history-month"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…not only in its historic landmarks  and longstanding neighborhoods, but also in the character of its  people--those who have worked to build local businesses, serve in  public office, educate future generations, and contribute to the  cultural and economic vitality of the region. The city's commitment to  preserving its heritage while preparing for…", "date": "2026-02-20", "source_url": "https://justfacts.votesmart.org/public-statement/1700091/recognizing-the-city-of-brooksville"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "…own district, we have seen an over 1,000 percent  increase in the rate of fentanyl poisoning and deaths.\n\nMr. Speaker, I had the most difficult day in my over 20 years in  public office recently when I had to console one of my constituents, a  mother who lost both of her sons on the same day to the same fentanyl  poisoning event.\n\nWe must give our law…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692350/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…schools. For  example, the founders of tremendous charter school networks KIPP, IDEA,  and YES Prep are TFA alums.\n\nPersonally, one of the main reasons I decided to run for public  office, first in the legislature and then for Congress, was my  experience as a classroom teacher. It motivated me to become the vice  chair of the California State Assembly Education…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "…Bernardino County, which reduced the city's unsheltered  homeless population by fifty-seven percent and now serves as a model  for other communities.\n\nIn addition to her work in public office, Debra has been deeply  involved in education and community service. She co-founded the  Adelanto Elementary School District's first Special Education Parent  Advisory…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696324/recognizing-the-service-of-debra-jones-on-her-retirement"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…the maps.  Instead, this map was drawn behind closed doors in a matter of days.\n\nIt throws out the protections that say those who draw the maps are  not allowed to run for public office. This map was drawn by people who  are in public office and hope to run in the very districts that they  are drawing.\n\nThe protections that say that the district lines…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…redistricting:\n\nRedistricting occurs once per decade after the Census.\n\nThe legislature is barred from participating.\n\nThe members of the citizens commission may not run for public office.\n\nDistricts are to be drawn in an open process based on extensive  public input.\n\nBoundaries are to be set based on neutral criteria like keeping  communities together.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694777/protecting-representative-form-of-government"}]