[{"senator": "Jack Reed", "party": "Democrat", "sentence": "…policy which encouraged  colleagues and constituents and elected officials to become engaged. He  devoted his life to improving our community, to strengthening public  health and public safety, and to creating new opportunities for all  Rhode Islanders to thrive. He made significant strides toward improving  the lives of working Rhode Islanders, and…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691451/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…like  the very people it is sworn to protect, lives in the community it  serves, and caters to the unique needs of D.C. residents.\n\nMrs. McIVER. H.R. 5143 discourages basic public safety, pushes lies  about crime in the Black and Brown communities, and puts everyone in  harm's way and at risk.\n\nThat is why it is no surprise of who the sponsor is of this…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695638/district-of-columbia-policing-protection-act"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…whose public  service enables residents to access critical services and programs. I  remain committed to continuing to deliver the resources our communities  need to improve public safety, create well-paying jobs, and expand  economic opportunity for Elmwood Park and across Illinois' Third  Congressional District.\n\nMr. Speaker, I congratulate Elmwood Park…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689781/defending-social-services-and-programs"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…neighborhoods, and drive down crime.       Building on this progress, my Administration established the       Safe and Beautiful Emergency Operations Center to coordinate       public safety and beautification efforts as the presidential       emergency declaration ends. This structure ensures that DC       will remain proactive--bringing together local and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695641/district-of-columbia-policing-protection-act"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…citizens  are being taken care of, being targeted instead of all of the violent  criminals?\n\nThis is what is happening under Trump. They are not prioritizing  threats to public safety. They are not going after violent offenders.  They are taking workers out of our economy. They are spreading fear in  communities where families should feel safe, and they…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695521/visit-to-bluebonnet-detention-facility"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…arrived at school safe and ready to learn; as a mechanic at  Dawson Motor Company, tending to the machines that helped his neighbors  make a living; and later in the ranks of public safety--with the Dawson  Fire Department, the Dawson and Dougherty County police departments,  and ultimately the Terrell County Sheriffs Department. Each step in his  career…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699826/in-memory-of-sheriff-john-bowens"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…also eliminate serialization, making these dangerous  devices untraceable. H.R. 2189 is a reckless expansion of the gun  industry.\n\nMr. Speaker, because we all care about public safety, I urge my  colleagues to stand with me and my colleagues in opposition to this  dangerous piece of legislation.", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700040/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Tina Smith", "party": "Democrat", "sentence": "…of mine is detained. I  don't know where they are.\n\nThis is happening in dozens of cities.\n\nSo what we have here, colleagues, is a campaign. It is a campaign not  about public safety; it is a campaign about fear and intimidation. This  is about secret police roaming in our cities with no identification and  no name tags.\n\nWhat they do is they overtly…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699416/9999"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…storms that are made worse by  climate change to make fossil fuel extraction the number one priority  going forward for how we manage our public lands. Wildfire defense,  public safety, recreation, and conservation all take a backseat now to  maximizing corporate profits, even in our most fragile landscapes like  America's Arctic.\n\nAmericans want clean…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696881/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…Nicaraguans and Venezuelans.\n\nNo. 88, moved to sunset critical environmental regulations.\n\nNo. 89, blocked $2.2 billion in Federal grant funding to Harvard.\n\nNo. 90, froze public safety grants for public broadcasters in our  country.\n\nNo. 91, halted Federal leasing and permitting for wind projects in  our country as they open our public lands for coal…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690442/trump-administration-first-100-days"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…in  2022, 268 in 2023, and 279 in 2024. In just 4 years, America's largest  city has seen an over 800 percent surge in these fires, creating an  unprecedented crisis in public safety.\n\nPoorly manufactured lithium-ion batteries often imported from China  are hidden ticking time bombs waiting to detonate in American homes and  neighborhoods. The danger…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690260/setting-consumer-standards-for-lithium-ion-batteries-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…check-ins,       targeted social-service referrals, and text message reminders       consistently outperforms cash bail systems at securing       appearance and protecting public safety. Maintaining housing,       employment, child-care, and medical care substantially       reduces recidivism and promotes community safety. D.C.'s       current pre-trial…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696949/opposition-letter-led-by-the-american-civil-liberties-union-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…core  missions and have instead been pressured to focus exclusively on  arbitrary quotas and removing immigrants from our country, even those  who pose no serious threat to public safety.\n\nThis corruption of DHS's mission has directly contributed to the  chaos and violence we have seen in Minneapolis and communities all  across our country. That is why…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699402/9999"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…rise in strong opposition to this legislation. This  bill seeks to create 14-year-old prisoners in the adult criminal legal  system. We know this approach doesn't improve public safety. It only  traumatizes our babies. History tells us as much.\n\nAntron McCray, 15 years old;\n\nYusef Salaam, 15 years old;\n\nRaymond Santana, 14 years old;\n\nKorey Wise, 16 years…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695594/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…power, but because they will harm the people of our Nation's Capital.\n\nAlso, and I think this is where the conversation needs to be had, if  we actually want to address public safety and help communities across  this country that elected us to do this work, we need to be addressing  real solutions. We need to be addressing the addiction crisis;  investing…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696976/district-of-columbia-cash-bail-reform-act-of-2025"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…and on public  transportation in the State in which they are licensed. This bill  affords qualified law enforcement officers the same privilege.\n\nThis legislation improves public safety as our officers face  increasingly greater dangers, and current restrictions hinder their  ability to carry firearms and protect themselves and others.\n\nAt a time when…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691241/leosa-reform-act"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "Mr. GARBARINO. Madam Speaker, I rise in support of my bill, H.R.  2096, the Protecting Our Nation's Capital Emergency Act.\n\nWashington, D.C., is facing a public safety crisis. Last month alone,  20 people were shot and killed in the District of Columbia. In recent  years, D.C. was rated the fifth deadliest city in America.\n\nAt the core…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692303/protecting-our-nations-capital-emergency-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…code should not  put unnecessary barriers in front of technologies designed to reduce  harm.\n\nRepresentative Schweikert's legislation helps align our tax policy  with our public safety goals. It supports innovation, it encourages  less lethal means of law enforcement, and removes an outdated burden  that never made much sense to begin with.\n\nWhen Congress…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700032/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…also slows innovation in technologies       explicitly designed to de-escalate encounters and reduce the       need for deadly force, an outcome directly at odds with       public safety goals nationwide.\n\nH.R. 2189 corrects this problem by establishing a       modernized definition of a ``less-than-lethal projectile       device'' and creating a DOJ-guided,…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700037/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Brad Finstad", "party": "Republican", "sentence": "…have enacted sanctuary city policies that have further  encouraged waves of illegal immigrants to come into our communities,  circumventing Federal law and raising serious public safety concerns.\n\nLast November, the American people overwhelmingly elected President  Trump with a clear mandate to secure the border and restore public  safety in our communities.…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691945/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…land faced  a structural disadvantage. They can't collect property taxes on those  lands, yet they are still expected to keep schools open, maintain  roads, and provide public safety. The Forest Service manages millions  of acres in our region, but it is our local government that is left  holding the bag.\n\nThe One Big Beautiful Bill Act helps fix that…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692323/taking-an-important-step-for-rural-america"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…books to children at the local library, partners with schools  to improve traffic flow and safety, provides educational presentations  about accident investigations, gives public safety presentations to the  town, and so much more. Through local partnerships, he has assisted in  contributing numerous bicycles and helmets to underprivileged children  in…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…deadly force, Democrats are trying to scare the public with cherry- picked statistics and misleading claims.\n\nLet's be honest. If Democrats were truly concerned about public  safety, they would not oppose a bill that encourages de-escalation and  reduces the likelihood of fatal outcomes and encounters.\n\nDespite all this rhetorical nonsense about policing…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699905/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…on President Trump's agenda. It cracks down on fentanyl and  foreign adversaries, defends American values and principles, and  ensures that taxpayer dollars are spent on public safety and national  security, not bloated bureaucracy.\n\nIt provides strong support for State and local law enforcement  partnerships, and it defends the Second Amendment and…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698748/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…direct service to the people of Cooke County as the Emergency Manager  and Fire Marshal. In this role, which he held for an additional 22  years, he became a cornerstone of public safety and emergency  preparedness in North Texas. Mr. Fletcher led Cooke County through  seven federally declared disasters, investigated over 400 fires, and  oversaw numerous…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693149/recognizing-mr-ray-fletcher"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "…the city has grown to  serve a population of roughly 9,015 across more than 7 square miles.\n\nToday, Fruitland Park provides a full range of municipal services,  including public safety through police and fire departments, essential  infrastructure support via a robust public works department, access to  clean water and sanitation utilities, and vibrant…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693999/recognizing-the-100th-anniversary-of-the-city-of-fruitland-park-florida"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…diabolical act in our Nation's Capital.\n\nAccording to DHS, over 5,000 Afghans brought to the United States  through Operation Allies Welcome had either national security or public  safety concerns.\n\nWe are importing people who want to undermine and destroy our  country, and both sides of the aisle have been guilty of this. This is  not a debatable reality.…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698106/bringing-america-back-to-its-roots"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…Company. Over the course of his long and distinguished  career, Gary has responded to over 200 emergencies in the past year  alone, demonstrating his unwavering commitment to public safety.\n\nGary has held multiple roles within the company, including Assistant  Chief and company mechanic, and has been a cornerstone of the social  and fundraising efforts that…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699580/recognizing-gary-braunscheidle"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…wrote a letter  in strong support of the Trafficking Survivors Relief Act. This  carefully crafted legislation strikes the right balance in protecting  victims' rights and public safety.\n\nLet's work together to fight back against this evil, to help victims  and survivors begin a new chapter, and to allow them to take on every  opportunity that life hands…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697182/trafficking-survivors-relief-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…lands.\n\nUnlike the Lower 48 model of indigenous representation       where tribal governments typically administer the delivery of       services such as healthcare, public safety, education, land       management, and economic development, the passage of ANCSA       created a shared system of Alaska Native representation and       delivery of services.…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696834/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision"}]