[{"senator": "Lou Correa", "party": "Democrat", "sentence": "…encountered.\n\nIf Ms. Greene's bill mirrored what we report on known and suspected  terrorists, I would be happy to support it. However, that is simply not  the case here. By publishing this information in real time, bad actors  would be able to tell who is getting advanced screening from CBP. They  will also be able to tell which locations have been the…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693071/special-interest-alien-reporting-act-of-2025"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…ceremonies and coordinated the  attendance with all JCCIC's traditional guests. They were aided in the  counting by over 200 volunteers. Sarah Wheeling and the congressional  publishing team at the Government Publishing Office oversaw the design,  printing, and inspection of all tickets and program materials, working  efficiently on tight deadlines to deliver…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691709/recognizing-the-joint-congressional-committee-on-the-inauguration"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…done in a mere 65 years.\n\nMr. Speaker, I wish a happy birthday to Bishop Edwers from the floor  of the House of Representatives.                        Recognizing Shoreline Publishing\n\nMr. LATIMER. Mr. Speaker, in a world where local newspapers and radio  stations are disappearing, it is valuable to recognize and salute those  organizations that are continuing…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698604/recognizing-bethesda-baptist-church-and-pastor-horace-sanders-jr"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…process under section 7543(b), the authorization process       under section 7543(e)(2)(A) involves providing notice of a       public hearing and comment period and publishing notice of       the decision. See id.; California Waivers and Authorizations       Website.      EPA Notices of Decision\n\nAt issue here are the following EPA Clean Air Act…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691583/hj-res-88"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…Prince William County, in particular, was the first county to publish  voting result tapes online in Virginia history. They are not only  saving the results, but they are publishing them.\n\nHere is the truth: In Prince William County, Fairfax County, and  counties all across the country, officials are working tirelessly to  ensure our elections are safe…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690520/election-integrity"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "…operations and try to avoid enhanced CBP  inspections.\n\nHowever, Democrats are for transparency, as Mr. Correa has already  said, and there is nothing stopping DHS right now from publishing these  numbers.\n\nThe Trump administration also could publish this data right now if  they wanted to but continue to choose not to because the folks on the  ground understand…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693073/special-interest-alien-reporting-act-of-2025"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…federally       insured credit unions with more than $1 billion in assets to       disclose income from overdraft and non-sufficient funds fees,       and NCUA therefore ceased publishing this information for       individual credit unions (withdrawal of the Reporting       Requirements). NCUA stated that it would continue to collect       this information…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699835/government-accountability-office-opinion-letter"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…would amend the appointment processes for three key  legislative branch positions--the Librarian of Congress, the  Comptroller General and the Director of the Government Publishing  Office (GPO)--to provide that appointment and removal of their leaders  are the exclusive purview of Congress. These three agencies are  critical to the independent operations…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697708/supporting-the-legislative-branch-independence-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…military construction. I expect and hope that it  will pass in a bipartisan manner.\n\nH.R. 275 is the Special Interest Alien Reporting Act of 2025 which  provides transparency by publishing a monthly report on the number of  special interest aliens attempting to enter the U.S. and includes the  encounter location and their country of origin. This is information…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692813/providing-for-consideration-of-hr-military-construction-veterans-affairs-and-related-agencies-appropriations-act-providing-for-consideration-of-hr-special-interest-alien-reporting-act-of-providing-for-consideration-of-hr-jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-and-providing-for-consideration-of-h-res-condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…2024, he published his first book, The Point: Dawn of the Texas Meth  War, which details the history of the drug epidemic and has been highly  rated by readers. He will be publishing his second book in Fall of 2025  titled Texas Ranger, Wise County. For his outstanding service as a  Texas Ranger, Lane has been recognized as Officer of the Year twice by…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690196/recognizing-congressional-patriot-award-recipient-sheriff-lane-akin"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Industry Group;       Smith, Cara: Inside Washington Publishers; Smith, Joseph: The       Driller; Snider, Ann: Politico; Snyder, Alec: Politico;       Sodergreen, John: Scudder Publishing; Soellner, Mica:       Bloomberg Industry Group; Soellner, Mica: Punchbowl News;       South, Todd: Sightline Media Group Spiegelman, Margaret:       Inside Washington Publishers.…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698171/members-entitled-to-admission-to-the-119th-congress-periodical-press-gallery"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…must quantify uncertainty, as in weather       predictions, spread of disease, or financial forecasting.\n\n(6) Most fields, including analytics, science, economics,       publishing, marketing, actuarial science, operations       research, engineering, and medicine, require data savvy,       including the ability to select reliable sources of data,…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688976/mathematical-and-statistical-modeling-education-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…and even into the Sacramento area. They  may even be coming to Washington, D.C., soon.\n\nTesla has a self-driving feature available on its cars as well and  they have been publishing some very encouraging data. What the data  shows, very clearly, is that even at the current state of the art that  is going to continue to improve, autonomous vehicles are…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697549/congratulating-eco-clean-solutions"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…the risks and benefits of human  cell and tissue transplants.\n\nIt would also require FDA to streamline the regulatory oversight of  these particular products, including by publishing educational  materials and best practices and by conducting workshops and public  stakeholder sessions.\n\nUltimately, H.R. 1082 will increase public awareness, patient safety,…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692768/shandra-eisenga-human-cell-and-tissue-product-safety-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Congress, I asked the Biden Administration to be transparent  about encounters with known or unknown terrorists entering our country.  Their answers were unsatisfactory.\n\nPublishing the number of special interest aliens who have been  granted entry to the U.S. would educate the public on the risks the  U.S. Government is subjecting its citizens to. It…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693075/special-interest-alien-reporting-act-of-2025"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…agency regulations. Part of it is Congress' fault. Part of it is  the agency's fault.\n\nIf you look at this chart, Mr. Speaker, back in 1950, roughly the  time they started publishing the Federal Register, compiling all these  agency rules, diktats, actions, there were about 10,000 pages. That is  about how long it was, the sum of all regulations adopted…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690784/big-beautiful-bill"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…materials.--If, after the consultation       required under subclause (II), the Federal banking agency       determines there is a substantial public interest in not       publishing such materials, the Federal banking agency shall       provide those materials to the Committee on Financial       Services of the House of Representatives and the Committee…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697286/systemic-risk-authority-transparency-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…software.  Sections 309 and 409 make it clear that neither the CFTC nor the SEC  have the authority to require a person to register just because that  person is developing, publishing, or distributing software. This is a  critical protection, rooted in our First Amendment, that should be read  expansively by the commissions.\n\nThe creation of new decentralized…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693788/digital-asset-market-clarity-act-of-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…technologies, discovery, and  development of new miracle medicines, sophisticated computing, and  advanced microchips. Intellectual property is also foundational for  movies, music, publishing, and much more.\n\nIntellectual property industries produce almost 80 percent of U.S.  commodity exports. Many of these industries even have trade surpluses  since the United…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691132/world-ip-day-and-inventions-caucus"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Census from March of the previous year to March of the       year in which the adjustment is made, or calculated by the       Secretary using an alternative indicator after publishing       information about such alternative indicator in the Federal       Register for public comment if the Price Deflator Index of       Multifamily Residential Units Under…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…disabling of access to, or removal of, material claimed       to be a nonconsensual intimate visual depiction based on       facts or circumstances from which the unlawful publishing of       an intimate visual depiction is apparent, regardless of       whether the intimate visual depiction is ultimately       determined to be unlawful or not.\n\n(b) Enforcement…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690186/tools-to-address-known-exploitation-by-immobilizing-technological-deepfakes-on-websites-and-networks-act"}]