[{"senator": "Paul Tonko", "party": "Democrat", "sentence": "…This isn't just wrong, it is a blatant attack on scientific  integrity. Integrity in research is essential, essential to scientific  excellence and to maintaining the public's trust.\n\nThat is why, as an engineer and lifelong advocate for science, I have  made it one of my top priorities in Congress to right the ship of  American science policy.\n\nAs…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691396/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…know, to give Elon Musk a little bit more?\n\nThe damage is going to be incalculable across the board. However, I  think the biggest damage that we are going to see is to our public  trust in our institutions.\n\nRight now we are seeing corruption on a scale we have never seen  before in the history of this country. A $400 million Qatari gift of a  palace in…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692038/consequences-of-doge"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…current  administration is weakening our democracy, our economy, and our global  standing. This bill really is Exhibit A.\n\nWe are not just renaming a gulf. We are drowning public trust in what  this institution is supposed to do: serve the people, solve problems,  and defend democracy.\n\nYes, this bill has been called a joke more than once. In committee,…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690937/gulf-of-america-act"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…lies of DHS leadership and misconduct by the officers  involved in the killings of Alex Pretti and Renee Good are  indefensible, and they cannot stand. They violate the public trust and  stand in direct opposition to the values and the professionalism of  many Federal law enforcement officers who follow the law and serve with  integrity every day.…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699402/9999"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…the Boston Passport Agency has taken part in the incredible  task of honoring American stories--one passport at a time.\n\nThe Boston Passport Agency tirelessly serves the public trust. Day in  and day out, agency professionals uphold the highest standards of  security, while delivering the responsive, compassionate service  Commonwealth residents have…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695617/recognizing-the-boston-passport-agency"}, {"senator": "Robin Kelly", "party": "Democrat", "sentence": "…facilities. It is  our constitutional duty to find out what is happening in these centers  where people are reportedly being treated like less than animals.\n\nTwo, violation of public trust. Secretary Noem directed ICE agents to  arrest people without warrants, used tear gas against citizens, and  ignored due process. She claims she is taking murderers and…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698951/impeach-secretary-noem"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…public. In the 116th and 117th Congresses, the House passed this bill  as part of the George Floyd Justice in Policing Act.\n\nCameras can increase transparency, strengthen public trust and even  deter criminal behavior. With the surge of federal law enforcement  officers in the District of Columbia this month, this bill has become  even more important.…", "date": "2025-08-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694762/introduction-of-the-federal-police-camera-and-accountability-act-of-2025"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…without redacting the information of the victims.\n\nIf DOJ cared half as much about protecting Epstein's victims as they  cared about shielding Donald Trump, then maybe the public would trust  them more. But right now, there is zero trust that the DOJ is being on  the level.", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699465/epstein-files"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…does not meet that high  standard.\n\nIt is clear that many members of the Trump Administration, including  President Donald Trump himself, are violating the law and the public's  trust in ways that should lead to an investigation on potential high  crimes and misdemeanors by the House Judiciary Committee. But bringing  an impeachment resolution to the…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698091/concerns-with-h-res-939"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…need to make the city safe. Part of that effort includes       ensuring that the force can appropriately remove officers who       violate the law, MPD policies, and the public trust. When the       public trusts that MPD can effectively police its own,       residents are more likely to cooperate in investigations and       more likely to assist in…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692373/district-of-columbia-federal-immigration-compliance-act-of-2025"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…Academy of Public Administration. Earlier this year, he was  inducted into the Government Hall of Fame for his lasting impact on  accountability, fiscal responsibility, and public trust in government.\n\nAs Gene's term as Comptroller General concludes, his legacy at GAO  and in public service is secure. The standards he set, the integrity he  brought to the…", "date": "2025-12-19", "source_url": "https://justfacts.votesmart.org/public-statement/1698464/commending-the-honorable-gene-dodaro"}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "…or Police           Misconduct to Remain Employed as D.C. Metropolitan Police           Officers Endangering Public Safety, Evading           Accountability, and Eroding Public Trust.\n\nDear Representative: The American Civil Liberties Union       strongly urges you to oppose H.R. 2096 which would make it       easier for police officers accused of criminal…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692304/protecting-our-nations-capital-emergency-act"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…punishment. Being undocumented should not be a death sentence.\n\nHear me when I say that ICE is a rogue entity incapable of doing its  duty and incapable of re-earning the public trust that it has betrayed.  It is an existential danger to public safety, American decency, and the  American Dream.\n\nMr. Speaker, if there is a single revelation to emerge from…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699655/horrific-ice-abuses"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…be told. The story will be told truthfully.\n\nI close with this: We who are given the honor of serving have been  accorded the trust of the public. It is said that we hold public trust.  When we hold public trust and we make mistakes, believe it or not, you  can say that you made a mistake, or you can say: I didn't make a  mistake. I did this intentionally,…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689201/and-still-i-rise-censured-but-not-silenced"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…need to make the city safe. Part of that effort includes       ensuring that the force can appropriately remove officers who       violate the law, MPD policies, and the public trust. When the       public trusts that MPD can effectively police its own,       residents are more likely to cooperate in investigations and       more likely to assist in…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692314/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…the short end of the stick?  Hardworking, red-blooded Americans.\n\nThat is why I introduced the End Congressional Stock Trading Act to  level the playing field and restore public trust in Congress. Every  time I go back to east Tennessee, I get asked by my constituents: Tim,  why hasn't Congress done anything to stop this?\n\nMy answer is simple. It says…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691219/stock-trading-ban-for-members-of-congress"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…five Justices of the  Supreme Court must concur. Yet today, individual district court judges  are asserting this authority by themselves. This is an outrageous abuse  of public trust and judicial power, and it has opened a Pandora's box  that threatens the fundamental constitutional order.\n\nThe Congress is elected to make law, and the President is elected…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689722/no-rogue-rulings-act-of-2025"}, {"senator": "Andy Ogles", "party": "Republican", "sentence": "…sophisticated cyber threats and to  ensure continuity of essential services for the American people.\n\nSupporting the PILLAR Act is about more than technology. It is about  public trust. When a local government falls victim to ransomware and  emergency services are delayed, when a school district loses student  records, or when basic services are interrupted,…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696789/protecting-information-by-local-leaders-for-agency-resilience-act"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…Unfortunately, we  see this year after year with Members of Congress making lucrative  stock trades while their constituents struggle to make ends meet.\n\nWe must restore public trust in this body, and that starts with each  of us in this Chamber. There is no reason why Members of Congress  should be able to trade stocks while in office, period. American…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691218/stock-trading-ban-for-members-of-congress"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…Unfortunately, too many Members of Congress are engaging in  suspicious stock trades based on nonpublic information to enrich  themselves. These gross violations of the public trust make it clear:  We must finally take action and take a stand to ban Members and their  spouses from owning or selling individual stocks.\n\nIt is simple. Public service should…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691221/stock-trading-ban-for-members-of-congress"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…Select Committee on Intelligence, and raises serious questions about  Delegate Plaskett's judgement, integrity, and fitness to serve; and\n\nWhereas such associations erode public trust in Congress,  particularly when they involve using input from a sex offender to  advance partisan attacks during official proceedings: Now, therefore,  be it     Resolved,…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696890/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…educational  materials and best practices and by conducting workshops and public  stakeholder sessions.\n\nUltimately, H.R. 1082 will increase public awareness, patient safety,  and public trust in these lifesaving medical products to help ensure  that preventable tragedies, like the unfortunate death of Ms. Eisenga,  do not ever occur again.\n\nThis bill passed the…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692768/shandra-eisenga-human-cell-and-tissue-product-safety-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…must step in and assert  our Article I authority over independent agencies that stray beyond  their statutory authority, bypass the legislative process, and  undermine the public trust.\n\nLet's be clear: There is no apparent evidence of widespread consumer  harm that justifies this rule. There is no demonstrated market failure  here. What we have instead…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689950/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…infrastructure and public health. His professionalism, clarity, and  focus on long-term solutions made him a valuable partner to many, and  his example has helped strengthen public trust in the institutions that  serve our state.\n\nMr. Speaker, I ask my colleagues to join me in thanking Ted Corrigan  for his decades of committed service to the Des Moines…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694988/recognizing-the-retirement-of-ted-corrigan-after-35-years-of-public-service"}, {"senator": "John Rose", "party": "Republican", "sentence": "…colleagues to support Representative Scott's  legislation and to support my resolution so we can stand up for the  integrity of Congress, uphold the Constitution, and restore public  trust in this institution.", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696927/repeal-of-senate-notification-requirements-relating-to-legal-process-on-disclosures-of-senate-data"}, {"senator": "Nathaniel Moran", "party": "Republican", "sentence": "…is simple:  faster resolution for taxpayers without sacrificing expertise on the  bench, fairness in the process, or integrity in the result.\n\nThird, the bill strengthens public trust by creating clear ethical  standards for Tax Court judges. Article III judges already have  statutory recusal rules. Currently, Tax Court judges do not. Codifying  disqualification…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697270/tax-court-improvement-act"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…our political allegiances are about as far apart as they can  get, he is still my good friend.\n\nMr. Speaker, I urge my colleagues to pass this bipartisan bill and  restore public trust in TVA.", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692212/tennessee-valley-authority-transparency-act-of-2025"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…over time. It ensures that the American people can see how their tax  dollars are being used.\n\nThese are basic principles of good governance. Transparency  strengthens public trust and improves program performance. It allows  Congress to address problems early instead of after tax dollars have  been wasted or ones in need have been left behind.\n\nImportantly,…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697209/hud-transparency-act-of-2025"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…themselves in harm's way to fight crime, get drugs off the       streets, and protect the innocent;\n\nWhereas local law enforcement officers take an oath to       never betray the public trust;\n\nWhereas the local law enforcement community protects our       streets, acknowledges the rights of all Americans, and keeps       citizens safe from harm;\n\nWhereas local…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691031/expressing-support-for-local-law-enforcement-officers"}, {"senator": "Mike Kelly, Jr.", "party": "Republican", "sentence": "…work. Her efforts have directly contributed to the effective operation  of county government and have helped maintain the financial health and  transparency so essential to public trust.\n\nAs Ms. Krzysiak prepares to embark on her well-deserved retirement,  we commend her many years of dedicated service. We thank her for her  invaluable contributions to…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689885/recognizing-christine-krzysiak-as-a-community-champion-in-pennsylvania-16"}]