[{"senator": "Betty McCollum", "party": "Democrat", "sentence": "…Congress didn't ask, and the  window of disapproval closed.\n\nNow they are trying to use the Congressional Review Act to get a do- over. The CRA wasn't created to overturn a public land order,  especially one that is nearly 3 years old. CRA resolutions are for  rules, which public land orders are not, and they are to be used within  60 days of the congressional…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699274/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Chellie Pingree", "party": "Democrat", "sentence": "…stopgap measure, this bill imposes precise, legally binding  spending requirements that constrain executive overreach.\n\nThis will provide much-needed funding and certainty to public land  management agencies, like the National Park Service, that have suffered  tremendous disruption over the past year.\n\nThe bill also protects funding for programs important…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698754/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…political.\n\nThe Glen Canyon National Recreation Area is a very popular  destination. It offers ample opportunities for backcountry exploration  across 1.25 million acres of public land. To put that in perspective,  this area is larger than the entire State of Rhode Island.\n\nNow, the National Park Service is tasked with managing park units in  a manner…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690404/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…who  paid.\n\nFinally, my amendment would maintain the status quo and allow NOAA to  collect a fair market fee for the use of these sanctuary resources,  just like any other public land management agency does for cables that  cross their protected lands.\n\nThese are all standard provisions for the use of public resources,  and I hope we can bring back a…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699957/undersea-cable-protection-act-of-2025"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…Forest Service manages these public lands. We also have  agreements and rely on relationships between Federal, State, and Tribal  organizations and governments to manage our public land. When you cut  Federal staffing, it really has ripple effects and leaves State,  Tribal, and local governments lacking.\n\nI want to express gratitude to U.S. Forest Service…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689811/cuts-to-forest-service-endanger-millions"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…what are  you guys putting on the floor to eat up precious floor time as we are  headed into the holidays? We are debating bills to micromanage D.C.  affairs, bills to open public land and Tribal sacred sites to oil and  gas drilling, and a ridiculous political resolution that I heard your  own Members last night on the floor talking about. They called…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696976/district-of-columbia-cash-bail-reform-act-of-2025"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…resources based  on the needs of today and into the future.\n\nIt is important to recognize that even if one disagrees with the way  in which this resource management plan balances public land uses--and I  understand there are good faith disagreements with the resource  management plan. The chairman mentioned our mutual good friend, my dear  friend, Kelly Armstrong,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694909/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…hunting tag, especially  for elk, one of the first things that I do is to look at a map of the  unit where I drew. I do that for a couple of reasons. I look to see  where the public land is, and I also look to see where the roads are  because the vast majority of time, that is where the elk aren't.\n\nElk need habitat security. If there is food and water and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695667/cloture-motion"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "Mr. Speaker, I rise in support of H.R. 5131, legislation introduced  by my colleague from Alaska (Mr. Begich). This important bill will  extend the public land withdrawals for several military installations  that operate on public lands in Alaska, California, and New Mexico.\n\nOur public lands do a lot. As we have already discussed…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697635/public-lands-military-readiness-act-of-2025"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…resolution. This time, as was referenced, it is in regard  to the resource management plan for the central Yukon in the heart of  Alaska, governing over 13 million acres of public land in central and  northern Alaska, some of the most culturally significant landscapes in  the United States.\n\nThis region includes the central Yukon River watershed and the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694899/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…what is called a  clouded title, which limits allowable uses and development. In this  case, the reversionary interests originate from the initial conveyance  that provided public land for railroad purposes in the 19th century.\n\nMaking matters worse, the land changed hands over the years  eventually without the knowledge of this requirement.\n\nThis bill…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691118/reversionary-interest-conveyance-act"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…kind of a limbo with incredible uncertainty and chaos.\n\nHouse Republicans want to permanently enshrine fossil fuel extraction  as the top priority for millions of acres of public land across the  country, no matter the cost. They are picking winners and losers here,  blocking affordable renewable energy projects, and sacrificing our  public lands in the…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696881/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…why, nearly 3 years ago, Secretary of the Interior Deb  Haaland protected the lands surrounding the Boundary Waters and its  headwaters from mining for 20 years through a public land order, a  standard tool and process backed by peer-reviewed science and extensive  public engagement.\n\nThe Congressional Review Act resolution on the floor today would…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699273/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…and Suzanne Bonamici (D-OR) for  cosponsoring my bill.\n\nAs the former Deputy Secretary of the Interior, I know our national  conservation goals cannot be achieved through public land ownership  alone. The federal and state governments can and must work with private  landowners who want to do their part to conserve America's natural  landscapes, as my…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689872/reintroduction-of-the-forest-legacy-management-flexibility-act"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…priorities and bills become law.\n\nIn addition, I do have substantive concerns with S. 1084. I was not  the ranking member of the previous Congress, but it would give away  public land without an equal value exchange or payment for conservation  of other public land.\n\nThe public is simply left out of the equation. That is not something  I can support,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698420/unanimous-consent-requests-the-calendar"}, {"senator": "Cynthia Lummis", "party": "Republican", "sentence": "…overtime to stick it to  the energy industry at every turn while my colleagues here cheered them  on and helped them. On day one, President Biden placed a moratorium on  public land energy development that never truly went away until January  20, 2025, when President Trump was sworn into office and signed an  Executive order.\n\nWyoming and the West have…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687975/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…in the U.S. Senate: Do not mess with our public  lands.\n\nI helped to defeat a provision originally included in the House  reconciliation bill that would have provided for public land sales. We  got it removed, but now a similar provision has somehow reemerged in  the Senate.\n\nI will be very clear: The inclusion of any such provision in the  final version…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692816/do-not-mess-with-our-public-lands"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…program,  eligible Alaska Natives, or their heirs, can select an allotment of up  to 160 acres of certain Federal land.\n\nIn January 2021, the Trump administration revoked 11 public land  orders, which opened up 28 million acres of Bureau of Land Management  land for allotment purposes. The next month, however, the newly elected  Biden administration postponed…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693474/alaska-native-vietnam-era-veterans-land-allotment-extension-act-of-2025"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "…holiday or long-scheduled recess, they  bring them forward, and they say: Take them or leave them.\n\nYou must take all of them or have none of them. And what that does to  public land States like mine, where 67 percent of the land is owned by  the U.S. Government or beholden to everything, is it puts us in an  impossible decision.\n\nUsually, these deals…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691666/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…ANWR has a long  history that dates back to before Alaska joined the Union as a State in  1959. In 1943, the Federal Government withdrew all the lands on the  North Slope by Public Land Order, PLO 82, to prevent certain types of  development. In 1960, the Department of the Interior, DOI, issued PLO  2214, setting aside 8.9 million acres to establish the…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697739/9999"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…became  increasingly concerned about the supply of oil reserves in the event of  war or national emergency. In response, the Federal Government made  multiple withdrawals of public land to ensure a stockpile of fuel  supplies for the Navy remained available. The largest of these reserves  was on the Alaska North Slope and was designated by President Warren…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…Management (BLM) Buffalo Field Office issued a Record of       Decision and Approved Resource Management Plan Amendment       (Buffalo RMPA). The Buffalo RMPA makes areas of public land       administered by the Buffalo Field Office unavailable for coal       leasing consideration.\n\nThe Congressional Review Act (CRA) requires that before a       rule can…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695880/government-accountability-office-opinion-letter"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…management that  balance multiple uses, including energy and mineral production, outdoor  recreation, grazing, and timber harvesting. When done correctly, RMPs  help guide public land management in a way that provides fuel, food,  and fiber for the Nation and conserves our natural resources.\n\nRMPs manage the resources that are the backbone of western…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694888/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…Adjustment.--\n\n(1) Map.--Section 603(4) of the Sloan Canyon National       Conservation Area Act (16 U.S.C. 460qqq-1(4)) is amended by       striking ``map entitled `Southern Nevada Public Land       Management Act' and dated October 1, 2002'' and inserting       ``map entitled `Proposed Sloan Canyon Expansion' and dated       May 20, 2024''.\n\n(2) Acreage.--Section…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698162/sloan-canyon-conservation-and-lateral-pipeline-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…recharge;\n\n``(II) identify the existing right-of-way, easement,       permit, other authorization, or recognized authorized use for       ditches and canals constructed on public land before or on       October 21, 1976, under the authority of sections 2339 and       2340 of the Revised Statutes (43 U.S.C. 661) intended to be       used;\n\n``(III) provide…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691131/conveyance-for-aquifer-recharge-purposes"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…reached out to Interior to obtain the       agency's views. We received Interior's response on April 18,       2025.                                  BACKGROUND       BLM Public Land Management\n\nUnder the Federal Land Policy and Management Act of 1976,       as amended (FLPMA), BLM is responsible for developing,       maintaining, and, when appropriate,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694908/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…recovery, California water issues, and farmers and  ranchers who keep this country fed.\n\nAs chairman of the Western Caucus, he fought tirelessly for domestic  energy production, public land access, and rural communities that way  too often get overlooked.\n\nBeyond his lasting legacy as a public official, Doug was my friend.  We served together in the State legislature,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698738/9999"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…ski areas of the High Sierras and the wonder of Lake  Tahoe, we host and steward some of the most magnificent places in the  entire country.\n\nAcross millions of acres of public land, seven national forests, and  countless parks, these wild places are the source of clean water and  air for much of the State, while providing jobs for nearly 545,000  Californians…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691570/public-lands-management"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…is crucial to our national security and economic prosperity.  In 2020, President Trump announced a draft RMP for the central Yukon  that, among other provisions, revoked Public Land Order 5150 and  unleashed American energy.\n\nFor more than a decade, the State of Alaska has worked on this RMP to  revoke Public Land Order 5150, which would unlock millions…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694898/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…assembled,       SECTION 1. SHORT TITLE.\n\nThis Act may be cited as the ``Shingle Springs Band of       Miwok Indians Land Transfer Act of 2025''.       SEC. 2. REVOCATION OF PUBLIC LAND ORDER; LANDS TO BE TAKEN                     INTO TRUST.\n\n(a) Revocation of Public Land Order.--Notwithstanding any       other provision of law--\n\n(1) Public Land Order…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697670/shingle-springs-band-of-miwok-indians-land-transfer-act-of-2025"}]