[{"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…The Republican leader of the Senate could put this on the floor, and  it would pass in the blink of an eye. Most Republicans would vote for  it because they know how much the public wants to renew these credits.  So there is no reason under Heaven for us to delay. The House passed  this bill last week by 230 to 196, and 17 Republicans joined Democrats.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699088/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…Bay-Delta population of the longfin smelt was  listed as an endangered species under the Endangered Species Act after  thorough scientific review, as has been mentioned, and a public comment  process. This Congressional Review Act resolution casts aside the data  for no apparent reason. Decisions on whether to list a species as  endangered should be based…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690598/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…the office from the ground up, leading the team  through my first term. There, Rikki established herself as a mentor to  those in the office, and to other chiefs as well.\n\nPublic service isn't always glamorous. It demands patience,  perseverance, and quiet strength. There are early mornings, late  nights, and countless moments when the work you do goes…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696707/recognizing-the-career-of-erica-rikki-miller-and-her-work-on-behalf-of-michigans-3rd-congressional-district"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…in this bill were primarily two major elements. One element was foreign  aid, humanitarian assistance around the world paid for by the United  States. The other element was public broadcasting--National Public  Radio, for example. So $8 billion was taken out of foreign aid, and $1  billion was taken away from public broadcasting.\n\nIt was a close vote…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693932/rescissions"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…cruelly named One Big Beautiful Bill Act and Speaker Johnson's refusal  to act, the Republican majority is creating a healthcare crisis that  will literally dismantle American public health.\n\nAmericans are being forced into crushing medical debt, are in danger  of losing their closest hospital, clinic, or emergency room.\n\nAs a doctor, I worry for the patients…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698783/unaffordable-health-care-costs"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…want to be honest about the bill we are debating right now. This is  not a bill of national security. If it were, it wouldn't propose to  make sensitive security information public.\n\nNo, this bill is just Republicans' latest attempt to give the Trump  administration another anti-immigrant tool so that they can continue to  do the fear-mongering that they…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693072/special-interest-alien-reporting-act-of-2025"}, {"senator": "Norma Torres", "party": "Democrat", "sentence": "…familiarity with the operational requirements of a  multi-campus institution were invaluable to the college.\n\nKathleen's widespread involvement demonstrates her enthusiasm for  public education systems in the Inland Empire. Her hard work has left a  lasting impact on many, as seen by her recognition as Chaffey College's  2002 Alumni of the Year, and with…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697315/recognizing-chaffey-college-trustee-kathleen-brugger"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "Mr. CISNEROS. Mr. Speaker, I rise today to recognize the retirement  of a dedicated public servant in California's 31st District.\n\nEnrique Zaldivar has served the city of Baldwin Park as chief  executive officer since 2021.\n\nDemonstrating years of leadership and…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692474/congratulating-enrique-zaldivar-on-his-retirement"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "Mr. VINDMAN. Mr. Speaker, today I rise to recognize the exceptional  leadership of Fredericksburg City Public School Superintendent Dr.  Marci Catlett.\n\nDr. Catlett has been a trailblazer in implementing forward-thinking  strategies to strengthen her students' well-being.\n\nIn the summer…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692135/recognizing-dr-marcy-catlett"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…East Palestine or any other American city? The answer is not  enough.\n\nThat is why this week I am introducing the Railroad Safety and  Accountability Act to protect labor and public interest voices in rail  safety decisions, voices that Federal regulators have tried to push  aside.\n\nThat is why I have continued fighting for passage of the bipartisan  RAIL…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699687/norfolk-southern-train-derailment"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…loophole that will allow more people who should not have a gun because  of their criminal history or their mental health condition will allow  them to get that weapon. Real public safety means fewer weapons on our  streets, not more loopholes.", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700030/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…Musk call it a Ponzi scheme as well.\n\nThis is a battering ram of misinformation and disinformation, and it  doesn't happen without a motive. The motive here is to degrade public  confidence in Social Security.\n\nAt the same time, you sent what I call your little ``Muskrats''--you  sent your ``Muskrats'' into Social Security to disrupt its operations.…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690667/nomination-of-frank-bisignano"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…record, but this administration is  undercutting his potential work, and we deserve to debate it on the  floor of the Senate without unanimous consent, without shortcutting  public accountability.\n\nThe administration now in charge of the Department of Defense should  be held accountable for exactly the healthcare interests that Mr. Bass  will have responsibility…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691398/motion-to-discharge-s-res-195"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…the next 10 years for their dramatically  skyrocketed electricity.\n\nTheir crazed push to produce more fossil fuels, whether by cutting  pollution regulation, selling off our public lands, keeping retiring  coal plants online, will cost Americans billions more. We will see  blackouts and we will see bigger bills because Trump and the  Republicans want…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696132/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…emergency  communications systems.\n\nDeeply respected in the community by all the citizens, please join me  in thanking Chief Carlson for his extraordinary and many years of  public service and for public safety and congratulating him on a well- deserved retirement.", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697972/recognizing-police-chief-denton-carlson"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "Mr. KILEY of California. Mr. Speaker, today, I have a simple message  for my colleagues in the U.S. Senate: Do not mess with our public  lands.\n\nI helped to defeat a provision originally included in the House  reconciliation bill that would have provided for public land sales. We  got it removed, but now a…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692816/do-not-mess-with-our-public-lands"}, {"senator": "Dan Newhouse", "party": "Republican", "sentence": "…committee and our staff  and provides critical investments to protect the American homeland.\n\nAs a member of the Subcommittee on Homeland Security, I know that  this bill champions public safety and preparedness. It protects  taxpayer dollars and refocuses the Department on its core functions.\n\nWith border encounters at a historic low, this legislation fully…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699356/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "…major holiday or long-scheduled recess, they  bring them forward, and they say: Take them or leave them.\n\nYou must take all of them or have none of them. And what that does to  public land States like mine, where 67 percent of the land is owned by  the U.S. Government or beholden to everything, is it puts us in an  impossible decision.\n\nUsually, these deals…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691666/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Ronny Jackson", "party": "Republican", "sentence": "…to be an  invaluable asset to my office, where her attention to detail was  crucial in my ability to represent and serve my constituents.\n\nKathy discovered her passion for public service in High School and  was extensively involved in the Florida Federation of Teenage  Republicans and the Republican Party of Florida. This passion  eventually led Kathy…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697542/recognizing-and-expressing-gratitude-to-former-director-of-operations-kathy-zhu"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…began working as a Press  Secretary for the House Committee on Energy and Commerce under Chair  Cathy McMorris Rodgers in 2022, where he served a vital role informing  the public of the work the Subcommittee on Health was fighting for  while I was Subcommittee Chairman. Christopher then went on to become  the Communications Director of the full Committee…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690570/recognizing-christopher-krepich"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…us take a  moment to prioritize wellness and reach out to those around us who  might need a helping hand.\n\nI thank each friend, family member, teacher, community leader, or  public servant who has lent their support to someone experiencing  mental health challenges for their service. It is because of people  like them that communities are safer, healthier,…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691424/increasing-mental-health-services"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…least five Justices of the  Supreme Court must concur. Yet today, individual district court judges  are asserting this authority by themselves. This is an outrageous abuse  of public trust and judicial power, and it has opened a Pandora's box  that threatens the fundamental constitutional order.\n\nThe Congress is elected to make law, and the President is…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689722/no-rogue-rulings-act-of-2025"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…House of Representatives for nearly four  years, Kaitlyn will depart the House Committee on Energy and Commerce  to take a position with the Senate Committee on Environment and Public  Works, handling a portfolio of energy, fish, and wildlife issues. I  thank her for her service to the committee and wish her well in her new  endeavor.", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697136/recognizing-kaitlyn-peterson"}, {"senator": "John Thune", "party": "Republican", "sentence": "…individuals for testing or treatment for COVID-19, influenza,       respiratory syncytial virus, or streptococcal pharyngitis; or\n\n``(ii) testing or treatment services that address a public       health need related to a public health emergency declared       under section 319 of the Public Health Service Act (as       determined by the Secretary).\n\n``(2) Collaboration.--For…", "date": "2025-07-24", "source_url": "https://justfacts.votesmart.org/public-statement/1694217/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Barry Moore", "party": "Republican", "sentence": "…of Mayor William S. ``Sandy'' Stimpson,  108th Mayor of the City of Mobile, Alabama. Since his election in 2013,  Mayor Stimpson has demonstrated an unwavering commitment to public  service, fiscal responsibility, and the shared vision of building  Mobile into a city that is safer, more business-friendly, and more  family-friendly for all.\n\nUnder his…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696270/recognizing-the-accomplishments-of-mayor-william-s-sandy-stimpson"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…Because such guidance  communicates how an agency will administer their law and its programs,  it has a significant effect on regulated entities.\n\nRegulated entities in the public should know what agency guidance  says about the laws and programs that affect them. However, guidance  documents are not easy to find. They are not consistently posted on…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688391/guidance-out-of-darkness-act"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…became  increasingly concerned about the supply of oil reserves in the event of  war or national emergency. In response, the Federal Government made  multiple withdrawals of public land to ensure a stockpile of fuel  supplies for the Navy remained available. The largest of these reserves  was on the Alaska North Slope and was designated by President Warren…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…Wasted government revenues siphoned off the backs of Americans' labor  through tax dollars should not be tolerated.\n\nI commend the $1 billion rescission to the Corporation for Public  Broadcasting. Taxpayer funding for woke media entities is absurd. NPR  and PBS already have a business model that doesn't need to rely on 150  million Americans' taxed income.…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692522/rescissions-act-of-2025"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…clear timelines for  disciplinary investigations.\n\nH.R. 2096 also repeals the D.C. Council's requirement that the time  and place of some adverse action hearings be posted to a public  website.\n\nThis public posting requirement enables antipolice activists to  harass officers attempting to pursue their due process in the  workplace.\n\nIn summary, this legislation…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692305/protecting-our-nations-capital-emergency-act"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…group down,  what we did find is there are now 80 similar groups that are active on  Facebook.\n\nThis black market not only runs afoul of the law, but it also poses a  serious public safety threat, especially for women, children, and the  elderly. Just in February--and this is a case in point--there was a  lady in Massachusetts. She was allegedly raped…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690548/terminating-the-national-emergency-declared-to-impose-global-tariffs"}]