[{"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…equity  within our legal system. Court reporters and captioners help ensure  meaningful participation for individuals who are deaf or hard of  hearing and support broader public access to court proceedings and  civic processes.\n\nI am also proud that the National Court Reporters Association is  headquartered in Reston, Virginia, within Virginia's 11th…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699559/recognizing-court-reporting-and-captioning-week-2026"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…personal note, earlier this year, it was my honor to help  designate the Internet Archive as a Federal depository library,  allowing the Internet Archive to digitize and expand public access to  Federal Government publications for years to come.\n\nFor their outstanding commitment to the public good and tireless  preservation of public information, today we celebrate…", "date": "2025-10-28", "source_url": "https://justfacts.votesmart.org/public-statement/1696412/recognizing-the-internet-archives-one-trillionth-web-page"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…people and injuring over 800 people. That  is a major artery in front of the Murrah Building.\n\nThe Reagan Building was designed as an open and public-private  building with public access, public accommodations, and the public  coming into the building for eating. It has a big cafeteria. It has a  big parking lot that the public uses and is used by city…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699075/providing-for-consideration-of-hr-financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "…termination, including       the date, time, and location of the hearing, the name and       badge number of the officer, and a summary of the alleged       misconduct or charges.\n\nPublic access to police misconduct information is a key       component of accountability and reduces the likelihood that       an individual engaging in criminal behavior or police…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692304/protecting-our-nations-capital-emergency-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…things, gave the police chief more authority to discipline  officers for serious misconduct and crimes; strengthened civilian  oversight of the police department; improved public access to body-worn  camera video; and imposed limitations on the purchase of military  weapons and the use of force. D.C. police chiefs have requested more  authority to discipline…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696933/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…this effort is in the name of what? It makes no sense except that  it exemplifies some of the cruelty and meanness and stupidity of the  Elon Musk approach to public service and public access and fairness in  our society.\n\nI urge my colleagues to take the positive step--and it would be a  positive step--of continuing this enormously important program…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690726/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-federal-communications-commission-relating-to-addressing-the-homework-gap-through-the-e-rate-program"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…be working to stimulate that. Yet,  this bill could not be further from that goal.\n\nIf this bill is passed, SBA offices will be relocated as political  payback, away from public access in major cities. In fact, that is the  point: to reduce programs that help small businesses gain access to  capital, professional services, and predictable tariff policies.…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692104/save-sba-from-sanctuary-cities-act-of-2025"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…for servicemembers,  investments in research, and reauthorization of the Ukraine Security  Assistance Initiative. It includes a provision I worked on to ensure  continued public access to Greenbury Point near the Naval Academy and  my efforts with Senator Kennedy to protect investors from foreign  insider trading. And there are provisions that will assist…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698254/nominations"}, {"senator": "Eric Sorensen", "party": "Democrat", "sentence": "…Channel Cat for its outstanding service and  commend Kathy Wine and Jeff Nelson for their visionary leadership and  unwavering dedication to environmental stewardship and public access  along our riverfront. The Quad Cities is a better, more connected place  because of their work.", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691090/recognizing-the-30th-anniversary-of-the-channel-cat-passenger-ferryboat-service-in-the-quad-cities"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…in perspective,  this area is larger than the entire State of Rhode Island.\n\nNow, the National Park Service is tasked with managing park units in  a manner that balances public access and enjoyment while ensuring  responsible stewardship of the natural environment. That is their job.\n\nAchieving that balance can be a tall order under the best of  circumstances.…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690404/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…missions in the high north. There is simply no substitute  for the terrain and conditions Alaska provides.\n\nThis legislation does not expand the military footprint or limit  public access beyond what is already established. Importantly, this  bill does not bypass environmental review. In fact, the military has  engaged in robust consultation with Tribes,…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697634/public-lands-military-readiness-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…access  and recreational use of the Glen Canyon National Recreation Area.\n\nHouse Republicans are committed to pursuing a comprehensive approach  to restoring multiple use and public access to our Federal lands, one  that favors commonsense land management and prioritizes community buy- in over preservationist policies that are cooked up here in Washington,…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690405/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…platforms like YouTube TV and  Hulu + Live TV refuse to carry C-SPAN. At a time when trust in  government is more important than ever, no company should stand in the  way of public access to democracy and the inner workings of our  constitutional republic.\n\nI urge YouTube TV and Hulu + Live TV and all streaming providers to  do the right thing. Carry C-SPAN.…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689056/recognizing-the-46th-anniversary-of-c-span"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…commercialization with respect to communications       technologies, including access to capital and other       resources, and ways to overcome such barriers;\n\n``(L) provide public access to relevant data, research, and       technical assistance on innovation and commercialization with       respect to communications technologies, consistent with the…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693497/ntia-policy-and-cybersecurity-coordination-act"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…U.S.C. 1615); and\n\n(2) Sealaska Corporation to any subsurface interest in the       Federal land under section 14(f) of that Act (43 U.S.C.       1613(f)).       SEC. 5. PUBLIC ACCESS EASEMENT.\n\nThe conveyance of the Federal land under section 4 shall be       subject to the reservation of a public easement under section       17(b) of the Alaska Native…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698209/cape-fox-land-entitlement-finalization-act-of-2025"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "…but, Mr. Speaker, they  are going about it in an extremely troubling way.\n\nThey are proposing to create a new restricted area over this airspace  which would restrict the public's access to that effectively full time,  despite the fact that the Marine Corps only proposes to make use of  this airspace 60 or fewer days every year. That is less than 20 percent…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695111/providing-for-consideration-of-hr-streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-and-providing-for-consideration-of-hr-stop-illegal-entry-act-of-2025"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…works  because sportsmen and sportswomen pay a dedicated excise tax on  firearms, ammunition, and archery equipment. That money is then  invested in habitat restoration, public access, and in hunter  education.\n\nSince 2004, interest generated from these funds has added an average  of nearly $11 million per year to support wetland and waterfowl  conservation…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693492/wetlands-conservation-and-access-improvement-act-of-2025"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…future       environmental reviews and authorizations;\n\n(9) Federal agencies responsible for environmental reviews       or authorizations, project sponsors, and the public should       have access to up-to-date information on accurate timelines       and the status of environmental reviews and authorizations;       and\n\n(10) allowing for seamless information…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697679/epermit-act"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "Mr. FLOOD. Mr. Speaker, I rise today to applaud YouTube TV and Hulu +  Live TV for expanding public access to Congress by carrying C-SPAN, C- SPAN2, and C-SPAN3 beginning next week.\n\nFor 46 years, C-SPAN's respected nonprofit service has offered  Americans unfiltered, gavel-to-gavel…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697293/c-span-goes-streaming"}]