[{"senator": "Rob Menendez", "party": "Democrat", "sentence": "…this council permanent.\n\nThe bill specifies that CSRIC must include representatives from a  wide range of stakeholders from the communications industry, academia,  the public-interest sector, and State, local, and Tribal Governments,  ensuring that everyone is at the table to help keep our communities  safe and secure.\n\nIn a time when oversight is key,…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693436/communications-security-act"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…special conference, set up a special committee to study  the issues, to bring in the experts, to involve the best technology, to  learn the lessons from private sector and public sector, from  universities, from scientists--are we doing that, or are we doing  exactly what John McCain said we shouldn't do, exactly what he  described why he voted no?\n\nIt…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…rich cultures and history of Indigenous peoples across North  America, but to recognize the continued leadership of Native Americans  in each of our communities. From the public sector to the business  community, to my colleagues on the House floor, Native American leaders  are today helping shape the future.\n\nI represent Riverside which stands on the…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696915/recognizing-native-american-heritage-month"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…Michael Maul,  Director of the Department of Planning and Budget for the Commonwealth  of Virginia. Their conversation centers on adaptability and  collaboration in the public sector, with Director Maul emphasizing the  vital role of mentorship in building a stronger future for government  leadership.\n\nThis edition includes other student led interviews…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692884/stennis-center-for-public-service-winter-2024-public-service-review"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…trying to buy a lot of them in the  private sector, you can just go to Staples and Amazon to purchase them  right there, really quickly, and for a pretty good cost.\n\nIn the public sector, there are a lot of rules and regulations in  place to buy things like pens or staples. It is even harder to do this  with technology tools that can help people get their…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692900/congratulating-virginias-10th-district-congressional-award-medalists"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…a number of D.C. employees are paid more than the CFO. D.C. must  compete with both the private and public sectors for high-quality CFOs,  and there are many private and public-sector CFOs who are paid more  than the D.C. CFO.\n\nThis bill is critical to the financial operations of D.C. and is an  important step to increase home rule for D.C. I urge my…", "date": "2025-12-23", "source_url": "https://justfacts.votesmart.org/public-statement/1698470/introduction-of-the-district-of-columbia-chief-financial-officer-salary-home-rule-act"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…private industry alone can replace Federal  investment in biomedical research, this just isn't the case. It has  been proven over decades. The private sector needs this public-sector  investment for them to do many of the drugs and treatments that we  currently have. This has been the case for decades. While some claim  that this is easily done, there…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692894/investing-in-biomedical-research"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "…pioneered  concepts of social responsibility at the corporate level, and worked to  end the use of child labor in toy production supply chains. He invested  in generations of public sector leaders. He founded the Hassenfeld  Child Health Innovation Institute at Brown University to improve family  mental health and created RI For Gun Safety to promote commonsense…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693984/recognizing-arthur-coia-of-rhode-island"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…don't need a democracy. You  don't need the rule of law. You don't need this exercise in self- government. I can fix it. You should expect your private sector and  your public sector to be hopelessly corrupt, hopelessly bankrupt.\n\nThat is a dark vision, but that is the dark vision that he was  elected on twice.\n\nI think we would be a lot better off…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689543/h-con-res-14"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…Human Resources Director. Bersheba has  dedicated 25 years to the City of Anniston.\n\nShe is a member of the Alabama Association of Public Personnel  Administrators and the Public Sector Human Resources Association. She  also served in leadership roles for the IPMA-HR Southern Region  organization.\n\nBersheba is blessed with two daughters, Ashley Burton…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697364/recognizing-the-retirement-of-bersheba-austin"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…State, this bill would put union bosses ahead of the  American people and in front of Arizonans.\n\nIn 2024 alone, the political arm of the Democratic Party, the four  largest public-sector unions, spent $900 million-plus on progressive  politics, and 86 percent of it came from their member dues. They are  using taxpayer-backed salaries to fund partisan activism,…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697990/protect-americas-workforce-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…applications built on blockchain technology or other       distributed ledger technology, tokens, and tokenization       that--\n\n(1) support the private sector, the public sector, and       public-private partnerships in the deployment of technologies       needed to advance the capabilities of blockchain technology       or other distributed ledger…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692733/deploying-american-blockchains-act-of-2025"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…research into best practices for threat       detection, incident management, and threat containment.\n\n(D) An evaluation of the Department's engagement with       private and public sector stakeholders to address risks of       vehicular terrorism, including the following:\n\n(i) Collaboration with vehicle rental companies, ride-      sharing platforms, vendors…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696768/department-of-homeland-security-vehicular-terrorism-prevention-and-mitigation-act-of-2025"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…Donegal  Township Manager Jeffrey Butler on his retirement.\n\nFor over four decades, Mr. Butler has dedicated himself to our  communities, both in the private sector and in the public sector. After  graduating from Millersville University, Mr. Butler worked as Manheim  Township's Director of Zoning and Planning, Director of Planning at  Dave Miller/Associates,…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687958/congratulating-jeffrey-butler-on-his-retirement"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…democratic values in Georgia, including free and fair       elections, freedom of association, an independent and       accountable judiciary, an independent media, public-sector       transparency and accountability, the rule of law, countering       malign influence, and anti-corruption efforts and to impose       swift consequences on individuals…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690702/mobilizing-and-enhancing-georgias-options-for-building-accountability-resilience-and-independence-act"}, {"senator": "Ron Johnson", "party": "Republican", "sentence": "…are less safe--they are using public employees and  the American public as pawns in this grotesque display of partisanship.\n\nMy bill is very simple. It is backed by the public sector unions,  which generally don't support things I am putting forward.\n\nIf the Senator insists on objecting to this, preventing these people,  these workers, these people…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696605/9999"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…District of Columbia, or even around the country, that maybe weren't  working that hard. Some of this happens in the private sector. More  likely, it will happen in the public sector.\n\nRight now, we have about 80,000 employees--I think a little bit under  that; it might be 76,000--in the Department of Defense who are non- uniformed. I assume most of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695628/breakdown-of-traditional-families"}, {"senator": "French Hill", "party": "Republican", "sentence": "…(such as blockchain tracing       tools, geofencing, transaction screening, the collection of       business data, and sanctions screening) that--\n\n(A) support private and public sector investigations and       risk management activities; and\n\n(B) involve cryptographically secured distributed ledgers       or any similar technology or implementation.…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693963/financial-technology-protection-act-of-2025"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…Preserving Presidential Management  Authority Act, sponsored by Representative Cloud of Texas, is the bill  we should be debating here today.\n\nIt is important to remember that public-sector unions are  fundamentally different from their private-sector counterparts. In  fact, none other than Franklin Delano Roosevelt, a major champion of  private-sector unions,…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697996/protect-americas-workforce-act"}]