[{"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…the tide has turned, and the President knows it. That is why he is  slinking Bovino and other people out of town. That is why he is  changing his tune.\n\nBut what he says publicly is still fundamentally different from what  is going on today in Minneapolis. You still have 3,000 agents doing the  same list of things that I am talking about. It has not…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699401/9999"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…any  drugs or cash, and gathered additional information about ties to drug  trafficking organizations, just as they normally do. Secretary of State  Rubio even acknowledged publicly that this could have been done but  said that the President wanted to send a message by killing all of  those on board.\n\nWe all agree that the scourge of drugs is real and…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696120/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…expressing an opinion. People are       whisked off the street by masked officials in unmarked cars       or sent off to imprisonment abroad without due process. Trump       talks publicly about an unconstitutional third term without a       word of concern from his own party.\n\nAmerican democracy and American security are inextricably       linked; weaken one…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691413/recognizing-assault-on-american-diplomacy"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…assisting . . . NCUA in fulfilling       its mission of ensuring the safety and soundness of       individual FICUs and the credit union system.'' Call Report       data is made publicly available on NCUA's website and is       published in both aggregated and disaggregated form.\n\nIn addition to the Call Report requirement, NCUA also       carries out its…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699835/government-accountability-office-opinion-letter"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…victimized, and it didn't  stop there.\n\nJuan Espinoza Martinez, also from my district, was accused of serious  conspiracy to commit crimes that never happened. ICE made them up and  publicly smeared his name. Those charges were dropped as well because  they were false. There was no apology, no discipline, and no  consequences.\n\nICE acts first and then lies. The…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699041/authority-without-accountability"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…they are  definitely not going to tell us who is on their list of domestic  terrorist organizations.\n\nWe saw, to start us off, the attorney general down in Texas put out  publicly that he is now going to launch a campaign against domestic  terrorist organizations in his own State. So it has begun.\n\nMeanwhile, we know what is going on in some of our…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696126/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…statements be on both  sides of the aisle--the political will on both sides of the aisle-- reflect what we are saying behind closed doors because the only thing  that we are seeing publicly is the Trump administration going out of  their way to enact a policy of cruelty. But it is exactly what we have  come to expect 6 months into this administration--using immigrants…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694421/daca"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…the Clerk of the House and the document retention precedents of other  committees of this House. The select committee's final report and its  support materials are posted publicly online. Just to be sure, I  checked again today. All of them, every single page of every  transcript, are posted online publicly. Maybe the gentleman can't find  them. I would…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694886/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…stand.\n\nThere are people who will say in quiet places something similar to  what I just said. I hope that those people will have the courage. If  they don't want to say it publicly, I just hope they will have the  courage to do what they can do to prevent the imminent threat that this  President has become to American democracy. I say ``threat.'' It…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697060/no-mandate-to-cut-medicaid"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…Hemisphere, which they state  to be carrying narcotics. At least 95 people have been killed in these  strikes. Not one of these strikes has been authorized by Congress and I  have publicly called for them to cease because I believe them to be  unlawful extrajudicial killings.\n\nThe footage of the strike on September 2, 2025, which I have viewed  in a classified…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698418/supporting-of-h-con-res-61-and-h-con-res-64"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…extended most of the expiring Bush tax  cuts. At the time, the Obama administration's Office of Management and  Budget produced a ``current policy'' score that they used when publicly  talking about the benefits of the bill. It served a purely messaging  purpose. Congress did not--I repeat, did not--use a current policy  baseline for official budget enforcement…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693857/hr-1"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…and work  through the interagency review process to ensure that those concerns  are heard.\n\nFERC Commissioners in recent years have not been shy about using  their powers to publicly highlight and comment on Federal actions that  they deem flawed or insufficient. Agencies can, and do, respond to that  feedback, as we saw with the EPA during the previous…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698275/reliable-power-act"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…body camera footage.\n\nThese videos are public records and are essential for accountability  and justice for victims of police violence. Putting this footage that  should be publicly available behind a paywall makes achieving  accountability much more difficult for our residents, especially those  who won't be able to afford it, and they tend to be the…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698994/stop-body-camera-paywalls"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…healthcare costs for  everyday people. Today, we have a chance to right that wrong and help  out our hardworking Americans.\n\nMr. Speaker, Republicans may not want to admit it publicly, but they  know that the ACA has resulted in historically low insurance rates,  helped millions of families stay covered, and saved lives--and I stress  saved lives. If we…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698589/providing-for-consideration-of-hr-breaking-the-gridlock-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…workers, the administration is doing  everything it can to signal that it will punish anyone who doesn't bow  to them.\n\nSince 2020, Trump has been posting on social media and publicly  calling for prosecution against election officials he accuses of  working against him. Prosecuting election officials won't make  elections any safer or fairer; it is simply…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696440/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "French Hill", "party": "Republican", "sentence": "…incur when conducting initial public offerings       (IPOs). An IPO is a process where a private company offers       shares to the public for the first time, making it a publicly       traded company.\n\nBased on the cost of similar activities, CBO estimates that       implementing H.R. 3395 would cost $l million over the 2025-      2026 period. Any…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693907/middle-market-ipo-cost-act"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…unclassified executive summary.\n\n(6) Publication.--The unclassified executive summary of       each report required under this subsection shall be published       on a publicly accessible website of the Department of       Homeland Security.\n\n(g) Access to Information.--\n\n(1) In general.--The Secretary of Homeland Security, the       Director of…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696755/strengthening-cyber-resilience-against-state-sponsored-threats-act"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…of Colorado. He had multiple contacts  with law enforcement prior to the attack, most notably when he tried to  buy a gun and failed a background check. This is on top of publicly  espousing support for an organization that is known to have jihadist  problems and jihadist leanings.\n\nColorado's refusal to allow law enforcement to share basic  information…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692192/denouncing-the-antisemitic-terrorist-attack-in-boulder-colorado"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Speaker, because if you are the  Chinese Communist Party and see a mine is getting ready to happen in  the United States, and it is going to be done by a company that is  traded publicly, you could go buy 10.1 percent and stop the project. We  don't need that kind of policy.\n\nPlus, that policy doesn't apply to the jurisdiction of this bill. If  a policy like…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699695/critical-mineral-dominance-act"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…Appropriations of the House of Representatives and the       Committee on Energy and Natural Resources and the Committee       on Appropriations of the Senate, and shall make publicly       available, a report on the use by the Department during the       period covered by the report of the authority to reduce or       eliminate cost-sharing requirements…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688929/cost-share-accountability-act-of-2025"}, {"senator": "William Timmons", "party": "Republican", "sentence": "…server hardware,       through a cloud service provider, or on data ownership or       access;\n\n(5) ensure that the purchase by the agency of any software       is based on publicly available criteria that are not unduly       structured to favor any specific vendor, unless prohibited by       law (including regulation);\n\n(6) include any estimates for…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698153/strengthening-agency-management-and-oversight-of-software-assets-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…classified annex.\n\n(B) Public availability.--The unclassified portion of each       report required by paragraph (1) shall be made available to       the public and posted on a publicly accessible website of the       Department of the Treasury--\n\n(i) in precompressed, easily downloadable versions, in all       appropriate formats; and\n\n(ii) in machine-readable…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693963/financial-technology-protection-act-of-2025"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…nonpublic review by the staff of       the Commission prior to public filing, provided that the       initial confidential submission and all amendments thereto       shall be publicly filed with the Commission not later than--\n\n``(A) in the case of an initial public offering, 10 days       before the effective date of such registration statement;\n\n``(B)…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692737/encouraging-public-offerings-act-of-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…California, we urgently need more information to       develop an effective antifraud strategy.\n\nTo accomplish this, I ask the GAO to provide:\n\n1, how much money in total was publicly reported as lost to       waste, fraud, and abuse in California since 2016;\n\n2, a breakdown of fraud by economic sector such as       transportation, healthcare, housing,…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699473/illegal-bio-lab-in-las-vegas"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…submit to the Committee on Small       Business of the House of Representatives and the Committee on       Small Business and Entrepreneurship of the Senate, and make       publicly available on a website of the Administration, a       report on the activities of the Office during the one-year       period immediately preceding the date of submission…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697283/office-of-rural-affairs-enhancement-act"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…announcement at least one week prior to a meeting       shall not apply if the chairman of the Board designates the       meeting as an emergency special meeting.\n\n``(iii) Publicly available information.--The Board shall       publish on the website of the Board any information required       to be disclosed or made available to the public, or publicly…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692213/tennessee-valley-authority-transparency-act-of-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Senate resolution--this was baseline debt. They add another 32.7  percent to the debt. If we do what the Senate put out in their budget  reconciliation, we functionally double publicly held debt in the United  States.\n\nWhat took us 240 years to do, bless us, we can do in 10 because we  are good at borrowing money, handing things out, telling people there…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690586/economic-anxiety"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…of course, Congress.\n\nIt has received more than 28 million visits since it was created and  features hundreds of pages of constitutional analysis and content. The  site is publicly accessible, easy to search, provides links to Supreme  Court decisions, and, perhaps most importantly, is updated in real time  by the CRS.\n\nAll of this raises the question…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689324/repeal-requirement-for-congressional-research-service-to-prepare-annotated-constitution-and-supplements-in-hardbound-version"}, {"senator": "Mark Amodei", "party": "Republican", "sentence": "…in years past, both as the chairman of the full committee and as  folks on other subcommittees that have worked well. It has been a help  to all of us, and I thank them all publicly for their professionalism  and respect for each other in our process.\n\nI also thank my good friend, subcommittee Ranking Member Cuellar, a  real pro. We don't agree all the…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699349/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…have to  ensure that our government is doing what it should be doing and in ways  that are best for us.\n\nAnd speaking of records, a large part of my oversight work includes  publicly releasing documents to hold current and former government  officials accountable. To accomplish that, I often work with  whistleblowers to get the information the government…", "date": "2025-03-12", "source_url": "https://justfacts.votesmart.org/public-statement/1688777/sunshine-week"}]