[{"senator": "Margaret Wood Hassan", "party": "Democrat", "sentence": "\"As a member of the White House's bipartisan task force, I pushed administration officials on the call to put forward and execute an effective nationwide public health strategy, which is the only way to help get our economy moving in the right direction,\" Senator Hassan said."}, {"senator": "Gary C. Peters", "party": "Democrat", "sentence": "Widespread testing is crucial for understanding the true scope of the outbreak, but a national shortage of testing kits in the United States has hampered the nation's response to this public health and homeland security crisis."}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "\"President Trump's disastrous misdiagnosis of COVID-19 as a short-term re-election problem and subsequent suppression of unfavorable data could spell years of poor public health and economic loss unless we learn the right lessons and change course."}, {"senator": "Chris Van Hollen", "party": "Democrat", "sentence": "These policies are critically important to public health, but also incredibly disruptive to our economy and way of life,\" the senators wrote."}, {"senator": "Kirsten E. Gillibrand", "party": "Democrat", "sentence": "Today, Representatives Lauren Underwood (IL-14), Jason Crow (CO-06), and Jimmy Panetta (CA-20) introduced new legislation to establish the \"Health Force.\" The Health Force and Resilience Force Act would recruit, train, and employ Americans to expand our public health workforce to respond to the coronavirus pandemic and strengthen America's long-term public health infrastructure."}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "President, on March 27 Congress passed the Coronavirus  Aid, Relief, and Economic Security (CARES) Act in response to the  ongoing public health and economic crisis resulting from the COVID-19  pandemic."}, {"senator": "Benjamin L. Cardin", "party": "Democrat", "sentence": "Congressman John Sarbanes (D-Md.) and the Maryland Congressional Delegation today called on Maryland Governor Larry Hogan (R) to fix the state's Unemployment Insurance system and improve the delivery of critical financial benefits to Marylanders during the COVID-19 public health emergency."}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "\"This bill would grant the Oregon Guard the predictability it's asking for and prevent the Trump administration from nickel-and-diming Guard members out of hard-earned benefits.\"\n\nThe National Guard COVID-19 Response Stability Act would extend Title 32 authority for all Guardsmen activated in response to the crisis until the end of the declared public health emergency."}, {"senator": "Cory A. Booker", "party": "Democrat", "sentence": "I know that public health emergencies can quickly become  economic disasters for those who are already struggling in the economic  margins of our country."}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "\"We know public health crises are especially hard on individuals and families navigating housing insecurity, and I've heard repeatedly from folks across the state who are hurting during this difficult time,\" Senator Murray said."}, {"senator": "Dianne Feinstein", "party": "Democrat", "sentence": "Please also provide any specific information on how you are otherwise using the Sexual Assault Services Program to help survivors during to this crisis and specific steps that Congress could take to ensure that the needs of this vulnerable population are being met during this public health crisis."}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "It will also be important to bolster support from APTCs for working families and individuals who are already eligible, but will need more financial support for the cost of coverage during this public health and economic crisis."}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "As you work to contain this outbreak, we request your continued partnership and urge you to work with state, local, and tribal governments to ensure our communities have the resources they need to protect public health."}, {"senator": "Cory Gardner", "party": "Republican", "sentence": "The United States and countries around the world depend upon the WHO as a source of reliable, independent, and scientifically-based information about public health challenges."}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "This provides substantial progress for Minot's flood control plan.-Terrestrial Noxious Weed Control Demonstration Program -- directing the USACE to partner with interested parties to identify and develop improved strategies to manage the reoccurring issue of noxious weeds, which can be harmful to public health, agriculture, recreation, wildlife, and overall property quality.-Water Infrastructure Finance and Innovation Act (WIFIA) -- reauthorizing the WIFIA program for 4 years at $50M per year."}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "Free people aren't arrested under the guise of protecting public health for playing catch with their children in a nearly empty park."}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "We write today regarding needed clarification on the Food and Drug Administration (FDA) Guidance Document updated on April 15, 2020, titled, \"Guidance for Industry: Temporary Policy for Preparation of Certain Alcohol-Based Hand Sanitizer Products During the Public Health Emergency (COVID-19).\" Further clarification is needed for the renewable fuel industry, which has gone to great lengths to produce hand sanitizer to aid hospitals and communities."}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "We ask that when you are allocating funding amongst the tribes, you allot a fair and equitable amount to the Great Plains Region based on these statistics and their demonstrated need and difficult public health challenges."}, {"senator": "Ben Sasse", "party": "Republican", "sentence": "We face a  public health emergency that is genuinely disastrous, and we face a  consequent resultant economic emergency that puts at risk lots and lots  of families' livelihoods, lots of dinner tables around the country."}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "The Great Plains Center for Agricultural Health (GPCAH), located in the College of Public Health at the University of Iowa, serves a nine-state region in the Midwest."}, {"senator": "Patrick J. Toomey", "party": "Republican", "sentence": "Senator Pat Toomey (R-Pa.) is cosponsoring legislation to hold foreign officials accountable for distorting or suppressing information about international public health crises."}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "My staff and I remain in constant communication with  Federal agencies to ensure that the Federal Government is properly  managing emergency threats to the public health."}, {"senator": "Steve Daines", "party": "Republican", "sentence": "On March 16th, 2020, Daines announced $4.5 million awarded to Montana to help support the coronavirus response and protect public health."}]