[{"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…was the person standing next to former Congressman Luis  Gutierrez.\n\nAn immigrant from Mexico and the son of a bracero, Chuy Garcia has  spent 45 years as an organizer, public servant, and a coalition builder  who never loses sight of the people he serves. He has been a steadfast  champion for dignity, equity, and justice across Chicago.\n\nHe stepped…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696778/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…Clear identification with a unique  ID number must be displayed so that illegal behavior of an individual  officer can be prosecuted in a court of law, as with any other public  servant.\n\nMy vote against DHS funding today will stand in solidarity with  Minnesotans, to honor the lives of Renee Good and Alex Pretti, and to  demand changes that will protect…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699913/consolidated-appropriations-act-2026"}, {"senator": "Jan Schakowsky", "party": "Democrat", "sentence": "Ms. SCHAKOWSKY. Mr. Speaker, I rise today to recognize Kathryn  Angell, a dedicated public servant who has spent years serving the  residents of Illinois' 9th Congressional District with skill,  compassion, and professionalism.\n\nKathryn has been a member of my staff…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699929/recognizing-the-service-of-kathryn-angell"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…so grateful to Tess for sharing her experience and knowledge with me  and other Members of Congress, helping us improve our healthcare  system. Tess is a true leader and public servant, and I want to  acknowledge the profound positive impact she has had on community  health in her community.\n\nOn behalf of my constituents in New Hampshire's 1st Congressional…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695528/recognizing-tess-kuenning"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…week.\n\nMinnesota House Speaker Emerita Melissa Hortman was truly the best of  us. She was exactly the kind of person you would want to run for  office. She was a dedicated public servant who got up every day  determined to make life better for all Minnesotans.\n\nShe was a brilliant legislator and a tough negotiator. She was often  the smartest person in…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692786/in-memory-of-mark-and-melissa-hortman"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "Mr. BISHOP. Mr. Speaker, I rise today to honor the life and legacy of  a loving husband, dedicated grandfather, doting grandfather, astute  entrepreneur, committed public servant and dear friend of longstanding,  the Honorable Curtis Parham ``CP'' Redding. Sadly, ``CP'' passed away  on May 9, 2025. A service to commemorate his remarkable life was…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691304/in-memory-of-the-honorable-curtis-parham-cp-redding-sr"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "Mr. MORELLE. Mr. Speaker, I rise today to honor an exemplary public  servant, distinguished leader, and dear friend from Rochester, New  York, Jim Brown, who is retiring after more than three decades of  dedicated service to the Joseph A. Floreano…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697211/recognizing-jim-brown"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…honor them with  action, compassion, and resolve.                        Recognizing Chief Jeremy Story\n\nMr. VASQUEZ. Mr. Speaker, I rise today to recognize an exceptional  public servant from my district, Chief Jeremy Story.\n\nChief Story is from the Las Cruces Police Department, my hometown,  and he is someone I was proud to serve with in local government.…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691300/national-police-week"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…American.\n\nIt is my great privilege, Mr. Speaker, to offer deepest gratitude on  behalf of Ohioans and Americans as we recognize the life of an honored  and indefatigable public servant in the truest sense.\n\nSteven D. Fought was born in Rapid City, South Dakota, on June 2,  1954, and passed recently at 71 years young. He passed from this life  after a…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699337/applauding-president-zelenskyys-address-in-davos"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…McCormack as he retires after 34 years of service to the U.S.  Citizenship and Immigration Services agency. Over the course of his  tenure, David has been a tremendous public servant in his role as a  district congressional lead.\n\nDavid has hosted numerous congressional outreach meetings to bring  together staffers and federal agency representatives,…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689823/recognizing-the-retirement-of-david-mccormack"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…I rise today to recognize the life and  public service of a mentor of mine and many people in California and in  the bay area, and a wonderful human being, a dedicated public servant  from Walnut Creek, California, in the East Bay of the San Francisco  Bay.\n\nGwen Regalia began her career as a fourth grade teacher--she was a  teacher all her life in…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697386/recognizing-gwen-regalia"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…that they were and  the legacy that they will leave behind. Anyone who knew Melissa and  Mark knew that, together, they were a force for good. Melissa was a  dedicated public servant, and both she and her husband devoted their  lives to improving the lives of Minnesotans.\n\nPersonally, Melissa and I shared a love of golden retrievers. We  often exchanged…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692854/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "Mr. MORELLE. Mr. Speaker, I rise today in honor of Caribbean American  Heritage Month to recognize an exceptional public servant from  Rochester, New York: Marlene Henry.\n\nAs the owner of PeppaPot Catering, Marlene Henry is far more than a  business owner--she is a quiet but powerful force for good…", "date": "2025-06-13", "source_url": "https://justfacts.votesmart.org/public-statement/1692569/recognizing-marlene-henry"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…to the brazen  firing of our respected Librarian of Congress, Dr. Carla Hayden.\n\nLast week, she was ruthlessly fired by President Donald J. Trump. Dr.  Hayden is a model public servant who led the Library with dignity and  professionalism for 8 years.\n\nDr. Hayden was the first professional librarian to oversee our  Nation's largest Library, and, yes,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691312/recognizing-dr-carla-hayden"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…annual effort that  has significantly improved transparency and accountability.\n\nGene Dodaro is widely respected on both sides of the aisle as a  principled, nonpartisan public servant. He has been recognized by  numerous organizations, including the American Society for Public  Administration, the Association of Government Accountants, and the  National…", "date": "2025-12-19", "source_url": "https://justfacts.votesmart.org/public-statement/1698464/commending-the-honorable-gene-dodaro"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…after a 38-year career in law  enforcement.\n\nThrough nearly four decades, Sheriff Foster has served Wythe County  Sheriff's Office with the integrity and devotion of a true public  servant.\n\nHired at the age of 18 as a dispatcher, Sheriff Foster developed  strong ties to those he worked with early in his career and earned high  marks from his community.…", "date": "2025-08-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694755/recognizing-the-dedicated-service-and-leadership-of-sheriff-charles-foster-of-wythe-county-virginia"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "Mr. FRY. Madam Speaker, I rise today to recognize an incredible  public servant and a great friend, Mayor Marilyn Hatley of Myrtle  Beach, South Carolina, who is retiring after two decades of public  service.\n\nMarilyn has been a constant force for…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694053/recognizing-mayor-marilyn-hatley"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…communities.                           Recognizing Robi Schlaff\n\nMr. LAWLER. Mr. Speaker, I rise today to recognize the extraordinary  career of Robi Schlaff, a devoted public servant who has spent her  career protecting women, children, and families across Westchester  County.\n\nSince 2013, Robi has served as director of the Westchester County  Office…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699731/recognizing-extraordinary-service-of-cardinal-timothy-dolan"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…have a place in America. Lawmakers from  both sides of the aisle must unite to reject political violence in all  forms across the country.\n\nMelissa Hortman was a dedicated public servant, and we join Minnesota  and the Nation in honoring her life and the life of her husband, Mark.  We also pray for the speedy recovery of John and Yvette Hoffman and for…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692853/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…naturalization ceremonies for new  citizens reflected his profound love for our community and country,  bringing joy to those he welcomed as his fellow Americans.\n\nHis legacy as a public servant made him a pillar of Haverstraw in  Rockland County and continues to benefit residents every single day  through the programs and systems that he put in place.\n\nIt is,…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697700/paul-piperato-post-office-building"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "Mr. NORMAN. Mr. Speaker, I rise today to recognize a truly great  South Carolinian, Mr. Jeff Wilson. He is an outstanding public servant  and beacon of our farming community. As head of Cotton Hills Farm in  Lowrys, South Carolina, he recently was named the South Carolina Farmer  of the Year for 2025 by…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695599/recognizing-jeff-wilson"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…the established       guidelines.\n\nMr. Speaker, the House of Representatives has lost a true statesman.\n\nGerry Connolly was a father, a husband, friend, and a lifelong public  servant that dedicated his life to his constituents, his community, and  his country. I was deeply saddened to hear about his sudden passing.\n\nFrom the Fairfax County Board of…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691831/gerald-e-connolly-esophageal-cancer-awareness-act-of-2025"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "Mr. SMUCKER. Mr. Speaker, today I rise to recognize and thank an  extraordinary public servant, Joanne Horn, who has retired after  decades of faithful service to the people of Pennsylvania's 11th  Congressional District.\n\nJoanne has been a valued member of my staff…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698569/recognizing-and-thanking-joanne-horn"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "Mr. FITZPATRICK. Mr. Speaker, I rise today to honor and commend Mayor  Joe Taylor of Langhorne Borough, Bucks County, Pennsylvania, a devoted  public servant whose life's work reflects unwavering commitment,  integrity, and the highest ideals of civic leadership.\n\nSince making Langhorne Borough his home in 2010, Mayor Taylor…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697645/commending-mayor-joe-taylor-for-his-dedicated-service-to-langhorne-borough"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "Mr. LAWLER. Mr. Speaker, I rise today to recognize the incredible  career of Jim Monaghan, a dedicated public servant who has spent a  lifetime serving the people of Stony Point.\n\nJim's public service began with a 29-year career in the New York City  Police Department, where he rose to…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698769/recognizing-jim-monaghan"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…contributing 9 medals to the total of 1,362 brought home by  Team USA. Of his nine medals, three were gold and six were silver.\n\nNot only is Ken an accomplished athlete and public servant, but he  was my science teacher at Amelia Middle School. I loved having him as a  teacher. It is wonderful to see him continue to achieve greatly and  inspire others around…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697115/recognizing-ken-stewart"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…Joseph's  dedication never faltered--his presence was a certainty, ensuring that  his community received their mail with the efficiency and reliability  that only a true public servant could provide.\n\nIn recognition of his outstanding service and commitment to safety,  Joseph was honored with the prestigious Million Mile Award from the  United States…", "date": "2025-03-21", "source_url": "https://justfacts.votesmart.org/public-statement/1688925/recognizing-joseph-bongarzones-retirement-with-the-united-states-postal-service-after-37-years"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…tremendous qualifications.\n\nProfessor Mascott is a law professor at Catholic University. She is  so beloved by her students. She has had a very distinguished career as  a public servant and has impeccable professional qualifications.\n\nJust as an example, as a law student at George Washington University,  she earned a recordbreaking 4.22 GPA. Her professors…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696138/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "Mr. WEBER of Texas. Mr. Speaker, I rise today to honor the well- deserved retirement of Dr. Tom Johnson, a dedicated leader and public  servant who has made a lasting impact on Lamar State College Orange and  the community of Southeast Texas.\n\nFor seven years, Dr. Johnson has led Lamar State College Orange with…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694750/recognizing-the-retirement-of-dr-tom-johnson"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…honorably  discharged in 1970, Bill served in the Army Reserves until 1975.\n\nAlthough his military service had ended, Bill stayed committed to the  honorable life of a public servant, becoming a firefighter with the  Temple Fire Department before turning to serve in their Police  department from 1974 to 1981. During his time in the police department…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696330/recognizing-william-bill-forest-harris-with-a-congressional-veteran-commendation"}]