[{"senator": "Cory Booker", "party": "Democrat", "sentence": "…grateful I am for my friend Chris Murphy. The  last time I stood on this floor for many hours was just in support,  doing like my colleague is doing for me right now, after the Pulse  shooting. We wanted a vote on commonsense gun safety--bipartisan- supported, commonsense gun safety. We didn't get it. Chris Murphy, who  is right down there, held the floor…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Darren Soto", "party": "Democrat", "sentence": "…a.m., our little happy town of Orlando, Florida, was changed forever as  we saw 49 angels killed and 53 others who were injured in a mass  shooting during Latin Night at the Pulse nightclub, a safe place for  the LGBTQ community located just south of downtown Orlando. At the  time, it was the deadliest mass shooting in U.S. history.\n\nI was proud to work…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692469/moment-of-silence-in-memory-of-pulse-nightclub-victims"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "Mr. FROST. Mr. Speaker, 9 years ago today, 49 lives were stolen and  ripped away from us at Pulse nightclub in my district, in my home of  Orlando, Florida, a safe haven for Orlando's LGBTQ+ community that was  turned into the site of unimaginable horror and a mass grave.…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692458/pulse-shooting-anniversary"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…hurdled a barricade, and joined other medical  personnel to help.\n\nHe immediately began CPR on the runner for roughly five minutes. His  quick response helped the runner regain a pulse, ultimately saving his  life.\n\nDuring the emotional ordeal, Dan missed seeing his fiancee cross the  finish line, but he told a local news outlet that if he had to do it  all…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696700/recognizing-dan-molnar-as-the-champion-of-the-week-for-ohios-13th-congressional-district"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…Secretary Abraham's unrealistic  promise, and he failed to address the fundamental technical problems  emerging at the waste treatment plant--problems with hydrogen gas  build-up, pulse jet mixing, nuclear critical risk, and identified  during his tenure, but not adequately addressed--creating a legacy of,  really, technical debt that would cost billions of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695342/hanford-site-cleanup"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…human existence for somebody with       medical complexities like Leda.\n\nTonight, like every night, my wife and I will hook our       daughter to an oxygen concentrator and a pulse oximeter, then       we will lie down and ``say no to death.''\n\nThe only reason we can sleep at all is because Medicaid has       provided the durable medical equipment and…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692972/one-big-beautiful-bill"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…response, Democrats only brag about higher health insurance  enrollment. They are really celebrating.  What they are celebrating is subsidizing insurers for people without a  pulse. For Democrats, fraud comes first.\n\nMr. Speaker, Republicans are putting real, living Americans first.  Republicans blocked illegal immigrants' access to taxpayer-funded  healthcare…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698800/breaking-the-gridlock-act"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Borst, Ellie: E&E News; Bowen,       Lindsey: Assistant Director; Boyles, William: Health Market       Survey; Bracken, Matthew: Scoop News Group; Brasher, Philip:       Agri-Pulse; Brassil, Gillian: Bloomberg Industry Group;       Brennan, Zachary: Endpoints News; Bresnahan, John: Punchbowl       News; Briceno, Heri: World Magazine.\n\nBrinkmann, Julius:…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698171/members-entitled-to-admission-to-the-119th-congress-periodical-press-gallery"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…Master File,  improve data sharing across Federal agencies, and ensure that benefits  programs have the timely, reliable information they need to verify  eligibility, and a pulse, before payments go out the door.\n\nThe results, Madam Speaker, speak for themselves. The Treasury  Department recently announced it recovered $31 million in fraud and  improper…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698919/ending-improper-payments-to-deceased-people-act"}, {"senator": "Jim Baird", "party": "Republican", "sentence": "Mr. BAIRD. Mr. Chairman, I thank the gentleman for yielding.\n\nMr. Chairman, I rise to support my amendment to direct the Department  of Defense to begin evaluating pulse laser capabilities and to brief  Congress within 90 days on its feasibility against drone swarms in the  near term and missile threats in the medium term.\n\nDrone swarms and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695156/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}]