[{"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…is bearing down on us.\n\nSo fossil fuel's climate denial fraud is coming at American families'  finances. It is real, and it is costing them.\n\nSo I have a resolution, and the punch line is very simple: One,  climate change caused by fossil fuel combustion is not a hoax. I hope  we can go with NASA on that. I hope we can go with Exxon on that. I  hope…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698993/unanimous-consent-request-s-res-550"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…1,800 industrial  facilities are at risk of facing the worst consequences.\n\nThese communities tend to be low income. I would venture that many  rely on Medicaid. The one-two punch of this resolution with a budget  bill to strip healthcare from nearly 14 million people is wrong. It  will leave people with unhealthier air, fewer protections, and less…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691592/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…my Republican colleagues are ready to explain why they gave  the ultrawealthy a $250,000 tax break--you heard that right, a $250,000  tax break--while gutting Medicaid--a gut punch to people who depend on  Medicaid to be able to get the care they need for themselves or for  their kids, maybe some other loved ones; the same Medicaid which helps  cover…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694383/9999"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…Instead of strengthening our waterways, this bill that we are  debating today on the House floor is a wholesale attack on what is left  of the Clean Water Act. It is a one-two punch that would allow more  forever chemicals and harmful pollutants to be discharged into our  waterways with little regulation, while diluting the ability for States  and Tribes…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698044/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…ready to continue to pay more for almost everything.\n\nWhat about the EU? They retaliated with tariffs against us this  morning, too. Are we going to treat them like China and punch back as  the White House Press Secretary says that we are doing? I guess we  don't have any clarity on that question.\n\nHere is the worst part, Mr. Speaker. The Congress could…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689864/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…active household. If you  remember--those of you who got the crap beat out of you the way I did-- when your brothers say, ``Look over here,'' ``look over here'' and  sucker punch you, that is purposeful to distract you. That is what  Donald Trump is doing with military action in his first year: ``Look  over here.'' We are talking about Venezuela today…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698619/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…them properly. That is why Medicaid is so vital, so important, such  a lifeline to tens of millions of families across America. The  Republican Medicaid cuts would be a gut punch to these families.\n\nIt was the same story on Long Island. Senior citizens are scared,  nervous, angry about what these budget cuts would do to them that the  Republicans are…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689512/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…individuals--innocent individuals. The last thing any of us  should want is an innocent individual in prison, especially if that  innocent individual is an American.\n\nBut this is the punch line: The President has indicated that this is  not just for those who are here with questions about their legal  status. President Trump has said ``homegrowns'' are next.…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691406/motion-to-discharge-s-res-195"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…satirize the absurdity of  oil-soaked nationalism.\n\nNow, here we are, 15 years later, in a Congress that apparently  thinks they have no real work to do, turning a late-night punch line  into the legislative business of the United States House.\n\nI would love to say this is just a one-off, but it fits a disturbing  trend. Again and again, this majority…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690937/gulf-of-america-act"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…this bill turn the American Dream he talked  about into a nightmare for America's seniors, the disabled, and our  children. Let us vote ``no'' on this shameful bill and throw a punch  for the children.", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693207/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…in my heart.\n\nTo all Delawareans, may their Delaware Day be filled with cheer, with  history, and with the profound satisfaction of knowing that we beat  everyone else to the punch.\n\nToday and every day, it is good being first.                              Honoring Sue Ryan\n\nMs. McBRIDE. Mr. Speaker, I rise to honor Sue Ryan, who is retiring  after 10…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697421/delaware-day"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…quickly, many economists believe that a  recession is inevitable. And like in all recessions, the pain will fall  hardest on working families. Many Americans will face the one-two punch  of job losses on top of overwhelming debt burdens. A cascade of  defaults and foreclosures and personal bankruptcies could follow.\n\nWith so many indications that American…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690534/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…American small businesses by the very agency tasked with  fueling them.\n\nLet me be clear. This is what H.R. 2931 would do. It would allow the  Small Business Administration to gut punch the small businesses it is  supposed to serve, just to punish cities that embrace their immigrant  communities.\n\nTargeting sanctuary cities, as this bill does, is beyond the…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692101/save-sba-from-sanctuary-cities-act-of-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…always willing to buy U.S. debt.\n\nOkay. Let's pretend these leftwing economists are right. We can  continue to borrow and borrow and borrow. They purposely sort of forget  the punch line. Let's say we could borrow forever. At what point are  there no more services, purchases, government helping our brothers and  sisters because it is all covering the interest…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694131/dismantling-californias-citizens-redistricting-commission"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…404 program,  and it ends the uncertainty caused by conflicting court rulings and  shifting interpretations in Washington.\n\nMeanwhile, the Army Corps of Engineers got a gut punch with an  overwhelming caseload while working hard to try to solve dozens of  projects that an activist judge has placed on hold in our communities  that they desperately need,…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698027/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…Leader McConnell used to go around Kentucky when he was campaigning  and say things like, Kentucky punches above its weight, and we  absolutely did on that. He threw the right punch on that.\n\nOur retired union coal miners have the benefits they have today  because in an omnibus or spending bill--I can't remember, probably both  together--he put in a provision…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695764/national-coal-council-reestablishment-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…these matters.\n\nI wanted to say thank you to everyone who took the time out of their  busy schedule to come here. This program has in the past, I think,  allowed our region to punch above its weight. Indeed, this is the  biggest chamber trip, I understand, to D.C. that exists anywhere in the  country.\n\nIt really underscores the tremendous spirit of collaboration…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Street Journal did us a favor. They actually took the  Arizona system, which actually has a shockingly high satisfaction rate  and good outcomes. We can make it much better. The punch line here is  they are showing something called a provider tax. This was a scam--a  scheme. I have to openly admit, on part of it, which was the  disproportionate share--this…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690586/economic-anxiety"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…and keep  using that as a piggy bank, even though we pay it back every month  because the tax receipts from FICA taxes don't match the checks going  out the door.\n\nHere is the punch line. It took us 240 years to get to that $28  trillion. We are basically talking about doubling it in 10 years. The  publicly held debt is not exact, but it is close. It is…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688651/a-real-math-problem"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…David, we are not supposed to talk about that.'' How do you make public  policy if you can't even be honest about the most basic parts of the  math?\n\nThe other part of the punch line here is, 20 years ago, 12.3 percent  of the population was 65 and up. Mr. Speaker, 20 years later, it is,  functionally, 18 percent. It is not double, but it is pretty…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697051/facing-fiscal-reality"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…pristine wilderness, otherworldly nature,  and function as a refuge for local wildlife.\n\nTybee Island was ranked fourth on the list, being praised as a little  island packing a big punch. Tybee contains over three miles of beaches,  hundreds of years of history, and countless opportunities to explore  nature making it one of the most beloved areas in the First…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689617/commending-jekyll-island-club-resort-and-sea-island"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…local first responders, State officials, and Federal investigators  continue their work today, I would like to help our colleagues  understand what makes this tragedy such a gut punch in a place like  Louisville.\n\nDuring the day, Louisville International hums with thousands of  passengers from all across the country. But around the clock,  Louisville is…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696544/9999"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…got attacked by people who want to keep spending money who  said: Stop. You can't downgrade U.S. sovereign debt.\n\nThe other two rating agencies had done it years earlier. The punch  line in there is that in less than 9 years--and this was assuming  interest rates stayed stable--in 2034, 30 percent of all tax receipts  just covered interest. If interest…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693062/stop-bathing-in-folklore-and-start-bathing-in-math"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…3 percent. Great. So we are going to stop  borrowing so much, except just the interest we pay is bigger than that.\n\nDoes anyone see the math problem? So this is actually the punch line  I have been trying to head toward. This is a chart that sort of shows  labor as a percentage of income.\n\nI am sorry, but this is actually really important when you are…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699000/growing-the-gdp"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…this because I  can do math.\n\nMr. Speaker, instead of me walking through all this, did you see the  job growth numbers today? They are actually pretty good. Did you see  the punch line in the job growth numbers?\n\nThe U.S. economy added approximately 140,000 jobs; the market added  181,000. It is absolutely terrific. A dominance of the new jobs that…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699988/math-is-such-an-anathema"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…it, so the next year, we have to  do it again.\n\nThat was one of the reasons, particularly prepandemic, we had that  sudden spike of capital expenditures and productivity. The punch line  on that is that does not exist now. It is our fading out for those C  corporations, which had their rates already locked in, but also for all  those other small businesses…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688035/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…one  wants to hear the actual math. We want things that anger people. It  turns out that good accounting isn't really that exciting, but it is  math.\n\nMr. Speaker, here is the punch line which worries me and why I beg my  brothers and sisters: For those of us in the House, we have a  reconciliation budget. We are trying not to let the expiring provisions…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690748/the-math"}]