[{"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…gentlewoman from Ohio's Third District, Representative Joyce Beatty.\n\nMs. McCLELLAN. Mr. Speaker, I thank Congresswoman Beatty for her  remarks.\n\nMr. Speaker, earlier today, Punchbowl News reported that Speaker  Johnson is planning a long process to fix healthcare. The Speaker says  he anticipates working on healthcare through the second quarter of the…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697649/restoring-enhanced-premium-tax-credits"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…quoted a lot of   Don Bacon on  the floor today. If he is watching, I hope he will forgive me in  advance. I will read again this tweet, this post on X, from John  Bresnahan of Punchbowl News, who quoted Mr. Bacon: ``It will be the  fourth time this rule vote putting a gag on tariff debates has been  done. I don't think tariffs are good for the economy, manufacturing…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699903/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…their  final resting place, including burial in a national cemetery. The  national cemetery in Hawaii is the National Memorial Cemetery of the  Pacific, often referred to as ``Punchbowl.''\n\nFew national cemeteries can compete with the natural beauty and calm  of the National Memorial Cemetery of the Pacific, which is nestled in a  quiet 100,000-year-old…", "date": "2025-12-26", "source_url": "https://justfacts.votesmart.org/public-statement/1698471/introduction-of-hawaii-national-cemetary-act"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…plan, so it is up to the House. Leader  Jeffries has the discharge petition open right now to extend the  credits, and we need just four Republicans to sign on.\n\nLast week Punchbowl News reported that Speaker Johnson is planning a  long process to fix healthcare, saying he anticipates working on  healthcare through the second quarter of next year. However,…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698225/healthcare-affordability-crisis"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Beard, Jaden: Inside Washington Publishers; Beaven, Lara:       Inside Washington Publishers; Beavins, Emma: FierceMarkets;       Becker, Bernard: Politico; Beckford, Jalen: Punchbowl News;       Behr, Peter: E&E News; Behsudi, Adam: Politico; Beitsch,       Rebecca: The Hill; Belloni, Ganny: Bloomberg Industry Group;       Bennett, Brian: Time Magazine;…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698171/members-entitled-to-admission-to-the-119th-congress-periodical-press-gallery"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…of callers to congressional offices,  Republican and Democratic, are worried about. It is Republican cuts to  Medicaid.\n\nThis is a big week for Republicans. As reported in Punchbowl, it is  their once-in-a-lifetime opportunity to cut Medicaid.\n\nThis week in the dead of night while America was sleeping, Republican  committees took a sledgehammer to lifesaving…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691169/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}]