[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…your  father's cancer, maybe your sister's cancer, maybe your child's cancer.\n\nThat will be the pay-for because this is about power, and it is about  profit, and it is about punishing States that dare to lead. It is about  undermining the Senate's own rules to score a short-term win that will  do long-term damage but will placate the oil industry, because…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691621/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "…young children--dead, making dubious and unsubstantiated  claims in their attempt to justify their use of lethal force.\n\nIt is obvious what Trump is doing. He is targeting and punishing the  cities who dare to push back against his abuse of power. And while he  is currently targeting blue cities with his lies, if these deployments  are not stopped, there…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696180/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…democracy.\n\nHe is prosecuting political enemies in courts that he has filled with  MAGA zealots and has a Department of Justice that is run by his  personal lawyers. He is punishing constituents of Democrats by  canceling billions in Federal programs and firing dedicated public  servants during a government shutdown when he simply fails to find them…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696345/trump-administration"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Now their lives will be turned upside down again to  serve the President's political agenda.\n\nThe fraud in Minnesota is serious and warrants continued  investigation, but punishing thousands of refugees because of crimes  they had nothing to do with is just plain wrong and inhumane.\n\nThe Trump administration has tried to politicize this fraud  investigation,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699112/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…homes, and in our  relationships abroad.\n\nJust 100 days ago, President Trump inherited a strong economy, yet  our economy shrank in the first 3 months of this year. He imposed  punishing tariffs, then he didn't, wiping out $11 trillion in wealth in  11 weeks. The price of gas, eggs, and other groceries are still too  high.\n\nThe President handed an unelected,…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690580/100-days-of-chaos-cruelty-and-lawlessness-under-the-trump-administration"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "…Canada isn't just our neighbor. It has historically been one of  our strongest military allies and biggest trading partners. Trump's  constant insults, threats, and these punishing tariffs have turned one  of our best friends away from us and toward the People's Republic of  China.\n\nEnough is enough. It is time that we end this. I urge my colleagues,…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699973/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…small business capital access programs in the Federal  Government. By giving the SBA the tools and authority it needs, we can  root out bad behavior and minimize fraud without punishing loan agents  that are acting in good faith on behalf of their clients and helping  small businesses access the capital they need to grow.\n\nI urge my colleagues to vote ``yes''…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691856/9999"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…administration are trying to undermine the foundations of  our democracy, watch the video. If you are not yet convinced that  President Trump and his administration are hellbent on punishing people  with differing opinions than those of the President, then watch the  video.\n\nAnd here is the really chilling part. Make no mistake, what happened  to Senator Padilla…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692473/alex-padilla"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…it is shameful for that thought to  cross your mind, much less for you to do it, but that is what the  reconciliation bill and the Trump energy emergency put into motion:  punishing low-income Americans by making it more difficult for them to  access what is now one of the cheapest forms of energy.\n\nOh, yes, there was a prediction. We predicted it on…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696123/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…arrest of the Fortune, the loss       of her cargo created ``such a Spirit of Resentment that I       have devoted almost the whole of my time in devising measures       for punishing the offender.''\n\nWell, of course, Nathanael Greene was not only George Washington's  aide-de-camp and administrative officer, but he was also deployed to  lead the southern…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691707/253rd-anniversary-of-the-gaspee-raid"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…This administration has made their position painfully clear. They  simple many don't care. Instead, they are injecting partisan politics  into research, censoring scientists, punishing experts, and pulling  funding from projects that challenge their narrow ideology. They don't  care about protecting communities from the climate disaster, and we are  going…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691396/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…people, and he is transferring the wealth to the millionaires  and billionaires in our country. It is absolutely economic craziness  that the President is engaging in. He is punishing Main Street. He is  turning Main Street into ``Pain Street'' in every single State in our  country.\n\nAnd that extra increase in the tariffs from Canada puts a special  burden…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696444/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…politically convenient story.\n\nAnd again, to be clear, there is no question that Maduro's regime in  Venezuela and the TDA are ruthless actors who pose real threats, but  punishing officials--punishing intelligence officials in particular-- for telling the truth only weakens our ability to confront them.\n\nWe have seen the three-star general leading…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695695/authorizing-the-en-bloc-consideration-in-executive-session-of-certain-nominations-on-the-executive-calendar"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…missile defense in North America. It is much harder to  convince an ally to spend hundreds of millions, if not billions of  dollars on a joint defense platform when you are punishing their  economy and when we are punishing our own citizens.\n\nSo that is why we need to vote for this resolution.\n\nThere is a right way to resolve this, and my colleague mentioned…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696447/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…executive orders and a Congress  that refuses to check and balance the administration.\n\nIf our goal is to stop offshoring and revitalize American  manufacturing, why are we punishing the companies that are driving  innovation, the ones who are footing the bill?\n\nEarthQuaker Devices isn't some multinational conglomerate dodging  taxes and hiding profits…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691573/earthquaker-devices-sounds-the-alarm"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…protectionist faith cannot help  but acknowledge that even they know that the tariffs will raise prices.  They admit it readily. The tariffs that they put on in 2019 are still  punishing the farmers in our country to such an extent that the farmers  are still asking for more subsidies.\n\nWhen the Trump tariffs went on in 2018, 2019, the farmers immediately…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689478/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…classifying certain industrial facilities as major  sources of hazardous air pollutants, even if they successfully reduce  emissions, the Biden administration was seemingly punishing job  creators for being good stewards of the environment.\n\nAs an original cosponsor of S.J. Res. 31, I am proud that House  Republicans are taking a stand and defending our…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691588/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…deportation. That is not a  standard too high. That is not detached from logic.\n\nAgain, when you look at the goals of what all criminal laws should  achieve, protecting Americans, punishing illegal activity, and to deter  repeat offenses, this is a needed step to accompany the legitimate  approach that the President has been implementing over the past few  years.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695365/stop-illegal-entry-act-of-2025"}, {"senator": "Ron Johnson", "party": "Republican", "sentence": "…Presidential authority. I know some people want  to reduce authority, but that is a bill that won't be signed. If you  want to pay the Federal workers, if you want to stop punishing them for  our dysfunction, if you want to stop using them as pawns in this  political game, that is a demand you have to drop.\n\nThe money appropriated in this bill will go…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696605/9999"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…prices are happening because Republicans are successfully  changing the direction of the country. We promised to cut burdensome  Biden regulations--regulations that have been punishing, penalizing-- and we are getting it done. We promised to unleash American energy and  we have done it. We have delivered on our promises.\n\nYou know, under the Trump administration,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699081/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…responsible for developing 91 percent of oil and gas wells, producing  83 percent of America's oil and 90 percent of our country's natural  gas. We should be thanking them, not punishing them.\n\nMr. Speaker, if we do not act, American jobs and energy production  will be lost. This is really, for all intents and purposes, a punitive  tax on natural gas. These…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688182/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…campaign  contributors. It is very easy to find young people today who are not  getting married specifically because they find that the Federal  Government has almost a policy of punishing people who get married.\n\nEven the Republican Party in its big, beautiful bill has, as I  count--maybe there are more--three programs in which we are penalizing  married couples.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698433/republicans-have-delivered-in-2025"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…improved bilateral relationship.\n\nThe United States should reward partners for good behavior. This bill  is not an attack on the Georgian people. It seeks to support them by  punishing rogue officials who are taking them further away from the  United States.\n\nThe House Committee on Foreign Affairs favorably marked up a version  of this bill during the last…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690702/mobilizing-and-enhancing-georgias-options-for-building-accountability-resilience-and-independence-act"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…know what everyone thinks about due process, the  Constitution, - the Fourth Amendment, and the right to not be imposed  upon by illegal, unlawful search and seizure, but punishing everybody  for this crime, whether they have committed it or not, whether they are  going to commit it or not, should be unconstitutional. This shouldn't  really be a question.…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699282/amendment-no-1-offered-by-mr-massie"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…breadbasket. We have world-class coal and world-class oil and natural  gas, and this Republican bill helps American energy workers compete  globally.\n\nRepublicans also rolled back punishing Biden regulations. Those  regulations were burdensome, expensive, and time-consuming. By reining  in Biden's heavy-handed bureaucrats, we have saved the American public…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698252/nominations"}, {"senator": "Mark Messmer", "party": "Republican", "sentence": "…provide this important coverage for their employees. It is  high time we eradicate this unwarranted red tape and let businesses  invest in the needs of their employees without punishing the company  for doing just that.\n\nThat is why I introduced the Empowering Employer Child and Elder Care  Solutions Act. Hoosiers and all Americans must not be forced to…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699003/empowering-employer-child-and-elder-care-solutions-act"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…government.\n\nI think it is disruptive, I think it is unfair, and I think it is  wrong that we don't pay the workers that show up. A better way than  isolating different groups and punishing different groups is actually  to pay those who are working. I think, if we do this, pass this  legislation, this would never be a problem again.\n\nWe are going to run into…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696562/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…failure. Democrats remain the party of high energy prices. That is what  they want. They think it is going to help the climate. Democrats remain  the party of painful and punishing regulations. They remain the party  of never-ending dependence on foreign dictators for energy that we have  right here. Democrats want to continue the war on American energy,…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688189/energy"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…capable of tracking and surveilling every American  citizen, while keeping a watchful eye on each and every one of your  financial transactions, crediting or discrediting, or punishing you  based on your personal behavior, and restricting that behavior with the  tap of a button. Nothing could be more inimical to the liberty and  privacy on which American…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693728/anti-cbdc-surveillance-state-act"}]