[{"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…either wouldn't notice or was unlikely to go anywhere else.\n\nMr. Speaker, this is outrageous and wrong. Companies should not be  able to use consumers' online history, past purchases, the color of  their skin, their income, where they work, or their ZIP Code to charge  them a higher price.\n\nSurveillance pricing will lead to increased costs for food and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694896/providing-recovery-for-flood-victims"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "Mr. CASTEN. Madam Chair, I want you to imagine that a friend came  over to you and said: Donald Trump taught me how to save 50 percent on  my shoe purchases. All you have to do is cut off one leg.\n\nIt is just math, as the gentleman from Arizona says. So let's get out  the saw and head to Foot Locker.\n\nNow, Madam Chair, if you…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688021/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…politically the way I see  them. But when you close the door and there is no press around and you  ask them what is going on, they are scared to death.\n\nThey see China stopping purchases of soybeans. Why is that important?  Illinois is the No. 1 soybean-producing State in the United States, and  it is a major cash crop for farmers all across the country.…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697242/the-economy"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…Oregonians, including my constituent Teresa from Clatsop  County. Teresa, a small business owner, runs a small flower and produce  farm. Like many small business owners, she purchases her coverage on  the Oregon health care exchange. Because of Republicans' refusal to  protect health care, her premium will soon be going from $230 a month  to $1,077 a month.…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696722/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…meaningful steps to protect  our children, keep our schools safe, and reduce the overall threat of  gun violence around our country by extending background checks for  firearm purchases, clarifying licensing requirements, funding red flag  laws and crisis intervention programs, and weakening the boyfriend  loophole.\n\nWhile we have made strides toward commonsense…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691754/national-gun-violence-awareness-month"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…U.S.C. Sec. 201, and federal regulations, 5 C.F.R. Sec. 2635.       Although section 2635.205 lists several exemptions from the       prohibition, none exempts soliciting purchases for personal       gain.\n\nAs to why the public might be interested in sending money,       the website explains: ``This Trump Meme celebrates a leader       who doesn't back…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693839/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…diplomatic influence, values, and position sets us  apart.\n\nWhile FMS transfers are fit for many cases and situations, some  foreign partners have sought to expand their defense purchases via  greater direct commercial sales from U.S. firms. While these steps need  to be taken carefully, the review required by this bill is a smart step  in the right direction…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694810/made-in-america-defense-act"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…Earlier this month the administration announced a billion-dollar cut to  local purchasing for schools and food banks.\n\nLocal farms who rely on these programs for consistent purchases of  their food no longer have an important market, and it means that  locally grown, more nutritious food is no longer available for food  banks and schools.\n\nJust yesterday,…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689059/feeding-our-children"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…products that is an important one in Southern States like  mine is whiskey. ``The U.S. Alcohol Industry Is Reeling From Canada's  Booze Boycott. Trade fight prompts pullback in purchases by the biggest  export market for U.S.-made wines, costing American brands tens of  millions in sales.''\n\nVirginia is one of the top 10 States in the country in the volume…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696447/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…proliferated, it has also evolved.       Immediately after Citizens United, many newly empowered       groups purchased their own ads to influence elections. Some       of these purchases were reported to the Federal Election       Commission (FEC), which makes such information publicly       available. However, since at least 2020, dark money groups…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699084/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…and lost wealth for the American people. Balancing U.S. trade accounts  is an imperative and a worthy objective, but Trump administration  tariffs on the American people's purchases are taxes that cost them  more money on everything, a lot more: a lot more for food, for gas, for  building materials, for cars, for trucks, for everything.\n\nToday, after…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689822/tariffs-are-taxes"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…essential programs at Common  Ground, like the youth workforce development and community food relief,  which also partners with CitySeed to help people afford food stamp  purchases from the farm, have been shut down. They have been shut down  because of this freeze, and 71 student workers have been laid off.\n\nStudents like Kris are reaching out not…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688499/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…which are  currently classified as firearms, from all regulations under all  Federal firearm laws. These weapons would be exempted from the laws,  regardless of who uses, purchases, possesses, or manufactures them.\n\nMr. Speaker, 20 million people who are presently not allowed to  possess or buy firearms in this country--convicted domestic abuses,  convicted…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700036/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…know that State and local corrections officers are armed with  tasers within prisons and jails across the country.\n\nLet's be clear: This bill is designed to increase civilian purchases  of these weapons, and we know this because it  includes an exemption from the NFA excise tax, which law enforcement  already does not pay.\n\nMore than 3 years ago, prosecutors…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700034/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…foreign acquisitions of  agricultural businesses, including farmland involved in interstate  commerce. Since 2018, it has also been authorized to perform reviews of  land purchases near sensitive government sites. However, there is a  need to connect the Agriculture Department's expertise, including its  longstanding tracking of farmland purchases,…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692799/agricultural-risk-review-act-of-2025"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…improvement of  $490 billion to boost our economy.\n\nLower rates today will advance housing, an industry with a 3-to-1  multiplier, spur capital investment, and unlock durable good purchases,  including cars and household appliances. Unfortunately, fear-mongering  by the media drove consumer sentiment down despite, in fact, the lower  inflationary data.\n\nMr.…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692937/american-economy-gaining-momentum"}, {"senator": "James Risch", "party": "Republican", "sentence": "…Council must fully process and formally  reinstate U.N. sanctions without delay. Furthermore, once sanctions are  back in place, we must commit to their enforcement. Chinese purchases  of Iranian oil and illicit oil smuggling through third countries have  long violated existing U.N. sanctions. Once U.N. sanctions return, all  member countries will have…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694081/9999"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…the Securities and Exchange Commission       to amend the requirements of Regulation D with respect to       presentations and communications, and not with respect to       purchases or sales.\n\n(d) No Pre-existing Substantive Relationship by Reason of       Event.--Attendance at an event described under subsection (b)       shall not qualify, by itself,…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692725/helping-angels-lead-our-startups-act-of-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…utilities, furnishings, equipment, supplies, staff       training, and recruitment and other incidental costs.\n\n(iv) Economic development activities, including equipment       purchases, inventory financing, interest subsidies, operating       expenses, and similar costs not associated with construction       or expansion of existing operations.\n\n(v) Activities…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…of development companies, the number of       loans made, and the gross dollar amount of the loans made       under this title;\n\n``(9) the number and total dollar amount of purchases by       the Administrator of the principal and interest of loans       guaranteed under this title that are in default, the total       dollar amount of collections recovered…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699188/504-program-risk-oversight-act"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "Mr. HUIZENGA. Mr. Speaker, the Bureau's overdraft rule would  implement government price controls over a product that has proven  necessary for consumers to make day-to-day purchases.\n\nToday, Congress has an opportunity to invalidate this Biden-era rule  that, if implemented, would severely impact community banks and local  credit unions by restricting…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689844/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…the program closer  to the farmers who depend upon it.\n\nRight now, USDA runs two highly successful foreign assistance  programs and already handles all domestic commodity purchases for Food  for Peace Title II.\n\nMost importantly, USDA has the trust of American farmers. They know  the Agency. They understand their work, and it can deliver results. I…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691403/motion-to-discharge-s-res-195"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…technology system       for the management of inventory, including expendable and       nonexpendable items; and\n\n(2) implement such system.\n\n(b) Pilot.--If the Secretary purchases or develops a system       under subsection (a), the Secretary shall carry out a pilot       program at one Veterans Health Administration facility before       implementing…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695399/va-hospital-inventory-management-system-authorization-act"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…Federal agency that issued the service  weapon to the officer.\n\nUnder the bill, the administrator of general services would be  required to establish a program to provide these purchases.\n\nTo be eligible to participate in the program, the officer must be in  good standing with the agency and any firearm sold through the program  must be sold within 6 months…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691348/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…their retirement savings.\n\nAgain, Mr. Speaker, this is about whether you want to be involved in  your own retirement savings decisions. I do, by the way.\n\nIf the participant purchases a mutual fund through a brokerage  window, the participant would likely be subject to the highest retail  share class fee for that mutual fund. This amendment calls for the…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699155/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…ticket issuer, or       secondary market ticket exchange--\n\n(1) if offering an event ticket for resale, shall provide a       clear and conspicuous statement, before a consumer purchases       the event ticket from the ticket issuer, secondary market       ticket issuer, or secondary market ticket exchange, that the       issuer or exchange is engaged in…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690175/transparency-in-charges-for-key-events-ticketing-act"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…bill.\n\nFurther, businesses get relief, too, those awful millionaires and  billionaires, mainly in their ability to deduct 100 percent of their  expenses for manufacturing purchases. That means that manufacturers of  every variety will add equipment to their plants, increasing the  productivity and the pay of existing workers, and adding new jobs to…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693629/democrats-big-mistake"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…In 2024, the bypass flows produced $20 million in lost hydropower  generation, which instead had to be replaced with power purchased on  the open market.\n\nWAPA makes these purchases using the Basin Fund, which is funded by  hydropower revenues, not appropriations. In other words, utility  customers end up footing the very expensive bill to address the…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691060/memorandum-of-understanding-to-address-potential-impacts-of-a-certain-record-of-decision-on-the-upper-colorado-river-basin-fund"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…discounts of 25 to 30 percent below market value,  increasing their budget deficit to 2.5 percent of GDP.\n\nSustaining Putin's war depends upon China's continued support.  Beijing purchases nearly half of Russia's crude exports and provides  critical dual-use technologies for Russian materiel.\n\nPutin is overseeing a war effort that is succeeding in feet rather…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700139/ukraine"}]