[{"senator": "Gary Peters", "party": "Democrat", "sentence": "…Americans'  largest expenses, from their car payments, to their home mortgage, to  their student loans.\n\nEssentially, the longer we go without addressing this national debt,  the purchasing power of Americans' hard-earned money will shrink each  and every day, and families will continue struggling to afford the cost  of everyday life because, unlike the Federal…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698425/unanimous-consent-requests-the-calendar"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…getting where they shouldn't be and preventing serious  crimes.\n\nIf the bill becomes law, nothing would stop a convicted felon or a  convicted domestic violence abuser from purchasing an undetectable  taser and smuggling that weapon past security, onto an airplane, into a  school area, indeed, into the Capitol, unbeknownst to anyone before it  is too late.…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700036/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…we should not be cutting  food assistance programs, but that is exactly what is happening.  Earlier this month the administration announced a billion-dollar cut to  local purchasing for schools and food banks.\n\nLocal farms who rely on these programs for consistent purchases of  their food no longer have an important market, and it means that  locally…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689059/feeding-our-children"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…easily able to       procure firearms, including ``less-than-lethal projective       devices'' currently classified as firearms, with many       civilian requirements for purchasing firearm--and federal       taxes--being waived. And contrary to a further argument in       support of H.R. 2189/S. 1283, removing ``less-than-lethal       projectile devices''…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700033/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…Unless we       preserve these spaces while they are still available, we will       have none to preserve. Therefore--\n\nNixon said--\n\nI shall propose new financing methods for purchasing open       space and parklands now, before they are lost to us.\n\nThe automobile--\n\nNixon said--       is our worst polluter of the air. Adequate control requires       further…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691582/hj-res-88"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…funding for the Comprehensive Literacy Development State Grant Program  and for Innovative Approaches to Literacy grants.\n\nWe should double the Pell grant and restore its purchasing power so  students do not have to rely mostly on loans to pay for college.\n\nSadly, none of this is on Mrs. McMahon's agenda.\n\nI urge my colleagues to join me in ushering…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688311/nomination-of-linda-mcmahon"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…on the margins who now are going to have to provide more  uncompensated care.\n\nMr. Speaker, when people come off of Medicaid and when the Enhanced  Premium Tax Credits for purchasing insurance on the Affordable Care Act  Exchange expire if we don't act by the end of this year and more people  become uninsured, they are not going to magically never get…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695041/better-is-possible"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…amounts of U.S. resources  to flow to Chinese factories on the other hand.\n\nThese are not hypothetical concerns. In June, the President posted  that hopefully China will be purchasing plenty of oil from the U.S.\n\nThen, after meeting with President Xi in October, the President said  that a very large-scale transaction may take place concerning the  purchase…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697080/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…us.\n\nInstead of helping police officers by getting guns out of the hands  of criminals, our colleagues are just looking for ways to create more  loopholes in the laws for purchasing guns.\n\nMr. Speaker, again, I just wanted to nail down into the weeds here  exactly what the legislation says. The term ``firearm'' is the meaning  given that term in section…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691349/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…great, the loss of these shipments could mean fewer meals for  families in every corner of my State.\n\nFurther cuts at the hands of the administration to the USDA's local  food purchasing assistance program only add to this crisis. At the  direction of this administration, the USDA axed two programs that give  schools and food banks assistance to buy food…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689020/food-banks-facing-urgent-crisis"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…Canada or  Ontario with this trade war He is hurting small business owners.\n\nTrump's tariffs are also hurting farmers across this country who will  incur greater costs when purchasing potash, a soil fertilizer often  imported from Canada. And by inciting these trade wars, Trump is  cutting off essential export markets for our farmers.\n\nAmericans know these…", "date": "2025-03-18", "source_url": "https://justfacts.votesmart.org/public-statement/1688917/impact-of-president-trumps-disasterous-tariffs-on-canada"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…a surplus in the capital account. There is no       inherent threat to our economy if our trading partners invest       in U.S. companies or buy Treasury bonds instead of purchasing       American-made exports. In fact, it is not uncommon for the       U.S. trade deficit to increase when the economy is growing       and to decrease when it is not. The…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699566/opposing-the-trump-administrations-sweeping-national-tariffs"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…endangers the lives of first responders       responding to an incident.\n\nYet, the incidence of battery fires can be notably reduced       by following best practices, such as purchasing certified       devices and batteries, and not tampering with batteries. The       Setting Consumer Standards for Lithium-Ion Batteries Act       would be a strong step forward…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690260/setting-consumer-standards-for-lithium-ion-batteries-act"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…does the withdrawal affect other mineral       deposits in the region, such as the Tamarack Intrusion, where       the electric vehicle manufacturer Tesla committed to       purchasing 75,000 metric tonnes of nickel from Talon Metals's       Tamarack Nickel Project. Furthermore, recent research from       the Colorado School of Mines, By-product recovery…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699274/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…I will yield for another question. Thank you.\n\nMs. BLUNT ROCHESTER. As you talked about the small businesses,  Senator, I was reminded that, as we look at who is actually purchasing  this healthcare in the marketplace--a lot of people don't even know  they are on ACA and receiving the tax credit--that half of them are  small businesses.\n\nI come from…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "…I am urging our  government to do and this Senate to do. The West should unite around  security guarantees and a framework for a just end to this war.\n\nNATO will continue purchasing American-made weapons for Ukraine. The  United States can and should get Ukraine more offensive and defensive  aerial capabilities. Congress should take up the Russian sanctions…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699762/9999"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…of Representatives of       the United States of America in Congress assembled,       SECTION 1. SHORT TITLE.\n\nThis Act may be cited as the ``Safe and Smart Federal       Purchasing Act''.       SEC. 2. REVIEW TO DETERMINE THE IMPACT OF THE LOWEST PRICE                     TECHNICALLY ACCEPTABLE SOURCE SELECTION PROCESS                     ON NATIONAL…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688342/safe-and-smart-federal-purchasing-act"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…degrees.\n\nThe Federal Government spends hundreds of billions of dollars  outsourcing work to millions of contractors to perform the functions of  government. This immense purchasing power shapes the entire labor  market.\n\nWhen we embed unnecessary degree requirements into Federal  contracting solicitations, we are not just making a hiring decision; we…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700119/skills-based-federal-contracting-act-of-2025"}, {"senator": "Jim Baird", "party": "Republican", "sentence": "…equipment manufacturers  to meet. According to estimates from the Biden Department of Energy,  the final rule will cost approximately $8 billion. This will be borne  by those purchasing equipment, many of whom are small businesses. The  payback period for certain commercial refrigeration equipment under  these standards is up to 93.9 years. That is right,…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689131/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…end the sale of internal combustion engines.\n\nNow, I am not here today to disparage electric vehicles, and I am  certainly not here to discourage the manufacturing and the purchasing  of EVs either. What I am concerned about is the Federal Government  dictating which cars and which trucks are acceptable and which are not.  If Americans want to drive an…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691668/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Eric Burlison", "party": "Republican", "sentence": "…neighbor in need through  direct, tax-advantaged charitable support.\n\nThis isn't about micromanagement from Washington. It is about  restoring personal responsibility and real purchasing power.\n\nThe second part of MAHA is the insurance, which will be a new,  affordable insurance option that is paired with these accounts that  emphasize transparency, competition,…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698105/bringing-america-back-to-its-roots"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…Bowman is married to his loving wife, and he is an  outstanding father and grandfather to nine grandchildren. I know they  keep him very busy.\n\nHe began his career after purchasing a small gas station, going on to  own nine different domestic and foreign car dealerships across east  Tennessee. At the age of 90, he still continues to go into the office…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692873/happy-90th-birthday-to-willis-roscoe-bowman"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…in the 118th  Congress, as we fought every day about the costs of gas and groceries  and how it was pinching away because of Biden's inflation and what it  had done to the purchasing power of everyday Americans' accounts.\n\nPeople in probably both of our districts said the same exact thing,  that they were watching the American Dream slip away from our…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688464/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing-and-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Gary Palmer", "party": "Republican", "sentence": "…sign a lease or rental agreement. It is also  used to get a marriage license, purchase firearms or ammunition, check  in for jury duty, or enroll in a college or university. Purchasing  insurance or donating blood requires a photo ID.\n\nI hope that people who don't have a photo ID don't get sick because  they need a photo ID to purchase things like Sudafed,…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699945/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…harvesting, the Stop Forced Organ Harvesting Act of 2025       expands the U.S. government's powers to combat organ       harvesting, imposes harsher penalties for purchasing organs,       prohibits the export of organ transplant surgery devices to       entities responsible for human organ trafficking, imposes       sanctions on individuals and…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690630/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…in 1986 at the tender age of 22 years old when he started a chicken  wing restaurant, expanding his business footprint to other eateries  across Fairbanks and, eventually, purchasing the iconic Fairbanks  landmark called Pike's Landing.\n\nFor anyone going to Fairbanks, you have got to stay at Pike's  Landing.\n\nIt was this purchase that led Jay to uncovering…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690106/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…credential positively affect  health outcomes. They are responsible for managing nutrition and  foodservice operations, and are trained and qualified to administer  menus, food purchasing and preparation, and to apply nutrition  principles, among many other essential tasks.\n\nI would also like to recognize the Association of Nutrition &  Foodservice Professionals…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697863/recognizing-the-national-certified-dietary-manager-cdm-and-certified-food-protection-professionals-cfpp-day"}, {"senator": "David Kustoff", "party": "Republican", "sentence": "…American Dream, and  his philanthropic work helped support countless organizations.\n\nThanks to Fred Smith, Memphis acquired the NBA's Grizzlies in 2001  when he committed to purchasing the naming rights for the future home  of the basketball team, the FedExForum.\n\nJust 2 years ago, when The University of Memphis was ambitiously  pursuing stadium upgrades…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692825/remarkable-life-and-legacy-of-frederick-w-smith"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…purchase an event ticket the total event ticket       price at the time the ticket is first displayed to the       individual and anytime thereafter throughout the ticket       purchasing process; and\n\n(3) provides an itemized list of the base event ticket       price and each event ticket fee prior to the completion of       the ticket purchasing process.…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690175/transparency-in-charges-for-key-events-ticketing-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…broker-dealers, and investment companies. Accredited       investors may participate in investment opportunities not       available to nonaccredited investors, such as purchasing       securities that are exempt from registration with the SEC.\n\nBased on the cost of similar provisions, CBO estimates that       implementing H.R. 3339 would cost $1 million…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693888/equal-opportunity-for-all-investors-act-of-2025"}]