[{"senator": "Chris Murphy", "party": "Democrat", "sentence": "…conquest.\n\nThere was great risk in war, but there was also great reward in war.  And there was far too much of it in the era in which our Constitution  was being formed.\n\nThe purpose of the Founders was to give the American people a voice  in government--a revolutionary idea at the time--but it was also to  order our government in a way that war would…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693125/motion-to-discharge-sj-res-59"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…mandate       on the size, or even the location, of that seat of       government, other than preventing the government from       ``hold[ing] more than ten miles for this purpose.'' The       House's judgment was correct in 1846, and remains so today.\n\nThe Twenty-Third Amendment does not prevent Congress from       granting the Commonwealth statehood.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695641/district-of-columbia-policing-protection-act"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…modeled dignity, discipline, and love in the Thomas County and  Dougherty County School Systems. His students remember lessons far  beyond academics on how to live with honor and purpose.\n\nIn 1958 he and Mary Frances Royal joined hearts in marriage, a  steadfast partnership of 56 years. Family was his pride--his son Adrian  Jenkins, Jr., his late daughter…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699459/in-memory-of-mr-adrian-earl-jenkins-sr"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…They learned to  carry with them her calm, steady voice and deep compassion for  humanity.\n\nHeidi's gift has never been just in teaching technique. It has been  in teaching purpose. She instilled in each student that service is  sacred and that courage and empathy partners in every response. Her  gifts saved thousands of lives and comforted families.…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698529/recognizing-heidi-hess"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…young women. That is what this  vote is about.\n\nA nation that chooses impunity for the rich and the powerful at the  expense of children is a nation that has lost its moral purpose.\n\nYou ask why did they vote this way? Let's speak plainly. It is  because these rich and powerful men donate to the politicians in  Washington, D.C., and play golf with the…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693552/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…contributors to this edition, including  senior public servants and participants in the Stennis Program for  Congressional Interns, reflect on what it means to serve and to lead  with purpose, integrity, and heart.\n\nI am proud that this edition includes an interview conducted by  Meziah Scott, a graduate of Virginia State University, of Michael Maul,  Director…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692884/stennis-center-for-public-service-winter-2024-public-service-review"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…many American citizens from  the voter rolls, and it is already wholly unnecessary. Federal law  prohibits noncitizens from voting in Federal elections. It is done with  one purpose in mind: voter suppression.\n\nWhat they have in mind is they think those that vote Democratic are  less likely to vote than Republicans if this passes. It is trying to  slant…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690523/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…precedent where new statutory language  becomes necessary every time a new terrorist group or event emerges.\n\nNonetheless, we strongly support this legislation today, whose  purpose is incontestable and essential. I hope we can both pass this  bill and return to our bipartisan and bicameral practice for dealing  with visa sanctions whenever the occasion…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697236/no-immigration-benefits-for-hamas-terrorists-act-of-2025"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…Transportation and  Infrastructure and the House Committee on Armed Services.\n\nMr. TAKANO. Mr. Speaker, I have no further speakers. I yield myself  the balance of my time for the purpose of closing.\n\nMr. Speaker, I ask all my colleagues to join me in passing H.R. 970,  the Fairness for Servicemembers and Their Families Act, and I yield  back the balance of…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689628/fairness-for-servicemembers-and-their-families-act-of-2025"}, {"senator": "Josh Harder", "party": "Democrat", "sentence": "…First Congregational Church has  nurtured generations of Stockton families, offering not only a place of  worship, but a community rooted in compassion, justice, and shared  purpose. From its earliest beginnings in the aftermath of the Civil War  to its continued presence today, the church has grown alongside  Stockton, adapting and expanding to meet…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695384/recognizing-the-160th-anniversary-of-the-first-congregational-church-of-stockton"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…on his shoulders, never once complaining, never  once backing down from a fight when the people needed him. He walked  these Halls not for power, not for prestige, but for purpose. That  purpose was clear: to uplift the forgotten and fight for the unseen and  to ensure that every child, no matter the ZIP Code they were born in,  had a fair shot at success.…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688667/saying-good-bye-to-a-giant"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…Officer Scisco reminds Yanziel to stop, take a moment, and think,  advice for a game of checkers and for life.\n\nThis is what public service looks like: presence, patience, and  purpose.\n\nOfficer Scisco is helping build a culture of safety and connection in  our schools, one relationship at a time. I thank him and the Cape  Henlopen School District.…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693522/thanking-officer-robert-scisco"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…official  capacity, which is purportedly what this is about. They rejected it.\n\nThe Republicans didn't want to hear it because we know that, in fact,  there is a commercial purpose that pervades this entire legislation. It  is all about opening up a huge, new market to sell tasers, including to  millions of people who nobody should want to have them.…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700036/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…fraud in the 2020 elections, and  then he said thugs and criminals.\n\nThe first order is to protect us from criminals. Save America. Put  our moneys where they serve the best purpose, and that is the FBI, not  ICE.", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693518/more-funding-for-fbi"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…period last year. President Trump is the first  president to invoke section 740, but his invocation is unlawful. While  one crime is too many, there is no emergency or federal purpose that  allowed President Trump to invoke section 740.\n\nSection 740 is inconsistent with the main purpose of the HRA, which  is to ``grant to the inhabitants of the District…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694806/introduction-of-the-district-of-columbia-police-home-rule-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Speaker, then the business of  the House grinds to a halt.\n\nThe only times in which I haven't done that are when the form of a  rule, the mechanism of a rule, is abused for some purpose that actually  impacts policy.\n\nThat is what we had in this particular rule. At the end of it, which  was a normal rule for most purposes, but at the very end, Mr. Speaker,…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700046/legislative-calendar-days"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…question. It is posed: For what reasons-- why--would my colleagues on the other side of the aisle want foreigners  to vote in local elections in Washington, D.C.? What is the purpose?  Let's just pose that question of why.\n\nI ask the American public to ask your Representative where they stand  on this issue because it is a bipartisan issue, with over two-thirds…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692315/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…filing       associated with a legal proceeding;\n\n``(III) as part of medical education, diagnosis, or       treatment or for a legitimate medical, scientific, or       education purpose;\n\n``(IV) in the reporting of unlawful content or unsolicited       or unwelcome conduct or in pursuance of a legal,       professional, or other lawful obligation; or\n\n``(V)…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690186/tools-to-address-known-exploitation-by-immobilizing-technological-deepfakes-on-websites-and-networks-act"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…types of  development. In 1960, the Department of the Interior, DOI, issued PLO  2214, setting aside 8.9 million acres to establish the Arctic National  Wildlife Range for the purpose of preserving unique wildlife,  wilderness, and recreation values, withdrawing the lands from ``all  forms of appropriation . . . including mining but not the mineral  leasing…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697739/9999"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…division thereof, any judge or special trial judge, the       clerk or the clerk's deputies, as such, or any other employee       of the Tax Court designated in writing for the purpose by the       chief judge, may administer oaths or affirmations.\n\n``(2) Subpoena authority.--Any judge or special trial judge       may examine witnesses and require, by subpoena…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697269/tax-court-improvement-act"}, {"senator": "Morgan Luttrell", "party": "Republican", "sentence": "…excellence every single day.\n\nFor years, she has been a steady hand guiding our office. She brought  clarity when things were complicated, calm when things were chaotic,  and purpose when the days were long. She understood that public service  isn't about credit. It is about responsibility. She carried that  responsibility with integrity, discipline, and…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699672/recognizing-christine-lee"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…dependent on foreign imports and increasing Russia's share of global  helium markets.\n\nWhen issuing this ban, the Biden administration even went so far as  to  state that its purpose was to prevent mineral and geothermal  exploration and development. When former Secretary of the Interior Deb  Haaland testified before the Committee on Appropriations following…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699271/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…ranking minority member of the Committee on       Natural Resources or their respective designees; and (2) one       motion to commit.\n\nMr. LANGWORTHY. Mr. Speaker, for the purpose of debate only, I yield  the customary 30 minutes to the gentleman from Colorado (Mr. Neguse),  pending which I yield myself such time as I may consume. During  consideration…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688464/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing-and-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…a  report highlighting likely significant fraud in the ObamaCare  Marketplace due to lack of proper verification. In this report, by the  way, the GAO put up shoddy data on purpose to see if it would be  accepted, and it was accepted across the board, even though they came  nowhere close to providing the information they were supposed to  provide.\n\nThe…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698998/disrupt-explicit-forged-images-and-non-consensual-edits-act-of-2025"}, {"senator": "James Risch", "party": "Republican", "sentence": "…KMU-556 (GBU-31) for MK-84 warheads; 1,725 KMU-557 (GBU-31)       for BLU-109 warheads and 1,725 KMU-572 (GBU-38) for MK-82       warheads); 3,450 MK-84 2000 lb General Purpose Bombs; 1,725       MK-82 500 lb General Purpose Bombs; 1,725 BLU-109 Bombs;       3,450 GBU-39 Small Diameter Bombs; 11,500 FMU-139 Fuses;       11,500 FMU-143 Fuses; and…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688394/arms-sales-notification"}, {"senator": "Rick Scott", "party": "Republican", "sentence": "…entire ministry, and now as  the longest serving Archbishop of Constantinople in the two millennia  history of Christianity, he has worked to bring people together for the  purpose of advancing greater cooperation and mutual understanding. He  has been honored with the Congressional Gold Medal and, soon, the  Templeton Prize. Florida is home to many…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695570/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Shelley Capito", "party": "Republican", "sentence": "…to spend time on this  minor interim rule specific to one State that will not have a material  impact on air quality or attainment of the 2008 ozone standard, which  is the purpose of the rule. However, as we have seen time and time  again, they are relentless in their efforts to weaponize our  environmental statutes to shut down powerplants and manufacturing…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695512/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-emissions-budget-and-allowance-allocations-for-indiana-under-the-revised-cross-state-air-pollution"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "…Mr. Drinkard remains active in his business. He  still serves on the board of trustees at Troy University, demonstrating  that age is no barrier to leadership, commitment, or purpose.\n\nMr. Speaker, Roy Drinkard is a living example of American grit and  grace. My wife, Caroline, and I are proud to call him our friend. I ask  my colleagues to join me in…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693675/happy-105th-birthday-to-roy-drinkard"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…Mr. Speaker, I urge all Members to vote ``yes'' on the  question of consideration of the resolution, and I yield back the  balance of my time.\n\nMs. FOXX. Mr. Speaker, for the purpose of debate only, I yield the  customary 30 minutes to the gentleman from Massachusetts (Mr.  McGovern), pending which I yield myself such time as I may consume.\n\nMr. Speaker,…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693234/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…Hydroelectric  Project since 1899, marking well over a century of reliable, clean  power.\n\nFor decades, Congress has allowed for the continued use of the  Federal lands for this purpose, but unless we act now, the  authorization will expire in 2026.\n\nWithout authorization, Southern California Edison would be forced to  dismantle critical infrastructure, costing…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693463/amendment-to-kaweah-project-provision"}]