[{"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…a U.S. citizen of  entering the country illegally and held that person for days, despite  the person showing his birth certificate and Social Security card.\n\nA U.S. Army Purple Heart veteran who has lived in the U.S. for nearly  50 years was told to leave due to a 15-year-old minor drug conviction.\n\nIn Newark in January, ICE detained a veteran without…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692932/holding-power-accountable"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…His remains were not identified until 2002 after being recovered the  year before. He was finally laid to rest in Arlington National Cemetery  in 2003 and received the Purple Heart and Navy Commendation Medal with  Valor.\n\nThe Senate unanimously passed a similar version of this bill during  the last Congress. I urge my colleagues to join me in honoring…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697597/commander-delbert-austin-olson-post-office"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…to honor one of our dear neighbors in  the 12th Congressional District. We worked over 3 years to present  Matthew Fisher, a remarkable resident of my district, with the Purple  Heart for his dedication and service to our country.\n\nMatthew Fisher was born in Livonia and is a proud graduate of  Stevenson High School. In 2004, Matthew answered the call…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693028/surveillance-pricing-in-grocery-stores"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…rise today to honor United States Marine  Corporal Joseph Donald for his incredible service to our country and to  recognize his recent approval to receive the Purple Heart.\n\nThe Purple Heart is one of the oldest and most revered military  decorations. It is awarded to those who have been wounded or killed in  action while serving in the U.S. Armed…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691113/recognizing-the-incredible-service-of-united-states-marine-corporal-joseph-donald"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…across the  finish line to put more sanctions on Russia. That would make a big  difference.\n\nPresident John F. Kennedy, a Navy man and the only President ever  awarded the Purple Heart, understood exactly what to do when faced with  the Cuban Missile Crisis perpetrated by Communist Russia one-half  century ago. He blockaded the region.\n\nThis country has…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698837/reflecting-on-impact-of-illegal-action-in-venezuela"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…Joon  Park, said goodbye to his family which included his elderly mother with  dementia, his two adult children, and his home.\n\nMr. Park was shot twice in combat, earning a Purple Heart for his  bravery. Yet despite his sacrifice, ICE officers gave him no choice but  to deport himself back to South Korea after nearly 50 years.\n\nMr. Park served. He fought.…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693066/addressing-immigration-inefficiencies"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…programs  and church education.\n\nFollowing her military retirement, TSgt. Ybarra continued her service  to veterans as a National Service Officer for the Military Order of the  Purple Heart. By 2007, she had a solo office at the Waco VA campus,  where she assisted veterans, spouses, and dependents with their VA  claims and hearings for 13 years. She also joined…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696274/recognizing-technical-sergeant-martha-socorro-ybarra-usaf-retired-with-a-congressional-veteran-commendation"}, {"senator": "Richard Hudson, Jr.", "party": "Republican", "sentence": "…from his son Tucker, and I look forward to seeing further successes in  his future.\n\nGarrett has many accomplishments in his time of service, including  being awarded the Purple Heart Medal, Legion of Merit, Bronze Star  Medal and many more. But it's clear his most beautiful life  accomplishments have been marrying his wife, Lorna, and becoming a dad…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696037/congratulating-garrett-illerbrunns-career-in-the-us-armys-82nd-airborne-division"}, {"senator": "Ashley Moody", "party": "Republican", "sentence": "…during the Second World War. He  was stationed in Vire, France, where he was wounded in the line of duty  and later returned home.\n\nFor his sacrifice, he was awarded the Purple Heart, a lasting  testament to his courage, humility, and devotion to freedom. The world  owes a debt to Mr. Brewton and to his generation that can never be  repaid.\n\nBorn and…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700061/9999"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…call of duty to our Country by joining  the USMC in 1943. He served with valor in the Pacific Theatre on the  islands of Peleliu and Okinawa, where he was twice awarded the Purple  Heart medal for wounds suffered in combat. On the occasion when his  Corpsman was wounded, Cpl Ivanoff attempted nobly to evacuate him, but  both were struck by enemy mortar…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693427/recognizing-corporal-george-ivanoff-usmc"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…received a       battlefield promotion to Second Lieutenant, and was awarded       some of the       Army's highest honors, including the Distinguished Service       Cross, Purple Heart, and Silver Star.\n\n(10) Renowned historian Steven Ambrose regarded First       Sergeant Lomell's valiant acts along with General       Eisenhower's decision to invade on…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693923/leonard-g-bud-lomell-va-clinic"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…courage and distinction, embodying the highest standards of  military excellence. His bravery and leadership in combat were  recognized through numerous awards, including the Purple Heart, the  Bronze Star Medal, the Army Achievement Medal, the Army Good Conduct  Medal, the Southwest Asia Service Medal, the National Defense Service  Medal, and the Army Service…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696279/recognizing-delman-leon-orme-with-a-congressional-veteran-commendation"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…the Battle of the Bulge, and led  under fire in some of the most consequential battles of World War II.  For his courage and sacrifice, he was awarded a Bronze Star and a  Purple Heart.\n\nAfter the war, Colonel Shames continued serving our Nation,  eventually retiring as a colonel, and later made Virginia Beach his  home, where he became a dedicated community…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699640/colonel-edward-shames-post-office-building"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "Mr. BERGMAN. Mr. Speaker, it is my honor to recognize Thomas Hogan  for being inducted into the Upper Peninsula Labor Hall of Fame. A proud  U.S. Marine Corps Veteran and Purple Heart recipient, Mr. Hogan brought  the same courage, perseverance, and sense of duty he demonstrated in  Vietnam to his lifelong commitment to Michigan's working men and women.…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696859/recognizing-thomas-hogan-on-his-induction-into-the-upper-peninsula-labor-hall-of-fame"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…1, 2020.\n\nThroughout his outstanding and tireless career, Chief Kingsborough  was recognized by Middlesex Township with an Exceptional Service award,  a Medal of Honor, a Purple Heart, 2 Meritorious Service awards, 2  Outstanding Arrest awards, an Outstanding Community Service award, 2  Medals of Valor, and a Silver Star.\n\nChief Kingsborough also finishes…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698017/recognizing-chief-steven-kingsborough"}, {"senator": "John McGuire III", "party": "Republican", "sentence": "…September 11 attacks, Mr. Grapes joined the Marine  Corps as an infantry platoon commander. He deployed for three combat  tours in Iraq and earned the Bronze Star and the Purple Heart.\n\nHe continued his life of service after he returned home. In 2010, he  became headmaster of Benedictine College Preparatory, and in 2020 he  was announced as president…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689794/recognizing-jesse-grapes"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…following year. Johnny served as  a tail gunner on a B-24 bomber and was briefly stationed overseas for  six months. As a result of his meritorious service, he received the  Purple Heart, an Air Medal with Oak Leaf Cluster, the European-African- Middle Eastern Campaign Medal with one silver battle star, and the Good  Conduct Medal with one overseas bar.…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690292/recognizing-congressional-patriot-award-recipient-john-johnny-rothfus"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…explosions, and earned two Bronze Stars for Valor, the Army  Commendation Medal, and the Vietnamese Cross of Gallantry. He was  medevacked to Fort Hood after his second Purple Heart. He continued to  serve in command roles for the rest of his active service and  subsequently earned a Master's in Business Administration from Syracuse  University, eventually…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696269/recognizing-lieutenant-colonel-william-bill-patterson-matthews-usa-retired-with-a-congressional-veteran-commendation"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…during  that battle that Jim earned three Battle Stars and a Bronze Star.  Although injured by shrapnel during battle, Jim never received  treatment, thus never receiving the Purple Heart.\n\nFollowing Jim's combat service, he served as a guard during the  Nuremberg trials.\n\nShortly after returning home to Kansas following the war's end, Jim  would marry his…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699098/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…devotion to our Nation. While deployed in Afghanistan,  Keith was severely wounded when his vehicle was struck by an IED in  Logar Province. For his bravery, he was awarded the Purple Heart, the  Bronze Star Medal, and the Combat Infantryman Badge.\n\nAfter completing his military service, Keith continued his commitment  to our country. He served on my predecessor's…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690756/recognizing-keith-vanburen"}]