[{"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…peacefully stood against these abuses, they have been met with pepper  balls, tear gas, and masked agents using violent force.\n\nOnce again, nothing about this agenda is in the pursuit of public  safety. It is Federal power turned against the people who it is meant  to serve.\n\nCongress must reject cruelty as a tool of policy and restore  humanity, transparency,…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697452/fighting-dhs-immigration-raids"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…Policing, served on the Easter Seals  Southern District Board, and led civic and ministerial coalitions that  bridged faith, law enforcement, education, and the legal community in  pursuit of collective healing and progress. At the time of his passing,  he faithfully served as Chairman of the Board of the Albany-Dougherty  County Board of Elections.\n\nHis life…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699461/in-memory-of-bishop-dr-frederick-williams-sr"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…All-Holiness is also a true champion of peace, tolerance, and  defense of the environment. His coming to Washington will highlight the  role that religious leaders play in pursuit of these goals and remind  us to be stewards of all people and the planet before pursuing partisan  and personal ends.\n\nI congratulate His All-Holiness on the well-deserved…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695345/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…Delaware State Police. They  were recently awarded Medals of Valor, the highest honor their  departments can bestow.\n\nOn June 22, Lieutenant Moyer responded to a dangerous pursuit that  ended in Lewes, Delaware, where he came under direct fire from a  suspect wielding an AR-15. Under threat, Lieutenant Moyer held the line  and even helped evacuate a…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695077/recognizing-trivits-family"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…led him being hailed as ``The Bridge  Builder'', ``The Patriarch of Peace'', and the ``Green Patriarch.''\n\nEcumenical Patriarch Bartholomew's words and deeds have been in  pursuit of justice, love, and reconciliation. And his lifetime of  service and leadership has placed him among the illustrious company of  previous Templeton Prize honorees--The Dalai…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695860/recognizing-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…knowledge which at times was actually  astounding.\n\nSteve Fought began his professional career as a newspaper reporter.  He paid attention to details, and he followed that pursuit with decades  in public service, first with the State of Ohio and then with the  United States Congress.\n\nHe served under then-Secretary of State Sherrod Brown in Columbus,…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699337/applauding-president-zelenskyys-address-in-davos"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…business and IT career education teacher at Post Oak Middle  School. She was honored for her innovative teaching strategies,  unwavering commitment to student success, and active pursuit of  professional growth. Through her commitment to education, Edie has left  a lasting impact on both her students and colleagues.\n\nEdie's service and devotion to Spotsylvania…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695517/constituent-of-the-week-edie-brooks"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…engagement to  advance our shared interests and values, particularly in the context of  growing geopolitical competition and threats by our shared adversaries  to endanger the pursuit of a free and open Indo-Pacific.\n\nI urge my colleagues to join me in supporting this legislation to  sustain and expand U.S. engagement in this critical region.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694767/supporting-the-partner-act"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…an  unwavering pillar in support of intersectionality, working to foster  relations between devotees of Catholic, Jewish, and Muslim faiths. He  has been relentless in his pursuit to prevent violence on the basis of  religion, to ensure the humane treatment of all, and to join hands  across the world in seeking peace and justice.\n\nIn Oakland County,…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696019/appreciating-the-presence-and-contributions-of-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…ultimately become lawyers: John England, Booker T. Forte, Ronald  Jackson, and Michael Figures.\n\nBlack history in America is a story of resilience and excellence and  an unshakeable pursuit of justice, an unshakeable commitment to making  this country, as Martin Luther King would say: ``Be true to what you  said on paper,'' for all of us.\n\nFrom the Halls of Congress…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687900/black-history-month"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…architecture of fiscal  discipline put in place 51 years ago and explodes the debt by $3.3  trillion over 10 years and by more than $30 trillion over 30 years-- again, all in pursuit of making billionaires richer.\n\nAnd if those eye-popping debt numbers aren't alarming enough, CBO  projects that if interest rates go up by as little as 1 percent, the  costs…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693857/hr-1"}, {"senator": "Derek Tran", "party": "Democrat", "sentence": "…This is a  humanitarian crisis.\n\nCongress and the Trump administration must take action to put an end  to the violence. Killing those seeking food is incompatible with the  pursuit of peace.\n\nThe choice by Israeli leadership to engage in military actions at aid  sites endangers all innocent Palestinians and Israelis who deserve to  live with dignity.…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694015/humanitarian-crisis-in-gaza"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…the Communist bloc, our forebearers met tyranny head- on. We met the threats that we faced and stood together on our Nation's  founding commitment of life, liberty, and the pursuit of happiness,  year after year, in the face of constant threats.\n\nAmerican liberty has been a multigenerational effort, admired around  the world with each generation standing…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691084/liberty-versus-dictatorship"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…this region to advance our shared interests and values,  particularly in the context of growing geopolitical competition and  threats by our shared adversaries to endanger the pursuit of a free and  open Indo-Pacific.\n\nOver the last three Congresses, we have introduced versions of the  BLUE Pacific Act, which would advance a comprehensive, long-term U.S.…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693346/introduction-of-the-blue-pacific-act"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…in our Declaration of Independence written 250  years ago, which promised that all men were endowed by their creator  with the inalienable rights of life, liberty, and the pursuit of  happiness. Thomas Jefferson didn't mean all men. He didn't include the  men, women, and children that he owned, including his children and the  mother of those children.…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699197/building-a-beloved-community"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…chapter 5,  verse 9: ``Blessed are the peacekeepers, for they shall be called the  children of God.''\n\nOur law enforcement officers put themselves in harm's way every day  in the pursuit of justice and protection of the innocent. They are the  thin blue line that represents courage when faced with unbelievable  chaos and uncertainty.\n\nOne of the greatest strengths…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691307/thanking-police-officers-for-all-they-do"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…service to his family, to his faith, and to his  country has made him an institution in his community, and his influence  will be felt for generations to come.\n\nJudge Ginn's pursuit of excellence began with his education. He  graduated magna cum laude from Appalachian State University and earned  his law degree from the University of North Carolina at…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688470/recognizing-phil-ginn"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…Founders also made  clear that they were leaving the President certain limited inherent  power to react to an attack. For example, he can order up defensive  measures or hot pursuit of an enemy or retaliatory strikes. That is the  distinction they debated when they substituted ``declare war'' instead  of ``make war'' among Congress' enumerated powers.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698449/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…officers.\n\nEvery day, men and women selflessly and courageously dedicate their  lives to keeping America safe and sound. They uphold our public safety  and devote themselves to the pursuit of justice. Their devotion merits  our admiration, and we are deeply indebted to them.\n\nWe especially honor the fallen heroes who made the ultimate sacrifice  in the line…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690982/national-police-week"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…to be deep, clear,       and independent thinkers by engaging them with the enduring       wisdom of Western civilization and challenging them to think       critically in pursuit of truth;\n\nWhereas, Holy Family Catholic Academy maintains an       unwavering commitment to excellence in academics, rooted in       the Catholic tradition and built upon…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699458/recognizing-holy-family-catholic-academy"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…pursue       their dreams, and express themselves without fear.\n\nIn America, freedom is foundational, symbolized by       democratic values like free speech, equality, and the pursuit       of happiness.\n\nAt home, this means protecting civil liberties and ensuring       justice for all, regardless of race, gender or background.\n\nAbroad, America plays a…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691260/winners-of-the-congressional-speech-competition"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…BACON. Mr. Speaker, I rise today to recognize the Suarez-Delgado  family from my district for Hispanic Heritage Month. Their story is one  of resilience, devotion, and the pursuit of opportunity, one that  reminds us of the enduring promise of the American Dream.\n\nFather Jaime Suarez-Reyes, born in Mexico, visited Disneyland as a  child, and it lit…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695647/recognizing-the-suarez-delgado-family"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…but they reminded us why  it matters to invest in STEM education and to recognize young people  who are willing to push themselves, think deeply, and work together in  the pursuit of excellence.\n\nThey have made their fellow Pullman Greyhounds proud, including  myself, which includes their families and all of eastern Washington. I  offer my heartfelt…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690876/congratulating-pullman-high-schools-science-bowl-team"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…responsibility to the American  people to close this loophole and stop the CCP and its affiliates from  leveraging our technologies for their own military modernization  efforts and pursuit of technological dominance. Keeping this coveted  technology out of the hands of the CCP and their affiliates will ensure  that Silicon Valley, not Xinjiang, remains the center…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698859/remote-access-security-act"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…Merle Howard Award, which is one of the highest honors a young person  can achieve in the dairy industry.\n\nKyle's work ethic is demonstrated by his steady determination and  pursuit of excellence. He began by showing cattle at local shows and  progressed to state, regional, and national competitions. His  commitment took him from working on a prestigious…", "date": "2025-10-28", "source_url": "https://justfacts.votesmart.org/public-statement/1696415/congratulating-kyle-welk-on-being-named-the-2025-merle-howard-award-winner"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…Speaker, included in those police-related policy matters in the  act that they, indeed, passed in 2022 was subtitle S of the CPJRA,  which imposed a host of restrictions on police pursuit of criminal  suspects.\n\nIn doing so, the D.C. Council essentially made it illegal for police  to pursue and apprehend criminals if they were fleeing in a vehicle by  imposing…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695643/district-of-columbia-policing-protection-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…2026.\n\nIn just under a year since assuming the role of president and CEO of  Northeast Georgia Health System, Dr. Hanley has demonstrated  exceptional vision and a relentless pursuit of excellence.\n\nDr. Hanley's seamless transition to leadership continues Northeast  Georgia Health System's remarkable growth, including five hospitals,  advanced medical…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700076/recognizing-dr-matt-hanley"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…government. It is an inherent natural right. As our Founders  recognized, we are endowed by our creator with certain inalienable  rights, that among them are life, liberty, and the pursuit of  happiness.\n\nOne of the ways we pursue happiness is by transacting with each  other: We buy things, or we make money from selling things. In the  natural order, there is…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693006/central-bank-digital-currency"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…Engineering, Mr. Kroszner has been a driving force behind maintenance  and improvement for the Pennsylvania Biotechnology Center and Baruch S.  Blumberg Institute. In his pursuit of ensuring the safe operations of  the campus, he led two expansions during his tenure that improved  infrastructure for the biotech research teams, bringing old lab spaces…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696849/recognizing-mr-konrad-kroszners-16-years-with-the-pennsylvania-biotechnology-center-and-baruch-s-blumberg-institute"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…more than a century due to our historic ties  to aviation history. Although tragic accidents like these are rare,  none of us are strangers to the hazards involved in man's pursuit of  flight.\n\nWe must continue to strive to learn as much as we can about this  accident so that it never ever happens again.\n\nH. Res. 153 also lauds the heroism displayed…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688371/expressing-condolences-to-the-families-friends-and-loved-ones-of-the-victims-of-the-crash-of-american-eagle-flight-5342-and-pat-25"}]