[{"senator": "Betty McCollum", "party": "Democrat", "sentence": "Due to the perseverance of my colleagues, Ranking Members DeLauro,  Hoyer, and Frankel, the legislation before us protects funding for  Democratic priorities, reasserts Congress's power of the purse, and  rejects Republicans' poison pill riders."}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "I am pleased to say that Congress exercised  its constitutional power of the purse and rejected cuts to an agency  that serves as the backbone of our Nation's response to the mental  health and addiction crises, which continue to take too many lives in  America."}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "That is why our Constitution gives Congress--not the  President--the sole power to make laws, including the power of the  purse."}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "Speaker, openness and transparency in the budgeting process are  crucial to enabling Members of Congress to exercise our constitutional  power of the purse, conducting proper oversight and ensuring that we  are good stewards of the taxpayers' money."}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "Republicans  have purged the military of competent, experienced leaders and have  usurped congressional, constitutional power of the purse and power of  the law by dissolving programs, such as USAID, which is authorized by  law; the Consumer Finance Protection Bureau; and many, many other  government agencies."}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "They reassert Congress' power of the purse, impose checks on the  administration, and provide stability to our country and economy by  avoiding another stopgap measure."}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "As the courts have repeatedly concluded, this administration's  disregard for our Nation's spending laws and Congress' power of the  purse has harmed every corner of our country."}, {"senator": "Ed Case", "party": "Democrat", "sentence": "This access supports the operations of American  purse-seine vessels, ensuring that our fleet can remain competitive in  a region that is both economically and strategically vital."}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "The Constitution vested the power  of the purse in the Congress, not the President, and the Congress  assigned the President the responsibility to apportion appropriations  to protect Congress's power, not cede it to the Executive Branch."}, {"senator": "Al Green", "party": "Democrat", "sentence": "Because if he loses the House, he loses his ability to do many of the  things that the House can constrain him and prevent him from doing,  because the House controls the purse strings."}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "These two bills are a continuation of our efforts to reassert  Congress' power of the purse, reject $163 billion in cuts proposed by  the Trump administration, constrain the White House's abuse of the  budget process, and protect Democratic priorities at home and abroad."}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "It quotes James Madison, who said ``this power  over the purse may, in fact, be regarded as the most complete and  effectual weapon with which any constitution can arm the immediate  representatives of the people.'' I urge my colleagues to hear this  message today."}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "What it would do is basically say that when this body has approved  these grant programs, the President can't undermine the  Founders' intention that we hold the purse strings, that the President  can't undermine that and these grants have to go out as Congress  intended them."}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "The way you do that constitutionally is that Congress has the power  of the purse."}, {"senator": "Thomas Massie", "party": "Republican", "sentence": "If we allow an executive to seize foreign resources and direct  spending from pillaged accounts without congressional authorization,  then people no longer have a voice in their government, and Congress'  power of the purse becomes moot."}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "Because women make 85 percent of  the decisions in healthcare, and we can trust her to make a decision  which is good for her family's health and which is good for her purse,  which is good for her pocketbook."}, {"senator": "Tom Cole", "party": "Republican", "sentence": "Thanks to their leadership, good  will, attention to detail, and strong relationships with their  negotiating partners, the power of the purse is, once again, being  exercised by lawmakers through the committee process, as Article I  intended."}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "President, one of the most fundamental  constitutional responsibilities afforded Congress is the power of the  purse."}, {"senator": "John Barrasso", "party": "Republican", "sentence": "It is  how Congress fulfills its basic mission--the power of the purse."}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "They want to see Congress do our  most basic, essential function, which is spending government dollars  and controlling the power of the purse."}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "973(7)) is       amended by striking ``commercial fishing'' and inserting       ``commercial purse seine fishing for tuna''."}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "As the branch with the power of the purse, it is Congress'  responsibility to ensure tax dollars that go toward HUD's programs are  managed effectively, efficiently, and transparently."}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "For the first time in years, Congress is approaching the finish line  of passing all 12 appropriations bills in a transparent and timely  manner, reclaiming our constitutional power of the purse."}, {"senator": "Cindy Hyde-Smith", "party": "Republican", "sentence": "I want to also recognize the extraordinary contributions of volunteer  organizations--we certainly feel better when we see them pull up-- including national groups like the Salvation Army, the American Red  Cross, Samaritan's Purse, and Christ In Action, as well as countless  local organizations whose help has been invaluable to our State."}, {"senator": "Rand Paul", "party": "Republican", "sentence": "By consistently waiting until the last second to  pass a massive funding bill and threaten a government shutdown, the  leadership deprives Congress of what Madison called its most complete  and effectual weapon: the power of the purse."}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "A gift of a $5,000 purse from a foreign source  rightfully needs to be scrutinized and publicized."}, {"senator": "Chris Coons", "party": "Republican", "sentence": "The power of the purse is something that--going back to old England-- we fought for hundreds of years to wrest away from Kings."}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "Congress passes the laws and holds the power  of the purse."}]