[{"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…vital role in the  Allied victory in World War II.\n\nInstead of being defined by the discrimination and the doubts of  those around them, they became one of the most successful pursuit  squadrons in our military. They went on to embody the true meaning of  Black excellence.\n\nThey left a segregated country to fight in a segregated Army and  painfully returned…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699863/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…options to detain a suspect. D.C. permits vehicular pursuits,  but it imposes limitations on them. According to the International  Association of Chiefs of Police, vehicular pursuit policies must  ``balance the risks, take all of the factors into consideration, and  reach a decision that is best suited to their jurisdictions.'' Unlike  D.C., 2 percent…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695641/district-of-columbia-policing-protection-act"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…America or people who have come to the United  States of America. It is about people who just happen to be passing  through.\n\nIt is about the right to life, liberty, and the pursuit of happiness,  and especially life, because without life, you cannot have the liberty  and the pursuit of happiness.\n\nAll of these people have in common the fact that they…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695338/dark-days"}, {"senator": "Brad Schneider", "party": "Democrat", "sentence": "…in the world. It has  financed, trained, and directed Hezbollah, Hamas, Palestinian Islamic  jihad, and the Houthis. For the last 30 years, Iran has marched forward  in the pursuit of nuclear weapons, all while chanting: ``Death to  Israel, death to America.''\n\nLet me state the obvious: Iran must never be allowed to have nuclear  weapons, ever.\n\nPresident…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692935/cancellation-of-iran-classified-briefing"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…country.\n\nBlack history is a living, breathing narrative that enriches our  Nation and influences our daily lives. It is a powerful testament to  resilience, creativity, and the pursuit of justice.\n\nWe think about those who came before us and fought for freedom,  trailblazers like Frederick Douglass and Sojourner Truth, whose voices  paved the way.\n\nAs only…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687894/black-history-month"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…for  yielding.\n\nMadam Speaker, the signing of the Declaration of Independence on July  4th, 1776, marked a turning point not just in our Nation's history but  in the global pursuit of democracy and self-governance. The work  remains unfinished, and each generation has been tasked with carrying  it forward.\n\nAs we approach the 250th anniversary of that…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699839/semiquincentennial-congressional-time-capsule-act"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…Delaware State Police. They  were recently awarded Medals of Valor, the highest honor their  departments can bestow.\n\nOn June 22, Lieutenant Moyer responded to a dangerous pursuit that  ended in Lewes, Delaware, where he came under direct fire from a  suspect wielding an AR-15. Under threat, Lieutenant Moyer held the line  and even helped evacuate a…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695077/recognizing-trivits-family"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…have these  words that indicate to all that all persons are created equally and  endowed by the Creator with certain inalienable rights, among them  life, liberty, and the pursuit of happiness.\n\nI am proud that we would receive and have the Statue of Liberty. The  statue speaks to the world about who we are. It really symbolizes the  United States of…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697472/president-trump-is-a-threat-to-our-republic"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…contributes in every  field, including business, education, science, technology, and, of  course, government.\n\nMany leaders in our community emigrated from Asian countries in  pursuit of the American Dream, like my family. Their stories and  success are a testament to the founding ideals of our country.\n\nMr. Speaker, I wish a happy AANHPI Month to everyone.…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1690995/recognizing-aanhpi-month"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…Democrats here are focused on a bill to lower costs  for tens of millions of Americans and prevent many from losing  healthcare.\n\nMr. Speaker, we speak about life, liberty, and the pursuit of  happiness. We can't be free, it is hard to be happy, and lives are cut  short with no healthcare.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698789/breaking-the-gridlock-act"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…truths to be  self-evident, that all men are created equal, that they are endowed by  their creator with certain unalienable rights, that among these are  life, liberty and the pursuit of happiness.''\n\nMr. Speaker, I want to lock in for just a moment on that aspirational  objective, the pursuit of happiness. When it comes to everyday  Americans, this one…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…oversees all matters related to civil  preparedness, state and municipal police, and the overall safety of  residents. He also served on the Gaming Policy Task Force, the Police  Pursuit Task Force and the Private Security Personnel Task Force as  well as on the Executive and Legislative Nominations Committee and the  Insurance and Real Estate Committee. In…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689392/recognizing-the-honorable-steven-steve-dargan-west-havens-2025-irish-person-of-the-year"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…believe--insisted upon.  Security guarantees are essential to assure Ukraine that the United  States is not simply interested in an enrichment scheme but is  committed to the pursuit of a just and lasting peace.\n\nIndeed, a just and lasting peace must be the final outcome. That is a  United States national security imperative, one that has--at least  until…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688332/ukraine"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…All-Holiness is also a true champion of peace, tolerance, and  defense of the environment. His coming to Washington will highlight the  role that religious leaders play in pursuit of these goals and remind  us to be stewards of all people and the planet before pursuing partisan  and personal ends.\n\nI congratulate His All-Holiness on the well-deserved…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695345/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Scott Peters", "party": "Democrat", "sentence": "…that define his work.\n\nAt a time when public trust in science is more important than ever,  Dr. Crotty stands as a beacon of integrity, innovation, and hope. His  tireless pursuit of knowledge continues to save lives and will inspire  future generations of researchers.\n\nI am grateful for his leadership and proud to honor his legacy, and I  thank Dr.…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690713/recognizing-scripps-vice-chancellor-margaret-leinen"}, {"senator": "French Hill", "party": "Republican", "sentence": "…advice of persons entitled to my confidence, impelled me  to abandon the idea.\n\n``I rejoice that the state of your concerns, external as well as  internal, no longer renders the pursuit of inclination incompatible  with the sentiment of duty or propriety, and am persuaded whatever  partiality may be retained for my services, that in the present  circumstances…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700272/president-washingtons-farewell-address"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…Founders also made  clear that they were leaving the President certain limited inherent  power to react to an attack. For example, he can order up defensive  measures or hot pursuit of an enemy or retaliatory strikes. That is the  distinction they debated when they substituted ``declare war'' instead  of ``make war'' among Congress' enumerated powers.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698449/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "Ms. COLLINS. Mr. President, I rise today to introduce the Accounting  STEM Pursuit Act, which would help address workforce shortages in the  accounting profession by recognizing accounting as a STEM education  subject and adding accounting education programs…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699793/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…officers.\n\nEvery day, men and women selflessly and courageously dedicate their  lives to keeping America safe and sound. They uphold our public safety  and devote themselves to the pursuit of justice. Their devotion merits  our admiration, and we are deeply indebted to them.\n\nWe especially honor the fallen heroes who made the ultimate sacrifice  in the line…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690982/national-police-week"}, {"senator": "Ryan Mackenzie", "party": "Republican", "sentence": "…activities, and this legislation will show our clear  resolve on that issue. We must send this message: The United States  will not tolerate Iran's support of terrorism, its pursuit of nuclear  weapons, or its support for attacks on international vessels and  American servicemembers.\n\nMr. Speaker, I urge my colleagues to support this vital legislation.…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690689/solidify-iran-sanctions-act-of-2025"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…practicable, integrate the findings of       research resulting from the activities funded through such       awards with the findings of other research on student's       pursuit of degrees or careers in STEM.\n\n(2) Report on evaluations.--Not later than 180 days after       the completion of the evaluation under paragraph (1), the       Director shall…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688976/mathematical-and-statistical-modeling-education-act"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…BACON. Mr. Speaker, I rise today to recognize the Suarez-Delgado  family from my district for Hispanic Heritage Month. Their story is one  of resilience, devotion, and the pursuit of opportunity, one that  reminds us of the enduring promise of the American Dream.\n\nFather Jaime Suarez-Reyes, born in Mexico, visited Disneyland as a  child, and it lit…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695647/recognizing-the-suarez-delgado-family"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…government. It is an inherent natural right. As our Founders  recognized, we are endowed by our creator with certain inalienable  rights, that among them are life, liberty, and the pursuit of  happiness.\n\nOne of the ways we pursue happiness is by transacting with each  other: We buy things, or we make money from selling things. In the  natural order, there is…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693006/central-bank-digital-currency"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…responsibility to the American  people to close this loophole and stop the CCP and its affiliates from  leveraging our technologies for their own military modernization  efforts and pursuit of technological dominance. Keeping this coveted  technology out of the hands of the CCP and their affiliates will ensure  that Silicon Valley, not Xinjiang, remains the center…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698859/remote-access-security-act"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…pursue       their dreams, and express themselves without fear.\n\nIn America, freedom is foundational, symbolized by       democratic values like free speech, equality, and the pursuit       of happiness.\n\nAt home, this means protecting civil liberties and ensuring       justice for all, regardless of race, gender or background.\n\nAbroad, America plays a…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691260/winners-of-the-congressional-speech-competition"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…Speaker, included in those police-related policy matters in the  act that they, indeed, passed in 2022 was subtitle S of the CPJRA,  which imposed a host of restrictions on police pursuit of criminal  suspects.\n\nIn doing so, the D.C. Council essentially made it illegal for police  to pursue and apprehend criminals if they were fleeing in a vehicle by  imposing…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695643/district-of-columbia-policing-protection-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…2026.\n\nIn just under a year since assuming the role of president and CEO of  Northeast Georgia Health System, Dr. Hanley has demonstrated  exceptional vision and a relentless pursuit of excellence.\n\nDr. Hanley's seamless transition to leadership continues Northeast  Georgia Health System's remarkable growth, including five hospitals,  advanced medical…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700076/recognizing-dr-matt-hanley"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…friendship.\n\nWe convene here before the Fourth of July. I think it is worth  recalling those unalienable rights that sparked this American  experiment: life, liberty, and the pursuit of happiness. Our Founders  built this Republic on the promise of freedom: the freedom to build, to  strive, and to pursue our own dreams. But that promise only thrives  when…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693192/one-big-beautiful-bill-act"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…saxophone positions with the Moravian College  and Muhlenberg College Big Bands, and he also served as Principal Alto  Saxophone for the Moravian College Wind Ensemble.\n\nHis pursuit of excellence in music continued through his master's  education at Wilkes University and additional graduate coursework at  Villanova University, University of Miami, University…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694748/recognizing-mr-frank-c-parker-iv-quakertown-community-school-district-director-of-bands-for-27-years-of-service"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…paragraph:\n\n``(2) Notwithstanding section 3680A(b) of this title, the       Secretary may approve a rehabilitation program for a veteran       under this chapter that includes the pursuit of a course of       flight training other than one given by an educational       institution of higher learning for credit toward a standard       college degree the veteran…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699486/veterans-readiness-and-employment-improvement-act-of-2025"}]