[{"senator": "Joe Morelle", "party": "Democrat", "sentence": "…engagement, education, and  empowerment, fostering the next generation of civic leaders. Her vision  of a more just and equitable society is not just spoken--it is actively  pursued through her daily work and presence in the community.\n\nThis Caribbean American Heritage Month, it is with deep respect and  admiration that I recognize Rose Bonnick. Her advocacy…", "date": "2025-06-13", "source_url": "https://justfacts.votesmart.org/public-statement/1692570/recognizing-rose-bonnick"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…to tell the stories of those often overlooked.\n\nBorn in Muskegon and raised in Grand Rapids, Collins was drawn to art  from a young age. Despite initial discouragement, he pursued his  passion, eventually traveling to West Africa to immerse himself in his  cultural roots.\n\nCollins' work has been displayed worldwide, from exhibitions in  Africa to murals…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688206/highlighting-notable-black-leaders-from-michigans-third-congressional-district"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…view that we are representing, by the  way, is shared by most of the constituents who are represented by  Republicans too.\n\nAnd so there is still a pathway, but it has to be pursued. So the  onus is on the President of the United States and the majority leader  and the Speaker to find that pathway.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695916/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…enabling ICE to crack down.\n\nNow, let's be clear, this issue is unrelated to enforcement of our  immigration laws. We can advocate strongly that immigration laws be  vigorously pursued and prosecuted. It just shouldn't be done by the  U.S. military. We have ICE to do it. And we can be critical of ICE for  the kind of masked raids in unmarked cars that occurred…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696297/9999"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…orders.\n\nFurthermore, he has made direct and unambiguous public statements  threatening media outlets, current and  former officeholders, and advocacy organizations. He has pursued  meritless litigation, leveraged his public office for private gain, and  perverted the course of justice and the integrity of the judicial  system to extract tens of millions…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691079/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…has shoveled benefits for 50 years on the wealthiest  people in our country. Do we want to compound that unfairness with a  set of tax policies like the ones that are being pursued here and turn  around and cut healthcare for the most vulnerable people in America?\n\nIf you are concerned about waste, fraud, and abuse, go after waste,  fraud, and abuse,…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689543/h-con-res-14"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…Ecumenical Patriarch received his elementary and secondary  education in Imvros and Istanbul. After completing undergraduate  studies at the historic Theological School of Halki, he pursued  graduate studies at the Pontifical Oriental Institute of the Gregorian  University in Rome (Italy), the Ecumenical Institute in Bossey  (Switzerland), and the University…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695407/welcoming-his-all-holiness-bartholomew-i-ecumenical-patriarch-of-constantinople"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "Ms. PELOSI. Mr. Speaker, it is hard to think of anyone more  remarkable and excellent in every field and endeavor than those pursued  by Rob and Michele Reiner.\n\nRob was creative, funny, and beloved. Michele, successful in her own  right, was an indispensable partner, intellectual resource, and loving…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698360/rob-and-michele-reiner-tribute"}, {"senator": "Marilyn Strickland", "party": "Democrat", "sentence": "…A graduate of Lincoln High School, she proudly served her country in  the U.S. Army, thinking she would see the world, and ended up right  back home at Fort Lewis. She also pursued a long career in public  service as a parks commissioner, as a city councilmember, and as mayor  of Tacoma.\n\nI congratulate Victoria on an exemplary and distinguished career…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698197/recognizing-retiring-tacoma-mayor-victoria-woodards-for-her-years-of-service"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…people, to somehow imply that Democrats  don't want to lock up violent criminals. On the contrary, we do. That  is what we were promised that the worst of the worst would be pursued  and would be held accountable. However, that is not what is happening.  That is not what is happening.\n\nIn Minnesota, ICE agents have been intimidating people in hospitals,…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699593/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…Edith is an accomplished scholar, having earned both a Bachelor of  Science and Master of Science in education at Indiana University in  Bloomington. After graduating, Edith pursued a career in the teaching  profession where she went on to enrich the lives of thousands of young  minds. For over 27 years, Edith taught students at Frederick Douglass  Elementary…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699981/recognizing-mrs-mary-edith-brown-colemans-109th-birthday"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…in 2018, but you see the strategies as they are  reporting on January 2017 through January 2018. You see how the  strategies were being explored that have been so fiercely pursued this  year. You see that here he was threatening a merger, which is something  he did with CBS. You see that here he was threatening libel law  changes. And while he didn't…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…providing direction on a merit review process  between the two agencies, reporting and compliance with research  security requirements in carrying out collaborative activities pursued  under the act. This is a practical and awe-inspiring bill to maximize  the research and development activities and capabilities and results of  our Federal agencies.\n\nMr.…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688987/doe-and-nasa-interagency-research-coordination-act"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…minister of music for  churches across southwest Georgia, gathering and guiding people in  worship.\n\nIn 1991 Bishop Williams answered a divine call to preach the gospel.  He pursued nonprofit and leadership training at Clark Atlanta  University and, in 1992, launched Gethsemane Worship Center  International in Albany from a small building on Baldwin Street…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699461/in-memory-of-bishop-dr-frederick-williams-sr"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…growth for our region. The airport is a  vital economic hub for northwest Indiana. By expanding cargo  operations, attracting private investment, and supporting initiatives  pursued by the city of Gary and the State of Indiana, this funding will  help bring new businesses, create good-paying jobs, and open the door  to new passenger services for the residents.…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699321/consolidated-appropriations-act-2026"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "…Archbishop  of Constantinople in the history of Christianity.\n\nBorn Demetrios Arhondonis in 1940 on an island in Turkey, His All- Holiness Ecumenical Patriarch Bartholomew pursued theological studies  in Rome, Switzerland, Germany, and Greece before joining leadership  within the Church. He is fluent in numerous languages and has been  recognized by…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695424/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…together  welcoming their four children: Karen Delleen, Bonnie Lee, Mark Alan,  and Douglas Ray. They both made education a priority, ensuring each  child completed college and pursued careers in nursing, teaching, and  law.\n\nThe Kennedys made Poplar Bluff their permanent home in 1950. For two  decades Kathy raised her children while serving as a devoted…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696672/recognizing-anna-kathleen-cummins-kennedy"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…combination of uses meet current and future needs of the  American people.\n\nIn its waning days, the Biden administration issued an RMP amendment  for the Buffalo Field Office which pursued the no new leasing  alternative, pulling 481,000 acres of America's largest coal reserves  and resources offline, making 48 billion short tons of coal unavailable  and ending…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696878/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…States Army whose dedication, leadership, and commitment to duty  reflect the highest traditions of military service.\n\nBorn and raised in Holly, Michigan, Captain Retzlaff pursued higher  education at Cedarville University, where he earned a Bachelor of  Science degree in Exercise Science and completed the Army ROTC program.  In 2017, he was commissioned…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695837/recognizing-united-states-army-captain-mike-retzlaff"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…represents the spirit of our district. After the passing of her  husband, Ken, she chose not to slow down but to keep moving forward  with a purpose. She returned to the classroom, pursued her long-held  interest in law, and earned a degree with a perfect 4.0 grade point  average.\n\nShe went on to serve as an intern at the Sarpy County Courthouse,  where her…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699725/happy-90th-birthday-to-beth-ragland"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…Committee on Ways and Means, I would like to see  lower rates for manufacturers who, after all, are responsible for  producing the wealth in this country.\n\nIt is something I have pursued in my own personal career. We have got  a nice low tax rate for Wisconsin manufacturers, but we would like to  see a lower rate for manufacturers in the United States than…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689603/diversity-equity-and-inclusion"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…his own business-- Data Electronics--which grew across five states and demonstrated his  entrepreneurial drive and success in the field.\n\nIn the years that followed, Richard pursued a wide range of  interests, from photography to the art of stage makeup. He even  revitalized a struggling makeup studio in Chicago, turning it into a  thriving business.…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693382/recognizing-united-states-marine-sgt-richard-loughran-as-july-2025-veteran-of-the-month"}, {"senator": "Addison McDowell", "party": "Republican", "sentence": "…Americans. Today, we take a giant  step toward fulfilling the mandate given by millions of Americans.\n\nFor too long, the people's interests have been drowned out by an  agenda pursued by elite, leftwing politicians. The elite, leftwing  politicians don't feel the impact of their reckless policies. Whether  it be pursuing open border policies or policies…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688043/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…the first Native American female  Commander of VFW District 29, overseeing seven posts in Texas. Nola is  also a proud mother of four successful children, all of whom have  pursued higher education or military service. Nola Saldana exemplifies  lifelong service, leadership, and dedication to others. It is with  great honor and respect that I present…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696264/recognizing-nola-jane-saldana-with-a-congressional-veteran-commendation"}, {"senator": "Jake Ellzey", "party": "Republican", "sentence": "…degree at the University of Washington.\n\nHis first job at AT&T offered the comfort of a 9-to-5 routine, but it  was the thrill of the flight that ultimately called him.\n\nBruce pursued his dream of becoming a naval aviator, applying to and  being accepted into AOCS in Pensacola, Florida. He was commissioned in  1982, and 1 year later in 1983, he received…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691519/truth-telling-with-math-and-facts"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…submitted applications for four of       these fictitious identities in October 2024 for coverage       through December 2024, which was the remainder of that plan       year. We pursued coverage for plan year 2025 for all 20       fictitious identities, including the four identities for       which we already submitted applications. Our covert testing…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698800/breaking-the-gridlock-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…front entrance  monument to maintain the community's visibility. Hugh consistently  attends meetings to keep us updated on new laws and changes affecting  his community. He pursued certification as a Homeowner Board member  before it was required by the state. Regardless of the issue, he  remains positive and works towards reasonable resolutions, even…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692162/recognizing-hugh-townsend"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…Iranian air  strike is about more than nuclear weapons. It is about, also, the  threat of terrorism. Iranian terrorists have targeted Americans for  decades. Iran actively pursued an assassination plot against President  Trump. Other top officials in the United States have also been targets  of Iranian terrorists.\n\nRecently, Iran threatened to activate…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693098/immigration"}, {"senator": "Ashley Hinson", "party": "Republican", "sentence": "…American worker.\n\nMr. Speaker, I rise today in support of my bill, H.R. 2262, the  Flexibility for Workers Education Act.\n\nFor too long, we know that Washington, D.C., has pursued policies  that left American workers behind. Republicans continue to advance  progrowth, proworker policies that expand opportunity, reward hard  work, and help Americans…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698956/flexibility-for-workers-education-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…with abundant resources. We have the  brightest minds, and we maintain the most rigorous and clean production  standards in the world. Yet, the anti-American energy policies pursued  by radical environmentalists in the previous administration crippled  communities reliant on energy jobs, weakened us on the global stage,  and enriched adversarial nations…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694908/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}]