[{"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…because it is a permanent extension instead of a temporary one that we  agreed on for 2 years in the end-of-the-year appropriations package.\n\nNow, that bipartisan package was pushed aside by Speaker Johnson  after Elon Musk voiced his opposition to the overall package. The  temporary option would have left the door open for an off-ramp to  substances found…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692341/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…wage in 2024  because of these certificates. Those 38,000 people deserve better, much  better.\n\nIn taking action, the Biden Department of Labor spoke for those  workers and pushed for them to have a livable, honorable wage. The  Department noted that opportunities, legal protections, and support for  disabled workers have increased since 1989 when the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695575/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…Nomination of Jared Isaacman\n\nMr. President, I support the Isaacman nomination. In fact, I  supported him the first time he was nominated. He was not pushed  through the Senate, not the usual path for somebody to be nominated,  and then their nomination reversed, but then supported again by the  President. But I do believe Mr.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698254/nominations"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…clarity, and  constitutional boundaries.\n\nSince we passed this out of committee, the Trump administration has  unleashed the military against Americans in American cities. They  pushed unnecessarily expensive changes, such as renaming the Department  of Defense to the Department of War, and they continuously disregard  the Constitution of the United States…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695144/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Speaker, I don't think we ought to be lectured by  somebody who, over the years, has been the king of government shutdowns  and who worked for a United States Senator that pushed for a government  shutdown to object to the Affordable Care Act.\n\nI just want to make it clear to everybody: This is a Republican  shutdown. They control the White House. They…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696693/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…This is more than a year before the  Boston Tea Party up in Boston Harbor. On that occasion, Massachusetts  Colonials painted their faces and boarded a civilian vessel and pushed  tea bags off it into Boston Harbor. That was Massachusetts.\n\nRhode Island's effort a year and a half before was to trick the  military vessel into grounding herself, come…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691707/253rd-anniversary-of-the-gaspee-raid"}, {"senator": "Wesley Bell", "party": "Democrat", "sentence": "…fighting through poll taxes, literacy tests, and intimidation just  to cast a ballot. They were told their voices didn't matter. They  organized anyway.\n\nCountless leaders pushed from the streets, as well as leaders like  our beloved Frankie Muse Freeman, who fought in the courts.\n\nWhen I see new efforts to make voting more restrictive, more  complicated,…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700077/st-louis-all-star-frankie-muse-freeman"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…oversees strategy at Stamford Health, said       there's a chance that, if Democrats take control of Congress       in the midterm elections, some of the changes could be       ``pushed off or unwound entirely,'' he said.\n\n``We're still doing a lot of advocacy at the federal level       because this is still a moving target,'' Wade said.\n\nKramer, who heads…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694776/congress-long-to-do-list"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…the towers right after 9/11, not even these folks were  safe from the DOGE buzz saw.\n\nDOGE tried to ax the workforce for the World Trade Center Health  Program. I am glad we pushed Donald Trump and DOGE to reverse.\n\nLater today, I will join Senator Gillibrand, Representatives Goldman  and Garbarino to reintroduce the bipartisan 9/11 World Trade Center…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688202/department-of-government-efficiency"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…region without a debate in Congress and a decision by Congress as  to whether the country should go down that dangerous road.\n\nNow, at that time, many Senators, myself included, pushed for an  intelligence briefing from the administration. We had significant  questions we needed answered: Had Iran made the decision to build a  bomb? Had Iran begun the process…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693120/motion-to-discharge-sj-res-59"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…this day, the brave officers who defended Congress bear the  scars, physical and mental, of that dark day. And thanks to these brave  officers, the rioters were ultimately pushed out and lawmakers returned  that night, as I could sit at this desk after 9 p.m. that night to  return so that we could, in fact, ensure that Joe Biden was certified  as the…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698517/anniversary-of-january-6"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…Federal credit rating.\n\nFast-forward to 2017 when, instead of working with Democrats to enact  responsible tax reform, Republicans followed the same old, tired  script. They pushed through a partisan law that benefitted the  wealthiest Americans and--you guessed it--added $2 trillion to the  national debt. And like the Bush tax cuts, it left us unprepared…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695675/cloture-motion"}, {"senator": "Ruben Gallego", "party": "Democrat", "sentence": "…Babbitt. Ashli Babbitt was not a hero; she was part of the violent mob  that tried to overturn our democracy. She ignored repeated lawful  orders from Capitol Police. She pushed to the front of the crowd. She  helped to smash a window into the Speaker's Lobby and attempted to  force her way through a barricaded door while she was armed  with a weapon.…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698491/anniversary-of-january-6"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…backlogged  cases, 12 million delayed field-office transactions, and some of the  worst wait times in history.\n\nWhy is this happening? It is because the Trump administration pushed  out 7,000 Social Security employees. That is 12 percent of their  workforce. Offices were reorganized overnight, hiring was frozen, and  thousands of workers were reassigned.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698683/social-security-customer-service"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "…well-being and to  millions of Americans.\n\nHouse Democrats stood strong and voted to oppose these cuts. The  fight is not over. We will not stand by silently while Americans are  pushed into hunger.\n\nMr. Speaker, I urge the Senate to reject these cuts. I urge my House  Republican colleagues to grow a spine to fight so Americans don't go  hungry.", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691951/protecting-snap-from-budget-cuts"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…made-up  stories  on the other side of the aisle, the once upon a time stories, if you  will.\n\nNonetheless, in the eleventh hour, Joe Biden, or more accurately, his  handlers, pushed through yet another overreaching regulation that  forces the Federal Government into Americans' homes, dictating what  appliances Americans can use or cannot use.\n\nNews flash:…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688295/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…Without reliable access to  these materials, everything built on top of them becomes vulnerable.\n\nYet for years, Washington policies have discouraged domestic  production and pushed our supply chains overseas. The result was  predictable. The United States became dangerously dependent on foreign  sources for critical minerals, often controlled by adversarial…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699905/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Tom Emmer", "party": "Republican", "sentence": "…States' visibility and under  our control.\n\nAs we saw over the last 4 years under the Biden administration,  regulation by enforcement not only created uncertainty but also pushed  companies offshore. A clear and defined stablecoin framework, like that  in the GENIUS Act, keeps these innovators here at home and brings back  all those who left.\n\nThis…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693844/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…learned to persevere and overcome  any roadblocks or plateaus she hit during training. Makennah has said  that wrestling made her a tougher person, realizing that the harder she  pushed herself, the more she grew.\n\nHaving worked with Makennah since middle school, Coach Brandon Oliver  views her as a shining role model for their school's wrestling program.…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689346/joanna-sheaf-celebrates-100th-birthday"}, {"senator": "John James", "party": "Republican", "sentence": "…least restrictive setting possible.\n\nThat promise changed America.\n\nBefore 1975, more than a million children with disabilities were shut  out of public schools. Too many were pushed into charity-run facilities  or psychiatric institutions. Far too many were left without any  education at all.\n\nWe turned that injustice around. IDEA opened doors that had…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697119/marking-a-national-milestone"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…age, we are already  seeing incredible results.\n\nIn March, our economy added 228,000 jobs, beating expectations by  almost 100,000 jobs.\n\nThat same month, falling energy costs pushed inflation down to 2.4  percent. That is tied with the lowest inflation rate since February  2021. That was 1 month after President Biden took office and ushered in  the worst…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690548/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "Mr. GROTHMAN. Mr. Speaker, first of all, due to when I was pushed  back to start this, my speech will go a little less than 10 minutes, if  anybody is planning around it.\n\nMr. Speaker, I would like to talk a little bit about the big bill…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692064/monitoring-big-beautiful-bill-provisions"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…programs that abused taxpayer dollars under the previous  administration. And we saw a lot of corruption in our institutions.  With these programs, the Biden administration pushed a radical anti- American agenda, and now, with the Trump administration, we are  restoring common sense and putting the American citizens first.\n\nOn the economy, the President's…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698427/unanimous-consent-requests-the-calendar"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…allowing  the village to continue its agricultural commerce. In 1958, Tontogany  became the home of the newly formed Otsego Local School District which  was formed when the state pushed for smaller districts to merge.\n\nMr. Speaker, by celebrating the 150th Anniversary of the Village of  Tontogany, community members recognize the outstanding  achievements,…", "date": "2025-08-08", "source_url": "https://justfacts.votesmart.org/public-statement/1694722/recognizing-the-village-of-tontoganys-sesquicentennial"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…that was their goal: Get these kids in, and get them  using the chatbot. Even as employees of Meta warned that the chatbots  could sexualize children, Zuckerberg reportedly pushed for fewer  safeguards to attract as many users as possible.\n\nThis is not something that was researched here in Congress. It was  not something that was partisan. It was a reporter…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691286/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Elise Stefanik", "party": "Republican", "sentence": "…the North  Country.\n\nUnfortunately, I was dismayed to watch the agreement sit on the  Governor's desk for over 6 months while she refused to review the  documents and then pushed last-minute changes, leaving members of the  Saint Regis Mohawk Tribe and the Mohawk Council of Akwesasne, who  worked alongside my office on this legislation, in limbo and…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697676/resolving-the-akwesasne-mohawk-land-claim-in-the-state-of-new-york"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…advocate for civic engagement and transparency, I  applaud C-SPAN's commitment to chronicling democracy in action here in  the Congress.\n\nIn fact, for more than 20 years, I have pushed to allow cameras into  the Federal courthouses, including the Supreme Court, to foster a  better understanding of the Federal judiciary and its role in our  system of checks…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691703/senate-resolution-259-recognizing-june-as-the-39th-anniversary-of-c-span-chronicling-democracy-in-the-senate"}, {"senator": "Troy Balderson", "party": "Republican", "sentence": "…power generation and the needs of American  families. That is why I rise today in support of my bill, the Reliable  Power Act.\n\nUnder the Biden administration, Federal agencies pushed out rapid- fire climate rules and mandates with little coordination and even less  accountability. Instead of listening to grid operators, they raced to  advance extreme policies…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698277/reliable-power-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…endanger the American people.\n\nDoes the gentleman from Pennsylvania agree?\n\nMr. ROY. Right.\n\nMr. ROY. Zero. Now, if we are lucky--if we are lucky--we might get a  handful if pushed to the brink. Remember, we got four or five of them  to vote for, I think, the SAVE Act.\n\nLet's bring that up for a second. Should we not--in addition to  guaranteeing that…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…enough that our process was not designed to make perfect law. It was  designed to make the best law that is acceptable to a majority. Judging  by the narrow votes, we have pushed this bill about as far toward  perfection as our process allows.\n\nThe proof is not in the debate points scored today, but rather, next  year when Americans will ask themselves…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693165/one-big-beautiful-bill-act"}]