[{"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…scapegoat them,  dehumanize them, demonize them, satanize them, take away their basic  freedoms, and even deny their very existence.\n\nIt is happening to gay people right now in Putin's Russia and in  Orban's Hungary. It is happening to Uyghurs and Tibetans in China. It  is happening to Christians and free-thinkers in Pakistan. It is  happening to Muslims…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698345/protect-childrens-innocence-act"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…This amendment would be very destructive to achieving peace in  Ukraine. I agree with the gentlewoman; that should be the goal.\n\nWhat has been clear for quite some time is that Putin will only stop  his war when it is clear that he cannot achieve his objectives in  Ukraine.\n\nPresident Trump showing weakness on that issue, literally rolling out  the red…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695253/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…about limiting the  free speech on FOX, OAN, or Newsmax. Free speech is okay if you agree  with it, but if it disagrees with you, then out it goes.\n\nThat is the way it is in Putin's Russia and in Kim Jong-un's North  Korea. That is the way it is in China, Hungary, and Iran. That is not  America.\n\nAmerica believes in something good and greater: free speech,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695811/brendan-carrs-words"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…Today and Sputnik,  when he was nominated to be the U.S. attorney for the District of  Columbia. These are networks that were forced to register as foreign  agents of Vladimir Putin's government.\n\nThe truth is that his nomination was doomed, regardless. I would say  that all of these disqualifications by themselves pale in comparison to  Mr. Martin's long…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691194/calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism-and-educate-the-public-on-the-contributions-of-the-jewish-american-community"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…destabilize an ally and peaceful neighbor like  Canada is beyond reality.\n\nYet, those who speculate we should invade and take Greenland by force  are operating with Vladimir Putin's ambition to create some illegal and  unholy American empire fueled by ideology to force Canada as well into  submission to America.\n\nMaking common cause in any way with those…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699490/alberta-canada"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…illegal war of choice.\n\nAs we mark this milestone, we are faced with another frightening set  of developments. President Trump has set his sights on negotiations  with Vladimir Putin to win the war. But before reaching the negotiating  table, Mr. Trump has appeared so eager to reach  a deal that he has been willing to acquiesce to Russian demands for  essentially…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688332/ukraine"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…intention to resume nuclear explosive  testing, Trump will trigger a dangerous nuclear arms race that would  blow apart the nuclear Nonproliferation Treaty. In fact, Vladimir Putin  has already directed his forces to prepare a resumption of nuclear  testing and, just this week, the Washington Post reported that China is  rapidly expanding and modernizing…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696948/opposition-to-explosive-nuclear-testing"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…and conflict zones  across the globe and to end programs that treat deadly diseases and  prevent pandemics.\n\nThis is a bill to abandon the people of Ukraine while they resist  Putin's tyranny.\n\nThis is a bill to cut $400 million from PEPFAR, a paragon of American  leadership that has saved the lives of 26 million mothers and fathers,  sons and daughters.…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692541/rescissions-act-of-2025"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "Mr. THOMPSON of Mississippi. Mr. Speaker, like Hitler, Mussolini, and  Saddam Hussein before him, Vladimir Putin should be called what he is:  a dictator.\n\nOver the past 20 years, Putin has systematically ended free and fair  elections, crushed independent media, quashed protests, and…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687989/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…colleagues in Congress.\n\nThe dictator of Russia, as has already been pointed out, has not seen  a better day at least since the successful death of Alexei Navalny.  Let's be clear. Putin is not the only dictator--and for the third time  I use the word ``dictator''--who is dancing today.\n\nLet's just take one example. For the dictators of Iran, this betrayal…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687987/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…forget the more than 20,000 children from Ukraine who have been  forcibly deported by Russia and remain missing.\n\nI remind our President and our Vice President that it was Putin who  started this ruthless and illegal war more than 3 years ago and, we  must not forget, 11 years ago in Crimea.\n\nTo endorse a so-called peace deal that fulfills Russia's…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690214/supporting-ukraines-independence"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…and admiration of Stalinist dictator Kim Jong-un of North  Korea? He said they have a ``unique'' relationship and a very ``special  friendship.''\n\nFormer KGB officer Vladimir Putin thinks that the collapse of the  Soviet Union was the greatest catastrophe of the 21st century. Of him,  Trump said, ``Putin, very smart,'' and, ``Will he become my new best…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697148/denouncing-the-horrors-of-socialism"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…hundreds of them in the back of their  head, committing those war crimes that became so despicable in the eyes  of the world and resulted in criminal charges against Vladimir Putin.  It is the reason why I have urged that we regard the Putin regime as a  terrorist organization.\n\nI recognize we are at a critical moment in these negotiations, as  well as…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688568/9999"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…Europeans are now spending more on defense than the  United States for the first time since President Eisenhower. And they  are working together to strengthen sanctions against Putin and his  bloodthirsty gangs who are wreaking havoc on Ukraine and Europe.\n\nI have some good news that I wanted to share with you from the  Foreign Relations Committee this…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696340/trump-administration"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…nuclear war do not seem especially interested in ``an effort       to improve our understanding'' of the Russian leadership's       thinking. The rote storyline--that Vladimir Putin is evil,       end of story--blends in smoothly with US news media and the       punditocracy. What it also does is give more fuel to the       momentum toward nuclear holocaust.…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693757/marking-80-years-after-trinity-the-dangers-of-nuclear-war-have-never-been-higher"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…this. We need to use our Article I powers today and be counted for what  we believe in.\n\nWhat happens if we withdraw from the Baltics? No one will be more  happy than Russia's Putin. Secondly, deterrence will be weakened, and  war in Europe becomes more likely if we withdraw.\n\nStrong support for the Baltic Security Initiative is a vote for  deterrence.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695259/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…chance after  54 years of Ba'athist socialist dictatorship, a message to the  dictators in Tehran.\n\nFinally, enhancing security ties with European allies to defeat war  criminal Putin keeps American families safe at home.\n\nMr. Speaker, I encourage my colleagues to support the bill.\n\nFirst, I want to take a minute to thank the ranking member. As  anybody…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697810/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…families.  It was to satisfy the radical green activists.\n\nLet me be clear that this ban put politics over people by  jeopardizing the American economy and handing Vladimir Putin a lifeline  as our European allies were forced to scramble for energy. That was not  leadership. That was failure.\n\nIt gets worse. After independent experts uncovered major…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697088/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "…to add my  voice to the many who are commending President Trump as he works toward  peace in Ukraine.\n\nThe President recently gave the aggressor, Russian dictator Vladimir  Putin, every chance to put down his guns and end the killing. He has  done that over and over, but our President is now showing that he will  not wait on Mr. Putin forever. Every…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690223/ukraine"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…former Soviet Union. He called it a riddle wrapped  in a mystery inside an enigma, but when it comes to negotiating peace  in Ukraine, we might be tempted to assume that Vladimir Putin is  working from the same playbook as other stakeholders. But that is  simply not the case. The fundamental differences between Russia and the  West have become all that much…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690955/ukraine"}, {"senator": "French Hill", "party": "Republican", "sentence": "…economic destruction, and we certainly should routinely jaw- jaw with those great powers about our possible shared objectives and  deep concerns.\n\nHowever, in the instance of Czar Putin, he has never been interested  in jaw-jaw. He is a creature of his KGB upbringing. There was no jaw- jaw with the Chechens in 1999, and there was no jaw-jaw with the  Georgians,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695367/greater-sanction-pressure-on-russia"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…knows very, very well because I have talked to you about it.\n\nThis military installation is very serious. It is very important.  Why? Well, President Xi in China and President Putin in Russia and the  Ayatollah in Iran have formed a partnership, and the managing partner  is Xi Jinping.\n\nAnd their goal is to have Russia dominate Central and Eastern Europe,…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699482/9999"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…independence, achieving stability with prosperity.\n\nDictators around the world are losing in the war of dictators with  rule of gun invading democracies with rule of law. War criminal Putin  is failing in Ukraine with Ukrainians inspired by President Volodymyr  Zelenskyy.\n\nIn Georgia, the legitimate president, Salome Zourabichvili, is  respected worldwide.\n\nIn…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688138/promoting-stability-and-prosperity"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "Mr. WICKER. Mr. President, this month we will reach the fourth  anniversary of Vladimir Putin's unprovoked and illegal invasion of  Ukraine.\n\nAs we all know, Vladimir Putin is a war criminal, a KGB alumnus, an  oppressor of the Russian people, and we also are finding…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699762/9999"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…countries are again free and  prosperous and these three countries happen to be among the most pro- American allies.\n\nI wonder if we can learn a lesson because we know that when Putin  invaded Ukraine in 2022, he has since kidnapped about 20,000 young  people from Ukraine and taken them to Russia to ``Russiafy'' them, I  guess you would say.\n\nWe don't hear…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689062/russia"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…that  should be for the people of Georgia.\n\nThey are also subservient to the regime in Tehran, who we know  launched attacks against Israel just yesterday; and war criminal Putin,  who seeks to indeed make the people of Georgia subservient.\n\nThe Georgian people are among the bravest and most pro-American in  the world. I have had the opportunity, with…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690702/mobilizing-and-enhancing-georgias-options-for-building-accountability-resilience-and-independence-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…more dangerous place because when our adversaries sense weakness,  it is actually an incentive for them to act.\n\nI think it has been said before, and I think it is true, that Putin  would not have invaded Ukraine again if President Trump had been in  office. But with President Biden and then previously with President  Obama in office, he knew that paper…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698578/trump-administration"}, {"senator": "John Thune", "party": "Republican", "sentence": "…President Trump has gone to extraordinary  lengths to bring an end to the bloodshed in Ukraine, and we here in the  Senate commend him for those efforts.\n\nNow the ball is in Putin's court. It is time for him to come to the  table in good faith and make a serious proposal for an immediate cease- fire that can lead to a just and lasting peace in Ukraine.…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691644/ukraine"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…One hundred days of chaos in the White House, where Secretary Hegseth  texts war plans to journalists, and the administration belittles allies  while embracing dictators like Putin.\n\nOne hundred days of corruption, as billionaires like Musk and DOGE  take Americans' personal Social Security data and fired the employees  we need to process those Social…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690387/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…watched in the last year the remarks and the actions  of our President and Vice President, they are chillingly rhyming with  those of dictators like President Xi and President Putin of the PRC and  Russia--the growing and steady use of unrestrained state power to  punish the President's perceived enemies. And I am wrestling with a  growing sense of gloom,…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699917/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}]