[{"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "Mr. Speaker, I rise to speak in support of H.R. 1679, the Global  Investment in American Jobs Act. This legislation will encourage  foreign direct investment to support high-quality American jobs.\n\nForeign direct investment from nonadversarial Nations can be used to  grow critical sectors important for our economic success and national  security including…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692696/global-investment-in-american-jobs-act-of-2025"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…miles of fish passages opened; nearly 1,500 new public water  access sites established; upgrades to every large wastewater treatment  plant in the watershed to improve water quality; and the largest oyster  reef restoration in the world: These are just five of the biggest wins  in the last 43 years of the landmark Chesapeake Bay Watershed  Agreement.…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698039/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…the Chuctanunda Creek as it emptied into the Mohawk River.\n\nWith the passage of the Clean Water Act, Congress took historic  action to protect public health and improve the quality of drinking  water across our great country.\n\nOur rivers, our brooks, and our streams are the center of our  communities, and we have come so far to protect and strengthen…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698044/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…history refresher here. Back in 1966, California  established the first tailpipe emission standard for passenger vehicles  in the Nation, responding to California's unique air quality needs with  policy based on science and data. A year later, California established  the California Air Resources Board to more comprehensively address the  severe air pollution…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691620/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "Jimmy Panetta", "party": "Democrat", "sentence": "…PANETTA. Mr. Speaker, I rise as a co-lead of the Studying NEPA's  Impact on Projects Act.\n\nAs we have heard, this is a bill that would require the Council on  Environmental Quality to provide annual reports that evaluate the  efficiency and effectiveness of the Federal permitting process.\n\nI thank Representative Yakym for his leadership on this issue…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697712/studying-nepas-impact-on-projects-act"}, {"senator": "Jared Moskowitz", "party": "Democrat", "sentence": "…Fame, an esteemed tradition made possible through the tireless  efforts of the Area Agency on Aging of Broward County, a cornerstone  organization dedicated to enhancing the quality of life for older  adults in our community.\n\nThe Area Agency on Aging of Broward County is part of a vital  statewide network of 11 Area Agencies on Aging across Florida.…", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691691/recognizing-the-2025-honorees-of-the-broward-county-florida-senior-hall-of-fame"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…observance highlights the urgent need to address disparities in  maternal health outcomes for Black women, ensuring that all mothers  receive equitable, respectful, and high-quality healthcare.\n\nThe United States continues to face a maternal health crisis, with  Black women experiencing significantly higher rates of pregnancy- related complications and…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688983/recognizing-black-maternal-health-week-in-santa-clara-county-california"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…Mr. Speaker, I am here today to make it clear that I am going to take  my time and ensure that the American people fully understand how  damaging this bill will be to their quality of life.\n\nRepublicans and Donald Trump promised that costs would go down on day  one. Costs haven't gone down under Donald Trump and House Republicans  here in the United…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…Healthcare and Lowering Costs Act, which  will restore people's benefits and access to care, ensuring that people  in small towns and rural communities will have more access to quality  care, not less.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695373/one-big-beautiful-repeal"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…and with a mother who worked as a  receptionist. This President promised. He said, on day one, that he was  going to reduce the cost to American families and improve their quality  of life. Only, 100 days later, Americans have only seen reductions in  the stock market, in their 401(k)s, and a lowered respect for the  Constitution. What we have seen…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690300/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…including AMBER Alerts and lifesaving weather alerts like  tornado and flash flood warnings. Look no further than the absolutely  devastating news out of Texas. Access to high-quality information can  truly be the difference between life and death. Access to local news  from reporters and sources that community members trust is more  important than ever.…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693591/rescissions-act-of-2025"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…I hear from District of Columbia residents frequently about the  negative impact of train noise and vibrations on their lives. The noise  and vibrations can harm health and quality of life and can even damage  the structural integrity of homes. As a senior member of the Committee  on Transportation and Infrastructure and as the ranking member of the…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689433/introduction-of-the-train-noise-and-vibrations-reduction-act-of-2025"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…shared goal, ensuring that men, no matter where they live, what they  look like, what their race or religion may be, all have access to  healthcare, to health information, to quality care that they need to  live longer, healthier lives.\n\nAs chair, I am committed to continuing this important work and  encouraging men to take a proactive approach to their…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692206/raising-awareness-about-mens-health"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…Regional Housing Authority, dedicated to prioritizing the needs of its  residents. This complex offers reduced rent prices for its tenants  while also providing easy access to quality-of-life amenities such as  their community garden, BBQ area, and many nearby food choices and  transportation options. The Ives has added 50 units of affordable  housing to…", "date": "2025-08-08", "source_url": "https://justfacts.votesmart.org/public-statement/1694724/recognizing-the-ives"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…the Coast Guard to conduct each of their diverse  missions to better serve the American people.\n\nThis bill puts coasties first by addressing the need for more  affordable and quality housing. It also provides enhancement of our  coasties' quality of life, such as family leave policies, career  flexibility, tuition assistance incentives, and behavioral…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694192/coast-guard-authorization-act-of-2025"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…strengthening rural healthcare, and giving families peace  of mind.\n\nI am proud to have secured this investment and will continue working  to ensure that rural Iowans receive the same quality care as any  American, no matter their ZIP Code.", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696794/highlighting-critical-investments"}, {"senator": "Julia Letlow", "party": "Republican", "sentence": "…decades, this cooperative has grown  to serve more than 200 independent retailers, a model that strengthens  local economies and ensures that consumers have access to fresh,  quality foods, even in rural and underserved areas.\n\nCongratulations to Associated Grocers, Inc. of Baton Rouge on this  milestone anniversary. May their legacy of service, partnership,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691354/congratulating-associated-grocers-inc-of-baton-rouge-on-their-75th-anniversary"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…of Asian Pacific  Community Health Organizations' mission seeks to bring about a world in  which all the communities AAPCHO serves have equitable access to  affordable, high quality, and culturally and linguistically proficient  health care. To date, the Association of Asian Pacific Community Health  Organizations comprises 34 community health organizations…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694737/recognizing-jeffrey-b-caballero-mph-executive-director-of-the-association-of-asian-pacific-community-health-organizations-aapcho"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…have known for decades. The American worker is among the most talented  in the world. Whether it is energy, technology, or chemicals, Americans  produce some of the highest quality products in the cleanest, most  efficient, and socially responsible ways possible.\n\nWith the resurgence in America's manufacturing industry, global  investors are now clamoring…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692695/global-investment-in-american-jobs-act-of-2025"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…secure our border because border  security is national security, begin to rebuild our munitions  stockpiles and critical mineral supply chains, and continue to improve  the quality of life of our servicemembers and their families.\n\nWith these investments, we will work to restore American deterrence  and build the ready, capable, and lethal fighting force…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693190/one-big-beautiful-bill-act"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…incredible first step in making education possible for  our Nation's students. As we look to the future, we must maintain and  remain steadfast in our commitment to making high-quality, tailored  education possible for every American student.\n\nHere is to another 50 years of IDEA.", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697766/50th-anniversary-of-the-individuals-with-disabilities-education-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…from a public school. Our public school system, envisioned by our  Founding Fathers, is meant to give every child, regardless of ZIP Code,  background, or ability, access to a quality education.\n\nThese schools provide knowledge and skills that allow our young  people to thrive and contribute to our communities.\n\nAs a senior member of the Education and Workforce…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688125/recognizing-public-schools-week"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Demographics are the primary  driver of U.S. sovereign debt. It is hard to campaign against the other  side. Maybe we can take a couple of months off and actually do good,  quality policy and legalize properly vetted and properly certified AI  to prescribe.\n\nThis August, with the wearables, I am going to do an experiment with  this Oura Ring. I am buying…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694131/dismantling-californias-citizens-redistricting-commission"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…expenditures under       section 404, including specific procedures for--\n\n``(A) ensuring that activities carried out to address mine       drainage will result in improved water quality;\n\n``(B) monitoring, sampling, and the reporting of collected       information as necessary to achieve the condition required       under subparagraph (A);\n\n``(C) operation…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691092/community-reclamation-partnerships-act-of-2025"}, {"senator": "Richard Hudson, Jr.", "party": "Republican", "sentence": "…development, and utility construction have been critical for the  development of North Carolina.\n\nMr. Donnie Oldham embodies the mission of Sanford Contractors to  deliver the highest quality projects that exceed expectations while  ensuring the safety and professionalism of team members.\n\nMr. Speaker, please join me today in honoring Mr. Donnie Oldham on  his…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694151/congratulating-donnie-oldham-on-being-inducted-into-the-carolinas-agc-hall-of-fame"}, {"senator": "Rudy Yakym III", "party": "Republican", "sentence": "…regional leader in  steel erection, proudly serving not only Indiana but also throughout  the Midwest.\n\nOver the past five decades, the company has completed countless high- quality metal building projects, as well as specialty installations,  demonstrating excellence and innovation at every turn.\n\nLeMaster's growth is a testament to their hard work,…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693965/9999"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…residents and visitors alike.\n\nUnder his leadership, New Hope continued to strengthen its position  as one of Bucks County's most recognizable destinations, balancing  tourism with quality of life for those who call the borough home. Mayor  Keller's service exemplified integrity, approachability, and a deep  respect for local government's role in serving the…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699203/congratulating-larry-keller-on-his-service-as-mayor-of-new-hope-pennsylvania"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…for the  Church's generosity in allowing Troop 219 to host meetings using their  space. In the planter boxes, he chose to set flowers to help promote  relaxation, improve air quality, and create a peaceful and welcoming  environment for church attendees.\n\nIn addition to his exceptional academics, Oliver previously served as  a U.S. Youth Ambassador to…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694160/recognizing-eagle-scout-oliver-royal"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…Active-Duty servicemembers and the veterans who have sacrificed for our  freedom.\n\nLisa's belief has always been simple yet powerful: The people who  defend our Nation deserve quality homes, supportive communities, and a  true sense of belonging.\n\nOne of the most outstanding examples of this commitment is at Offutt  Air Force Base in Bellevue, Nebraska.…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696802/recognizing-lisa-yanney-roskens"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…stewardship actually go hand in hand. We have invested billions in  clean and emissions-controlled technology. We have reclaimed our lands  and maintained some of the strongest air quality records in the Nation.\n\nWe can grow the economy, power the country, and steward the  environment all at once. That is the American Way, and that is  certainly the North Dakota…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694907/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}]