[{"senator": "Al Green", "party": "Democrat", "sentence": "…developed, speak  in terms of individuals. The President of the United States of America  has decided that the Department of Defense will be the Department of  War now, taking us a quantum leap backwards in time to when it was  previously the Department of War, but we had the good sense to  understand that it would be better to be a Department of Defense than…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695338/dark-days"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…Martinis and Professor  Michel H. Devoret--both of the University of California, Santa  Barbara--were all awarded the Nobel Prize in Physics for their  groundbreaking research in quantum computing. Their work will advance  evolving technologies in everything from drug discovery to agriculture  to cybersecurity and beyond. As UC President James Miliken has…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696912/recognizing-californias-2025-nobel-laureates"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…postwar era, has been the premier nation with respect to science  and technology and innovation.\n\nThat is how we got Apple, that is how we got Microsoft, and that is  why we have quantum computing. All of these fantastic innovations and  giant steps forward came from the United States, in part because of the  research that was funded in part by the Federal…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691087/big-backstabbing-bill"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…tomorrow's breakthroughs, our competitiveness, and the livelihoods of  the next generation.\n\nThis is about whether America leads in clean energy, advanced  manufacturing, quantum computing and semiconductors, or cedes those  opportunities to competitors abroad. We are supposed to win all the  races and make us great again. We are falling behind in…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695601/devastating-harm-caused-by-trump-administration"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…projects to benefit both our countries.\n\nHe also spearheaded a cutting-edge tech partnership that is unlocking  billions of dollars in bilateral investments, including for AI and  quantum technology.\n\nAmbassador Rudd's leadership strengthened Australia's security and  our shared security alliance for decades to come. Thanks, in part, to  his efforts, our governments,…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699544/9999"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…manufactured goods in the world--$2.06 trillion in  2024.\n\nAnd it is clear today, the United States must be competing hard to  win in the race for emerging technologies like AI and quantum. Our  foreign adversaries and our competitors are in this global race too.\n\nSo that is why economic disruption puts America at risk. Straining  ties with trade alliances also…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689522/klobuchar-ms-murkowski-mr-warner-mr-mcconnell-and-mr2024"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…stroke of a pen  in the Oval Office have sincere, grave, and real results that are  harmful.\n\nAs a lawmaker, I choose to use my time to continue to craft the  legislation on quantum and on reauthorizing NSF and NIST that I am so  proud to see making its way through the Committee on Science. I hope  that my colleagues will join in to pass those bills.…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691394/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…longstanding partnership between the Department of Energy  and the National Science Foundation to leverage the unique investments  and expertise in a wide range of fields, including quantum science,  artificial intelligence, fusion energy, and, of course, advanced  manufacturing.\n\nAlongside these research partnerships, this legislation also  authorizes collaborative…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688990/doe-and-nsf-interagency-research-act"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…this sort of appeal completely.\n\nThis letter highlighted the importance of NSF funding to our  country's leadership in cancer research, energy, artificial  intelligence, and quantum computing. None of this work would be  possible without program managers and experts who play central roles in  grant funding decisions at the agency.\n\nA negative consequence…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691390/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…are  doing and everything that is happening right now. They want to  undermine and replace our leadership in science and innovation. We are  at risk of being outrun on AI, quantum, and so many other critical  technologies and innovations.\n\nInstead of helping us maintain our global leadership, this  administration is slashing funding to our science agencies…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691395/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…and  technology, and the workforce of the future. It will help us maintain  our Nation's leadership in the industries of tomorrow, including  nanotechnology, clean energy, quantum computing, and artificial  intelligence. The CHIPS and Science Act is already making a huge  difference, but we must build on this success rather than tear it down.\n\nOne other…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692732/deploying-american-blockchains-act-of-2025"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…out cross-cutting and  collaborative R&D activities and identifies nuclear power and  propulsion, high energy physics and astrophysics, Earth and  environmental sciences, and quantum information sciences as potential  areas for joint activity.\n\nI only hope that the citizens of America are tuned into this debate  in this moment because this is really exciting.…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688987/doe-and-nasa-interagency-research-coordination-act"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…and design to  address agricultural issues; identifying the use of deepfakes and  curbing the spread of misinformation; and supporting and training the  next generation of quantum technicians.\n\nCuts to these programs, and many more, came with no transparency,  little communication, and zero accountability.\n\nMy colleagues on the Science Committee have…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691188/protect-medicaid"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…manufactured goods in the world--$2.06 trillion in  2024.\n\nAnd it is clear today, the United States must be competing hard to  win in the race for emerging technologies like AI and quantum. Our  foreign adversaries and our competitors are in this global race too.\n\nSo that is why economic disruption puts America at risk. Straining  ties with trade alliances also…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689549/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…we have a  President and an administration that is antiscience and antiprogress.\n\nJust as we have made investments in projects that are pivotal in  artificial intelligence, quantum, and other leading areas at NIH, NOAA,  NASA, the CDC, EPA, and, tragically, the National Science Foundation,  now is not the time that we stop investing in our future. This…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691389/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…gigawatts of power offline. The energy demands of  our country are skyrocketing because of the technologies of the future,  because of digital asset innovation, because of quantum computing and,  yes, because of artificial intelligence.\n\nMr. Speaker, it is predicted and projected that by 2030 power demands  resulting from datacenter construction will…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699277/highlighting-republican-successes-in-2025"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…example right there from  Europe.\n\nWe know we need the power or we are going to lose the great battle of  our time of who is going to control AI and supercomputing, eventually  quantum computing.\n\nThe very first thing we can do to really bridge that power gap is not  take power offline. I think it is reasonable to do. I think it is the  right thing to do,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695764/national-coal-council-reestablishment-act"}, {"senator": "Chuck Fleischmann", "party": "Republican", "sentence": "…supply chain of critical  minerals.\n\nThe bill furthers our Nation's scientific and technological  leadership, including a strong focus on laying the groundwork for AI  and quantum efforts, by providing $8.4 billion for the Department of  Energy's Office of Science.\n\nAt the same time, the bill reduces funding by over 29 percent across  numerous other…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698750/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…successful history of interagency collaboration with NASA. Over the  last 60 years, this relationship has evolved from radioisotope power  systems to new areas of research such as quantum information and  environmental sciences.\n\nThis interagency relationship has greatly benefited my home State of  Alaska. The North Slope of Alaska is home to the Department…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688986/doe-and-nasa-interagency-research-coordination-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…importantly, in certain critical sectors.\n\nAs of 2023, U.S. investors were investing close to $2 billion in  Chinese critical technology sectors, including semiconductors, quantum  computing, and artificial intelligence. A report from the U.S.-China  Economic and Security Review Commission noted: ``The United States is  the most important foreign source…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688824/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…the Chinese  Communist Party. This adversary has made no secret of its intentions to  surpass the United States in key technological areas, from artificial  intelligence to quantum computing to biotechnology.\n\nIn 2022, Congress passed the Research and Development, Competition,  and Innovation Act as part of the CHIPS and Science Act. That bill  prohibited…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688932/united-states-research-protection-act"}, {"senator": "Jim Baird", "party": "Republican", "sentence": "…the National Science Foundation are  vehicles for some of our nation's cutting-edge scientific research.  Combined, these agencies tackle the modern challenges of physics,  quantum information sciences, Artificial Intelligence, and beyond.  However, there is no clear directive for these organizations to work  together.\n\nThis LegisLation explicitly directs…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688988/doe-and-nsf-interagency-research-act"}, {"senator": "John McGuire III", "party": "Republican", "sentence": "…industry, advanced  manufacturing, and workforce development sectors. It also takes  necessary steps to address the extraordinary threats in the cyber  domain posed by AI and quantum computing.\n\nMr. Speaker, I thank the committee staff and my own staff for their  hard work on this year's bill, and I encourage all of my colleagues to  vote ``yes.''", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697799/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…accordance with section 306 of the Department of Energy       Research and Innovation Act (42 U.S.C. 18644) and section       60501 of title 51, United States Code.\n\n(E) Quantum information sciences, including quantum       computing and quantum network infrastructure, in accordance       with sections 403 and 404 of the National Quantum Initiative…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688985/doe-and-nasa-interagency-research-coordination-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…billions of dollars.\n\nThe U.S.-China Economic and Security Review Commission noted that the  United States is ``the most important single source of investment to  semiconductors, quantum computing, and AI in China.'' In other words,  we are funding our principal competitor, and that competitor is not  only an economic competitor but is vying for hegemony in…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697200/senate-agenda"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "…of the aisle.\n\nI thank them all, and I thank this Senate and our friends in the  House for coming together in the spirit of patriotism and comity to get  this very important quantum leap in our defense accomplished.\n\nWith that said, let's begin the vote and take the next step to  rebuild America's national defense.                                3961.", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698257/nominations"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…predictive analysis, and advanced computational, storage, and       networking capabilities in order to optimize algorithms for       purposes related to energy and climate;\n\n(D) quantum information sciences, including quantum       computing and quantum network infrastructure, including in       collaboration with the programs authorized under sections 403…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688989/doe-and-nsf-interagency-research-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Automated vehicles and unmanned delivery systems.\n\n(iii) Blockchain and other distributed ledger, data       storage, data management, and cybersecurity technologies.\n\n(iv) Quantum computing and quantum sensing.\n\n(v) Additive manufacturing.\n\n(vi) Advanced manufacturing and the Internet of Things.\n\n(vii) Nano technology.\n\n(viii) Robotics.\n\n(ix) Microelectronics,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690188/promoting-resilient-supply-chains-act-of-2025"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…importantly, in certain critical sectors.\n\nAs of 2023, U.S. investors were investing close to $2 billion in  Chinese critical technology sectors, including semiconductors, quantum  computing, and artificial intelligence. A report from the U.S.-China  Economic and Security Review Commission noted: ``The United States is  the most important foreign source…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688807/cormick-and-mmcr-fettermanhagerty-kim-cormick-schumer-sullivan-fetterman-and-others-for"}, {"senator": "John McGuire III", "party": "Republican", "sentence": "…United States is in a race with the Chinese Communist  Party to be the global leader in the development and deployment of  artificial intelligence and other capabilities such as quantum  computers. Any vulnerabilities in our supply chain that our adversaries  can exploit not only threaten our global standing in the artificial  intelligence space, but it also…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697894/electric-supply-chain-act"}]