[{"senator": "Josh Harder", "party": "Democrat", "sentence": "…Highway Patrol, Tracy Police Department, Manteca Fire Department,  Lathrop-Manteca Fire District, Defense Logistics Agency, and more.\n\nNot only did the emergency response effort quickly and effectively  facilitate the evacuation of the Tracy Hills community, serving as a  model for future evacuation efforts, but their bravery minimized damage  in the area.…", "date": "2025-05-23", "source_url": "https://justfacts.votesmart.org/public-statement/1691677/recognizing-the-1st-anniversary-of-corral-fire-in-san-joaquin-county-california"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…across the  board that when Medicaid gets cut, we all lose.\n\nWe lose our local labor and delivery service. We lose our local  emergency room. We lose the ability to be seen quickly in the event of  an emergency because somebody who could have been taken care of by a  primary care physician a couple of days earlier with an uncomplicated  illness is now…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691419/gop-tax-scam-hurts-everyone"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…provide? Exactly which out-of-town interests will get the profits if  these firms succeed?\n\nResidents across our region complain State and local approvals are  moving too quickly. In Ohio, the crooked PUCO and Ohio's Legislature  have granted giant tax breaks to data centers, while local township  officials remain in the dark about details. That is…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697372/rushing-to-build-ai-data-centers"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…ensure accountability and fair access. Cutting them  to free up funds for PPP would have compromised the integrity of the  program.\n\nMoreover, these funds needed to be disbursed quickly. Imposing a no- new-spending-without-cuts approach would have delayed or reduced aid to  small businesses.\n\nThe bottom line is that this bill is slogan over substance and…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697332/small-business-regulatory-reduction-act-of-2025"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…that they  passed. Of course, we all remember a couple weeks back this bill was  pushed through in the dark of night, after 1 a.m. It was clear that it  was rushed through so quickly that most of our colleagues did not have  time to read it, did not understand what was in it, and did not have  time to have their staffs review what was in it.\n\nThis was…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692038/consequences-of-doge"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…UPS' world hub. This will help everyone, including those people  in Louisville, Kentucky.\n\nMr. Speaker, I urge my colleagues to support this bill that is not  only happening quickly but, I will also note, is happening with  bipartisan support. I yield back the balance of my time.", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690651/aces-act"}, {"senator": "Jim Costa", "party": "Democrat", "sentence": "…Continuity Act that will reduce financing costs and  bipartisan legislation on permitting reform to get infrastructure like  energy, transportation, and housing projects more quickly approved for  working families.\n\nMr. Speaker, we need bipartisan solutions, and they are clear.  Congress must act now to ease costs, expand access to healthcare, and  invest…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698830/putting-americans-first"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…reopening of  the government.\n\nFirst off, that is exactly what these corrupt Senators were hoping  they would say. Second, we absolutely can send this back to the Senate.  They can quickly strip it and send the bill to the President. They  finished this package in less than 2 days. This is one small thing that  needs to be deleted. It is easy, and it could be…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696693/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…has a very close, very cozy relationship with  China, and there was a very real worry--there still is a real worry-- that that technology, if transferred to the UAE, would be quickly  transferred to China, allowing China to be able to outpace us, to  outrun us in the race to advanced AI.\n\nBut the UAE knew that there was a way to get what they wanted, that…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692362/motion-to-discharge-sj-res-54"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…to have, United Nations, utopian view of the  world.\n\nWell, listen, solar is the most pragmatic thing we can put on the  grid. Solar is really the only thing that is ready quickly. Why?  Because nuclear energy has tremendous potential but is at least an 8-  to 12-year timeframe, so we are talking about the 2030s. Geothermal  also has tremendous potential,…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699020/energy-costs"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…protection from the poison  they are feeding our children. They want free rein, so they are putting  up $100 million in this next election.\n\nI just did the math, sitting at my desk, quickly. The average  individual contribution today is about $25. That is a lot of money for  some people, to give $25 to an election. If every single resident of my  State--every…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699117/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Brad Schneider", "party": "Democrat", "sentence": "…immediately. Jews were       ordered to register with the police, who became close       collaborators with the occupiers. Anti-Jewish laws and acts       of discrimination quickly followed. Jews could not go to       restaurants, to movie theaters, not even parks. They could       not own radios or telephones. They could not be out after       6:00…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690804/rose-helene-spreiregen"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…security. It concluded that China recognizes the immense  military and commercial potential of biotechnology and  biomanufacturing. They have made it a strategic priority and are  quickly starting to ascend to dominance.\n\nTo preserve our lead, we must take swift action to commercialize and  scale biomanufacturing here at home. These new technologies use the…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693686/department-of-defense-appropriations-act-2026"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…House Republicans also claim to care about China,  particularly about beating China in the artificial intelligence race.  That requires getting as much power on to the grid as quickly as  possible, but the big, ugly bill will do the opposite. It will instead  cause electricity capacity to decrease by more than 2\\1/2\\ times the  size of the entire Midwestern…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695693/promoting-cross-border-energy-infrastructure-act"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…unpredictable and  dangerous weather has become. Climate change is fueling more frequent  and extreme weather events, and the Federal Government has a duty to be  ready to respond quickly.\n\nWhat happened in Texas shows we need to strengthen FEMA, not weaken  it. That means making sure the agency is fully staffed and fully  funded. That means answering the phones.…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693988/fema-cuts-and-hurricane-season"}, {"senator": "Joni Ernst", "party": "Republican", "sentence": "…Spirit  Halloween banners begin.\n\nMany of the properties that would be put on the market by my bill are  in prime locations, so potential buyers should be prepared to act  quickly before these once-in-a-lifetime sales vanish like a ghost.\n\nThe real monster this bill is designed to slay, however, is one that  has been lurking around Washington for way…", "date": "2025-10-30", "source_url": "https://justfacts.votesmart.org/public-statement/1696486/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Chuck Fleischmann", "party": "Republican", "sentence": "…also a deep sense of connection and  tradition.\n\nOn April 4, 2025, Hoskins Drug Store will celebrate 95 years of  service. Founded by R.C. Hoskins in 1930, Hoskins Drug Store quickly  became more than just a place to fill prescriptions; it became a  trusted destination where people could count on personalized service,  quality products, and a warm, welcoming…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689423/recognizing-hoskins-drug-stores-95th-anniversary"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…terrorists  gathered a group of fighters and stormed into Israel to join the  barbarism. Less than a year later, he submitted a visa application,  which the Biden administration quickly approved, and he was allowed to  enter the United States.\n\nAfter the October 7 attacks, Director Wray warned us that the FBI  ``cannot, and [does] not, discount the possibility…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697237/no-immigration-benefits-for-hamas-terrorists-act-of-2025"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…agreement, and, in fact, the  House has already passed it. We are going to be considering that bill,  the Energy and Water bill, here in a couple of days. I just wanted to  quickly--I will speak more later, perhaps--I just wanted to quickly  highlight what we are going to be voting on here in the next couple  days.\n\nThe bill is $58 billion. That is less…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699012/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…Inside the  camper were two adults and a child, all unconscious. When faced with an  invisible but deadly threat, Lieutenant Hall entered the camper,  removed the victims, and quickly administered critical first aid.\n\nIn a moment of crisis, Lieutenant Hall was among the first to arrive,  and when faced with danger, he did not pause. Lieutenant Hall's bravery…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692605/recognizing-the-bravery-and-life-saving-response-of-lieutenant-brandon-hall-of-buchanan-county-virginia"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…the report concluded that we don't know if there are  any other unknown biolabs because there is no such monitoring system.  That is why I am calling upon the House to act quickly to pass the bill  that I have introduced, along with Representatives Costa and Valadao,  to find any other such labs that exist across the country and assure  that they are…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699473/illegal-bio-lab-in-las-vegas"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…there is not as big an appetite. We are in  this world where in 9  budget years, it will be $10 billion a day.\n\nI am just going to run through a number of these things fairly  quickly just to sort of get to the point. National health expenditures  as a percentage of GDP, this will make sense in a moment. In 2033--so  functionally, what, 8 years from now--over…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694131/dismantling-californias-citizens-redistricting-commission"}, {"senator": "James Risch", "party": "Republican", "sentence": "…System/Precise       Positioning Service (GPS/PPS) aided inertial guidance       provided by Selective Availability Anti-Spoofing Module       (SAASM) or M-Code. It accurately and quickly delivers a       single high-explosive blast fragmentation warhead to targets       at ranges from 15-70 kilometers. The rockets are fired from a       launch pod container…", "date": "2025-10-02", "source_url": "https://justfacts.votesmart.org/public-statement/1695978/arms-sales-notification"}, {"senator": "Tom Tiffany", "party": "Republican", "sentence": "…supports rural jobs,  strengthens local economies, and improves how we manage our Federal  lands.\n\nI urge my colleagues to support H.R. 3937 today. Again, I hope the  Senate moves quickly to advance this important piece of legislation.\n\nMr. TIFFANY. Mr. Speaker, on that I demand the yeas and nays.\n\nThe yeas and nays were ordered.", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694030/wabeno-economic-development-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…RAP House but also raise community awareness and  engagement with YFA's mission. Despite having no prior experience in  organizing a 5k race, her determination and passion quickly rallied a  team of dedicated volunteers around her dream. From that vision, the  RAP River Run was born. Today, it stands as one of Tampa Bay's premier  running events, drawing…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692476/recognizing-victoria-barley"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…Second, S. 3424 extends for an additional 5-year period numerous  temporary bankruptcy judgeships across the country. These bankruptcy  judges ensure that bankruptcy cases are quickly and efficiently  administered. While bankruptcy filings in recent years have slowed,  early data suggests that bankruptcy filings will likely increase in the  coming years.…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698845/bankruptcy-administration-improvement-act-of-2025"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…without fear. Each one  includes a QR code that links directly to support resources, as well as  a hotline for those without internet access. In under 30 seconds, a  victim can quickly connect to confidential help, shelter options, and  emergency services.\n\nWith the support from the Burleson Police Officers Association and  dedicated community stakeholders,…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693641/congratulating-aledo-bearcats"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…Anaheim, California, Aybrah placed sixth in public speaking  and Elena placed seventh in career exploration.\n\nWest Shamokin's FBLA chapter, founded in the fall of 2023, has  quickly made a name for itself and has proven that a small, rural  school can leave a big mark on the national stage.\n\nMr. Speaker, I applaud both Aybrah and Elena and the entire…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693666/recognizing-aybrah-zelenski-and-elena-gourley"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…Patriot Award.  He has served and uplifted our community through his leadership and  dedication.\n\nTom was born and raised in Yonkers, New York. Due to life hardships,  he was quickly educated in the meaning of mortgage payment and food on  the table. He attended Manhattan College, graduating in 1972 with a  BSBA in Accounting and his CPA designation, which…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695482/recognizing-congressional-patriot-award-recipient-thomas-mccall"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…mistake there by defending somebody  when you had no idea, actually, what he did.\n\nI  object because we did it in coordination with the Democrats.\n\nThe House? The House did it quickly. There are provisions in this  bill from the House that his amendment would strip out--the  notification requirement. Every Member should want to be notified if  anybody in…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699105/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}]