[{"senator": "Bill Keating", "party": "Democrat", "sentence": "…today in honor of Kathy Quigley as  she retires from the South Shore YMCA. Kathy is a true community  leader, who has tirelessly advocated for disadvantaged communities in  Quincy and the South Shore throughout her remarkable 30-year career.  Whether during her time with the South Shore YMCA, Quincy Community  Action, or DOVE, she has dedicated her career…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689332/recognizing-kathy-quigley"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…prominent location for the eventual memorial  to commemorate the legacy and contributions of John Adams and the  entire Adams family, including Abigail and their son, John Quincy  Adams.\n\nIt has been nearly a quarter-century since Congress first authorized  this memorial in 2001. It is time to finish what we started.\n\nWe are speaking of a family that…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697632/adams-memorial-great-american-heroes-act"}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "…extend until 2032 the  existing authorization to build the Adams Memorial in the President's  Park, dedicated to the contributions to our Nation by John and Abigail  Adams, John Quincy and Louisa Catherine Adams, Charles Francis Adams  and Henry Adams and their family.\n\nThe exciting part of this is that while efforts have been made in the  past, we have finally…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697631/adams-memorial-great-american-heroes-act"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…(posthumously), McLean Central Park Playground       Team, Pohanka Automotive, and the Scott A. & Phyllis P.       Crabtree Family Foundation.\n\nChairman's Choice Award: Ken Quincy and Aimee Vosper.\n\nMr. Speaker, I ask my colleagues to join me in congratulating this  year's awardees. Fairfax County is regarded as one of the best places  in the country…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696038/recognizing-the-2025-elly-doyle-park-service-awardees"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…Baltimore Police Department: The       `Use of Force Pyramid' says tasers are a Level 5 of 6 (6       being ``deadly force'').                                MASSACHUSETTS\n\nQuincy Police Department\n\nChelmsford Police Department\n\nNewton Police Department\n\nBoston Police Department                                   MICHIGAN\n\nDearborn Police Department…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700033/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "Mr. McGOVERN. Mr. Speaker, last Friday, with my friend Congressman  Steve Lynch, I visited Quincy Community Action Programs in Quincy,  Massachusetts, as part of my Statewide End Hunger Now tour.\n\nWe kicked off our visit with QCAP CEO Beth Ann Strollo and some of  the young…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699212/end-hunger-now-visit-to-quincy-community-action-programs"}, {"senator": "John Moolenaar", "party": "Republican", "sentence": "…valued and trusted  adviser. They were the first family to occupy the newly constructed  White House, which this monument will be immediately adjacent to.\n\nTheir son, John Quincy Adams, was America's sixth President, and so  dedicated to this country that following his administration, he  returned to the Halls of this very building to continue his service…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697630/adams-memorial-great-american-heroes-act"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…lost 100  seats because prices went up with tariffs.\n\nHas this ever happened before? Yes. It happened in the 1840s when  they put on the ``Tariff of Abominations'' under John Quincy Adams. He  signed it. Once again, the ruling party lost seats.\n\nWhen is the last time this happened in dramatic fashion? Well, if you  study history and you want to know when…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689478/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…shared principles.\n\nAbigail Adams was an early advocate for women's rights and shaped the  second Presidency through her letters and advice to her husband. Their  son, John Quincy Adams, served as our sixth President and later was a  fierce opponent of slavery in this very body, as the only former  President to be elected to the House of Representatives.…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697633/adams-memorial-great-american-heroes-act"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Jeremy: NEWSMAX TV;       Tserenbaljid, Uyanga: ZDF GERMAN TELEVISION; Tsirkin, Julia:       NBC NEWS; Tucker, Amber: FOX NEWS; Tucker, Caroline: WRC-TV/      NBC-4; Tucker, II., Quincy: NEXSTAR MEDIA GROUP.\n\nTucker, William: WASHINGTONPOST.COM; Tufarolo, Robert:       HEARST TELEVISION INC; Tukker, Simone: DUTCH TV & RADIO       (NOS); Tuncer, Betul: CNN;…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698150/members-entitled-to-admission-to-the-119th-congress-radio-and-television-correspondents-gallery"}]