[{"senator": "Gwen Moore", "party": "Democrat", "sentence": "…navigate her way  into the workforce to get job training, to have cash assistance until  she can get on her feet, not to provide moneys to stand up this  ideological and, quite frankly, religious organization.\n\nThat is why I oppose this bill. Mr. Speaker, I am going to later on  offer an amendment that would allow States to use TANF dollars, again,  not…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699222/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…just say this. My colleagues across the aisle can't have it  both ways. Again, I hope that the Republican control of this House and  of this Senate is short-lived because, quite frankly, this country  cannot stand another 2 years of this, where if a person is rich and  well-connected and a friend of the President, they get all kinds of  sweetheart deals.…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699593/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…have respect for the reporter, but I know what is  happening at CNN and how CNN has become a status quo news source. To  maintain the status quo, CNN will do things that, quite frankly, don't  allow us to make the change necessary to benefit all Americans.\n\nThis reporter mentioned these two words, ``fascism'' and ``racism,''  as incitive terms. Interesting…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695338/dark-days"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…discussion. This is not even a Black Caucus  or other caucus discussion. This is about what is at risk, who is at  danger, who is being put at risk by this administration and, quite  frankly, by the silence coming from this House majority.\n\nTonight and later on this week, Ag, Energy and Commerce, and the Ways  and Means Committees are meeting, and they have…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691088/big-backstabbing-bill"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…sacrifice, and patriotism have moved our country and world  forward.\n\nSince our Nation's founding, our military has relied on Black  Americans to answer the call to serve. Quite frankly, it occurred prior  to our founding. From the Revolutionary War and Crispus Attucks to  Harriet Tubman, spy, scout, nurse, and cook for the Union Army during  the Civil…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699863/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…policies that protect Jewish students, like fully  funding the Education Department's Office for Civil Rights to fund  investigations and hold colleges and universities--and, quite frankly,  schools across the country and secondary schools--tolerating anti- Semitism accountable, we can support all students' ability to live and  study in places that value…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691194/calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism-and-educate-the-public-on-the-contributions-of-the-jewish-american-community"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…interests while regular  families are getting screwed. They have shoveled subsidies and  giveaways to greedy CEOs while  families struggle to pay for groceries and rent.\n\nQuite frankly, we don't share the same values. Democrats want a very  different government. We want a government that stands up to corporate  greed, a government that uplifts workers,…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697303/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…a cane. Yet, that is simply what it is, Mr. Speaker.\n\nI rise with my cane in hand because it is the staff and rod that  comforts me. I rise with my cane in hand because, quite frankly, I just  believe I have the right to have a cane.\n\nMr. Speaker, I rise today to speak on several different topics. As a  result, I will move from one podium to another…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690560/a-message-to-the-cabinet"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…Speaker, I continue to say that it is the lifeblood of our  government. Those of us who serve on the Appropriations Committee know  that. I will be bold in saying that, quite frankly, if they left these  things to us, we would get them done. In this regard, we have. We are  through six bills. We have six more to go. We are going to get this  done, and…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698760/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…You have heard my colleague already speak, and I concur with his  remarks. Simply put, it has been chaotic; it has been disorganized; it  has been an unmitigated disaster. Quite frankly--and I know that I am  not alone in this--we are absolutely sick of it.\n\nThis President and this administration rode in with promises of  reducing costs for American families--families…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690300/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…say so, I think the American public will  have the final word and will be the final judge.\n\nI am honored to tell you who the players are in this coverup. One  person is, quite frankly, a person who merits a lot of accolades. He is  a person who ought to be acknowledged for the courage that he has  demonstrated. He is a person who brought this to the…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689201/and-still-i-rise-censured-but-not-silenced"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…majority listened to Donald Trump and closed their eyes and just  voted for it without reading it, without a CBO analysis. Whatever Trump  wants, Trump gets.\n\nMr. Speaker, quite frankly, it is embarrassing. It is embarrassing  for this institution, and it is embarrassing for our country. It is  making a mockery of this House of Representatives. Republicans…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691944/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…constituents, not only how much it  will cost, but how many people will lose their healthcare and how  quickly they will lose their healthcare.\n\nThose are legitimate questions that, quite frankly, Democrats not  only want to know but Republicans should want to know, as well.\n\nCan I get the gentleman to kind of give us some assurances that we  know the impact? Will…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691512/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…will break loose.\n\nWell, that seems to indicate that he is willing to see an  infiltration unlike we have not seen so far, something more than we  have seen so far because, quite frankly, Gaza has been decimated. The  roads have been destroyed. The bridges have been destroyed. The schools  have been destroyed. The hospitals have been destroyed. The homes…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688271/impact-of-president-on-peace-process"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…is not the case. And it is certainly not  California's agenda to impose our standards on States across the  country. We are simply seeking to protect Californians.\n\nAnd, quite frankly, if Members of this body representing the other 49  States in the Nation are worried about some Federal mandate taking  effect  because of California's actions, then you…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691583/hj-res-88"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…they may say,  but to expand their influence inside the United States for malign  purposes. This legislation would put an end to this egregious national  security threat. Quite frankly, it is well overdue.\n\nMr. Speaker, I urge my colleagues on both sides of the aisle to come  together, to stand firm for our American education system, and to vote  ``yes''…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690828/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…Foundation, Independent Women's Forum, Students for  Life Action, the Family Policy Alliance, and the Faith and Liberty in  the Nation's Capital organization all were present.\n\nI, quite frankly, since I have been here, haven't seen such a  groundswell of so many conservative nonprofit groups to come together  to address such a problem. Yet, this isn't surprising.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699038/reshaping-the-american-family"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…the  right direction.\n\nLet me be clear, Mr. Speaker. The Federal Government should not  reward sanctuary cities with permanent SBA infrastructure. That is not  just wrong, quite frankly, it is insulting to every law-abiding  taxpayer and every small business owner struggling to stay afloat.  These offices have got to be moved.\n\nThis legislation is another…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692100/save-sba-from-sanctuary-cities-act-of-2025"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…from his example.\n\nAt the start of the 118th Congress, the Committee on House  Administration turned to Derek to Lead the newly constituted  Subcommittee on Modernization. Quite frankly, there was no one better  suited for this position than Derek. His institutional expertise, his  proven leadership skills, and his unwavering dedication to the House  and…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696851/thanking-derek-harley-for-his-service-to-the-house"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…of rules.\n\nThe Biden administration sat on that request. They didn't move on it.  They have gotten their opinion worked out with GAO in 2023, but they  didn't move on it, quite frankly, because the American people hate  mandates. We don't  like them at all. We like choice. We like to make our own decisions. I  would dare say, everybody in this room uses…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691634/congressional-review-act"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "Mr. WEBER of Texas. Madam Speaker, I thank the gentleman for  yielding.\n\nMadam Speaker, quite frankly, I can't even believe that our friends  across the aisle are complaining. I guess that seems to be their habit,  their modus operandi these days.\n\nMadam Speaker, House…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690481/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…now, this moment, this is a watershed victory  for this country. Today we do something real.\n\nMr. Speaker, I thank the gentleman from South Dakota for his remarks  and, quite frankly, I couldn't agree more. I also thank, again, my  Agriculture partner, Ranking Member Angie Craig with the Agriculture  Committee, and Don Davis and our leadership and all…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693788/digital-asset-market-clarity-act-of-2025"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…of  staff for a previous member of the same district.\n\nLast month, Ben announced that he had been diagnosed with stage IV  pancreatic cancer. This news stunned me, and, quite frankly, it stunned  the world.\n\nEver since Ben has stepped back from public life following his time  in the Senate and at the University of Florida, his intellect and voice  have…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698932/recognizing-mayor-david-black"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…of power generation that is absolutely essential  to keeping our grid reliable.\n\nThe Reliable Power Act, Mr. Speaker, is about safety. It is about  security. It is also, quite frankly, about affordability. There is  nothing more expensive, Mr. Speaker, than a blackout, a rolling  blackout. I know.\n\nThere is nothing more costly than green visions that…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698274/reliable-power-act"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…and innovation has allowed us to reduce emissions more than any other  country since 2005. That is important.\n\nMr. WEBER of Texas. Mr. Speaker, this is amazing to me, quite  frankly. I served 4 years in the Texas legislature, and we were busy  with catalytic scrubbers on all the industry that we had  making sure that Texans had clean energy. We care…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691596/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act"}, {"senator": "Darrell Issa", "party": "Republican", "sentence": "…not having future  Presidents find themselves deterred from executing what they believe is  best in a timely fashion, that we come together and vote this moderate  and, quite frankly, modest piece of legislation. It won't stop all  national injunctions, but it will define more narrowly when they can be  done. I hope we would do that.\n\nI will close simply…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689711/no-rogue-rulings-act-of-2025"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…Beautiful Bill Act, and we join forces like Ronald Reagan  did with Tip O'Neill, which was the last time that Social Security and  the solvency were addressed, I think, quite frankly, it is an  opportunity made for President Trump. He is the greatest dealmaker we  have ever had in the Oval Office.\n\nWhen I was a freshman and he was recently elected,…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691961/supporting-the-big-beautiful-bill"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…their cooperation.\n\nIf you listened to the debate, you would think we have law  enforcement in chaos and that somehow our country is not secure. Quite  the opposite is true. Quite frankly, President Trump  should be commended for what he and his administration have  accomplished in a matter of weeks and months that most of us thought  would take years.…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699354/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…doors.\n\nThere is another provision that they are going to use the IRS code  in--which concerns me a little because there are rumors that this may  be out there as well. Quite frankly, I have a suggestion how we could  cut taxes and put ourselves in a stronger position.\n\nRight now there is a provision in the tax code called low-income  housing tax credits,…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690921/big-beautiful-bill"}, {"senator": "Mark Amodei", "party": "Republican", "sentence": "…subcommittee Ranking Member Cuellar, a  real pro. We don't agree all the time, but it is like it has never been  a disagreeable experience. There are days around this outfit when,  quite frankly, that isn't the case. I thank my friend. I appreciate  that. He has been a great partner.\n\nFinally, I will take the time to thank the committee staff on both  sides of…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699349/department-of-homeland-security-appropriations-act-2026"}]