[{"senator": "Peter Welch", "party": "Democrat", "sentence": "…our States have been affected at  one time or another.\n\nNow, I want to talk about FEMA. Our experience in Vermont with FEMA  is that it is absolutely essential and actually quite helpful in the  immediate aftermath of the weather event.\n\nFEMA can preposition resources. It has the capacity to surge  resources and personnel, including people with real…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693402/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…these efforts, not giving it a blank check to  disregard environmental laws whenever it claims national security.\n\nIn Hawaii, where trust around military land use is damaged, quite  frankly, and lease negotiations are ongoing, accountability is not  optional. A back-door taking of our lands is 100 percent unacceptable.\n\nAllowing this amendment to pass…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695235/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…the United States  Capitol.\n\nAs my colleague and friend, the sponsor of this bill, along with  Representatives Brian Fitzpatrick and Chrissy Houlahan have observed-- and I am quite certain will observe once again in just a few moments-- while there are references to Benjamin Franklin across the Capitol and  a statue tucked away in a back hallway, it is…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688219/procurement-and-placement-of-statue-of-benjamin-franklin-in-the-united-states-capitol"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…such as the challenges that Representative  Stansbury and so many others described so eloquently.\n\nMr. Speaker, there has been a lot of discussion about townhalls. I  don't quite understand, and perhaps the gentlewoman would be willing to  expound upon her opposition and the opposition of so many of my  colleagues in the Republican Conference to doing…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689052/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers-providing-for-consideration-of-hr-defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…by 12 percent when we hit the mid-21st century  mark.\n\nWe here in the United States of America are building roads, bridges,  factories, schools, so many things. It is really quite exciting, and  the IMPACT Act can play a role. The bill will improve cost- effectiveness, durability, and material demand efficiency of widely  used cement, and similar materials…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688940/innovative-mitigation-partnerships-for-asphalt-and-concrete-technologies-act"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…Speaker, I am not going to get into these back-and-forths. I have  been waiting for an answer because this is serious business. The  American people want an answer that they can't quite get yet. I can't  get anybody at a hearing from the administration to answer the  question. I can't even get anybody from the administration, when I saw  some yesterday, to…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698456/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…NIH scientists and healthcare professionals, 2,000 researchers. Is one  of those researchers working on a cure for a disease that will affect  someone in your family? It is quite possible.\n\nOn Friday, the President released a preview of his budget, which  proposes to slash NIH's medical research budget nearly in half, wiping  out all the gains we have…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690656/national-institutes-of-health"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…Commerce to license and regulate  private-sector parties to operate commercial remote sensing space  systems. Since that time, the commercial remote sensing industry has  changed quite dramatically.\n\nToday, companies from across the world are launching commercial  remote sensing systems and selling the data. We must ensure that the  United States remains…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688973/commercial-remote-sensing-amendment-act-of-2025"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…that is not the case. And it is certainly not  California's agenda to impose our standards on States across the  country. We are simply seeking to protect Californians.\n\nAnd, quite frankly, if Members of this body representing the other 49  States in the Nation are worried about some Federal mandate taking  effect  because of California's actions, then…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691583/hj-res-88"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…yield myself 1 minute.\n\nThis amendment would be very destructive to achieving peace in  Ukraine. I agree with the gentlewoman; that should be the goal.\n\nWhat has been clear for quite some time is that Putin will only stop  his war when it is clear that he cannot achieve his objectives in  Ukraine.\n\nPresident Trump showing weakness on that issue, literally…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695253/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…a few moments whether or not we have pushed through the biggest cut to  Medicare in American history.\n\nThe kids who rely on SNAP, the nutrition assistance program, may not  quite understand it, but make no mistake about it: What we are about to  do in the next few minutes here will have a profound effect on their  lives, not to mention the millions…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693195/one-big-beautiful-bill-act"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…they are in my community, is just plain  insulting.\n\nTo be clear, I know the importance of the rubber industry to my  community. It is the reason why I stand here today. It is, quite  literally, why I get the opportunity to stand here today. I appreciate  rubber workers in Akron who helped make our city the rubber capital and  revolutionized the way in…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688529/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "Mr. COHEN. Mr. Speaker, I got on this bill when it was first  introduced, I think, last spring. Representative Roy and I have served  on the Judiciary Committee for quite a while, and I respect his  intellect. I certainly hope that he gets to be Attorney General of  Texas. That would be great for him, and I think it would be great for  Texas,…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697207/count-the-crimes-to-cut-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…you look on the website for the National Coal Council, it says  that all of this is coming soon: members, meetings, or whatever. That  is like the neighborhood coffee shop not quite ready to open to  visitors. They put up a ``coming soon'' sign.\n\nThe reality is that all of this is a charade. Republicans can try to  sell to donors that they are rescuing…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695765/national-coal-council-reestablishment-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…understanding and respect for the direction  provided through the Appropriations process.\n\nThe Power of the Purse rests with the Article I branch here in  Congress. That is established quite clearly in the Constitution, and it  has been repeatedly affirmed by the Supreme Court.\n\nWe set policy, we provide direction, and we allocate funds. Then,  based on those policies,…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693088/introduction-of-the-appropriations-compliance-and-training-act"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…whack-a-mole in Washington, D.C., because  bureaucrats create problems and then solve them like they have done  something meritorious for the country. It is total BS.\n\nThis bill is quite simple: It restores the definition of a showerhead  to what Congress originally intended in 1975. It was a law for 32 years  before the problem was created by the Obama administration.…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698562/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…that what we are trying to do  is let them do whatever they want to do. That is actually not at all  the case. The merger review process is a very involved process. There  is quite a bit of  scrutiny that goes into approving these mergers. In fact, what we want  to do here with the resolution disapproving of this is to actually  force the agencies to…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691498/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…political  pressure.\n\nLet me state clearly, Mr. Speaker, and with no equivocation, the  Chinese Communist Party's obligation under the 1979 Taiwan Relations  Act, which sets out quite clearly that China cannot use military force  or coercion, boycotts or embargoes to compel Taiwan to capitulate to  the Communists and become One China.\n\nThe PROTECT Taiwan…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699846/pressure-regulatory-organizations-to-end-chinese-threats-to-taiwan-act"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…in the realm of  communications. To pierce into an actual congressional hearing, for a  Member of Congress to receive and respond to a text message during a  hearing, that is quite familiar, is it not?\n\nThis was shocking to me that a Member of Congress would be exchanging  text messages directly with Jeffrey Epstein in 2019, at which time he  was being…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696892/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…in this country. Yet, they  are opposed to it.\n\nMr. Speaker, we have heard a little bit about fiscal responsibility.  That is something that Republicans have championed for quite some time.  In fact, it has been pointed out that our ideas are old. I would point  out that my colleague is right. Our ideas are old in the sense that  individual liberty…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699678/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Randy Feenstra", "party": "Republican", "sentence": "…the IRS and a more accountable government.\n\nThis bill itself is a recommendation from the National Taxpayer  Advocate Purple Book and has been a recommended policy change for quite  a few years.\n\nMr. Speaker, I thank Chairman Smith, again, for working with me to  make the IRS run smoother and to ensure taxpayers are being treated  fairly.\n\nMr. Speaker,…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689379/national-taxpayer-advocate-enhancement-act-of-2025"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…sure that our parole  authority is properly done, ending catch and release, and re- implementing the remain in Mexico policy. I think this gets missed from  the conversation quite a bit. It is actually some of the most humane  things we can do.\n\nI still remember the 30-plus immigrants who were basically killed in  the back of that truck in the San Antonio…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690427/the-first-100-days"}, {"senator": "Byron Donalds", "party": "Republican", "sentence": "…bill,  H.R. 4922, the DC CRIMES Act.\n\nNow, in reference to what the gentleman was just talking about,  Article I, Section 8, Clause 17 of the United States Constitution is  quite clear. It grants Congress the power to exercise exclusive,  exclusive jurisdiction over the Federal District, which all Americans  know now is Washington, D.C., and it is the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695561/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…use to pay their car note, their flood insurance note,  their grocery bill--you name it--rent for their apartment, and,  instead, it is going to insurance companies.\n\nI don't quite know why my Democratic colleagues are so entrenched in  protecting a broken system. They are willing to raise premiums by 5  percent to protect the status quo.\n\nAll that said,…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698998/disrupt-explicit-forged-images-and-non-consensual-edits-act-of-2025"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…make this stuff  up--that the 2.5-gallon-per-minute standard applied to the entire  shower system instead of just each individual showerhead. You can't  make this stuff up. Quite frankly, I think they were all wet. The  result was weaker water pressure and daily frustration for homeowners,  all in the name of government control.\n\nFor a year now, this…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698565/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…including children,  infants, and the elderly because they were Jewish?\n\nMr. McCLINTOCK. First of all, I am not familiar with the case, so I  can't comment on that directly. I am quite confident that we have an  existing process for applying the law and a process for appealing the  application of that law through a writ of habeas corpus in the  judiciary…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697237/no-immigration-benefits-for-hamas-terrorists-act-of-2025"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…you are doing your job and you have a contract, I  think you ought to be paid.\n\nSo I don't think it is clear that the President wouldn't support  this. I think it is actually quite confusing that this is being  objected to by the Democrats, and I think, actually, it would be nice  to let the Democrats, you know, have a round at this and explain to us…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696562/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…She actually changed lives.  Joanne treated every constituent with dignity, persistence, and care,  and she never gave up on someone who needed help.\n\nThere is truly no one quite like Joanne Horn. Our office, district,  and Commonwealth are better because of her service, and we are deeply  grateful as she begins this next chapter.                 Celebrating…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698569/recognizing-and-thanking-joanne-horn"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…staff. I share my  friend's pride in their efforts and gratitude for their success.\n\nMr. Chair, I urge the passage of H.R. 7006. I will also remind  everyone that it is not quite done. We have a lot to do in the next few  days ahead of us, but this helps set the precedent, helps move the  process along, and gives us a much better chance of success as…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699054/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…against a foreign power, it has, in fact, declared war by giving that  power casus belli. He said that reacting to a military attack is one  thing, but initiating an attack is quite another.\n\nPersonally, I think he had a point. I disagree with the current  precedents, although I find it hard to fault the President from acting  within them.\n\nRestoring the…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698660/lessons-from-caracas"}]