[{"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…to start by being clear about what is going on here.  Donald Trump promised to gut our environmental laws if Big Oil CEOs  gave him a billion dollars for his campaign. He was quite open about  this. How could he do that? Well, he has figured it out. He declared an  emergency that he has focused on that emergency will give him a chance  to pay those oil…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688155/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…special interests while regular  families are getting screwed. They have shoveled subsidies and  giveaways to greedy CEOs while  families struggle to pay for groceries and rent.\n\nQuite frankly, we don't share the same values. Democrats want a very  different government. We want a government that stands up to corporate  greed, a government that uplifts workers,…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697303/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…me just say this. My colleagues across the aisle can't have it  both ways. Again, I hope that the Republican control of this House and  of this Senate is short-lived because, quite frankly, this country  cannot stand another 2 years of this, where if a person is rich and  well-connected and a friend of the President, they get all kinds of  sweetheart…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699593/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…30 years. This is a  phenomenal, phenomenal number.\n\nAnd, third, they say: We will tell the American people it adds no new  debt; passing this bill adds no new debt.\n\nThat is quite a set of plans: slash programs for regular Americans,  enrich the richest Americans, run up an additional $37 trillion in  debt, and then lie to the American people and say…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689508/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…the Mathematical and Statistical Modeling  Education Act, otherwise known as H.R. 730.\n\nWe have here in the House Chamber gallery an audience of about 75  people. It is really quite amazing to have the outside public in the  Hall of the House of Representatives watch this debate today, because  if you are interested in government, maybe sometimes you are…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688978/mathematical-and-statistical-modeling-education-act"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…inspectors  general. Meanwhile, it has been crickets from Republicans. They are  just happy to let him do it.\n\nNo nominee has exemplified the assault on independent oversight quite  like March Bell, the nominee to serve as Health and Human Services  inspector general.\n\nI would be remiss if I didn't start off by noting that he is  nominated to fill a position…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697900/9999"}, {"senator": "Thomas Suozzi", "party": "Democrat", "sentence": "…local level. Since America's founding, government was mainly paid for  at the State and local level through State and local taxes. The Federal  Government was funded by tariffs, quite frankly, a very interesting  topic for today.\n\nWhen the mayors and Governors protested, they said: We don't want to  have a Federal income tax because you are going to hurt…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690627/republican-tax-cuts"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…Dan Kildee of Flint was our dean then, and we rallied to  show our love and our support. Tragically, we lost Mr. Dingell on an  early February day.\n\nMr. Speaker, it was really quite surreal to be in this very Chamber  in my first couple of weeks, in this Congress and in the House of  Representatives, paying tribute not only to a Michigan legend but an…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689752/reflecting-on-americas-history"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…than a cane. Yet, that is simply what it is, Mr. Speaker.\n\nI rise with my cane in hand because it is the staff and rod that  comforts me. I rise with my cane in hand because, quite frankly, I just  believe I have the right to have a cane.\n\nMr. Speaker, I rise today to speak on several different topics. As a  result, I will move from one podium to another…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690560/a-message-to-the-cabinet"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…greater, but the American people deserve the truth. And the truth is  that over the past year, we have not moved closer to forming a more  perfect Union. Tragically, it is quite the opposite. Our disunion has  only grown.\n\nOur Founders understood something when they chose the words ``a more  perfect Union.'' They didn't contemplate achieving perfection.…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700183/state-of-the-union-address"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…medical professional who might be  able to save your life. By the grace of God, by the love of my family,  Senator Merkley, I am here. I am alive today. I healed, and it is quite  miraculous, but a big part of that was because I was fortunate enough  to have health insurance. I was fortunate to get to a facility quickly  enough. On the way there, a…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696347/trump-administration"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…they are in my community, is just plain  insulting.\n\nTo be clear, I know the importance of the rubber industry to my  community. It is the reason why I stand here today. It is, quite  literally, why I get the opportunity to stand here today. I appreciate  rubber workers in Akron who helped make our city the rubber capital and  revolutionized the way in…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688529/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…arbitrariness of their implementation and the arbitrariness of how and  who is affected. We have a situation where we supposedly have these  tariffs on China. Apple Computer, quite understandably, was upset. It  was going to increase the cost of iPhones. Well, no problem. Tim Cook  was at the inauguration, sitting on the throne of honor, and he had the…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690522/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…January 30.\n\nNow, if we do not come to an agreement, there are two options. The  first option is a continuing resolution, which we can all conclude is  no way to run a government. Quite frankly, for me personally, I don't  want to turn over the power of the Appropriations Committee to any  executive, Democratic or Republican. I believe that the power of the…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699057/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Laura Gillen", "party": "Democrat", "sentence": "…Fourth Congressional District, I take this  opportunity to commend and celebrate these young athletes for their  dedication, for their teamwork, for their perseverance, and, quite  frankly, their dominance on the basketball court.\n\nThis year's championship marks Baldwin's third State title in school  history, a testament to the strong foundation built…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689286/congratulating-baldwin-high-school-girls-basketball-team"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…because, of course, there  haven't been any passengers, despite spending $17 million over 17  years. There has been no track laid.\n\nNevertheless, the Governor recently, with quite a bit of hoopla, held  an event in Kern County to celebrate the fact that a single railhead  has now been completed. The Governor that crowed they are now entering  the track-laying…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700217/prices-in-california-are-too-high"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…there is a case of Trump derangement syndrome, I think it has spread  throughout the building.\n\nI didn't riot. I didn't give cover to the idea that the election was  stolen--quite the opposite. What was my big offense? Being a friend of  Trump's.\n\nWhat are you trying to do here? Do the right thing? The right thing  is to continue to investigate Jack…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699105/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…closed doors.\n\nThere is another provision that they are going to use the IRS code  in--which concerns me a little because there are rumors that this may  be out there as well. Quite frankly, I have a suggestion how we could  cut taxes and put ourselves in a stronger position.\n\nRight now there is a provision in the tax code called low-income  housing tax…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690921/big-beautiful-bill"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…in this country. Yet, they  are opposed to it.\n\nMr. Speaker, we have heard a little bit about fiscal responsibility.  That is something that Republicans have championed for quite some time.  In fact, it has been pointed out that our ideas are old. I would point  out that my colleague is right. Our ideas are old in the sense that  individual liberty…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699678/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Colleague letters, bulletins,  all manner of what is referred to as ``regulatory dark matter.''\n\nWith respect to the ranking member, this is not a melodramatic term.  It is actually quite appropriate. In physics, ``dark matter'' refers to  the mysterious substance that makes up about 85 percent of the mass of  the universe, but no one really knows what it is.…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688392/guidance-out-of-darkness-act"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…that what we are trying to do  is let them do whatever they want to do. That is actually not at all  the case. The merger review process is a very involved process. There  is quite a bit of  scrutiny that goes into approving these mergers. In fact, what we want  to do here with the resolution disapproving of this is to actually  force the agencies to…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691498/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…vassal and Iran's favorite corridor of weapons and  terrorist finance.\n\nThese are the circumstances President Trump inherited. What to do  with them has been the subject of quite some debate. Some of his  advisers and supporters came with Obama-Biden-era talking points, ready  to urge him to continue his predecessor's policy of constraining  Israel.…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692870/9999"}, {"senator": "Byron Donalds", "party": "Republican", "sentence": "…bill,  H.R. 4922, the DC CRIMES Act.\n\nNow, in reference to what the gentleman was just talking about,  Article I, Section 8, Clause 17 of the United States Constitution is  quite clear. It grants Congress the power to exercise exclusive,  exclusive jurisdiction over the Federal District, which all Americans  know now is Washington, D.C., and it is the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695561/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "Mr. MOORE of Utah. Mr. Speaker, again, it has been quite a week for  the House Republicans with the long and late committee hearings as we  move forward on our reconciliation package and deliver substantial wins  for the American…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691166/events-this-week"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…in the realm of  communications. To pierce into an actual congressional hearing, for a  Member of Congress to receive and respond to a text message during a  hearing, that is quite familiar, is it not?\n\nThis was shocking to me that a Member of Congress would be exchanging  text messages directly with Jeffrey Epstein in 2019, at which time he  was being…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696892/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…use to pay their car note, their flood insurance note,  their grocery bill--you name it--rent for their apartment, and,  instead, it is going to insurance companies.\n\nI don't quite know why my Democratic colleagues are so entrenched in  protecting a broken system. They are willing to raise premiums by 5  percent to protect the status quo.\n\nAll that said,…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698998/disrupt-explicit-forged-images-and-non-consensual-edits-act-of-2025"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…set of rules.\n\nThe Biden administration sat on that request. They didn't move on it.  They have gotten their opinion worked out with GAO in 2023, but they  didn't move on it, quite frankly, because the American people hate  mandates. We don't  like them at all. We like choice. We like to make our own decisions. I  would dare say, everybody in this room…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691634/congressional-review-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "…Mr. THUNE. Mr. President, I would ask unanimous consent that the  remaining rollcall votes be 10 minutes in length.\n\nMr. THUNE. Mr. President, this has been a very long road--quite  literally, the longest shutdown in history. I am very, very happy to be  able to say that we are coming to the end.\n\nBefore we close today, I want to take the time to say…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696667/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…attorney-- in some jurisdiction here, all of a sudden, to play with fire. They  didn't know what they were doing. They didn't look through the second-  and third-order effects, and, quite honestly, they exposed the  President in the process.\n\nI find myself in a position where I want to reaffirm what I said very  directly on that Sunday night before the markets…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700062/9999"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…about their  professionalism and their cooperation.\n\nIf you listened to the debate, you would think we have law  enforcement in chaos and that somehow our country is not secure. Quite  the opposite is true. Quite frankly, President Trump  should be commended for what he and his administration have  accomplished in a matter of weeks and months that most of…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699354/department-of-homeland-security-appropriations-act-2026"}]