[{"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…like MS-13 or Tren de Aragua. It is not doing  anything about the smugglers and human traffickers at the border.\n\nInstead, ICE agents are scrambling to meet Stephen Miller's quotas by  arresting people at work or when they attend court hearings on their  legal cases for asylum or citizenship, as they are required to do, and  the hell with the impact on…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695109/providing-for-consideration-of-hr-streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-and-providing-for-consideration-of-hr-stop-illegal-entry-act-of-2025"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…from his home and detained in violation of his  basic human and constitutional rights is part of an ill-conceived and  incompetently implemented policy of daily deportation quotas that is  not just incompetent but inhumane.\n\nThis year, 3,800 children have been abducted across the country and  detained. It is shameful and an embarrassment to our country.…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699491/children-are-not-political-pawns"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…extraordinary and temporary conditions that prevent safe       return. The program is designed to be responsive to facts on       the ground, not to operate on arbitrary timelines, quotas,       and motives that ignore documented country conditions. The       Haitian community has been granted TPS because Haiti has       faced continuous, documented instability…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699630/constituent-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…be a  ``withdrawal'' of 700 personnel--agents, whatever they have as their  title--from Minneapolis. And numbers are important. Part of the reason  for the brutality is the quotas that have been implemented and  exacted--quotas for arrests and detention. Those quotas haven't  changed.\n\nThe numbers of agents in Minneapolis may be reduced, but the  tactics--the…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699650/9999"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…rounded up a lot of people and  deported them. I know because I had constituents who complained about  that.\n\nBut the Obama administration didn't go out and just try to make  quotas on people. The Obama administration didn't go out there and say,  We are not going after the violent people; we are just going to go  after anybody to make up the numbers.…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699419/9999"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…and should look to staff the Board of Veterans' Appeals with  attorneys that have demonstrated expertise in this area, attorneys who  are experienced and who can see beyond quotas and metrics to apply the  law to the maximum benefit of veterans at the heart of the process.\n\nSo, Madam Speaker, I strongly support H.R. 659 and urge my colleagues  to do…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699208/veterans-law-judge-experience-act-of-2025"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…because his  parents were undocumented.\n\nTrump's actions tell us that no one is safe from his storm troopers.  How ICE agents are going about fulfilling Trump's arbitrary arrest  quotas is also alarming.\n\nMasked, plainclothes officers have been entering communities and  abducting people to process them for deportation. This is extremely  dangerous for several…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692932/holding-power-accountable"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…because of the color of  their skin or the jobs that they hold, they are not going after  criminals. They are clearly using racial profiling to meet the  arbitrary detention quotas they have been given.\n\nThe Congressional Hispanic Caucus and the Congressional Progressive  Caucus are standing up for the people. We are calling for transparency,  tracking…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697451/fighting-dhs-immigration-raids"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "…with every single day. ICE is terrorizing our communities. They  are kidnapping people off of the streets, tearing families apart,  and destroying futures to meet insane daily quotas enacted by Donald  Trump.\n\nJust a few weeks ago, Republicans in Congress passed a massive budget  that funnels billions of new dollars to ICE. This money makes ICE the  largest…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694186/pushing-back-against-ices-authoritarian-overreach"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "…chaos  at the Department of Homeland Security. Instead of targeting hardened  criminals, DHS is arresting hardworking people off our streets to meet  arbitrary deportation quotas.\n\nFaith leaders in my district tell me constituents are avoiding  church, keeping kids home from school, and skipping medical care,  terrified of being profiled based on the…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699702/chaos-at-department-of-homeland-security"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…cars are sowing fear. We cannot  allow this to continue. Make no mistake, this is all on President  Trump.\n\nThe President has instructed ICE to meet arbitrary deportation  quotas. Their aggressive and baseless target number of 3,000 daily  arrests does not require them to focus on violent offenders and  criminals.\n\nInstead, mothers and fathers who have…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692930/holding-power-accountable"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…the exclusion  of qualified women, people of color, LGBT, and persons with  disabilities, and veterans.\n\nDiversity, equity, and inclusion policies are not about mandates and  quotas. On the contrary. DEI is about eliminating bias, opening doors,  and giving everyone, no matter what they look like or who they love a  fair opportunity for employment, promotion,…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…the Trump administration is as good as its word. From day one,  with Stephen Miller, it has announced its intention to conduct mass  deportation in the United States. It set quotas. It has moved away from  focusing on people with serious criminal convictions, and instead, it  is focused on getting the highest number of arrests and deportations as  possible,…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700023/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…facilitating trade and travel--but  personnel from these components have been pulled from their core  missions and have instead been pressured to focus exclusively on  arbitrary quotas and removing immigrants from our country, even those  who pose no serious threat to public safety.\n\nThis corruption of DHS's mission has directly contributed to the  chaos…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699402/9999"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "Mr. TAKANO. Mr. Speaker, in just 1 week, this administration has  conducted raids into my community to meet arbitrary deportation quotas.  They have unnecessarily sent National Guard and marines, which have  only inflamed peaceful protest, and they have thrown down to the ground  a U.S. Senator, my U.S. Senator,…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692443/californians-should-continue-to-peacefully-protest"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…providers. In so doing, they are  advocating for blatant race and sex discrimination, which we should all  strongly oppose.\n\nDiscrimination is never justified, and the use of quotas is  inherently discriminatory. ERISA plan service providers must be  selected using a prudent and nondiscriminatory process. That is what  H.R. 2988 requires.\n\nMr. WALBERG.…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699160/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…in an ACA  plan without consent since November 2023 in a scheme where brokers and  agents are fraudulently enrolling individuals to collect commissions  and meet enrollment quotas. This broker gained unauthorized access to  his prescription records and replaced his legitimate employer-sponsored  insurance coverage at his pharmacy.\n\nI wish I could say…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698387/lower-health-care-premiums-for-all-americans-act"}]