[{"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "The legislation comes as reports across the United States point to stark racial disparities in COVID-19 cases and fatalities."}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "The legislation comes as reports across the United States point to stark racial disparities in COVID-19 cases and fatalities."}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "Over 6,000 Federal research  programs and datasets related to racial disparities have been deleted,  putting us in the dark on everything from sickle cell anemia to  maternal health."}, {"senator": "Debbie Stabenow", "party": "Democrat", "sentence": "Senators Debbie Stabenow (MI) and Gary Peters (MI) introduced a bill this week to help address the reported racial disparities in COVID-19 testing, treatment, and outcomes."}, {"senator": "Richard J. Durbin", "party": "Democrat", "sentence": "Department of Health and Human Services (HHS) Secretary Alex Azar expressing strong concerns regarding the racial disparities that exist in COVID-19 cases and deaths in Illinois and across the nation."}, {"senator": "Charles E. Schumer", "party": "Democrat", "sentence": "We need to reform the criminal justice system that is still too  short on justice and begin chipping away at the racial disparities that  exist in healthcare, housing, education, and in the economy."}, {"senator": "Edward J. Markey", "party": "Democrat", "sentence": "Last month, Senator Warren and Congresswoman Pressley led their colleagues in urging the Department of Health and Human Services to collect and publicly release racial and ethnic demographic data on testing and treatment for COVID-19 in order to identify and address racial disparities."}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "Department of Health and Human Services (HHS) Secretary Alex Azar expressing strong concerns regarding the racial disparities that exist in COVID-19 cases and deaths in Illinois and across the nation."}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "This guidance is especially troubling considering the rampant racial disparities in our criminal justice system."}, {"senator": "Richard J. Durbin", "party": "Democrat", "sentence": "There are gross disparities--racial disparities and poverty  disparities--when it comes to healthcare in America, and the same is  true for education and housing and so many other aspects of what being  an American is all about."}, {"senator": "Debbie Stabenow", "party": "Democrat", "sentence": "Racial disparities are reflected in so many parts of our lives."}, {"senator": "Cory A. Booker", "party": "Democrat", "sentence": "Department of Education's Office of Civil Rights (OCR) requesting information about how OCR plans to address alarming racial disparities in the federal student loan system through vigorous enforcement of the nation's civil rights laws."}, {"senator": "Richard J. Durbin", "party": "Democrat", "sentence": "Durbin, along with Senator Patty Murray (D-WA) and 10 other Senate Democrats, requested the report in 2018 to determine how effectively federal investments were being used and what improvements could be made to promote maternal health and reduce racial disparities."}, {"senator": "Rob Portman", "party": "Republican", "sentence": "The answer is to  acknowledge when racial disparities and inequities occur, and the  answer is to work together to address these longstanding injustices  going forward."}, {"senator": "Susan M. Collins", "party": "Republican", "sentence": "\"Senators Rubio, Harris, and Booker have crafted bipartisan legislation that would provide a way to help our government confront and work to eliminate the racial disparities across the country."}, {"senator": "Tim Scott", "party": "Republican", "sentence": "As you move forward with additional actions aimed at combating COVID-19, we ask that you use the tools and authorities available to the Department to identify, monitor, and analyze potential racial disparities in the prevalence, along with the hospitalization and mortality rates, of this disease."}]