[{"senator": "Betty McCollum", "party": "Democrat", "sentence": "…safe. It's also hurting our military  readiness here at home, with sea-level rise and extreme weather  flooding our bases. Permafrost thaw is making Alaskan runways unusable.  Radar stations are at risk of falling into the sea.\n\nMr. Chair, we don't have the luxury of ignoring the very real effects  of climate change happening around us--especially when…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695056/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…Children's Hospital in  San Diego for pediatric mental health services. We have a mental health  crisis in this Nation. It is particularly poignant for children. It is  not under the radar any longer. It is out front. The underlying funding  is intended to support mental health clinicians in pediatric primary  care to improve care for pediatric patients.\n\nThis…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699285/amendment-no-1-offered-by-mr-massie"}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "…Americans across the country in their living  rooms and their group chats, in the comments on social media. There are  a lot of things that we debate here that fly under the radar that,  maybe, impact a lot of people but are not on their minds. This is on  everyone's mind. Whether we write another check to fund the Department  of Homeland Security isn't…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699399/9999"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…was a settled question.\n\nThis second letter goes back and says again, national security risks.  It does not identify them. In comments made on FOX News, it has been  said that radar interference is the risk. Radar interference was  deliberated in the initial permits. Radar interference was deliberated  in the stop work order proceedings where the Trump…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698558/permitting-reform"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…sick children, seniors,  and the disabled could lose their healthcare coverage.\n\nThree, it raises costs for people on individual health insurance  plans. Republicans' under-the-radar tweaks to the Affordable Care Act  could increase health insurance premiums by hundreds of dollars and  force tens of thousands of people out of the marketplace.\n\nFour, this…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691944/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…Clause of the Constitution. He took the bribe in plain  sight.\n\nMeanwhile, our Nation is very short on air controllers who are  trained. Look at Newark, New Jersey. They have had radar failures and  repeated flight delays due to serious staffing shortages. This is true  across our country, but what did the Secretary of Transportation, Mr.  Duffy, say? He…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691012/troubling-situation-in-newark"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…hour could possibly  justify such a drastic action.\n\nThe closest thing to an explanation came in a CNN interview with the  Secretary of the Interior a few days ago, who cited ``radar  interference'' and possible swarm attacks from undersea drones at the  wind farm as potential threats.\n\nMadam Speaker, here is the thing: During the yearslong permitting…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695066/halt-work-orders"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…participated in the review of Revolution Wind.\n\nIn fact, if you read the BOEM record of decision, if you actually  read the record of decision, there is a whole section on radar where it  talks about how that has been addressed, the situation has been taken  care of, and the Department of Defense has signed off on it.\n\nWhat this is really about is…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695152/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…countless troops serving in Iraq and Afghanistan.\n\nDave's contributions to our Nation's missile defense capability are  equally extraordinary. As Product Manager for the Sentinel Radar System  following the September 11th attacks, he rapidly deployed teams to  support operations, achieving record readiness rates and earning him  recognition as the top product…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697622/congratulating-mr-david-cook-of-huntsville-alabama-on-his-retirement"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…me give you a conceptual. A year and a half ago, I met with a  Phoenix-based company that is actually building a ginormous drone. They  intend to do ground-penetrating lidar, radar underneath this drone.\n\nLet's say you want to build a pipeline or a road. They are going to  fly it back and forth, back and forth, back and forth, and penetrate  the ground…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694915/facts-and-math"}, {"senator": "James Risch", "party": "Republican", "sentence": "…The JDAM can receive target       coordinates via preplanned mission data from the delivery       aircraft, by onboard aircraft sensors (e.g., forward-looking       infrared, radar, etc.) during captive carry, or from a third-      party source via manual or automated aircrew cockpit entry.\n\n4. The highest level of classification of defense articles,…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688394/arms-sales-notification"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…governing port and vessel operations in fog and low       visibility operations and how those nations utilize advanced       navigation technologies such as remote sensing, radar,       tracking, and unmanned aerial vehicles to monitor visibility       and manage port and vessels operations.       SEC. 327. ANCHORAGES.\n\n(a) In General.--The Secretary…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "Mr. CORNYN. Madam President, it looks like my timing is exquisite  because I came down here to talk about something that I think has sort  of fallen off the radar screen here in recent weeks, and that is the  work of the Department of Government Efficiency,  one of the most important developments that I think we have seen with  the advent…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690662/department-of-government-efficiency"}, {"senator": "Rob Wittman", "party": "Republican", "sentence": "…without the public's knowledge. That is absolutely  unacceptable.\n\nWhile companies like Huawei and ZTE are well known, others controlled  by the CCP continue to fly under the radar. They are doing this  purposely. They are creating entities that are third- and fourth-order  separates from these main organizations to be able to obfuscate those  connections…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690263/foreign-adversary-communications-transparency-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…The JDAM       can receive target coordinates via preplanned mission data       from the delivery aircraft, by onboard aircraft sensors       (e.g., forward-looking infrared, radar) during captive carry,       or from a third-party source via manual or automated aircrew       cockpit entry.\n\na. The KMU-558 guidance kit is paired with a BLU-109 class…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693349/arms-sales-notification"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…Communist China.\n\nWe have already seen Communist China take steps to limit exports of  minerals, such as antimony, that are essential to defense manufacturing  for things like radar systems.\n\nEnergy and Commerce Committee Republicans are focused on all critical  energy resources, including critical minerals. Similarly, the Trump  administration has announced…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699990/securing-americas-critical-minerals-supply-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…Target Acquisition and Designation Sight/AN/AAR-11 Modernized       Pilot Night Vision Sensors (M-TADS/PNVS); sixteen (16) AN/      APG-78 Fire Control Radars (FCR) with Radar Electronic Units;       twenty-nine (29) AN/APR-48B Modernized Radar Frequency       Interferometers (MRFI); seventy (70) Embedded Global       Positioning Systems with Inertial…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695536/arms-sales-notification"}, {"senator": "James Risch", "party": "Republican", "sentence": "…low-flying and maneuvering       targets. The AIM-120D features a quadrangle target detection       device and an electronics unit within the guidance section       that performs all radar signal processing, mid-course and       terminal guidance, flight control, target detection, and       warhead detonation. Precise positioning will be provided by       either…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695866/arms-sales-notification"}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "…Act of 2025 also expands the Coast  Guard's and Customs and Border Protection's use of cutting-edge tools,  like tactical maritime surveillance systems, which are blimp-based  radar systems to find and interdict drug runners, poachers, and human  traffickers at the Texas-Mexico border in the Gulf of America, in San  Diego, in Key West, and San Juan, Puerto…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688519/coast-guard-authorization-act-of-2025"}, {"senator": "James Risch", "party": "Republican", "sentence": "…and maneuvering       targets. The AIM-120D-3 features a quadrangle target       detection device and an electronics unit within the guidance       section that performs all radar signal processing, mid-course       and terminal guidance, flight control, target detection, and       warhead detonation.\n\n2. The Common Munitions Built-In-Test (BIT)/Reprogramming…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695329/arms-sales-notification"}, {"senator": "James Risch", "party": "Republican", "sentence": "…Mission Software; electro-      optical and infrared MX-20HD systems; NexGEN Missile Warning       Sensors for the AN/AAQ-24(V)N; AN/AAQ-2(V) acoustic systems;       AN/APY-10 radar systems; ALQ-213 early warning management       systems; A/N UPX-43 interrogators; KIV-78A cryptographic       appliques; A/N APX-123A Identification Friend or Foe       transmitters;…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698533/arms-sales-notification"}, {"senator": "James Risch", "party": "Republican", "sentence": "…low-flying and maneuvering       targets. The AIM-120D features a quadrangle target detection       device and an electronics unit within the guidance section       that performs all radar signal processing, mid-course and       terminal guidance, flight control, target detection, and       warhead detonation.\n\n2. The Common Munitions Built-In-Test Reprogramming…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690571/arms-sales-notification"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…already seen this play out. Communist China has taken steps  to restrict exports of key minerals including antimony, which is  essential to defense manufacturing for systems like radar. That is not  a theoretical risk. It is active leverage being used against the United  States today.\n\nUnder President Trump, the United States has begun to change course  by…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699905/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}]