[{"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…getting  history lessons, and those lessons stuck with me. I am cognizant that  next year we have the opportunity to celebrate 250 years of an  extraordinary, revolutionary, radical idea that had never been tried,  truly, before in the world: the idea that the power of government  derives from the people, not from brute force, not from getting it from…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695041/better-is-possible"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…lifetime appointment to the  bench would not even answer the question on IVF is troubling.\n\nJoshua Divine is too inexperienced to serve as a district court  judge, and his radical views, I think, disqualify him.\n\nI am also troubled by the nomination of Cristian Stevens. Following  his confirmation hearing, I asked Judge Stevens whether he denounced…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693940/judicial-nominations"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…in the dead of night, in the hopes that nobody would  notice.\n\nHouse Republicans took a bill that was already rotten to the core and  made it even worse to appease the most radical factions of their party.  It will bring deeper, harder, and even faster pain to the American  people.\n\nIt seems the hard right over there wanted even quicker pain. It is…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691671/budget-reconciliation"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…We ought to insist that we all go into this with our eyes wide open,  so that we know, in fact, what the impact is going to be on our  constituents. I don't think that is a radical thing to demand or to ask  for. Yet, my Republican friends seem to think that that is unrealistic.\n\nThis bill is going to need major changes for me to even take another  look…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691512/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…the old horror movie where the person on the phone would  say that the call is coming from inside the house. In State  legislatures, in the Capitol, and in the Oval Office, radical  Republicans are working hard--actively working hard--to make it harder  for eligible Americans to exercise their constitutional right to vote.  We see it in the endless lies…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690535/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…tolling in deficiency cases. In other words, the court  can expand and extend deadlines when timely filings were impossible and  impractical to make.\n\nThese reforms are not radical. They are commonsense improvements  designed to deliver timely justice, lower court costs, and greater  access for everyday Americans, small businesses, and those who  currently…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697271/tax-court-improvement-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…in America knows that if you are born in  America, you are a citizen of the United States. They tried to reverse  that. That got struck down by four courts.\n\nThey call them radical left rogue judges. Well, two of the ones who  struck it down were Democratic appointees, one by President Obama and  one by President Biden. The other two were Republican…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691320/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Steven Horsford", "party": "Democrat", "sentence": "…rigged  system designed to exhaust you, to outlast you, and to ensure that the  little guy never sees a dime.\n\nWell, we have a solution. My bill, the RELIEF Act, does something  radical in Washington. It makes the government fix its own mistake. It  requires automatic refunds of all tariff payments from the last year  within 90 days--no application, no protest…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700196/providing-for-consideration-of-hr-dont-mess-with-my-home-appliances-act-and-providing-for-consideration-of-hr-homeowner-energy-freedom-act"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "Ms. CANTWELL. Mr. President, I rise today because I think the  President tonight is going to continue to talk about his radical  changes to our electoral system. He has tried by Executive order, just  as he tried to impose tariffs by Executive order, and he found out that  he didn't have that authority,…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700198/save-america-act"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…constitutional system of dual sovereignty.\n\nThat sure doesn't sound like anyone is defying any Federal law to me.  And nobody is accusing Justice Scalia as having been a leftwing  radical.\n\nAnd, yes, we do have more recent examples of courts rejecting the  Trump administration's attempts to strong-arm cities and States into  acting as Federal immigration agents.…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700066/9999"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Speaker, a vote for this rule is also a vote to create a new  select subcommittee to investigate the remaining questions regarding  the insurrection on January 6, 2021.\n\nI have a radical idea. Instead of wasting time creating a select  subcommittee to investigate January 6, maybe, just maybe, we should  read the report that the January 6th Select Committee…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694886/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…oversight in my capacity as a member of  the Committee on Homeland Security's Subcommittee on Oversight,  Investigations, and Accountability was ``to virtue signal to [my]  radical base.''\n\nAt least he responded to that one. When I asked him to conduct  oversight of Guantanamo, after the first flights to Guantanamo  separated undocumented immigrants…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692932/holding-power-accountable"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "Mr. Speaker, I rise in opposition to H.J. Res. 35, a resolution that  will drive up energy prices in the United States. It is a radical  measure that will gut one of the Inflation Reduction Act's most  critical programs: the Methane Emissions Reduction Program.\n\nWith this resolution, Republicans are doubling…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688180/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…these noms packages that are coming  forward, today, Senate Republicans are  moving forward on a new nominee package that is chock-full of horribly  unqualified and shockingly radical nominees.\n\nAll year long, Republicans have bent the knee to Donald Trump--bent  the knee to Trump--and turned the Senate's duty of advice and consent  into obey and confirm,…", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697574/department-of-defense"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…and so should internet access for  everybody--everybody.\n\nThe Federal Communications Commission's decision to allow schools and  libraries to lend Wi-Fi hotspots was not a radical idea; it was a  responsible idea. It recognized that in the 21st century, a student's  ability to succeed should not depend on whether their parents can  afford a broadband…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690803/addressing-the-homework-gap-through-the-e-rate-program"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…Speaker, I rise today in strong support of the Congressional  Review Act joint resolutions that we are bringing forward to overturn  the Biden administration's disastrous and radical resource management  plans, beginning with H.J. Res. 104 to repeal the Miles City RMP in  Montana to ensure continued access to the Powder River Basin.\n\nThese Biden-era plans…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694893/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…America are still recovering from Biden- era inflation, sky-high interest rates, and a Washington regulatory  state that makes it harder and more expensive to build a home.\n\nThe radical left's answer is always more government, more mandates,  more red tape. Well, that is how we got into this mess. Republicans  have a better answer: Build more homes, faster,…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699809/lowering-housing-costs-and-advancing-main-street-community-banks"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…TSA agents.\n\nThe Democratic Party has been hijacked by socialists, and now they  are holding the American people hostage. Why? Well, it is because the  Democrats have become radical and extreme. Gallup pollsters tell us  that only one in three Democrats is proud to be an American. Can you  imagine that. Only one in three registered Democrats is proud…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696537/government-funding"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…months? Who is for men in the women's locker room? The same  group is for them all.\n\nIt is the same group that is against having children raised in a  nuclear family. It is the radical feminists and their successors from  the 1960s. As long as they have such a vise grip on the leftwing of  this body, I am afraid they will continue to break down the American…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689133/educating-young-people"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…launched a whole-of-government assault on American  energy production: slow-rolling permits; killing infrastructure  projects, like pipelines; and, most importantly, pandering to radical  climate activists. Then they delivered perhaps the most damaging and  egregious move of all: They banned new exports on LNG. This wasn't to  help the environmental laws or…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697088/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…credit, he refused. He stuttered. He stammered. He  couldn't answer a single question because this shutdown was never about  healthcare. It was always about appeasing a far-left radical base.\n\nChuck Schumer said: Every day gets better for us.\n\nKatherine Clark said: Of course, people will suffer. We want to use  this as leverage.\n\nIt is an embarrassment to…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696694/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…not 535.\n\nMr. President, you have been in it. You have been right close to the  face of the enemy, and you, probably above all others, know what  warfare is like dealing with radical Islam, and I applaud your service  as a Navy SEAL.\n\nSo it says in the Constitution:\n\nThe President shall be [the] Commander in Chief of the Army       and Navy of the United…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693122/motion-to-discharge-sj-res-59"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…are staggering, Madam Speaker. Over the next decade,  115GW of power is expected to come offline while 151GW of demand is  needed to come online. Do that math.\n\nFor too long, radical green activists in the Obama and Biden  administrations were able to hijack environmental agencies with no  authority over the grid to force shutdowns of power plants without…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698274/reliable-power-act"}, {"senator": "Eric Burlison", "party": "Republican", "sentence": "…by my  good friend and chairman of the Water Resources and Environment  Subcommittee, Congressman  Mike Collins.\n\nThis bold legislation delivers a long-overdue blow to the radical  environmental agenda that has weaponized the Clean Water Act, paving  the way for critical infrastructure projects to move forward and be  free from the regulatory shackles…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698024/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Barry Moore", "party": "Republican", "sentence": "…understanding of the meaning or that impact.\n\nDemocrats have embraced an extreme position on this so-called gender- affirming care. They are more interested in promoting the radical left  policies than protecting our children from harm. Despite the American  public's widespread rejection of the practice in 2024, the radical left  continues to distort…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698346/protect-childrens-innocence-act"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…billion, delivering  significant savings for taxpayers. Let me repeat that: Passing full  year appropriations ensures we are not defaulting to Biden-era spending  levels or radical priorities. It allows Congress to reset funding  levels in support of the conservative policies aligned with President  Trump's agenda.\n\nThe Commerce, Justice, Science; Energy…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698637/providing-for-consideration-of-hr-saving-homeowners-from-overregulation-with-exceptional-rinsing-act-providing-for-consideration-of-hr-affordable-housing-over-mandating-efficiency-standards-act-and-providing-for-consideration-of-hr-commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…called the green new scam, in which  foreign companies, Chinese companies, have been enriched because my  colleagues on the other side of the aisle wanted to pursue their  radical agenda.\n\nDo you want to know why the price of energy is going up? It is  because of Democratic policies and mandates, EV mandates, and mandates  about solar panels and wind…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695719/highlighting-flawed-policies"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…I guess that seems to be their habit,  their modus operandi these days.\n\nMadam Speaker, House Republicans are fighting tooth and nail to undo  the damage President Biden's radical agenda--maybe that is why they are  complaining, come to think about it--inflicted on our economy, our  freedoms, and the American way of life. It is just that simple.\n\nThis…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690481/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…a  private company is paying money to run ``Sesame Street.'' It is not  going away. It is doing just fine. It is very lucrative.\n\nWhat will go away is some of the far-left radical views that are  being espoused. By the way, when this goes away at NPR, you can still  turn on about six or seven other channels and get the same far-left  radical views,…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692544/rescissions-act-of-2025"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…manufacture and market  these water heaters the Biden administration attempted to outlaw. The  job-killing regulation we seek to repeal today is another painful  example of the radical left's never-ending war on hydrocarbons and  American energy production.\n\nThe sinister purpose of this regulation was to try to single out and  eliminate an American manufacturer…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688294/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters"}]