[{"senator": "Peter Welch", "party": "Democrat", "sentence": "…patrons, and  the diner grew into a place frequented by all. Today, you can find  anyone from day laborers to college students to politicians enjoying a  meal under the original railroad cart ceiling.\n\nHenry's 100-year tenure has not been without its challenges. A fire  in 1969 necessitated a months-long closure and heavy renovations to the  business. Still,…", "date": "2025-07-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694323/recognizing-henrys-diner"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…the       boundaries of Northwest Ohio; and\n\nWhereas, from its early seat in Ottokee to its present-day       seat in Wauseon, Fulton County has grown alongside the       railroad, agriculture, and industry--serving as a vital link       in both Ohio's past and its future; and\n\nWhereas, its 406.8 square miles of rich farmland, flowing       rivers,…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693801/proclamation-for-fulton-countys-demisemiseptcentennial"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…doing something right.\n\nI am sick and tired of folks in Washington or the think tanks or  wherever else looking for a win-win when there is a villain hurting our  people. If a railroad sends a toxic fireball into the sky over your  community, you don't look for a win-win. You fight them for your  people. When PBMs are killing pharmacies and jacking up drug…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689080/economic-populism"}, {"senator": "John Mannion", "party": "Democrat", "sentence": "…I was raised in Syracuse, New York, in a union household. My mother  was a proud CWA member at New York Telephone, and my father a proud  union member at New York Central Railroad. I also served as the  president of a 400 member teachers' association union representing  teachers, nurses, school psychologists, and social workers.\n\nThose who have a union…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697993/protect-americas-workforce-act"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…Congress done to prevent this from ever happening  again to East Palestine or any other American city? The answer is not  enough.\n\nThat is why this week I am introducing the Railroad Safety and  Accountability Act to protect labor and public interest voices in rail  safety decisions, voices that Federal regulators have tried to push  aside.\n\nThat is why…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699687/norfolk-southern-train-derailment"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…government, and USRC, a  nonprofit, manages and operates the station under a lease with the  federal government. The members of USRC's board of directors are the  Federal Railroad Administration, Amtrak, the Federal City Council, the  District of Columbia and the USRC President and CEO. USRC is the only  entity exclusively dedicated to the management…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689966/introduction-of-the-union-station-redevelopment-corporation-funding-eligibility-act"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…good chunk of the current force, including the new chief, Marc Myers.\n\nI had a chance to work directly with Chief Colucci last year in an  effort to upgrade a 130-year-old railroad tunnel in the community that  was falling apart and was a real public safety risk. We worked together  to push the railroad to make the repairs, and I got a chance to see…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695739/recognizing-steven-colucci"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…clouded title, which limits allowable uses and development. In this  case, the reversionary interests originate from the initial conveyance  that provided public land for railroad purposes in the 19th century.\n\nMaking matters worse, the land changed hands over the years  eventually without the knowledge of this requirement.\n\nThis bill would finally…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691118/reversionary-interest-conveyance-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…member of the  Subcommittee on Highways and Transit, I have been committed to reducing  transportation noise pollution. I have convened community meetings with  the Federal Railroad Administration, the D.C. Department of  Transportation and the Federal Highway Administration to examine how to  reduce train noise and vibrations. A GAO report on reducing…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689433/introduction-of-the-train-noise-and-vibrations-reduction-act-of-2025"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…Plenipotentiary of the United       States of America to the Kingdom of the Netherlands.\n\n3. Calendar Number 158: David Fink, of New Hampshire, to be       Administrator of the Federal Railroad Administration.\n\n4. Calendar Number 265: Marc Andersen, of Virginia, to be       an Assistant Secretary of the Army.\n\n5. Calendar Number 355: Christopher Fox, of Virginia,…", "date": "2025-10-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696058/nominations-en-bloc"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…ranking member of the Subcommittee on Highways and Transit, I  have been working to reduce train noise and vibrations. I have convened  community meetings with the Federal Railroad Administration, the  District of Columbia Department of Transportation and the Federal  Highway Administration. I established the Congressional Quiet Rails  Caucus. I introduced…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696790/introduction-of-the-protecting-homes-from-trains-act-of-2025"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…the Booker T. Washington High School, so  you know what side of town I lived on.\n\nRocky Mount was a city that was still segregated. In fact, it was  literally divided by the railroad tracks that ran through the middle of  the town. The Whites lived on one side; the Blacks lived on the other.\n\nMy parents were both graduates of that high school, and I had…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699200/building-a-beloved-community"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…buildings to local residents. In its absence, the settled town of Fort  Laramie continued to grow. With homesteaders continuing to move into  the area and the addition of a railroad extension from Cheyenne, Fort  Laramie became a bustling community. It was officially incorporated in  1925.\n\nWhile the town of Fort Laramie developed independently of the…", "date": "2025-07-31", "source_url": "https://justfacts.votesmart.org/public-statement/1694485/100th-anniversary-of-fort-laramie-wyoming"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…for freight and passenger service, and now as a  museum where history is preserved for generations to come.\n\nThe South Dayton Depot has not only preserved our community's  railroad heritage, but has also become a gathering place where  neighbors connect and visitors experience the rich story of our region.  From its role in major motion pictures like…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694965/recognizing-the-south-dayton-depot-on-its-150th-anniversary"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…and Western Class J No. 611                                 Locomotive\n\nMr. CLINE. Mr. Speaker, I rise today to recognize the 75th  anniversary of a true icon of American railroad history, the Norfolk  and Western class J No. 611 steam locomotive.\n\nBuilt right in Roanoke, Virginia, in May of 1950, this bullet-nosed,  coal-fired marvel remains a shining…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691982/recognizing-southern-virginia-universitys-ncaa-division-iii-mens-volleyball-national-championship-victory"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…Fishing vessel and fisherman training safety. Sec. 314. Designating pilotage waters for the Straits of Mackinac. Sec. 315. Study of amphibious vessels. Sec. 316. St. Lucie River railroad bridge. Sec. 317. Large recreational vessel regulations.                             Subtitle C--Ports  Sec. 321. Ports and waterways safety. Sec. 322. Study on Bering Strait…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…an individual or another country, or the  interest we have to pay back to the trust funds when we reach into the  Social Security trust fund, the Medicare trust fund, the railroad  retirement trust fund, and those things. We borrow the money. We owe  them interest.\n\nTotal interest last year was about $1.2 trillion, making interest the  second biggest…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699257/debt-deficits-and-demographics"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "…Muennich assumed command from Major General Dale Lyles, making General  Muennich the 60th Adjutant General of Indiana's National Guard.\n\nI met with constituents from the Indiana Railroad Association and the  Indiana Trucking Association. The district that I represent literally  lies at the crossroads of America, and industries such as these  represent key…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688262/return-the-united-states-to-a-balanced-budget"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…afflicting a small  parcel of land in California. The current owners of an eight-acre  property in Sacramento recently discovered a reversionary interest on  their land, which a railroad company originally conveyed. The  reversionary interest, which dates back to the days of the  transcontinental railroad in the 19th century, requires the land to  revert to…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691119/reversionary-interest-conveyance-act"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…Big Lick Baptist Church on May 16,  1875.\n\nFrom just 20 charter members in a small village, this church has  grown alongside the city it calls home. As Roanoke emerged as a  railroad hub and flourished, so too did First Baptist, driven by a  people focused on God, devoted to discipleship, missions, and the  community.\n\nFrom their first sanctuary in 1878…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691575/recognizing-the-75th-anniversary-of-james-wood-high-school"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…trade and tourism. The Cumberland and Oxford  Canal opened in 1832, tying together the Sebago Lake and Portland  economies. Later, in the 1870s, the Portland and Ogdensburg Railroad  expanded the town's hospitality industry and encouraged steamboats to  bring visitors to Sebago. What were once seasonal homes and inns  evolved into year-round abodes that…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699146/town-of-sebago-200th-anniversary"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…lifetime income, so  more money than they make in their entire lifetime, just to cover  Federal pension benefits, Social Security, Medicare, military, Federal  employees, and railroad retirement.\n\nDoes anyone care? Does anyone care? What is wrong with this place?  The immorality that the next generation will be poorer than us--but we  are not allowed to…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698698/congress-is-a-math-free-zone"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…Mr. Speaker, I rise today to recognize the city of  Delano, California as it celebrates its 110th anniversary.\n\nIncorporated in 1915, Delano was originally established as a railroad  town, serving as a hub for hundreds of workers building the southern  terminus of the Southern Pacific railroad. Over the years, Delano has  been the site of several historically…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692510/recognizing-delano-ca"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…``(3) Covered passenger rail train.--The term `covered       passenger rail train'--\n\n``(A) means a passenger rail train that--\n\n``(i) is owned and operated by the National Railroad       Passenger Corporation (commonly known as `Amtrak'); and\n\n``(ii) was solicited for purchase after the date of the       enactment of the Baby Changing on Board Act for…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692155/baby-changing-on-board-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…transportation rights-of-way to the Apex  Industrial Park Owners Association, the city of North Las Vegas, and  Clark County for electric, power, water, natural gas, telephone,  railroad, or highway facilities.\n\nCongress created the Apex Industrial Park in 1989 by authorizing the  sale of roughly 21,000 acres of Bureau of Land Management land to Clark  County,…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691121/apex-area-technical-corrections-act"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…Mr. Speaker, I rise today to recognize the city of  Delano, California as it celebrates its 110th anniversary.\n\nIncorporated in 1915, Delano was originally established as a railroad  town, serving as a hub for hundreds of workers building the southern  terminus of the Southern Pacific railroad. Over the years, Delano has  been the site of several historically…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698436/recognizing-the-city-of-delano-california"}]