[{"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…Deborah Suggs.\n\nFor over 50 years, Deborah has called home the Marian Park  Apartments, a Wheaton affordable housing community serving seniors and  families.\n\nWhile raising her children, grandchildren, and now great- grandchildren, Deborah has brought together her community to organize  for the resources they need to thrive, whether it is secure  transportation…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690325/national-fair-housing-month-amisha-patel"}, {"senator": "Sheila Cherfilus-McCormick", "party": "Democrat", "sentence": "…families  will be stripped from them.\n\nMr. Speaker, I rise today for a woman named Maria. Maria lives in  Broward County. She is a home health aide who works full time, raising  two children, and still cannot afford health insurance without the tax  credit from the Affordable Care Act.\n\nBecause of those credits, Maria can take her blood pressure  medication,…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697212/medical-bills-are-too-high"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…Trees, and providing the long- time display of the Bugg Lights. His work has not only improved the  city but established a community where people can look forward to  raising their children, supporting their neighbors, and being proud to  call Belen home.\n\nOn behalf of the people of New Mexico's 2nd Congressional District, I  would like to thank Ronnie…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699893/recognizing-ronnie-torres"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…receiving my care. This work is not just a job--it is my       calling.\n\nI have lived here peacefully, attending church,       participating in community activities, and raising my       children responsibly. Through hard work and sacrifice, I was       able to purchase a home and a car so I could care for my       family and fulfill my responsibilities.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699638/expert-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…from the delivery, adjusting to life with a little one,  accessing the care they and their family need, balancing caregiving and  work, making ends meet, and the cost of raising children in the United  States. It is a lot.\n\nI think about all of the babies I have delivered whose moms got their  healthcare through Medicaid and how critical that was to help…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691420/gop-tax-scam-hurts-everyone"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…say, $50,000 a  year.\n\nI realize that there are great American families of all backgrounds.  I, like all of us, know single parents who have done a fantastic job of  raising their children. I commend them for that, but I think, also,  everyone would agree that it is easier on both the parents and the  children if you have two parents there. In essence,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699038/reshaping-the-american-family"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…care for receive  the support and love that they need.\n\nFamily caregivers are often the unsung heroes in our communities.  Many balance caregiving with full-time jobs, raising children, and  managing their own health.\n\nThey deserve our support and recognition, which is why I am proud to  support legislation like the Lowering Costs for Caregivers Act…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697240/recognizing-national-family-caregiver-month"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…one. Bill does  not simply lend a helping hand, but he truly commits himself to  enforcing change and improvement where it is needed.\n\nAt nearly 77 years old, while raising three children and being a  grandfather to two, many would have retired, but not Bill. He continues  to work hard every day as the owner of multiple businesses, which he  runs with…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696330/recognizing-william-bill-forest-harris-with-a-congressional-veteran-commendation"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…community as a volunteer fireman where  he currently serves as their treasurer.\n\nAlongside his wife, Linda Matocha Masur, Danny has dedicated 58 years  of marriage to raising four children and has extended his love and  commitment to nurturing nine grandchildren and one great-grandchild.\n\nDanny's heart has never left the sky. As a pilot in the Rockdale…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696328/recognizing-danny-charles-masur-with-a-congressional-veteran-commendation"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…have children--well, all  types of families have successful children. I personally know many  people who, on their own, both men and women, have done a very good job  of raising children we would be proud of. In the long run, it is not  fair to the next generation to discourage people from getting married  and having children.\n\nRight now, there are many…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691328/the-big-beautiful-bill"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…whether we were, in  fact, in a surplus situation.\n\nI am going to look at some programs, which, again, maybe  intentionally, maybe unintentionally, penalize people who are raising  children while they are married.\n\nWe had a hearing a couple of weeks ago in a subcommittee which I have  been fortunate enough to chair. In that hearing, Robert Rector, who  works…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688328/destruction-of-the-nuclear-family"}, {"senator": "Mary Miller", "party": "Republican", "sentence": "…on the other side, I have had a similar situation  also, but I do want to thank her for acknowledging that the life within  her was a baby. Women are fully capable of raising children and getting  an education at the same time. I know because I did it.\n\nMr. Speaker, I thank Congresswoman Hinson for her leadership on the  Pregnant Students' Rights Act.", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699318/pregnant-students-rights-act"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…families without both a  mother and father at home. I want to point out, I know families of all  sorts of backgrounds. I know parents who have done a fantastic job of  raising children in all backgrounds, and sometimes beyond their fault,  there are families who appear to be doing a perfect job of raising  their children, but nevertheless have a problem.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695628/breakdown-of-traditional-families"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…excellence. She earned two degrees: one in Early Childhood  Development and another in Business Administration. She successfully  operated a home childcare business while raising her three children.  Once her children reached school age, she discovered a new calling:  serving those who have served.\n\nMrs. Gramer has devoted herself to supporting veterans and…", "date": "2026-02-20", "source_url": "https://justfacts.votesmart.org/public-statement/1700088/recognizing-united-states-navy-petty-officer-second-class-katrina-gramer"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…at home, to a steady increase for about 30 years to over 40  percent.\n\nThere are so many wonderful single parents out there. I know people  who have done a great job of raising children as a single parent. Of  course, we do have programs to help people who are widows or widowers  in Social Security. That is not, I think, what is normally meant by a  single…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700071/issues-of-the-day"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…This doesn't mean there aren't wonderful single parents. I know some  single parents, particularly emotionally strong single parents, who  have done a fantastic job of raising their children. Anybody would be  proud of them. However, the statistics make it obvious that overall  children would be better off if they had a mother and father at home.\n\nAlmost…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689133/educating-young-people"}]