[{"senator": "Robin Kelly", "party": "Democrat", "sentence": "…later, she was shot and killed in a park  in Chicago.\n\nHadiya should have turned 28 years old yesterday. Hadiya's friends  and family started the Wear Orange movement to raise awareness of gun  violence. Now the orange color has become a beacon for activity and  advocacy against gun violence.\n\nSince they started the Wear Orange movement in 2015, I have…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691753/national-gun-violence-awareness-month"}, {"senator": "Lori Trahan", "party": "Democrat", "sentence": "…affects nearly every household and  community around the country, and nowhere is it more heartbreaking than  when it affects our children.\n\nThis month marks an opportunity to raise awareness for childhood  cancer and support research for new treatment and therapy avenues. Just  this year alone, nearly 10,000 children will be diagnosed with  pediatric cancer.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695859/recognizing-september-as-childhood-cancer-awareness-month"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…submitted an amendment to ensure  that individuals who have had their SNAP benefits stolen are able to  receive a reimbursement. I also submitted an amendment which would help  raise awareness of the risk of renal medullary carcinoma, an aggressive  form of kidney cancer found in young individuals with the sickle cell  trait. These common-sense amendments would…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693211/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Ilhan Omar", "party": "Democrat", "sentence": "…by her love for her grandchildren and a vision for a  healthier, more sustainable planet for future generations, Donna spent  64 days traveling 3,000 miles by bicycle to raise awareness and support  for climate justice.\n\nFrom California to Florida, Donna struck up conversations with those  whom she met along the way to raise the alarm on the climate crisis.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695414/recognizing-donna-minter-on-completing-grammy-climate-ride"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…and other resources he needs. His mom and  dad, Shannon and Chris, work full-time jobs, and Medicaid is backup  insurance.\n\nBy establishing May 2 as NKH Awareness Day, we raise awareness for  this devastating disease and recommit to fighting for a reliable  Medicaid. That is because every family should be focused on spending  time with their loved ones…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690619/recognizing-nkh-awareness-day"}, {"senator": "Doris Matsui", "party": "Democrat", "sentence": "…programs  and restore their health. In most cases, plasma-derived therapies are  the only available treatment for these conditions. That is why it's so  important that we raise awareness of the importance of plasma-derived  therapies this week, and work to improve access to these unique  biologic products.\n\nI'm committed to working to ensure that every…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696010/recognizing-international-plasma-awareness-week-2025"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…colleagues to recognize the goals and ideals of Sarcoidosis  Awareness Month by supporting federal activities that improve the lives  of patients impacted by Sarcoidosis, and to raise awareness and shine a  light on the 1.2 million people living with Sarcoidosis.", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689983/recognizing-the-month-of-april-as-sarcoidosis-awareness-month"}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "…work and steadfast  commitment of custodial staff to their school communities.\n\nBy 1998, custodian appreciation efforts had expanded beyond  expressions of gratitude to raise awareness about the critical role  custodians play in maintaining cleanliness, hygiene, and order in every  setting. People have begun to acknowledge the often-overlooked impact…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697118/recognizing-national-custodian-appreciation-day"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…breathing.  For over two decades, Falun Gong practitioners have suffered from  detention, torture and organ harvesting at the hands of the Chinese  government.\n\nWe must fight to raise awareness of those persecuted in China who  cannot raise awareness themselves. On May 5, 2025, the House of  Representatives passed H.R. 1540, the Falun Gong Protection Act, which…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691790/supporting-the-falun-gong-practitioners"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…relates to  their loved one, a high schooler, Ellie, who wants to be paid fairly.\n\nOver 10 days, the father-son duo ran 260 miles from New York City to  Washington, D.C., to raise awareness for the bill.\n\nTheir run raised national awareness, and it is now up to us to act.  Together, we can support those workers by ensuring that they earn the  fair pay that…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697468/recognizing-omayra-andino"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…protect  them. Recognizing April as Native Plant Month will not only provide an  opportunity to celebrate the diverse and invaluable plants across our  country but also help raise awareness about the challenges they face.  By designating this month, we can shine a spotlight on the importance  of native plants in maintaining the ecological balance of our…", "date": "2025-03-21", "source_url": "https://justfacts.votesmart.org/public-statement/1688920/supporting-the-designation-of-april-2025-as-national-native-plant-month"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…partnered with e-bike suppliers and rental       services to expand access to safe, certified micromobility       devices, and we have invested in education campaigns to raise       awareness about battery safety. Your leadership in bringing       this bill forward is not only timely--it is necessary.\n\nWe are grateful for your commitment to consumer protection,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690260/setting-consumer-standards-for-lithium-ion-batteries-act"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…that number  continues to grow, but they were having difficulty preparing for  prosecution because of gaps in our law.\n\nI applaud the FBI for taking crucial steps to both raise awareness of  this issue and hold predators accountable. However, more tools are  needed from Congress to ensure that these heinous individuals are  prosecuted.\n\nThe conduct of…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698880/coercion-and-sexual-abuse-free-environment-act"}, {"senator": "Scott Fitzgerald", "party": "Republican", "sentence": "…Act.  SOFA is the same acronym as an organization started by Lauri Badura of  Oconomowoc, Wisconsin, Saving Others For Archie. Archie was her son.\n\nLauri has worked to raise awareness of the dangers of drug addiction  throughout Wisconsin following the loss of her son Archie to a fentanyl  overdose.\n\nMr. Speaker, I personally recognize the work of Lauri,…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692348/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…focused on the XUAR, including       in local languages, to ensure that further PRC human rights       abuses are reported on;\n\n(10) work with international partners to raise awareness       concerning acts of transnational repression against Uyghur       Americans or Uyghurs exiled in the United States;\n\n(11) develop and implement strategies to prevent…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694799/uyghur-policy-act-of-2025"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…NETWORKS.\n\n(a) In General.--The Assistant Secretary shall conduct       outreach and provide technical assistance to small       communications network providers--\n\n(1) to raise awareness regarding the uses, benefits, and       challenges of Open RAN networks and other open network       architectures; and\n\n(2) regarding participation in the Wireless Supply…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693488/open-ran-outreach-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "Mr. THOMPSON of Pennsylvania. Mr. Speaker, I rise to recognize Heart  Health Month.\n\nHeart Health Month is a time to raise awareness about the importance  of cardiovascular health and the steps that we can take to protect our  hearts. Heart disease remains the leading cause of death in the United  States,…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688152/recognizing-heart-health-month"}, {"senator": "Claudia Tenney", "party": "Republican", "sentence": "…decade-long  service on the Ulster County Planning Board representing the Village of  Saugerties, his 16 years of service as a volunteer firefighter, and his  continuous work to raise awareness and support for those living with  autism. In 2023, he was appointed to the New York State Council on  Developmental Disabilities because of his advocacy and dedication,…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689495/recognizing-april-as-national-autism-awareness-month"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…today.\n\nThe symptoms of this cancer are often overlooked or misdiagnosed,  leading to late detection and limited treatment options.\n\nThrough this legislation, we hope to raise awareness about esophageal  cancer to improve the odds for those who contract this disease. I am  proud to have joined Ranking Member Gerry Connolly in cosponsoring the  Gerald…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691831/gerald-e-connolly-esophageal-cancer-awareness-act-of-2025"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…across our  country.\n\nMy friend Marlys Carlson of Stratford, IA, finished her battle with  lung cancer in July of this year and is now with her Lord and Savior. I  want to raise awareness for lung cancer in her honor today.", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697020/lung-cancer-awareness-month"}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "…enabled him to break through       the bureaucracy, swiftly marshal the necessary resources, and       successfully end the outbreak.\n\nThe secretary used his platform to raise awareness for the       measles outbreak, publicly urging people to take it seriously       and emphasizing the critical role of the measles, mumps, and       rubella vaccine.…", "date": "2025-10-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696063/texas-measles-outbreak"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…modules.\n\n``(d) Resource Partner Involvement.--\n\n``(1) In general.--The Administrator shall coordinate with       resource partners to disseminate information to raise the       awareness of small business concerns about availability of       the educational resources and modules established under       subsection (a).\n\n``(2) Specialized and localized…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699206/artificial-intelligence-wisdom-for-innovative-small-enterprises-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Association  Northern California and Northern Nevada Chapter. I have met with  dedicated volunteers, heard their moving stories, and supported  community events to help raise awareness. Their advocacy and compassion  make a profound difference, bringing hope to millions.\n\nRecently, the Alzheimer's Association visited Washington, D.C., and  our U.S. Capitol.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "Mr. GRASSLEY. Mr. President, this month of April is National Donate  Life Month. This month is the time to raise awareness about the  lifesaving importance of organ donation.\n\nThere are over 103,000 Americans on the national organ transplant  waiting  list. We should have confidence that our…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690102/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…survivors to overcome the seemingly insurmountable obstacles  they face. Laurie has become a powerful voice in the fight against  human trafficking, using her platform to raise awareness, educate  communities, and advocate for change at the policy level. Laurie has  worked with law enforcement, legislators, and local leaders to  strengthen laws, increase…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691094/recognizing-laurie-swink"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…the end the following:\n\n``(I) provide educational resources and host or participate       in events for small businesses and small business investors,       including to raise awareness of capital raising options for--\n\n``(i) underrepresented small businesses, including women-      owned small businesses and minority-owned small businesses;\n\n``(ii) businesses…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692706/promoting-opportunities-for-non-traditional-capital-formation-act"}, {"senator": "Claudia Tenney", "party": "Republican", "sentence": "…decade-long  service on the Ulster County Planning Board representing the Village of  Saugerties, his 16 years of service as a volunteer firefighter, and his  continuous work to raise awareness and support for those living with  autism.\n\nIn 2023, he was appointed to the New York State Council on  Developmental Disabilities because of his advocacy and dedication,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690169/autism-awareness-month"}]