[{"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…York. I was in Suffolk County  at Tandy's, a well-known dress seller there. Her costs are going up 30  percent because of tariffs, and she is faced with two awful choices:  raise prices or lay off employees. And she doesn't want to do either.\n\nSmall businesses, medium businesses, big businesses--they are all  frozen because they don't know what Donald…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690523/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…billion into last year's election cycle, a dramatic       increase from the prior record of $1 billion in 2020.\n\nCitizens United, which allowed corporations and unions to       raise and spend unlimited amounts on elections, was premised       significantly on the Court's assumption that all of this       newly permitted election spending would be transparent.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699084/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…taken away options for households to save money on their energy bills.  Now they are going to strip businesses of these options as well.\n\nRepealing these standards would also raise costs and increase demand  on the electricity grid. It is also not necessary because two-thirds of  the products on the market today already meet these new efficiency  standards.…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689127/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "…under Lina Khan, we were able to stop that  merger because we know and we have seen that when these mergers happen,  corporations shut down stores, they fire workers, and they raise  prices.\n\nLook at the housing market. When rents are sky high and there  literally is not a single place in the country where someone can afford  rent on minimum wage, private…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689086/economic-populism"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "…alone to mount any meaningful opposition to protect  themselves.\n\nAccess to judicial review ensures that communities, Tribes, and local  governments can challenge decisions and raise potential harms that have  not yet been considered. Without it, agency actions just go completely  unchecked.\n\nThis legislation prioritizes polluters over people's clean water…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698018/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…constitutional norms and executive overreach by his administration.\n\nArticle I of the Constitution grants Congress broad powers, including  the power to declare war, regulate commerce, raise revenue, appropriate  funds and conduct oversight. For decades, Congress has gradually ceded  more of these Constitutional responsibilities to the executive branch.  As our…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694144/introduction-of-a-resolution-reaffirming-the-principles-of-the-constitution-of-the-united-states"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…is that  they can provide healthcare, but with the premiums going up like this,  it is a wicked decision and discussion between the businessowner and  the employees about a raise versus picking up the high cost of a  premium increase. That is going to be aggravated if these tax credits  expire; 1.6 million of those folks in small businesses would lose…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695678/cloture-motion"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…measure of stability in our bilateral relationship.\n\nSadly, the Trump administration has failed to do anything to get  ahead of the expiration of New START and has done a lot to raise  nuclear tensions. The President has made threats, endorsed insanely  expensive plans to expand our arsenal, pushed for the resumption of  explosive testing, and advocated…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699033/expiration-of-new-start"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…critical food assistance from vulnerable groups, including veterans,  people who are homeless, stay-at-home parents, and youth aging out of  foster care. Now is not the time to raise grocery costs for families  and force states to choose between taking SNAP benefits away from large  numbers of people or ending their SNAP programs entirely. This is  inexcusable…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693169/one-big-beautiful-bill-act"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…access Medicare or  Medicaid.\n\nThat is why I am introducing the bipartisan FIT Procurement Act today  with my colleague Congressman Burlison. The FIT Procurement Act would  raise cost caps and allow the Federal Government to buy more innovative  tools without going through the needless bureaucracy.\n\nWhat we are trying to do is help agencies not have…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692900/congratulating-virginias-10th-district-congressional-award-medalists"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…audit failures, including in November  2024. From FY 2021 to FY 2025, defense authorizations rose from $740  billion to $895 billion, a 21 percent increase, and this bill would  raise that to $900.6 billion, approximately $8 billion more than the  President's budget request. That excludes the July 2025 reconciliation  bill, which added over $150 billion…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698254/nominations"}, {"senator": "Valerie Foushee", "party": "Democrat", "sentence": "…how that power is  used.\n\nSince Citizens United, we have watched a parallel political system  take shape, one dominated by super-PACs and dark money organizations  that can raise and spend unlimited sums and operate with fewer rules,  less transparency, and the ability to determine election outcomes long  before voters cast a ballot. A small number…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699237/restoring-election-integrity"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…This includes nearly 100,000 children and 24,000  seniors.\n\nNot only that, but the budget resolution would also go after the  Affordable  Care Act again, and it is projected to raise annual health premiums by  roughly $1,200 for 20 million people. It would force 7 million  Americans to lose their health insurance.\n\nThis budget resolution does nothing to…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688133/republican-budget-betrayal"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "Mr. Speaker, I rise in strong opposition to H.J. Res. 20, the second  Republican resolution in just 2 days that will raise energy prices on  Americans. This harmful resolution guts a Department of Energy  efficiency rule on gas instantaneous, or tankless, water heaters.\n\nEnergy efficiency standards,…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688293/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…sets the wrong priorities. We  should be making it easier for small businesses to access the tools  they need to thrive. That means focusing on the actual issues that they  raise with us every day. Let me remind my colleagues on the other side  that those issues would be inflation, access to capital, workforce  shortages, and the lingering effects of--guess…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692124/american-entrepreneurs-first-act-of-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…responders with scientific holistic options to treat an array of  conditions, including: PTSD, Suicide Prevention, inflammation, and many  more. Mrs. Gaston tirelessly works to raise awareness about the options  available as well as delivering the treatments often beyond regular  hours. Mrs. Gaston is the foundation of this non-profit. Additionally,  after…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692210/recognizing-tami-gaston"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…RAN NETWORKS.\n\n(a) In General.--The Assistant Secretary shall conduct       outreach and provide technical assistance to small       communications network providers--\n\n(1) to raise awareness regarding the uses, benefits, and       challenges of Open RAN networks and other open network       architectures; and\n\n(2) regarding participation in the Wireless…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693488/open-ran-outreach-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…taken away by the State. They know that they  can walk the streets freely, or they think that they can walk the  streets freely, and not be assaulted. They believe that they can raise  a family, grow and develop a community, and live the American Dream  that they have seen play out.\n\nThey want to come here, but then when people with their fake ribbons  and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695203/people-are-sick-and-tired"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…mean it  is not enforceable, and does that mean it can be repealed by the next  administration with a click of the fingers? I don't know the answer to  those questions. I just raise them. If it is not official, is it even  enforceable? That is the argument that my colleagues would have you  believe.\n\nMadam Speaker, I yield such time as he may consume to…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690434/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-nox-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…business deduction to 23 percent. This will impact 67,000 North  Dakota businesses.\n\nThis bill will allow 100 percent immediate expensing for equipment  and facility upgrades and raise the death tax exemption, helping  families pass down their farm or ranch to the next generation.\n\nFor workers, the one big, beautiful bill significantly reduces taxes  on tips…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691959/supporting-the-big-beautiful-bill"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…twice the amount of the top 10  percent and wealth three times the top 1 percent. If Leader Jeffries is  successful at killing the Tax Cuts and Jobs Act extension, he will  raise taxes by $1,739 for families in his district.\n\nMr. ARRINGTON. Mr. Speaker, interestingly enough, the Democrats'  expansion of ObamaCare actually put 90 cents on the dollar…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689910/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…in some ways to listen to each other, to maybe say: How  do we do this better, faster, cheaper? I am going to say this three or  four more times. Does the left really want to raise taxes on the  average American family by $2,853? Is that the plan here?\n\nThis says that 63 percent of those who are tax filers will see their  taxes go up. Is that the plan…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688035/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…These were the words of James Otis, but they still ring true today.  It should not come as a surprise that in a country founded on a tax  revolt, one person  is not allowed to raise taxes. Our Founding Fathers saw this and said:  No, we want to make sure that the authority of taxation begins not only  in Congress, that it actually originates in the House,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690543/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Roger Marshall", "party": "Republican", "sentence": "…share a story with my fellow Senators, I always  thought that I was my grandma's favorite grandchild, and I thought it  was because I was always the one that was the first to raise my hands  for seconds. Now, I don't know if I was her favorite, but certainly I  was one of her favorites.\n\nThe interesting thing was, we couldn't gain weight, though. Despite…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698680/9999"}, {"senator": "Craig Goldman", "party": "Republican", "sentence": "…refrigerators are used during peak business hours.  Ignoring these realities poses serious food safety risks.\n\nThe evidence is clear. If not repealed, these extreme regulations  will raise costs, increase red tape, and endanger food safety.\n\nMr. Speaker, I urge my colleagues to support this resolution. In  November, Americans voted for change, common sense, and…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689126/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…of the base of this. It is the lack of understanding.\n\nOne of the points that you keep trying to make over and over again  is, was it the Democrats' plan that they wanted to raise taxes on  everyone? Because that was automatic; that was coming at the end of  this year.\n\nYour taxes were going up back to the pre-2017 tax reform. Every once  in a while,…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694131/dismantling-californias-citizens-redistricting-commission"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…most dangerous criminals       from trying to enter, or re-enter, our country by increasing       severe criminal and financial penalties. Specifically, the       bill would raise the maximum penalty from two years to five       years of imprisonment for any illegal alien convicted of       reentering the United States.\n\nThe best deterrent against these…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695364/stop-illegal-entry-act-of-2025"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…administration's rule wasn't actually  necessary. It was just another example of their death-by-a-thousand- paper-cuts agenda to crush our domestic oil and gas industry and raise  energy prices for all Americans in the process.\n\nAfter we pass this resolution today--and it will pass the House. It  already passed the Senate, and President Trump will sign…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688634/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "French Hill", "party": "Republican", "sentence": "…HILL of Arkansas. Mr. Speaker, let me say that the gentlewoman  from California knows my respect for her and her leadership on our  committee, but there is no effort here to raise overdraft fees in this  resolution. It is quite the contrast. All we are saying is we don't  need the Federal Government having a price cap on a product that is a  very competitive…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689849/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…County Sheriffs association.\n\nLadies and gentlemen, I don't know why it is hard for any Member of  the U.S. Senate to get behind this bill. It simply says that we are  going to raise the stakes for anybody who would knowingly do harm to a  police officer.\n\nTo every officer serving today: Thank you for your courage. You have  earned my unending gratitude.…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691402/motion-to-discharge-s-res-195"}]