[{"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…bipartisan package was pushed aside by Speaker Johnson  after Elon Musk voiced his opposition to the overall package. The  temporary option would have left the door open for an off-ramp to  substances found to have potential medical applications. However, this  Republican bill would also exacerbate inequities in our criminal  justice system because drugs placed…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692341/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "…then the Office of Civil Rights comes  in.\n\nThe Office of Civil Rights investigates for the mother and the child  who uses the wheelchair when the school says they don't need a ramp.\n\nThe Office of Civil Rights literally provides constant oversight over  every school district in this country so that a child in Alabama has  the same rights to an education…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698945/protecting-education-for-children-with-disabilities"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "…Kickback'' to give Texas Governor Greg Abbott a handout for  his unconstitutional border security operations.\n\nThe ``One Big Ugly Bill'' gives the Trump administration billions to  ramp up mass detentions and deportations, including American children  with cancer, and deny due process to whomever they can, including those  in the country legally.\n\nThe ``One…", "date": "2025-05-23", "source_url": "https://justfacts.votesmart.org/public-statement/1691679/one-big-beautiful-bill-act"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "…domestic police force in the United States with more resources  than dozens of militaries around the entire world.\n\nThis funding is unprecedented, and it is a free pass for ICE to ramp  up Trump's cruel and inhumane mass deportation policies.\n\nThey are already building concentration camps in Florida where they  are threatening to lock up legal immigrants and…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694186/pushing-back-against-ices-authoritarian-overreach"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…College and a constituent of mine: ``February 6 is likely to bring us  into a new era, not unlike the early years of the Cold War, in which  the major powers will be poised to ramp up their nuclear warfighting  capabilities without any formal restrictions whatsoever. That  comfortable feeling we once enjoyed of relative freedom from an  imminent nuclear…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699036/expiration-of-new-start"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…cleaner, cheaper energy a few  months ago and energy efficiency that keeps bills lower, all to pay for  tax breaks for the wealthy and the well-connected.\n\nNow they want to ramp up gas exports that will make life even more  expensive. It wasn't even 1 year ago that the Department of Energy  released its study that made it clear, continuing to approve…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697080/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…how  to run for office, how to raise the funds, and you will see children of  those that have been in power following in that tradition.\n\nWe are talking about creating an on-ramp for greater inclusiveness,  for greater cohesion amongst the troops. Lastly, if it is good enough  for the war room, isn't it good enough for the boardroom and classroom?\n\nMr.…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690321/ending-of-dei-programs-through-executive-order"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…Republican' who could not bring himself to vote for Trump.\n\n``Trump argues that levying tariffs on imports will give him leverage  for trade deals and ultimately compel companies to ramp up production  in the United States. Critics say the strategy will raise costs for  consumers and destabilize the economy while leaving businesses too  uncertain about the future…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…are simply left to expire. This effectively results in  automatic denials even though no substantive decisions have been  rendered.\n\nThankfully, H.R. 677 offers a needed off-ramp for appellants that the  IBLA has left in limbo. Starting 1 year after filing the appeal, an  appellant may submit a request that requires the IBLA to decide the  case within…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691038/expedited-appeals-review-act"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…presidential inaugurations, and other major  general aviation events. However, from my conversations with Mary, her  effort to restore activity to the barren general aviation ramp at  Reagan Washington National after the terrorist attacks of 9/11 gave her  the most satisfaction. Politely but stubbornly, she refused to accept  the notion that 9/11 would…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688717/recognizing-mary-miller"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…lowering healthcare costs, as they say  they are, reopen the government, pay our troops, and stop taking food  from children. I am tired of hearing people say there is no off-ramp or  way out of the shutdown. Here it is, the way forward: Open the  government.                       National Flood Insurance Program\n\nMr. President, I spoke on this floor…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696452/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…have achieved remarkable success in the  years that have followed.\n\nThis small Tribe, numbering an estimated 500 enrolled members, raised  the private money to build an off ramp from Highway 50 to restore  access to their rancheria. They used the opportunities afforded under  the Indian Gaming Regulatory Act to construct the Red Hawk Casino. From  that…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697668/shingle-springs-band-of-miwok-indians-land-transfer-act-of-2025"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…January.\n\nAdditionally, I applaud the recent actions by the Trump  administration to dramatically scale up the management across the  National Forest System.\n\nEncouraging this ramp-up will enable the Forest Service to better  manage, support local counties and economies through increased  sustainable harvest levels, address invasive species and forest…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691520/recognition-of-may-as-wildfire-awareness-month"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…what this bill is about. This bill is about making fentanyl  analogues a schedule I or making all of them schedule I substances.\n\nThe gentleman referenced that there is no off-ramp. I would suggest  to him that the off-ramp is in the eye of the beholder.\n\nWhat we did in this bill, and I think it is something that everybody  on the floor can be proud of,…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692345/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…perhaps, there might  be fraud at issue, or at least waste or a lack of diligence in the use  of taxpayer funds.\n\nI don't think it is any coincidence that, as these efforts ramp up,  the legislature is now considering a bill, which the Governor himself  provided language for in a budget trailer bill, seeking to keep records  related to the high-speed…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699738/national-oversight-for-biological-labs"}, {"senator": "Shelley Capito", "party": "Republican", "sentence": "…standard, only 10.1 percent of 2024 new vehicle  registrations were EVs. Perhaps that is why six New York House  Democrats voted against this rule.\n\nAs States and manufacturers ramp up to meet this EV mandate, the  impacts and costs will be massive. As the National Automobile Dealers  Association wrote, the economic impact of California's regulation will…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691584/hj-res-88"}]