[{"senator": "Joe Morelle", "party": "Democrat", "sentence": "Mr. MORELLE. Mr. Speaker, I rise today to recognize and celebrate the  distinguished career of Randy Gorbman, the News Director of WXXI, who  will retire at the end of March. With over 45 years in journalism, he  is leaving an indelible mark on the industry and our community…", "date": "2025-03-18", "source_url": "https://justfacts.votesmart.org/public-statement/1688914/recognizing-randy-gorbmans-retirement"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "Mr. SHREVE. Mr. Speaker, I rise in recognition of the outstanding  leadership of Sheriff Randy Retter, who dedicated 37 years of law  enforcement experience to my district in Wayne County.\n\nOver that career, Sheriff Retter has worked tirelessly, holding  positions of…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688602/recognizing-sheriff-randy-retter"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…NEWS; Faulkner, Todd: NBC NEWS;       Faust, Margaret: NBC NEWS; Fayaz, Aleena: CNN.\n\nFayeulle, Eric: ABC NEWS; Feist, Samuel: C-SPAN; Feitel,       Roxanne: CBS NEWS; Feldman, Randy: VIEWPOINT COMMUNICATIONS;       Feng, Emily: NATIONAL PUBLIC RADIO (NPR); Feng, Qingdong: NEW       TANG DYNASTY TV; Fenton, John: FOX NEWS; Ferguson, Amber:       WASHINGTONPOST.COM;…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698150/members-entitled-to-admission-to-the-119th-congress-radio-and-television-correspondents-gallery"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…overcome those       barriers.''.\n\nMr. Speaker, I rise today in support of the Recruiting Families Using  Data Act introduced by my Ways and Means colleagues, Representatives  Randy Feenstra and Brendan Boyle. This bill would make a relatively  straightforward but needed update to current law to promote State-level  recruitment of foster care families.…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688405/recruiting-families-using-data-act-of-2025"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…there. I want to recognize all of them and thank  them so much for being here. My mom used to sit up there, and she used  to watch me every day. She used to tell me every day: Randy, God has a  plan.\n\nNow, I believe that when Donald Trump's life was saved in Butler,  Pennsylvania, it was so that he could save the world. It is an honor of  a lifetime that…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689443/together-we-will-make-america-great-again"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…local community.\n\nThis federally inspected meat processing and retail facility  developed old German recipes to create quality fresh meats and homemade  specialty products.\n\nRandy Alewel, the third-generation CEO of Alewel's Country Meats, has  expanded the facility four times now.\n\nToday, we congratulate Alewel's Meats and thank them for their  contributions…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691505/recognizing-winners-of-2025-fourth-district-congressional-speech-competition"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…America's housing supply.\n\nI look forward to continuing to work together to tackle the housing  issues facing America with creative solutions.                           Recognizing Randy Gates\n\nMr. FLOOD. Mr. Speaker, I rise today to recognize the hard work and  dedication of one of the First District's most dedicated public  servants, the city of Norfolk's…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1692993/boosting-americas-housing-supply"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…crime, protect the innocent, and  too often, make the ultimate sacrifice.\n\nDuring my time in Congress, Mississippi has lost too many heroes: In  June 2023, Madison Police Officer Randy Tyler was shot and killed while  responding to a hostage situation. In January 2024, George County  Sheriff's Deputy Jeremy Malone was shot and killed during a traffic  stop…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691032/expressing-support-for-local-law-enforcement-officers"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "Mr. LANGWORTHY. Mr. Speaker, I rise today to recognize the  extraordinary dedication and service of Randy Moje, who has devoted 50  years to serving the Town of Pendleton and the Wendelville Volunteer  Fire Company. A second-generation firefighter, Randy has held numerous  leadership…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699565/recognizing-randy-moje"}]