[{"senator": "Angie Craig", "party": "Democrat", "sentence": "…from George Washington  University before enlisting in the United States Army in 1966. After  enlisting, he completed Officer Cadet School, Army Airborne School, and  Army Ranger School before deploying to Vietnam in 1969, where he would  serve as a member of the 20th Infantry Regiment and platoon leader for  the 75th Ranger Regiment, acting as a go-between…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689645/recognizing-first-lieutenant-peter-hamlin-us-army"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize Corrine Servis  of Salida, Colorado for being named the Colorado Parks and Wildlife  Department's 2024 Park Ranger of the Year. She was chosen from over 115  rangers statewide.\n\nAs Operations Manager for the Arkansas Headwaters Recreation Area  (AHRA), Corrine helps oversee the day-to-day…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687996/recognizing-corrine-servis"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…Brooklyn, New York, but soon relocated with  his family to Point Pleasant, where he went on to attend Wesleyan  College on a full scholarship and quickly volunteered as an Army Ranger  after World War II broke out.\n\nMr. Lomell and his platoon received a pivotal assignment on D-day  that would change the course of the war forever. He and his fellow  Rangers…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693924/leonard-g-bud-lomell-va-clinic"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…of Public Safety officer  at Dallas Fort Worth International Airport. He worked his way up the  ranks to become a Highway Patrol trooper, Narcotics Service Sergeant,  Texas Ranger, and Texas Ranger supervisor. After retiring from Texas  DPS, Lane served as the Office Enforcement Captain for the Wise County  Sheriffs office and was elected Wise County…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690196/recognizing-congressional-patriot-award-recipient-sheriff-lane-akin"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…claims that Cory Mills makes  about me;\n\nWhereas Representative Cory Mills' employment application to DynCorp  International stated he served in the United States Army 75th Ranger  Regiment and attended United States Army Sniper School, claims which  are not corroborated in his military records;\n\nWhereas on February 19, 2025, Washington, D.C. Metropolitan…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697012/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…American  Heart Association's ``Go Red for Women'' campaign, ensuring critical  support for those in need. She has honored our nation's heroes by  organizing reunions for the 75th Ranger Regiment and playing a key role  in the 50th Anniversary commemoration of the end of the Vietnam war,  ensuring their sacrifices are never forgotten.\n\nBut Diane's impact is…", "date": "2025-03-21", "source_url": "https://justfacts.votesmart.org/public-statement/1688923/recognizing-diane-reitz-a-light-of-service-a-heart-of-strength-and-a-legacy-of-honor"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…Tennessee Wesleyan College,       Second Lieutenant Lomell was drafted into the Army, serving       first with the 76th (Liberty Bell) Infantry Division. When       the 2nd Ranger Battalion was formed in April 1943, Leonard       Lomell was invited to be the First Sergeant of D Company.\n\n(5) On D-Day, June 6, 1944, First Sergeant Lomell's platoon…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693923/leonard-g-bud-lomell-va-clinic"}, {"senator": "Joni Ernst", "party": "Republican", "sentence": "…assignments. He commanded and served in  positions that required courage, initiative, and an unwavering sense of  duty. Those early assignments prepared him for service in the 75th  Ranger Regiment, where he served as an operations officer and later  commanded the 4th Ranger Training Battalion, helping to shape the  Army's toughest trainees into elite warriors.…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699779/9999"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…36 years of service, he has earned numerous awards,  including the Army's Distinguished Service Medal, the Legion of Merit,  and the Combat Infantryman Badge. He is also a Ranger-qualified  soldier, holding the prestigious Ranger Tab.\n\nGeneral Rasch's leadership and mentorship will be missed by many,  especially those at Redstone Arsenal in Alabama's…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695727/congratulating-lieutenant-general-robert-a-rasch-jr"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…enforcement? My grandfather was the  chief of police of a small town in West Texas back in the 1940s. Where  is the concern for them? My great-great-grandfather was a Texas Ranger.  I was proud to be in the U.S. Attorney's Office, proud to be the first  assistant attorney general, and proud to work with law enforcement.\n\nDoes every member of law enforcement…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…through the University of Utah. He earned his master's  degree in Legislative Affairs from George Washington University in  2023.\n\nKyle was an honor graduate from the Army's Ranger School, Basic  Officer Leader's Course, and Air Assault schools. After completing  Airborne school and Master Jumpmaster school with distinction, Kyle  spent most of his 17-year…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694098/recognizing-the-service-of-lieutenant-colonel-kyle-frazer"}, {"senator": "John Carter", "party": "Republican", "sentence": "…including the Bronze Star, Legion of Merit,  Defense Meritorious Service Medal and Army Commendation Medal, among  many others. He is a graduate of the U.S. Army War College, Ranger  School, Airborne School and Pathfinder School.\n\nAfter his retirement, COL Wilson's dedication to his community did  not waiver. He now serves as the Texas State Representative…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689389/saluting-the-service-of-colonel-terry-wilson"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…concluding yet another chapter of public service.\n\nEven in retirement, Dick did not step away from giving back. He  volunteered with the U.S. Forest Service in the Bridgeport Ranger  District, helping maintain campgrounds for the benefit of residents and  visitors alike.\n\nRemarkably, even as he approaches his 100th birthday, he continues to  harvest and…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699151/misguided-policy-in-california"}, {"senator": "Jake Ellzey", "party": "Republican", "sentence": "…Wolfpack, flying the iconic F-14A and F-14D  Tomcats along with the T-2C, A-4E, and F-16N.\n\nHe completed multiple deployments aboard aircraft carriers like the  Carl Vinson, Ranger, and Enterprise.\n\nHe also graduated from Navy Fighter Weapons School Adversary Course  and earned a master of science degree in systems management from the  University of Southern…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691519/truth-telling-with-math-and-facts"}, {"senator": "Keith Self", "party": "Republican", "sentence": "…married in October of 1981 after graduation.\n\nCaptain Kevin MacGibbon served as an infantry officer stationed in  Germany during the Cold War from 1980 to 1985, earning his Ranger tab  and Airborne wings.\n\nTogether, they raised three children, who continue the proud  tradition of military service, including officers and graduates of West  Point and the…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696747/recognizing-veterans-in-texas-third-congressional-district"}]