[{"senator": "Summer Lee", "party": "Democrat", "sentence": "…All-Holiness is visiting our Nation's Capital to  receive the Templeton Prize, the most prestigious international award  in religion and science. With this honor, he joins the ranks of Mother  Teresa, Archbishop Desmond Tutu, and the Dalai Lama. The recognition  reflects not only his scholarship and spiritual leadership but his  unwavering witness for…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695564/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…workforce, make them more efficient.\n\nThe fact of the matter is, if you look at how many people are  beneficiaries today, with the baby boomer retirements that are swelling  the ranks of Social Security beneficiaries, it is 73 million Americans  now who are receiving Social Security benefits. These are people with  retirement benefits, children who have…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689134/dont-touch-social-security"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…to  fund 40 percent of the cost of IDEA. That promise was never kept. The  Federal share is now less than 12 percent.\n\nAccording to the Autism Alliance of Michigan, Michigan ranks among  the lowest in the Nation for special education outcomes, due to massive  underfunding by our Federal Government. Students with disabilities in  Michigan are twice as…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698946/protecting-education-for-children-with-disabilities"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…administration's power.\n\nI spent most of this year, including yesterday, visiting every  military installation in Maryland, meeting with and listening to  servicemembers of all ranks. It helped inform my priorities, and today,  I am proud to stand before this Chamber requesting that my colleagues  support this bill.", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697801/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Joshua Gottheimer", "party": "Democrat", "sentence": "…was very  proud to help lead with Chairman Hill and Congressman Steil. It is an  important one because one-fifth of Americans own crypto. My State, New  Jersey, proportionally ranks second nationwide in ownership of  cryptocurrency.\n\nWhile cryptocurrency has tremendous economic potential, we  desperately need rules of the road to protect consumers, ensure…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693783/digital-asset-market-clarity-act-of-2025"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…line, just like  generations before them. The least we can do is let them.\n\nWe are not made safer by sidelining qualified patriots. We are not  made stronger by narrowing the ranks of who gets to serve. We are not  made freer by telling brave Americans that their truth disqualifies  them from service.\n\nThis ban weakens our military. It betrays our values.…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693974/transgender-americans-serve-with-honor"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…Nation. He was elected twice.\n\nHe correctly identified Russia as the ``evil empire.'' Ronald Reagan  had been an actor in Hollywood and fought to remove Communists from the  ranks of the Screen Actors Guild in California, where he met his wife.  That particular  effort by Reagan took great courage because he could have been killed.  That is what it is…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687991/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…forward. From an       enlisted soldier in a segregated Army to becoming the first       Black officer to earn the rank of lieutenant general, Gregg       didn't just climb the ranks, he fundamentally redefined what       was possible.\n\nIn the unforgiving landscape of 1940's America, Gregg's       early military career could have been defined by the…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688378/recognizing-virginias-fourth-district-black-history-month-essay-contest-1st-place-high-school-winner-tanvi-palavalas"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…fabric  of American history--W.E.B. Du Bois, Martin Luther King, Jr., Arthur  Ashe, Whitney Young, and so many others whose contributions have shaped  our Nation. Today, its ranks continue to include influential leaders  such as Representatives James Clyburn, Bobby Scott, Emanuel Cleaver,  and Senator Raphael Warnock.\n\nThe Epsilon Sigma Boule of Sigma…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692968/recognizing-epsilon-sigmas-10th-anniversary"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…Reserves, making up approximately 20 percent of enlisted  personnel.\n\nAs of 2025, 21 percent of Army soldiers, Black or African American,  while represented in the enlisted ranks, are underrepresented in the  highest leadership levels, although 40 percent of the total Active-Duty  Force consists of people of color.\n\nYou have heard about Robert Smalls…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699864/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…Department, my hometown,  and he is someone I was proud to serve with in local government. Chief  Story has spent over 18 years in service to Las Cruces, rising through  the ranks from cadet to chief of police. He is a U.S. Marine Corps  veteran, a graduate of New Mexico State University, and a man deeply  rooted in the values of duty, accountability,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691300/national-police-week"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…professional studies in fire  administration in 2000 and a master's of professional studies in  strategic leadership in 2013 from the University of Memphis. She rose  through the ranks as a driver, lieutenant, battalion chief and division  chief, deputy chief of logistics and deputy director until she was  appointed Fire Chief by former Mayor Jim Strickland…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696576/congratulating-fire-chief-gina-sweat-on-her-retirement"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…Police Chief Steven  Colucci, who retired after 29 years on the force this summer.\n\nChief Colucci first put on a badge in 1996 as a part-time patrolman.  He rose through the ranks of detective, sergeant, lieutenant, and  eventually earned the top job as chief, where he served for over 3  years.\n\nChief Colucci was a mentor to many. His legacy includes…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695739/recognizing-steven-colucci"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…worst impact is felt.\n\nAt least some of my Republican colleagues recognize the pain their  refusal to negotiate has caused. Last month, four Senate Republicans-- four--broke ranks to vote with Democrats to extend the enhanced premium  tax credits and help people pay for their health insurance--four  Republicans. In the House, four House Republicans signed…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698601/healthcare"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…children arrived at school safe and ready to learn; as a mechanic at  Dawson Motor Company, tending to the machines that helped his neighbors  make a living; and later in the ranks of public safety--with the Dawson  Fire Department, the Dawson and Dougherty County police departments,  and ultimately the Terrell County Sheriffs Department. Each step in…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699826/in-memory-of-sheriff-john-bowens"}, {"senator": "Mike Simpson", "party": "Republican", "sentence": "…home state of  Idaho. Nearly two-thirds of Idaho is public land, which means a vast  majority of rural counties throughout the state depend on this funding.  In fact, Idaho ranks third nationally in SRS funding, behind only  Oregon and California.\n\nI want to thank my colleagues, especially Representative LaMalfa from  California and Representative Fulcher…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697660/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…Sergeant Jeff  William Patterson, Specialist Pascuale F. Coniglio, and Sergeant Lloyd  Lasenby each served our country with honor and unwavering commitment.\n\nThough their paths and ranks differed, all shared a common purpose,  to defend our freedoms and protect the values that define the United  States of America.\n\nTheir careers reflect decades of sacrifice…", "date": "2025-08-01", "source_url": "https://justfacts.votesmart.org/public-statement/1694579/recognizing-floridas-eighth-congressional-district-veterans"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…in  the United States Navy, as we celebrate his upcoming 100th birthday and  service to our country.\n\nPaul joined the Navy as a seaman recruit in 1943. He rose through the  ranks to become a lieutenant commander over a distinguished 30-year  career. He served on 13 Navy vessels, including the USS Tirante during  World War II, where his crew was awarded…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688742/commander-john-paul-surprenant"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…Mr. Speaker, I rise today to congratulate my constituent,  John Epps, upon his acceptance to the United States Air Force Academy.\n\nAs a future cadet, he will be joining the ranks of the world's most  fearsome fighting force, the United States Air Force.\n\nGuided by the motto ``Aim High. . . . Fly-Fight-Win'' the U.S. Air  Force is the world's preeminent…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692743/congratulating-john-epps"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…highlights the danger  of these policies, and it is a contributing factor to the rise in crime  rates which are impacting the life and safety of all Coloradans.  Colorado now ranks second in the Nation as the most dangerous State.  Without Colorado's sanctuary laws, this attack might have been  prevented.\n\nMr. Speaker, I urge my colleagues to stand in…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692192/denouncing-the-antisemitic-terrorist-attack-in-boulder-colorado"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…transparency, efficiency, and service to the people of her community.\n\nKarry Hepting began her career in St. Clair County government in the  late 1990s, rising through the ranks with a reputation for diligence  and fiscal expertise. She served in various key financial leadership  roles before being appointed County Administrator, where she became the…", "date": "2025-10-31", "source_url": "https://justfacts.votesmart.org/public-statement/1696497/commending-karry-hepting-for-her-exemplary-leadership-and-dedication-to-st-clair-county-michigan"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…come together and work across the lines. They  gave us the freedom and flexibility that we needed, but they also  provided the persuasion that is necessary both within our own ranks and  across the aisle.\n\nI thank especially the cardinals and the ranking members of the  subcommittees. The ranking member and I agree, and we have tried to  force decisionmaking…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699575/consolidated-appropriations-act-2026"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…Speaker, I rise today to congratulate my constituent,  Alexander Andrews, upon his acceptance to the United States Naval  Academy.\n\nAs a future midshipman, he will be joining the ranks of the world's  most elite naval force, guided by the motto: ``Semper Fortis''\n\nThe service and sacrifice of America's military personnel have  safeguarded our Nation since…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692734/congratulating-alexander-andrews"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…from the University of Iowa, Colonel Twedt  received his commission in 1999. This marked the beginning of a new  chapter in a remarkable career that advanced from the enlisted ranks to  the highest levels of leadership within the Iowa Air National Guard.\n\nHis service carried him to many parts of the world, including Iraq,  Afghanistan, Qatar, and Germany.…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696101/recognizing-the-service-of-colonel-trenton-n-twedt"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…his service with the United States Marine Corps, Mr. Hogan  began his career as an apprentice with the International Brotherhood of  Electrical Workers, ascending through the ranks from journeyman to  Business Manager of Local 1070. Over the course of 25 years, he  negotiated contracts that improved wages, strengthened workplace  safety, and upheld the…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696859/recognizing-thomas-hogan-on-his-induction-into-the-upper-peninsula-labor-hall-of-fame"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…Speaker, I rise today to congratulate my constituent,  Kai Agyemang, upon his acceptance to the United States Air Force  Academy.\n\nAs a future cadet, he will be joining the ranks of the world's most  fearsome fighting force, the United States Air Force.\n\nGuided by the motto ``Aim High . . . Fly-Fight-Win'' the U.S. Air  Force is the world's preeminent…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692699/congratulating-kai-agyemang"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…officer.\n\nIn 1988, Brian Estes was promoted to fire apparatus engineer and was  assigned to the Amador/El Dorado Unit. Brian climbed the ladder and was  promoted through the ranks, becoming captain in 2000 and being promoted  to battalion chief in 2005.\n\nIn the coming years, Chief Estes responded to some of California's  most challenging fires, joining…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698099/california-is-the-exact-opposite-of-a-model-of-efficiency"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…Selective Enforcement Unit, member  of the Lancaster County Special Emergency Response Team, and platoon  leader. Demonstrating an unparalleled work ethic, he rose through the  ranks, and in 2021, was appointed Captain of Patrol, the largest  division of the Lancaster City Bureau of Police.\n\nIn July 2022, Chief Mendez was sworn in as Chief of Police, becoming…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696839/congratulating-lancaster-city-police-chief-richard-mendez-on-his-retirement"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…Speaker, I rise today to congratulate my constituent,  Jack Gray, upon his acceptance to the United States Merchant Marine  Academy.\n\nAs a future midshipman, he will be joining the ranks of the world's  most elite naval force, guided by the motto: ``Acta Non Verba''\n\nThe service and sacrifice of America's military personnel have  safeguarded our Nation since…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692770/congratulating-jack-gray"}, {"senator": "Rob Wittman", "party": "Republican", "sentence": "…exam. Through disciplined study, steady composure during  examinations, and unwavering commitment of time and talent, Ms. Brobst  has achieved academic success and joined the ranks of the best and  brightest students in Tennessee and our country.\n\nIn addition to her intellectual capability, Ms. Brobst serves as a  mentor to eighth grade students at Franklin…", "date": "2026-02-20", "source_url": "https://justfacts.votesmart.org/public-statement/1700087/recognizing-madeline-brobst-receiving-a-perfect-score-on-the-act"}]