[{"senator": "Betty McCollum", "party": "Democrat", "sentence": "…pathogens and chemical threats on the  battlefield in real time; and to better extract critical minerals from  domestic mining deposits, reducing our dependence on China for rare  earth mining.\n\nThat, again, Mr. Chair, is why the National Security Commission on  Emerging Biotechnology report recommended that Congress support a  network of manufacturing…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693686/department-of-defense-appropriations-act-2026"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…who was recently fired without cause by President Trump and Elon Musk.\n\nThis engineer's job was:\n\nCo-leading a project developing software for critical       mineral and rare earth element extraction, while also playing       a lead technical role in computer modeling of desalination       and water treatment processes and supporting U.S. industrial…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688240/fired-by-president-trump"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…nations all around the world.\n\nMr. Speaker, foreign aid is not just charity. It serves our interests  as a country, as well, when we build good will with nations that have  rare earth minerals and can assist us in intelligence gathering against  terrorist organizations and our other adversaries. This is part of how  we build strong relationships around…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692267/calling-on-trump-administration-to-restore-food-aid"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…China recognizes the critical role that Africa will play in the future  and its economy and wants to exploit that, particularly as global  demand for critical minerals and rare earth elements increases. China  understands its own economy will benefit by making trade with Africa  easier, not harder, and that is why China is rooting for AGOA's demise  while…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698904/agoa-extension-act"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…the aisle should have invested more in  developing domestic sources of clean energy, invested more in domestic  manufacturing, and invested more in producing and refining rare earth  minerals, either domestically or with our close allies.\n\nWhat we have before us today is an empty messaging bill with unfunded  mandates for busywork that will not provide…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697891/electric-supply-chain-act"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…resources. Much remains  to be seen about the shape of this agreement, but we do know it will  take years, if not decades, to see substantial returns.\n\nA large number of Ukraine's rare earth deposits are actually located  in Ukrainian territory that is currently contested or occupied by  Russia. I am not sure how one is to square this agreement with  Secretary…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688332/ukraine"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…well as retains the ability to restrict American imports at will,  threatening to bring the American economy to its knees. Instead of oil,  it is critical minerals. It is rare earth elements, and it is energy  resources that are essential to the daily lives of the hardworking  Americans as well as a linchpin to the next-generation economy.\n\nThese resources,…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699990/securing-americas-critical-minerals-supply-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…walk through a concept. Back in the 1970s and 1980s, what was  the world conflict? It was for hydrocarbons, oil. The previous decade,  much of the world conflicts were for rare earth materials. I will  argue, we are in a decade right now where the conflict is for smart  people, people with skill sets. Yet the United States has barely shown  up for the…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689025/tell-the-truth-about-math"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…witnessing a true renaissance of space exploration where the future  is literally being built today.\n\nI don't know what is next. There are stories about mining asteroids  for rare-earth metals to support global industries; large commercial  space stations that can replace the ISS and host research; permanent  human habitation on the Moon laying the foundation…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687924/space-dominance"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…electricity grid.  Nickel, cobalt, and lithium go into the batteries that power our  communications devices and back up critical infrastructure such as  hospitals and data centers. Rare earth elements make possible the  cutting-edge technologies that enable our economy to innovate and our  military to keep us safe.\n\nThe global mineral race is not optional. Over…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699695/critical-mineral-dominance-act"}, {"senator": "Rob Wittman", "party": "Republican", "sentence": "…China, our primary adversary.\n\nIn recent decades, China has overtaken the United States and our  allies in production, processing, and smelting of critical minerals.  Take rare earth elements, for example. Rare earths, a type of critical  mineral, are crucial inputs into various consumer technologies,  including smartphones, laptops, batteries, and cars.…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700180/critical-minerals-are-the-backbone-of-our-country"}, {"senator": "Gary Palmer", "party": "Republican", "sentence": "…should be this, this is a fundamental principle: No  nation, let alone America, should be reliant on adversarial nations for  energy and refined materials, critical minerals, rare earth elements  that would threaten our economy and threaten our national security, but  that is where we find ourselves and where we put ourselves in terms of  access to critical…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699994/securing-americas-critical-minerals-supply-act"}, {"senator": "John James", "party": "Republican", "sentence": "…Americans are able to put more money in their  pockets.\n\nMr. Speaker, this bill could not come at a more important time.  Today, China controls more than 90 percent of global rare earth  refining capacity. Russia maintains roughly 44 percent of the world's  uranium enrichment capacity and supplies a significant share of nuclear  fuel imports to the United…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699991/securing-americas-critical-minerals-supply-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…Power Group, and the China       Africa Development Fund. The Lofdal heavy rare earths       project, partly owned by Japanese investors, produces around       2,000 tons of rare earth oxides annually and contains some of       the world's most valuable heavy rare earth metals. In       addition, Namibia is on track to become Africa's third-      largest…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698908/agoa-extension-act"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…behind China in our understanding of the best ways       to process minerals, including rare earths. Today, China has       superior technology to separate the individual rare earth       elements needed to manufacture products like magnets from       rare earth feedstocks.\n\nChina is also light years ahead of the U.S. in training       mining engineers,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699694/critical-mineral-dominance-act"}]