[{"senator": "Richard Neal", "party": "Democrat", "sentence": "…says. Let's reject what the Joint Committee on Taxation  might have to say. Of course, when the going gets tough, let's blame  the Federal Reserve Board because of interest rates.\n\nUnder this bill, here is a fact, Mr. Speaker: If you made $1 million  last year, you are going to make an additional $96,000 in the next tax- filing season. That is a fact.…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693159/one-big-beautiful-bill-act"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…branches. They  close down branches all throughout the communities. They lay off the  workers. They need less workers, and so they start laying them off.  They raise interest rates and fees on their customers.\n\nWe lose relationship banking, community involvement, and a personal  touch from your neighborhood bank. When these big bank mergers come in,…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691499/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…because this is important when we talk about Medicaid.\n\nMr. Speaker, Black Maternal Health Week begins on April 11, and  Michigan has one of the highest Black maternal mortality rates in our  Nation. Medicaid plays a critical role in supporting maternal health,  covering a significant portion of births in our country and providing  access to healthcare for…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689783/defending-social-services-and-programs"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…pool includes a lot more people who are sicker, who  have illnesses. And as the insurance companies are looking at those  projections, they are saying: Well, we got to raise rates because if we  don't, we are not going to be able to cover the people that need help.  That doesn't just affect those people who have those health insurance  costs, but all…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695663/cloture-motion"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…trouble  affording rent, home prices, food, and other goods.\n\nPutting this kind of financial pressure not just on Medicaid  recipients but on everybody else, because insurance rates and medical  costs are going to go higher, only makes that squeeze worse.\n\nTokuda).\n\nMs. SCHRIER. Mr. Speaker, I thank Representative Tokuda for bringing  up that particular…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691419/gop-tax-scam-hurts-everyone"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…the One Big Beautiful Bill Act it wants to  permanently adopt or decouple.\n\nThis disapproval resolution could harm D.C.'s credit rating, forcing  D.C. to pay higher interest rates. Rating agencies consider the  possibility of Congress meddling in D.C.'s fiscal matters as negative  for D.C.'s rating, but also consider as positive that ``Congress has…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699680/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Thomas Suozzi", "party": "Democrat", "sentence": "…in my State and in your State compared to, say,  Florida and Texas? They are higher because in New York State and in  California, we insure our children. We have the lowest rates of  uninsured children in the United States of America and the lowest rates  of uninsured adults in the United States of America, whereas Florida  and Texas have the highest…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690627/republican-tax-cuts"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…which the majority refuses to close.\n\nWe don't need more loopholes. America already stands out as an  outlier in the world among advanced industrialized countries. We have  rates of gun violence and gun homicide that are 10 or 20 times higher  than Canada, the United Kingdom, France, Germany, Israel, and Japan.  You name it, nothing comes close to us.…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691349/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Lori Trahan", "party": "Democrat", "sentence": "…pediatric care. Recently, brain cancer has passed leukemia  as the leading cause of cancer-related deaths of pediatric patients.  While the number of cases is growing, survival rates have remained  stagnant for 45 years. This needs to change.\n\nThe BRAIN Act will increase awareness for clinical trials, invest  funding into glioblastoma therapeutics and cellular…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695859/recognizing-september-as-childhood-cancer-awareness-month"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…But the side effect of the fossil fuel industry having ownership and  control over the Trump administration and all of its policies and  decisions is that people's electricity rates are going to go up. They  are already going up, and they are going to go up more.\n\nThis graph shows how voters are feeling about electricity prices, and  it says most voters…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696122/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Doris Matsui", "party": "Democrat", "sentence": "…controversial to say that air pollution is dangerous.  Every year, particulate-matter pollution kills more than 50,000  Americans. Study after study has linked air pollution to higher rates  of cancer, heart disease,  diabetes, cognitive decline, and, of course, respiratory conditions.  The evidence is overwhelming that clean air saves lives.\n\nIf my colleagues…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690489/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…supporting studies that have led to  some of the most important medical breakthroughs in history. This  funding helped develop treatments that have increased cancer survival  rates, improved heart disease prevention, and even led to vaccines that  protect us from deadly viruses. It is responsible for nearly every  major medical advancement of the last…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689421/nih-cuts-put-american-lives-at-risk"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Arkansas  System and Arkansas Children's Hospital in Little Rock. Arkansas  Children's used NIH funding to research why kids in rural, smalltown  areas were experiencing higher rates of pediatric asthma and improving  their treatment options.\n\nThey also used Arkansas NIH funding to research how to limit the  negative long-term impact of chemotherapy for…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690656/national-institutes-of-health"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…Medicaid cuts take effect and the 80  percent starts to decline as to how many are actually paying something.  They won't be able to cover their costs. When Medicaid reimbursement  rates were already too low for them to completely recover their costs,  that is going to be even harder.\n\nWhen I shared with the press what I was hearing from healthcare  providers…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695041/better-is-possible"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…air quality in Springfield, MA, the former asthma capital of  the United States; and cut another $1 million from Massachusetts  Department of Public Health to combat asthma rates in Western  Massachusetts.\n\nNo. 63, eliminated the Institute of Museum and Library Services.\n\nNo. 64, wiped the Surgeon General's advisory calling gun violence a  public health…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690442/trump-administration-first-100-days"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…that I represent a  region of the country where when we were using our coal resources,  which God has blessed us with abundantly, we had the third or fourth  lowest electric rates in the country.\n\nThen suddenly fossil fuels became a bad idea. Even natural gas, oh,  my gosh, we can't use it, and the electric rates keep going up and up  and up. My district…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694880/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…outcomes, Georgia Tech University and Emory University stood  out.\n\nGeorgia Tech is renowned for its innovation and return on investment.\n\nTheir recent graduate career placement rates consistently hover above  90 percent, which is an impressive figure.\n\nEmory has earned praise for its research programs and global health  initiatives, with a history of groundbreaking…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694832/recognizing-the-georgia-new-ivies"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…Americans need certainty that relief is on the way. Workers need  certainty that their taxes won't go up.\n\nMr. Chair, 26 million small businesses need certainty that their tax  rates won't rise to 43 percent in a few short months so that they can  focus on investing and hiring more workers.\n\nMr. Chair, 2 million family-owned farms need certainty that they…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688028/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "John Thune", "party": "Republican", "sentence": "…for American small  business owners. One of our top priorities this year is making the 2017  Tax Cuts and Jobs Act permanent.\n\nTCJA did a lot for small businesses. Lower tax rates, the 199A small  business deduction, and bonus depreciation and other investment  incentives lowered small businesses' tax burden and encouraged them to  invest in themselves,…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690626/national-small-business-week"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…because it comes from my progressive  analysis from a few years ago--is that after the 2017 tax reform, the  U.S. tax regime actually became more progressive. There were lower  rates, but it meant the top-tier  of taxpayers were paying more of the Federal budget.\n\nYou walk through saying: Okay. Can I show you? Well, you gave money  to corporations. Yes,…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688088/republican-budget"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…Speaker, 78 percent of Somali immigrants in Minnesota alone  receive welfare benefits, even after being in the United States for 10  years or longer. Somali men commit crimes at rates significantly higher  than Americans, and only about half of Somali immigrants can speak  English very well. Again, that is even after being in our country for  over a decade.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699749/somalia-immigration-moratorium"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…said we are going to just focus on doing the work of the  American people. Anybody that just wants to go root for failure and  continue to try to keep inflation high, interest rates high, and vote  ``no'' on every bill that puts power back in the pockets of families,  let them have to answer for that back home, Mr. Speaker.\n\nWe are going to keep working.…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693719/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…1926, the members of the  Kiwanis Club have been a crucial part of the community in Lock Haven.\n\nThe club has 43 members, and it works to help children by improving  literacy rates, health, and educational outcomes.\n\nLock Haven Kiwanis sponsors two Key Clubs, one at Central Mountain  High School and the other at Jersey Shore High School. It awards annual…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698269/recognizing-lock-haven-kiwanis-club-on-centennial-anniversary"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…nearly 13 times the growth rate from 2010 to  2020.''\n\nThat report goes on to project that by 2030, the average Colorado  household will spend $390 to $504 more annually due to rates outpacing  inflation and historic trends, all Colorado households combined will  spend between $970 million and $1.25 billion more in electricity costs.  The average electricity…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697881/state-planning-for-reliability-and-affordability-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…the  National Petroleum Reserve in Alaska.\n\nOur mission to responsibly develop our resources doesn't end there.  The bill also requires coal lease sales. It reduces royalty rates on  oil, gas, and coal production, and it incentivizes production, thereby  lowering energy costs and supplying our country with domestically  dependable energy.\n\nThat is just…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693178/one-big-beautiful-bill-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…9 budget  years, actually 9 years straight up, in 9 years, 30 percent of all U.S.  tax receipts go just to interest. Heaven forbid, if we had a 1 point  movement in interest rates, my math is 45 percent of all tax receipts  would go to interest.\n\nWhen you see people come behind these microphones, how many people  are saying: Hey, how do we convince the…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694131/dismantling-californias-citizens-redistricting-commission"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…the subsidies. If the subsidies went  away, what was the increase? And for the commercial insurance from my  State, what changed during that time period?\n\nFor ObamaCare, the rates had gone up 198 percent in 6 years. In  commercial insurance in my State, it has gone up 29 percent--apples-to- apples comparison.\n\nThere is a very real problem with the structure…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697814/9999"}, {"senator": "John Thune", "party": "Republican", "sentence": "…farmers, ranchers, and  small business owners can also look forward to having more breathing  room in their budgets next year. They will benefit from permanently  lower tax rates. The 199A deduction now is also made permanent. The  full expensing provision, also now permanent, makes it easier to  replace a piece of equipment and upgrade their operations.…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698212/senate-accomplishments"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…to make sure that  Americans don't face a massive tax increase.\n\nMr. Speaker, if we listen to our friends on the other side of the  aisle, they brag that they want these tax rates to go up. They want the  2017 tax cuts we passed with President Trump to expire. They don't  mince any words about that. In fact, it was even talked about during  the campaign.…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689896/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…health in this country. One of the biggest drivers of  healthcare costs and of poor public health outcomes is obesity that  begins in childhood that has continued to rise, the rates have, since  this ban on whole milk went into effect and now constitutes over 20  percent.\n\nThe second issue is trust in government. Our public health  establishment has given…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698180/whole-milk-for-healthy-kids-act-of-2025"}]