[{"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…reaching out to us. What are they  asking us? They are asking us to stop the Republican assault on our  schools, our livelihoods, and our communities.\n\nAnother constituent who reached out to me is named Kris. He is a  student at Common Ground High School. Common Ground High School is an  innovative, educational, environmental, and community-building venture,…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688499/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…48       hours [is] gone.\n\nAIDS programs to prevent new cases of HIV in high-risk       populations [is] gone\n\nPrograms for preventing child and maternal deaths that       reached 93 million women and children under 5 in 2023 and       added 6 years of life on average [has been] cut 92%.\n\nLifesaving tuberculosis programs cut [by] 56%.\n\nLifesaving water…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691139/us-global-health-programs"}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "…was  handling 1,500 cases. Each of those cases represents one veteran who  needs help. How much longer will it take veterans in need to get  answers?\n\nAnother Arizona family reached out to my office, afraid to speak out  publicly because of fear of retaliation. The husband is a doctor at the  Tucson VA. He treats patients with lung disease. But last week…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688446/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…tool for  scientific discovery and astronomy located in Chile. We are proud of  that partnership.\n\nA testament to the power of these collaborations, this observatory  just reached a major milestone with the installation of the Large  Synoptic Survey Telescope, the LSST, the largest digital camera ever  built. This facility will soon be ready to scan…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688990/doe-and-nsf-interagency-research-act"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…accessibility needs.\n\nIn the United States of America, Mr. Speaker, we want everyone to  succeed. We want everyone who can work to have access to a good job.\n\nIn 2023, Detroit reached its highest level of jobs in over 50 years,  Mr. Speaker. People were moving into the city of Detroit. It was really  something else to see that happen.\n\nThat is not to ignore…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689752/reflecting-on-americas-history"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…occurred after this series of bipartisan, commonsense  cooperation: a 4-year period of budget surpluses. During that time, our  economy grew, unemployment and inflation rates reached their lowest  levels since the 1960s. Unfortunately, that was the first time since  1969 that our country had experienced a budget surplus, and  unfortunately we have not…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695675/cloture-motion"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Mr. DURBIN.--for the Chair?\n\nThe point I am trying to make is there are areas of the city of  Chicago and I am sure in your State of Oregon where the intimidation  factor has reached a point where people are worried about literally  going to church, going to work, taking their kids to school. It is a  genuine problem.\n\nJust last week, an individual took…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696348/trump-administration"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…representing a 12.5-increase over last  year's record. Those are claims for disability and compensation.  Additionally, under the previous administration, veteran homelessness  reached record lows--a 55.6-percent reduction since 2010.\n\nThe VA also made it easier for veterans to seek mental health care  while reducing wait times for that care in new appointments.…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689835/9999"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…Trump.\n\nThe reason I say that, Senator, is, this week, all President Donald  Trump seems to care about is breaking ground on this $250 million  ballroom.\n\nSome constituents have reached out to my office and have asked: Well,  what does that mean?\n\nI have told them: Well, the President allowed a bulldozer to go and  knock down part of the White House so he…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696347/trump-administration"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…the 300 million Orthodox  Christians, including many thousands across California, from San Diego  to Eureka. More than that, since ascending to his position in 1991, he  has reached beyond Orthodox Christianity to be an inspiration to people  of all faiths around the world suffering from religious persecution,  violence, and displacement.\n\nEcumenical…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695345/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…interpreted  clinical trial participation as a permissible use of leave under FMLA.  I, along with other Congress members and leading stakeholder  organizations such as FSR, reached out to the DOL to get this  clarification. Fortunately, the DOL responded confirming that they  interpret clinical trial participation, when medically necessary, is a  permissible…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689983/recognizing-the-month-of-april-as-sarcoidosis-awareness-month"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…consecutive       years, yet, during this period, real GDP, national wealth,       and median incomes have all grown substantially. Moreover,       U.S. industrial capacity reached a historic high in August.       Even if you believe trade deficits are harmful, no serious       claim can be made that they are either catastrophic or       constitute a…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699566/opposing-the-trump-administrations-sweeping-national-tariffs"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…H.R. 6644, the Housing for the 21st  Century Act, sponsored by myself and, of course, by Representatives  Hill, Cleaver, and Flood.\n\nOur housing and homelessness crisis has reached a breaking point, as  millions of Americans each night struggle to find a decent, stable, and  affordable place to live. The struggle has real faces of our children's  teachers,…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699799/housing-for-the-21st-century-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…terminates or extends the emergency declaration.\n\nOn August 11, 2025, President Trump declared a crime emergency in  D.C. pursuant to section 740, even though violent crime reached a more  than 30-year low in D.C. in 2024 and is down 27 percent this year  compared to the same period last year. President Trump is the first  president to invoke section…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694806/introduction-of-the-district-of-columbia-police-home-rule-act"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…championship.            Honoring Richard Martin on his 700th Platelet Donation\n\nMr. SUBRAMANYAM. Mr. Speaker, I rise today to honor Richard Martin of  Sterling, Virginia, who reached a remarkable milestone last month, his  700th platelet donation. This isn't just a number. It represents lives  saved and hope restored.\n\nRichard's journey began in 1982,…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689774/congratulating-chief-keith-johnson-on-his-retirement"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…funds are then used by local governments to provide  critical support services for schools, roads, and other essential  needs.\n\nTimber harvesting in the national forest system reached its peak in  the late 1980s, then dramatically declined in the early 1990s. This  decline led to significantly reduced payments to counties, notably  impacting rural schools.…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697653/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…I have introduced the Put Your Money Where Your Mouth Is Act to  reduce congressional office budgets by $100,000, just a paltry 5.2  percent.\n\nThe American credit card has reached its limit. We must tighten our  belts. We have bills to pay and emergencies to cover. We need to be in  this together.\n\nMr. Speaker, I have one question for you and this body:…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688322/putting-your-money-where-your-mouth-is"}, {"senator": "Michael McCaul", "party": "Republican", "sentence": "…after our summit, and she passed away.\n\nAs Congresswoman Dingell mentioned, we sent videos to her to remind  her of how important she is. In her final moments on this Earth, I  reached out to her and told her that her story would not be forgotten  and that her legacy would continue to help thousands of other children.  I wanted her to know that her impact…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697274/mikaela-naylon-give-kids-a-chance-act"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…including Americans.\n\nIt is a remarkable achievement that under the leadership of President  Donald Trump and Prime Minister Benjamin Netanyahu that a ceasefire  agreement was reached and led to the release of many hostages, though  many remain.\n\nPrime Minister Netanyahu has been successful in eliminating the  leadership of Hamas and Hezbollah. He will…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688138/promoting-stability-and-prosperity"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…State is home to over 130 active volcanos, by far the largest  concentration in the United States. These aren't isolated or dormant.  Mount Spurr, just 80 miles from Anchorage, reached a yellow alert level  due to elevated seismic activity earlier this year, and it is still  listed as a very high threat by the most recent edition of the USGS  National Volcanic…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698112/southcentral-foundation-land-transfer-act-of-2025"}, {"senator": "Dan Newhouse", "party": "Republican", "sentence": "…reflect poorly on us reflect poorly on every single one of us.\n\nI would say to you, Mr. Speaker, that this is truly a wake-up call  for this Chamber. The lack of decorum has reached a new high when the  President of the United States cannot even come into our Chamber,  invited, and complete his speech without the interaction that we saw  last night.…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688496/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…I said: Good. It is good to see you.\n\nI set my six-pack of beer on the counter, and she said: Bryan, I need  to see your ID.\n\nSo just like every American, what did I do?\n\nI reached in, I grabbed my wallet, I pulled out my ID, and I handed  it over to the clerk.\n\nIn my opinion, I think it is absolutely nuts that we protect our beer  more than we protect…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692319/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "John Rutherford", "party": "Republican", "sentence": "…abroad.\n\nMr. Chair, if we want our military to continue to be the best in the  world, we cannot throw away a dime to save a nickel, especially when an  LCS vessel has only reached half of its life cycle. That is exactly  what this amendment does.\n\nThe decommissioning of the Navy's mixed fleet strategy, the LCS  vessels, is not the answer to our budget…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693680/department-of-defense-appropriations-act-2026"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…our community and  exposed the silent suffering of so many who serve behind the walls.\n\nIn the aftermath, Jon Zumkehr, an 18-year veteran of the Federal  Bureau of Prisons, reached out to Haley and invited her to Thomson. She  shared her own journey of survival and hope, speaking openly about her  struggles and recovery and the realities that far too…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699214/proud-announcements"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…within the very institutions  responsible for shaping the next generation of American patriots.\n\nThese subversive efforts are not limited to our universities. The CCP  has even reached into elementary classrooms, cultivating favorable  attitudes toward the Chinese Communist Party among young American  students.\n\nWith passage of the PROTECT Our Kids Act,…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697528/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…to which Olympic-style sport a novice could  train for later in life. After what he describes as the singular most  incredible and challenging journey of his life, Dan has reached the  pinnacle of his sport.\n\nPennsylvania's 13th Congressional District is incredibly proud to  support Dan as he represents our community and our country on the  Olympic…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699851/us-elections-are-for-us-citizens"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…of the Clerk, Office of the Sergeant at Arms, Office of  Inspector General, and the Office of the Chief Administrative Officer  of the U.S. House of Representatives who have reached the milestone of  25 years of service.\n\nThe House's most important asset is its remarkable and steadfast  employees, whose work is essential to keeping its operations running…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698362/recognizing-employees-of-the-us-house-of-representatives-who-have-reached-25-years-of-service"}, {"senator": "Steve Daines", "party": "Republican", "sentence": "…for purposes of CRA.\n\nOur practice when issuing decisions is to obtain the legal       views of the relevant agency on the subject of the       request.\\3\\ Accordingly, we reached out to Interior to obtain       the agency's legal views.\\4\\ We received Interior's response       on May 2, 2025.\\5\\                                  BACKGROUND       BLM…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693085/us-government-accountability-office-legal-opinion"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…township continues to be a center  where the community comes together. Some notable achievements of the  UASC Tryzub include in 1856 the Club's Majors' Division soccer team  reached the national championship game for the coveted US Amateur Cup.  A year later the UASC Tryzub organized a professional soccer franchise;  the Philadelphia Ukrainian Nationals,…", "date": "2025-10-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696205/recognizing-the-ukrainian-american-sport-center-tryzubs-75th-anniversary"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…this is what we were going to  hear. We were going to hear these outrageous claims that are simply not  true.\n\nThe fact is that the rhetoric coming from the other side has reached  an appalling level. We have heard the scare tactics for weeks now, but  it has taken a dark turn, Mr. Speaker, that is literally instilling  fear into the hearts of blameless,…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689862/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}]