[{"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…clear rules- based mechanisms, you can also resolve trade disputes and encourage  more investment and more trade.\n\nBusinesses need this certainty to move forward with deals, to reach  new markets, and grow. But now we are seeing a barrage of tariffs on at  least 185 countries.\n\nWe cannot have arbitrary policies create chaos and uncertainty. These  kinds…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689522/klobuchar-ms-murkowski-mr-warner-mr-mcconnell-and-mr2024"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…more people he can deport or  how much more he can enrich himself, or he can use his considerable  influence and power over Republicans, over Senate Republicans.\n\nWe saw the reach of his power today as Republicans unanimously voted  for water projects for poor people in Colorado and for a Native  American Tribe in Florida, reversed themselves and sustained…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698663/protecting-healthcare-for-millions-of-americans"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…investing in private markets, enabling a  more diverse group of people to invest responsibly, regardless of their  net worth.\n\nThis legislation creates a new path for capital to reach more hands.  In my State, the Delaware Black Chamber of Commerce has told me that  the legislation would help close the capital gap for diverse  businessowners. Small business…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693886/equal-opportunity-for-all-investors-act-of-2025"}, {"senator": "Henry Cuellar", "party": "Democrat", "sentence": "…enforcement. It also provides funding to  increase training for CBP and ICE agents for deescalation tactics.\n\nLet me say this: We did try to fight more. Unfortunately, we couldn't  reach an agreement with our Republican friends, but we did not walk  away from the work of putting the oversight into law that this bill  provides.\n\nWe also provide funding accountability…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699346/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Lauren Underwood", "party": "Democrat", "sentence": "…years. If we defeat the previous question, we  can vote on that extension today, but if Republicans let these tax  credits expire, premiums will soar. Healthcare will be out of reach for  tens of millions of Americans. Families will be forced to go uninsured  or make incredibly tough choices just to make ends meet. This is life  or death for people.\n\nHealthcare…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697855/providing-for-consideration-of-hr-promoting-efficient-review-for-modern-infrastructure-today-act-providing-for-consideration-of-hr-increasing-investor-opportunities-act-providing-for-consideration-of-hr-electric-supply-chain-act-providing-for-consideration-of-hr-state-planning-for-reliability-and-affordability-act-providing-for-consideration-of-hr-improving-interagency-coordination-for-pipeline-reviews-act-providing-for-consideration-of-s-disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-and-for-other-purposes"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…emergencies, the ability to respond  quickly and efficiently has never been more critical. Good360 and its  partners ensure that life-saving assistance and high-quality supplies  reach those who need them most.\n\nGood360 collaborates with the Federal Emergency Management Agency  (FEMA)'s Donations Unit as well as a wide range of national nonprofits  and local…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694807/recognizing-good360-in-honor-of-national-preparedness-month"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…her father's arms who has lost  more than 40 percent of her body weight. That is the condition in Gaza.\n\nLook at this photo of desperately needed aid sitting right outside  reach.\n\nWhere is our humanity? Where is our compassion? We must bring aid,  hope, and life to Gaza.", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692119/aid-to-gaza"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…were  negotiated in good faith and in the spirit of collaboration.\n\nTogether, they help expand access to capital for businesses central  to our national security, expand the reach of the SBA's Office of Rural  Affairs, hold fraudsters accountable for exploiting the pandemic relief  programs, and modernize the SBA's IT infrastructure.\n\nThese bills are…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697219/made-in-america-manufacturing-finance-act"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…premiums set to skyrocket at the end of December,  Republicans' solution is an unserious proposal that kicks millions of  Americans off their coverage, puts healthcare out of reach, and takes  away women's freedom to make their own healthcare decisions.\n\nUnder Republicans' concept of a healthcare plan, working Americans  will be forced to make tough decisions,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698314/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…food aid  for malnourished children.\n\nThis is Plumpy'Nut. It is a fortified peanut paste that has saved  millions of lives by getting safe nutrition to children in hard-to- reach places around the world. Until recently, this was being shipped  by USAID to war-torn and famine-torn areas all over the world, saving  lives under Democratic and Republican…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693021/trump-administration-needs-to-honor-its-word-on-food-aid"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…16,000 children in just the United States are diagnosed  with cancer each year.\n\nMr. Speaker, 1 in every 285 children in the U.S. will be diagnosed  with cancer before they reach 20 years of age. In fact, children  comprise as many as half of those living with rare diseases. Yet, here  is the reality for those children: Treatment options for children…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697278/mikaela-naylon-give-kids-a-chance-act"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…themselves. They showed  New York State what Rochester pride looks like.\n\nThis championship brings hope. It brings hope for the students who  have proven their dreams are within reach, for a school that showed  excellence thrives here, and for a community that has so much to be  proud of.\n\nWe thank the players, coaches, families, and fans for reminding us…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698991/congratulating-monroe-red-jackets"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…the next speech      There are no votes on any policies; nothing but moments of             silence      Children still march into the place where survival is a reach      There's been enough inaction. There's been enough waiting.             There's been enough sorrow.      Only moments of silence leaves more children who yearn for…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699130/senate-pages"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…Baldwin and Crystal Hamilton, It's About the Kids  Mentor Program began outreach in Marietta, Georgia, then following the  Hamiltons' move to Dallas in 2012, they expanded their reach to Dallas  and most recently have expanded to Shreveport in 2024. The Hamiltons  have intentionally poured  into the lives of young people by providing mentorship and developing…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692965/recognizing-the-work-of-the-its-about-the-kids-mentor-program"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…will use the Republican playbook for deciding  important Federal cases. How does it work? You claim to be neutral,  but, in fact, you contort history and overturn precedents to reach the  Republicans' preferred outcome.\n\nMs. Hermandorfer followed this playbook to a tee in the Tennessee  Attorney General's Office. She opposed LGBTQ rights and reproductive…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693415/nomination-of-whitney-d-hermandorfer"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "…been present, I would have voted YEA  on Roll Call No. 32.\n\nMs. WASSERMAN SCHULTZ. Madam Speaker, I attended an official meeting  that did not end on time and was not able to reach the House Chamber  before the first vote of the series closed. Had I been present, I would  have voted YEA Roll Call No. 32.", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699171/main-street-parity-act"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…classified form, that identifies each application to export       defense articles or defense services during the preceding       180-day period with respect to which the time to reach a       decision exceeded the applicable deadline described in       section 3(1) or 3(2).\n\n(b) Matter To Be Included.--The report required by this       section shall also…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694830/international-traffic-in-arms-regulations-licensing-reform-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…to 2026, Republicans are focused on expanding opportunity even  further, bringing jobs back home, growing domestic manufacturing, and  ensuring the American Dream is within reach for every person willing to  work hard, especially our young people.\n\nThe key to Republicans' success is that we govern by a simple  concept, common sense. It is common sense…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699063/how-republicans-have-delivered-for-americans"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…lobbyist  running around here saying: Have ever thought about doing this? What we  do is archaic.\n\nAnother example is millions of taxpayers call the IRS for help. Two- thirds don't reach anyone. Think of this. The auditors of the IRS last  year put out a report that only 31 percent of phone calls were getting  answered at the IRS.\n\nFolks are trying to fill…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689025/tell-the-truth-about-math"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "Ms. MURKOWSKI. Mr. President, I am really very glad we were able to  reach agreement today to pass these four bills by unanimous consent and  will send them to the President to be signed into law.\n\nI want to acknowledge and thank my colleague and…", "date": "2025-06-18", "source_url": "https://justfacts.votesmart.org/public-statement/1692655/salem-maritime-national-historical-park-redesignation-and-boundary-study-act"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…our GDP.\n\nThis sector is a lifeline for communities across the country,  including Oklahoma's Fifth Congressional District, and we must ensure  it has a stable framework to reach its full potential.\n\nLNG exports are also a win for the environment. A recent S&P Global  study found that U.S. LNG exports reduce global greenhouse gas  emissions by 65 million…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697092/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "…FedEx's national hub, only the second largest in the  country for FedEx. Our maiden Aer Lingus flight is a testament to the  strength of Indianapolis and reflects the global reach of our Hoosier  economy.\n\nI look forward to continuing my work to enhance IND and other  airports across Indiana's Sixth District.", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692118/welcoming-nonstop-flight-from-indianapolis-to-dublin"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…values.\n\nHis organization, Turning Point USA, is largely credited with  President Trump's unprecedented success with young voters in this past  election.\n\nBut he didn't just reach out to conservative students. He was a  champion of free speech for everybody.\n\nOver the past week, I have enjoyed seeing many, many, many videos of  Charlie's debates with…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695705/expressing-support-for-the-designation-of-october-as-the-national-day-of-remembrance-for-charlie-kirk"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…and you have  got to have enough income so they will loan you the money, so you can  comfortably pay the mortgage. The average person today, first-time home  buyer, doesn't reach those parameters until they are 40 years old--40  years old.\n\nOwning a home is the American dream, and housing has gone up  everywhere. It has gone up in my State. It has gone…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699012/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…publicly held debt. That is the debt we have to sell. When you hear  someone say $37 trillion in debt, remember, Mr. Speaker, there is a  portion of that we borrow internally. We reach in debt trust funds and  other things. We borrow the money there. We pay interest on it.\n\nPeople say: Oh, you borrowed my Social Security money. Yes, and they  got actually…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689614/its-the-math"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to pay tribute to an  extraordinary American and proud constituent, Mr. Lewis M. Unterman,  who will reach the remarkable milestone of 100 years young on November  7, 2025. Born in New York on November 7, 1925, Mr. Unterman represents  a generation of Americans whose courage, resilience,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694998/recognizing-lewis-m-unterman"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…you that the Social Security and Medicare actuary report said that  there is an 11 percent cut coming in 2033? Are we going to let that  happen? Probably not. Are we going to reach into the general fund to  pay for it? Probably. It is not in the debt projections yet. The scale  of this is off the charts.\n\nBack to the math problem. If I am making someone…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693062/stop-bathing-in-folklore-and-start-bathing-in-math"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Speaker, it is a privilege to rise today to  recognize the life and service of Mr. Henry ``Floyd'' Wells who will  celebrate his 105th birthday this month--a milestone few ever reach. I  join his family, friends, and this grateful nation in celebrating not  only the years he has lived, but the legacy he has built through  courage, service, and unwavering…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692492/recognizing-henry-floyd-wells"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…targeted, forward-looking effort to modernize outdated  rules and channel investment to where it is needed most.\n\nThe DEAL Act fundamentally strengthens the ability of capital to  reach more founders and more communities. It achieves this by allowing  larger venture funds to invest directly in smaller, regional funds, a  fund-of-funds investment.\n\nThis mechanism…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697190/developing-and-empowering-our-aspiring-leaders-act-of-2025"}, {"senator": "Mike Johnson", "party": "Republican", "sentence": "…communities. They came because of  weakness at home that fueled instability abroad, and because trillions  in reckless spending put the price of gas and groceries further out of  the reach for hardworking Americans.\n\nIt wasn't right. President Trump and our Republican majority in  Congress are fixing all of that right now. President Trump said this  week that…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693177/one-big-beautiful-bill-act"}]