[{"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…continue to tell their cherry-picked  version of American history, but they cannot erase the truth of our  diversity.\n\nAs we celebrate our Nation's 250th anniversary, we reaffirm our  commitment to upholding and fostering that diversity, to protecting the  culture of communities that were here before us, and to ensuring the  stories of our country and the…", "date": "2026-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1700306/hawaiian-language-month"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…dutifully protecting the communities they serve  and for their commitment to promoting the fair administration of  justice. As we mark this important anniversary, let us reaffirm our  commitment to a criminal justice system that is fair, effective, and  rehabilitative.", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688716/centennial-of-the-probation-act-of-1925"}, {"senator": "André Carson", "party": "Democrat", "sentence": "…Our bill restores funding to levels aligned with the Consolidated  Appropriations Act, 2024, ensuring continuity of these vital research  efforts. By doing so, we reaffirm our commitment to sustaining the  momentum of these proven programs that save lives and improve the  health outcomes of those who serve our Nation.\n\nI urge my colleagues to support…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692417/introduction-of-medical-research-for-our-troops-act"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…recognize the       importance of DRAM to our economy and our way of life. We       celebrate the achievements of those who have contributed to       its development and reaffirm our commitment to supporting the       semiconductor industry and bringing manufacturing back to       American soil.\n\nNOW, therefore, be it resolved, I, Suhas Subramanyam,…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691950/recognizing-dynamic-random-access-memory-dram-day"}, {"senator": "Derek Tran", "party": "Democrat", "sentence": "…community on the floor of the  United States House of Representatives to ensure that no communist  regime can rewrite our history.\n\nAs we mark this solemn milestone, let us reaffirm our commitment to  freedom and human rights and honor the indomitable spirit of the  Vietnamese diaspora.", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689425/reaffirm-commitment-to-freedom-during-black-april"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…die of prostate cancer than White men. I could go down the entire list  of the statistics. You heard some of them earlier today.\n\nIn the very month we are supposed to reaffirm our commitment: ``File  not found.''\n\nWell, I shouldn't be surprised because with the President's war on  diversity, equity, and inclusion and DOGE going through and finding  every…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690243/health-disparities-in-minority-communities"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…On behalf of the people of Colorado's 7th Congressional District, I  stand with the Evergreen community, offer my condolences to the victims  and their families, and reaffirm my commitment to ensuring every child  can go to school without fear for their safety.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695839/recognizing-the-evergreen-high-school-shooting"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…youth face unprecedented challenges, it is  essential that we continue to uplift and recognize their efforts. By  supporting the bill, we can take a small step to reaffirm our  commitment to supporting the youth, nurturing their potential, and  celebrating their achievements.\n\nMr. Speaker, I urge my colleagues to support the legislation, and I  reserve…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698223/congressional-award-program-reauthorization-act"}, {"senator": "Wesley Bell", "party": "Democrat", "sentence": "…to Putin and Xi Jinping. We cannot strip away resources from  allies confronting Russian aggression or leave a vacuum for our enemies  to exploit.\n\nInstead, we must reaffirm our commitment, strengthen our alliances,  and provide the tools our partners need to deter aggression and defend  democracy.\n\nI am proud to cosponsor this bipartisan amendment.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695228/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Derek Tran", "party": "Democrat", "sentence": "…sacrificed everything for freedom: The United States Army veterans  and the veterans of the former Republic of Vietnam. As we commemorate  this solemn milestone, let us reaffirm our commitment to the values  that matter most: democracy, human rights, and our unshakeable will to  be free.", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690347/recognizing-black-april"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…of National  Disability Employment Awareness Month, observed each October to honor  the invaluable contributions of people with disabilities to the  workforce and to reaffirm our commitment to expand their participation  in the future.\n\nIn 1945, the Nation first designated a national week to recognize the  contributions of people with physical disabilities.…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696023/recognizing-national-disability-employment-awareness-month"}, {"senator": "Raja Krishnamoorthi", "party": "Democrat", "sentence": "…screening tools and A1C testing  kits, to underserved communities.\n\nOn February 28, 2026, members of the Chicago Indo-US Lions Club and  their partners will gather to reaffirm their commitment to service and  to support future health and environmental initiatives across Illinois.  I am proud to recognize the Chicago Indo-US Lions Club and thank them  for…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698522/recognizing-the-chicago-indo-us-lions-club-for-its-outstanding-service-to-communities-across-illinois"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…of  those in power irresponsibly stoking division and fermenting hate  against political opponents.\n\nI also rise today to amplify the resolution's call that we all  reaffirm our commitment to a democracy where violent rhetoric and acts  like this are not tolerated.\n\nTheir call is echoed in my resolution to honor the life of Wadee  Alfayoumi, a 6-year-old…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692861/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…Ukraine's sovereignty, for our own  country's national security interests, and for the values that keep and  have kept America strong.\n\nOn this anniversary we must reaffirm our commitment that we stand  against autocrats and dictators like Russia and North Korea and that we  stand with Ukraine on the right side of history.", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687990/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…words can truly capture the weight of your loss or the sacrifice,  but please know that your loved ones will forever be honored and  remembered.\n\nMr. Speaker, let us reaffirm our commitment to those who continue to  serve. Let us support and lift up our law enforcement officers,  recognizing their dedication and ensuring they have the resources and  protection…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690845/recognizing-clay-county-police-memorial-day-and-law-enforcement-appreciation-week"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…legislation. That cooperation reflects  a shared recognition that cybersecurity cannot be approached through a  partisan lens.\n\nBy passing the PILLAR Act, the House can reaffirm its commitment to  our State, local, Tribal, and territorial partners. When our  communities are more secure, our entire Nation is more secure.\n\nI thank Congressman Ogles, again,…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696787/protecting-information-by-local-leaders-for-agency-resilience-act"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…infrastructure, foster private-sector innovation, and recognize  Alaska's strategic significance in maintaining international  leadership.\n\nLet us, in this 119th Congress, reaffirm our commitment to space  exploration, national security, and economic prosperity, ensuring that  Alaska and the United States remain the undisputed leaders in this  critical domain.", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687923/space-dominance"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…and unequivocally denounce acts of political       violence; and\n\n(6) calls on all people in the United States to unite in       this moment of pain and tragedy and reaffirm our commitment       to a safe, civil, and peaceful democracy where violent       rhetoric and acts are not tolerated.\n\nMr. Speaker, on June 14, a horrific tragedy was inflicted…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692859/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Kat Cammack", "party": "Republican", "sentence": "…championing  policies that promote freedom, opportunity, and the values that have  made this Nation great.\n\nWomen's History Month is a time to reflect on our progress and  reaffirm our commitment to ensuring that every American, regardless of  their background, has the chance to achieve their full potential. That  is the legacy that we honor, and it is the…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689364/womens-history-month"}, {"senator": "John James", "party": "Republican", "sentence": "…Speaker, 50 years ago, only one in five children with  disabilities had access to public education. Today, millions succeed  because of IDEA.\n\nWith the IDEAL Act, we reaffirm our commitment. We finish the job. We  keep moving forward, not backward.\n\nI urge my colleagues to support the IDEAL Act.", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697119/marking-a-national-milestone"}]