[{"senator": "Alex Padilla", "party": "Democrat", "sentence": "…the Senate proceeding to any  of the four nominations currently pending on the Senate's Executive  Calendar for the U.S. Environmental Protection Agency, EPA.\n\nToday, I am reaffirming those four objections and stating my intent  to object to the Senate proceeding to three additional EPA nominations,  if and when they are added to the Senate's Executive…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691866/nominations-for-the-us-environmental-protection-agency"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…mark a  dangerous turning point, signaling that restraint and verification no  longer matter.\n\nThis Special Order hour is about sounding the alarm, but it is also  about reaffirming that Congress has a responsibility to engage.  Congress has a role in oversight, a role in funding verification and  nonproliferation, and a role in insisting that arms…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699037/expiration-of-new-start"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…institutionalization by creating homes where  individuals could thrive as valued members of their neighborhoods. Over  the decades, the organization evolved, broadening its programs and  reaffirming its mission in a new name Community Residences Inc, with  the tagline, choice, respect, and independence; that reflects the core  principles guiding their work.\n\nAs the…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696045/9999"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…in service  to our Nation. Americans want to serve. We just need to provide the  opportunities and the connections for them to do so.\n\nI urge my colleagues to join us in reaffirming our national culture  of service by working with Senator Young and me to take up and pass the  Unity through Service Act.", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689050/act-back-then-senate-armed-services-committee-chairman-john-mccain"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…create  good-paying jobs and grow our local economy. This investment will  ensure that northeast Ohio remains a global leader in polymer science  and polymer engineering, reaffirming our district's legacy as the  Rubber Capital of the World.\n\nFrom sustainable tires to cutting-edge polymers, the next generation  of rubber and plastics production will…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695128/my-amendments-to-hr-3838"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…nations across the United States. Since this great  Nation's founding, the United States has signed hundreds of treaties  with Tribal nations and passed hundreds of laws reaffirming Tribal  sovereignty, self-determination, and U.S. commitments to indigenous  communities.\n\nHowever, over the last month, we have seen and heard from Tribes all  over the…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688266/sovereign-tribal-nations"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…use the       good cause exception in accordance with the requirements of       APA rather than in the more limited situations described in       the Richardson Waiver; and reaffirming that HHS will continue       to follow notice-and-comment procedures when required to do       so by APA.\n\nAn agency statement describes agency organization,       procedure,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694840/government-accountability-office-legal-opinion"}, {"senator": "Raja Krishnamoorthi", "party": "Democrat", "sentence": "…political loyalty test to receive or  keep his or her job. The Protect America's Workforce Act restores a  balanced, targeted framework that respects national security, while  reaffirming the rights of those who serve us.\n\nMr. Speaker, I urge all Members to support this legislation and  restore these protections for over 1 million Federal workers. Again,…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697979/protect-americas-workforce-act"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…manufacturing jobs lost amidst Trump  chaos. Small businesses are losing out if they don't have a lobbyist  who can go to Mar-a-Lago and bargain with Trump.\n\nThis vote is about reaffirming ``no king,'' no rule by decree from  the President when he has no authority to do this, and recognizing that  our Constitution places responsibility for trade and tariff…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699975/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…and he would have to have been tried  then in the House and the Senate on that impeachable offense.\n\nThis resolution draws a bright line. It affirms what should never  need reaffirming, that elections belong to the States, the Constitution  belongs to the people, and no President--ever--stands above either.\n\nThe Senate should speak with one voice on this…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700022/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…either party, never done.\n\nIn fact, the ruling in 1996, the one that tore down that it can only  be used for deficits in the first 10 years, that ruling was explicit in  reaffirming the second pillar of no deficits after 10 years.\n\nSo we have the plain language of the law. We have 51 years of  precedent. We have the ruling from 1996. But my colleague…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693102/one-big-beautiful-bill"}, {"senator": "Sylvia Garcia", "party": "Democrat", "sentence": "…Mustangs  earned a state championship through discipline, preparation, and belief  in one another. This victory marks the program's sixth state title and  a return to the top, reaffirming North Shore's tradition of excellence.\n\nThis championship reflects months of hard work, and a season defined  by focus and resilience. It is a testament to the commitment…", "date": "2025-12-23", "source_url": "https://justfacts.votesmart.org/public-statement/1698467/congratulating-the-galena-park-north-shore-mustangs"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…revolutionize industries across the  country and around the world.\n\nFurther, it will ensure northeast Ohio remains a global leader in  polymer science and polymer engineering, reaffirming our district's  legacy as the Rubber Capital of the World. From sustainable tires to  sustainable polymers, the next generation of rubber and plastics  production will proudly…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697853/providing-for-consideration-of-hr-promoting-efficient-review-for-modern-infrastructure-today-act-providing-for-consideration-of-hr-increasing-investor-opportunities-act-providing-for-consideration-of-hr-electric-supply-chain-act-providing-for-consideration-of-hr-state-planning-for-reliability-and-affordability-act-providing-for-consideration-of-hr-improving-interagency-coordination-for-pipeline-reviews-act-providing-for-consideration-of-s-disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-and-for-other-purposes"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…gaps that punished Delphi retirees alone. It is a narrowly tailored  fix, but one that delivers profound relief and long-overdue justice.\n\nThis legislation is also about reaffirming a core American value: If  you work hard, play by the rules, and keep your word, your company and  country should keep its word to you.\n\nThese retirees did not speculate.…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699158/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Jahana Hayes", "party": "Democrat", "sentence": "Mrs. HAYES. Mr. Speaker, last week, the President of the United  States signed an executive order to dismantle the Department of  Education.\n\nInstead of reaffirming the integrity of the Department of Education  or pursuing real plans to explain to parents how services will  continue, House Republicans are again fixated on appliances.…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689051/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers-providing-for-consideration-of-hr-defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…ready to lead. This  bill ensures our diplomats and institutions are equipped to do exactly  that.\n\nI encourage my colleagues to join me in supporting the PARTNER Act  and reaffirming America's commitment to principled and enduring  international leadership.\n\nMr. BAUMGARTNER.\n\nMr. BAUMGARTNER. I have no more speakers, Mr. Speaker, and I continue  to reserve…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694822/providing-appropriate-recognition-and-treatment-needed-to-enhance-relations-act"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…international institutions inadvertently enable authoritarian  regimes through new financing, our credibility suffers, and in this  case the Burmese people would pay the price.\n\nBy reaffirming and strengthening this pause, H.R. 4423 provides a  responsible and targeted approach that prevents international funds  from benefiting the current government and maintains…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697196/no-new-burma-funds-act"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…have a  rare moment of leverage. Iran's economy is in shambles. Its proxies are  degraded, and its air defenses have been exposed.\n\nThat is why I introduced a resolution reaffirming that preventing  Iran from obtaining nuclear weapons is a nonnegotiable American  priority. It reinforces deterrence, clarifies expectations, and ensures  congressional…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691270/preventing-iran-from-obtaining-nuclear-weapons"}, {"senator": "Laurel Lee", "party": "Republican", "sentence": "…States.\n\nThe vast majority of Americans agree that only U.S. citizens should  have the right to vote in our elections. Just last month, President  Trump took a strong stance reaffirming his commitment to the integrity  of our elections. The President's executive order will help equip  election officials with better data and more resources to administer…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1689997/safeguard-american-voter-eligibility-act"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…Hornell, New York.\n\nThis 135,000-square-foot expansion brings stainless steel railcar  body production back to the United States, strengthening our domestic  supply chain, and reaffirming Hornell's position as the Nation's  premier center for passenger train manufacturing.\n\nPlant 4 isn't just a facility. It is a symbol of what investment in  American industry…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692434/recognizing-alstoms-plant-in-hornell"}]