[{"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…Epstein files. Trump and  Republicans spent an entire year trying to block the release of the  Epstein files, only for Trump to reverse course at the  last minute when he realized the release was inevitable.\n\nTariffs and affordability: For a full year, Republicans said nothing  while Trump rolled out illegal, arbitrary, and chaotic tariffs that  raised…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697771/intervening-in-gops-relationship-with-president-trump"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "Mr. JOHNSON of Georgia. Mr. Speaker, after Donald Trump and his co- president Elon Musk took office on January 20, Democrats in Congress  realized that we were engaged in a multifaceted struggle to protect and  defend everyday Americans from the harm being inflicted by this  reckless and cruel administration.\n\nIt was…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690393/attacks-and-threats-on-democracy-and-rule-of-law"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…Speaker, recent surveys have said, 42 percent of small businesses  reported increased costs due to the administration's policies, both  tariffs and otherwise. I don't think they realized or thought through  the effect of these policies on Main Street America.\n\nOver 45 percent of Americans are employed by small business. They are  the backbone of Main Street…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691262/rising-costs-for-small-businesses"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…question. I thought when you  were going to hand me this I was going to have a Rorschach test or  something of that nature. But I knew within seconds what this was, as  soon as I realized it was machinery and not parts of a bridge. But this  is the demolition at the White House to prepare for some $300 million  ballroom. At least that is what I am nominating…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…across the country, there is a shortage of  counselors and psychologists, causing waitlists that can last for  months until the next available appointment. And what Joliet had  realized was that, if a patient couldn't see a mental health provider,  they were resorting to calling 9-1-1 and taking an ambulance to the  emergency room.\n\nIt is similar to a problem…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688330/recognizing-the-joliet-emsfire-department-program"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Break your silence. Let us  work together to ensure the chances for medical research are not  stolen. These stories should not be left unfinished, and those futures  should be realized. Let us protect medical research together. Medical  disease doesn't care what your party is. It strikes at any and every  family in America. Let's stand up for these families…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690656/national-institutes-of-health"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…celebrated the centennial of my church a  couple of years ago, and I was sitting there--I have now been a member  of the parish for 40 years--and I was looking around, and I realized  that times change and they don't.\n\nCatholic Relief Services, which is one of the largest agencies in the  United States that help settle refugees, who are legal immigrants--…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693592/rescissions-act-of-2025"}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "…something that was so fundamental to be an effective fighter pilot.\n\nAnd then after--that was early in my NASA career. Later, as I started  flying to space with these guys, I realized that Russians and the  Russian military, in particular--because that is where my experience  was with these military guys--they were motivated by different things.  It explains…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696346/trump-administration"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "…remarkable young adult and lifelong learner from Barrington,  Rhode Island.\n\nPranoy is driven by his dream of attending college, but that dream is  at great risk. It can only be realized if he receives support. Pranoy  lives with Down syndrome and uses an adaptive communication device with  specialized software to communicate, paid for by Medicaid.\n\nYet, Republicans…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691367/i-stand-with-the-disability-community"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…do that.\n\nFor posterity, I want everyone to know there was one Member of  Congress at least--I believe there are others--but there was one Member  of Congress at least that realized we should have taken action and one  did. We must take this action.\n\nIf nothing else, maybe if he sees that impeachment is imminent, maybe  he will change his behavior. I…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697060/no-mandate-to-cut-medicaid"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…technology while China can have a digital yuan and the  crypto bros can have hidden digital money.\n\nIt is not surprising that President Trump was against crypto until he  realized that he could make hundreds of millions for his campaign and  billions for his family by signing up with the crypto bros.\n\nThis is crypto week. It is also tax evaders month,…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693548/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…security staff. That is what  happens when you scoff at diplomacy--diplomacy that works, agreements  that worked--and unleash events in the world that lead to circumstances  that realized themselves this year in 2025.\n\nThe decision to strike Iran without authorization from Congress was  wrong because there wasn't the imminent threat and, thus, there was  time…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693126/motion-to-discharge-sj-res-59"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…UAE  knew that they could get our most sensitive computer chip technology if  they sent $2 billion to Donald Trump's business ventures, Qatar, having  learned that lesson, realized that if they gave a massive gift to the  President, maybe he would break with a bipartisan precedent not to send  this sensitive drone technology into the Middle East.\n\nGuess…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692362/motion-to-discharge-sj-res-54"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…then he becomes the leader of the Montgomery bus boycott. Talk  about gifted leadership.\n\nNot too far into that--they were a few days in, actually--the White  segregationists realized that this bus boycott was serious. They knew  that it was real. They started with the threats. They tried to threaten  people and threaten to take their jobs away, but they…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699200/building-a-beloved-community"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…the couriers--we call them ``Dashers''--      who provide delivery services facilitated by the DoorDash       platform.\n\nHowever, the benefits of micromobility can only be realized       if the devices used are safe. Battery fires in New York City       and across the country have made clear the danger posed by       lithium-ion batteries that do not…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690260/setting-consumer-standards-for-lithium-ion-batteries-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…appointment. As a result, providers could prescribe controlled  substances by telemedicine. This waiver was helpful for continuity of  care during the pandemic.\n\nWe also realized that many veterans received more access than before  due to this waiver. I cannot tell you how many times veterans in rural  areas have told me stories about hours they have…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695456/protecting-veteran-access-to-telemedicine-services-act-of-2025"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…about the  exciting new opportunities artificial intelligence presents to advance  education for students with special needs. However, many of those  opportunities will not be realized if Congress does not live up to its  commitment.\n\nThe IDEA Full Funding Act ensures that we meet that commitment,  gradually increasing Federal support until we reach the…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689683/supporting-our-nations-children-with-disabilities"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…not always fast or easy, but it is real, and it is  still worth fighting for.\n\nI congratulate Oslene and her family. Today, we celebrate not just a  new citizen, but a dream realized.", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691362/congratulating-oslene-ducady-on-becoming-an-american-citizen"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…Stocks  were at near highs by the end of the year, with the S&P climbing by 17  percent in 2025.\n\nAll of this occurred before the gains of the Working Families Tax Cut  Act are realized, and we are just getting started.\n\nIt will take us a while to recover from the years of inflationary  policies of the Biden administration, but the facts show that House…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698637/providing-for-consideration-of-hr-saving-homeowners-from-overregulation-with-exceptional-rinsing-act-providing-for-consideration-of-hr-affordable-housing-over-mandating-efficiency-standards-act-and-providing-for-consideration-of-hr-commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…Stefanik has no idea what it means to me to be able to  deliver this bill with my colleagues across the House floor. That game  meant more to this country than those heroes realized. Yes, it was just  a hockey game, but it was a hockey game that we needed to win at that  moment at that time for this great Nation.\n\nRemember, Mike Eruzione scored with 10…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695441/miracle-on-ice-congressional-gold-medal-act"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…it is  clown world on steroids. When I first read about this, I read it a  second time because I experienced slack-jawed astonishment. When I read  it a second time and I realized it was true, I just wanted to run away  screaming.\n\nWhat am I talking about? We have discovered--the Federal prosecutors  have discovered that for the last 5 years, there…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697400/welfare-fraud"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…and administration of the Crime       Victims Fund; and\n\n(6) the methodology used to conduct the audit to include--\n\n(A) the data sources relied upon;\n\n(B) any limitations realized during the audit; and\n\n(C) the criteria applied in evaluating the long-term       stability of the Crime Victims Fund.\n\nMr. Speaker, I am beyond proud to rise in support of…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698841/crime-victims-fund-stabilization-act-of-2025"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…about we spend  that money and invest in American healthcare? I could go on and on, but  this fear-mongering has absolutely got to stop.\n\nMrs. McCLAIN. Mr. Speaker, I never realized Elmo was more important  to my colleagues on the other side of the aisle than the American  people, but anyway.\n\nMrs. McCLAIN.  Boebert).\n\nMrs. McCLAIN. Mr. Speaker, may I…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692534/rescissions-act-of-2025"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…now supports his party reframing it as voter  suppression.\n\nThe law didn't change. Public opinion didn't change. What changed was  he and other Democrat politicians like him realized that illegal  immigrants could no longer vote to keep Democrats in office.\n\nThey oppose this bill because it chips away at their voting base,  plain and simple. For years,…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700004/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…dedicated to the memory of Congressman Doug LaMalfa from  California.\n\nAs I looked at some of my notes here of the amazing things that he  had accomplished and who he was, I realized that we are going to hear  that over the next hour.\n\nThe thing that my team and I were reflecting on earlier today, and  all I wanted to share as we kick off this memorial…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698737/9999"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…serving others. Her  mind is always on how to help--then doing exactly that. Joan is truly a  Hero Among Us. As she puts it, ``I started volunteering to help others  but never realized it would help me too. It has given me more joy than  I could ever imagine. Volunteering for hospice saved my life, and I  hope it does the same for others too.''\n\nIt is clear…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690776/recognizing-joan-moore"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…thank our House counterparts, particularly Chairman Cole,  who worked night and day with us on getting conference agreements.\n\nAnd our Democratic colleagues who courageously realized that we could  not let this shutdown continue to go on with the harmful consequences  growing worse with each passing day.\n\nI also want to particularly thank my staff. They…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696664/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…Congressional Football Game for Charity that  we do each year. I am nursing an injury from the soccer charity game. I  have turned 45 this year, and I think I have finally realized that I am  no longer 18. This has been a very important lesson to learn. I am no  longer invincible, and I need to act my age when it comes to some of  these intramural types…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691166/events-this-week"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…natural gas pipeline capacity is estimated to  save Americans $76 billion by 2040.\n\nWithout statutory reforms to section 401 of the Clean Water Act,  these savings will not be realized, our Nation will not be able to  compete with China in the intelligence race, and our electric grid will  experience serious vulnerabilities.\n\nMr. Speaker, I urge my colleagues…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698073/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Rob Wittman", "party": "Republican", "sentence": "…a spirit of 76       In these the days of our lives, there are those who to us             such warmth provide.      All in their thoughts and deeds realized.      Filling our hearts up so deep inside.      Darin was such a man of warmth and caring.       Imbuing The Sprit of 76 in all his sharing.      Born in Michigan in 1976,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690449/poem-to-honor-darin-coward"}]