[{"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…signed and voted for: ``Our position has always been  that the energy tax code should be modernized in a way that promotes  fiscal responsibility and business certainty. Fully realizing that  balance requires improvements to the House-passed version of H.R. 1. .  . . We believe the Senate now has a critical opportunity to restore  common sense and deliver…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…ripped from their homes  and the arms of their mothers and fathers. That is a war crime, and we  should not be silent on that.\n\nMadam Chair, I thank President Trump for now realizing it is  important we come to Ukraine's aid through our NATO partners.\n\nMadam Chair, I yield back the balance of my time.\n\nMs. McCOLLUM. Madam Chair, I rise in opposition to…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693686/department-of-defense-appropriations-act-2026"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…from Virginia, Jennifer McClellan, and the  Congressional Black Caucus Special Order hour.\n\nMy friends, I hope we have touched upon something. I hope we walk  away from this realizing that we collectively have the power to do  this. Put down our arms on some of this trash. We have got plenty of  stuff we can be mad about, plenty of stuff we can fight about.…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692206/raising-awareness-about-mens-health"}, {"senator": "Veronica Escobar", "party": "Democrat", "sentence": "…his sinking poll numbers are even  being reflected in the issue that many consider to be his strong suit  with the American people, which is immigration.\n\nAmericans are now realizing that Donald Trump's anti-immigrant  policies are targeting everyone in our country, including U.S.  citizens.\n\nWhen Donald Trump eliminates due process for immigrants, whether…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690507/trump-immigration-policies"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…Because kids who are using fentanyl right now don't know  that they are using this fentanyl analogue. Kids in your State and my  State think they are taking Adderall, not realizing that this has those  toxic things that can kill.\n\nHere we were in committee, with a bipartisan test strip bill, and my  colleague's partner Senator said: This makes sense…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687971/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…knows it can't come close to passing. By putting that poison abortion  pill in it, they basically are saying to Democrats: Forget about it.\n\nYou can't even come close to realizing that this might be the basis  of any compromise aside from how bad their plan is altogether.\n\nSo the bottom line: The Republicans do not have a serious plan to fix  our healthcare…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697877/healthcare"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…They were responsible for  overseeing our nuclear weapons stockpile. That set of moves caused a  massive counterintelligence disaster and a logistical train wreck.  After realizing these employees were indispensable, the Agency begged  for them to come back.\n\nBillions of dollars have been poured into this program, and what we  have seen now is the whirlwind,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691398/motion-to-discharge-s-res-195"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…American people started getting these notices in the mail that  their premiums were about to double or triple. The American people,  millions of them across the country, started realizing that there is no  way they can afford to pay that. They are going to be forced into the  choice of either dropping the insurance or take some other drastic  measure like…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697216/medical-bills-are-too-high"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…course, their members only acknowledge that after they  leave. Let's listen to Trump's former top ally, Marjorie Taylor Greene.  Here is what she said: ``I think people are realizing it was all a lie.  It was a big lie for the people. What MAGA is really serving in this  administration, who they are serving, is their big donors.''\n\nLook at who Republicans…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699593/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…They have threatened  judges. They have tried to take away some of their authority.\n\nWe saw that most recently in the big, beautiful bill, which I think  Republicans are now realizing was actually a Frankenstein-level  monstrosity of extreme provisions that many of them did not realize  were in there.\n\nOne such provision was the one in that bill that would…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692038/consequences-of-doge"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…and it is a commonsense tool and, again, the  fastest way to save taxpayers and American people money on their energy  bills.\n\nThis resolution targets these standards, not realizing that these  standards will save consumers $3.1 billion and are good for the  environment because they cut 32 million metric tons of carbon dioxide  emissions over 30 years.…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688290/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters"}, {"senator": "Hal Rogers", "party": "Republican", "sentence": "…motorcycle rides, has now grown into a  club with much greater purpose.\n\nThe Brother's Keepers Motorcycle Club focuses on safety and  motorcycle awareness nationwide. However, realizing the strength of  their unity, these firefighting bikers have turned their fun and  relaxation into fundraising and charitable work. For example, their  Kentucky chapters…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694746/tribute-in-honor-of-brothers-keepers-motorcycle-club"}, {"senator": "Michael Rulli", "party": "Republican", "sentence": "…championship game. With every strike and spare, the crowd roared,  bringing the team one step closer to immortality. After back-to-back  strikes to end the game, the team embraced, realizing their dreams and  all their hard work had come to fruition. The Penguins forever etched  themselves into history as champions.\n\nI ask my colleagues in the United States House…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690138/congratulating-the-youngstown-state-womens-bowling-team-on-winning-the-2025-ncaa-bowling-championship"}, {"senator": "Adrian Smith", "party": "Republican", "sentence": "…folks would suffer.\n\nMr. SMITH of Nebraska. Mr. Chair, the American people want us to have  a thoughtful exchange on this. Let's elevate the debate and stick to  the facts, realizing we can do well for the American people by doing  so.", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688061/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…that inhibit industrial growth.\n\n``We thank Rep. Stauber for his continued leadership and       commitment to alleviating the hurdles that keep our members       from realizing work.''                                   ____                                    LiUNA!  Statement of General President Brent Booker on Representative Stauber's…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699454/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Advantage and those actually just become, let's just say,  difficult.\n\nLet's walk through some of this. I pulled up this chart because I  haven't used it in a few months and I am realizing there are not enough  folks, particularly the staff--remember, I often do these because I am  talking to a thousand televisions around the campus. The room looks  empty,…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699257/debt-deficits-and-demographics"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…are receiving record  profits.\n\nThis incentivizes bad actors to manipulate individuals to sign up for  coverage through the ACA marketplace, oftentimes without people even  realizing that they had been enrolled.\n\nThis is government waste, fraud, and abuse at its worst, and I am  proud the House Republicans stood up against that.\n\nThe gentleman from Massachusetts…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698637/providing-for-consideration-of-hr-saving-homeowners-from-overregulation-with-exceptional-rinsing-act-providing-for-consideration-of-hr-affordable-housing-over-mandating-efficiency-standards-act-and-providing-for-consideration-of-hr-commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…and undoing the chaos at our airports.\n\nI spent the last 43 days in my district talking with these groups,  talking with SNAP, talking with Head Start, seeing their pain,  realizing it, understanding it. Some of my colleagues did the same,  but, shockingly, they are still going to vote to keep the government  closed and keep this funding from being delivered.…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696737/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…otherwise       imposing restrictions on use of surrounding lands, will       further complicate access to and use of Doyon lands, and       potentially prevent Doyon from fully realizing the economic       and other benefits that Congress intended it would enjoy as a       result of ANCSA's settlement of aboriginal land claims. In       addition, because…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694898/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Rick Crawford", "party": "Republican", "sentence": "…the other side of the aisle do recognize that we have a real  big problem with compliance burdens and the costs associated with that,  and how that prevents Americans from realizing the American Dream of  homeownership. As they raise the point of affordability, they neglect  the fact that we can address affordability by reducing costs to  potential homeowners.…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698040/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…continuous  efforts undertaken by KIC in order to open ANWR to oil and gas  operations. He highlighted the fact that pursuing oil and gas endeavors  in ANWR is essential to realizing self-determination within Kaktovik.  In testimony on Coastal Plain oil and gas development delivered to the  House Committee on Natural Resources in 2023, Mr. Lampe objected…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697739/9999"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…grew over the years. She learned to persevere and overcome  any roadblocks or plateaus she hit during training. Makennah has said  that wrestling made her a tougher person, realizing that the harder she  pushed herself, the more she grew.\n\nHaving worked with Makennah since middle school, Coach Brandon Oliver  views her as a shining role model for their…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689346/joanna-sheaf-celebrates-100th-birthday"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…last 4 years, energy policy has stalled the  necessary development of pipelines and export facilities. This has  hindered natural gas production and prevented us from fully realizing  the benefit of this critical resource.\n\nThe United States' ample energy resources are a distinct advantage  over our global competitors. We can leverage this advantage to…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696753/improving-domestic-energy-market"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…Alaska Native Corporation stakeholder in the  Central Yukon Planning Area, notes these restrictive land designations  complicate access to their lands and prevent it from realizing the  economic and other benefits that Congress intended it would enjoy as a  result of ANCSA's settlement of Alaska Native land claims. Doyon's  letter of support for the…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696162/hj-res-106"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…then bless them.\n\nThere are ways to crash the price of healthcare. We have one right  here. It is a discussion of AI. AI went through someone's medical bills  and started realizing how much mis-billing there was in there.\n\nWhat if we did something very, very simple: Legalize one of my AI  billing--we call it clean claims. Where here is the doctor's…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697873/turning-healthcare-into-financial-engineering"}]