[{"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…resource center in Pennsylvania told a  pregnant woman that she had a miscarriage, so she left. Then, later,  she was still experiencing pregnancy symptoms, so she went to a real  doctor who told her she still had a viable pregnancy.\n\nThis deception is wrong on so many levels, and these centers should  be held accountable, not receive government funds.…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699221/providing-for-consideration-of-hr-supporting-pregnant-and-parenting-women-and-families-act-providing-for-consideration-of-hr-pregnant-students-rights-act-and-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…that has over 170  signatures, nearing the 218 signatures needed to pass the House. If we  want Americans to trust us, to trust our government, we need to root  out corruption, real corruption, not imaginary voter fraud.\n\nWe have an opportunity to do that right here and right now. That is  what the Restore Trust in Government Act would do.\n\nMr. Speaker,…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699938/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…disabilities. That is whom Trump is cutting  off: kids who rely on school meals, seniors on fixed incomes, veterans  trying to get by, families trying to get groceries. That is the real- world consequence of Trump's decision.\n\nAnd while he is manufacturing two crises here at home, where is his  focus? Overseas, on a ballroom, on sending $40 billion to Argentina.…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696462/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-record-of-decision-for-the-barred-owl"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…operators, and Federal agents to dismantle criminal  networks and drug smugglers. But saber-rattling and military  escalations are a poor substitute--a poor substitute--for a real  counternarcotics strategy.\n\nI ask my colleagues: Remember what Colin Powell used to say about  military force? You break it; you own it.\n\nIt is the old Pottery Barn rule.…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696558/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…and is now approaching his fourth decade.\n\nHe holds master's degrees from Fordham University and Mercy  University, and he has shown a skill and achievement in dealing with  real-world congregational problems: substance abuse issues, conflict  resolution, homelessness, HIV and AIDS, and mental illness.\n\nComplementing his pastoral service, he serves as…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696856/9999"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…right by the Afghan allies who risked their lives to  protect American servicemembers throughout our 20-year involvement in  Afghanistan.\n\nAfter months of bipartisan work and real progress, a key provision of  my Enduring Welcome Act, legislation that passed the Foreign Affairs  Committee with strong bipartisan support, was set to be included in the…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697852/providing-for-consideration-of-hr-promoting-efficient-review-for-modern-infrastructure-today-act-providing-for-consideration-of-hr-increasing-investor-opportunities-act-providing-for-consideration-of-hr-electric-supply-chain-act-providing-for-consideration-of-hr-state-planning-for-reliability-and-affordability-act-providing-for-consideration-of-hr-improving-interagency-coordination-for-pipeline-reviews-act-providing-for-consideration-of-s-disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-and-for-other-purposes"}, {"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…reserved for a few.\n\nToday, more than 7 million students across the country rely on IDEA  for individualized education plans, services, and due process  protections. These are real students whose ability to learn,  communicate, and thrive depends on fulfilling the promises made in  Federal law.\n\nThose promises are enforced, overseen, and protected by the…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698937/protecting-education-for-children-with-disabilities"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…to  people in our States?\n\nNow, you mentioned this, but I think it is important to realize that,  with a number that big, we are not just talking about Medicaid. There  is a real risk of Medicare Part D being touched--the prescription drug  piece of that--and the Affordable Care Act, which so many people depend  on, the many, many people being cut off…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689544/h-con-res-14"}, {"senator": "Nikki Budzinski", "party": "Democrat", "sentence": "…What are their priorities?\n\nInstead of investing in cleaner facilities, healthier communities,  and good-paying jobs, they are pulling resources away from businesses  making real commitments to reinvest locally and, ultimately, from the  American people.\n\nFor this reason, at the appropriate time, I will offer a motion to  recommit this bill back to committee.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694953/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Cleo Fields", "party": "Democrat", "sentence": "…in 1868 codified equal  protection as a constitutional principle. Yet, Americans soon  discovered that simply declaring equal protection didn't automatically  create it.\n\nThe real challenge was in translating these legal guarantees into  everyday justice through their implementations. When the landmark  Supreme Court decisions in 2023 and 2024 further…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690322/ending-of-dei-programs-through-executive-order"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…able to cover employees anymore, the  manufacturer that is now paying more for health insurance than most of  their raw materials.\n\nThe impacts of this healthcare debate are real and they are  immediate.\n\nThis week Congress can solve the problem and actually make people's  lives better.\n\nEverywhere I go across New Hampshire, I hear the same thing: Money…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698696/supporting-families-and-small-businesses-struggling-to-afford-health-care"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…Mr. Speaker, I ask my colleagues to please listen to the American  West when we say that this is a crisis that will kill thousands more  until we act. Let's work together on real solutions, like investing in  wildfire preparedness and providing better pay and benefits for  wildland firefighters.\n\nThe administration's current plan of slashing volunteer…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692450/wildfires-in-oregon"}, {"senator": "Richard Neal", "party": "Democrat", "sentence": "…here is a fact, Mr. Speaker: If you made $1 million  last year, you are going to make an additional $96,000 in the next tax- filing season. That is a fact. Yet, here is the real fact and the scam  that is being presented to the American people with this legislation:  If you made under $50,000 last year, you are going to get 68 cents a  day in terms…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693159/one-big-beautiful-bill-act"}, {"senator": "Ilhan Omar", "party": "Democrat", "sentence": "…if this terror is acceptable. We cannot allow a Federal  agency--one that was created for the purpose of terrorizing--to  function as an occupying force in our communities.\n\nReal accountability starts with abolishing ICE, impeaching Kristi  Noem, and rethinking how we enforce immigration policy in this country.  We cannot stop there. We must demand that…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699668/horrific-ice-abuses"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…User facilities. In collaboration with Lawrence Berkeley  National Lab, this project will address the forthcoming increased  volume of data that will need to be processed in real time and ensure  researchers have the ability to manage large quantities of data  reliably and efficiently. As a result of lower than anticipated funding  in fiscal year 2025,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694942/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "…opposed to  government that drowns out their voices and ignores their needs.\n\nMr. Speaker, I urge my colleagues to support these measures, which  offer pragmatic solutions to real challenges in Utah, throughout the  West, and throughout the whole country.\n\nMs. MALOY. It has had a negative impact on energy production--as soon  as I get in front of a microphone,…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689196/work-highlights-of-western-caucus"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…HUD and USDA housing projects to  properly reflect their impact on the environment. This legislation  ensures that these environmental reviews are properly tailored to the  real impact of a project going forward, and this change will ensure  that more housing projects break ground on time and on budget.\n\nSection 201 includes reform of the HOME Investment…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699798/housing-for-the-21st-century-act"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…sense that their own  government was not enforcing the laws of this land.\n\nAs the new administration is moving forward to deport gang members,  wife-beaters, and others, the real constitutional crisis is finally  being defined, that America should finally stand up for the citizens  who make this country great and allow people to enter this country in…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690709/constitutional-crisis"}, {"senator": "Bernie Moreno", "party": "Republican", "sentence": "…International Trade Commission and advised on supply  chain issues. He understands, from the boardroom to the factory floor,  how trade policy impacts ``Forgotten Americans,'' real businesses, and  our long-term competitiveness against geoeconomic rivals like China.\n\nAs Under Secretary, Mr. Kimmitt will lead the International Trade  Administration and…", "date": "2025-07-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694342/confirmation-of-william-kimmitt"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…Today's smart agriculture technology, from autonomous tractors to  distributed soil sensors, rely on internet connections to share data.\n\nIn fact, farmers use information in real time to make smarter  decisions on how to optimize inputs and whether and when to plant or  harvest. When terrestrial or cellular networks are not available,  satellite broadband…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693469/precision-agriculture-satellite-connectivity-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…terms.\n\nThis chart is not going to mean much to most people back home. Mr.  Speaker, you don't even need to look at all the bars. It gets kind of  complex. I just want to be real simple. This orange line on this  chart--people in the gallery can't see it, but imagine an orange line  on an X-Y graph.\n\nThat orange line says that under the House bill on…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693110/tax-cuts-and-spending"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…Moshannon Valley are eligible to enroll in the program.\n\nThe cafe operates as a training lab, giving students the opportunity  to apply skills they have learned in the classroom to real-life  scenarios.\n\nStudents help prepare ingredients, set up workstations, and create  menus. Those who work the afternoon shift are responsible for making  and serving food.…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699201/highlighting-student-run-cafe-at-clearfield-county-career-and-technology-center"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…of remarkable service. Her work is often unseen, as she  covers the late-night shift within the Capitol complex, but I, along  with many others, agree that her work makes a real positive difference  to those of us who know her.\n\nI am so fortunate that Ms. Dickens not only helped me often, but, as  she did with many, many others, she befriended me. She…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693574/recognizing-tawanda-dickens-on-her-retirement-from-us-capitol-police"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…of how these hemp-related, THC-related  factors are packaged in candy that looks very much like candy being  consumed by kids all over the country. This is, by definition, a real  problem.\n\nChildren love candy. They can recognize well-known brands of candy  before they can even read. As you can see from the chart that we were  just talking about, the…", "date": "2025-08-01", "source_url": "https://justfacts.votesmart.org/public-statement/1694557/9999"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…small businesses at the Federal level.\n\nTo make this easier, Office of Advocacy launched the Red Tape  Hotline, a necessary resource that gives small businesses a direct,  real-time way to report burdensome regulations that are holding them  back.\n\nThe Red Tape Hotline empowers small business owners to speak up and  help Office of Advocacy hold Federal…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697346/destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…Enacting this package will represent a major milestone and show that  Congress can work together in a bipartisan manner to carry out our  article I responsibilities and deliver real results for the people that  we are honored to represent.\n\nAgain, my thanks to the leadership and to the committee members and,  of course, to our great staff. I urge my colleagues…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699433/consolidated-appropriations-act-2026"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…the Senate who now suddenly have newfound  love and respect for the 60-vote threshold.\n\nMy point being, if we are going to change the body institutionally,  then let's have a real conversation about changing the body  institutionally.\n\nClosed rules, I get it. In the majority, we are sitting here, and we  have more closed rules. Do we want open rules?…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690387/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…enables a new generation of the internet  which he terms ``Web 3.0.''\n\nTechnologies like NFTs can be used as tickets to events, identity  verification tools, and serve other real-world uses that will change  our digital economy.\n\nI urge my colleagues to see the bigger picture. The vote today is not  just about cryptocurrency as we know it. It is about…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693780/digital-asset-market-clarity-act-of-2025"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…important, and I will continue pushing for a  fiscally conservative, 5-year farm bill that reflects the priorities of  our producers who feed, fuel, and clothe the world.\n\nWhile real wages are rising and inflation is nearing a 5-year low,  there is more to be done to lower costs for families and small  businesses. Washington regulations often hit Americans…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698651/following-through-on-americans-priorities"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…For ObamaCare, the rates had gone up 198 percent in 6 years. In  commercial insurance in my State, it has gone up 29 percent--apples-to- apples comparison.\n\nThere is a very real problem with the structure of how ObamaCare  actually works. The request has been: Let's put more subsidies on top  of it, more subsidies on top of it and add billions and billions…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697814/9999"}]