[{"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…much time is  remaining.\n\nMr. CLYBURN. Mr. Speaker, I would like to mention a little bit of  history here that I think is very meaningful and helps to make the  point that I really want to make tonight.\n\nI attended public and private schools in South Carolina, grade  schools, before going off to South Carolina State, now University. When  I came to Congress,…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699863/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…all of this chaos  and confusion. The unemployment rate is up. Prices are up. If you  haven't checked your 401(k), that is down. All of this has a real-world  impact, and I really want to beseech my Republican colleagues to help  us end the madness. Find your spines to stand up to the chaos and  confusion that all of these illegal actions are having on…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688544/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…bill to deal with  those issues. We could have done that had the majority accepted my bill  that would have closed the ghost gun loophole, but they chose not to.\n\nIf they really want to make this bill do what they are claiming, then  let's write a bill that does that. This bill doesn't do it. This puts  American communities at risk.\n\nMr. Speaker, I urge…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700033/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…after you go through a big thing  together like an election. I know he helped you win your election, but  obviously, now the honeymoon has worn off.\n\nMr. Speaker, if you really want to root out waste, fraud, and abuse-- even Donald Trump is saying it. Donald Trump apparently, even this  week, asked his own staff if the entire DOGE effort was bullshit.…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692039/consequences-of-doge"}, {"senator": "Jacky Rosen", "party": "Democrat", "sentence": "…People in my State and yours are being  crushed by rising costs. Washington Republicans have the power to do a  little something about it, but they choose not to. So if you really  want to do what is right by your constituents, if you want to do right  by kitchen tables across this country, Republicans would stand up to  Trump, stand up against these reckless…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698816/9999"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…trail  that he was going to bring down costs for the American people. These  are costs at the grocery store, costs everywhere really.\n\nWe could talk about tariffs, but what I really want to focus on,  which is a big issue in my district and my State, is the cost of  housing. Young people today cannot afford to buy a house. That means  they are going to struggle…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689811/cuts-to-forest-service-endanger-millions"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…external lawyers for things like  defending against challenges relating to their illegal cancelations of  projects across the country.\n\nTo bring this bill at a time when people really want to see the  Congress work to solve problems, I think, demonstrates that Members are  out of touch. It is part of a very disturbing Republican trend, led by  the President,…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697027/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Jan Schakowsky", "party": "Democrat", "sentence": "…Gus Bilirakis and I have been working for over 2 years  now on this piece of legislation that is going to bring such delight  and security for artists and for consumers who really want to benefit  from being able to get the wonderful products that they can put their  money into so that they can have their families enjoy so many events.\n\nWe know that there…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690176/transparency-in-charges-for-key-events-ticketing-act"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…transparency around it, and limit corporate power. This is a  moment to draw a line between a political system that serves donors and  one that serves the American people. What we really want in the end is  to serve the American people.\n\nIf you just look back at the past couple of decades since Citizens  United, since 2010--in 2010, in that cycle, $3.6 billion…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699239/restoring-election-integrity"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…to censure  the gentleman from Texas.\n\nLast night, President Trump called a U.S. Senator from Massachusetts  ``Pocahontas,'' using an ethnic slur to go after her. If you really  want to proceed to censure the gentleman from Texas for talking about  no mandate to cut Medicaid, then certainly we are going to have to move  to censure the President for using…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688507/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…California that because other States are following our example, we  should lose the opportunity to decide how clean or how dirty we want  our own air to be; is that a road we really want to go down?\n\nNow, I know because I have been in the majority before, and when you  are in the majority, you feel like you will never be in the minority,  but the tables…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691582/hj-res-88"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…the  most important thing is for me? It is for Kristi Noem to get $50  million more in the budget. By the way, cut my Medicaid, groceries, and  SNAP benefits because what I really want is for this person who was  never elected to get an upgrade on a plane. Make sure that you dedicate  $50 million of taxpayer dollars so that she can have a brand-new plane…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692932/holding-power-accountable"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "…debate because I think we  would all agree on much of this stuff, including the fact that we are  now living in one of the most socialist countries on the planet.\n\nWhat I really want to do is talk about affordability, which is what  the American people care about.", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697156/denouncing-the-horrors-of-socialism"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "…million Americans with health insurance. It also provides the funding  that allows grandma to stay in an assisted living facility after she  has run out of assets.\n\nWhat I really want to do is tell you about Conner Curran. Conner is a  14-year-old from the town of Ridgefield, which I have the honor of  representing. His mom is a teacher. His dad works…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689793/defending-medicaid-for-families-like-the-currans"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…bigger than their mortgage. Do you hear what I am  saying, Republicans?\n\nFor this couple, health insurance is going to double and be bigger  than their mortgage. Is that really what you want to say to families  across our country, when we have a plan in place already that protects  them and gives them the healthcare which they need for their families?\n\nI…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697772/healthcare"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…drives innovation  and drives opportunity.\n\nWe passed a comprehensive economic plan called the working families  tax cut law. It is the central part of our economic plan. I really want  to thank Senator Mike Crapo, chairman of the Finance Committee, for his  hard work on seeing this through.\n\nRepublicans cut taxes. Every single Democrat voted to raise…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698252/nominations"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…she will stand up in favor of ICE activity that has  killed one of Minnesota's own citizens?\n\nLet me read one of the President's latest posts: ``Do the people of  Minnesota really want to live in a community . . . '' His last  sentence: ``Fear not, great people of Minnesota, the day of reckoning  and retribution is coming.''\n\nRetribution? We should not…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698949/providing-for-consideration-of-hr-protecting-prudent-investment-of-retirement-savings-act-providing-for-consideration-of-hr-flexibility-for-workers-education-act-providing-for-consideration-of-hr-empowering-employer-child-and-elder-care-solutions-act-providing-for-consideration-of-hr-tipped-employee-protection-act-and-providing-for-consideration-of-hr-save-local-business-act"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…premium payment at the time it  is due.\n\nHurricane season won't wait on those who need flood insurance.  Americans in my State and across the country need relief now. If we  really want to put Americans first, we can start by making the National  Flood Insurance Program affordable now and keeping it affordable 10 to  15 years from now. It is a pocketbook…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691629/risk-rating"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…military interventions often end up  making things worse. The road to hell is paved with good intentions.\n\nImagine the anarchy that followed our wars in the Middle East. Do we  really want to risk creating similar conditions in our own backyard?  With over 10,000 U.S. troops, 8 warships, a Virginia-class submarine,  and dozens of F-35s already in the Caribbean,…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696562/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…going to show you some of the charts and how much of this is basically  demographics. We got old. Our healthcare costs money.\n\nI am going to show you a couple charts that I really want folks to  understand. But for the American people, when you see someone from the  Democratic Party behind a microphone saying, they cut spending. It is  this off of the…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694131/dismantling-californias-citizens-redistricting-commission"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…the Parliamentarian's office. This  body worked extensively across the aisle to be able to have  conversation, talking with members of the Democratic caucus to say: Do  you really want to have, in your State, a mandate sitting there?\n\nWe don't.\n\nNot only that, what will this do to our economy across the country?  This was not about challenging the essence…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691634/congressional-review-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…to explain. The armies of  lobbyists and people in our hallways here, Mr. Speaker, what do they do  when they get to our office? They don't walk in the door and say: We  really want you to save the future generation. Spend less money.  Everyone is at our door either wanting money or wanting us to regulate  their competition. That is bureaucracies. That…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699674/united-states-fiscal-situation"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Mr. ROY. That is what we are talking about. That is what Republicans  do. They have fallen into the trap of saying: Please give me the  leather seats on the F-250, or I really want the four-wheel drive, or I  really want a good bed liner and bed cover, and, oh, give me all the  options and music and speakers and, oh, it looks great, great running…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698106/bringing-america-back-to-its-roots"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…resolution we are debating--might very  well require the removal of our Navy ships from the Caribbean that are  enforcing the quarantine. Is that what our Democratic friends really  want--to let these Chavistas in control of the interim authorities  start exporting black market oil again, to keep themselves in power,  unaccountable not only to their own…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698556/venezuela"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…minimize interest rates. If  you are financing $37 trillion and another $22 trillion, plus whatever  else we are going to stack on top of that over the next decade, you  really want the debt markets to think we are acting like adults.\n\nIn many ways, when you look at these charts and you see our interest  coverage and how fragile we are, the bond market…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689025/tell-the-truth-about-math"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…order. Ten weeks ago,  when we were doing the One Big Beautiful Bill Act, part of my deal was,  Mr. Speaker, that I don't like some of the things that are in here, but  I really want to offer legislation to pay for it because I think there  are some eloquent things we could do to offset. The deal was, okay, go  ahead. See if you can get anyone to sponsor…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694915/facts-and-math"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…socialist wing of his party.  Congresswoman Ocasio-Cortez is. She is running the show. It was no  accident the other day when the Congresswoman let it slip. She said: If  you really want to negotiate the end of this shutdown, come see me.  Come see me.\n\nAnd I think any fairminded person has to look right now and say that  the two leading Members--the quarterback--the…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695979/government-funding"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…disabled. Mr.  Speaker, when that relationship is upset by having people here  illegally, you are actually potentially putting Medicaid programs at  risk.\n\nFor those who really want to study the issue, there is a water  balloon effect here. Medicaid really doesn't reimburse doctors for  their care. It causes private healthcare costs to go up. Imagine…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690712/outrageous-government-funded-incentives"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…economy, which we  have to do.\n\nThere is a way to make this work, but unless you are willing to do  hard things--and then an army of people will show up and say: David, I  really want to balance the budget, but I need more spending because  that is how I get elected. I bring the bacon home.\n\nThat bacon is put on your own credit cards.\n\nThe highest-earning…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688651/a-real-math-problem"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…forces us in some ways to listen to each other, to maybe say: How  do we do this better, faster, cheaper? I am going to say this three or  four more times. Does the left really want to raise taxes on the  average American family by $2,853? Is that the plan here?\n\nThis says that 63 percent of those who are tax filers will see their  taxes go up. Is that…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688035/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}]