[{"senator": "Cory Booker", "party": "Democrat", "sentence": "…guys disappointed me time and time again. From the day  you arrived, I asked for jokes. I haven't asked much. I asked you guys  just to be funny, and you are not. You are really going to have to work  on that in life. I mean, you have got to have a sense of humor.\n\nBut what you lacked in humor, I was blown away by just how good  people you are, and this…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699130/senate-pages"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…today:  programs that help educate women and girls, programs that fight deadly  diseases.\n\nFood, clean water, humanitarian relief for the world's most  vulnerable--are we really going to take these things away from the most  vulnerable with it? America's credibility and global leadership must  not yield to this con.\n\nLet's get to the real waste. The real…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693706/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…their goal, clearly they ought to be able to come before Congress and  testify as to what they have found.\n\nMr. Speaker, I think every American should be aware that what is  really going on here is an attempt to get at your data and your  information and to further attempt to privatize Social Security. That  is the end goal.\n\nWhen you look at the layoffs…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695514/accountability-for-doge"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…gives us all an opportunity to sort of shore up the  healthcare network for those nearly 2 million people.\n\nI wanted to focus, in particular, on the kind of person who is really  going to be affected by the Trump rule if we do not affirmatively  embrace this Congressional Review Act resolution, and that is self- employed entrepreneurs and gig workers.…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698982/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…campaign. As you can see, there are a lot of them. This is  a big cloud of groups  whose job is to fool the American public, propagate climate denial  fraud about what is really going on, and in some cases actually work on  the political side to put dark money into our politics to corrupt  America's response to this known danger. This web of denial, of…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698993/unanimous-consent-request-s-res-550"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…those  on the other side of the aisle who are determined to stop funding the  Affordable Care Act. They say it is just a subsidy for the health  insurance companies. Really?\n\nAre you going to tell Kim that she is a health insurance company  because she is going to be paying thousands of dollars more a year for  her health insurance? Is she a health insurance…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697432/recognizing-sarah-dully-rhode-island-teacher-of-the-year"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…this debate about a shutdown,  but what we haven't been having is a negotiation about how to protect  families from a rate shot that they can't afford that means they are  really going to lose healthcare.\n\nI do urge us and I urge the President to act aggressively to resolve  this. It will help folks. Whether they are in a red State or a blue  State, whether…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696453/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…horrifying. The destruction to the well-being of the community  is inconsolable. But we can help by making that long-term recovery  process work better, and the only way it is really going to work better  is by having much more authority in local hands--the decisions that  they can make about the culvert, about the bridge, about the grade of  gravel that goes…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693402/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…and support this destruction of  what we had already voted for to put into action.\n\nMr. Speaker, I oppose this legislation, which is a trivial  distraction from what is really going on in America today. They are  dismantling the priorities of the people as passed through the people's  House and through the Senate and signed into law.\n\nMr. Speaker, I…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691349/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Tina Smith", "party": "Democrat", "sentence": "…clear: We are pro-public safety in Minnesota. We have  worked often with Federal authorities to catch bad guys and lock them  up. But we need ICE out of Minnesota. What is really going on here is a  systemic and organized campaign of fear and intimidation.\n\nThis is government police, sanctioned at the highest levels of our  government, completely unbound,…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699416/9999"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…of the cost of the program, indiscriminately with no precision in terms  of who it is affecting. It has work requirements. Are people in their  nineties in nursing homes really going to do that? Give me a break.\n\nThere are some other cuts to higher education to help pay for this.\n\nThe bottom line is, at the end of the day, we are still going to be  adding…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687944/republican-budget-betrays-middle-class"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…documents. It is for the woman in Hood River whose name no  longer matches her birth certificate after marriage and who lacks the  $160 it costs to get a passport. Are we really going to tell her she  doesn't have a right to vote?\n\nI ask my Republican colleagues to show courage in this moment for  your mothers, your daughters, and every woman in your…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689408/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…testimony tonight about what we perceive is a betrayal of our  colleagues on the other side of the aisle of the American people with  the recently passed budget resolution that really is going to provide  tax breaks to the wealthiest Americans in exchange for cuts in vital,  essential programs for working- and middle-class families.\n\nMr. Speaker, I am proud…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688133/republican-budget-betrayal"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…this bill that has to come through EPW and go through  the Congress. There is also a highway bill coming. There is a water  resources bill for the Army Corps bill. Are we really going to have to  stop work on those big bipartisan bills because we can't trust the  Trump administration to implement them according to law?\n\nSomething has to give here, and…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698558/permitting-reform"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…through 2025, not on the dairy program,  not on the Fiscal Responsibility Act--not ever. Never used in  reconciliation.\n\nSo, colleagues, two big issues are here. Are you really going to  invoke, for a bill that causes over $3 trillion in debt over 10 years  compared to current law--are you really going to invoke, for a  reconciliation bill that, for…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693102/one-big-beautiful-bill"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…to pay back those dollars plus the  interest. They are going to come to market with $400 billion, $500  billion, $600 billion of borrowing. Just be prepared for what is really  going on in the interest rate markets, the debt markets, and will we be  beyond some of the discussions of trade where countries like Japan  aren't leaking stories that they…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690748/the-math"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Social  Security, you are approaching almost $600 billion. How many of us get  behind these microphones and actually talk about things that are truly  terrifying?\n\nAre we really going to avoid dealing with our actual jobs? Are we  going to allow the doubling of senior poverty in America in 7 years at  the same time we are bankrupting much of the medical…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695567/we-are-borrowing-a-second"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…working productively in places like Iran, Cuba, and Venezuela. If we  are, let's face it, we have been an abject failure.\n\nLet me tell you where your taxpayer dollars are really going. Where  they had been going is to pressure advertisers to demonetize and  suppress American political speech by naming the ten riskiest cites to  include the New York Post,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699045/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…to exist.\n\nThe policy of the Iranian regime is to destroy the State of Israel,  purify Islam, and come after us, the infidels. Until they change that  policy, nothing is really going to work.\n\nSo what I want to hear, before we sit down and talk to the Ayatollah  and his henchmen, is that, for the first time ever since the founding  of the Iranian regime,…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693122/motion-to-discharge-sj-res-59"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "…get  noticed or hoping that there will be enough other Senators who will  say: I guess we have to take it or leave it; so let's let it all pass.\n\nThey might say: Are you really going to sink all of this important  work just for one section of this much larger bill that you disagree  with?\n\nWell, look, taken to its logical conclusion and repeated, over…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698423/unanimous-consent-requests-the-calendar"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…good work of our Secretary of  the Treasury, we will actually put it in order.\n\nMr. Speaker, I thank you for the opportunity to address the American  public about what is really going on in our economy.", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691176/president-trumps-delivery-on-his-promises"}, {"senator": "Thomas Massie", "party": "Republican", "sentence": "…side of the road, how do you  appeal that? Do you press a button on the dashboard? Do you start  talking to an AI?\n\nWhat if it really was somebody who was drunk? Are you really going to  send a police car after this disabled vehicle? Do we have the resources  to do that? There are going to be so many false positives.\n\nThe technology is unworkable, which…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699290/amendment-no-1-offered-by-mr-massie"}]