[{"senator": "Adam Smith", "party": "Democrat", "sentence": "…debate through a series of amendments on  the floor, and they did not. I am troubled by that. We will see how the  amendment process goes.\n\nAgain, beneath all of that is a really good bill that a lot of very  good people worked very hard to produce. I hope that when we get  through the end of this process and actually pass the bill and send it  off to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695253/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…by addison norris       In the beginning,      God created the heavens and the earth.      He looked upon His work and said,      It is good.      But is it really good      when we're facing wars,      when families are waiting      for unopened doors?      Is it really good      when it doesn't go my way,      when I've lost my job,…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699130/senate-pages"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "Mr. Speaker, I thank the gentlewoman from Missouri (Mrs. Wagner) so  much for this piece of legislation. I thank her for all the really good  hard work that she has done in rallying the troops to do the right  thing. I thank her very much for taking care of our victims and making  sure they have these provisions.…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698840/crime-victims-fund-stabilization-act-of-2025"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…me talk about my cows in my fields.  He said, Okay, you go ahead, but I am going to go first.\n\nYou shared your knowledge with me and with others. You were good. You  were really good at the work you did for your people. You were a  quality Representative.\n\nI miss you. I miss the work that we did together on the Sacramento  River Valley and all the issues…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698742/9999"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…against  the bill.\n\nYet, he voted for it, and so did the Freedom Caucus. I think every  Republican but one voted for the bill.\n\nMr. Speaker, here is the deal: Republicans are really good about  making statements and speeches, but that is about it. Yet, where is  their backbone? If my Republican colleagues believe some of the stuff  is bad, why didn't the…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691944/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…tariffs and the way they are being implemented  without any congressional engagement whatsoever, we are turning our  economy from one where it is based on a good product, really good  service, where you compete in the marketplace and if your product is  better and your service is better, you succeed, to an economy that is  more based on access. Do you…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690522/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…first 5  years of its history and then make it better. Those discussions had  just started when I was in Ontario about a month and a half ago. The  Canadian Government felt really good about sitting around the table  with the United States and Mexico and making this deal better. Donald  Trump has stopped the discussions because a TV ad hurt his feelings.…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696447/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…about their motives and their bias and  inability to faithfully execute the laws?\n\nIt tells me that there is really no point in passing a bipartisan  bill, which would be a really good one, because we wouldn't get the  benefit of the bill. They would just continue with illegal acts and  false statements--anything to help fossil fuel.\n\nIt is not just Revolution…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698558/permitting-reform"}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "…their system and their  economy.\n\nI bring this up because I often feel that we are unique as a service,  as a fighting force in the world. Our allies--some of them are really,  really good. But there is nothing that I found in my experience in my  career--I am 61 years old--that is as professional as U.S.  servicemembers and as motivated by mission and…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696346/trump-administration"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…chase in the middle of the District of Columbia, even during the middle  of the day is almost, by definition, dangerous almost under any  circumstances, so you better have a really good reason to engage in a  pursuit like that.\n\nThat is not the balance that is drawn by this bill. That is not the  balance that was drawn by the people of the District of Columbia.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695639/district-of-columbia-policing-protection-act"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…a contract employee and having done all of  that before I came here, I am so grateful every time I come across an  individual in the customer service industry who has really done a good  job. Paying them tips is the least that we can do to make sure that  they are honored for their service.", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698963/tipped-employee-protection-act"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…just had two more people shot by an ICE agent in Portland, Oregon.\n\nThese are dark times, and it is really easy to get bogged down in the  negative, but today, something really good happened. Mr. Speaker,  today, 17 Republicans joined Democrats to override the Speaker's  attempt to stifle the will of this body to vote to extend subsidies for  the Affordable…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698665/protecting-healthcare-for-millions-of-americans"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…other day said he actually doesn't  think he wants to call the bill the One Big Beautiful Bill Act anymore.  As he said, it was good for getting it approved, but it is not really  good for explaining it to people. People have figured out enough in  terms of deficit impact, taking away people's health insurance  coverage, and the impact on services, particularly…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694776/congress-long-to-do-list"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…could be hundreds of thousands of dollars the taxpayers really  invested in supporting a person who has become a scientist, helping us  on very important research that is really good for the American people.\n\nBoom. They go to work, or they are at home. They get an email, and  they say: Don't show up for work; you are fired.\n\nThere is a certain cruelty…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688257/department-of-health-and-human-services"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…parties, or at any other private or public space across this  country than gun violence.\n\nWe took a very important step with the Bipartisan Safer Communities  Act. We did really good work, not just for Democratic children but for  Republican children, as well, but we must do more to keep our children  safe.\n\nShootings are the leading cause of death for…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697534/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…that cover every dime of the borrowing.  None of them cause burning and slashing and gnashing of teeth and the  whining that happens around here. It turns out they are all really good  policy. This is the constant argument I keep trying to make to our  brothers and sisters here, we are going to have to do policy, and  policy is hard. It is complex. There…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692327/math-always-wins"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…chuck if a Fedorchak could chuck wood?''\n\nIt always made me laugh. I also learned quickly that not only was he  fun but he was thoughtful, he was pragmatic, and he was a really,  really good thinker. I turned to him on issues that I found to be  difficult. I wanted to get his thoughts on them.\n\nHe was a strong conservative. He was warm, kind, and principled.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698669/protecting-healthcare-for-millions-of-americans"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…week leaves a void not only in this  Chamber but in the hearts of all who knew him. To a person, a testament  from everyone who has crossed his path would be this: What a really  good man.\n\nAs a Member of the Western Caucus, I witnessed firsthand Doug's  fierce advocacy for farmers, ranchers, and hardworking families who  form the backbone of our Nation.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698718/9999"}, {"senator": "Ron Johnson", "party": "Republican", "sentence": "…weeks later, and they want to redline the bill. Well,  in that 2 weeks, we have had our bill examined exhaustively by our  leadership, by OMB, by the unions. Our bill is in a really good place  right now. We tried to think of everything. No Federal employee would  be excluded from this.\n\nThe Senator from Michigan says my bill allows the President to pick…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696605/9999"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…This is serious. This  isn't a game. We right now are borrowing about $6.5 billion every  single day for this fiscal year. We are down to the last 3 weeks, so  you have a really good sense of what we borrowed.\n\nIn 9 budget years, it is well over $10 billion a day. Yet, a couple  hours ago, I offered an amendment that basically said there is all  these…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694915/facts-and-math"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…people are  business models. It is cruel to say that. It is just really cruel to  say that. We have to change it. The morality of cures, the morality  of--and it is also really good economics.\n\nMr. Speaker, I have two last boards. I want to make a point. We  updated this as of a couple of hours ago. We are actually remarkably  lucky. In other industrialized…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695567/we-are-borrowing-a-second"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…this is definitely needed.\n\nMr. BILIRAKIS. Mr. Speaker, I commend Representative Fulcher, the  vice chairman of the subcommittee, and also Representative Mouton for  this really good bill.\n\nMr. Speaker, I urge unanimous passage, and I yield back the balance  of my time.\n\nMr. BILIRAKIS. Mr. Speaker, on that I demand the yeas and nays.\n\nThe yeas and nays…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690179/informing-consumers-about-smart-devices-act"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…comfortable, he can remove one  general and bring in another one. That is what has happened here.\n\nWe should confirm General Caine immediately. I think he is going to  do a really, really good job. As a matter of fact, I have interviewed,  sat down with, served under hundreds of flag officers. General Caine is  one of the most impressive I have ever met. So…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690106/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…enough water in there to actually get my clothes clean on  one time, so I supplement it with the backyard hose and add more water  to my washing machine.\n\nYeah, that is really, really good policy.\n\nI remember an old DOE energy standard from a few years ago that one  of my constituents told me about related to the washing machine. I just  told you that…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688547/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…it always does.\n\nMr. Speaker, thank you for tolerating a bit of my rant, but it is my  way of just saying how disappointed I am with even my friends. I have a  couple of really good friends who are over in the Senate, and they were  just desperate to avoid doing what was difficult, so they threw it in  our lap.\n\nMr. Speaker, we as House Members get…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689614/its-the-math"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…to leverage--leverage--Alaska Native Vietnam vets, heroes, to get more  stuff. I don't know. I want to hear from Senator Heinrich.\n\nYou know, the Dems are starting to get really good--it is a pattern-- at leveraging really good Americans--air traffic controllers for the  last 40 days--to get other stuff. Now it looks like they are going to  leverage…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696959/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-extension-of-deadlines-in-standards-of-performance-for-new-reconstructed-and-modified-sources-and-emissions-guidelines-for-existing-sources-oil-and-natural-gas-sector-climate"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…what we are not going to do: We are not succumbing no  matter how long it takes--if it is one day. Let's just say my Democrat  friends come back from Munich and they feel really good about  themselves because a bunch of European elites has told them all the  things they want to hear and vice versa. We are not coming back here  and going to make it harder…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700065/9999"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…restrictions on AI chips. Now, this is a good thing; however, export  controls, while an effective tool, are not simple or straightforward,  and the Chinese Government is really good--like the Russians--at  circumventing sanctions and different restrictions--in this case, on  cutting-edge technology.\n\nThe United States must take care to ensure that our…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697555/china"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "Mr. SULLIVAN. Mr. President, I want to compliment my friend and  colleague from Oklahoma. The One Big Beautiful Bill does have a lot of  really  good stuff in it. I think, to be perfectly blunt, my State probably has  more good stuff in it than anyone. So I am doing what Senator Lankford  is doing, primarily back home…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693700/one-big-beautiful-bill-act"}, {"senator": "David Kustoff", "party": "Republican", "sentence": "…World War II Memorial and our Nation.\n\nWith his passing, we honor and celebrate a lifetime of inspiring  service and leadership. We celebrate a marine, a Memphian, and a really  good man.\n\nRoberta and I mourn with Diane and the entire Smith family. Our  Nation lost an innovator, a job creator, a trailblazer, and a leader.  We are all better off for the…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692825/remarkable-life-and-legacy-of-frederick-w-smith"}]