[{"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "It was an American moment, and our reason for  going to Normandy was to honor those young men who saved democracy.", "title": "Providing for Congressional Disapproval Under Chapter 8 of Title United States Code, of the Rule Submitted By the Bureau of Land Management Relating to ``Central Yukon Record of Decision and Approved Resource Management Plan''", "date": "2025-10-09"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "There is no reason to believe in any way that the Canadians are  looking to work with us to build a pipeline and export more fossil  fuels to the United States.", "title": "Promoting Cross-Border Energy Infrastructure Act", "date": null}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "I think for some reason we  have forgotten the fact that we spent 80 years defending an  international order that our grandfathers fought for and died on  European battlefields for.", "title": "Three-Year Anniversary of Russia's Brutal Attack on Ukraine", "date": "2025-02-25"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "Speaker, for that reason, I oppose the bill and urge my  colleagues to do the same.", "title": "Tipped Employee Protection Act", "date": "2026-01-13"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "It is called the crown jewel of our public lands, and it is  called that for a reason.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the Bureau of Land Management Relating to ``Buffalo Field Office Record of Decision and Approved Resource Management Plan Amendment''", "date": "2025-11-18"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "That means  students won't have to delay their education for no reason or hit an  arbitrary completed credit hour requirement if they are accepted into  the program.", "title": "Edith Nourse Rogers Stem Scholarship Opportunity Act", "date": null}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "Because Donald Trump, for whatever  reason, doesn't want these records to get out anymore.", "title": "Relating to Consideration of the Senate Amendment to H.R. Rescissions Act of 2025", "date": "2025-07-17"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "What their real reasons are, I can't say.", "title": "Providing for Congressional Disapproval Under Chapter 8 of Title United States Code, of the Rule Submitted By the Bureau of Land Management Relating to ``North Dakota Field Office Record of Decision and Approved Resource Management Plan''", "date": "2025-10-08"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "And the growth of our immigrant populations with their strength and  their innovation and their culture has been a huge part of the reason  that Virginia has gone from back of the pack economically to front of  the pack economically.", "title": "-9999", "date": "2026-02-03"}, {"senator": "Andrea Salinas", "party": "Democrat", "sentence": "He had no  reason to lie.", "title": "Fighting Dhs Immigration Raids", "date": "2025-12-03"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "For that reason, Madam Speaker, I urge my colleagues to vote ``no''  on this resolution, and I yield back the balance of my time.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the Department of Energy Relating to ``Energy Conservation Program: Energy Conservation Standards for Consumer Gas-Fired Instantaneous Water Heaters''", "date": "2025-02-27"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "But apart from scholars, members and the occasional       enthusiast, almost no one sees this treasure, which is one       reason its guardian, the American Numismatic Society, is       leaving the city where it was founded in the mid-19th       century--and moving to Toledo, Ohio.", "title": "Priceless Coin Collection Heads to the Toledo Museum of Art", "date": "2025-12-01"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "But the real reason--it  is so painfully obvious--this was always about the oil.", "title": "-9999", "date": "2026-01-08"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "This work is already underway, as we speak, but let's address the  erroneous reasons that it was vetoed.", "title": "Miccosukee Reserved Area Amendments Act--Veto Message From the President of the United States", "date": "2026-01-08"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "Fine, drugs were the reason we were talking about these strikes.", "title": "Providing for Congressional Disapproval Under Chapter 8 of Title United States Code, of the Rule Submitted By the Environmental Protection Agency Relating to ``Air Plan Approval; South Dakota;", "date": "2026-01-07"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "This year, Pennsylvania has special reason to celebrate.", "title": "Recognizing Ahslie Crosson During National Teacher Appreciation Week", "date": "2025-05-08"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "So there is really no reason to delay this any longer.", "title": "Authorizing Representation By the Senate Legal Counsel in the Case of Desmond Bellard V. Ronald Wyden, U.S. Senator", "date": "2025-04-10"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "This plan, the so- called Affordable Care Act, is a major reason that your insurance  premiums have gone up and have done so repeatedly.", "title": "Providing for Consideration of H.R. Lower Health Care Premiums for All Americans Act; Providing for Consideration of H.R. Do No Harm in Medicaid Act; Providing for Consideration of H.R. Protect Children's Innocence Act; and Relating to Consideration of H.R. Standardizing Permitting and Expediting Economic Development Act", "date": "2025-12-17"}, {"senator": "Bill Hagerty", "party": "Republican", "sentence": "For this reason, I urge my  colleagues to oppose S.J.", "title": "Motion to Discharge--S.J. Res. 59", "date": "2025-06-27"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "As legal scholars  have pointed out, there is reason to believe that this bill--this  IEEPA, this emergency bill--does not authorize the President to impose  tariffs for at least two reasons.", "title": "Terminating the National Emergency Declared to Impose Duties on Articles Imported From Canada", "date": "2025-04-02"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "1491) to amend the Internal Revenue Code of 1986 to  make the postponement of certain deadlines by reason of disasters  applicable to the limitation on credit or refund, and to take  postponements into account for purposes of sending collection notices,  as amended.", "title": "Disaster Related Extension of Deadlines Act", "date": "2025-03-31"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "It is the entire reason that this building exists, so  that we can talk out our differences.", "title": "Beating Heart of Democracy is Freedom of Speech", "date": null}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "What this does  is prevent a President from suspending LNG gas exports for some reason  at a time when our friends in Europe are literally begging for it, and  I know our friends from Japan and Korea are asking for it.", "title": "Unlocking Our Domestic Lng Potential Act of 2025", "date": "2025-11-20"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "Every thug and despot around the world has new reason to fear the  ancient warning: sic semper tyrannis.", "title": "Lessons From Caracas", "date": "2026-01-08"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "The reason it doesn't say ``taser'' in the language is because who  knows what next year's innovation is going to be.", "title": "Law-Enforcement Innovate to De-Escalate Act", "date": "2026-02-12"}, {"senator": "Trent Kelly", "party": "Republican", "sentence": "These businesses are dying because, one regulation at a time, for no  reason other than to create jobs for some bureaucracy, we continue to  have those.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the Environmental Protection Agency Relating to ``National Emission Standards for Hazardous Air Pollutants: Rubber Tire Manufacturing''", "date": "2025-03-05"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "The reason that I support this resolution is--and I would note that  my colleagues on the other side of the aisle could have tabled this  resolution.", "title": "Notice of Intention to Offer Resolution Raising A Question of the Privileges of the House", "date": "2025-11-18"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "What my Democratic colleagues won't tell you is that our clean  natural gas is a major reason why the U.S.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the Environmental Protection Agency Relating to ``Waste Emissions Charge for Petroleum and Natural Gas Systems: Procedures for Facilitating Compliance, Including Netting and Exemptions''", "date": "2025-02-26"}]