[{"senator": "Rob Menendez", "party": "Democrat", "sentence": "…talking  about showerheads.\n\nMr. Speaker, I urge my Republican colleagues to get serious and focus  on the priorities our constituents sent us here to address. For all  these reasons and so many more, I strongly oppose this bill.", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698561/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…to try to get them a doctor. If you have a sick child, you are going to  try to get them to the hospital, whether they are covered or whether  they are not.\n\nAnd one of the reasons why our healthcare system is so expensive is  that people don't have primary care; that is to say, they don't have  the ability to go in to see a doctor in a timely way, just…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689543/h-con-res-14"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…secure it--is a storied  bedrock of our American history.\n\nAnd, now, again--as there has been throughout our history--there are  efforts to suppress that right for political reasons, for political  gain. That is what we have in the SAVE Act, an effort to erect  obstacles and to require documentation that, very simply, Americans-- many of them--don't have.…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690539/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…deceived. Communities in northwest Indiana are struggling  with increasing costs, and they know that the Republican bill is unfair  toward working families.\n\nIt is one of the many reasons that I opposed this unpopular  legislation and why I will continue to fight to make the current tax  benefits for working families permanent.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695037/temporary-benefits-for-working-families"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…Speaker, one could ask, as I suspect you would: What is the  gentleman from Colorado's suggestion? Lucky for you, Mr. Speaker, I  have one, because we know that one of the reasons that prices are going  up across the board in the United States are tariffs. It is this  President's reckless policies with respect to tariffs. We have some  solutions in…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699903/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…emergencies, natural disasters, and in  deployment overseas. When we stray from that mission, we put our  national security at risk, and we disrespect these men and women.\n\nFor these reasons, at the appropriate time, I will offer a motion to  recommit this bill back to committee. If the House rules permitted, I  would have offered the motion with an important…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695246/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "…obeying the law is optional,  acting as if the Constitution is nothing more than a yellowing piece of  paper that he can rip up at will.\n\nThose are just some of the many, many reasons why, today, I am voting  yes on the resolution to block the administration from continuing to  illegally use military force within or against Venezuela.\n\nThis should not be…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696554/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…heroic military operation, captured  President Maduro and his wife, and brought them to New York City. Why?  Why do we find ourselves doing this?\n\nI think there are really two reasons, one unspoken, one spoken. First  and foremost, President Trump is clearly deciding that he wants to  distract the public from talking about his domestic failures. Donald…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698619/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…President said  last night, that everything is great, everything is fine, nothing to  see here.\n\nMr. Speaker, that is out of touch. It is really out of touch.\n\nFor all of these reasons, at the appropriate time, I will offer a  motion to recommit this bill back to the committee. If the House rules  permitted, I would have offered the motion with an important…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700223/homeowner-energy-freedom-act"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…little bit. Only 11 percent say: None at all. Electric prices are cool.\n\nSo electric prices are going up, and they are going up big time, and  they are going up for deliberate reasons.\n\nThe one deliberate reason has to do with the AI, crypto, tech bros  data centers problem.\n\nAs you know, the data center crypto people gave a lot of money to  Donald Trump.…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696122/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…are trying to solve.\n\nWe should be trusting our professionals bound by law, not House  Republicans to make sound decisions about Americans' retirement  savings.\n\nFor those reasons, I oppose the bill, and I encourage my colleagues  to do the same.\n\nMr. SCOTT of Virginia.  Kaptur).\n\nMr. Speaker, I include in the Record links to letters in opposition…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699154/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…calamity.\n\nWell, when the Speaker of the House that I saw on the boob tube--on  the television--says there is nothing to talk about, I think  immediately: There are 20 million reasons to talk about. Those 20  million are the 20 million Americans seeing these huge increases. Many  of them will not be able to buy insurance at all.\n\nLet's add to that, since…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…Mar. 5, 2025) (California       Waivers and Authorizations Website). The Administrator makes       a decision on the waiver and publishes a notice of their       decision and reasons in the Federal Register. B-334309, Nov.       30, 2023.\n\nThe Clean Air Act provides similar procedures for the EPA       Administrator to authorize California to adopt and…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691583/hj-res-88"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…say that they want to save the coal  industry. Secretary Wright recently implied that he doesn't want a  single fossil fuel plant to close.\n\nThis is ridiculous for several reasons, the most important being that  keeping these plants open is more expensive than building new sources  of clean energy. The proof is really in the pudding here. The Trump…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695765/national-coal-council-reestablishment-act"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…was a time where it was coal. That is definitely more expensive  now. There was a time where it was gas, but the cost of gas keeps going  up and up and up, for a couple of reasons--because we are exporting a  lot of our gas but also because the turbines needed to convert natural  gas into electrons--there is a huge backlog of them.\n\nSo we have an industrial…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699020/energy-costs"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "Mr. SHREVE. Mr. Speaker, Indiana is at the Crossroads of America. The  Indianapolis International Airport is in my district. It is one of the  reasons we proudly hold the claim to the distinction of Crossroads of  America.\n\nThis past month, Indianapolis International Airport welcomed a  nonstop transatlantic flight to one…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692118/welcoming-nonstop-flight-from-indianapolis-to-dublin"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…board a plane.  Americans show an ID to drive a car. Americans show an ID to open a  bank account. Americans show an ID to enter Federal buildings and for a  host of other reasons.\n\nOf course we should expect it for American elections. It doesn't  silence voters. It empowers voters. It only ensures that Americans are  voting in American elections. For…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700014/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…of those arguments.\n\nMr. Speaker, I will simply say that I hope that all the Members of  this House will support the passage of this rule. It is important for a  number of reasons, and I hope they will pass the underlying bills and  resolutions when those come up.\n\nThe material previously referred to by Mr. McGovern is as follows:\n\nAn Amendment To H.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694880/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…support, so I am  grateful for that.\n\nRegrettably, even in the face of such overwhelming consensus, this  amendment did not make its way into the final version of the bill for  reasons I won't dwell on now. But, as my colleagues can attest, I am  not one to give up easily, and this issue is simply too important to  American national security to take no for…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688824/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…this country, like my hero who  inspired me to get involved in politics, Ronald Reagan, did back in the  day.\n\nI said that I want to be like that guy, and it was for a lot of  reasons. I just got back from the economic forum out there in  California and saw the museum. I was reminded of what a statesman  leader he was and how he was the right person to…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691961/supporting-the-big-beautiful-bill"}, {"senator": "Darrell Issa", "party": "Republican", "sentence": "…Constitution for what he  thought was right, including the incarceration of threats to our  democracy under this very act, and the Court affirmed that.\n\nPresidents have seen reasons to do it. This President has seen an  onslaught, more than 10 million illegals, many of them actually here  from terrorist gangs, and he is trying to protect our Nation.…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689711/no-rogue-rulings-act-of-2025"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…first or second grade and onward that  calcium, vitamin A, potassium, magnesium, zinc, and all the nutrients  that are necessary are in whole milk. I think this is one of the  reasons God gave us a body in which whole milk clearly tastes better  than 2 percent milk and way better than skim milk.\n\nMr. Speaker, I urge my colleagues to strike a blow for freedom…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698182/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…all backgrounds and regions have  the information they need to pursue the capital formation strategy that  works best for their businesses.\n\nMr. DOWNING. Mr. Speaker, for the reasons I explained earlier, I urge  my colleagues to support this bill, and I yield back the balance of my  time.\n\nMr. DOWNING. Mr. Speaker, on that I demand the yeas and nays.…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692706/promoting-opportunities-for-non-traditional-capital-formation-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…threats will likely increase and Israel       remains at urgent risk of extremists in Lebanon, Iraq, Syria,       and Yemen exploiting the resumption of hostilities.\n\n(U) For the reasons cited above, an emergency exists       requiring immediate provision of these defense articles to       Israel in the national security interest of the United       States.…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688394/arms-sales-notification"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…have intervened.\n\nWhat that means, of course, is you can't change the pay for a  Congressman until after you have had an election.\n\nI think my bills are constitutional for two reasons. No. 1, we are  not changing the rate of compensation. We are just saying: You are in a  shutdown; you are not going to get your money.\n\nNo. 2, there is precedent for this.…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696561/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…pool for investors who are  qualified. It fuels private investment and business growth while at the  same time keeping protections in place by the SEC and FINRA.\n\nFor these reasons, I support the good bill by our chairman.", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692777/fair-investment-opportunities-for-professional-experts-act"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…``Forced organ  harvesting in China appears to be targeting specific ethnic,  linguistic, or religious minorities held in detention, often without  being [informed of] the reasons for their arrest or provided arrest  warrants.''\n\nAmong those most frequently reported as targets are Falun Gong  practitioners and Uyghur Muslims in the Xinjiang Province.…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690648/falun-gong-protection-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…letting it expire.\n\nI think I said it was $32.7 billion. That is for a single year. Just  multiply it by 10. That is what the actual math would be.\n\nMr. Speaker, one of the reasons I am sort of stressed out of my mind  right now is more than the chaos we see in some of the financial  markets and trying to understand the tariff issues and our leverage…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689614/its-the-math"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…operators are charged with  ensuring that the lights stay on when you flip a switch. Reliability  isn't a luxury. It is a critical necessity to our way of life and one  of the reasons our economy is the greatest in the world.\n\nUnfortunately, decisions made by the last administration favoring  intermittent, unreliable sources, often at the expense of on-demand,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695753/guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…strengthening site and infrastructure readiness, and  fostering prosperity across northwest Georgia. The board of directors  noted his professionalism and commitment as key reasons for his  selection.\n\nPlease join me in congratulating Matt Harris on this important  appointment and thanking him for his service to our region.", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697167/recognizing-matt-harris"}]