[{"senator": "Ed Markey", "party": "Democrat", "sentence": "…officials.\n\nNo. 18, banned transgender Americans from serving in the U.S.  military.\n\nNo. 19, restricted access to gender-affirming care.\n\nNo. 20, he froze the Clean School Bus Rebate funding, standing in the  way of keeping our air clean for kids on buses in our country.\n\nNo. 21, spread misinformation about vaccines and risked the health of  millions of…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690442/trump-administration-first-100-days"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…heroism of America's military. How about putting some  of that money into military housing, which is a disgrace.\n\nLet's refund it back to our taxpayers in the form of an energy rebate  to help them pay their rising utility bills. That is, Congress could  mandate that any company that draws up Venezuelan dirty crude oil for  their corporate coffers should…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698837/reflecting-on-impact-of-illegal-action-in-venezuela"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…of touch. This bill repeals and rescinds  funding for three important Department of Energy programs.\n\nFirst, it rescinds funding from the Home Electrification and  Appliance Rebate program. This is a $4.5 billion  program created by Democrats as part of the Inflation Reduction Act to  lower the upfront costs of appliance upgrades for low- and moderate-…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700221/homeowner-energy-freedom-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…energy bills on time.\n\nBetween the sky-high cost of rent, groceries, and utilities,  Americans are being hit from all sides.\n\nThe President has recently floated $2,000 tariff rebate checks as an  idea. Not only are these checks unlikely to see the light of day, but  the hole he has put American families in is far greater than 2,000  bucks. The American…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697242/the-economy"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…very popular, commonsense  initiative that hardworking Americans rely on. In 2022, Congress passed  some rebates to help people afford home appliances through two home  energy rebate initiatives that helped to lower their electric bills.\n\nThe first is the Home Efficiency Rebates Program, or HOMES. That is  the rebate to households that conduct whole-house…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700223/homeowner-energy-freedom-act"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…Reduction  Act that were essentially subsidies for replacing natural gas  appliances with electric-powered appliances. In particular, the so- called High-Efficiency Electric Home Rebate Act was intended to distort  the appliance market by discouraging the installation of lower cost  natural gas appliances.\n\nInstead of leaning on subsidies, electric-powered…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700197/providing-for-consideration-of-hr-dont-mess-with-my-home-appliances-act-and-providing-for-consideration-of-hr-homeowner-energy-freedom-act"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…Inflation Reduction Act to force  States to implement green energy building codes only serve to make  matters worse.\n\nIt is estimated that building codes associated with the HOMES rebate  program raises the cost of a single-family home by $31,000. These  building codes effectively prevent the use of natural gas and require  expensive equipment to accommodate…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700222/homeowner-energy-freedom-act"}]