[{"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…disaster assistance finally covers those  costs.\n\nWe must make this change so that our residents, our constituents,  live in a safe home after a flood. They need to be able to rebuild  their lives from these disastrous floods.", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694123/disastrous-floods"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…climate, what that is doing, higher insurance  costs, and higher electric bills because their summers are longer and  more intense. Back in the Tampa Bay area, we are trying to rebuild from  the most devastating hurricane season that we have ever experienced.\n\nThe changing climate isn't just about the weather. It is about your  wallets, and folks really…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688544/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…like other parts of the country, in Georgia and  North Carolina. We don't need Elon Musk creating turmoil and firing  civil servants and public servants who are helping us rebuild. We do  not need the Trump administration making people's lives harder to  rebuild and harder to afford to stay in their homes.\n\nWe are preparing for another hurricane season.…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690936/gulf-of-america-act"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…district. We  will make more money with AI. It will help more of the financial and  technology elites.\n\nI will tell you what it is not going to do, Mr. Speaker. It is not  going to rebuild the communities that have had a raw deal in America.\n\nWhat economic patriots believe, even though we have different  ideologies, is that it is ordinary Americans who built…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689079/economic-populism"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…said about automotive prices.\n\nPresident Trump, come to Ohio. Come to us. Visit us with Canada. Let  us show you what we have done without your help for decades, trying to  rebuild the industrial spine of America.\n\nI will fight for the American auto industry without tanking our  economy because, clearly, there are some people in charge who don't  know…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690052/trump-tariffs"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…soon we will decide whether to spend on the Department of  Homeland Security. Without these far-reaching, fundamental changes  that, in effect, scrap the current culture and rebuild an Agency that  is out of control, I will vote against a DHS funding package. And I  think others will join in that opposition because this Agency is  bankrupt--morally bankrupt,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699650/9999"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…started a       business, employing others and generating economic activity       for my local community. I run a construction and real estate       business that is helping to rebuild and revitalize housing       throughout my community. Over the past few years, my company       has worked on 56 houses. I'm proud of my team's ability to       fix up homes…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699630/constituent-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…President who is already selling merchandise proclaiming  Trump 2028, but if we do have an election in 2028 and get a new  President, we cannot snap our fingers instantly and rebuild an entire  division that was demolished by this administration.\n\nMajor damage is being done to our institutions, and all my brothers  and sisters can do on the other side…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690393/attacks-and-threats-on-democracy-and-rule-of-law"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…supply chains that threaten both our economic and national security.  This bill is a critical step toward preventing debilitating shortages.\n\nMr. Speaker, we must invest, rebuild, and protect our industrial base  from threats to innovation and competitiveness. For too long, poorly  negotiated trade deals, job outsourcing, and the decline of  unionization…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690189/promoting-resilient-supply-chains-act-of-2025"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…truer than we saw 1 year ago today.\n\nGovernor Moore and Mayor Scott raced to the bridge. Our Federal  delegation immediately started asking questions, pushing for funding to  rebuild. County executives across the State, like me at the time, sent  our resources and our first responders to help with rescue efforts. We  are so grateful we had a President…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689022/9999"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…to faithfully implementing  this bill, and now it is on all of us to work together to make that  true. There will be a lot more work to do in the months and years ahead  to rebuild American foreign assistance, but this week marks a very  important first step.", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699751/9999"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…air-conditioner. What happened in the subsequent months? Electric  bills went up, up, up. Last year, she paid $170 in May, $258 in June,  and $314 in July. As people try to rebuild, they could really use these  rebates as they are replacing their appliances.\n\nWhy do Republicans want to make life so much harder and more  expensive? I guess it is because…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700223/homeowner-energy-freedom-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…manufacturing,  can play a major role in relieving that backup, but all of America is  put on hold due to the DOD's damaging budget delays.\n\nWe must prioritize investments that rebuild our domestic  manufacturing capabilities. Our military should never have to fight  with or depend on foreign sources for materials, critical minerals, or  key military components.…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693693/department-of-defense-appropriations-act-2026"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "Ms. TOKUDA. Mr. Speaker, Congress, Democrats and Republicans alike,  came together to pass the American Relief Act of 2025, securing $12  billion to rebuild communities devastated by disaster. We made a  promise to North Carolina, Florida, Texas, and Maui.\n\nMr. Speaker, that promise isn't just being broken. It is being ripped…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688590/maui-minute-on-huds-office-of-community-planning-and-development"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…addressing major  problems that are actually impacting farmers in rural communities.\n\nLet's be clear. Removing protections for the longfin smelt will not  make it rain. It will not rebuild California's snowpack. It won't  refill our reservoirs, not even the reservoir that President Trump  recently drained in a public relations stunt that had nothing to do  with…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690601/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt"}, {"senator": "Kat Cammack", "party": "Republican", "sentence": "…and recovery, and it expands care  for pregnant and postpartum women, strengthens prescription drug  monitoring, and helps individuals in recovery reenter the workforce and  rebuild their lives.\n\nThat is what real solutions look like, not another study. Stop  playing politics with people's lives, please. We need to support  prevention, treatment, and…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691884/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…with law enforcement, legislators, and local leaders to  strengthen laws, increase resources for trafficking victims, and ensure  that survivors have the support they need to rebuild their lives. She  has played a key role in transforming how society understands and  addresses human trafficking, ensuring that the issue is no longer  hidden or overlooked.…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691094/recognizing-laurie-swink"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…budget resolution sets a framework. It is a first step  toward delivering on the America First agenda and getting our country  back on track.\n\nWe will secure our border. We will rebuild the American economy. We  will unleash American energy and safeguard our financial future.\n\nMadam Speaker, 77 million Americans voted for this agenda, and it is  our job to…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688089/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions-and-providing-for-consideration-of-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…on the courageous people taking to the  streets.\n\nThis latest wave of repression is a symptom of weakness. Indeed, the  regime has never been weaker. It is vainly trying to rebuild a nuclear  capacity that the United States can undoubtedly neutralize again. Its  economy has been ruined by the regime's self-sabotage.\n\nIt is my hope that the people of…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698899/standing-with-brave-iranians"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…as neighbors, friends, and family.\n\nRebuilding hasn't been easy, but very few things that are worth doing  are easy.\n\nCome Helene or high water, western North Carolina will rebuild. I am  so proud of the resiliency of the people of the mountains.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695797/hurricane-helene"}, {"senator": "Ryan Mackenzie", "party": "Republican", "sentence": "…innocent  civilians in Syria.\n\nThose who attended Sunday mass at the Mar Elias Church were not  combatants. They were members of the community who sought to live in  peace and  rebuild from war. They were members of our community who had endured  unimaginable suffering and faced an uncertain future with faith and  hope.\n\nIn the shadow of relentless terror…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693108/facing-down-perpetrators-of-destruction"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…and I stand ready to support the State's request for Federal  assistance.\n\nMr. Speaker, please join me in thanking these everyday heroes who  rose to the challenge helping us rebuild, recover, and emerge stronger.", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689858/congress-supports-northern-michigan-and-the-upper-peninsula"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…devastating extreme weather can do  to installations. In 2018, Hurricane Michael mauled Tyndall Air Force  Base in Florida, my home State, and cost the Air Force $4.9 billion to  rebuild. When Typhoon Mawar ran through Guam and devastated the island,  this Congress provided almost $1.8 billion to begin recovering from the  damage. Unfortunately, we know that…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692959/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…services we all rely on, like safe roads, clean public spaces and  functional public buildings--simply could not be provided. The Oxford  Public Works team works every day to rebuild, improve and safeguard our  transportation systems, structures and facilities.\n\nMr. Speaker, please join me in recognizing National Public Works Week  and thanking the City…", "date": "2025-05-23", "source_url": "https://justfacts.votesmart.org/public-statement/1691680/recognizing-the-national-public-works-week-may-and-the-city-of-oxfords-public-works-department"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…wore our Nation's uniform. The apartments offer not only  a safe place to live but also access to onsite supportive services from  the VA and local agencies, helping veterans rebuild their lives with  dignity and purpose.\n\nVictory Apartments earned national recognition, receiving the Charles  L. Edson Tax Credit Excellence Award for outstanding affordable…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696802/recognizing-lisa-yanney-roskens"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…others were tragically destroyed 4 years ago.\n\nThe construction of this new home is being supported by an  organization called Non-profit Construction, which is leading the  rebuild, and El Dorado County's title 25 program, which streamlines the  rebuilding process for homes damaged or destroyed by the Caldor fire.\n\nThis groundbreaking and upcoming construction…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…ensuring fair and  transparent allocation of resources. By securing placements at  facilities like Pasco Hope, the team supported individuals and families  along a pathway to rebuild their lives. Between September 28 and  October 18, 2024, the team managed an overwhelming volume of calls-- 1,194 through their direct line and another 1,214 through work…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690698/recognizing-fernando-serrano"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…ensuring fair and transparent allocation of  resources. By securing placements at facilities like Pasco Hope, the  team supported individuals and families along a pathway to rebuild  their lives. Between September 28 and October 18, 2024, the team  managed an overwhelming volume of calls--1,194 through their direct  line and another 1,214 through work…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690850/recognizing-jordan-french"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…of Israel,'' the statement added.\n\nDefense Minister Israel Katz called the strikes ``a clear       message to the Hezbollah terror organization, which is       plotting to rebuild its invasion-of-Israel capabilities       through the Radwan force, and also to the Lebanese       government, which is responsible for upholding the       agreement.''\n\n``We…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693678/department-of-defense-appropriations-act-2026"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…foundation of this non-profit. Additionally,  after hurricanes Helene and Milton, Mrs. Gaston and her family  organized donations of food, clothing, and other necessities to help  rebuild our community while still caring for our nation's heroes. Mrs.  Gaston is that rare human being who is dedicated to helping humanity.\n\nIt is clear Tami Gaston has made a profoundly…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692210/recognizing-tami-gaston"}]