[{"senator": "George Latimer", "party": "Democrat", "sentence": "We are making a beeline to a MAGA recession and perhaps a  MAGA depression."}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "While Trump and his billionaire insiders' wealth catapults, Americans  are bracing themselves for layoffs, shortages, and higher prices in a  recession engineered by Trump."}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "That is a recession- level rate, the highest rate since the pandemic."}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "Consumer confidence is plummeting,  reaching its lowest level in 12 years, and economists are increasingly  convinced that we are heading for a recession."}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "If this continues to be our tariff policy, every major  economist and forecaster is, unfortunately, predicting recession, job  losses, and the misery that was all over our news feeds this morning."}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "But now that these tariffs are  making a recession more likely, it would be malpractice--malpractice-- for Republicans to move forward."}, {"senator": "George Latimer", "party": "Democrat", "sentence": "We are now looking at the self-inflicted likelihood of a crippling  recession, which could lead to a dramatic depression, all because of  these policies that create chaos in financial markets across the globe."}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "It is not only the contraction of the economy, it is chaos in the  stock market; it is declining consumer confidence; it is projections of  recession by Federal Reserve districts and major economists."}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "In  this role, he helped the Council remain solvent during the Great  Recession, led negotiations for stronger contracts and worked with a  developer to create a software program to streamline the reporting  process for prevailing wage concerns."}, {"senator": "Jim Costa", "party": "Democrat", "sentence": "Trump's administration are  the following: The economy has shrunk; The stock market has taken a  hit; 401(k)'s that are critical for a majority of Americans' retirement  have declined; there has been a launch of a trade war that could cost  the average family in America over $4,900 a year this year alone with  no trade agreements in sight, threatening a recession."}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "Unless we reverse course quickly, many economists believe that a  recession is inevitable."}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "Is it that Donald Trump's trade war  has pushed our country to the brink of recession?"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "I did serve this Nation during a time of real economic crisis during  the Great Recession in the administration of Barack Obama."}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "With so many problems facing our country, with a threat of recession  on the horizon, with tariffs driving costs up, and Elon Musk taking a  meat cleaver to Social Security, to veterans' care, and to cancer  research, what are Republicans in Congress spending their time on?"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "Economists are warning about a looming Trump recession."}, {"senator": "Chip Roy", "party": "Republican", "sentence": "One hundred days of economic pain, as Trump's on-again, off-again  temper tantrum of tariffs tank the dollar, drive up prices, destroy the  markets, and threaten a recession."}, {"senator": "David Schweikert", "party": "Republican", "sentence": "Look, this may be a little bit geeky, this chart, but the basic  premise is, when you are taking a look at labor force participation,  back here is the recession."}, {"senator": "Andy Barr", "party": "Republican", "sentence": "To my friend from California, if he cares about fiscal  responsibility, stopping a $4.5 trillion tax increase stops a  recession."}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "Larry Summers, a well-known Democrat, described progrowth forecasts  as ``tooth fairies'' and predicted a long recession."}, {"senator": "David Schweikert", "party": "Republican", "sentence": "We are not in a recession."}, {"senator": "David Schweikert", "party": "Republican", "sentence": "It was supposed to be when coming out of a major recession."}, {"senator": "David Schweikert", "party": "Republican", "sentence": "Turns out, if you don't do it, you actually get probably a small  retraction, maybe a small recession, because people's taxes go up  rather dramatically."}, {"senator": "John Kennedy", "party": "Republican", "sentence": "We can get prices down through deflation, if we go into a  recession, if you raise unemployment, allow unemployment to rise to  about 8 or 9 percent where people lose their jobs."}]