[{"senator": "Betty McCollum", "party": "Democrat", "sentence": "…of  premature deaths a year.\n\nThis bill will also force millions more Americans to pay higher  premiums, higher co-pays, and higher deductibles for the health care  they do receive. Republicans are voting to deliver bigger medical bills  to their constituents while President Trump continues to ignore his  promise to cut costs for everyday Americans.…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693153/one-big-beautiful-bill-act"}, {"senator": "Jared Moskowitz", "party": "Democrat", "sentence": "…whose  visionary leadership and deep commitment to service have elevated the  Agency's impact throughout our community. Her dedication ensures that  our seniors continue to receive the respect, support, and recognition  they deserve.\n\nMr. Speaker, on behalf of Florida's 20th, 23rd and 25th Congressional  Districts, we ask our colleagues to join us in…", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691691/recognizing-the-2025-honorees-of-the-broward-county-florida-senior-hall-of-fame"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…say billionaires. Now, they have  acknowledged millionaires, but just factually speaking, if the tax  rates are allowed to expire, virtually every American that works would  receive a tax increase. We as Republicans are committed to stopping  that.\n\nToday, and this week, the House has the ability to advance two pieces  of legislation under this rule:…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690745/providing-for-consideration-of-hr-gulf-of-america-act-and-providing-for-consideration-of-hr-dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Only 14 amendments have been selected by Republican leadership to be  debated across just four bills. That is a 98 percent rejection rate.  They block 98 out of 100 ideas they receive.\n\nMr. Aderholt, who was testifying before the Rules Committee said: Oh,  this rescissions bill gives us an opportunity to vote up or down on  whether we want to support public…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692385/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Steven Horsford", "party": "Democrat", "sentence": "…Republicans worked together to  implement the Affordable Care Act, including the expansion of Medicaid.  We reduced the uninsured rate by a third, and 563,000 children were  able to receive coverage as a result. The fact that Nevada did the  right thing then means we have more to lose as Republicans do the wrong  thing now.\n\nOur State would be the third hardest…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688077/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…advance the Hospital at Home  Program. This special initiative allows hospitals to treat patients in  their homes, rather than in-patient facilities. The program lets  patients receive healthcare services where they want, supports family  caregivers, and increases hospitals' capacity.\n\nThrough the Hospital at Home Program, hospitals are able to provide…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699474/hospital-at-home-program"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…Rural Veteran Health Care  Access Act, which will redraw the Veterans Integrated Service Network  lines. This change will allow veterans in Otero County and Eddy County  to receive care at a closer VA facility in El Paso rather than have to  travel 4 hours to Albuquerque.\n\nAccess to care means little if veterans can't get there. That is why  I am also…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688352/ensuring-veterans-receive-care-they-earned"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…filled with  failures, chaos, and incompetence. The United States' role and  reputation globally have been severely damaged, and many Americans are  worried they will no longer receive the Social Security checks and  Medicaid they need.\n\nNow, congressional Republicans insist on pushing forward crypto  market structure legislation, without addressing any…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…we raised a lot of money, and it was a beautiful day.\n\nWe must remember that nearly one in four American adults live with  mental health conditions, yet the majority do not receive the care they  need. Peer-based programs have been really successful. They are a very  affordable way of getting that care.\n\nHappy Mental Health Awareness Month to everyone,…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691279/mental-health-awareness-month"}, {"senator": "John Hickenlooper", "party": "Democrat", "sentence": "…healthcare, people who have preexisting medical conditions that are  worried that if they go off their healthcare now, they might be pushed  into a circumstance where they can only receive attention in emergency  room situations, defeating the purpose of their treatments.\n\nBy going forward and taking a 1-year extension, nothing new, but just  a 1-year extension,…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696606/9999"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…appointment of a number of Electors ``in such manner as the       Congress may direct.'' The Amendment also allows Congress to       select the number of Electors the District may receive,       subject only to a maximum: The District may participate in       the presidential Electoral College through the appointment of       no more electors than those of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695641/district-of-columbia-policing-protection-act"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…we can improve our  education system, we should also be able to agree that there is a role  for the Federal Government in helping to ensure that all students--50  million--receive a quality education. For decades, the Department of  Education has played that role of working to protect students against  discrimination and ensure equal opportunities in…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697008/9999"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…could conceivably elect a Democrat.\n\nFor example, the new Texas redistricting seeks to gift Republicans 80  percent of its House seats in a State where Democrats routinely receive  between 40 and 50 percent of the vote in congressional districts. It is  plainly a move designed to target minority voters.\n\nThe same playbook follows in Missouri and North…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696440/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…district, the Social Security Administration closed the White  Plains hearing office, forcing constituents in Westchester to travel  farther distances at a greater expense to receive in-person service.\n\nI implore this body to hold the Social Security Administration  accountable and ensure that our constituents receive good, convenient,  quality service.…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699376/concerning-state-of-service-at-social-security-administration"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…American Dream. The embodiment of that promise came in 1975 when  Congress passed the Individuals with Disabilities Education Act to  ensure that children with disabilities could receive a free, fair, and  equal education.\n\nThis landmark legislation changed the lives of millions of Americans.  The disabled children's right to an education would not only be…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698936/protecting-education-for-children-with-disabilities"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…reconciliation process. We are going to have tax policy  in there that is going to affect our tax revenues to the government  but, more importantly, affect the tax bill you receive.\n\nLet me stipulate for the record that when I am attacked a lot in the  coming weeks for saying, allegedly, I want to have taxes go up, I am  emphatically for cutting taxes.…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690594/fiscal-responsibility"}, {"senator": "John Moolenaar", "party": "Republican", "sentence": "…calcium, vitamin D, and other essential  nutrients that growing bodies and young minds need to thrive. For many  kids, milk is the most reliable source of vital nutrients they receive.\n\nThis legislation is about common sense and choice. Whole and reduced- fat milk are safe and nutritious options that many children prefer and  are more likely to drink. When…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698184/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…recent months, it has been discovered that under the previous  administration, lax safeguards have allowed illegal aliens, children,  and even the deceased to apply for and receive SBA assistance.\n\nThanks to the great work done by this administration, we learned that  in June 2024, the SBA approved a $783,000 loan application for a small  business that…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692123/american-entrepreneurs-first-act-of-2025"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…Speaker, pursuant to House Resolution 916, I call up  the bill (H.R. 1069) to prohibit the availability of Federal education  funds for elementary and secondary schools that receive direct or  indirect support from the Government of the People's Republic of China,  and ask for its immediate consideration in the House.\n\nThe Clerk read the title of the…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697532/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "Mr. RISCH. Madam President, section 36(b) of the Arms Export Control  Act requires that Congress receive prior notification of certain  proposed arms sales as defined by that statute. Upon such notification,  the Congress has 30 calendar days during which the sale may be  reviewed.…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696581/arms-sales-notification"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…demonstrating that middle school students,  when given the tools and the trust, can rise to extraordinary heights.\n\nMr. Speaker, fewer than 10 percent of FFA chapters nationwide receive  this distinction. Warren County's students have set a new standard of  excellence, and they remind us that the seeds of leadership, once  planted, can grow into something…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696845/recognizing-50th-anniversary-of-opera-roanoke"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…to the leadership and vision of  Secretary Chris Wright, has received a conditional commitment from DOE  to provide its fuel.\n\nThis is the only molten salt reactor to ever receive a construction  permit from the Nuclear Regulatory Commission and the first research  reactor to  receive an NRC construction permit in over 30 years. All that is needed…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694865/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…claims.\n\nThese complex letters sometimes cause veterans and survivors so much  confusion and stress that they just abandon their claims.\n\nAs a veteran myself, I continue to receive long and complex letters.  You shouldn't have to be a Member of Congress or an attorney to  understand how the VA claims process works.\n\nH.R. 1039, as amended, would ensure…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689678/clear-communication-for-veterans-claims-act"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…produce each medal would be about $250, and based on the       number of officers killed in the line of duty in recent       years, that about 150 officers would be eligible to receive       medals each year. On that basis, CBO estimates that       implementing H.R. 3497 would cost less than $500,000 over the       2026-2030 period. Any related spending…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699505/medal-of-sacrifice-act-of-2025"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…for the Memorial Day and the Veterans Day parades in Altoona,  and a volunteer at the James E. Van Zandt Medical Center, where he  worked tirelessly to help local veterans receive their benefits.\n\nIn the true spirit of Semper Fidelis, Lieutenant Peck continually  demonstrated his steadfast loyalty to his fellow veterans and  continually worked to help…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688957/president-trump-bringing-back-investments"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…for related financial assistance, and enroll in a       plan. Assistance from an agent or broker is of no cost to a       consumer. Rather, agents and brokers are allowed to receive       compensation directly from health insurance issuers in       accordance with agreements with those issuers and any       applicable state requirements.\n\nIndictments…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698800/breaking-the-gridlock-act"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…so that we  may redefine what is considered to be a youth offender from 24 years to  18 years and repeal the D.C. criminal court provision that allows  youthful offenders to receive sentences less than the mandatory minimum  required by law.\n\nThere is no question that there has been a crime epidemic across the  District of Columbia, and the citizens of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695563/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…with Representative  Cory Mills have called into question the veracity of the account of  events which formed the basis of a recommendation that Representative  Cory Mills receive an award of a Bronze Star, bestowed in 2021 or  afterwards, for his service under enemy fire in Iraq in 2003;\n\nWhereas in August 2024, Representative Cory Mills provided The…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697012/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…U.S.C. 19237).\n\nMr. EZELL.  1948, as amended.\n\nMr. Speaker, H.R. 1948 would allow the United States section of the  International Boundary and Water Commission, or IBWC, to receive  additional funding from other Federal and non-Federal partners to  support water and wastewater infrastructure.\n\nThe IBWC is already authorized to receive funds from the…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692167/international-boundary-and-water-commission-authority"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…Authorization Act for Fiscal Year 2026, my vote would  have been in the affirmative.\n\nMy absence is due to my attendance at the dignified transfer ceremony  at Dover Air Force Base to receive the remains of the two Iowa National  Guard servicemembers who were killed in Syria this past week. I  appreciate the opportunity to record my position.\n\nHad I been present…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698316/vote-explanation"}]