[{"senator": "Brad Sherman", "party": "Democrat", "sentence": "…withdraw the  United States from international financial institutions, that review,  which is due in August, has not been completed.\n\nWhile the IMF funding was included in the recent budget proposal,  comments by the administration and the Secretary of the Treasury  confirm that Trump has not decided whether to try to use what powers he  has as President…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692795/taiwan-non-discrimination-act-of-2025"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…serve Texans. I fully support Governor Abbott calling a       special session for the Texas Legislature to conduct       congressional redistricting to take advantage of recent       changes to the legal and political landscape.\n\nAs you know, I have stood shoulder to shoulder with       President Trump in fighting for the constitutional rights of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694943/bloody-sunday-and-voting-rights-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…transported to the new location as quietly as can       be done with a police escort.\n\nBoth the appeals and challenges of the society's current       home were evident during a recent tour. An extensive library       all but begged the visitor to pause and flip through a book,       any book: on heraldry or mythology, shipwrecks or excavation.       Then,…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697235/priceless-coin-collection-heads-to-the-toledo-museum-of-art"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…image of what is going on  in the Trump White House.\n\nAnd we know that he doesn't represent America because we can do  things like test public opinion and polls. And I have a recent one here  that asks about some of the sensible solutions to the climate change  problem, to all the pollution spewing. Here is one: Carbon pollution  limits on big companies.…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697077/climate-change"}, {"senator": "Rob Menendez", "party": "Democrat", "sentence": "…of Liberty.\n\nIt is clear that the helicopter industry is not a good actor or one  willing to proactively take measures to protect our communities. In the  wake of this most recent tragedy, one air tourism  company offered discounts to their customers for flights in our region.  They are clearly more interested in profit than public safety, making  it…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690739/threats-nonessential-helicopters-pose-to-public-safety"}, {"senator": "Mike Levin", "party": "Democrat", "sentence": "…assistance. Perhaps less  discussed is that it will increase your energy bills.\n\nRight now, 80 million Americans are struggling to pay their  electricity bills, and according to a recent report in The New York  Times, this bill will make it worse.\n\nThe big, ugly bill ends tax credits to promote clean energy and will  increase household energy costs by up to…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691967/big-ugly-bill-clean-energy-tax-credits"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…responsible for the Office of  Intelligence and Security at the Department of Defense supposed to do  their job when they face the most serious counterintelligence threat in  recent memory from within the Department of Defense? Elon Musk's  firings put thousands of highly qualified people out of a job. Many of  them possessed security clearances and knowledge…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691398/motion-to-discharge-s-res-195"}, {"senator": "Jimmy Panetta", "party": "Democrat", "sentence": "…has evolved into an important  platform for advancing dialogue, strengthening regional cooperation,  and expanding opportunities for trade, investment, and connectivity.  The recent summit in Washington underscored the mutual benefits of  deeper cooperation between the United States and Central Asia from  enhancing supply chain resilience and diversifying…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696589/welcoming-the-positive-outcomes-of-the-c51-summit-and-us-central-asia-partnership"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…That sure doesn't sound like anyone is defying any Federal law to me.  And nobody is accusing Justice Scalia as having been a leftwing  radical.\n\nAnd, yes, we do have more recent examples of courts rejecting the  Trump administration's attempts to strong-arm cities and States into  acting as Federal immigration agents.\n\nLet me just say this: These policies…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700066/9999"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…viewers created nonsensical conference  realignment that destroyed the regional nature of  college sport. For generations, the Big Ten was known as the Midwestern  Conference. In recent decades, that identity has slowly been eroded as  coastal schools were admitted in the name of more revenue and higher  profits.\n\nNow private equity is looking to buy college…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699263/college-sports"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "Mr. DURBIN. Mr. President, 3 years ago today, this Capitol served as  the background for one of the most notable events in recent American  history. On April 7, 2022, our country made a monumental stride  forward. The Senate confirmed a once-in-a-generation legal talent, a  jurist with outstanding credentials…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689666/justice-ketanji-brown-jackson"}, {"senator": "Sheila Cherfilus-McCormick", "party": "Democrat", "sentence": "…Lauderhill who  is rationing her medication to keep the lights on is counting on us.  The disabled veteran in Riviera Beach who is working two jobs is  counting on us. The recent college grad in Tamarac who makes enough  money only to pay rent is counting on us.\n\nWe must deliver and extend the ACA tax credits because America is  counting on us to survive,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698415/we-must-extend-aca-tax-credits"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…health  insurance, millions of Americans are going to lose their coverage and  many more could see their costs go up by as much as 75 percent. And  that is on top of the most recent inflation data that shows our economy  is headed in the wrong direction.\n\nDespite those numbers, everything that we have seen from this  administration--from its tariff policy…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695663/cloture-motion"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…release of the Epstein files. This is  something our Republican colleagues and certainly key members of the  Trump administration have been talking about for years until their  recent about-face.\n\nCongress can express its will. We would like to have it put up for a  vote. It doesn't block any votes on the crypto bills or the Defense  Department funding.…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693551/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…personnel to  wear body cameras so we have proper recordings of their conduct in  immigration enforcement; and requiring proper investigations after  tragedies occur like the recent shootings of both Renee Good and Alex  Pretti.\n\nThese are just a few of the examples of commonsense practices that  strengthen accountability and help ensure the safety of…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699402/9999"}, {"senator": "Tom Kean, Jr.", "party": "Republican", "sentence": "…children, including campers and staff from Camp  Mystic. Serving as the only triage coordinator on the scene, he played  a critical role in one of the largest rescue efforts in recent Coast  Guard history.\n\nScott grew up in Warren County, attended Rider University, and  answered the call to serve by enlisting in the U.S. Coast Guard, where  he trained as…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693983/recognizing-uscg-petty-officer-scott-ruskan"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…even operated as a  vital broadcasting facility, relaying news and information to VOA  stations across the Pacific, including Hawaii, Okinawa, and the  Philippines.\n\nIn more recent history, the Delano Municipal Airport gained  distinction as the home of a squadron of Northrop P-61 Black Widow  aircraft--twin-engine fighters that played a key role in defending…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698436/recognizing-the-city-of-delano-california"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…residence at the time of such sale shall       be included as a liability;\n\n``(C) any natural person who had an individual income in       excess of $200,000 in each of the 2 most recent years or       joint income with that person's spouse or spousal equivalent       in excess of $300,000 in each of those years and has a       reasonable expectation of reaching…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692776/fair-investment-opportunities-for-professional-experts-act"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "Mr. ALLEN. Mr. Speaker, I rise today to congratulate Augusta radio  host Austin Rhodes on the recent announcement that he will be inducted  into the Georgia Radio Hall of Fame.\n\nFor over 30 years, Austin has been a consistent and dependable voice  as the host of the ``Austin…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692847/congratulating-austin-rhodes"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…Part of this--part of this--is waste, fraud, and abuse of  taxpayer dollars. So we pay higher premiums, and the taxpayer is  getting ripped off as well.\n\nHere are just some recent examples. In November, a Federal jury in  West Palm Beach convicted two individuals in a $233 million ObamaCare  fraudulent enrollment scheme. Earlier this year, the Centers…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698998/disrupt-explicit-forged-images-and-non-consensual-edits-act-of-2025"}, {"senator": "Rudy Yakym III", "party": "Republican", "sentence": "…bury infrastructure, housing, energy, and other critical projects under  a mound of paperwork and litigation.\n\nNEPA is more synonymous with red tape than a green light. One recent  study found that energy projects spend a median of 3 years from final  agency approval to a final court decision, with some projects facing  delays that last for decades.…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697709/studying-nepas-impact-on-projects-act"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…of H.R. 2600, the ASCEND Act,  sponsored by Representatives Hurd and Bonamici.\n\nCommercial remote sensing is an increasingly important part of the  growing space economy. In recent years, technological advancements and  lower launch costs have enabled American companies to expand their  remote sensing capabilities and to deliver innovative, high-quality…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700115/accessing-satellite-capabilities-to-enable-new-discoveries-act"}, {"senator": "Rob Wittman", "party": "Republican", "sentence": "…to highlight the importance  of critical minerals. They are the backbone of our economy, but the  U.S. has ceded supply chain dominance to China, our primary adversary.\n\nIn recent decades, China has overtaken the United States and our  allies in production, processing, and smelting of critical minerals.  Take rare earth elements, for example. Rare earths,…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700180/critical-minerals-are-the-backbone-of-our-country"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…bill, which would prohibit smoking on VHA campuses.\n\nSince the nineties, VA has issued policies to provide safer smoking  environments. Then, in March 2019, VA issued its most recent policy for  a smoke-free VHA. This bill would align law with the current VA  practice.\n\nPatients and VA employees have a right to be protected from the  harmful medical effects…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695434/health-professionals-scholarship-program-improvement-act-of-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…itself is a creature, it is a  creation of the Constitution, of the Federal Government, which says  that it has to be done every 10 years. It is only a new phenomenon, a  fairly recent phenomenon, where States are deciding to do it more  frequently than that.\n\nSo we can, as a House, pass this measure. I believe if it were  brought to the floor it would pass…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697101/highlighting-the-state-of-california"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…from his writing for so many years, I have had the occasion to meet him  and share a modest correspondence. I can share that Norman may have  receded from public writing in recent years, but he remained as witty,  brilliant, and courageous as ever in his private correspondence.\n\nYet, as we all sometimes do when we reflect on our lives, Norman too  acknowledged…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698421/unanimous-consent-requests-the-calendar"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…H.R. 1709, the Understanding  Cybersecurity of Mobile Networks Act, led by the gentlewoman from  Florida's Third District and the gentleman from Ohio's First District.\n\nIn recent years, we have seen a rise in large-scale cybersecurity  attacks that put Americans at risk. Attacks like the Salt Typhoon have  directly impacted the communications of public…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693423/understanding-cybersecurity-of-mobile-networks-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…people by the thousands  in the United States.\n\nPresident Trump is doing what needs to be done to protect the  American people, just as he has done before. Take for example the  recent defensive strikes against the Houthis in the Red Sea. This went  on for some time. When the Houthis threatened the U.S. ships in the Red  Sea, citing article II of the Constitution,…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696565/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…Spurr, just 80 miles from Anchorage, reached a yellow alert level  due to elevated seismic activity earlier this year, and it is still  listed as a very high threat by the most recent edition of the USGS  National Volcanic Threat Assessment. If it erupts, as it did in 1992  and 1953, ashfall could shut down air traffic, damage critical  infrastructure, and…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698112/southcentral-foundation-land-transfer-act-of-2025"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…task at  hand.\n\nAgain, we should be focused on the issue at hand. Mr. Speaker, we  never celebrate the loss of life on our side. We don't celebrate the  loss of life in the recent shooting, but we cannot absolve people of  the actions they are taking to disrupt ICE's operations.\n\nWe certainly shouldn't be looking at ICE agents, condemning ICE  agents…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699072/providing-for-consideration-of-hr-financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}]