[{"senator": "Alex Padilla", "party": "Democrat", "sentence": "…Department of Homeland Security spokesperson declared for  the first time--now, I want to make sure I get this right, so I am  going to quote:\n\nIllegal aliens who claim to be recipients of DACA are not       automatically protected from deportations.\n\nShe went on to say that DACA recipients should now self-deport from  the United States. Think about what…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694421/daca"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…need to cut  Social Security benefits. We need to enhance them.\n\nMr. Speaker, as my colleagues are aware, in the Speaker's district  alone, there are 189,000 Social Security recipients who haven't  received an increase in benefits in more than 50 years. There are  147,000 retirees, 20,000 disabled workers, 8,700 widows, 3,700 spouses,  and over 9,000 children…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688396/preeminent-antipoverty-program-for-elderly-and-children"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…extraordinary valor that distinguished men and women of  our military demonstrated in critical moments during their service to  our great Nation.\n\nThere are 63 living Medal of Honor recipients, including heroes like  Army Staff Sergeant Ryan Pitts of New Hampshire, who served two tours  in Afghanistan. During his second deployment, hundreds of insurgents  attacked…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688214/medal-of-honor-act"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…District, encompassed by  Harlem, east Harlem, Washington Heights, Inwood, and the northwest  Bronx, more than  one-half--close to 500,000 of my constituents--are Medicaid recipients.  They receive primary and emergency healthcare. Almost 4 million  residents in New York City, one-half of the city, rely on Medicaid.\n\nMr. Speaker, this discussion that…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691482/medicaid-and-social-security-cuts"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…develop memory, social skills, and  emotional stability. All of these are critical to academic success.\n\nA quality education is the key to opportunity. It empowers our SNAP  recipients to lift themselves out of the cycle of poverty.\n\nUnder these Republican cuts, Maryland and our counties would take on  50 to 75 percent of the administrative costs of SNAP.…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691770/151-days-without-a-vote-to-lower-costs"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…package.\n\nOne of my bills makes key provisions to the HOME program at HUD to  ease compliance for small properties and to recognize community land  trusts as eligible HOME fund recipients.\n\nThe package also expands foreclosure mitigation counseling to  delinquent borrowers and raises the public welfare investment, or PWI,  cap to 20 percent to free up capital…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699805/housing-for-the-21st-century-act"}, {"senator": "Rob Menendez", "party": "Democrat", "sentence": "…weaponized by the Trump administration.\n\nThe IRS recently entered into an agreement with ICE to share  information about immigrants. The same is true of data on affording  housing recipients. If we allow them to use this data now, then what  will stop them from using information from other agencies in the future  against other groups of Americans?\n\nMr. Speaker,…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690782/protecting-sensitive-data-for-millions-of-americans"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "Ms. KAPTUR. Mr. Speaker, my message today is an alert for Social  Security recipients. Pay attention to what billionaire Elon Musk is  doing with your hard-earned Social Security benefits.\n\nMusk is coming after your Social Security. The top administrator of…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688636/social-security-benefits-are-your-hard-earned-benefits"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…trickle down to people. People are already having trouble  affording rent, home prices, food, and other goods.\n\nPutting this kind of financial pressure not just on Medicaid  recipients but on everybody else, because insurance rates and medical  costs are going to go higher, only makes that squeeze worse.\n\nTokuda).\n\nMs. SCHRIER. Mr. Speaker, I thank Representative…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691419/gop-tax-scam-hurts-everyone"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "Mr. WALKINSHAW. Mr. Speaker, I rise to recognize the recipients of  the 2025 Stephen A. McLaughlin Fairfax County Champions of Character  Awards. Since 2001, these awards have been presented to athletes,  coaches, and parents in our region…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697100/recognizing-the-recipients-of-the-2025-stephen-a-mclaughlin-fairfax-county-champions-of-character-awards"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…now, we are not just abandoning our values. We are surrendering  one of the world's fastest growing marketplaces to China.\n\nLet's be clear: Regions we assist aren't just aid recipients. They  are emerging economies and future trading partners. Pulling back opens  the door for authoritarian regimes like China to dominate the future,  commerce, connectivity,…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692541/rescissions-act-of-2025"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…The Georgia Budget and Policy Institute also found that Georgia's  Pathways to Coverage program created burdensome red tape and paperwork  for state agencies and Medicaid recipients.\n\nGeorgia's experience offers a stark warning for the Nation as  Republicans consider steep Medicaid cuts and work requirements for low- income Americans. The focus must…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689905/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…their rich fossil fuel friends than they do about lowering costs for  the average American.\n\nMr. Speaker, I want to stress the China part again. China is one of  the top recipients of American LNG, and not only the President but LNG  companies are openly bragging about how they can sell to Chinese  buyers. This bill completely removes any review of…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697094/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…last Friday, Trump ordered USDA to delete the plan,  take it off their website, and refuse to use the money. No reason. No  explanation. Just cruelty. Two-thirds of SNAP recipients are kids,  seniors, or people with disabilities. That is whom Trump is cutting  off: kids who rely on school meals, seniors on fixed incomes, veterans  trying to get by,…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696462/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-record-of-decision-for-the-barred-owl"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…They get that  largely through Medicaid. It is also a benefit for people with  disabilities.\n\nThe Republicans' devastating budget plan would push about 14 million  Medicaid recipients off lifesaving healthcare and leave countless  vulnerable families exposed to catastrophic medical bills. This is  terrible. This is about health and financial health that…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691417/gop-tax-scam-hurts-everyone"}, {"senator": "Ryan Mackenzie", "party": "Republican", "sentence": "Mr. MACKENZIE. Mr. Speaker, I rise today to recognize two exceptional  students from the greater Lehigh Valley, Adam Wyatt and Ria Gandotra,  recipients of the 2025 Congressional Award Gold Medal, the highest  honor Congress can bestow upon a civilian youth.\n\nAdam, a student at Nazareth Area High School and an Eagle Scout,…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692462/recognizing-adam-wyatt-and-ria-gandotra"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Ms. Furlong also visits the  Center each weekend when the facility is closed to check the donation  box and bring donated items inside to ensure they reach the intended  recipients. When volunteers are united in an important mission, it  naturally fosters camaraderie which is great for anyone who works or  volunteers at the Center. All of these women…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691825/recognizing-patricia-furlong"}, {"senator": "Nicole Malliotakis", "party": "Republican", "sentence": "…organizations and enterprises and  the fraudsters who are preying upon American citizens.\n\nIt is very unfortunate that we are seeing this hardship and stress  placed on the intended recipients who have had to endure seeing their  checks being stolen and then they have to wait months to sometimes see  their replacement check also stolen.\n\nThis is not just happening…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689293/recovery-of-stolen-checks-act"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…the economic failures of prior administrations. The  reality behind this is, this bill that we are discussing today is  insisting on work requirements associated with the recipients of  Medicaid.\n\nIf you are an able-bodied, working adult, you should be able to go  out and find a job. If you can't find a job, you need to go to a  training program and…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693220/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…administration.\n\nOne accusation I find particularly ironic from our friends across the  aisle has been this idea that we have somehow added redtape to Medicaid  by requiring recipients to verify their eligibility for the program two  times a year.\n\nPeople come in and out of the Medicaid Program based on that means  testing, based on their earnings threshold.…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693491/one-big-beautiful-bill-act"}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "…risked everything--their safety, their future, their very lives for  freedom, for the opportunity for all of us to be here today.\n\nToday, there are 61 living Medal of Honor recipients, 61 men who  faced unthinkable odds, who put their country before themselves so that  the rest of us could live in peace. We cannot truly ever repay them.  There is no sum,…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696586/medal-of-honor-act"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…President, including his proposal to cut taxes on  Social Security.\n\nBy taxing Social Security, the Federal Government is taxing a tax. It  makes no sense. Social Security recipients have paid into this program  for decades. They deserve the full sum of their Social Security income.  However, nearly 66 percent of retirees are paying taxes on their Social…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690548/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…SERVICE FUND APPLICANTS.\n\nSection 254 of the Communications Act of 1934 (47 U.S.C.       254) is amended by adding at the end the following:\n\n``(m) Vetting of High-Cost Fund Recipients.--\n\n``(1) Definitions.--In this subsection--\n\n``(A) the term `covered funding' means any new offer of       high-cost universal service program funding, including       funding…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690153/rural-broadband-protection-act-of-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…that a cut? Is that a  chain saw? It is just doing things that aren't scary.\n\nMr. Chairman, the last one I will talk about is in the MedPAC report.  The majority of Medicare recipients in America now use Medicare  Advantage. For those of us in the Scottsdale-Phoenix area, we actually  have a much higher penetration.\n\nAccording to the report and even with…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689025/tell-the-truth-about-math"}, {"senator": "John Thune", "party": "Republican", "sentence": "…in Byrd-compliant  savings, including the first real entitlement reform in decades--reform  that will put the programs in question on a more sustainable path for  today's recipients and for tomorrow's.\n\nI am proud that Republicans are delivering on our promises to the  American people, and I can't wait to see our policies begin working to  help build…", "date": "2025-07-08", "source_url": "https://justfacts.votesmart.org/public-statement/1693279/one-big-beautiful-bill-act"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…Scouts Promise reads: ``On my honor, I will try to serve God  and my country, to help people at all times, and to live by the Girl  Scout Law.'' Carolyn and each of the other recipients of the Girl Scout  Gold Award are the embodiment of this promise.\n\nI also recognize the parents and Scout leaders who supported each  Girl Scout on their path to this milestone.…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690079/congratulating-girl-scouts-of-western-ohio-on-gold-award"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…savings as a result of its  work. The mass repatriation of millions of illegal aliens should save  another $150 billion. Restoring the work requirement for able-bodied  welfare recipients will save hundreds of billions of dollars more  without touching a single service for the truly needy. The economic  rebound from the regulatory and fiscal reforms and from…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689900/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Abraham Hamadeh", "party": "Republican", "sentence": "…medical  care. They did not wait to defend America, and America should not make  them wait for healthcare.\n\nMy bill offers a simple and commonsense fix. HPSP scholarship  recipients will be given offers of jobs within 90 days post-graduation.  They will not wait. Veterans will not be forgotten. We are going to  drain the VA swamp one regulation at a…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695432/health-professionals-scholarship-program-improvement-act-of-2025"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…CARTER of Georgia. Mr. Speaker, I rise today to recognize Wayne  Barth, a physical trainer at Union General Hospital, who has been named  one of the 2025 Hospital Hero Award recipients by the Georgia Hospital  Association. This prestigious award recognizes the amazing hospital  workers in our State for their longtime service in healthcare.\n\nMr. Barth serves…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699261/recognizing-wayne-barth"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…the institution.\n\nJohn Adams was founded by Dr. Dean Forman, and he is spearheading  this Servant Leadership Award, which will be awarded this weekend, and  the inaugural recipients will be Mark and Marcus Haney. Mark Haney runs  the Growth Factory in Rocklin, which helps early-stage entrepreneurs  build startup businesses. They work with them to build…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690562/gas-prices-are-lower-for-everyone-except-californians"}]