[{"senator": "Angie Craig", "party": "Democrat", "sentence": "…don't know how my Republican colleagues can say that any of this is  all according to plan with a straight face.\n\nThere is no plan. There is no art of the deal. Trump's reckless  tariffs are costing hardworking Americans $4,600 a year, hurting small  businesses, and absolutely tanking retirement savings.\n\nFarmers are taking losses on days they go to market…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689863/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…pain and insecurity for the  American people.\n\nFirst of all, the tariffs. When the history of this decision is  written, President Trump's imposition of these wild and reckless  tariffs is going to be seen as one of the greatest economic blunders in  a century. It is that bad.\n\nWhat is happening in Vermont is happening in every State across this  country.…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690522/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…of this is a part of history and now underpins the  opportunity to grow an innovation economy. Yet, under the Trump  administration, working people are being betrayed. Reckless tariffs and  political maneuvers have created chaos for manufacturers, for farmers,  for scientists, and union workers alike.\n\nWe saw the promise of good-paying jobs in offshore…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695601/devastating-harm-caused-by-trump-administration"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…administration, despite the fact that they plundered a trillion dollars  from Medicaid, just back in July, to give a tax break to CEO  billionaires, despite the fact that reckless tariffs are decimating our  small businesses to the tune of $38 billion a year, somehow, OMB  Director Russell Vought wants to fund the Department of Defense at more  than $1…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697772/healthcare"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…she have any other  speakers?\n\nMr. Speaker, at the end of the day, this is a terrible, horrible  rule. Voting in support of this rule means voting to protect Trump's  reckless tariffs. Don't get me started about this budget resolution. It  is not just Democrats who think this budget resolution is terrible; it  is Republicans.\n\nMr. Norman, a member of…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689864/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Jacky Rosen", "party": "Democrat", "sentence": "…paying more, but seniors on fixed incomes do; parents trying  to feed their kids do; workers whose paychecks aren't keeping up do.  They are the ones being hurt by these reckless tariffs. So Donald Trump  may not care, but everyone else I know cares--and it matters.\n\nThat is why I introduced my No Tariffs on Groceries Act. This bill,  it is simple--simple.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698816/9999"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "Ms. KAPTUR. Mr. Speaker, I rise today to draw attention to the 68,000  manufacturing jobs lost across our country in 2025 as a direct result  of President Trump's reckless tariffs and DOGE cuts.\n\nWhy did he visit Detroit yesterday when his insistence on continuing  these tariffs actually cuts investment in American manufacturing? It is  all backward,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699062/manufacturing-jobs-lost-due-to-trump-tariffs"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…International Airport. Did Virginia  even vote for Donald Trump?\n\nFamilies are confronting thousands of dollars more per year in higher  costs, thanks to Donald Trump's reckless tariffs. Instead of pushing  back the President, instead of Congress asserting our constitutional  authority as it relates to tariffs and trade in the best interest of  the American…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690933/gulf-of-america-act"}, {"senator": "Pete Aguilar", "party": "Democrat", "sentence": "…the oil lobbyists.\n\nCutting food assistance programs like SNAP are going to hurt working  people who are already getting squeezed at the checkout line because of  these reckless tariffs. These are the same working people who were told  by my Republican friends that lowering costs would be their top  priority. That has not been the case. The American people…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693158/one-big-beautiful-bill-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…companies,  workers, and communities that are being devastated by job losses and  broken promises. Meanwhile, inflation and prices are steadily on the  rise due to the GOP's reckless tariffs.\n\nFirst, we must ask why the Trump administration is stopping the  investment of billions upon billions of dollars in projects that were  awarded to make America great…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695604/devastating-harm-caused-by-trump-administration"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "…stress and fear, fear that they can't provide for their families, and  fear that things aren't getting any better.\n\nUntil Congress stands up to Trump and his illegal, reckless tariffs,  things won't get better. Arizona families will continue to face  uncertainty, but the Speaker of this House is about to send Congress  home for the holidays without…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698328/president-trumps-illegal-tariffs"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…and Musk settling scores,  causing chaos, and making sure they line their pockets on the backs of  Americans and the middle class.\n\nMadam Speaker, we need to end these reckless tariffs and get back to  lowering costs for the people we serve.", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689098/understanding-tariffs"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…Seizing Congress' power of the purse. He froze funds and  dismantled agencies without congressional approval.\n\n3. Abuse of trade powers and international aggression. His reckless  tariffs hurt American families, and he even threatened military actions  against our allies.\n\n4. Violation of First Amendment rights. Trump retaliated against  journalists and…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1690991/the-truth-still-matters"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…you is just fake news?\n\nMr. Speaker, while many, rightly, have been focusing on the arbitrary  and devastating cuts to essential Federal programs or the disastrous  and reckless tariffs that have increased prices and inflation and have  tanked the economy, President Trump's first 100 days have also  escalated this relentless assault on the checks and…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690393/attacks-and-threats-on-democracy-and-rule-of-law"}]