[{"senator": "Haley Stevens", "party": "Democrat", "sentence": "…want to be effective stewards of any taxpayer  dollars, which is why this bill is not appropriating any such thing.\n\nWe are in a wake-up call moment, but this isn't over. To reclaim our  edge, we have to empower our top  science agencies to unite, to collaborate, and to drive the innovation  necessary to lead before any of our competitors seek to leave…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688990/doe-and-nsf-interagency-research-act"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…but who must know that help will be there when they need it.\n\nThis is a commonsense solution that will ensure victims have access  to the services that they need to heal, to reclaim their lives again,  and to feel secure enough to speak out about their pursuing the justice  that they deserve.\n\nI ask all Members of this body to support this lifesaving…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698840/crime-victims-fund-stabilization-act-of-2025"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…resolution, S.J. Res. 90. You can research and  pull up the entirety of it, and I beg that you would.\n\nSo where do you stand when the Senate of the United States of America  cannot reclaim its power to declare war? And we ought to do it while we  can. We are losing it.\n\nThe ultimate measure of the United States Senate--what is the  ultimate measure of it when…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699134/where-do-you-stand"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…meaningful constraints on the Trump  Administration's ability to abuse the budget process, take expansive  power over Federal funding, Federal spending away from Russ Vought, and  reclaim it for the Congress. If not, the President and Russ Vought will  be in charge of the funds, and we will have no say.\n\nAt the same time, funding for the Department of Homeland…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699573/consolidated-appropriations-act-2026"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…the country: This  is not OK. This is not acceptable. This is breaking the law. This is  shredding the Constitution. This is attacking our freedoms, and we the  people will reclaim our Constitution, our separation of powers, and our  freedom.\n\nThat is why the action of demonstration and the action of speaking  out are so important at this moment. It…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…irrelevant. Is that right?\n\nMr. RASKIN. Then why is it in this bill?\n\nMr. RASKIN. Neither are machine guns. The gentleman excluded machine  guns.\n\nMr. RASKIN. Mr. Speaker, I will reclaim my time, and I yield myself  the balance of my time.\n\nThey went to the pains of excluding machine guns, saying that they  didn't want a retired officer to be able to purchase…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691349/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…responsibilities to the executive branch.  As our country's founders warned, this has created a dangerous  situation ripe for Presidential abuse. It is essential that Congress  reclaim its legitimate authority as the first branch of government.\n\nMy resolution declares that appropriations made by Congress are law,  not mere suggestions. It quotes James Madison,…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694144/introduction-of-a-resolution-reaffirming-the-principles-of-the-constitution-of-the-united-states"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…second may  not succeed, but having laid the foundation for the President's  impeachment in the past, I know that impeachment can succeed.\n\nI also know that should Democrats reclaim the House and the Senate by  margins that are sufficient to not only impeach but to convict, I  believe that the President can be removed from office.\n\nHe talks of having…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690093/protecting-the-american-dream"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…for Senators to vote yes tonight.\n\nThe only winner from the tariffs is China, which is scooping up  markets and allies Donald Trump has left in the dust.\n\nSenators, vote yes. Reclaim American trade policy, and end its  outsourcing to Donald Trump.", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690532/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Greg Landsman", "party": "Democrat", "sentence": "…saved  for retirement.\n\nThis is a crisis and a moment of reckoning. All of the money is stuck  at the top, and our big mission, the thing that our generation has to  do, is reclaim that money, that power and wealth, back for the American  people. That is the number one thing. At the end of the day, our  generation has to reclaim that power and wealth…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699242/restoring-election-integrity"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…public servants trying to do  their best. But this Citizens United decision and where we are in  politics today have changed this business so much, I am not sure we can  ever reclaim the kind of idealism that we all aspire to as public  servants in this institution.\n\nI thank the Senator for drawing us to the floor today. There is a lot  of work to be done,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699112/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…taxes--the only thing Americans are  ``liberated'' from is their hard-earned retirement savings.\n\nA small group of my Republican colleagues in the other body has moved  to vote to reclaim their congressional trade authorities in response to  the president's misguided tariff war on our friends in Canada, by  introducing legislation to reclaim Congress's authority…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689638/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Linda Sánchez", "party": "Democrat", "sentence": "…watch.\n\nMy Republican colleagues have a choice. They can stop cowering to  Trump and vote to strike down this rule because Americans want an end  to Trump's trade wars.\n\nLet's reclaim our constitutional authority and put an end to his  abuse of tariffs once and for all.", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699901/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…We must  put them on record on the Republican side before our troops--our  military--are committed in Cuba or in Colombia or in Mexico. This body  must go on record. We must reclaim our constitutional prerogatives that  are built into article I of the U.S. Constitution. That is the job  which we must do, and that is what the American people expect from…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698823/9999"}, {"senator": "George Whitesides", "party": "Democrat", "sentence": "…freshman at Saugus High School, Mia was  shot in  the stomach during a horrific attack that took the life of her best  friend. She survived, endured surgeries, and fought to reclaim her  life, eventually earning her way into Brown University.\n\nThis past weekend, the nightmare returned. While studying for finals  in her dorm, Mia was forced to shelter…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698292/gun-safety-in-america"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "…having communicated better now with my dear colleague from  Alaska, I would yield to the junior Senator from the State of Alaska.\n\nMr. WICKER. Mr. President, I wonder if I could reclaim my time to ask  my distinguished friend from Alaska a question.\n\nMr. WICKER. Mr. President, yes, that is correct.\n\nI would then ask my distinguished friend from Alaska: Isn't…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690110/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…make the laws, and these  agencies are making rules. I think Congress is entitled to speak on  this issue.\n\nAlongside President Trump, House Republicans are on a mission to  reclaim American energy dominance, and that means continuing to  eliminate President Biden's burdensome energy regulations that have  limited consumer choice. Again, we represent…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688546/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…underlying  statute: killing the natural gas tax once and for all. It is critical  to negate these punitive regulatory requirements now to ensure that the  United States can reclaim its place as the world leader in energy for  generations to come.\n\nIn the waning days of the Biden administration, the EPA doubled down  on Biden's disastrous energy policies,…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688184/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…rule.\n\nWe should vote. This is a tax, plain and simple. Taxes should not be  enacted by one person.\n\nSo I will vote today to end the emergency. I will vote today to try  to reclaim the power of taxation, the power of the tariff to where the  Constitution designated it should properly be, and that is in Congress.", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689478/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "French Hill", "party": "Republican", "sentence": "…support of H.R. 2384, the Financial Technology  Protection Act.\n\nLast week, the House passed critical digital asset legislation,  setting the stage for the United States to reclaim our global  leadership position in financial technology on digital assets. This  week, we build on that momentum to further strengthen our role in  global finance.\n\nAs our…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693963/financial-technology-protection-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…in the  115th Congress and has moved through committee for the last three  Congresses. It is time we passed this commonsense, bipartisan piece of  legislation that will help reclaim abandoned mine lands and clean up  our local estuaries.\n\nMr. Speaker, I urge my colleagues to join me in supporting H.R.\n\nMr. WESTERMAN. Mr. Speaker, in closing, this bill…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691092/community-reclamation-partnerships-act-of-2025"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…at the U.S.-Canada border because of the  actions taking place, so, yes, there were deaths going on in New York.\n\nMr. MAST. Mr. Speaker, I am going to end this colloquy and reclaim my  time.\n\nMr. MAST. I note for the record, again, ample opportunities have been  given for my colleague, who represents New York, to just say 5,000  fentanyl-related deaths…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699965/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Thomas Massie", "party": "Republican", "sentence": "…will triumph over deception and  obfuscation. Transparency will triumph over dark money. Partisanship  will fall away to bipartisanship, and grass-roots, the people, will  reclaim the people's House with this vote.\n\nIt is going to be a victory for survivors; not just survivors of the  Epstein sex trafficking scandal, but the 1,000 survivors who exist.…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696903/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision-providing-for-consideration-of-h-con-res-denouncing-the-horrors-of-socialism-providing-for-consideration-of-hr-unlocking-our-domestic-lng-potential-act-of-providing-for-consideration-of-hr-researching-efficient-federal-improvements-for-necessary-energy-refining-act-providing-for-consideration-of-hr-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-providing-for-consideration-of-hr-district-of-columbia-cash-bail-reform-act-of-and-for-other-purposes"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…is coming back over to  the House. We shouldn't have a 23-year-old authorization for the use of  military force continuing to be under use. I hope that we in the House  will reclaim those portions of congressional authority.\n\nI think this is an important step. It is critically important for due  process. I hope my colleagues in the Chamber will support…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697203/count-the-crimes-to-cut-act"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…want to preserve the divisions of power that protect us and our  children from the rule of one person. That is why I will today vote to  end this emergency. I will vote to reclaim the taxation power of  Congress, where the Constitution properly places it, and I urge the  Members of my party to do the same.", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690543/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…needs are over.\n\nI am proud to rise in support of H.J. Res. 35 to repeal the Biden  administration's harmful rule establishing a natural gas tax and help  the United States reclaim energy dominance.\n\nThe Biden administration had an all-out war on fossil fuel. On their  way out the door, the previous administration finalized this burdensome  rule to effectively…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688181/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…Act takes critical steps to safeguard our institutions,  protect our students, and preserve American values. We must not allow  profit to overshadow patriotism. It is time to reclaim our universities  and secure our future. I urge my colleagues to vote ``yes'' on this  legislation.", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689036/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Mr. Speaker, this issue right now, which is a matter of urgency and  needs to be dealt with before the end of the year, is an opportunity  for the House to change course, to reclaim its legislative authority,  to actually drive policy in the right way, and to become the people's  House again by actually serving the American people in a way that will…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697549/congratulating-eco-clean-solutions"}]