[{"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…That is what those assistant U.S. attorneys, including the former  acting head of the U.S. Attorney's Office that had been installed by  the Trump administration on my recommendation who did an incredible job  through the horrific assassination of former Speaker Melissa Hortman  and her husband and also was there at the side for the families when  those…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700059/9999"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…rest on our laurels in the Senate. We  don't rest on our laurels with the work we do. C-SPAN doesn't rest on  their laurels. And when I get to the end here, I will have a  recommendation so that more people will have access to C-SPAN.\n\nSo we are celebrating 39 years of C-SPAN's coverage of the Senate.  And it is worth looking back at what was going on in…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691704/senate-resolution-259-recognizing-june-as-the-39th-anniversary-of-c-span-chronicling-democracy-in-the-senate"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…hospitalizing more than 140 police  officers on January 6. Several officers died in the subsequent weeks,  and several people died on that day.\n\nNow, we have passed a law, not a recommendation, not an idle promise,  and not a suggestion in a suggestion box, we passed a law to post this  plaque in the U.S. Capitol. Yet Speaker Johnson has done absolutely  nothing…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691242/leosa-reform-act"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "…Transportation Safety Board has recommended requiring technology to  help pilots detect nearby aircraft in real time and avoid collisions.\n\nThe ROTOR Act finally acts on that recommendation by requiring  technology to help avoid collisions, aligning military and civilian  safety standards, strengthening coordination and closing dangerous gaps  in our aviation…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700108/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…tragically took 67 lives, but it was preventable. It is our duty to do  everything we can to keep this tragedy from ever happening again.\n\nThis bill would implement a central recommendation from the NTSB's  final report on the collision: a requirement to use Automatic Dependent  Surveillance-Broadcast technology, ADS-B Out and In.\n\nNTSB has recommended an…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700105/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…that the  Commission amend its rules to ensure that this gap is better identified  and quantified for investors via disclosed ratio.\n\nThis commonsense bill adopts this recommendation to ensure that  investors have the clearest information available to make the best  decisions for themselves. This bill is supported by the Council of  Institutional Investors,…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693914/enhancing-multi-class-share-disclosures-act"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…top 5  percent of officers I have encountered in 18 years of military service.\n\nAnother, an aviator with 60 combat missions under her belt, earned  the strongest possible recommendation for promotion, and I quote her  commander directly, who attested: ``People thrive under her  leadership.''\n\nA third, a noncommissioned officer and instructor, was called…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693974/transgender-americans-serve-with-honor"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…sparingly, such as in emergencies       and for amendments covering minor technical matters. The       Richardson Waiver explained that the new policy implemented a       recommendation by the Administrative Conference of the United       States (ACUS), and that the public benefit from greater       participation in rulemaking should outweigh any…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694840/government-accountability-office-legal-opinion"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…Congress intended.\n\nCongress said in the law that any deal on the sale of TikTok must  include a transfer of the ownership of TikTok's source code, training  data, and recommendation algorithms. This may be, for some people, not  really clear, but we would not let the Chinese Government own ABC or  NBC, and we shouldn't let them broadcast their content…", "date": "2025-06-18", "source_url": "https://justfacts.votesmart.org/public-statement/1692683/tiktok"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…Internal Revenue Service currently are  experiencing.\n\nMr. DAVIS of Illinois. Mr. Speaker, H.R. 997 is a commonsense,  bipartisan piece of legislation and is the product of a recommendation  made by the Taxpayer Advocate. Therefore, Mr. Speaker, I urge its  passage, and I yield back the balance of my time.", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689380/national-taxpayer-advocate-enhancement-act-of-2025"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…departments to employ qualified, trained  corrosion control professionals who have completed federally registered  apprenticeship programs.\n\nThis legislation also builds on a recommendation from the National  Transportation Safety Board and directs the Department of  Transportation to study and generate best practices for inspecting and  addressing corrosion…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693007/introduction-of-the-bridge-corrosion-prevention-and-repair-act-of-2025"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…to it, your  indulgent reception of my sentiments on a former and not dissimilar  occasion.\n\nInterwoven as is the love of liberty with every ligament of your  hearts, no recommendation of mine is necessary to fortify or confirm  the attachment.\n\nThe unity of government which constitutes you one people is also now  dear to you. It is justly so; for it…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700163/reading-of-washingtons-farewell-address"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…submit a report to Congress containing  recommendations on how to reduce train noise and vibrations near homes,  as well as estimates of the costs and benefits of each such  recommendation. The report would include recommendations regarding  modifications to trains, tracks and maintenance procedures, speed  limits, mitigation measures between tracks and homes,…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689433/introduction-of-the-train-noise-and-vibrations-reduction-act-of-2025"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…Hepatitis B.\n\nThis will lead to more disease, cancer, and preventable deaths. It  will increase healthcare costs.\n\nI am calling on acting CDC Director O'Neill to reject this  recommendation and protect our children.\n\nI continue to call on RFK, Jr. to resign. His time at HHS has been an  embarrassment and has caused deep harm to our country.\n\nTo lead our Nation's…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697767/vaccines-are-a-great-invention"}, {"senator": "Greg Casar", "party": "Democrat", "sentence": "…lawfully made;\n\nWhereas, individuals who served with Representative Cory Mills have  called into question the veracity of the account of events which formed  the basis of a recommendation that Representative Cory Mills receive an  award of a Bronze Star, bestowed in 2021, for his service under enemy  fire in Iraq in 2003;\n\nWhereas, in August 2024, Representative…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695580/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Accords Declaration.\n\n``(e) National Security.--Nothing in this section shall be       construed to require any action inconsistent with a national       security recommendation provided by the Federal       Government.''.\n\n(b) Report to Congress.--\n\n(1) In general.--Not later than 3 years after the date of       enactment of this Act, the Secretary…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697276/mikaela-naylon-give-kids-a-chance-act"}, {"senator": "Richard McCormick", "party": "Republican", "sentence": "…encourages them to test U.S. resolve.\n\nThis is not a distant theater. This is our hemisphere. Supporting the  President's authority is not a blank check for war. It is a  recommendation that timely, flexible military posturing is what  prevents war, and in this case protects Americans against the most  lethal attack ever on the American people and the…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698454/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…monumental  progress in just a few short months. Let me give you a few examples.\n\nThe Department of the Treasury started its first automated payment  verification system at the recommendation of DOGE. So far, more than  $300 million has been identified in improper payment requests.\n\nOver at the Centers for Medicare and Medicaid Services, the  government has…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690662/department-of-government-efficiency"}, {"senator": "French Hill", "party": "Republican", "sentence": "…(xviii) other land use measures that promote access to new       housing opportunities identified by the Secretary; and\n\n(C) consider--\n\n(i) the effects of adopting any recommendation on       eligibility for Federal discretionary grants and tax credits       for the purpose of housing or community development;\n\n(ii) coordination between infrastructure…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…and       Transportation of the Senate to include--\n\n(A) a description of the recommendations that the service       intends to implement;\n\n(B) a justification for each recommendation that the       service does not intend to implement; and\n\n(C) an implementation strategy and timeline.\n\n(g) Secretary of the Coast Guard.--Subtitle I of title 14,…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…information with the Secretary or Assistant       Secretary;\n\n(2) to request assistance from the Secretary or Assistant       Secretary; or\n\n(3) to implement any measure or recommendation suggested by       the Secretary or Assistant Secretary in response to a request       by the private entity.\n\n(i) Protection of Voluntarily Shared Critical Supply Chain…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690188/promoting-resilient-supply-chains-act-of-2025"}, {"senator": "Troy Nehls", "party": "Republican", "sentence": "Mr. NEHLS. Mr. Speaker, I rise today to speak on the legislation  before us, the ROTOR Act.\n\nThe ROTOR Act seeks to fulfill a longstanding recommendation from the  National Transportation Safety Board to require ADS-B In technology on  aircraft operating in our national airspace system. That recommendation  reflects years…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700109/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…Congress,  by George Washington.\n\nAlexander Hamilton's ``Report on Manufacturers'' is well known.  According to Professor Douglas Irwin of Dartmouth College, every tariff  recommendation put forth in the report was adopted by Congress in 1792.  But simply voting on tariffs does not convert them into a good idea. It  could make them constitutional. It could…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689478/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…disabilities.--Notwithstanding       subsection (a), a covered entity may take a qualified       individual's disability into account when making a health       care treatment or coverage recommendation or decision, solely       to the extent that the disability has been found by a       physician, following an individualized evaluation of the       potential recipient,…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692719/charlotte-woodward-organ-transplant-discrimination-prevention-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…with the       Secretary;\n\n(2) require a private entity to request assistance from the       Secretary;\n\n(3) require a private entity to implement any measure or       recommendation suggested by the Secretary in response to a       request by the private entity; or\n\n(4) require the adoption of the best practices described in       subsection (c).…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692733/deploying-american-blockchains-act-of-2025"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…you don't agree with. We all have to agree,  Mr. Speaker, that as we just saw a few weeks ago, Moody's downgraded  the credit rating of the United States.\n\nIt wasn't a recommendation, Mr. Speaker. It wasn't a warning that if  you folks don't get your fiscal house in order this might happen. They  actually did it. They downgraded the credit rating of…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692544/rescissions-act-of-2025"}, {"senator": "Randy Feenstra", "party": "Republican", "sentence": "…taxpayer.\n\nWith this improvement, American families will benefit from fewer  headaches when dealing with the IRS and a more accountable government.\n\nThis bill itself is a recommendation from the National Taxpayer  Advocate Purple Book and has been a recommended policy change for quite  a few years.\n\nMr. Speaker, I thank Chairman Smith, again, for working…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689379/national-taxpayer-advocate-enhancement-act-of-2025"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…aviation medical examiners;\n\n(3) if the Administrator determines appropriate, delegate       additional authority to aviation medical examiners consistent       with the recommendation of the Mental Health Aviation       Rulemaking Committee described in section 5; and\n\n(4) improve the special issuance process for pilots and air       traffic controllers.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695004/mental-health-in-aviation-act-of-2025"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…aircraft with a maximum certificated       takeoff weight of less than 12,500 pounds when operating       under part 91 of title 14, Code of Federal Regulations, a       recommendation for low cost alternative equipment or       technology in accordance with subsection (e).\n\n(B) Lack of committee consensus.--In the event the       committee does not reach…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700111/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…of the Food and Drug Administration--\n\n(A) educational materials about the Tissue Reference Group;       and\n\n(B) best practices for obtaining a timely, accurate       recommendation regarding human cell and tissue products from       the Tissue Reference Group.\n\n(2) Public information.--Not later than 1 year after the       date of the enactment of…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692768/shandra-eisenga-human-cell-and-tissue-product-safety-act"}]