[{"senator": "James Walkinshaw", "party": "Democrat", "sentence": "Mr. WALKINSHAW. Mr. Speaker, I rise today to recognize the Korean  American Association of the Washington Metropolitan Area (KAAW) and its  President, Steve Lee, on the occasion of the 22nd KORUS Festival.\n\nAs one of the largest…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696020/recognizing-the-korean-american-association-of-the-washington-metropolitan-area-and-the-2025-korus-festival-volunteers"}, {"senator": "Susie Lee", "party": "Democrat", "sentence": "Ms. LEE of Nevada. Mr. Speaker, I rise today to recognize two  extraordinary women, Dr. Lynn Kowalski and Dr. Stephanie Wishnev, for  completing one of the TransAmerica routes. It is one of the most  challenging cycling endeavors…", "date": "2025-10-14", "source_url": "https://justfacts.votesmart.org/public-statement/1696210/recognizing-dr-lynn-kowalski-and-dr-stephanie-wishnev-for-completing-the-transamerica-route"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "Mrs. SYKES. Mr. Speaker, today, I rise to recognize Reese Gallagher  as the champion of the week for Ohio's 13th Congressional District.\n\nReese is a senior at Archbishop Hoban High School, and she was named  the Girls' Division…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697073/champion-of-the-week-reese-gallagher"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "Mr. LATIMER. Mr. Speaker, I want to recognize an important faith  institution in the city of White Plains celebrating its 90th year of  worship and service: Calvary Baptist Church.\n\nThe leadership and congregants have…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697280/calvary-baptist-church"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…these rural communities have a  future that is not dependent on Federal funding but that has a  diversified economy that uses our natural resources wisely.\n\nI think we can all recognize what a special moment this is for our  rural communities. These days, Democrats and Republicans don't often  see eye to eye long enough to get a piece of legislation like…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697655/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "Mr. DAVIS of Illinois. Mr. Speaker, I rise today to recognize the  month of April as Sarcoidosis Awareness Month.\n\nSarcoidosis is a rare inflammatory disease characterized by the  formation of granulomas--tiny clumps of inflammatory…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689983/recognizing-the-month-of-april-as-sarcoidosis-awareness-month"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "Ms. SCHOLTEN. Mr. Speaker, I rise today to congratulate and recognize  the Kent District Library (KDL) on an extraordinary achievement. KDL's  Talking Book & Braille Center has been honored as the 2025 Library of  the Year by the National Library…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694075/recognizing-the-kent-district-librarys-talking-book-braille-center"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize Caden Beiser  for earning the Arvada Wheat Ridge Service Ambassadors for Youth Award.\n\nCaden has overcome many challenges along his journey to success,  demonstrating perseverance…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691240/recognizing-caden-beiser"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "Mr. LATIMER. Mr. Speaker, I thank Mr. McGarvey for yielding.\n\nMr. Speaker, I recognize the colleagues who have joined me in leading  this bill, Congressman Alford of Missouri, Congressman Mfume of  Maryland, and Congresswoman Goodlander of New Hampshire. I…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691761/transparency-and-predictability-in-small-business-opportunities-act"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…Congress, make choices that help families meet  their needs and stay connected.                       Champion of the Week: Aarit Koul\n\nMrs. SYKES. Mr. Speaker, today, I rise to recognize Aarit Koul as the  champion of the week for Ohio's 13th Congressional District.\n\nAarit, a freshman at Jackson High School, recently won the 2025  National Civics Bee. He…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696852/higher-costs-of-everyday-life"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "Mr. PALLONE. Mr. Speaker, I rise today to recognize and congratulate  Dr. Bruce Siegel on his retirement after an extraordinary career as a  leader in public health, hospital administration, and health policy.  Bruce has spent…", "date": "2025-10-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696206/recognizing-dr-bruce-siegel"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize Noah Trask for  earning the Arvada Wheat Ridge Service Ambassadors for Youth Award.\n\nNoah has overcome many challenges along his journey to success,  demonstrating perseverance…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691078/recognizing-noah-trask"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "Ms. MORRISON. Mr. Speaker, I rise today to recognize and honor Sue  Abderholden for her decades of tireless service and steadfast  commitment to Minnesotans living with disabilities and mental  illnesses.\n\nFor the past 24 years,…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690723/recognizing-sue-abderholden-for-her-work-on-behalf-of-those-with-disabilities-and-mental-illnesses"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize Arturo Aro for  earning the Arvada Wheat Ridge Service Ambassadors for Youth Award.\n\nArturo has overcome many challenges along his journey to success,  demonstrating perseverance…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690165/recognizing-arturo-aro"}, {"senator": "Ilhan Omar", "party": "Democrat", "sentence": "Ms. OMAR. Mr. Speaker, I rise to congratulate and recognize the  extraordinary bravery of Tesfaye Deyasso, who was named the 2025  National Hero of the Year by the National Association of Letter  Carriers.\n\nOn April 18, 2024, Mr.…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690461/recognizing-the-extraordinary-bravery-of-tesfaye-deyasso"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "Mrs. McCLAIN. Mr. Speaker, I rise today to recognize Community First  Health Centers, a truly remarkable organization that has spent the last  50 years delivering accessible, high-quality, patient-centered health  care, driven…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694747/recognizing-community-first-health-centers-on-50-years-of-service-to-the-ninth-congressional-district"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Judy Salvador has made through her work with  Metropolitan Ministries. Judy has been a dedicated volunteer at  Metropolitan Ministries…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1690992/recognizing-judy-salvador"}, {"senator": "Mike Kelly, Jr.", "party": "Republican", "sentence": "Mr. KELLY of Pennsylvania. Mr. Speaker, I rise to recognize Mercer  County Pennsylvania as they commemorate their 225th Anniversary. It is  with immense pride that we acknowledge 225 years of history, community,  and resilience. This…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689795/recognizing-mercer-county-pennsylvanias-225th-anniversary"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Jordan French has made through his work with the  Pasco County Human Services Team. The Pasco County Human Services Team  has proven itself…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690850/recognizing-jordan-french"}, {"senator": "French Hill", "party": "Republican", "sentence": "…their  water from the Nile.'' In that spirit, Egypt has work to do.                        Recognizing Dr. Cam Patterson\n\nMr. HILL of Arkansas. Mr. Speaker, I rise today to recognize the  leadership of Dr. Cam Patterson, our former chancellor of the  University of Arkansas for Medical Sciences.\n\nLast year, Dr. Patterson announced his decision to step…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698914/warmth-of-collectivism"}, {"senator": "Kat Cammack", "party": "Republican", "sentence": "Mrs. CAMMACK. Mr. Speaker, I rise today to recognize and honor  Captain Floyd Blair of Marion County, Florida, who celebrated his 105th  birthday on November 15, 2025.\n\nCaptain Blair's life is a complete representation of the…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697045/recognizing-captain-floyd-blair"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…do next to strengthen our communities  through more affordable housing.                    Celebrating 100 Years of Bryan Health\n\nMr. FLOOD. Mr. Speaker, today, I rise to recognize and celebrate a  truly remarkable milestone for the city of Lincoln and the entire State  of Nebraska, the 100th Anniversary of Bryan Health.\n\nSince first opening its doors…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690724/recognizing-first-national-bank-of-omaha"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "Mr. THOMPSON of Pennsylvania. Mr. Speaker, I rise today to recognize  a major milestone in Centre County: the graduation of the 500th first  responder from the Centre County Crisis Intervention Team Training  Program.\n\nSince 2011, this initiative…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693519/recognizing-centre-county-crisis-intervention-team"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…This bill will give more opportunities to Americans to  invest with not as many regulations in their way. With these  challenging times overseas, it is nice to see that we recognize that  economic security equals national security, and by expanding the  qualified investor rule, which will give exactly that: more opportunity  to others.\n\nThis bill, led…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692777/fair-investment-opportunities-for-professional-experts-act"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…that no American, whether elected official or private citizen, should  live in fear of being targeted for their beliefs, their vote, or their  service.\n\nI would also like to recognize the valiant effort of law enforcement  in tracking down and capturing the suspect in this case.\n\nDespite knowing the danger the alleged murderer posed, for 40 hours,  officers…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692859/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…finally eliminate Hezbollah and stop reporting to their  handlers in Tehran, any more funds to the Lebanese military are simply  unjustifiable.\n\nI encourage my colleagues to recognize the pressing danger that still  exists within the Lebanese military and vote for my amendment.\n\nMr. STEUBE. Madam Chair, may I inquire as to the time remaining.\n\nMr. STEUBE.…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693678/department-of-defense-appropriations-act-2026"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…this the policy of our country going forward.    El Dorado County Title 25 Program Supports Community of Grizzly Flats\n\nMr. KILEY of California. Mr. Speaker, I rise today to recognize a  significant milestone in the community of Grizzly Flats: the  groundbreaking of the first home under the new El Dorado County title  25 program created to support the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…healthcare access and workforce training across Iowa.                     Recognizing Keokuk Area Hospital Project Funding\n\nMrs. MILLER-MEEKS. Mr. Speaker, I rise today to recognize the  $825,000 in community project funding I secured to restore critical  healthcare access in Lee County through the Keokuk Area Hospital  project.\n\nSince Keokuk lost its…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696794/highlighting-critical-investments"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "…anniversary  celebration, it has been a privilege over the past decade to work on  bipartisan legislation to honor 250 years of America's independence.\n\nBefore I go on, I must recognize what a privilege it has been to  serve with my Democrat sponsor of this legislation, Bonnie Watson  Coleman.\n\nUnfortunately, she is retiring after this Congress, following…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699869/for-americas-250th-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "Mr. THOMPSON of Pennsylvania. Mr. Speaker, I rise today to recognize  April as the Month of the Military Child. While we rightly honor the  service and sacrifice of the men and women in our military, April  reminds us that service comes in…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690368/recognizing-april-as-the-month-of-the-military-child"}]