[{"senator": "Juan Vargas", "party": "Democrat", "sentence": "Mr. VARGAS. Mr. Speaker, I rise today to recognize an extraordinary  public servant, Ally Castaneda, who is departing my office and  Washington, D.C. for a new role.\n\nAlly has been an outstanding member of my team since 2022.…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693025/recognizing-ally-castaneda"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize Diego Estrada  Ponce for earning the Arvada Wheat Ridge Service Ambassadors for Youth  Award.\n\nDiego has overcome many challenges along his journey to success,  demonstrating…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690381/recognizing-diego-estrada-ponce"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize Vincent Medina  for earning the Arvada Wheat Ridge Service Ambassadors for Youth Award.\n\nVincent has overcome many challenges along his journey to success,  demonstrating…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691907/recognizing-vincent-medina"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…mob storms the U.S. Capitol, and when a gunman tries to  assassinate the President of the United States, it is not enough to  just condemn these acts and move on. We need to recognize something  needs to change. Condemning violence is only the first step-- necessary--but a first step. We must all work together to address  violence's root causes. We must…", "date": "2025-06-16", "source_url": "https://justfacts.votesmart.org/public-statement/1692580/national-protests"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "Mr. PALLONE. Mr. Speaker, I rise today to recognize the Deal First  Aid Squad as they celebrate their 75th Anniversary this year.\n\nIn 1950, residents of the Borough of Deal, New Jersey founded the  Deal First Aid Squad to…", "date": "2025-08-05", "source_url": "https://justfacts.votesmart.org/public-statement/1694713/recognizing-the-75th-anniversary-of-the-deal-first-aid-squad"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…blessing, and may we continue to honor them with  action, compassion, and resolve.                        Recognizing Chief Jeremy Story\n\nMr. VASQUEZ. Mr. Speaker, I rise today to recognize an exceptional  public servant from my district, Chief Jeremy Story.\n\nChief Story is from the Las Cruces Police Department, my hometown,  and he is someone I was proud to…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691300/national-police-week"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "Mr. MARKEY. Mr. President, I rise today to recognize and congratulate  the Boston Passport Agency on its 100th anniversary. For a century, the  dedicated public servants at the Boston Passport Agency have connected  the people…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695617/recognizing-the-boston-passport-agency"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "Mr. VASQUEZ. Mr. Speaker, I rise today to recognize Ronnie Torres for  his outstanding contributions to Belen, New Mexico. Ronnie is an  exceptional citizen and neighbor who tirelessly dedicates his time and  energy to improving…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699893/recognizing-ronnie-torres"}, {"senator": "Sam Liccardo", "party": "Democrat", "sentence": "Mr. LICCARDO. Madam Speaker, I rise today to recognize the  extraordinary life of Colonel Vu Van Loc, a South Vietnamese Army  veteran and beloved community member and leader in San Jose, for his  selfless dedication to Vietnamese…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698268/recognizing-the-life-of-colonel-vu-van-loc"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize Alyssa Sayers  for earning the Arvada Wheat Ridge Service Ambassadors for Youth Award.\n\nAlyssa has overcome many challenges along her journey to success,  demonstrating perseverance…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691840/recognizing-alyssa-sayers"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize Tom Downey of  Ireland Stapleton, PC for being named Lawyer of the Year. Additionally,  Tom has been named one of The Best Lawyers in America for  Administrative and Regulatory…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696277/recognizing-tom-downey"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize Alicia Montoya  for earning the Arvada Wheat Ridge Service Ambassadors for Youth Award.\n\nAlicia has overcome many challenges along her journey to success,  demonstrating…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689448/recognizing-alicia-montoya"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…This is a strange development.\n\nIn the last Congress, the 118th Congress, we passed H. Con. Res. 40  to honor local law enforcement. We also passed H. Res. 363 in 2023 to  recognize the police lives lost that year and the importance of funding  and supporting all law enforcement, Federal, State, county, and local.  These were followed by H. Con. Res.…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691030/expressing-support-for-local-law-enforcement-officers"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…to celebrate the possibility of a  Women's History Museum is incredible. First, it is incredible because  why has it taken it so long, and, second, because it is time to  recognize the contributions of women in this country.\n\nOf course, the women from Ohio who are the heart of it all will  certainly be very much previewed and modelled in this museum,…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689366/womens-history-month"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…In 2010, the United Nations General Assembly adopted a resolution  calling for an International Day Against Nuclear Tests. Thus, August  29th was selected to commend and recognize Kazakhstan's honorable  decision to close the Semipalatinsk test site and renounce nuclear  weapons.\n\nWith Cold War-style nuclear saber-rattling becoming the new norm, it…", "date": "2025-08-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694764/marking-the-15th-annual-international-day-against-nuclear-tests"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "Mr. BARRETT. Mr. Speaker, I rise today to honor a true legend in the  Michigan veteran community. It is with deep respect and heartfelt  appreciation that I get to recognize Commander Leonard Huyck for  extraordinary service and steadfast leadership of VFW Post 8964.\n\nSince being elected Post Commander in May of 1983, Leonard has  dedicated forty-two…", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691688/recognizing-commander-leonard-huyck"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "Mrs. McCLAIN. Mr. Speaker, I rise today to recognize an outstanding  young leader in our community, Kacee Gray, who has been named the Cass  City Junior Citizen of the Year for 2025. Kacee exemplifies the values  of hard work,…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689670/recognizing-kacee-gray-as-cass-citys-2025-junior-citizen-of-the-year"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…establish October 10--the 10th month, 10th  day--recognized by the Roman numerals XX, like the female sex  chromosome, as American Girls in Sports Day, setting aside a day to  recognize the accomplishments of 3 million high school and college  female athletes.\n\nIn addition to celebrating female athletes, this resolution calls on  sports governing bodies…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688449/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "Mr. OBERNOLTE. Mr. Speaker, I rise today to recognize the 65th  anniversary of the Mojave Water Agency, an institution that has stood  as a pillar of responsible stewardship, innovation, and public service  in California's High…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694201/recognizing-the-mojave-water-agency-on-the-occasion-of-its-65th-anniversary"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, it is a privilege to rise today to  recognize Mr. Jose Santiago for his service at Withlacoochee River  Electric Cooperative (WREC) and his remarkable role in the Light Up  Navajo Project. In May, a courageous team of…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692641/recognizing-jose-santiago"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "Mr. SMUCKER. Mr. Speaker, I am pleased to congratulate and recognize  the Penn Manor Future Farmers of America chapter (Manor FFA),  affiliated with Penn Manor High School in Lancaster County,  Pennsylvania, on their accomplishments at the…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697257/congratulating-the-manor-future-farmers-of-america"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "Mr. SMUCKER. Mr. Speaker, today I rise to recognize and thank an  extraordinary public servant, Joanne Horn, who has retired after  decades of faithful service to the people of Pennsylvania's 11th  Congressional District.…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698569/recognizing-and-thanking-joanne-horn"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "…SHREVE. Mr. Speaker, I rise in recognition of our law enforcement  community in Indiana's Sixth District and across our Hoosier State.\n\nPolice Week is a time for all of us to recognize and honor those  serving our communities and, most especially, those who have given  their lives in the line of duty.\n\nThis week, I was joined by our Johnson County Sheriff…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691339/recognizing-indianas-sixth-district-law-enforcement-community"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "Mr. THOMPSON of Pennsylvania. Mr. Speaker, I rise today to recognize  the 41st anniversary of the CBYX exchange program and to thank David  Byrne, a current participant and intern in my office.\n\nThe CBYX program is jointly funded by the U.S.…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688275/recognizing-41st-anniversary-of-cbyx-exchange-program"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…Speaker, I ask my colleagues to join me in paying special tribute  to Rania Brown of Avon High School. On behalf of the people of the  Fifth District of Ohio, I am proud to recognize this great achievement.", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693391/special-recognition-of-rania-brown-for-winning-the-division-i-state-track-and-field-title-for-the-discus-throw"}, {"senator": "Morgan Luttrell", "party": "Republican", "sentence": "Mr. LUTTRELL. Mr. Speaker, I rise today to recognize and honor an  extraordinary public servant, a trusted leader, and dear friend, my  chief of staff, Ms. Christine Lee, who is actually retiring after a  distinguished career…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699672/recognizing-christine-lee"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Mr. Harry White has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690669/recognizing-harry-white"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "Mr. FALLON. Mr. Speaker, I rise today to recognize Mr. Thomas McCall  of Frisco, Texas, and present him with the Congressional Patriot Award.  He has served and uplifted our community through his leadership and  dedication.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695482/recognizing-congressional-patriot-award-recipient-thomas-mccall"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Mr. Sean Arnold has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691984/recognizing-sean-arnold"}, {"senator": "David Taylor", "party": "Republican", "sentence": "Mr. TAYLOR. Mr. Speaker, I rise today to recognize the Girl Scouts of  Western Ohio. These hardworking and dedicated Scouts are agents for  positive change in their communities and work every day to create a  better world.…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690079/congratulating-girl-scouts-of-western-ohio-on-gold-award"}]