[{"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "Ms. CROCKETT. Mr. Speaker, I rise today to recognize the outstanding  contributions of the physicians at Dallas Endoscopy Center (DEC) to the  health and well-being of the residents of Texas' 30th Congressional  District. For almost two decades,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695923/recognizing-the-physicians-at-dallas-endoscopy-center"}, {"senator": "Marc Veasey", "party": "Democrat", "sentence": "Mr. VEASEY. Mr. Speaker, I rise today to recognize the outstanding  contributions and enduring legacy of the Junior League of Arlington  (JLA), an organization that has been empowering women and strengthening  the Arlington community for…", "date": "2025-10-28", "source_url": "https://justfacts.votesmart.org/public-statement/1696424/recognizing-the-junior-league-of-arlington-empowering-women-strengthening-community"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…a difference--lifting others as they  lead and setting powerful examples for future generations. It is a  privilege to celebrate their accomplishments and recognize their  outstanding contributions.\n\nBusinesswoman of the Year--Monika Mueller: Monika's journey to  becoming Chief Strategy Officer is a true testament to her visionary  leadership, relentless…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690568/virginias-fourth-district-women-in-excellence-awards"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "Mr. LATIMER. Mr. Speaker, I rise to recognize the outstanding  contributions made by At Home on the Sound to benefit senior citizen  residents of Larchmont and Mamaroneck. Tonight, they are celebrating  their 15th anniversary with their…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691311/recognizing-at-home-on-the-sound"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "Mr. HIMES. Mr. Speaker, it is with great respect and admiration that  I recognize the outstanding contributions of Nick Alton, who has served  as Minister Counsellor Political at the British Embassy in Washington  for the past four years. Throughout his tenure, Nick…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698086/recognizing-nick-alton"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Carol Brisbois has made through her work with  Metropolitan Ministries. Carol has been a dedicated volunteer at  Metropolitan Ministries since 2016. Monday…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690148/recognizing-carol-brisbois"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Ms. Patricia Furlong has made to our community  through her volunteerism with the Pregnancy & Family Life Center. Ms.  Furlong is part of a team of selfless…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691825/recognizing-patricia-furlong"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Mr. Brody Verosic has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690146/recognizing-brody-verosic"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Charles A. ``Charlie'' Rogers has made through his  work with Habitat Tampa Bay Gulfside. Charlie Rogers has been on  Habitat's Board of Directors since…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690164/recognizing-charles-a-rogers"}, {"senator": "Barry Moore", "party": "Republican", "sentence": "Mr. MOORE of Alabama. Mr. Speaker, today, I rise to recognize the  outstanding contributions, hard work, and legacy of Colonel Richard  Tucker. His dedicated service to Alabama and the United States has made  a lasting impact on the lives of many.…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690779/recognizing-the-accomplishments-of-colonel-richard-tucker"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Fernando Serrano has made through his work with the  Pasco County Human Services Team. The Pasco County Human Services Team  has proven itself to be a…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690698/recognizing-fernando-serrano"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Victoria Barley has made through her volunteerism  with Youth and Family Alternatives. For more than 15 years, Victoria  Barley has been a remarkable…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692476/recognizing-victoria-barley"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Pricilla Cruz-Seado has made to our community  through her work with New Beginnings Youth Shelter, which serves  homeless kids aged 10 to 17 who are between…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691746/recognizing-pricilla-cruz-seado"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Krystal Martinez has made to our community through  her work with New Beginnings Youth Shelter which serves homeless kids  aged 10-17 who are between…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691063/recognizing-krystal-martinez"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Andrea Read has made to our community as a volunteer  for Brooksville Main Street. Andrea embodies the true spirit of a Local  Hero through her unwavering…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690145/recognizing-andrea-read"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that James ``Jay'' Sheridan has made through his work  with the Greater Tampa Bay Area Council of Scouting America. Jay  Sheridan is currently a Scoutmaster…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690805/recognizing-james-sheridan"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Ms. Ruth Gavish has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691963/recognizing-ruth-gavish"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Frank Cassara has made to our community through his  volunteerism at A New Generation. Frank has dutifully served A New  Generation for five years as…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690690/recognizing-frank-cassara"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. I rise today to recognize the outstanding  contributions that Alyssa Reas has made through her volunteerism at  Gulf Highlands Elementary School. Alyssa stepped onto the campus with  big plans to support students.…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690144/recognizing-alyssa-reas"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Felicia Jones has made to our community through her  work with New Beginnings Youth Shelter which serves homeless kids aged  10-17 who are between foster…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690657/recognizing-felicia-jones"}]