[{"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…rescission to unilaterally cancel even more  foreign aid.\n\nOf deep concern to myself and Marylanders, President Trump has  threatened to rescind funding that is vital to the reconstruction of  the Francis Scott Key Bridge in Baltimore, a project critical not only  to our local economy but to the Nation as a whole.\n\nI urge my colleagues to insist that any…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695661/healthcare-subsidies-and-rescissions"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…SEC's registration  and regulatory framework.\n\nCongress passed legislation in 1945 and 1955, exempting other arms of  the World Bank, including the International Bank for Reconstruction and  Development and the International Finance Corporation, from SEC's  regulations.\n\nImportantly, this gave the SEC the ability to recall these exemptions  if the SEC…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693972/aligning-sec-regulations-for-the-world-banks-international-development-association-act"}, {"senator": "André Carson", "party": "Democrat", "sentence": "…man to report on Congress  and be allowed into the Capitol press gallery, where he was a member  from 1871 to 1875. He covered the critical debates in Congress during  reconstruction, including developments on the 13th, 14th and 15th  Amendments to the Constitution.\n\nThere is a plaque and a painting of Douglass in the Press Gallery.  But it's past time…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692225/designating-the-house-press-gallery-in-the-united-states-capitol-as-the-frederick-douglass-press-gallery"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…Black History Month, we celebrate the generations of Black  Americans whose courage, advocacy, sacrifice, and patriotism have moved  our Nation and the world forward. From Reconstruction and the Great  Migration to the success of Black Wall Street, the jazz age, the Harlem  Renaissance, the civil rights movement, and beyond, there is no time in  history…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687900/black-history-month"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…servitude. And  then, some 50 years later--it took 50 additional years before the right  to vote was guaranteed to women in the United States of America.\n\nAfter the Civil War, reconstruction collapsed in about 1877. There  was kind of an evil deal that was worked out all over the election of  Rutherford Hayes. And that ended reconstruction; and, quickly, a…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690536/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…Heritage Corridor. They will come for those  three national parks we have, including the Congaree National Park.  They  are going to come visit Fort Moultrie, Fort Sumter, the Reconstruction  Era National Historical Park--six big tourist attractions.\n\nI just read the other day that already tourism and visitations at  Myrtle Beach are down over 15 percent already.…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689638/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…really a democracy in 1776 or when the  Constitution was written in the 1787-1789 era. It certainly wasn't a  democracy after the Civil War because right after that, when  Reconstruction ended, the Ku Klux Klan rose up. They reasserted their  right to white supremacy.\n\nAfrican Americans who had been freed from slavery were pushed back  into an ugly version,…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699200/building-a-beloved-community"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…cartel  that even our own DEA doesn't recognize.\n\nJust like the Bush administration insisted earlier on that oil  revenue, not American taxpayers, would cover the cost of reconstruction  in Iraq, Trump is hoping people will buy the fantasy his incursion into  Venezuela will be cost-free. The parallels to Iraq are alarmingly  obvious. In fact, according…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698623/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…came slowly, unevenly, and at a  painful cost, but it came. Along with it, generations of Black  Americans began the long, unfinished journey toward full equality  through Reconstruction, through Jim Crow, through the civil rights  movement, and through the voting rights movement even now in our time.\n\nJuneteenth is not just about history. It is about truth…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692430/2025-juneteenth-major-league-baseball-events-in-birmingham"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…Congress, I have  seen the United States hope that its military interventions abroad  would succeed. I have seen regime changes, nation-building efforts, and  elaborate reconstruction schemes launched with confident predictions of  success, only to have them collapse when encountered with the reality  on the ground.\n\nAnd the reality is this: When we…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698780/venezuela"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…prohibiting the Federal Government and States from  denying or abridging a citizen's right to vote on the account of race,  color, or previous condition of servitude.\n\nDuring Reconstruction, formerly enslaved and free Black men voted and  got elected to office. When Reconstruction ended, though, the former  Confederate States passed new constitutions, including…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689341/fighting-voter-suppression"}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "…don't have the papers to fill what this bill demands. We all know the  history.\n\nDarnella Cavaness, my grandmother from Malvern, Arkansas, had to face  the poll tax. After Reconstruction, nobody wrote the word ``race'' into  a single suppression statute. They wrote poll taxes. They wrote  literacy tests, good character clauses. It was all race neutral on…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699939/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…Nation.\n\nThe dangers don't stop when the flooding ends. Too many of our  families are denied FEMA assistance because current rules and policies  don't cover repairs and reconstruction for most basements where floods  are the most destructive.\n\nWithout Federal assistance, Mr. Speaker, they are forced to live in  extremely unsafe conditions, being exposed…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694123/disastrous-floods"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…challenges  and undertook one of the most ambitious capital programs in its  history. This included a $30 billion transformation of the region's  major airports and the full reconstruction of the Midtown Bus Terminal,  laying the foundation for world class transportation facilities built  for the 21st Century.\n\nMore than the projects completed or milestones…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699560/recognizing-rick-cotton-for-a-lifetime-of-leadership"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…backlash involves is propaganda that breaks up coalitions,  whether it was a coalition of previously enslaved Black men and poor  nonlandowning Whites who came together during Reconstruction to rebuild  this Nation, the backlash to that involved racial terror lynching, or  the lie of white supremacy and a rash of voter suppression laws that  completely ignored…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699197/building-a-beloved-community"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…and supplier       partnerships that enable enhanced resilience of a critical       supply chain during a supply chain shock, including response,       repair, recovery, reconstruction, insurance, or continuity.\n\n(10) Domestic enterprise.--The term ``domestic enterprise''       means an enterprise that conducts business in the United       States and…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690188/promoting-resilient-supply-chains-act-of-2025"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…career in local government.\n\nOne of Steve's signature achievements for Green Cove Springs is the  redevelopment of Walnut Street, where he oversaw the major redesign and  reconstruction project that is now helping the city both preserve its  historic charm and position itself for future growth. This project  reflects Steve's commitment to the everyday…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696636/recognizing-the-retirement-of-steve-kennedy"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…AND                     COMMITMENTS TO BURMA.\n\nThe Secretary of the Treasury shall direct the United       States Executive Director at the International Bank for       Reconstruction and Development to use the voice and vote of       the United States to continue the pause by the Bank on       disbursements and the making of new financing commitments…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697196/no-new-burma-funds-act"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…time.\n\nMr. Speaker, I rise in support of H.R. 4423, the No New Funds for  Burma Act. This bill would suspend disbursements and financing from the  International Bank for Reconstruction and Development to Burma until  the Treasury Secretary identifies a meaningful change in regime and  restoration of democratic values.\n\nIn February 2021, the democratically…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697195/no-new-burma-funds-act"}, {"senator": "Byron Donalds", "party": "Republican", "sentence": "…reporter admitted to the Capitol press  galleries. From 1871 to 1875, he reported on the House and Senate  action, keeping the African-American community informed during  Reconstruction after the 13th, 14th, and 15th Amendments. He spent  countless hours writing and studying right here in the House Press  Gallery. Even after his tenure in the gallery,…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692222/designating-the-house-press-gallery-in-the-united-states-capitol-as-the-frederick-douglass-press-gallery"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…Speaker, I rise today to recognize and celebrate the  150th anniversary of St. Mary's Episcopal Church in Lampasas, Texas.\n\nFounded in 1873 during the turbulent years of Reconstruction, St.  Mary's has stood as a steadfast place of worship and community for a  century and a half. From its beginnings under the leadership of Dr.  Thomas S. Denny and a small…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696051/recognizing-the-150th-anniversary-of-st-marys-episcopal-church-in-lampasas-texas"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…to those who  defend freedom. Among the most illustrious veterans is Lt. James  Porter. After graduating from West Point in 1869, he served with the  7th Cavalry in the Reconstruction Era South under George Armstrong  Custer and distinguished himself by his courage during the mission the  eradicate the Ku Klux Klan. In 1876, he was among the 268 members…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699397/225th-anniversary-of-the-town-of-strong"}, {"senator": "French Hill", "party": "Republican", "sentence": "…activities do not materially alter environmental conditions       and do not materially exceed the original scope of the       project:\n\n(I) Acquisition, repair, improvement, reconstruction, or       rehabilitation of public facilities and improvements (other       than buildings) if the facilities and improvements are in       place and will be retained in…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…press       galleries from 1871-1875;\n\n[Whereas Douglass reported on House and Senate legislation       regularly to update the African-American community during       Reconstruction following the 13th, 14th, and 15th Amendments       to the Constitution;\n\n[Whereas Douglass was recorded frequently in the       congressional directory and spent a significant…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692224/designating-the-house-press-gallery-in-the-united-states-capitol-as-the-frederick-douglass-press-gallery"}, {"senator": "French Hill", "party": "Republican", "sentence": "…the IDA on equal regulatory footing with the  other World Bank divisions such as the Inter-American Development Bank,  the Asian Development Bank, the European Bank for Reconstruction and  Development, and the African Development Bank.\n\nPrior to 2018, the IDA did not issue debt in the securities markets.  Its funding came primarily from donor contributions…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693973/aligning-sec-regulations-for-the-world-banks-international-development-association-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…the Russians--something that  President Biden did not even attempt--and President Trump has secured a  key critical minerals deal with Ukraine, which will help fund the  reconstruction of that country. It will help compensate America for its  investments in Ukraine's defense and dissuade future Russian  aggression.\n\nBut there is one significant obstacle…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690955/ukraine"}]