[{"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…WJIZ, where he earned the title ``No. 1 Soul Wax Man,''  famously known as ``The Love Man--6 Foot 2.'' He also collaborated with  prominent organizations such as Atlantic Recording Company in New York,  WDAS Radio Broadcasting Station in Pittsburgh, PA, and WOAK in Atlanta,  Georgia.\n\nAs an astute entrepreneur, he founded and served as President of…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692741/in-memory-of-overseer-roosevelt-carter-i"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…on: No funds if DHS violates the First Amendment, the  Fourth Amendment, the Fifth Amendment; no funds for detaining and  deporting U.S. citizens; no prohibition on video recording for ICE.  This was all passed in the Committee on Appropriations and then  stripped out.\n\nThe fact of the matter is we need to focus like a laser in these 10  days--6 legislative…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699573/consolidated-appropriations-act-2026"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…Wilson from the Media Galleries; Myles Cullen  and the Photographic Services team; Yvonne Bennett, Scott Mead, Chris  Wilde, Blair Cooper, and Diego Torres from the Senate Recording Studio;  Sam Jacobs from Capitol Facilities; Ray Woeller and Jim Green, who  managed the credentialing contract; and the entire PILLARS development  team of Casey Bishop,…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691709/recognizing-the-joint-congressional-committee-on-the-inauguration"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…will be       a significant impact to customers,'' Doris Diaz, deputy       commissioner of operations, told the field staff Monday       during a briefing on the changes, a recording of which was       obtained by The Washington Post. She said the agency was       ``working on a process'' for homeless and homebound customers       who cannot use computers…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689130/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…This is an absurd reading that we can and must legislatively resolve.  The Howard ruling undermines the ability to prosecute common scenarios  involving the surreptitious recording of kids; for example, when  criminals plant concealed cameras in bathrooms, locker rooms, and  bedrooms to record sexually explicit images of children who are unaware  that…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698895/child-predators-accountability-act"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…on the video saying he is trying to comply with their orders.  Officers then put handcuffs on the Senator while he was lying on the  ground. His staff was then told to stop recording the handcuffing.\n\nHe was put in handcuffs for asking a simple question. He was put in  handcuffs for doing his job as a U.S. Senator. He was put in handcuffs  for standing…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692473/alex-padilla"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…is the stuff of  dictatorships.\n\nOne of the officers who throws him to the ground as he is clearly  complying, cuffs him face down on the carpet, and they say: There is no  recording in here.\n\nIt is a damn press conference. It is for recording. They didn't want  to hear his speaking.\n\nAnd if the internet has got it accurately, the Secretary was there…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692449/alex-padilla"}, {"senator": "Sharice Davids", "party": "Democrat", "sentence": "…Army Corps of Engineers to aid in the recovery and  analysis.\n\nAside from the wreckage of both aircraft and the personal effects of  the victims, the agency has recovered the recording devices from both  aircraft, and they are being analyzed by NTSB experts.\n\nThis effort also extended far beyond the NTSB's personnel. Hundreds  of government employees are…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688369/expressing-condolences-to-the-families-friends-and-loved-ones-of-the-victims-of-the-crash-of-american-eagle-flight-5342-and-pat-25"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…posted online by a local activist said that ever       since then, her phone has been ``flooded'' with calls, and       she has seen people loitering around her home with recording       devices. The San Diego Union-Tribune is not identifying her       due to safety concerns.\n\n``This has raised serious safety concerns for my family and       my business.…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699222/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…who for decades lived with silence where there should have  been national mourning, and ask the generations denied their roots by a  system that said their past wasn't worth recording.\n\nWe see it now in the battles over school curriculum, in sanitized  histories where the enslaved become mere workers and civil rights are a  footnote to a fabled color-blind…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690321/ending-of-dei-programs-through-executive-order"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…humanitarian  and civic contributions.\n\nBishop Williams was also an author and creative minister--writing  Order in the House and The Church Under Siege, producing the gospel  recording Zion Is Calling, and hosting the podcast Plug In With  Bishop--platforms through which he taught, encouraged, and lifted up  his community during seasons of trial and renewal.…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699461/in-memory-of-bishop-dr-frederick-williams-sr"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…booths were shuttered.       Sign on the door said ``by appointment only'' and there was a       number to call, which I did. The automated system put me on       hold, and the recording said 15-minute wait, and after time       passed, the recording said I would be helped as soon as       possible, then said they were receiving higher than normal       call…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690633/nomination-of-frank-bisignano"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…Tennessee. Their third project, 8:28: Live in Dallas, was  released in January 2023 and features the single ``'Til It's Good,''  written by Pastor Wesley. Their most recent live recording, 14:14,  inspired by Exodus 14:14, was released in 2025.\n\nIn addition to his leadership at Antioch and Undignified Praise,  Pastor Chris serves as Director of EMERGE, the…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699828/recognizing-pastor-christopher-chris-k-wesley-on-six-years-of-servant-leadership"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…East Addition, Anchorage Townsite Subdivision in Anchorage,       Alaska, according to the official plat thereof, filed under       Plat No. 2025-11, records of the Anchorage Recording       District, Third Judicial District, State of Alaska.       SEC. 4. CONDITIONS OF CONVEYANCE.\n\n(a) Conditions.--The conveyance under subsection (a) of       section 3--…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698113/southcentral-foundation-land-transfer-act-of-2025"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…dissenters and disfavored, including  Members of this body--Senators who are veterans, who have served in our  intelligence services or as an astronaut and a pilot in combat--for  recording a video reminding members of our military that they can  refuse an illegal order; Members of the Senate and House investigated  for seditious behavior, which our President…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699917/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…During his tenure, he modernized county services by developing a  cutting-edge computer imaging system, launching a 24-7 online records  portal, and introducing e-filing and e-recording services that improved  efficiency and accessibility for residents. His work ensured that  government functioned not just effectively but responsively, meeting  people where…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697700/paul-piperato-post-office-building"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…commitment to public service.\n\nIn 1982, Alan became an Active Member of the Plumsteadville Volunteer  Fire Company. Just three years later, he took on leadership roles both  as Recording Secretary and First Lieutenant. Over the years, Alan's  service with the fire company was marked by a deep sense of duty--a  reflection of his strong desire to serve and…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693337/recognizing-alan-bleams-40-years-of-service-with-plumstead-township"}, {"senator": "Russ Fulcher", "party": "Republican", "sentence": "…connect to software  applications that can be set, managed, and monitored through one's  computing device. They are designed to capture voice commands from  around the vicinity, recording information to adapt to the way  individuals give commands. They are also often equipped with cameras to  capture QR codes or other specific information particular to that…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690178/informing-consumers-about-smart-devices-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I move to suspend the rules and pass the  bill (H.R. 859) to require the disclosure of a camera or recording  capability in certain internet-connected devices.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:                                  H.R. 859…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690179/informing-consumers-about-smart-devices-act"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…trafficking to an end. And there is so  much more that Congress can do to support this effort.\n\nLast week, I introduced the bipartisan GRACIE Act, which would  require the recording of all Child Protective Services interviews with  children and adults. Although 60 percent of child sex trafficking  victims in our country have engaged with the foster care…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688161/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…who helped lead the Florida Gators to a Final Four  victory, clinching their spot in the national championship game. Thomas  played a critical role in the semifinal game, recording 12 points, 7  rebounds, and 2 blocks.\n\nOn behalf of everyone in Pennsylvania's 13th District, I congratulate  Thomas and his parents, Jennifer and Ryan, on this incredible…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689611/supporting-reversal-of-california-ev-mandate"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…a majority of the Members of the Committee who       are physically present at the time of the vote. Proxies will       be allowed in such cases solely for the purpose of recording       a Members position on the question and then only in those       instances when the absentee Committee Member has been       informed of the question and has affirmatively…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687982/us-senate-committee-on-rules-and-administration-rules-of-procedure"}]