[{"senator": "Betty McCollum", "party": "Democrat", "sentence": "…Human Services, Senator Hoffman  shepherded historic investments for the most vulnerable among us: the  elderly; those with disabilities, both seen and unseen; and those  recovering from addiction.\n\nThe grief that Minnesotans have endured in the days since this  tragedy has been agonizing. As we come together to heal, may we find  comfort in the words…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692784/grieving-mark-and-melissa-hortman"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…hitting my home  State of Florida especially hard. In Florida, more than 4 million  people rely on the ACA and face premiums that are doubling or tripling.\n\nA self-employed mom recovering from cancer in Lake Worth Beach is  dropping her coverage as her premium tripled overnight. A 62-year-old  waiter in West Palm Beach is going without insurance because it…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698564/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…immigration agenda is not about public safety. It is about intimidation  and cruelty. The people of Oregon are living with the consequences of  that every single day.\n\nA man recovering from surgery was violently pulled from his car and  left in excruciating pain. A pregnant mother was taken, separated from  her 2-year-old child, and denied comprehensive…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697452/fighting-dhs-immigration-raids"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…that job when Quest was acquired by US       West.\n\nSo, he returned to his business.\n\nOn January 9, 2019, he was terribly injured in a fire in       his home. He is still recovering physically and economically.       After losing 66 percent of his skin and getting care at a       specialty trauma unit in another part of the country, he       ended up…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Jimmy Panetta", "party": "Democrat", "sentence": "…collection notices. It can take years to financially recover from a  natural disaster, as many of us in this House have experienced with our  constituents. Ensuring  those who are recovering can claim what they are owed and do not have  to worry about confusing collection notices is the absolute least that  we can do.\n\nThis bill is an easy win, and it is the…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689313/disaster-related-extension-of-deadlines-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…at the highest levels, and performing a vital  experience for our democracy.\n\nOne of the very best of our inspectors general has been Mike Missal.  He was responsible for recovering more than $37 billion during his  tenure at the Veterans' Administration. He was the inspector general at  the VA under both Republican and Democratic administrations, widely…", "date": "2025-07-31", "source_url": "https://justfacts.votesmart.org/public-statement/1694542/9999"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…plans; and\n\n(III) prevention and post-injury observation and monitoring       fact sheets about concussion;\n\n(B) encourages supports, where feasible, for a student       recovering from a concussion (regardless of whether or not       the concussion occurred during school-sponsored activities,       during school hours, on school property, or during…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695777/by-mr-padilla"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…domestic supply chains and not reckless ones that endanger our  environment and communities like H.R. 4090.\n\nOne underutilized source of critical minerals is recycling. By  recovering and reusing already mined resources, we are tapping into a  new domestic supply. While recycling alone will not meet all of our  projected demand, it can significantly reduce…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699692/critical-mineral-dominance-act"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…our families are not living in  unsafe conditions by being exposed to serious health risks from mold,  mildew, and moisture damage.\n\nMr. Speaker, these are people who are recovering from a disaster. To  have FEMA say: No, we cannot help in this regard, even though they were  exchanging the water heater, helping with the furnace, the fact that  they will…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694896/providing-recovery-for-flood-victims"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…Committee Democrats  strongly oppose Biggs amendment No. 29, which seeks to weaken the  Department of Defense's work to preserve habitats crucial for military  readiness and recovering vulnerable species.\n\nThe DOD covers millions of acres, spanning a vast array of natural  habitats and providing that realistic backdrop for training and  testing. Healthy…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695231/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…legislators in  their homes. He pretended to be a police officer, and he gunned down  Democratic State legislator John Hoffman and his wife. Fortunately,  they survived and are recovering from surgery and reportedly in stable  condition. We pray for State Senator Hoffman and his wife's full  recovery.\n\nThen the gunman attacked another Democratic State legislator…", "date": "2025-06-16", "source_url": "https://justfacts.votesmart.org/public-statement/1692572/minnesota-lawmakers-shooting"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…package.\n\nMr. Speaker, this bipartisan bill is a commonsense proposal to ease  one of the many burdens that face survivors after a natural disaster so  that they can focus on recovering and rebuilding.", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689384/filing-relief-for-natural-disasters-act"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…compassion, hope, and support to the most vulnerable  populations, including individuals experiencing homelessness, veterans,  seniors, human trafficking survivors, and those recovering from  addiction. Across the Nation, the Salvation Army operates shelters,  food pantries, job training programs, and emergency disaster relief  efforts that strengthen communities…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690965/national-salvation-army-week"}, {"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "…job was not going to hold her back. During Alice's voluntary  night shifts, she established Amethyst Place, a supportive housing  program that served mothers and children recovering from abuse,  organized neighborhood cleanups as a board member of the Kansas City  Housing Authority and assisted young mothers in obtaining health  insurance. As a volunteer…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698825/recognizing-the-life-and-memory-of-alice-kitchen"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…Colorado yet again. At Evergreen High  School in Jefferson County, a 16-year-old shot and injured two students  and an administrator. Tonight, these three victims are still  recovering, and their classmates and teachers and families are still  reeling. Every elementary and middle school in the State is wondering  whether they might be next.\n\nIt has been…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695673/cloture-motion"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…striking ``and'' after the semicolon;\n\n(II) by amending clause (ii) to read as follows:\n\n``(ii) reducing cybersecurity risks to, and identifying,       responding to, and recovering from cybersecurity threats to,       information systems or operational technology systems,       including either or both of such systems using artificial       intelligence,…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696787/protecting-information-by-local-leaders-for-agency-resilience-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…practiced at neighboring schools to  continue their playoff preparations.\n\nThe Longhorns are a testament to determination, teamwork, and the  strength of a small Texas town recovering from a natural disaster.\n\nAs these students prepare for their next endeavors, I wish them the  best of luck and blessings for a brighter future.\n\nGo Longhorns.\n\nIn God We…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693641/congratulating-aledo-bearcats"}, {"senator": "Mike Crapo", "party": "Republican", "sentence": "…in action, MIA, as I  extend my support and gratitude to their loved ones.\n\nIn February, the Defense POW/MIA Accounting Agency, DPAA, the Agency  primarily responsible for recovering America's servicemembers, unveiled  its 2025 National POW/MIA Recognition Day poster. Each year, the Agency  creates a poster commemorating the lives of U.S. servicemembers…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695075/national-powmia-recognition-day"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…Act, a bill that advances exactly what Americans voted  for: fewer bureaucrats, more builders, lower costs, and real results.\n\nRight now, families across America are still recovering from Biden- era inflation, sky-high interest rates, and a Washington regulatory  state that makes it harder and more expensive to build a home.\n\nThe radical left's answer…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699809/lowering-housing-costs-and-advancing-main-street-community-banks"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…Additionally, this legislation doubles the current mandatory tax  filing extension following a federally declared disaster declaration  from 60 to 120 days.\n\nFor most people recovering from a disaster, taxes fall lower on their  to-do list than more immediate needs like finding shelter, food, and  caring for loved ones. By extending this deadline, we are…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689383/filing-relief-for-natural-disasters-act"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…Trump's Tax Cuts and Jobs Act provided critical relief to  middle-class families and small businesses. Americans are still  experiencing high prices because we are still recovering from  Bidenomics.\n\nPrices are up 21 percent. Real wages have declined by more than 3  percent. Mortgage rates have skyrocketed. Credit card delinquencies  have risen by over…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688089/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions-and-providing-for-consideration-of-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "John Carter", "party": "Republican", "sentence": "…between Lt. Colonel Scott Schule  of the 1st Cavalry Division Horse Detachment at Fort Cavazos (formerly  Fort Hood) and ROCK, with the goal of supporting wounded veterans  recovering at Brooke Army Medical Center Under ROCK's leadership and  with the expertise of team members such as Dr. Priscilla Lightsey, Joan  Cutler, Heidi Darning, and Dr. Nancy Krenek,…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689420/recognizing-the-contributions-of-ride-on-center-for-kids-rock"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…Moore has been a  leading voice in the fight to reform FEMA and to ensure its funds go  toward helping American citizens rather than to illegal immigrants,  especially those recovering from Hurricane Helene.\n\nMr. MOORE of North Carolina. Mr. Speaker, just a couple things about  Congressman Knott, for folks who don't know, before he was a Member of  Congress…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690711/outrageous-government-funded-incentives"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…was truly an extraordinary operation that  couldn't have been done by any other nation other than the United  States.\n\nAs for those who were injured, I understand they are recovering and  that some have been released from the hospital. I hope they heal up  safely and  that they know that we are eternally grateful for their bringing a  transnational criminal…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698624/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…in  their witch hunt of President Trump in 2022, Americans contended with  40-year high inflation, after Democrats and President Biden dumped  trillions of dollars into a recovering post-COVID economy, which even  one of their chief economists told us would create massive inflation.  They ignored that guidance.\n\nDid they seek to address everyday Americans'…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688464/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing-and-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…firefighters. We lost  role models.\n\nEngineer David Tysdal was also critically injured in the attack. He  has now endured three major surgeries. By God's grace, he is steadily  recovering. If he is listening today, we encourage David to stay  strong. He carries the prayers of gratitude of a nation with him.\n\nMr. Speaker, this violence was not just a tragedy.…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693542/congratulating-larry-haskell-on-his-retirement"}, {"senator": "Anna Luna", "party": "Republican", "sentence": "…used  the last tool that I had at my disposal which was something known as a  discharge petition where I collected 218 signatures and expanded the  ability to vote while recovering from childbirth not just to mothers  but also to young fathers in our governing body.\n\nNow leadership, because of the fact they don't like the fact that I  was successful…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689415/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…dinner, Rachel's  Challenge, Mater Filius, Sidewalk Advocates for Life, the Knights of  Columbus, and many other ministries to mothers, fathers, children, and  those who are recovering from loss.           Celebrating 40th Anniversary of Springs Community Church\n\nMr. CRANK. Mr. Speaker, I rise today to recognize and celebrate the  40th anniversary of Springs…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695195/recognizing-pastor-stewart-mcwilliams"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…Trump's Tax Cuts and Jobs Act provided critical relief to middle-class  families and small businesses. Americans are still experiencing high  prices because we are still recovering from Bidenomics.\n\nReal wages under President Biden declined by more than 3 percent.  Mortgage rates skyrocketed. Credit card delinquencies rose by over 50  percent. Bidenomics…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689862/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "David Kustoff", "party": "Republican", "sentence": "…initial flooding, I visited Rives with our Governor of  Tennessee, Bill Lee, to survey the damage and to meet with local  officials and residents. For the Rives community, recovering and  rebuilding is not going to be easy and is not going to happen  overnight.\n\nI am sure that my colleagues who have toured disaster areas in their  own districts know exactly…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689382/filing-relief-for-natural-disasters-act"}]