[{"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "Ms. CROCKETT. Mr. Speaker, I rise today to recognize the outstanding  contributions of the physicians at Dallas Endoscopy Center (DEC) to the  health and well-being of the residents of Texas' 30th Congressional  District. For almost two decades,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695923/recognizing-the-physicians-at-dallas-endoscopy-center"}, {"senator": "Marc Veasey", "party": "Democrat", "sentence": "Mr. VEASEY. Mr. Speaker, I rise today to recognize the outstanding  contributions and enduring legacy of the Junior League of Arlington  (JLA), an organization that has been empowering women and strengthening  the Arlington community for…", "date": "2025-10-28", "source_url": "https://justfacts.votesmart.org/public-statement/1696424/recognizing-the-junior-league-of-arlington-empowering-women-strengthening-community"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…a difference--lifting others as they  lead and setting powerful examples for future generations. It is a  privilege to celebrate their accomplishments and recognize their  outstanding contributions.\n\nBusinesswoman of the Year--Monika Mueller: Monika's journey to  becoming Chief Strategy Officer is a true testament to her visionary  leadership, relentless…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690568/virginias-fourth-district-women-in-excellence-awards"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "Mr. LATIMER. Mr. Speaker, I rise to recognize the outstanding  contributions made by At Home on the Sound to benefit senior citizen  residents of Larchmont and Mamaroneck. Tonight, they are celebrating  their 15th anniversary with their…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691311/recognizing-at-home-on-the-sound"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "Mr. HIMES. Mr. Speaker, it is with great respect and admiration that  I recognize the outstanding contributions of Nick Alton, who has served  as Minister Counsellor Political at the British Embassy in Washington  for the past four years. Throughout his tenure, Nick…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698086/recognizing-nick-alton"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Charles A. ``Charlie'' Rogers has made through his  work with Habitat Tampa Bay Gulfside. Charlie Rogers has been on  Habitat's Board of Directors since…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690164/recognizing-charles-a-rogers"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Donna Telesco has made as a volunteer with United  Way of Hernando County. Donna not only coordinated relief supplies  inventory at our Family Resource…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692146/recognizing-donna-telesco"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Robert ``Bob'' O'Brien has made through his  volunteerism at Cypress Elementary School. Bob's talents and craft as a  Master Gardener are enjoyed by students…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691924/recognizing-robert-obrien"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Mr. Travis Smith has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692197/recognizing-travis-smith"}, {"senator": "Barry Moore", "party": "Republican", "sentence": "Mr. MOORE of Alabama. Mr. Speaker, today, I rise to recognize the  outstanding contributions, hard work, and legacy of Mr. Frank Caskey.  His dedicated service to the Alabama Legislative over several decades  has made a lasting impact on the lives…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690777/recognizing-the-retirement-of-frank-caskey"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Ms. Marie Bienkowski has made to our community  through her volunteerism as part of the Save Crystal River Board of  Directors. She has helped forge a…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691243/recognizing-marie-bienkowski"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Mr. Sean Arnold has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691984/recognizing-sean-arnold"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Ms. Marlene Law has made to our community through  her work over three decades to promote opportunities for youth with the  UF/IFAS Extension Citrus County…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691259/recognizing-marlene-law"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that James ``Jay'' Sheridan has made through his work  with the Greater Tampa Bay Area Council of Scouting America. Jay  Sheridan is currently a Scoutmaster…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690805/recognizing-james-sheridan"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Mr. Neil Quinn has made to our community through his  work as an exceptional volunteer for Habitat for Humanity of Citrus  County for the past five years.…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691863/recognizing-neil-quinn"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Fernando Serrano has made through his work with the  Pasco County Human Services Team. The Pasco County Human Services Team  has proven itself to be a…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690698/recognizing-fernando-serrano"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Martha Narvaez and Vincent Leandry have made to our  community through their volunteer service at the American Red Cross,  Mid-Florida Chapter. Every…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691268/recognizing-martha-narvaez-and-vincent-leandry"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Mr. Eric Verosic has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690659/recognizing-eric-verosic"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Mary Miller has made through her work with Gulf  Middle School. Mary has been volunteering for Gulf Middle School since  2016. She has helped with the…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691273/recognizing-mary-miller"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I rise today to recognize the outstanding  contributions that Ms. Ashley Porter has made to our community in the  aftermath of Hurricane Milton. In addition to providing countless hours  of direct support to neighbors…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690135/recognizing-ashley-porter"}]