[{"senator": "Adam Gray", "party": "Democrat", "sentence": "…professional career, she has been recognized with many  awards, most recently the Minerva Empresaria Award 2022 from the  California State Hispanic Chamber of Commerce which recognizes  businesswomen who empower others by leading with wisdom and passion.\n\nPlease join me in honoring Annissa Fragoso for her dedication,  commitment and selfless service to…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695992/recognizing-annissa-fragoso"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "…of negative outcomes. That said, House Democrats do not  want to see legitimate academic activity between the United States and  China hindered.\n\nThe compromise language recognizes the spirit of the bill--the need  to protect America's intellectual property and academic freedom--and  takes steps to mitigate the risk of going too far and denying critical…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690827/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…gentlewoman for her eloquence and lucidity in those  remarks and for sponsoring this legislation.\n\nI speak very strongly in favor of Ms. Wasserman Schultz's resolution,  which recognizes Jewish American Heritage Month and the important  contributions that Jewish Americans have made to our country, and I  thank her for her continuing leadership within Congress…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691194/calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism-and-educate-the-public-on-the-contributions-of-the-jewish-american-community"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…leadership in advancing interfaith dialogue, human  rights, and especially environmental stewardship, has earned him the  nickname ``The Green Patriarch.'' The Templeton Prize recognizes his  decades of work urging the world to see care for creation not just as  policy, but as a sacred duty.\n\nIn Riverside, we are blessed with a vibrant Orthodox Christian…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695408/recognizing-the-accomplishments-of-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…empowering residents and their  communities to adopt more sustainable lifestyles and reduce their  ecological footprint.\n\nThe All-America City award from the National Civic League recognizes  outstanding communities that leverage civic engagement, collaboration,  inclusiveness, and innovation to address local issues. It is because of  the collective efforts of…", "date": "2025-08-08", "source_url": "https://justfacts.votesmart.org/public-statement/1694723/recognizing-the-city-of-lakewood"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…sicker people who will buy the health  insurance because they need it.\n\nBut the simple fact is, nobody is invincible. All of us need  healthcare. And the Affordable Care Act recognizes that healthcare in  America, aspirationally, should be a human right. And our failure to  provide it to those millions of Americans who will find healthcare  insurance unaffordable…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695920/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Herb Conaway, Jr.", "party": "Democrat", "sentence": "…Jersey's 3rd Congressional District.\n\nDuring this visit, Patriarch Bartholomew is being honored as the  recipient of the Templeton Prize. This prestigious international a yard  recognizes his scholarly contributions in exploring the intersection of  faith and the natural world. Past recipients include Mother Teresa and  the Dalai Lama.\n\nIn 1997, he was awarded…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695506/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…going to change  that, so I did.'' Dixie died in 2020 at the age of 102, but her legacy  lives on. In 2023, she was inducted into the Kentucky Bourbon Hall of  Fame, which recognizes sacrifice and determination in the bourbon  industry. Louisville Mayor Craig Greenberg recently unveiled a new  historical marker, part of the Louisville Metro Historical…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695585/recognizing-the-extraordinary-life-of-dixie-demuth"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…Medal from  the World Beer Cup for their Coconut Oil Man brew.\n\nThe World Beer Cup, otherwise known as the ``Olympics of Beer,''  evaluates beers from around the world and recognizes the top brewers  and their beers. Founded in 2012 and nestled in the Heart of the  Rockies, Elevation Beer Company produces seasonal Belgian ales,  specialty brews, and barrel-aged…", "date": "2025-08-08", "source_url": "https://justfacts.votesmart.org/public-statement/1694717/recognizing-elevation-beer-company"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…Civic Education Teacher Award.\n\nIn her classroom, Ms. Parks is teaching young minds more than just  facts and dates, but the strength and power of our democracy. This  honor recognizes educators who spark curiosity about the Constitution,  government, and civic life.\n\nAt Milford High School, Ms. Parks is shaping the continued strength  of our democracy…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696940/recognizing-shae-parks"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…a busy highway, every child  using an inhaler, and every senior who can't go outside on a high  pollution day. This is a direct attack on over 50 years of precedent  that recognizes that EPA has the authority and the obligation to allow  States to do what is required to protect their residents.\n\nI am, frankly, stunned that my Republican colleagues in…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690482/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…affected in Vermont, today, I have introduced a bill that is called the  Disaster Assistance Improvement and Decentralization, AID, Act. Quite  simply, what this bill does is it recognizes that if you are going to  get as quick a recovery as possible, as efficient a recovery as  possible, as cost-effective a recovery as possible, you actually have  to delegate…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693402/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…businesses from competing in local markets,  and redirect trade away from the United States.\n\nAfrica is the continent with the world's fastest growing population.  China recognizes the critical role that Africa will play in the future  and its economy and wants to exploit that, particularly as global  demand for critical minerals and rare earth elements…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698904/agoa-extension-act"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…press statement that was sent out, and I would like to read  just a few words from it, Mr. Speaker.\n\nIt reads: ``Media Advisory and Public Notice'' ``Congressman Al Green  recognizes the significant battle won by impeachment warriors.''\n\nThen there is a subtitle: ``Kilmar Abrego Garcia has been returned to  the United States and may get the due process…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692296/and-still-i-rise-denouncing-the-presidents-authoritar-ianism-and-recognizing-the-impeachment-warriors"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "Ms. TLAIB. Mr. Speaker, the 12th Congressional District of Michigan  recognizes the opening of the MaryAnn Wright Animal Adoption and  Education Center in Dearborn. The center is a new facility that belongs  to the Friends for Animals of Metro Detroit,…", "date": "2025-07-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694353/recognizing-the-maryann-wright-animal-adoption-and-education-center"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…that they will actually drink.\n\nSecretary of Health and Human Services Robert F. Kennedy, Jr., has  also voiced support for returning whole milk to school cafeterias. He  recognizes its value as a nutrient-rich option that supports child  development and academic success.\n\nMilk provides 13 essential nutrients, including calcium, vitamin D,  and potassium.…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692463/national-dairy-month"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…Governor.\n\nHer efforts to improve education and to ensure veterans receive the  support they deserve has left a lasting legacy.\n\nHer induction into the Veterans Hall of Fame recognizes her impact on  the Sunshine State and our country. We are proud of her and her  service.\n\nMr. Speaker, please join me in congratulating my friend Lieutenant  Governor Jennifer…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688147/recognizing-florida-lieutenant-governor-jennifer-carroll"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…War II and were buried in U.S. military cemeteries       overseas (ABMC) were mistakenly interred under markers that       do not represent their religion or heritage. JVW recognizes       that most of these errors are unintentional; however, these       mistakes hide the identity and legacy of those who made the       ultimate sacrifice for our country.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695626/fallen-servicemembers-religious-heritage-restoration-act"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…involving aerial assets. ACERO seeks to enhance situational  awareness, coordination, and information sharing among aerial  platforms, both piloted and unmanned. This bill recognizes the  important work already underway and encourages NASA to continue  advancing these efforts.\n\nAgain, I thank Representatives Fong and McClellan for their  bipartisan leadership.", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700124/advanced-capabilities-for-emergency-response-operations-act"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…they even share the delusion that people can sexually  identify as an attack helicopter because, apparently, that is also an  option for some of these maniacs.\n\nMy amendment recognizes a simple fact: There are two genders. They  are designated at birth, and they cannot be changed.\n\nThis is basic biology, Biology 101. It is not about feelings. It is  not…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695260/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "French Hill", "party": "Republican", "sentence": "…is amended--\n\n(1) in paragraph (1)(E), by striking ``except upon a       foreclosure by a lender (or upon other transfer in lieu of       foreclosure) if such action (i) recognizes any contractual or       legal rights of public agencies, nonprofit sponsors, or       others to take actions that would avoid termination of low-      income affordability…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…incredibly busy schedule. You are always really generous with your  time for the former Members. Thank you so much.\n\nMs. EDWARDS. We appreciate that, Mr. Speaker.\n\nThe Chair now recognizes the Honorable Barbara Comstock of Virginia,  who is president of the Former Members of Congress Association to  address the Members.\n\nMs. EDWARDS. I want to add my congratulations…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698189/9999"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…sacrifices and commitment to public service: Now, therefore,       be it\n\nResolved by the House of Representatives (the Senate       concurring), That Congress--\n\n(1) recognizes and appreciates the dedication and devotion       demonstrated by the men and women of local law enforcement       who keep the Nation's communities safe;\n\n(2) extends its…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691031/expressing-support-for-local-law-enforcement-officers"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…I know that there are many others that fill similarly critical  needs in different sectors of society. In fact, AmeriCorps' own  definition of a professional core program recognizes that the  placements are a strategic response to longstanding workforce gaps. It  is not simply service programs. They are workforce solutions.\n\nThat is why I have respectfully…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…passion and vision have made Camp Freedom what it is  today: a special place for many.\n\nMr. Speaker, this resolution is only two pages long, but its message  is powerful. It recognizes these families. It thanks them and affirms  that their sacrifices are worthy of our continued support.\n\nThis resolution has strong bipartisan backing, and I thank all of…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691021/calling-upon-local-communities-to-support-organizations-that-provide-resources-and-aid-gold-shield-families-in-their-time-of-need"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…jurisdictions accountable, we must recognize  that not every community in a sanctuary State is part of the problem. I  believe the amended bill draws that line distinctly, and it recognizes  districts, like Colorado-05 that I represent, that have been bravely  pushing back on their own.\n\nWhen the Biden administration opened our borders and over 8 million  or…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692103/save-sba-from-sanctuary-cities-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…forward legislation, we ought to be thinking about these  Americans who lost their lives at the hands of these non-Americans. We  ought to be thankful we have a President who recognizes that these non- Americans needn't be on our streets, that we should be siding with ICE  and Border Patrol, and that we should be defending the men and women in  our law enforcement…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…my time.\n\nMr. Speaker, let's talk facts again. The Fair Labor Standards Act  sets the Federal minimum wage, as well as a separate minimum wage, for  tipped workers. This recognizes the reality that tipped workers have a  higher earning ceiling when tips are combined with base wages,  representing an employee's total compensation.\n\nThere is no limit…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698965/tipped-employee-protection-act"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…exemptive authority granted to the SEC under Section 204(g) of  the CLARITY Act provides a mechanism to address evolving technological  and market realities.\n\nThe CLARITY Act recognizes that liquidity is an important feature of  efficient markets and price discovery, as well as encouraging U.S.  market activity. Congress intends for the SEC, through CLARITY,…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694155/digital-asset-market-clarity-act-of-2025"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…their operations and undermining  their bottom line. To revitalize the American Dream, Big Government,  one-size-fits-all mandates must stop.\n\nThe Trump administration fully recognizes this challenge and is  taking aggressive acts to give small businesses the relief they  deserve. In just the first 6 months of President Trump's second term,  Republicans…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697330/small-business-regulatory-reduction-act-of-2025"}]