[{"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…risks to U.S.       national security.\n\nOn March 2, as my last official act before I was sent home,       I sent those memos to the Global Health staff, to keep for       their records, in the event the blame game ends up pointing       the finger at them.\n\nThat brings us to today.\n\nThank you again for the opportunity to speak before you.  Senate Roundtable…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691139/us-global-health-programs"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…these failures by streamlining the       process for removing officers who commit serious misconduct       and by prohibiting agencies from hiring officers with known       records of abuse. It also established a police-misconduct       database to prevent the well-documented problem of       ``wandering officers''--individuals fired or forced out for…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696985/opposition-letter-by-the-southern-poverty-law-center-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…eliminate judicial discretion to impose sentences below  mandatory minimums, and would restrict vital alternatives like  probation, community service, and the ability to seal the records of  young adult offenders. This proposal is particularly egregious because  it undermines a program that works. The YRA, which provides a path for  rehabilitation, has been…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695721/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…an  amendment to the rule to make in order amendment No. 50 to H.R. 3633,  offered by Representative Khanna, which requires the Attorney General  to preserve and release any records related to Jeffrey Epstein.\n\nI applaud my colleagues, Representative Veasey and Khanna, for their  work to release the Epstein files. I strongly support these efforts and…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693551/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…to spend on weapons for enforcement  agents and billions on detention centers to imprison people who are  undocumented but who have committed no crimes and have no criminal  records at all.\n\nThis is the America that Donald Trump has created, but it is not the  America that we will accept. We will not accept the labeling of Renee  Good--a mother of three,…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699422/9999"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…Ohio's 13th Congressional District's Champion of the Week.\n\nAs a senior at Lake High School in Uniontown, Ohio, Daniela ended an  exceptional high school track career, setting records and winning  several awards along the way. On the road to her first State title last  month, Daniela set the record for the 1,600 and 3,200 meters at the  Federal League Track…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692234/congratulating-daniela-scheffler"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "…Bob added. ``We       all still love our country without a doubt.'' Sanders is now       preparing to submit all the necessary evidence to the       Guinness Book of World Records, including GPS data, photos,       and witness accounts, in hopes of officially claiming the       title as the oldest man to bike across America. ``He has       determination.…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691375/recognizing-mr-bob-sanders-for-cycling-across-the-united-states"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…Commerce  Committee might realize, that some of our colleagues wanted to be able  to sue the Federal Government because the Department of Justice had  looked at their phone records. Have we struck that provision?\n\nI am pretty sure these families who have lost loved ones would like  to be able to sue the Federal Government, the DOD or the FAA, who  basically…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697858/national-defense-authorization-act"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…lies, the first one being that Barack Obama was not born in  this country. Then the second one, the ridiculous, easily disproved  claim was that the 2017 inauguration broke records that no one had ever  seen before. Then there was the lie about the weather map and the  Sharpie, and then so many other lies building up to that one big lie  that you all…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691062/it-all-started-with-a-series-of-lies"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…allow Blacks to serve. In August 1862, a formerly  enslaved Black man from South Carolina came here to Washington and  convinced Lincoln to allow Blacks to serve.\n\nHistory records that 170,000 Blacks joined the Union Army, 19,000  joined the Union Navy, and 40,000 died in that war. Robert Smalls, who  convinced Abraham Lincoln to allow these freedmen…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699863/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…hacks.\n\nCISA and the Federal Bureau of Investigation have confirmed that the  Chinese Government hacked multiple phone companies and accessed vast  troves of sensitive call records. They even co-opted the system  designed for law enforcement to conduct wiretaps and accessed phone  calls of politicians and other high-value targets.\n\nVice President Vance…", "date": "2025-07-28", "source_url": "https://justfacts.votesmart.org/public-statement/1694259/telecom-cybersecurity-transparency-act"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…Welch, Chairman, Charles Drew       Blood Drive; Sanford Crenshaw, Vice Basileus; Vince Jones,       Vice Chairman, Charles Drew Blood Drive; Zachary Canady,       Keeper of Records and Seal; Jeremiah Davis, Chairman,       Fatherhood and Mentoring Initiative\n\nMr. Speaker, I ask my colleagues to join me in congratulating the men  of Omega Psi Phi, Inc.…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697131/recognizing-omicron-kappa-kappa-chapter-of-omega-psi-phi-fraternity-inc-for-its-achievement-week-and-honorees"}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "…servicemembers may face.\n\nTransgender employees will have a difficult time filing equal  employment opportunity complaints without accurate data. Employees will  also have inconsistent records and incorrect gender markers in  Department of Defense systems, making it harder to access health  services.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695230/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…committing  felonies, rapes, murders, and child sexual abuse is what they said they  were going to go after in the immigration fights. Yet, now they are  going after statistics and records for deporting more people than any  other country in the world.\n\nIt is a shame. Crime should be focused on in the FBI and not, as  President Trump said today, that the FBI…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693518/more-funding-for-fbi"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…Musk and his DOGE minions have had access to data on hundreds  of millions of Americans. I wish we were here on the floor preventing  Mr. Musk from getting our personal health records, our consumer data,  our business records, our Social Security numbers, and our tax data.\n\nAfter we pass this bill, I hope that the Financial Services Committee  would investigate…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692804/homebuyers-privacy-protection-act"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…disorder and addiction.\n\nThis amendment directs the National Coordinator for Health  Information Technology to convene a public roundtable to examine the  use of electronic health records among certain providers and issue a  report of the findings. This would better inform policymakers about the  existing landscape and uptake of certain providers utilizing…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691885/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…communities.\n\nIn recent years, local governments across the country have  experienced attacks that shut down city services, delayed school  operations, locked police and court records, and forced jurisdictions  of all sizes to spend significant funds on recovery. These events may  not always make national headlines, but they have real consequences for…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696787/protecting-information-by-local-leaders-for-agency-resilience-act"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…employees and retirees diagnosed with       esophageal cancer; and\n\n(2) how often individuals covered under the Federal       Employees Health Benefits Program with medical records       indicating such individuals are high-risk for esophageal       cancer undergo screening according to the established       guidelines.\n\nMr. Speaker, the House of Representatives…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691831/gerald-e-connolly-esophageal-cancer-awareness-act-of-2025"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "Mr. JORDAN. Mr. Speaker, I move to suspend the rules and pass the  bill (H.R. 4405) to require the Attorney General to release all  documents and records in possession of the Department of Justice  relating to Jeffrey Epstein, and for other purposes.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696818/epstein-files-transparency-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…permission from the resident       of a dwelling unit, install such temperature sensor and       monitor the data from such temperature sensor.\n\n(d) Collection of Complaint Records.--\n\n(1) In general.--Each public housing agency or owner of a       covered federally assisted rental dwelling unit that installs       1 or more approved temperature sensors…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…CMS. We also matched enrollee SSNs in the data to two       additional data sources: (1) Social Security Administration's       (SSA) full death file, a database containing records of death       that have been reported to SSA, as of November 2024 and (2)       April 2025 data from the Internal Revenue Service (IRS) on       APTC reconciliation from…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698800/breaking-the-gridlock-act"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…Senator, and they have also chosen to attack my whistleblowers.\n\nFirst, Thrush, Feuer, and Goldman did get something right. Can you  believe that? They said the FBI is producing records ``in response to  longstanding inquiries by Republicans on Capitol Hill.'' The House and  Senate have finally begun to receive responsive productions to our  oversight requests…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699769/whistleblowers"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…have when I  got married, they have to provide their birth certificate and a  marriage certificate. This is already required when you update your ID,  your Social Security records, and, yes, your voter registration, too.\n\nWhen your name is legally changed, it updates across government  systems. REAL IDs, passports, and other valid forms of ID mentioned…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690005/safeguard-american-voter-eligibility-act"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…Homeland  Security. A 34-year-old gang member  from Mexico had illegally entered the country 26 times. He has received  convictions for burglary, tampering with government records, government  witnesses, criminal enterprises, illegal reentry multiple times. When  you look at cases like this that are so voluminous, it is hard to  summarize. Again, the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695365/stop-illegal-entry-act-of-2025"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…Democrat administrations.\n\nDuring the Biden administration, the vetting process to safeguard  these children barely existed, putting them in harm's way. Today, I am  making public records obtained from the Trump Department of Health and  Human Services which illustrate the dire consequences of weak Biden  administration vetting policies. These records show…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699108/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…in a loss of the status of in good       standing;\n\n(3) to allow the Secretary to request, at the discretion of       the Secretary--\n\n(A) production of test and production records; and\n\n(B) random sample testing; and\n\n(4) to allow for the recovery of all associated costs of       foreign inspections to include travel, time, and other costs,       as…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692179/compressed-gas-cylinder-safety-and-oversight-improvements-act-of-2025"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…Officer, Reporting and Data Analyst\n\nSusan Neugebauer, EMS Program Supervisor and EMS for       Children Program\n\nElaine Volin, BSN, RN, Trauma Program Manager\n\nJesse Chavez, EMS Records and Data Specialist\n\nDerrick Krause, Administrative Assistant\n\nAmanda Witherington, Administrative Assistant\n\nThe Wyoming Trauma and EMS conference plays an integral role…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694419/50th-anniversary-of-the-wyoming-trauma-and-emergency-medical-services-conference"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…a       person) may move the district court of the United States for       the district and division embracing the place where the       person was arrested to expunge all records of the arrest if       the conduct or alleged conduct of the person that resulted in       the arrest was directly related to the person having been a       victim of trafficking.…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697182/trafficking-survivors-relief-act"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…actually go hand in hand. We have invested billions in  clean and emissions-controlled technology. We have reclaimed our lands  and maintained some of the strongest air quality records in the Nation.\n\nWe can grow the economy, power the country, and steward the  environment all at once. That is the American Way, and that is  certainly the North Dakota way.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694907/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…HARASSMENT RESPONSE  Sec. 501. Independent review of Coast Guard reforms. Sec. 502. Comprehensive policy and procedures on retention and access                to evidence and records relating to sexual misconduct and                other misconduct. Sec. 503. Consideration of request for transfer of a cadet at the Coast                Guard Academy who…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}]