[{"senator": "Betty McCollum", "party": "Democrat", "sentence": "…security and to promote regional  stability. Jordan air bases have been particularly important for the  U.S. to conduct intelligence, surveillance, and target acquisition and  reconnaissance missions in Syria and Iraq.\n\nJust 2 weeks ago, our U.S. Central Commander traveled to Jordan,  where he met with the chairman of the Jordan Joint Chiefs of Staff and  key…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693686/department-of-defense-appropriations-act-2026"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…development of over 1,000  personnel. Her leadership was instrumental in ensuring the effective  execution of critical missile warning and intelligence, surveillance,  and reconnaissance missions worldwide. Moreover, she played a vital  role in supporting the numerous wings, mission partners, and personnel  stationed at Buckley, as well as the extensive…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692495/recognizing-the-service-of-chief-master-sergeant-sharma-j-haynes"}, {"senator": "Donald Norcross", "party": "Democrat", "sentence": "…continuing the  oversight necessary to ensure reasonable execution of these programs  that include all of our tactical aircraft programs; the intelligence,  surveillance, and reconnaissance aircraft; and tactical munitions.\n\nThis bill also includes the subcommittee's multiyear effort to manage  the largest acquisition program in the history of the Department…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697802/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…and active involvement within the  Seattle Chinese-American and Veterans communities.\n\nBill valiantly served during World War II in the U.S. Army with the  93rd Cavalry Reconnaissance Squadron in the Central European Campaign  and the Battle of Rhineland, and his dedication to service continued  long after his active military duty. Upon graduating from…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691351/recognizing-william-bill-leonard-chin-former-cathay-post-no-186-commander-and-world-war-ii-veteran"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…This is ridiculous. Most importantly, it is an  insult to the men and women who are risking their lives flying  aircraft, operating ships and submarines, and conducting reconnaissance  in the region. They are very much in harm's way, and to say that this  operation is so safe that it doesn't qualify as ``hostilities'' is  embarrassing. Also, it suggests,…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696553/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…Navy/Marine Corps Achievement Medal.\n\nAs he steps into the role of Commanding Officer, I know that  Commander Russell will continue to execute vital maritime patrol and  reconnaissance missions with precision and uphold the highest  traditions of Naval Aviation.\n\nMr. Speaker, Commander Russell is a true patriot and distinguished  American who has devoted…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690861/change-of-command-daniel-russell"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…aces, and  was credited with 90 air-to-air victories.\n\nAfter World War II, in 1946, the group was deactivated, only to be  reactivated less than a year later as the 55th Reconnaissance Group  under the Strategic Air Command. By 1950, it would be designated the  55th Strategic Reconnaissance Wing, and in 1952 it was assigned to  Forbes Air Force Base in…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689070/recognizing-the-55th-wing-85th-birthday"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…an opportunity for students to  learn and engage in the fields that IIRM-URA supports.\n\nThe 2025 challenge involved a virtual drone simulation where students  conducted reconnaissance to identify radiological threats in a building  captured by friendly forces. Pitting over 800 competitors including  those from university, high school, and middle school--the…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698689/recognizing-solanco-high-school-students-for-their-performance-at-the-2025-student-drone-challenge"}, {"senator": "Barry Loudermilk", "party": "Republican", "sentence": "…and 59 unit-equipped aircraft, her  leadership of the 22nd Air Force has directly contributed to our  Nation's security through aerial spray, fire suppression, weather  reconnaissance, tactical airlift and airdrop and aeromedical  evacuation.\n\nAs Major General Coburn continues her service to the United States  upon her departure from Dobbins Air Reserve…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691981/recognizing-major-general-melissa-coburn-for-her-service-to-the-22nd-air-force"}, {"senator": "James Risch", "party": "Republican", "sentence": "…2025.\n\n* As defined in Section 47(6) of the Arms Export       Control Act.                             policy justification  Denmark--Multi-Mission Maritime Patrol and Reconnaissance Aircraft P-8A\n\nThe Government of Denmark has requested to buy up to three       (3) P-8A Patrol Aircraft; four (4) Multifunctional       Distribution System Joint Tactical…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698533/arms-sales-notification"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…Wagamon entered active duty in Philadelphia, Pennsylvania in  September of 1944 at twenty years of age and served an important role  during period of World War II, flying reconnaissance missions over  Italy detailing German activities along the railway system until the  end of the war. He served in the North Apennines, Central Europe and Po  Valley campaigns.…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696278/recognizing-lieutenant-colonel-charles-h-wagamon-usaf-retired-with-a-congressional-veteran-commendation"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…is a 29-year-old illegal alien who entered the United  States as a got-away. He was arrested in San Antonio and charged with a  DWI in 2020. He was let go on a personal reconnaissance bond but failed  to show up.\n\nThe Bexar County DA downgraded the DWI. He pled guilty to obstructing  a passageway, but he violated the probation. He got arrested again.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695203/people-are-sick-and-tired"}, {"senator": "Morgan Luttrell", "party": "Republican", "sentence": "…militia  activity in the Pech District of the Kunar Province. The primary target  was a high-ranking Taliban leader named Ahmad Shah.\n\nTo carry out the operations, a four-man reconnaissance team was  inserted into the rugged terrain under the cover of darkness. The team  consisted of Lieutenant Michael Murphy, Petty Officer Matthew Axelson,  Petty Officer…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692903/recognizing-the-20th-anniversary-of-operation-red-wings"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…Committee for  the San Angelo Texas Chamber of Commerce.\n\nA veteran of the United States Air Force, Tom served 22 years,  including 18 years in intelligence, surveillance, and reconnaissance  (ISR) collections and analysis platforms. His service took him to eight  ground and airborne units across Europe, Asia, the Mediterranean, and  the Middle East, as well…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698289/recognizing-the-success-of-tom-crowley"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…weather observation;\n\n(D) search and rescue operations;\n\n(E) to the extent practicable for consideration by the       Academy, intelligence gathering, surveillance, and       reconnaissance; and\n\n(F) communications;\n\n(2) assess how technologies described in paragraph (1) can       help prioritize Federal investment by examining--\n\n(A) affordability, including…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…infantry officer in 1987. Mac  remained on active duty for eight years and continued his reserve duty  through 2012. During his distinguished military career Mac was also a  Reconnaissance Officer and deployed to the Middle East in support of  Operation Desert Shield, Desert Storm, and in support of the Global War  on Terror.\n\nMac was decorated with four…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695496/thanking-john-mcintyre-mac-tolar-for-his-dedicated-service-to-our-nation"}, {"senator": "James Risch", "party": "Republican", "sentence": "…estimated total case value of       $2.81 billion.\n\n(iv) Significance: This proposed sale will significantly       enhance Japan's intelligence, surveillance, and       reconnaissance (ISR) capabilities and help ensure Japan is       able to continue to monitor and deter regional threats.\n\n(v) Justification: This proposed sale will support the…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692321/arms-sales-notification"}, {"senator": "Scott DesJarlais", "party": "Republican", "sentence": "…of the homeland, this bill supports development of the  Golden Dome system to achieve President Trump's bold vision.\n\nIn space, we established the Tactical Surveillance, Reconnaissance,  and Tracking program as a formal program of record to provide badly  needed space products from commercial providers to combatant commands.  We also provide tools to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695146/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…maintenance of this critical aircraft, which is used for       Close Air Support in ground maneuver operations, as well as       manned Intelligence, Surveillance and Reconnaissance       missions,'' the statement added.\n\n``The sale of A-29 sustainment will support the LAF's       implementation of the cessation of hostilities by providing       maintenance…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693688/department-of-defense-appropriations-act-2026"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…literally on purpose created a collision that has led to so  much space debris around our Earth today. We must use our technology  for missile detection, surveillance and reconnaissance, and global  communications to stay ahead of this communist dictatorship.\n\nFortunately, the U.S. Space Force, which, as I mentioned, was  established in 2019, maintains…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687924/space-dominance"}]