[{"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…you for the opportunity to elevate this  important issue. I thank my colleagues who have added their voice to  this issue. I hope that as the Senate considers this reconciliation  package, particularly around the issue of food security and hunger and  feeding our fellow Americans, that we take a hard look in the mirror  and think about what we are doing…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691770/151-days-without-a-vote-to-lower-costs"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…backroom deal does nothing to stop 20 million Americans who  will see their healthcare premiums double or triple. It does absolutely  nothing to stop provisions in the reconciliation package that will  strip 15 million people of their Medicaid coverage.\n\nThese cuts will have a resounding impact on individuals and the  healthcare industry and economy as…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696743/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…Speaker, for the next 60 minutes, members of the CBC have an  opportunity to speak directly to the American people and directly to  you on the Republicans' disastrous reconciliation package. This is an  issue of great importance, of utmost importance, and of perilous  importance, not just to the Congressional Black Caucus but to everyone.\n\nHopefully, Republican…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691088/big-backstabbing-bill"}, {"senator": "Veronica Escobar", "party": "Democrat", "sentence": "…next. In fact, he has already begun deporting  U.S. citizen children.\n\nJust today, in the House Judiciary Committee, as the Judiciary  Committee was marking up the reconciliation package, which,  unfortunately, many Republicans will just blindly approve, Judiciary  Committee Republicans refused to protect U.S. citizens from  deportation.\n\nIt is shocking,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690507/trump-immigration-policies"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…colleagues on the other side of the aisle. Instead of  working to pass legislation to keep our communities safe from gun  violence, the Republicans included in their reconciliation package a  provision that calls for the elimination of registration and ownership  requirements for silencers that have been in place since the National  Firearms Act went…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691754/national-gun-violence-awareness-month"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…centers, patient-to-direct primary care       providers that serve rural and underserved communities       nationwide.\n\nAs the House and Senate work toward a budget reconciliation       package, Advocates for Community Health encourages a cautious       approach to changes to Medicaid policy as broad changes have       a potential to destabilize State Medicaid…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…families, especially  those with children with special needs.\n\nWhat makes me even more angry is this so-called sneaking in of the  nonprofit killer bill into the budget reconciliation package. We have  to worry about that now.\n\nThis is dangerous and unconstitutional legislation that would give  the Trump administration unchecked power to target any nonprofit…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691384/the-nakba-never-ended"}, {"senator": "Jimmy Panetta", "party": "Democrat", "sentence": "…being so  concerned and so focused on this. Let's just hope they have that same  concern when it comes to Medicaid and Medicare going forward,  especially with the reconciliation package.\n\nThey understand, and we understand, that it is critical that we start  expanding access to preventative care and chronic care management to  stem the tide of chronic…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688477/chronic-disease-flexible-coverage-act"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…doing seems to indicate that  they are trying to make us sicker again. They have fired 10,000 HHS  health professionals. On this floor this week, the GOP passed a  reconciliation package that would cut Medicaid by billions of dollars.\n\nEvery day my constituents ask how can this cruel agenda continue?  Yesterday, I met with Rochelle Tittmann, a mom of…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690049/who-we-are-fighting-for"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…because in this rule, Republican leadership snuck in a  rewrite of their big, ugly bill.\n\nYes, that is right. A vote on this rule is effectively a revote on  their reconciliation package, a do-over. It is a  desperate attempt by Republican leadership to fix the mess they made  with their awful tax scam.\n\nNow, when they rushed it through in the middle…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692385/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…Day, my  colleagues across the aisle are putting forth a set of resolutions to  gut protections for clean air and public lands across the West, while  they prepare a reconciliation package next week that would open our  public lands to oil and gas drilling, selling them to the lowest  bidder, and repealing historic investments in climate and clean energy.…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690326/one-hundred-days-of-chaos-dysfunction-and-attacks"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…Republicans are delivering on the  mandate the American people gave us last November. We passed a  responsible budget resolution, and now we are moving forward with a  strong reconciliation package that reflects President Trump's America  First agenda.\n\nThe bill secures our southern border, keeps taxes low for working  families and small businesses, strengthens…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689009/recognizing-salvation-army-of-harrisonburg-and-rockingham-countys-100th-anniversary"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…those of us in the House and  Senate, concerned about addressing our fiscal irresponsibility the last  4 years and working together in a unified fashion, to pass a  reconciliation package that is set in motion by today's budget  resolution. It will give this administration the tools they need to  succeed in fulfilling their election mandate.\n\nMr. Speaker,…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688085/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…projects for which  the American citizens should not be footing the bill. It is up to  Congress now to come together and advance both the President's budget  and the reconciliation package across the finish line.\n\nMr. Speaker, we owe nothing less to the American people who are tired  of being placed behind illegal aliens. When illegal aliens are given…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690711/outrageous-government-funded-incentives"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…opportunities to debate, amend, and provide  suggestions when the appropriate authorizing committees move forward  when we begin our work on spending reforms in a budget reconciliation  package. We should focus on the legislation before us this week.\n\nI encourage my colleagues to engage in regular order as our  authorizing  committees begin to work on our…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688464/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing-and-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…Americans today.\n\nHardworking Americans are watching what we are doing. They are  working hard.\n\nAre we working hard for them?\n\nWe need to come to the table with this reconciliation package. I want  everybody--we should all be at the table and realize that our  healthcare costs are out of control. President Trump is already showing  leadership on this.…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691249/president-trump-in-the-middle-east"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…provision has somehow reemerged in  the Senate.\n\nI will be very clear: The inclusion of any such provision in the  final version of the bill will imperil the entire reconciliation  package. Our beautiful public lands are not just national treasures.  They are deeply interwoven with our communities. They are essential to  the character of our region.…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692816/do-not-mess-with-our-public-lands"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…tax plan that  stimulated the strongest economy in the past 50 to 100 years. A ``no''  vote on this plan is a ``no'' vote for small business. Anyone who says  this reconciliation package doesn't help small businesses either  doesn't understand it or is choosing to ignore what is in it. This  legislation is progrowth, proinvestment and pro-small business.…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690760/national-small-business-week"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…low-income housing tax credit,  we penalize people who work hard. I think that is horrible public  policy, but that is what we do.\n\nMr. Speaker, in any event, when the next reconciliation package comes  through, I strongly hope that the Republican leadership, rather than  allowing something like the low-income housing tax credit to go through  and be expanded,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695628/breakdown-of-traditional-families"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "Mr. MOORE of Utah. Mr. Speaker, again, it has been quite a week for  the House Republicans with the long and late committee hearings as we  move forward on our reconciliation package and deliver substantial wins  for the American people. Like I mentioned, they were overnight, so  anybody that might have got caught snoozing for a few seconds here…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691166/events-this-week"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…money into the pockets of working families. In my  district, it is about $1,700 a month that the current Tax Cuts and Jobs  Act delivers. We deliver even more in this reconciliation package.\n\nThat might not sound like a lot to some of the people on the other  side of the aisle. For my constituents, that is a couple of mortgage  payments. That means real…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691514/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…possible and hear their concerns, understand their areas of  growth, what their opportunities are, and, most importantly, what their  challenges are.\n\nGoing back to the reconciliation package--and we are working on,  particularly, the tax portion--we are looking to deliver positive  results to our small businesses and craft policies that will allow them…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690787/big-beautiful-bill"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…$5 billion, $20  billion, $30 billion, $50 billion? You see, Congress doesn't have the  ability to say no to spending.\n\nLet's bring it all back. Should I vote for a reconciliation package  that will almost certainly guarantee $1.5 trillion to $2 trillion of  deficit spending because I am getting certain crumbs in cuts in certain  committees, and the…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690594/fiscal-responsibility"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…much done in the last 11 months.\n\nWe started the year off with an impressive clip, confirming President  Trump's Cabinet at a record speed. We successfully passed a  reconciliation package, which will extend President Trump's tax cuts  for working families, known as the One Big Beautiful Bill or the  Working Families Tax Cuts Act, which contains far more…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697200/senate-agenda"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…putting America first.\n\nThe American people spoke loud and clear in November. They are ready  for Washington to operate in a new patriotic and responsible way, and  our reconciliation package is the first step in that direction.\n\nMr. Speaker, I appreciate the opportunity to be a part of such a  historic opportunity, and we as Republicans cannot let this…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690786/big-beautiful-bill"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…Stephanie Bice and Congressman Craig  Goldman for taking the lead on this issue. I will speak more on these  later.\n\nThis week, we are seeing great progress in getting our reconciliation  package to the next step. The efforts seek to serve Americans better by  securing our border, supporting our economy, bolstering domestic energy  production, maintaining a…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689152/advancing-america-first-policies"}]