[{"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…treating every resource management plan as a rule that is subject  to the CRA, Congress is throwing the legal status of every oil and gas  lease, every grazing permit, and recreational activity across the West  into question.\n\nI ask my Republican colleagues: Why pursue the CRA process when this  administration has already revised the plan in question?…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696880/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Mike Quigley", "party": "Democrat", "sentence": "…depend on fisheries for food,  livelihood, and sport, it is critical we continue to monitor the Great  Lakes and our native fish species. The total value of commercial,  recreational, and Tribal fishing in the Great Lakes is at least $5  billion. The industry supports an estimated 75,000 jobs across the  region.\n\nResearch into the Great Lakes fishery…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698193/great-lakes-fishery-research-reauthorization-act"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…whitetail deer, grouse, black       bear, and one of the largest selfsustaining populations of       native lake trout in America. The potential loss of these       unique recreational opportunities is a stark reminder of the       stakes involved in protecting this irreplaceable natural       resource.\n\nH.J. Res. 140 would overturn the 20-year mineral…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699274/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…strengthen the Coast Guard's ability to meet a core  mission, saving lives. As we all know, the Coast Guard is involved in  high-risk drug interdiction missions, as well as recreational boating  oversight where drugs may also be present.\n\nThis bill requires the Coast Guard to update its policy on carrying  and utilizing medications to treat drug overdoses…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692170/controlled-substance-onboard-vessels"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…destinations safely.\n\nNOAA's seasonal forecasts help farmers plant and grow our food.\n\nOn the seas, NOAA's nautical charting and mapping services are used  by everyone, from recreational boaters to international shipping  companies. Its exploration of uncharted portions of the ocean floor  give us insight into parts of our planet that are still as mysterious--…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688171/national-oceanic-and-atmospheric-administration"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…regularly. They report on what  is happening by being there in person at event after event.\n\nThe publication is truly local: high school sports stories, local  meetings, recreational activities, and neighborhood associations and  their activities.\n\nWe recognize the hard work of Joanne and her colleagues, and from the  floor of the House of Representatives,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699710/saluting-scarsdale"}, {"senator": "Laura Gillen", "party": "Democrat", "sentence": "…maritime drug enforcement in our waters.\n\nMadam Speaker, East Rockaway Inlet is a critical Federal navigation  channel, which Long Islanders rely on for both commercial and  recreational boating and fishing. While the U.S. Army Corps of  Engineers is responsible for maintenance dredging of the inlet, the  Coast Guard maintains the markers and the buoys to…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694194/coast-guard-authorization-act-of-2025"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…navigate regulatory agencies. Tom has  been particularly impactful within the City of Denver, having rewritten  Denver's liquor licensing rules, helped create regulations for  recreational marijuana, and designed the licensing structure for pedal  cabs in the city. His work with the American Arbitration Association  has helped further its mission for more…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696277/recognizing-tom-downey"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…I am honored to  represent, the NEP helped restore hundreds of acres of tidal wetland  which improved salmon runs, protected dairy farms from flooding, and  created new recreational corridors.\n\nOn the Gulf Coast, NEP projects rebuilt marshes that shield front- line communities from hurricanes. In New England, estuary programs  helped revive the shellfish…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698176/enhancing-science-treatment-and-upkeep-of-americas-resilient-and-important-estuarine-systems-act"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…Kentucky to the city of Paducah through the  Federal Lands to Parks Program.\n\nThis program allows States, counties, and local governments to  acquire surplus land for public recreational purposes, an incredibly  impactful alternative to the Trump administration's public lands  selloff scheme.\n\nAlthough the land was conveyed to the city, the National Park…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697650/removing-restrictions-from-a-parcel-of-land-in-paducah-kentucky"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…those in need, a township handyman that  provides free services for seniors, and a recreation department  dedicated to building a stronger community through educational and  recreational programming.\n\nMr. Speaker, I congratulate Leyden Township on its first 175 years.", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697323/9999"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…plan provided a modern framework that balances  responsible energy and mineral development with the protection of  wildlife habitat, water resources, cultural sites, and recreational  opportunities. It provides a stable and predictable framework to guide  and balance the multiple uses of our public lands and resources based  on the needs of today and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694909/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…economy.  Every year, I and millions of other hunters rely on public lands to  feed our souls and to feed our families. The Sportsmen's Alliance  estimates that in 2022, recreational hunters alone generated $133  billion in economic output, created 1.3 million jobs, and supported  more than $80 billion in wages alone. And this is part of a larger  pattern.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695667/cloture-motion"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…sadness;       or\n\n(IV) difficulty sleeping; and\n\n(C) can occur--\n\n(i) with or without the loss of consciousness; and\n\n(ii) during participation in any organized sport or       recreational activity.\n\n(2) Health care professional.--The term ``health care       professional'' means an individual--\n\n(A) who has been trained in diagnosis and management of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695777/by-mr-padilla"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…follow her divine calling, Sarah was a  respected leader and worked in various capacities, including Alexandria  City Public Schools, the Campagna Center, and the Alexandria  Recreational Department. Her decision to pursue ordination is a  milestone, not only for her, but for the entire church, and the broader  community as we continue to embrace and celebrate…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688586/recognizing-reverend-sarah-yvonne-williams-carr"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…make their first catch, creating  meaningful and lasting memories.\n\nThese fisheries are also a lifeline for our local economy. Taken  together, the Great Lakes commercial, recreational, and Tribal  fisheries generate over $7 billion annually and support over 75,000  jobs.\n\nThat is why I am proud to join Representatives Debbie Dingell and  Bill Huizenga…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693993/great-lakes-mass-marking-program-act-of-2025"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…to the Northwest  Commission, the Northwest PA Job Connect, and the Leadership Warren  County Steering Committee.\n\nJim has been a driving force behind major economic and recreational  initiatives in the county, including the facilitation of the Warren  County Industrial Complex, which is a business incubator that supports  a dozen small to large midsized…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697068/recognizing-jim-decker"}, {"senator": "Paul Gosar", "party": "Republican", "sentence": "…Exclusion.--The Secretary shall exclude from the       conveyance under subsection (a) any Federal land that       contains significant cultural, environmental, wildlife, or       recreational resources.\n\n(c) Payment of Fair Market Value.--The conveyance under       subsection (a) shall be for the fair market value of the       Federal land to be conveyed, as…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693918/la-paz-county-solar-energy-and-job-creation-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…the presence and potent effects, which makes the  danger even harder to stop.\n\nPeople hear stories on a regular basis where kids go out and party.  They shouldn't be using recreational drugs, but they don't deserve to  die. I heard the example just today by our chairman with regard to some  of these drugs, say marijuana, what have you, and other drugs.…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692342/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…the protection of such values within       the'' NPR-A. The statute also authorizes the Secretary to       designate lands ``containing any significant subsistence,       recreational, fish and wildlife, or historical or scenic       value'' and requires that exploration in these areas ``shall       be conducted in a manner which will assure the maximum…", "date": "2025-07-28", "source_url": "https://justfacts.votesmart.org/public-statement/1694269/us-government-accountability-office-legal-opinion"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "…through police and fire departments, essential  infrastructure support via a robust public works department, access to  clean water and sanitation utilities, and vibrant recreational and  library services. These offerings reflect the city's deep commitment to  enhancing quality of life for its residents.\n\nFruitland Park's natural beauty, small-town charm,…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693999/recognizing-the-100th-anniversary-of-the-city-of-fruitland-park-florida"}, {"senator": "Hal Rogers", "party": "Republican", "sentence": "…tribute to the  Brother's Keepers Motorcycle Club of Kentucky. What started out as a  group of firefighters whose main purpose was to strengthen their  brotherhood through recreational motorcycle rides, has now grown into a  club with much greater purpose.\n\nThe Brother's Keepers Motorcycle Club focuses on safety and  motorcycle awareness nationwide. However,…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694746/tribute-in-honor-of-brothers-keepers-motorcycle-club"}, {"senator": "John Thune", "party": "Republican", "sentence": "…resilience of the seafood industry to       harmful algal blooms and to expand access to testing for       harmful algal bloom toxins, including for subsistence and       recreational harvesters, through innovative methods that       increase the efficiency and effectiveness of such testing in       rural and remote areas;\n\n``(H) to support sustained…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695277/harmful-algal-bloom-and-hypoxia-research-and-control-amendments-act-of-2025"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…across the world to the Grange Fair. The Grange Fair has served as a  home away from home for families who, for a period of over a week, live  in a thousand tents and 1,500 recreational vehicles. It is a testament  to our unique and enduring spirit that the Grange Fair stands as the  only remaining tenting fair in the Nation.\n\nThis weeklong celebration…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694934/recognizing-centre-county-grange-fair"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…urban areas with limited physical       security measures such as pedestrianized city centers,       commercial districts, residential neighborhoods, public       parks, recreational areas, educational institutions, and       tourist destinations.\n\n(C) A comprehensive summary of actions taken by the       Department of Homeland Security, the Transportation…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696768/department-of-homeland-security-vehicular-terrorism-prevention-and-mitigation-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…SHORT TITLE.\n\nThis Act may be cited as the ``Semiquincentennial Tourism       and Access to Recreation Sites Act'' or the ``STARS Act''.       SEC. 2. WAIVED FEES AT PUBLIC RECREATIONAL SITES IN HONOR OF                     AMERICA'S 250TH ANNIVERSARY.\n\n(a) In General.--In honor of the semiquincentennial of the       United States of America--\n\n(1) the…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697765/semiquincentennial-tourism-and-access-to-recreation-sites-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…with more than 200 graduates, including over  100 children ranging from kindergarten to fifth grade. The group also  performed almost 150 Vessel Safety Checks to ensure recreational  boaters have all the safety gear they need to be legal and safe and  conducted more than 175 Recreational Boating Safety Program Visits to  boat equipment stores, marinas,…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690718/recognizing-coast-guard-auxiliary-clearwater-flotilla-11-1s-75th-anniversary"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…oppose  offshore oil and gas production. I know they oppose American energy  independence. I know they have a special affinity for fish that aren't  in the Gulf and attack recreational fishermen in their endeavor to go  out and spend time with their family and catch fish. I don't know what  part of the Gulf that they think is so ignorant that they wanted…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690939/gulf-of-america-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…Harvest on national forestland is also critical for supporting rural  school districts through county payments derived from timber sales.\n\nOur forests also provide countless recreational opportunities, such  as camping, hiking, fishing, and many other activities available in the  great outdoors.\n\nHowever, many of our Federal forestlands remain unhealthy…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691520/recognition-of-may-as-wildfire-awareness-month"}, {"senator": "French Hill", "party": "Republican", "sentence": "…1,000  fish per square mile brings anglers of all sizes, types, and ages to  Arkansas.\n\nMr. Chair, because of Arkansas' many rivers, lakes, and other natural  beauties, recreational fishing that is done on the Little Red River now  contributes $1.2 billion and 10,000 jobs to the Arkansas economy.  However, despite this beloved place in Arkansas' heritage,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694859/energy-and-water-development-and-related-agencies-appropriations-act-2026"}]