[{"senator": "Al Green", "party": "Democrat", "sentence": "…districts.\n\nIn Allen v. Milligan, 599 U.S. 1, 45 (2023), Justice       Kavanaugh noted that ``even if Congress in 1982 could       constitutionally authorize race-based redistricting under       Sec. 2 for some period of time, the authority to conduct       race-based redistricting cannot extend indefinitely into the       future.'' 599 U.S. 1, (Kavanaugh,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694943/bloody-sunday-and-voting-rights-act"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…respects people of all colors, and he is turning society against  people of color.\n\nThis letter, if they succeed with this, will be the equivalent of  having a mid-decade redistricting without the empirical evidence  necessary to do it with a sense of justice. They will do this, and in  so doing, it is comparable to having the halftime at a basketball…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694163/racism-infused-in-texas-politics"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…rights and serving as a  staunch defender of voters in the courts, the section has withdrawn its  engagement in seven active voting cases. Where it does remain involved,  in redistricting cases such as Louisiana v. Callais, it has taken a  sudden and staunch anti-voter stance.\n\nThe Department of Justice has decided to make a mockery of poll  monitoring as…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696440/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…called it to my attention, and many have. Many persons in the  legislative body in the State of Texas have called this to my  attention--has established what is called a redistricting commission or  committee.\n\nWith this redistricting commission or committee, the Governor is  going to try--I am being told--to draw the lines for these  congressional districts…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692116/authoritarianism"}, {"senator": "Jimmy Gomez", "party": "Democrat", "sentence": "…to serve on numerous executive boards and  commissions, notably including the City's Children, Youth, and Family  Commission and the Los Angeles Unified School District's Redistricting  Commission.\n\nIn recognition of Ms. Figueroa-Villa's decades of leadership in  advancing social justice and community empowerment, the city has named  the intersection…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696024/recognizing-the-achievements-of-sandra-figueroa-villa"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…dealt with is, of course, the President of  the United States, so I have a resolution that condemns President  Donald Trump for ordering an unprecedented midcycle, racist  redistricting effort in Texas--midcycle, racist redistricting in Texas,  President Trump.\n\nI have this resolution because a court concluded that it was racist.  The court concluded under…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700075/black-history-stolen-legacies"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…Republicans for rising healthcare premiums by a 26-point  margin. Surprise: Americans also overwhelmingly blame Republicans for  the shutdown. I see tread marks everywhere.\n\nRedistricting: The drama started when Trump called Greg Abbott and  demanded five more Republican seats in Texas, triggering California's  redistricting efforts that could cost California…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697771/intervening-in-gops-relationship-with-president-trump"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…California voters have deliberately  chosen to remove politicians from the process of drawing the lines for  legislative districts. Voters have empowered an independent citizens  redistricting commission to set the boundaries of representation so  that free and fair elections, not political manipulation, are the  motive force in our democracy.\n\nThis principle…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694777/protecting-representative-form-of-government"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…passed peacefully  and quickly on October 9, 2025.\n\nEddie, we miss you, my friend, but your legacy will be felt by our  community forever.                          End the Redistricting War\n\nMr. KILEY of California. Mr. Speaker, I rise today to, again, call  for an end to the terrible redistricting war that is cascading across  the country with the domino…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697101/highlighting-the-state-of-california"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "Mr. KILEY of California. Mr. Speaker, the redistricting war in this  country is starting to escalate to an absurd degree. Among the States  now looking at redistricting, or are currently in the process of it, we  have Texas,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "Mr. KILEY of California. Mr. Speaker, this is the moment to bring the  senseless redistricting war to an end.\n\nToday, a Federal District Court tossed out the gerrymandered map in  Texas with an appeal headed straight to the Supreme Court. California's  gerrymandered…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696907/bring-the-senseless-redistricting-war-to-an-end"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "Mr. KILEY of California. Mr. Speaker, I thank the gentleman for  yielding.\n\nMr. Speaker, in 2010, California voters overwhelmingly voted to  establish the Citizens Redistricting Commission. The voters said that  they wanted to take the process of drawing district lines out of the  hands of politicians. They said that voters should choose their…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694130/dismantling-californias-citizens-redistricting-commission"}]