[{"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…policy.\n\nInvest in U.S. Citizenship and Immigration Services'       capacity, access, and fairness. Congress should fund and       mandate meaningful improvements at USCIS to reduce       adjudication backlogs, expand language access, and ensure TPS       holders can realistically pursue alternative forms of relief.\n\nIncrease Funding for Legal Services…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699638/expert-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…expires in February 2026.\n\nIdeally, we and the Russians would agree to continue to abide by the  limits of the New START while we negotiate yet another treaty to  further reduce the number of nuclear weapons. But, unfortunately, last  February, Putin announced the Russian Federation's suspension of New  START, and there has been minimal discussion…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694014/new-start-treaty"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…the U.S. attacks. This tells us  that military action is not a reliable way to counter nuclear threats.  In 80 years of the nuclear era, the only proven, demonstrated way to  reduce the risk of nuclear conflict and to lessen the scale of its  destruction is through diplomacy and negotiations.\n\nIf not for past arms control agreements, Mr. Speaker, today's…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694117/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "…causes a tremendous amount of anxiety in the public. Our  credibility is shot whenever these things happen.''\n\nFormer Chief Robert Contee said that this authority would ``help  reduce the risk of returning poor performers to the force. . . . ''\n\nFollowing the devastating murder of George Floyd, D.C. enacted the  Comprehensive Policing and Justice Reform…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692304/protecting-our-nations-capital-emergency-act"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…It is good for business.  Amid rising energy demands and higher prices, an increase of $3 million  to the Weatherization Assistance Program will help low-income  households reduce their home energy use.\n\nMs. DEAN of Pennsylvania. Mr. Speaker, these bills, while not  perfect, reflect months of hard work by the Democrats to fight against  the administration's…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698757/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…the objections of the mayor,  over the objections of the Governor, in a historically unprecedented  way and in a way such as to escalate tensions in his town rather than  to reduce them.\n\nSo he decided to go to a peaceful public assembly. It was a press  conference. It wasn't a private meeting to which he was not allowed  entrance. A press conference's…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692555/alex-padilla"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…neurological problems, even at extremely low levels of exposure.\n\nIt has been suggested that the 2024 rule eliminates the incentive for  facilities to deploy new technologies to reduce pollution. However, we  have some real-world data on this, and there is zero evidence that  polluters will go above and beyond what is legally required of them by  installing…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691592/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…uncertainty and job insecurity because it prevents Federal agencies  from making new hires and starting new programs. It delays contracts  and applications for grants, which reduce the level of services  agencies provide while also increasing costs. It reduces funding for  nearly every Federal program that America relies on, such as VA medical  care and…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688483/disastrous-implications-of-a-yearlong-cr"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…homelessness. It will cut off Federal aid to students who want to  pursue a higher education. It will undermine the enforcement of the  rights of students with disabilities. It will reduce assistance  intended to lift up students not getting the support they need. It will  weaken protections for students and scrap evidence-based research that  helps us know what…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688363/nomination-of-linda-mcmahon"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "…back into local economies. I urged the Biden  administration to finalize these rules last Congress, and I remain  committed to protecting energy efficiency initiatives that reduce costs  and pollution.", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689256/opposition-to-hj-res-24-and-hj-res-75"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…include the fate and  transport of per- and polyfluoroalkyl substances (PFAS), pesticides  contamination in groundwater, and the development of green chemistry  solutions to reduce industrial pollution. Her groundbreaking  investigations into the disproportionate effects of environmental  toxins on disadvantaged communities have raised awareness around…", "date": "2025-08-12", "source_url": "https://justfacts.votesmart.org/public-statement/1694732/recognizing-the-exceptional-environmental-research-of-dr-shamira-brown"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…inspections that give us direct insight into  Russia's nuclear forces.\n\nNew START followed a long line of arms control agreements, from SALT  to START I to SORT, that helped reduce the global nuclear arsenal from  the Cold War highs of more than 70,000 weapons to fewer than 13,000  today. These agreements were supported by Democratic and Republican  administrations…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699037/expiration-of-new-start"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…on behalf of consumers  because most of Americans--I would hazard a guess that all Americans  are consumers.\n\nBecause when we export natural gas from the United States, we reduce  domestic supply, which pushes up the price. That is why the Natural Gas  Act since 1935, among other things, has required that gas export  facilities can't be built unless…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697090/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…better implement  the Bipartisan Safer Communities Act. This wasn't a terribly political  office. It was just trying to coordinate all the work being done across  Agencies to reduce violence in our communities. Trump would have taken  this office in a different direction, but he didn't. He just shuttered  it. There is no Office of Gun Violence Prevention…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690948/gun-violence"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…and it is amazing, I  would say to my colleague: Isn't it incredible that all of these cuts  they are proposing in healthcare are done with a purpose in mind, and  that is to reduce the taxes on billionaires? Doesn't it bother my  colleague that these people whom he has been documenting who so  desperately need healthcare are going to lose that if our…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689304/privileges-of-the-floor"}, {"senator": "Kat Cammack", "party": "Republican", "sentence": "…The reason why this bill is so important is, first and foremost, it  addresses the Biden administration's extreme LNG permit ban. By  facilitating the exportation of LNG, we reduce our reliance on foreign  energy sources, mitigating the geopolitical risks, and enhance our  national security in the process.\n\nBy expanding LNG export capabilities, it means…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697086/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…include the       following:\n\n(1) The determination of the FFRDC, made in consultation       with covered entities, whether each such notice may be       feasibly altered to reduce paper consumption by, and costs       to, the Federal Government.\n\n(2) The recommendations of the FFRDC regarding how the       Secretary may make such notices clearer to claimants,…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689678/clear-communication-for-veterans-claims-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…advanced adversary were to obtain       knowledge of the specific hardware and software elements, the       information could be used to develop countermeasures that       might reduce system effectiveness or be used in the       development of a system with similar or advanced       capabilities.\n\n4. A determination has been made that the Republic of Korea…", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697584/arms-sales-notification"}, {"senator": "Richard McCormick", "party": "Republican", "sentence": "…U.S. manufacturing equipment in global  semiconductor production means nearly all are subject to U.S. export  controls if destined for Russia or Belarus.\n\nMy bill seeks to reduce Russia's access to these semiconductors by  authorizing sanctions on any foreign adversaries that materially  support Russia's military and intelligence services, violate U.S.…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690678/economic-espionage-prevention-act"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…demonstration of methods and technologies to accomplish the       following:\n\n(A) Improve the efficiency of agriculture operations and       processing of agricultural products.\n\n(B) Reduce greenhouse gas emissions associated with such       operations and such processing.\n\n(d) Agreements.--In carrying out the activities under       subsection (a), the Secretaries…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688980/doe-and-usda-interagency-research-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…safety net for those who are  truly among the most vulnerable and to root out waste, fraud, and  abuse.\n\nThere is no evidence that anything that the bill did or will do will  reduce things like the National Oceanic and Atmospheric Administration  weather forecasting. Yet we hear Democrats claiming that somehow this  bill is responsible for things like…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693491/one-big-beautiful-bill-act"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…analyze regulations that may handicap the development of       domestic projects, and provide Congressional committees of       jurisdiction recommended policy changes to reduce regulatory       burdens for project development.\n\nWe were glad to see this legislation move through the       Committee on Natural Resources, and encourage Members of…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699694/critical-mineral-dominance-act"}, {"senator": "Troy Balderson", "party": "Republican", "sentence": "…including imposing a ban on new LNG  export permits. This misguided action discouraged investments in  American natural gas and harmed our allies abroad, who are working to  reduce their dependence on Russian energy.\n\nThe Unlocking our Domestic LNG Potential Act ends political  interference in the permit process and unleashes America's full energy  potential.…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697093/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…out with children and have a big  mortgage. We should look out for the average guy at a time when they  are most desperate.\n\nSome people would say my second pick would be to reduce the marginal  tax rate on the most technical manufactured goods because we want those  goods to be made here in America, and it would be great to have those  manufactured in…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691493/new-tax-cuts"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…led by my colleague on the Committee on Financial  Services from Tennessee, Mr. Rose, removes the permanent chassis  requirement for manufactured homes. This simple fix will reduce  unnecessary costs and help families move into new homes more quickly on  day one.\n\nThe package further modernizes longstanding programs so that Federal  housing tools better…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699812/lowering-housing-costs-and-advancing-main-street-community-banks"}, {"senator": "James Risch", "party": "Republican", "sentence": "…advanced adversary were to obtain       knowledge of the specific hardware and software elements, the       information could be used to develop countermeasures that       might reduce system effectiveness or be used in the       development of a system with similar or advanced       capabilities.\n\n4. A determination has been made that Israel can provide…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693349/arms-sales-notification"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…over 10 years.  Sadly, $72 billion is kind of a rounding error when we are talking  about 10 years.\n\nIn other words, it is close to breakeven. We would cut taxes, we  would reduce spending, and we would get economic growth. We believe we  would add nothing more to the deficit.\n\nHere is the problem. Adding nothing more to the deficit means we  still have…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693110/tax-cuts-and-spending"}, {"senator": "Scott Fitzgerald", "party": "Republican", "sentence": "…product. The rule will  not help working families. It will hurt them.\n\nBy capping fees below the costs of providing the service, many banks  and credit unions will be forced to reduce or eliminate overdraft  programs altogether.\n\nBecause of the CFPB's rule on overdrafts, consumers will lose  options. The resolution will repeal the CFPB's rule and protect…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689839/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…forward with housing affordability legislation to lower costs and  update financing options. We are streamlining and simplifying  permitting processes to create more jobs, reduce costs, and increase  wages. We are also lowering healthcare costs. In December, the House  passed legislation to cut premiums, expand Choice accounts, provide  more affordable…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699064/how-republicans-have-delivered-for-americans"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…outdated Federal regulations have  imposed restrictions on the types of milk students have access to in  school meals. While the Healthy, Hunger-Free Kids Act's intention to  reduce child obesity was good, its impacts to attack whole milk have  been misguided and devastating over the 15 years since its passage,  resulting in the loss of an entire generation…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698178/whole-milk-for-healthy-kids-act-of-2025"}]