[{"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…to the floor tonight to talk  about a few issues. Literally, I thought I was going to come and talk  about healthcare and the need for us to come together to help reduce  healthcare costs and to continue to fight to make sure Americans are  covered because covering them helps reduce all our costs when you have  the reduction of uncompensated care. But…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697849/national-weather-service"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…start in 60  days. That is  not how it works. They know that. They know that the clean energy tax  credits are popular. They know that the clean energy tax credits will  reduce costs for American families.\n\nSo instead of saying, ``Kill it outright,'' they say, ``You must  start within 60 days.'' That is saying, ``Kill it outright.'' Everyone  knows that,…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691671/budget-reconciliation"}, {"senator": "Jimmy Panetta", "party": "Democrat", "sentence": "…know  it is also a very big and impactful step so that, together, we can  implement our efforts to protect our planet, increase clean energy  options for our country, and reduce costs for communities.\n\nMr. Speaker, I urge my colleagues to vote ``aye.''", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697712/studying-nepas-impact-on-projects-act"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…Virginia.  Underwood).\n\nMr. SCOTT of Virginia. Mr. Speaker, may I inquire as to the time  remaining.\n\nMr. SCOTT of Virginia.  Dexter).\n\nMr. Speaker, this bill does nothing to reduce costs for all  Americans. By weakening protections, undermining State oversight, and  siphoning healthy individuals out of the ACA, this bill will actually  increase premiums…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698382/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…that 70  times--70 times. OK. So I am not surprised that we are days away from a  vote, and yet they are still not coming together to show us how they  are going to reduce healthcare costs.\n\nWe need to keep covering people because covering people is a way to  help reduce costs. As I mentioned, the expansion of the Basic Health  Program is one way to…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697783/healthcare"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…support this effort in any way I can. Illinois recently  received Federal approval to use Medicaid to cover preventive mental  health services in the community, which can reduce costs down the line.  And with Senator Capito, I have worked on Federal legislation to  increase funding for trauma-informed care in schools and with first  responders, to help…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688330/recognizing-the-joliet-emsfire-department-program"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "…back into local economies. I urged the Biden  administration to finalize these rules last Congress, and I remain  committed to protecting energy efficiency initiatives that reduce costs  and pollution.", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689256/opposition-to-hj-res-24-and-hj-res-75"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…government officials about the  concerns they have about shifting costs on their budgets. That is why I  oppose the energy appropriations bill here today because one way to  reduce costs while meeting our energy demands is through energy  efficiency programs and clean and renewable energy. However, this bill  cuts in half the Department of Energy's Office…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694882/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "Mr. MARKEY. Mr. President, I am here today to defend the standards  for our appliances that save energy, that cut climate emissions. They  reduce costs for American families and businesses. Yet Trump and his  Republican allies are attacking these commonsense appliance efficiency  standards.\n\nThis morning's vote overturned…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690527/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Kevin Mullin", "party": "Democrat", "sentence": "…administrations, with broad support and little controversy.\n\nAmerica should be leading the world in creating and adopting  innovative technologies, especially ones that reduce costs and help the  environment. Unfortunately, this was just another empty campaign  promise by candidate Trump that electricity costs would be reduced.\n\nLet me just emphasize…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689261/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…became the third State, joining Michigan and New  Jersey, to implement and run a Clean Water Act section 404 Permitting  program.\n\nThese State-run programs reduce duplicative requirements, reduce  costs, and expedite permit approval times exactly as Congress intended.\n\nThroughout the State-administered review process, Federal agencies  maintained robust…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698026/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…Griffith, and House leadership for  prioritizing this commonsense legislation.\n\nMr. Speaker, I urge my colleagues to support its final passage to  protect consumer choice, reduce costs, and eliminate unnecessary  regulatory burdens.", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688545/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "French Hill", "party": "Republican", "sentence": "…the world, payment systems are undergoing an evolution. New  technologies are modernizing legacy infrastructure and unlocking  innovative solutions to improve efficiency, reduce costs, and expand  access to financial services.\n\nMembers of the House Financial Services Committee have long  recognized the promise of payment stablecoins and have worked since…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693834/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "David Rouzer", "party": "Republican", "sentence": "…National Pollutant Discharge Elimination System permits for pesticide  use if the pesticide is already EPA approved and used according to  label requirements, which will reduce costs without weakening  environmental protections.\n\nFinally, the Improving Water Quality Certifications and American  Energy Infrastructure Act codifies the historic nationwide…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698028/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…tariffs that would harm their economy and  ours.\n\nI will briefly, then, just make, again, a few simple points. I am  disappointed that President Trump isn't doing more to reduce costs. He  was elected, in no small part, because of high inflation and promised  it would come down on day one.\n\nThese tariffs, if imposed, will make inflation worse and hit…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688254/unanimous-consent-request-s-348"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…all about and  why I am proud to work with the President every single day, trying to  figure out how we actually reduce the size  and scope of the government and how we reduce costs so you have more of  your own money in your own pockets. You earned it, after all.\n\nHere is the other refreshing thing. He talked about reducing Social  Security taxes during…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691176/president-trumps-delivery-on-his-promises"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…H.R. 5764, the AI  for Main Street Act, introduced by Representatives Alford and Scholten.\n\nArtificial intelligence is increasingly being used to streamline  operations, reduce costs, and boost productivity for small businesses.  For many small businesses across the country, adopting these tools  remains out of reach because they lack the staff, the…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699179/ai-for-main-street-act"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…make healthcare  affordable. Let me say that again: false pretenses. Extending the  subsidies would perpetuate that fraud.\n\nWe passed a bill before Christmas that would reduce costs by 11  percent, and that was from the CBO. The CBO said that, and we are not  exactly the biggest fans of that unique organization. Our plan would  actually fight fraud,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698796/breaking-the-gridlock-act"}, {"senator": "Joni Ernst", "party": "Republican", "sentence": "…estate.\n\nLet's sell off these haunted houses to businesses that can breathe  new life into them. That trick would be a real treat for the taxpayers  because it would both reduce costs and bring in billions of dollars  from monstrous sales. It is an idea only a zombie wouldn't like since  it is such a no-brainer.\n\nMy DISPOSAL Act would fast-track the sale…", "date": "2025-10-30", "source_url": "https://justfacts.votesmart.org/public-statement/1696486/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…forward with housing affordability legislation to lower costs and  update financing options. We are streamlining and simplifying  permitting processes to create more jobs, reduce costs, and increase  wages. We are also lowering healthcare costs. In December, the House  passed legislation to cut premiums, expand Choice accounts, provide  more affordable…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699064/how-republicans-have-delivered-for-americans"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…stakeholders,       especially the communities in which new projects are built;\n\n(3) establishing robust data architectures will ensure data       integrity, improve transparency, reduce costs, and enhance       the ability of the Federal Government to serve the public;\n\n(4) Federal agency use of modern software that can track       the full lifecycle of environmental…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697679/epermit-act"}, {"senator": "William Timmons", "party": "Republican", "sentence": "…develop a plan       for the agency--\n\n(1) to consolidate software entitlements of the agency;\n\n(2) to ensure that, in order to improve the performance of,       and reduce unnecessary costs to, the agency, the Chief       Information Officer, Chief Data Officer, and Chief       Acquisition Officer of the agency, or the equivalent       officers, develop…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698153/strengthening-agency-management-and-oversight-of-software-assets-act"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…role as the world's  reserve currency. It provides a private-sector alternative to a  government-run digital dollar which is very important, and it  modernizes payments to reduce costs and expand access. This is smart,  forward-looking policy.\n\nMr. Speaker, I urge my colleagues to support it.", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693836/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Mike Crapo", "party": "Republican", "sentence": "…proposed to begin the process of  true healthcare reform. Directing funds to HSAs controlled by patients  instead of insurers would spur competition, prevent fraud, and reduce  costs. Unfortunately, my colleagues on the other side of the aisle  rejected this proposal. Each side knows what the other side cannot  accept. A real solution must respect those…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699099/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…years of inflationary  policies of the Biden administration, but the facts show that House  Republicans under President Trump's leadership are delivering on  promises to reduce costs for American families.\n\nLet's just review some of the wins in the Working Families Tax Cut  Act because taxpayers are expected to take home an additional $91  billion in…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698637/providing-for-consideration-of-hr-saving-homeowners-from-overregulation-with-exceptional-rinsing-act-providing-for-consideration-of-hr-affordable-housing-over-mandating-efficiency-standards-act-and-providing-for-consideration-of-hr-commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}]