[{"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…include the fate and  transport of per- and polyfluoroalkyl substances (PFAS), pesticides  contamination in groundwater, and the development of green chemistry  solutions to reduce industrial pollution. Her groundbreaking  investigations into the disproportionate effects of environmental  toxins on disadvantaged communities have raised awareness around…", "date": "2025-08-12", "source_url": "https://justfacts.votesmart.org/public-statement/1694732/recognizing-the-exceptional-environmental-research-of-dr-shamira-brown"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…partially--pay  for tax breaks for billionaires.\n\nI have heard from healthcare leaders across my State who have told me  plainly that if this budget passes, they will have to reduce services  and lay off staff. Their facilities serve hundreds and, in some cases,  thousands of Medicaid patients. They are operating on razor-thin  margins already.\n\nThis plan…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692901/keep-rural-hospitals-open-as-lifeline"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…voting for this cruel bill, they are betraying hardworking  Americans by raising costs for all those already struggling to make  ends meet. The President said he was going to reduce the cost of  living. He didn't. He said he would reduce inflation. He didn't.\n\nMr. Speaker, indeed a vote for this budget is a vote against  Medicaid, ripping away healthcare…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688094/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions-and-providing-for-consideration-of-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…night and into the morning  as a newspaper delivery person and with a mother who worked as a  receptionist. This President promised. He said, on day one, that he was  going to reduce the cost to American families and improve their quality  of life. Only, 100 days later, Americans have only seen reductions in  the stock market, in their 401(k)s, and a lowered…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690300/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…everything in  our power to prevent this disease wherever possible.\n\nThis month reminds us that while cancer has affected so many lives,  there are meaningful steps we can take to reduce its impact. Research  shows that a significant share of cancer cases may be preventable  through practical, evidence-based measures. Simple but important  actions, such as…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700185/recognizing-national-cancer-prevention-month"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…special filibuster-free fast-track process,  known as reconciliation, for the sole purpose of reducing the deficit.  That is right, the original purpose of reconciliation was to reduce the  deficit.\n\nThe reconciliation process was built on three pillars. First, a  reconciliation bill cannot create deficits in the first 10 years.  Second, a reconciliation…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693857/hr-1"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "…Florida and Michigan. Its purpose  is simple: to give judges discretion in sentencing young adults.\n\nNow, judges can punish some young people, when appropriate, in ways  that reduce their risk of reoffending, but this bill would rip away  discretion.\n\nIt eliminates a judge's ability to waive mandatory minimums, even  when the facts show a one-size-fits-all…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695557/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…some skin in the game and to control costs for  taxpayers.\n\nTo ensure that the cost-match requirement is not a barrier to entry,  the Secretary of Energy has the discretion to reduce or eliminate this  cost-share requirement if the Secretary determines that it is necessary  or appropriate to do so.\n\nWhile it is important that the Secretary has this flexibility,…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688930/cost-share-accountability-act-of-2025"}, {"senator": "Thomas Suozzi", "party": "Democrat", "sentence": "…$11,000 a  year. If we refuse to act, their bill will go to $30,000 a year, or  $1,500 more per month. That is crazy. They won't even buy their  insurance. As a result, it will reduce the risk pool, which will cause  everyone's premiums in our country to go up.\n\nThat is why for months the Problem Solvers Caucus has been working  across the aisle, both here…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698794/breaking-the-gridlock-act"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…from Talon Metals's       Tamarack Nickel Project. Furthermore, recent research from       the Colorado School of Mines, By-product recovery from US       metal mines could reduce import reliance far critical       minerals, concluded that 90% recovery of these minerals/      metals as by-products at active U.S. mines now could meet       nearly all…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699274/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…Specifically, this bill provides participating cities with more  reliable guidance and support from the Department of Homeland  Security's Securing the Cities program, which seeks to reduce the risk  of terrorist attacks in high-risk urban areas, like my hometown of New  Orleans.\n\nI want to specifically thank Ranking Member Bennie Thompson and  Congressman Clay…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688698/securing-the-cities-improvement-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Congress the  authority to admit new States. All 37 new States were admitted by an  act of Congress. The District Clause of the Constitution gives Congress  the authority to reduce the size of the Federal district, which it has  previously done.\n\nThe substance of H.R. 2056 is irrelevant since there is no  justification for Congress to legislate on local…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692373/district-of-columbia-federal-immigration-compliance-act-of-2025"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…infrastructure, and promote efficient regional water  supply management while protecting the wilderness area.\n\nIt would also support higher in-stream flows for Cross Creek, reduce  energy consumption, and foster long-term economic benefits for Eagle  County. This is a priority for this community, and I thank  Representative Neguse for his hard work and…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693455/bolts-ditch-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…commonsense, and a carefully tailored  safeguard to prevent consumers from footing the bill of Big Oil's  methane waste, paired with Federal funding to help big oil companies  reduce their waste.\n\nReducing methane waste in the atmosphere saves consumers money. It  protects local communities from pollution; and methane, as you know, is  a superpotent greenhouse…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688145/methane"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…Congress, firing career  public servants, and hollowing out entire agencies.\n\nLet's be honest. These are not going to lower the costs for American  families. It is not going to reduce the deficit, but it will make the  world more dangerous.\n\nIt will make Americans less safe and less prosperous.\n\nMr. Speaker, I urge a ``no'' on this bill.\n\nMs. DeLAURO.  Kelly).…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692541/rescissions-act-of-2025"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…humane way to do it is to re-implement things like the  remain in Mexico policy. The point I had always tried to continue to  make was that a simple policy change would actually reduce border  crossings significantly. When we do that, we take away the power that  the cartels have. When the cartels are in power, human beings suffer.  There is no other way…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690427/the-first-100-days"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…example of the council's importance can be found in the report  that it issued in 2018 titled: ``Advancing U.S. Coal Exports.''\n\nAlthough environmental NGOs have worked to reduce domestic coal  production and use, our allies in Asia have an increasing demand for  coal, confirming that export markets present a significant opportunity  for States like…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695769/national-coal-council-reestablishment-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…our colleagues  represent in their States--would applaud this effort.\n\nI can't think of a more difficult but important goal than helping the  government find efficiencies and reduce spending, because if we reduce  spending, two things happen: Either we reduce the taxes that are taken  from the hard-working families and produce the revenue by which  government…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690662/department-of-government-efficiency"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…STUTZMAN. Mr. Speaker, I want to talk about our budget. We here  in Congress have a greater opportunity and a responsibility to be sure  that we move towards a balanced budget and reduce our debt and  deficits.\n\nI would encourage all of us, Republican and Democrats, to realize we  are spending more money than what we make. Mr. Speaker, $1 trillion  goes towards…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691249/president-trump-in-the-middle-east"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…effects ---------------------------------------------------------------------------------------------------------------- H.R. 176.......................  No Immigration     Reduce by Less     None.............  ......................                                   Benefits for       Than $500K.                                   Hamas Terrorists…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697191/developing-and-empowering-our-aspiring-leaders-act-of-2025"}, {"senator": "John Carter", "party": "Republican", "sentence": "…Heidi Darning, and Dr. Nancy Krenek, the program has grown  significantly over the past two decades.\n\nToday, ROCK On Veterans offers a no-cost, 24-week curriculum proven  to reduce PTSD and anxiety while enhancing overall quality of life. In  addition to its equine services, the program now includes the Sport  Clips Heroes Arena, the H-E-B Serving Kitchen,…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689420/recognizing-the-contributions-of-ride-on-center-for-kids-rock"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…Supplemental  Nutrition Assistance Program.\n\nGrant Smith, deputy director of the Office of Federal Affairs at the  Drug Policy Alliance, works tirelessly to promote policies that reduce  instances of recidivism among those formerly incarcerated.\n\nHowever, today my words are less about the policies and more about  the man who spent the last many years fighting…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688646/recognizing-grant-smith"}, {"senator": "James Risch", "party": "Republican", "sentence": "…advanced adversary were to obtain       knowledge of the specific hardware and software elements, the       information could be used to develop countermeasures that       might reduce system effectiveness or be used in the       development of a system with similar or advanced       capabilities.\n\n4. A determination has been made that Australia can provide…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695912/arms-sales-notification"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…City Police Department: to enhance the quality  of life in New York City by working in partnership with the community  to enforce the law, preserve peace, protect the people, reduce fear,  and maintain order.\n\nIn every position that he has held, he has embodied the values of  public service and law enforcement with passion, professionalism, and  courage.…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689427/recognizing-david-camhi"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…hamstring our domestic energy producers.\n\nBy permanently classifying certain industrial facilities as major  sources of hazardous air pollutants, even if they successfully reduce  emissions, the Biden administration was seemingly punishing job  creators for being good stewards of the environment.\n\nAs an original cosponsor of S.J. Res. 31, I am proud…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691588/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…Forces by reforming  the acquisition process to deliver innovative equipment to the  warfighter at speed and scale.\n\nIt does so by accelerating the requirements process to reduce  decision timelines from 3 years to 3 months, by making other  transaction authorities more easily available for prototyping, and by  cutting red tape through eliminating duplicative…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695141/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…demonstration of methods and technologies to accomplish the       following:\n\n(A) Improve the efficiency of agriculture operations and       processing of agricultural products.\n\n(B) Reduce greenhouse gas emissions associated with such       operations and such processing.\n\n(d) Agreements.--In carrying out the activities under       subsection (a), the Secretaries…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688980/doe-and-usda-interagency-research-act"}, {"senator": "Steve Daines", "party": "Republican", "sentence": "…identified by the court order.\\21\\\n\nAdditionally, the Miles City RMPA allocates 1,745,040 acres       as unavailable for further consideration for leasing in order       to reduce greenhouse gas emissions.\\22\\ As such, BLM will not       accept new coal lease applications. However, existing coal       leases may be developed in accordance with lease…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693085/us-government-accountability-office-legal-opinion"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…of more companies. More  companies can sell securities to the public quicker and with less cost.  This bill helps modernize our capital markets, Mr. Chair, to lower  costs, reduce complexity, and open opportunities for more Americans.\n\nMr. Chair, I encourage my colleagues to support this legislation.", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697826/increasing-investor-opportunities-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…flat and growing our economy,  we are reducing the size and scope of bureaucracy. We are reducing debt  as a percentage of our GDP and honoring the commitment that we gave to  reduce inflation and to take our country back from the grasp of debt.\n\nWe avoided a massive omnibus spending bill twice, the scourge of this  town, where you have these huge omnibus…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697130/congress-is-back"}]