[{"senator": "Jim Costa", "party": "Democrat", "sentence": "…and  the STOP Health Threats Act.\n\nMany of us became aware of this issue in the San Joaquin Valley in  2023 when an illegal biolab was discovered operating in my district in  Reedley, California. Local officials uncovered a clandestine operation  storing biological materials, laboratory equipment, medical waste, and  dangerous, dangerous pathogens like…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699754/stopping-unregulated-biological-laboratories"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…attention  and immediate action from the United States Congress.\n\nAn illegal bio lab was just raided in Las Vegas, and it is directly  linked to the secret Chinese bio lab found in Reedley, California, in  late 2022. That lab was oozing with E. coli, HIV, malaria, and other  dangerous pathogens.\n\nThe lab just raided in Vegas was operated by the same LLC and…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699473/illegal-bio-lab-in-las-vegas"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…throughout the United States.\n\nA couple of weeks ago, a second illegal biolab run by Chinese  nationals was discovered in Las Vegas. This follows the lab that was  found in Reedley, California, a couple of years ago. It was run by the  same international fugitive with ties to the Chinese Communist Party.\n\nWhile the samples are being tested now, it looks…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700217/prices-in-california-are-too-high"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…alarming news that we have  just heard from Las Vegas of the discovery of yet another illegal,  dangerous biolab run by Chinese nationals.\n\nIn 2023, when the secret lab in Reedley, California, came to light,  thanks to the tremendous efforts of local officials there, I gave  several speeches on this floor calling attention to the danger that  this posed…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699738/national-oversight-for-biological-labs"}]