[{"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…and Medicaid and  Medicare from within with massive layoffs, funding cuts, and crashing  websites. The market is having its worst day since the COVID crisis,  sending 401(k)s reeling.\n\nAnd what are Republicans in Congress doing? They are cutting taxes  for billionaires and paying for it by cutting Medicaid.\n\nNow the billionaire tax breaks will add $37…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689616/taxes"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…kids in the suburbs,  for the most  part, had access, but kids who were poorer--and, disproportionately,  they were Black and Brown--in our Nation did not. And we are still  reeling from the effect that period of time had upon young people in  our Nation.\n\nThe program, as it was implemented, however, helped nearly 18 million  students at 10,000 schools…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690803/addressing-the-homework-gap-through-the-e-rate-program"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…we do not want  American dollars sent to Afghanistan to be diverted to the Taliban.  However, we must do so in a way that does not further alienate those  partners already reeling from the Trump administration's foreign  assistance freeze, which terminated nearly all humanitarian assistance  to Afghanistan, despite its compliance with U.S. law and policy.…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692739/no-tax-dollars-for-terrorists-act"}, {"senator": "Sylvia Garcia", "party": "Democrat", "sentence": "…in the White House, calling  an emergency session to redraw congressional maps in Texas. These are  maps that he himself approved in 2021.\n\nWhile Texas Hill Country is still reeling in grief and trying to  recover from devastating floods, Republicans prove that it is always  the right time to do the wrong thing.\n\nTexans are struggling and deserve so much…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693660/redrawing-congressional-maps-an-attack-on-democracy"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…through just in these months? A trillion dollars in cuts to  Medicaid. A trillion dollars in cuts to Medicaid. Already, hospitals  and nursing homes and doctors' practices are reeling at what those cuts  mean for their financial viability.\n\nMedicare--Medicare--half a trillion dollars in cuts hidden in the  bill in a tricky way so that the cuts come through…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695927/government-funding"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…16-year-old shot and injured two students  and an administrator. Tonight, these three victims are still  recovering, and their classmates and teachers and families are still  reeling. Every elementary and middle school in the State is wondering  whether they might be next.\n\nIt has been 26 years since the Columbine tragedy; 26 years since 2  gunmen murdered…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695673/cloture-motion"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…replacement, and no plan, the Trump administration decided that these  veterans are on their own.\n\nThe decision came down just hours after the new Trump tariffs sent  our economy reeling, plunging the stock market, increasing job  insecurity, and deepening financial strain on working families,  including veterans.\n\nIt is hard to imagine a starker representation…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689694/montgomery-gi-bill-selected-reserves-tuition-fairness-act-of-2025"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…leaving veterans, veterans service  organizations, and mortgage services unsure how the closure would be  administered, and what would happen to veterans that are already  reeling from this administration's assault on veterans and our economy.  We write today to urge you to immediately reverse this decision, and  avoid foreclosing on veterans who simply…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689686/prioritizing-veterans-survivors-act"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…I have spoken with New Mexicans who have  been impacted by these reckless decisions. Their stories are  heartbreaking. Their families are suffering. Rural communities are  reeling, and they deserve to be heard.\n\nThe funding freeze is crippling essential programs in our State,  programs that provide wildfire prevention, conserve rangelands,  grasslands,…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687984/dire-consequences-of-funding-freeze-and-mass-firings"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…for American businesses to sell products in Canada.\n\nOne of the products that is an important one in Southern States like  mine is whiskey. ``The U.S. Alcohol Industry Is Reeling From Canada's  Booze Boycott. Trade fight prompts pullback in purchases by the biggest  export market for U.S.-made wines, costing American brands tens of  millions in sales.''…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696447/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…attacker targeted Jewish members of the Boulder community,  literally trying to burn them alive with Molotov cocktails and  incendiary devices.\n\nOur community, Mr. Speaker, is reeling from this terrorist attack.  This kind of hateful violence and anti-Semitism is spreading across the  country. It is metastasizing, and it has deeply shaken the people of…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692173/condemning-the-rise-in-ideologically-motivated-attacks-on-jewish-individuals-in-the-united-states-including-the-recent-violent-assault-in-boulder-colorado-and-reaffirming-the-house-of-representatives-commitment-to-combating-antisemitism-and-politically-motivated-violence"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…going to cut care and increase costs on all of us.\n\nPassing this bill and enacting these policies will only hurt working- class and middle-class Americans. Americans are still reeling from the  effects of inflation, to say nothing about the tariffs. This is not the  time to be taking away healthcare coverage or increasing premiums on  anyone. We have already…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692972/one-big-beautiful-bill"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "Mr. HEINRICH. Mr. President, I have come to the Senate floor today to  say what every New Mexican I know can easily tell you: Americans are  reeling from an affordability crisis. It doesn't matter if you are  talking about the price of groceries or rent or healthcare, everybody  is stretched thin.\n\nThey need help and they…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696124/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…Republican  conference, released yet another new plan to unleash another set of  harmful partisan changes to Americans' healthcare. This is being done  when millions are already reeling from the cuts that we saw to Medicaid  and the Affordable Care Act in the last bill.\n\nThe new draft plan contains yet another trillion dollars in cuts to  healthcare which,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699115/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…makeup of  that session was, we had a Democratic House, a Democratic Senate, and a  Democratic President.\n\nOf course, we had a country in the early days of 2021 that was still  reeling from the effects and the implications of a pandemic that wasn't  yet over. In fact, people, if we recall correctly, Mr. Speaker, were  just beginning to take that vaccine.…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689752/reflecting-on-americas-history"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…deadlines for  Americans living in a State-declared disaster area that has yet to  receive a Federal disaster declaration.\n\nThis bipartisan effort will help those Americans still reeling from a  devastating event. After all, they should be focused on restoring their  lives and livelihoods first and foremost.\n\nIf Washington is slower than a State government…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689383/filing-relief-for-natural-disasters-act"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…Biden's day-one decision to immediately shut down       construction of the pipeline that was supposed to carry oil       from Canada to Texas--leaving South Dakotans reeling and       1,000 people immediately out of work.\n\n``Where is it that they can go for their green job?'' Fox       News reporter Peter Doocy asked Psaki at her Monday afternoon…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688523/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "Greg Murphy", "party": "Republican", "sentence": "…for western North Carolina to  fully recover from the damage inflicted by Hurricane Helene. Since that  time, while we have come a long way, western North Carolina is still  reeling from the effects of Hurricane Helene and will continue to feel  the effects of that storm for years to come.\n\nIt is important that Congress provide as much relief as soon…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689315/disaster-related-extension-of-deadlines-act"}, {"senator": "John Rose", "party": "Republican", "sentence": "…into their misdeeds, yet no elected officials  should profit from  the political calculation of leftwing bureaucrats and judges.\n\nMr. Speaker, the folks I represent are still reeling from historic  Bidenflation, the effects of the border crisis, and the regulatory  agenda of the last administration. It is shameful to ask them to  shoulder the burden of…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696683/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}]