[{"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…remains divided but which accesses oil  from multiple fields along the eastern rims of both nations. Today,  South Korea does not produce oil, but it has the fifth largest refining  capacity in the world after the U.S., China, Russia, and India.\n\nIn Vietnam, over 58,280 conscripted U.S. troops died near the Chinese  border in an undeclared war by another…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698837/reflecting-on-impact-of-illegal-action-in-venezuela"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…does it. In fact, it is almost an insult,  particularly to refinery workers on the East Coast, including my State  of New Jersey, who don't need a study to tell them why refining  capacity here has dropped by over one third in the last decade. It all  goes back to the repeal of the crude oil export ban in 2015.\n\nYou don't have to take my word for it. The…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697034/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…reducing flood damage  and improving over 6,000 acres of coastal marsh and land to help  mitigate storm surges.\n\nJust as importantly, it protects 30 percent of the Nation's refining  capacity, 42 percent of specialty chemical feedstock, and 80 percent of  our military-grade fuel supply.\n\nThe bill also provides over $9 million to upgrade the Sabine-Neches…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698638/providing-for-consideration-of-hr-saving-homeowners-from-overregulation-with-exceptional-rinsing-act-providing-for-consideration-of-hr-affordable-housing-over-mandating-efficiency-standards-act-and-providing-for-consideration-of-hr-commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…up the crude oil issue. It is  actually because of the ingenuity of the American people that we have  an abundance of crude oil. The issue isn't crude oil. It is the  refining capacity.\n\nSince I was a kid, we found this abundance of crude oil in the  Permian Basin, North Dakota, and all the places I can name. We have  more oil than they have in the…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697031/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Mr. Speaker, today, I voted for and the  House passed the REFINER Act.\n\nThis is an important piece of legislation that is designed to  identify obstacles to expanding refining capacity in the United States,  and it is designed to promote energy independence.\n\nBefore we go through exactly what the bill does, I wanted to make  clear why this is so important…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697101/highlighting-the-state-of-california"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…about 20 million barrels per day by 2050. Alarmingly, over the last  several years, North America has lost an estimated 1 million barrels of  fuel per day due to low refining capacity.\n\nThe last report from the National Petroleum Council on refining was  completed over 20 years ago.\n\nThe report must include information concerning the contribution of…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697029/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Vince Fong", "party": "Republican", "sentence": "…medical devices, and even  space suits. They make gasoline and diesel for our cars and trucks, and  they make jet fuel for our planes.\n\nYet, over the past few years, our refining capacity has declined due  to burdensome Federal and State policies.\n\nI know this bitter reality all too well in my home State of  California.\n\nFrom 2020 to 2022, we lost more…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697028/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "Mr. CARTER of Georgia. Mr. Speaker, I rise today in support of H.R.  3109, the REFINER Act.\n\nFor too long, America has fallen behind in refining capacity. In  fact, we have lost an estimated 1 million barrels of fuel per day due  to low refining capacity.\n\nThe Biden administration declared war on American energy by  suspending…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697032/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…cheaper.\n\nNot only that, the current price does not account for the fact that  two refineries have recently announced that they are closing,  significantly reducing the refining capacity in our State.\n\nA study out of USC estimated that this could increase the price of  gas to $8 per gallon by the end of next year, and then we layer on top  of that this…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691570/public-lands-management"}, {"senator": "John James", "party": "Republican", "sentence": "…to put more money in their  pockets.\n\nMr. Speaker, this bill could not come at a more important time.  Today, China controls more than 90 percent of global rare earth  refining capacity. Russia maintains roughly 44 percent of the world's  uranium enrichment capacity and supplies a significant share of nuclear  fuel imports to the United States. These…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699991/securing-americas-critical-minerals-supply-act"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…protect and expand America's  ability to refine the energy we produce? Right now, unfortunately, the  answer is no, we are not.\n\nOver the last several years, America's refining capacity has gone  backward. We have lost more than a million barrels of capacity per day,  and several facilities have shut down altogether. The gentleman from  California mentioned…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697030/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}]