[{"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…proud to support the bipartisan infrastructure law, which  awarded $1 billion for a clean hydrogen hub that would create thousands  of jobs in northwest Indiana. BP's oil refinery prepared to make a  private investment of over $6 billion. Members of organized labor  created apprenticeship programs to ensure we had the workforce to bring  this project…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695607/devastating-harm-caused-by-trump-administration"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…who didn't smoke.\n\nAs a former restaurant owner, who didn't allow people to smoke, it  just reminds me of the same thing. I believe in research because I have  worked with a refinery and oil companies for many years. I was one of  those regulators. I represented the Bay Area on the California Air  Resources Board for 10 years. I was appointed by two Republicans,…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697035/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…wrong direction.\n\nIn northwest Indiana, two major energy projects that would have  increased supply and lowered costs were canceled. An $8 billion  hydrogen project at the BP refinery in Whiting supported by labor,  industry, the State, higher education partners, and the Federal  Government were halted. An $18 million alternative aviation fuel  project…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699652/when-supply-goes-up-prices-go-down"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…together a report. That is it.\n\nI cannot stress enough that this report is simply not needed,  regardless of who does it. In fact, it is almost an insult,  particularly to refinery workers on the East Coast, including my State  of New Jersey, who don't need a study to tell them why refining  capacity here has dropped by over one third in the last decade.…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697034/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…include an  important provision in the One Big Beautiful Bill Act that cuts red  tape on domestic energy production. It reopens Federal lands for  drilling and streamlines refinery regulations.\n\nMr. Speaker, it is simple: When America produces more energy, we pay  less at the pump. That means that we don't have to beg foreign  dictators for oil.\n\nIn…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692964/taking-a-step-toward-true-energy-dominance"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…have in the Middle East, which, when I was a kid, a  lot of it was coming from the Middle East.\n\nThen, you have this chokepoint of refining capacity. We haven't built  a new refinery in the United States since I was a kid, so that is the  thing that we want to address. That is the issue we want to address. We  do want prices to go down. We don't want it…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697031/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…gas prices are so much  higher than anywhere else in the country.\n\nThere are various reasons why they are so much higher. In fact, they  are going to get even higher with refinery closures that are happening,  but a big part of the equation is that we have a much higher gas tax  than anywhere else in the United States--71 cents per gallon.\n\nAll of this…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700046/legislative-calendar-days"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…to those refineries; an assessment of any State or Federal  executive actions, regulations, or policies that have caused or  contributed to  a decline in U.S. petrochemical refinery capacity; and recommendations  for how to increase refinery capacity.\n\nAmerican refineries have played a crucial role in providing secure,  affordable, and high-value petroleum…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697029/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Vince Fong", "party": "Republican", "sentence": "…policies.\n\nI know this bitter reality all too well in my home State of  California.\n\nFrom 2020 to 2022, we lost more than 1 million barrels of production  capacity per day, and refinery closures are projected to slash that  capacity by 20 percent over the next year. Twenty percent of our  refining capacity is going to disappear overnight.\n\nSince 2018, over…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697028/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…of increased energy production in Alaska cannot  be overstated. Refineries in the region, including California and  Washington, are equipped to handle Alaskan oil, and the refinery in  Kenai produces most of the State of Alaska's gasoline. The North Pole  refinery provides jet fuel for our military, amongst other aviation  fuels. Two other refineries…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696834/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…California.\n\nAll of these taxes and regulations combine to give California by far  the highest gas prices in the country already and now we have just  learned that another refinery is closing. So two refineries have  announced they are shutting down in California thanks to our insane  energy policies. This certainly is not going to help matters.\n\nIt…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690562/gas-prices-are-lower-for-everyone-except-californians"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Power Door; Duncan       Co.; Victaulic; General Equipment and Supplies, Inc.; LRL       Construction; Contour Inc.; Borealis Fuels & Logistics;       Cenovus Energy Superior Refinery; Hibbing Taconite Co.;       Snowbird Willies Boat Canvas; Hamilton Monroe; MHE       Consulting; Salem Republic Rubber; Enbridge.\n\nMr. WESTERMAN. Mr. Speaker, the letter…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699275/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Newsom and the  California Legislature's supermajority.\n\nThe most recent news is that there are two refineries that are  closing operations in California: the Phillips 66 refinery in L.A. by  the end of 2025, and the Valero refinery by April 2026.\n\nAccording to a letter from Senate Minority Leader Brian Jones in  California, these two facilities produce…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}]