[{"senator": "Alex Padilla", "party": "Democrat", "sentence": "…negotiating or saying  no to areas of disagreement, and, ultimately, passing, on a bipartisan  basis, what we refer to as the National Defense Authorization Act, the  final product reflecting the priorities of both Congress and the White  House for protecting our Nation. That is how it normally works.\n\nBut make no mistake, this year is anything but normal. What…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698259/nominations"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…gentleman for yielding and for  his exceptional leadership, recognizing that the budget should be the  statement of values of our country and how we allocate our resources  reflecting those values.\n\nI asked to speak because I hear Members on the other side talking  about spending on the part of the Democrats, spending for education,  healthcare, food,…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693157/one-big-beautiful-bill-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…as well as territory once       disputed by the State of Michigan; and\n\nWhereas, the county was named in honor of Robert Fulton,       visionary inventor of the steamboat, reflecting the       pioneering innovation and transportation legacy of the       region; and\n\nWhereas, Fulton County was one of the last counties       organized in Ohio, emerging…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693801/proclamation-for-fulton-countys-demisemiseptcentennial"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…of Haiti's ongoing instability and       humanitarian needs. The designation was most recently       extended through February 3, 2026, under a Biden-era       decision, reflecting the reality that the conditions       prompting the original designation have not meaningfully       improved. In February 2025, the Trump Administration       attempted…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699638/expert-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…the fastest growing city  in Summit County.\n\nCommunity members, elected leaders, and local businesses have all  expressed their overwhelming support for a single ZIP Code reflecting  the city's name.\n\nThe current multitude of ZIP Codes creates obstacles for these 1,200  businesses, including confusion for customers and suppliers about their  location…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693900/single-unique-zip-codes-for-certain-communities"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…impact on the Army's ability to fight and win our Nation's wars.\n\nUpon retirement, Colonel Dinh is recognized for his distinguished  service and exemplary performance of duty, reflecting the highest  tradition of the United States of America.\n\nColonel Dinh is married to Ashlie Anne Dinh, and they have two  daughters, Quintessa and Montelena.\n\nIn his civilian…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695089/congratulating-colonel-dominic-v-dinh-on-his-retirement"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…landed on the Moon. My father remembers it, and my  mother does too, somewhat, that we sent people to the Moon.\n\nMy contribution to that committee hearing, Mr. Speaker, was  reflecting on that history is so deeply important, but articulating the  moonshot of the next 50 years remains our imperative. Of course, being  the good Representative I am of the…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689752/reflecting-on-americas-history"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "…These are but a few examples of their ongoing efforts  to bring diverse voices to the table and create a space where  differences are acknowledged and celebrated.\n\nMr. Quinn, reflecting on his journey from Texas to Georgia to  Wisconsin before settling in the Delta, spoke candidly of Mississippi's  often misunderstood legacy. He rightly observed that Mississippi…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692273/recognizing-mission-mississippi-of-leflore-county-for-its-commitment-to-racial-reconciliation-and-community-unity"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "Mr. WYDEN. Mr. President, last week, the Senate passed legislation to  fund the Department of Health and Human Services and other Agencies,  including a section reflecting bipartisan, bicameral negotiations on  healthcare policies in the jurisdiction of the Finance Committee. This  bill takes important steps forward on healthcare priorities…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699474/hospital-at-home-program"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…Representative Gottheimer for sponsoring this bill. Their bipartisan  work resulted in a unanimous vote during our Committee on Financial  Services markup earlier this year, reflecting our shared concerns about  the aggressive economic and commercial activities of the Government of  the People's Republic of China.\n\nMadam Speaker, I urge my colleagues to…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694120/china-financial-threat-mitigation-act-of-2025"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…National Police Week. We remember officers  who lost their lives in service to our communities and our country, and  we thank all officers who work to keep us safe while reflecting on how  we can invest in law enforcement to better serve our communities.\n\nMr. Speaker, I rise to strongly support this resolution because we  strongly support our local…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691030/expressing-support-for-local-law-enforcement-officers"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…undocumented Irish community.       Over the years, Rian has transformed into a vibrant center       serving immigrants and refugees from over 125 countries       worldwide, and reflecting the rich diversity of the foreign-      born communities of Boston and throughout Massachusetts. In       fact, early on in our organizational history, our founder…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699703/community-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…and proud history of military  service, brave  men and women who stood up courageously to tyranny, fighting for  liberation, strengthening world peace, upholding law, and reflecting  the patriotic values that we claim to defend.\n\nThe time is now in which our true character is being tested, and my  Republican colleagues must decide if we will honor those…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699297/takeover-of-greenland"}, {"senator": "Valerie Foushee", "party": "Democrat", "sentence": "Mrs. FOUSHEE. Mr. Speaker, I thank the gentlewoman for organizing  this Special Order hour and for yielding.\n\nMr. Speaker, I rise today to join my colleagues in reflecting on the  life, legacy, and enduring moral leadership of the great Dr. Martin  Luther King, Jr., whose vision of justice and equality continues to  shape our Nation's conscience.…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699198/building-a-beloved-community"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…you to speak up?\n\nHis answer was pretty simple, and it was pretty confident. He said:  If Trump were to ignore a Supreme Court ruling, that would cross the  line.\n\nHe was reflecting a familiar theme: that until President Trump thumbs  his nose definitively at a Court ruling, then his attacks on democracy  are troubling but not lethal. It is normal politics…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690111/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…notes here of the amazing things that he  had accomplished and who he was, I realized that we are going to hear  that over the next hour.\n\nThe thing that my team and I were reflecting on earlier today, and  all I wanted to share as we kick off this memorial to an amazing man,  was that, as vice chair, I get to, every week, host an evening of floor  time…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698737/9999"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…the Government if it takes the       required steps--\n\n(A) to reorient itself toward its European Union accession       agenda; and\n\n(B) to advance policy or legislation reflecting the express       wishes of the Georgian people;\n\n(5) to emphasize the importance of contributing to       international efforts--\n\n(A) to combat Russian aggression, including…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690702/mobilizing-and-enhancing-georgias-options-for-building-accountability-resilience-and-independence-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…overwhelming volume of calls--1,194 through their direct  line and another 1,214 through work phones. Yet every call was met with  care, professionalism, and actionable solutions, reflecting the team's  deep commitment to being a lifeline for the community. The Pasco County  Human Services Team exemplifies what it means to serve with excellence,  compassion,…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691008/recognizing-kyle-smith"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…to cut our spending, we also  met the needs and met Members' requests across its many accounts.\n\nWe also reformatted. As we updated our priorities for this fiscal  year, reflecting a new administration and the majorities here in  Congress, I think that we restored balance in some of the key areas of  our bill. And the result is we have a measure that…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699014/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…rigorous academics with vibrant Catholic faith formation;\n\nWhereas, the school's mission is to ``educate children to       become scholars and form them to become saints,'' reflecting       a dedication to nurturing both intellectual excellence and       spiritual growth in every student;\n\nWhereas, Holy Family Catholic Academy is devoted to forming…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699458/recognizing-holy-family-catholic-academy"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…for his exceptional leadership skills  and unwavering commitment to collaboration. Under his guidance, his  units operate with greater strength, efficiency, and purpose,  reflecting his ability to maximize their potential and bring out the  best in those he leads.\n\nA lifelong public servant, Chief Estes is truly a pillar of our  community. He is defined…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698099/california-is-the-exact-opposite-of-a-model-of-efficiency"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…overwhelming volume of calls--1,194 through their direct  line and another 1,214 through work phones. Yet every call was met with  care, professionalism, and actionable solutions, reflecting the team's  deep commitment to being a lifeline for the community. The Pasco County  Human Services Team exemplifies what it means to serve with excellence,  compassion,…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690850/recognizing-jordan-french"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…learning outcomes of her students. Not only does she empower her  students academically, but she also plays a pivotal role in supporting  her colleagues and fellow educators, reflecting her ongoing commitment  to public service and civic responsibility.\n\nDr. Sandfort exemplifies the highest standards of educational  excellence and leadership, which led her…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "…with approximately 48,285  students and 2,696 teachers. This marks the first time since 2008 that  the Lake County School District has earned this prestigious  distinction, reflecting the district's unwavering commitment to  academic excellence, student achievement, and community support.\n\nUnder the leadership of Superintendent Diane Kornegay and the…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694185/recognizing-lake-county-schools-on-earning-an-a-rating-from-the-florida-department-of-education"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…overwhelming volume of calls-- 1,194 through their direct line and another 1,214 through work phones.  Yet every call was met with care, professionalism, and actionable  solutions, reflecting the team's deep commitment to being a lifeline  for the community. The Pasco County Human Services Team exemplifies  what it means to serve with excellence, compassion, and…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690698/recognizing-fernando-serrano"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…relatives. Eldercare challenges can be just as disruptive  and unpredictable as childcare needs, and yet they are often overlooked  in policy decisions.\n\nThis bill addresses both, reflecting the real-life responsibilities  families face. This is a smart use of policy to align incentives with  outcomes we all support: stronger families, a more resilient workforce,…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699006/empowering-employer-child-and-elder-care-solutions-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…overwhelming volume of call--1,194 through their direct line  and another 1,214 through work phones. Yet every call was met with  care, professionalism, and actionable solutions, reflecting the team's  deep commitment to being a lifeline for the community. The Pasco County  Human Services Team exemplifies what it means to serve with excellence,  compassion,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690238/recognizing-danielle-bierman"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…overwhelming volume of calls-- 1,194 through their direct line and another 1,214 through work phones.  Yet every call was met with care, professionalism, and actionable  solutions, reflecting the team's deep commitment to being a lifeline  for the community. The Pasco County Human Services Team exemplifies  what it means to serve with excellence, compassion, and…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691971/recognizing-rebecca-seils"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…Administration from Harvard University. His       arousing, even disturbing novel, The Memory Monster (New       York: Restless Books, 2020), raises profound questions       reflecting the searing struggle of Israelis to come to grips       with the Holocaust's enormous impact on their identity and       very lives, with the Shoah's long shadow as constant…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688281/international-holocaust-remembrance-day"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…recognize Minot, North  Dakota, my husband's hometown, named one of the 2025 Great American  Defense Communities.\n\nOnly three cities across the Nation received this honor, reflecting  the remarkable commitment the people of Minot have shown to the men and  women stationed at the Minot Air Force Base.\n\nThrough events like the Prairie Warrior Auction and…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690742/minot-north-dakota-named-a-2025-great-american-defense-community"}]