[{"senator": "Gwen Moore", "party": "Democrat", "sentence": "…Special Order.\n\nAs we get ready for Thanksgiving, families across our Nation are  coming together. It's a time to celebrate and express gratitude for  family. It's a time of reflection too.\n\nBut as Americans gather, they are also worried about the family  budget too. That Thanksgiving meal is going to be more expensive this  year. For millions of families,…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696975/stories-from-home-the-human-cost-of-expiring-healthcare-tax-credits"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…question: Why? Why would  House Republicans choose this course, again, given all of the  challenges that I know that their constituents face, as mine do?\n\nUnfortunately, it is a reflection of the core values of just too many  of my colleagues on the other side of the aisle, who invariably,  incessantly, and inherently have a predisposition to favor the  ultrarich…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699903/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…short time. We know we are still  writing America's story. We know that we don't engage in politics on  the House floor such as campaigning.\n\nI would like to make an ethical reflection about our politics which  is that at some point an election is had. An election is had. An  election happens, and we have to govern. We are governing. We have to  govern.…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689752/reflecting-on-americas-history"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…vaccines. The result, no  surprise, was the largest measles outbreak we have seen in decades, one  that tragically took the lives of two children.\n\nDid that spark one iota of reflection from R.F.K., Jr.? Of course  not. The largest measles outbreak since 1992, and do you know how  R.F.K., Jr., described the response this week? Effective.\n\nEffective? Are…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694964/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…NDAA. It is an  essential piece of legislation that underscores our commitment to  ensuring that we uphold the safety and security of the American people.\n\nThe 2026 NDAA is a reflection of many of our priorities. When we talk  about about priorities, especially in eastern North Carolina, I visited  our child development center, and part of the funds we see…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697790/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…particularly relevant  250 years from now, and I suppose we should not write in cursive  because people won't know what that means. But this is really  important.\n\nI think it is a reflection of the amazing American experiment, and I  look forward to the bill being signed. I hope and I pray that 250 years  from now we will have moved toward, in the words of Jefferson,…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699839/semiquincentennial-congressional-time-capsule-act"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…I am honored to uplift today's remarkable milestone. Back  home in my district, constituents will gather this evening at the  Douglas County Museum of History & Art for a reflection on the history  of the city and a celebration of the progress they hope to make in the  future.\n\nI want to commend Mayor Rochelle Robinson, the Douglasville City  Council,…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688019/recognizing-the-city-of-douglasville-georgia-on-its-sesquicentennial-birthday"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…office, as  all of this has been going on, I thought a lot about my own faith and  how to help the American people who are so worried about what is going  on.\n\nI did some reflection on the faith community in which I was baptized  and still belong. Next Sunday, for us, is the most profound holy day.  We commemorate Easter, and it holds profound meaning.…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690052/trump-tariffs"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…threat that our Jewish constituents and Americans are facing. I am  proud to co-lead the resolution with the gentleman, and I think his  interaction with our office is a reflection of how things ought to work  in this Chamber.\n\nMr. Speaker, I thank the gentleman from New Jersey and the gentleman  from New York for their leadership.\n\nMr. VAN DREW.\n\nMr.…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692173/condemning-the-rise-in-ideologically-motivated-attacks-on-jewish-individuals-in-the-united-states-including-the-recent-violent-assault-in-boulder-colorado-and-reaffirming-the-house-of-representatives-commitment-to-combating-antisemitism-and-politically-motivated-violence"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…look like, driven by public-private collaboration  and a clear focus on inclusive growth.\n\nMilford's motto: Art Town, River Town, Home Town, is more than a  slogan. It is a reflection of a community that is rooted in creativity  and care for one another.\n\nI am proud to represent Milford in Congress, and I will keep fighting  for the investments, partnerships,…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692377/recognizing-milford-delaware"}, {"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…rangers. It is an  attack on democracy itself, and the timing could not be more ironic.\n\nAs we approach America's 250th birthday, our national parks should be  a place of reflection, learning, and honest celebration. Instead, we  are fighting simply to ensure that these public lands continue to  represent the full dimension of the American experience.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699714/rewriting-history"}, {"senator": "André Carson", "party": "Democrat", "sentence": "…the Trump administration average 30,000 a month--and yet, less  than 5 percent of those individuals have been convicted of a crime.\n\nThis sober anniversary is a moment of reflection, especially for  those of us who were working at the Capitol that day. It is also a day  of resolve and rededication--to make sure nothing like this happens  again. We must…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698532/recognizing-the-5th-anniversary-of-january-2021"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…to  pursue peace and justice, religious tolerance and coexistence, and  environmental stewardship in all we do.\n\nHis historic visit serves as a profound moment of unity, reflection,  and joy for Greek Orthodox New Jerseyans and Americans of all faiths  across the country. We deeply respect and appreciate his decades of  moral leadership and unwavering…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695894/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…into the window of life. You are looking into someone else's backyard  in another country. When you address racism, you are looking into the  mirror of life and see the reflection of your own deeds. These are the  deeds that we don't want to confront. These are the deeds that cause  people of color to be able to sometimes get loans that are equal to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694943/bloody-sunday-and-voting-rights-act"}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "…today in opposition to this amendment that would  prohibit the Department of Defense from collecting data on gender  identity.\n\nData is not just numbers. Data is a story and reflection of those  lived realities of real people, and this amendment is to stop data  collection. It is clear that it is an attempt to erase the existence of  transgender servicemembers…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695230/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "Mr. McCLINTOCK. Mr. Speaker, in every election, somebody wins and  somebody loses. Democracy depends on the losing side trusting that the  election was a fair and accurate reflection of the will of the  majority, and the winning side depends on the same perception for the  legitimacy of their office.\n\nFor centuries, our elections were the gold standard…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690012/safeguard-american-voter-eligibility-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…built their lives here, of leaders who shaped the city's  path, and of a community that has remained true to its values across  generations. Let this occasion be a time of reflection and renewed  purpose. The City of Port Richey stands as a testament to what can be  accomplished through community spirit, hard work, and enduring hope.\n\nAgain, I am proud…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691599/recognizing-100th-anniversary-of-the-city-of-port-richey-fl"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "…gentlemen--we, Mr. President--are the representatives of those self- governed people. And in many respects, what we are going through this  weekend is in large part a direct reflection of the division of our  country--for sure, for sure. But I submit that we have a higher  responsibility than to simply gravitate to the worst instincts but,  rather, elevate…", "date": "2025-08-02", "source_url": "https://justfacts.votesmart.org/public-statement/1694711/9999"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…Virginia. Mr. Speaker, I include in the Record  remarks submitted at the request of a Virginia Beach constituent, Rabbi  Dr. Israel Zoberman of Temple Lev Tikvah, and are a reflection of his  views:\n\nIsrael At 77--How poignant to affirm the special       relationship between the U.S. and Israel, two close       democratic allies, in our own Hampton Roads…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690665/israel-at-77"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Award for  Distinguished Reporting on Congress from the Radio and Television  Correspondents' Association and has been referred to as the most  connected man in Washington, a reflection of his professionalism and  integrity.\n\nToday, we congratulate Jamie Dupree on 45 years of outstanding  reporting and service to the American people.", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693004/fletc-celebrates-55-year-anniversary"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "…motorcycle access, create a resident-focused fee structure, and  otherwise improve the experience for Americans.\n\nThe STARS Act highlights Constitution Day to encourage reflection on  America's founding principles. Get out and enjoy this Nation's natural  resources, learn something new, or just celebrate with loved ones in  one of our parks.\n\nFree…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697764/semiquincentennial-tourism-and-access-to-recreation-sites-act"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…Virginia. Mr. Speaker, I include in the Record  remarks submitted at the request of a Virginia Beach constituent, Rabbi  Dr. Israel Zoberman of Temple Lev Tikvah, and are a reflection of his  views:                       The Jewish High Holy Days 5786\n\nThe Jewish High Holy Days of Rosh Hashanah and Yom Kippur,       an ancient people's peak spiritual drama…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697168/the-triumph-of-life"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…Virginia. Mr. Speaker, I include in the Record  remarks submitted at the request of a Virginia Beach constituent, Rabbi  Dr. Israel Zoberman of Temple Lev Tikvah, and are a reflection of his  views:\n\nI found refuge every morning hiding\n\nUnder my grandpa's inviting, embracing Tallit\n\nOf black and white woven of the tapestry\n\nOf a survivor's spared life,…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699495/recognizing-remarks-of-rabbi-dr-israel-zoberman"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…childhood literacy initiatives, such as Dolly Parton's Imagination  Library. These programs create pathways to brighter, more stable  futures.\n\nThis anniversary is not just a reflection on the past but a  celebration of what is to come.\n\nAs part of this milestone, ACCAP is launching a monthlong  celebration, including the placement of donation boxes throughout…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689395/recognition-of-accaps-60th-anniversary"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…College was  founded in Jacksonville, Florida, 50 years ago.\n\nMr. Speaker, I rise today to celebrate Trinity Baptist College's 50th  anniversary, a milestone that invites reflection on a half-century  commitment to higher education from a God-centered worldview.\n\nMr. Speaker, TBC believes that ministry is not confined to the pulpit  or the classroom…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689692/recognizing-50th-anniversary-of-trinity-baptist-college"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…Republic.\n\nBenjamin Franklin lived his life with a deliberate sense of purpose,  beginning each day by asking: What good shall I do on this day? And  ending every evening in reflection: What good have I done today?\n\nMadam Speaker, that is not just a measure of a life well lived. It is  the measure of leadership, of duty, and of a nation that strives always…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688220/procurement-and-placement-of-statue-of-benjamin-franklin-in-the-united-states-capitol"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…and still keep in contact with each other, remembering what happens  when out-of-control anger took the lives of 168 people.\n\nOn that sacred ground, there is still a quiet reflection pool. There  are 168 chairs there to remind people of the 168 lives. There is a  phenomenal museum that is next to it that people come to literally from  all over the world…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690112/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…by finding new roles in government, transitioning  successfully to the private sector, or enrolling in college to further  their education. These achievements are a true reflection of Mac's  leadership--underscoring not only the strength of the program, but also  the lasting opportunities it provided to so many.\n\nI would also like to recognize and thank…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695496/thanking-john-mcintyre-mac-tolar-for-his-dedicated-service-to-our-nation"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…and I thank them for  their support for this commonsense bill.\n\nMr. Speaker, the Pennsylvania Farm Show has grown exponentially since  it began over 100 years ago, a direct reflection of how our country's  ag industry has grown. It was an honor to attend the Farm Show this  year, and I thank all of those who worked tirelessly to make this  incredible event…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699123/pennsylvania-farm-show-recap"}, {"senator": "Dan Newhouse", "party": "Republican", "sentence": "…whether Republicans are  better than Democrats or vice versa. This is about how we conduct  ourselves on the House floor. This is about how we treat each other.  This is a reflection on every single one of us in this Chamber. As my  colleague from the State of Washington said, it is not just us this  affects. This affects the kids of our country, as well,…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688496/raising-a-question-of-the-privileges-of-the-house"}]