[{"senator": "Jim Costa", "party": "Democrat", "sentence": "…before then. We had interactions on a  number of issues that we were mutually passionate about beginning with  rural California and people who live in rural areas, which both  reflected his and my background.\n\nHe, perhaps, represented if not the, one of the largest congressional  districts by geography in California, a lot of northern and eastern  California.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698716/9999"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…DC home, just as they do for your       constituents across the country.\n\nI specifically want to call attention to the significant       incursion on local self-governance reflected in two bills,       the District of Columbia Attorney General Appointment Reform       Act and the District of Columbia Judicial Nominations Reform       Act. Both laws would…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696933/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…updates,  including clearer access terms and more flexible mechanisms for  engagement with Pacific Island countries. But nearly a decade later,  these improvements are still not reflected in U.S. law.\n\nThis legal disconnect has left the American fleet, including vessels  operating out of Hawaii, in a state of regulatory limbo. Operators are  forced to navigate…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691007/south-pacific-tuna-treaty-act-of-2025"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…teacher. In his  dual-language classrooms, he cultivated environments where children of  all backgrounds could learn together, honor one another's cultures, and  see themselves reflected in their education. Through his teaching,  Henry inspired countless young people to embrace their identities and  take pride in their heritage.\n\nIt is with great pride and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695845/recognizing-henry-padron-morales"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…and Arnold Brown, the church  grew in both membership and outreach. Expanding facilities,  establishing new ministries, and adopting the name Bethel Temple  Assembly of God reflected its evolving mission and growing  congregation.\n\nIn the decades that followed, Reverends Ron Johnson and Glenn  Reynolds deepened the church's community engagement through…", "date": "2025-10-24", "source_url": "https://justfacts.votesmart.org/public-statement/1696401/recognizing-the-70th-anniversary-of-bethel-temple-church-in-hampton-virginia"}, {"senator": "Zoe Lofgren", "party": "Democrat", "sentence": "…fundamentals. What I do not accept is a repeat of the 2022  process, in which one corner out of six effectively dictated the  process and rammed through a bill that narrowly reflected only their  priorities and completely omitted Science Committee priorities, among  others.\n\nThat is why I am encouraging all of my colleagues, in the House and  the Senate,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695449/extension-of-sbir-and-sttr-authority"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…that this Nation had never seen.\n\nYes, Mr. Speaker, it was money, the taxpayer money out of the  Troubled Asset Relief Program. GM, General Motors, left the stock  market.\n\nI reflected on the 15-year anniversary of this auto rescue last year  in this Chamber during another one of these addresses.\n\nMr. Speaker, it was really quite remarkable because GM left…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689752/reflecting-on-americas-history"}, {"senator": "Veronica Escobar", "party": "Democrat", "sentence": "…the alarm about the crisis that our country is  in. It is not just an economic crisis, as we see our country sinking  very quickly into an economic crisis, which is being reflected in  Donald Trump's poll numbers. In fact, his sinking poll numbers are even  being reflected in the issue that many consider to be his strong suit  with the American people,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690507/trump-immigration-policies"}, {"senator": "Lizzie Fletcher", "party": "Democrat", "sentence": "…led our office in efforts to ensure that our  team is ready and able to do all it can for constituents in every  possible circumstance, that our community's priorities are reflected in  our work, and that our work delivers meaningful progress for people at  home and across the country.\n\nSarah has been a partner and friend who has demonstrated her  dedication…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695833/recognizing-sarah-kaplan-feinmann"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…hours became so  despondent and excited and emotional, he harmed himself and took his  own life. The parents couldn't understand it. They didn't see it  coming. And when they reflected on what was being done, it was an  outrage.\n\nThere is another thing going on which everyone should be aware of,  and if you look closely on television, you might just spot…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698999/disrupt-explicit-forged-images-and-non-consensual-edits-act-of-2025"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…a box to check, it was  the foundation of our democracy itself. He fought to break down  barriers, to build pipelines of opportunity, and to ensure that  government truly reflected the people it served.", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688667/saying-good-bye-to-a-giant"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…DC home, just as they do for your       constituents across the country.\n\nI specifically want to call attention to the significant       incursion on local self-governance reflected in two bills,       the District of Columbia Attorney General Appointment Reform       Act and the District of Columbia Judicial Nominations Reform       Act. Both laws would…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695559/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…the foundation for world class transportation facilities built  for the 21st Century.\n\nMore than the projects completed or milestones reached, Mr. Rick  Cotton's legacy is reflected in the people he supported, the teams he  strengthened, and the standard of professionalism he brought to work.  His tenure will be remembered for its scale, its vision,…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699560/recognizing-rick-cotton-for-a-lifetime-of-leadership"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…DC home, just as they do for your       constituents across the country.\n\nI specifically want to call attention to the significant       incursion on local self-governance reflected in two bills,       the District of Columbia Attorney General Appointment Reform       Act and the District of Columbia Judicial Nominations Reform       Act. Both laws would…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695596/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…decades, they  have answered tens of thousands of calls, while participating in  several town parades, health fairs, and local school events. The strong  community connection is reflected in the generations of families that  have joined the Deal First Aid Squad. Notably, they have served in key  mutual aid roles and frequent interagency cooperation across…", "date": "2025-08-05", "source_url": "https://justfacts.votesmart.org/public-statement/1694713/recognizing-the-75th-anniversary-of-the-deal-first-aid-squad"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…fundraisers, Mr. Sarrault volunteers his time  at Bishop Baraga School, teaching students about patriotism and proper  flag etiquette. His community commitment is further reflected in his  charitable efforts, including distributing toys at Christmas and making  pasties to support his local VVA chapter.\n\nMr. Speaker, let us all join in recognizing Roger…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692726/thanking-roger-sarrault-for-his-service-with-the-us-army-as-a-member-of-the-dustoff-crews-during-the-vietnam-war"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…Pennsylvania. Mr. Speaker, I rise today to address the  issue of rising healthcare costs. As no surprise, data released from  the final full year of the Biden administration reflected that  healthcare spending has grown at an unsustainable pace, far outpacing  inflation.\n\nSince the passage of the Affordable Care Act, healthcare costs across  all markets…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699211/streamlining-review-process-for-federal-projects"}, {"senator": "Mike Crapo", "party": "Republican", "sentence": "…prices, which continue to decline even as other prices  grow.\n\nRather than broadcast and validate a list price, Congress should  ensure that patients can share in the savings reflected in the net  pricing points, enabling both increased transparency and reduced out- of-pocket costs at the pharmacy counter.\n\nWhat I am saying is that this is complex, and…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694206/military-construction-veterans-affairs-and-related-agencies"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…Veterans Benefits Administration Pension and  Fiduciary Service.\n\nThis decision to hide the Office of Survivors Assistance near the  bottom of the VA organizational chart reflected the Biden-Harris  administration's lack of commitment to the surviving loved ones of our  veterans.\n\nDuring the Biden-Harris administration, the Office of Survivors  Assistance…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689687/prioritizing-veterans-survivors-act"}, {"senator": "Dan Newhouse", "party": "Republican", "sentence": "…lab as a world leader in  science, national security, and energy research and development.\n\nDr. Ashby believes our biggest challenges cannot be solved alone, and  his tenure reflected that belief. Having spent over a decade working to  expand the lab's reach with new partnerships and opportunities, he  transformed PNNL from a research lab to a world-class…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696092/congratulating-dr-steven-ashby-on-his-retirement"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…and community members to mark this  anniversary with song, dance, and fellowship. The day was filled with  vibrant drumming, traditional ceremonies, and shared meals that  reflected the enduring spirit of the Tribe.\n\nAs the American flag and the Spokane Tribe flag flew side by side,  this celebration stood as a powerful symbol of unity, resilience, and…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699649/recognizing-1984-walla-walla-high-school-girls-basketball-team"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "…fact that he lived with one eye on  Heaven gives me great comfort knowing that he is now there--that he is  now there--and that his 94 years walking on this Earth, his walk  reflected his view of Heaven and the certainty of his destination.\n\nSo with that, I just say thank you Pastor Bjorge for making me  better.  Thank you for your ministry. Thank you…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696152/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…want him, his family, and all who know him to  understood his impact. He roamed the Halls of Congress, indifferent to  politics, to make sure the  voiceless were heard and reflected in our policymaking.\n\nMr. Speaker, I thank Grant for his work, which has inspired so many,  including myself.\n\nGod bless.", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688646/recognizing-grant-smith"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…and not  policies from the past. That is how we move from promises to action and  carry out the America-first agenda mandated by the people.\n\nMr. Chair, those priorities are reflected throughout the measure  before us. Through the Financial Services-General Government portion of  the bill, Financial Services and General Government Subcommittee  Chairman…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699054/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…be basic and essential community infrastructure. To  say these operations have had a positive impact on the local  communities is a gross understatement, an ideal that is reflected in  the testimony of Mr. Lampe.\n\nThis Congress has already taken decisive steps to reassert its  authority over the Coastal Plain. In the ``Working Families Tax Cut  Act,''…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697739/9999"}, {"senator": "Ashley Moody", "party": "Republican", "sentence": "…daughters recall that throughout their childhood, their father rose  every single morning at 4 a.m. to study the Bible and pray, an enduring  memory that shaped their lives and reflected the quiet strength of his  character.\n\nThat faith extended far beyond his home. Mr. Brewton was a founder of  the Brownsville Assembly of God in Pensacola, a church that…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700061/9999"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…have often asked myself: Would I have seen and known what was  around the bend, what was happening next?\n\nWell, to know the future, you need to know the past, and I have  reflected a lot, recently, on the words spoken by President Lincoln in  commemorating the sacrifice of those who served at Gettysburg. He said  that it was an active question, that…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699917/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "James Risch", "party": "Republican", "sentence": "…defend itself, its people, and       U.S. citizens living, working, and traveling in Israel.\n\n(U) The United States' commitment to Israel's security is       ironclad, which is reflected in decades of close political-      military dialogues and highlevel defense policy exchanges.       The historic ten-year U.S.-Israel Memorandum of Understanding       to…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688394/arms-sales-notification"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…Management Plan\n\nIn 2015 BLM issued a Record of Decision (ROD) for six       approved resource management plan amendments (2015 ROD).       According to BLM, the 2015 ROD reflected a broad and       unprecedented effort to address declining ecosystems in the       region and concerns about a potentially endangered species.       The 2015 ROD included…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695880/government-accountability-office-opinion-letter"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…including, and most importantly, the 56 colonists who signed  the Declaration of Independence. These men--if it were happening today,  there would be women in that group. These men reflected profiles in  courage, pledging their lives, their fortunes, and their sacred honor  on a piece of parchment paper. As benefactors of their bold commitment  to freedom, we…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698577/250th-anniversary-of-the-declaration-of-independence"}]