[{"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…children aren't being trafficked. It makes sure  these children aren't stuck in cages in Border Patrol facilities for  extended periods of time. This office also supports refugees who are  victims of torture and human trafficking and who have been admitted to  the United States by this administration, by the Trump administration.\n\nLastly, I will note…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699443/consolidated-appropriations-act-2026"}, {"senator": "Norma Torres", "party": "Democrat", "sentence": "…President of the Association of Hue Students, eager to connect with  others from his hometown. Additionally, he volunteered with the  Vietnamese Red Cross, leading him to assist refugees in the ongoing war  after becoming an accredited doctor.\n\nOn April 29, 1975, shortly after graduating from medical school, Dr.  Vo fled by Navy Ship to escape communist rule,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691324/recognizing-dr-huu-vo"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…attorney,  advocate, and administrator, Sue has devoted her life to advancing  justice for people who are too often overlooked: survivors of violence,  impoverished families, refugees, and those experiencing homelessness.\n\nIt has been an inspiration to watch Sue lead the Delaware Coalition  Against Domestic Violence. Her integrity, compassion, and quiet…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697421/delaware-day"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…a plushy toy.\n\nTrump is also trying to mass cancel protected status for people who  came here who were fleeing harsh conditions and dictators. Trump is  sending Christian refugees and women back to live under the Taliban  where they will face near-certain persecution.\n\nTrump is sending ICE officials to elementary schools where they tried  to gain access…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690540/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Derek Tran", "party": "Democrat", "sentence": "…their lives  for freedom, including members of the South Vietnamese military who  fought alongside American allied forces. We also honor the immense  hardships endured by the refugees as they embarked on the perilous  journey to seek refuge and rebuild their lives.\n\nI am so proud to be the first Vietnamese American to represent Orange  County's Little Saigon…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689425/reaffirm-commitment-to-freedom-during-black-april"}, {"senator": "Derek Tran", "party": "Democrat", "sentence": "…just something that  appears, it doesn't happen by accident, and it isn't maintained by  sheer inertia. We have to fight each and every day to maintain it.\n\nI am the child of refugees. My parents came to this country from  Communist Vietnam in search of the very freedoms that had been ripped  away from them in the country of their birth. I joined the Army…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689123/a-republic-if-we-can-keep-it"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…was looking around, and I realized  that times change and they don't.\n\nCatholic Relief Services, which is one of the largest agencies in the  United States that help settle refugees, who are legal immigrants-- refugees are legal immigrants--about 15 years ago settled a Congolese  family into my church who had been in a refugee camp after fleeing  violence…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693592/rescissions-act-of-2025"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…curb the free       flow of fighters and arms to conflicts raging in the       neighboring Sahel region and Sudan while also easing the       large-scale migration of African refugees to Europe.\n\n``We would like to have the involvement of United States.       And, especially with this government, they are always looking       for deals, there are a lot…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697384/recognizing-the-importance-of-libyas-return-to-stability"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…process.\n\nDays ago, we learned they deported a 4-year-old child with stage IV  cancer and a 2-year-old American citizen.\n\nWe know that they are now going after Southeast Asian refugees from  Vietnam, Laos, and Cambodia. They came here due to the U.S. depending  on them as allies during the Vietnam war.\n\nThis was the case with Chanthon Bun, who fled to the…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690502/trump-immigration-policies"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…of volunteer       attorneys, to serve Boston's undocumented Irish community.       Over the years, Rian has transformed into a vibrant center       serving immigrants and refugees from over 125 countries       worldwide, and reflecting the rich diversity of the foreign-      born communities of Boston and throughout Massachusetts. In       fact, early…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699703/community-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Derek Tran", "party": "Democrat", "sentence": "…choice by Israeli leadership to engage in military actions at aid  sites endangers all innocent Palestinians and Israelis who deserve to  live with dignity.\n\nI am the child of refugees. My parents were forced to flee because  they feared for their own lives in their home country.\n\nThe United States must ensure that the Palestinian people can live  their…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694015/humanitarian-crisis-in-gaza"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…requirement they imposed later.\n\nThat is what this bill is really doing. It targets small business  owners who are here legally, people like DACA recipients, visa holders,  and refugees; people who are building businesses, creating jobs, and  following every rule.\n\nRepublicans also claim this bill is about accountability, when in  reality it creates a mess…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692125/american-entrepreneurs-first-act-of-2025"}, {"senator": "Derek Tran", "party": "Democrat", "sentence": "…30, 1975, that South Vietnam fell to  the Communist regime. American troops airlifted 6,000 American and  Vietnamese people to safety. Hundreds of thousands of Vietnamese  refugees would follow, most of them boarding boats on uncharted waters,  not knowing what awaited them on the other side of the journey.\n\nIn Vietnam, the conditions under the Communist…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690347/recognizing-black-april"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…remember them. They can send money through Western  Union to the people of Ukraine and to help those who are living in  Poland in order to help them meet the costs of having the refugees who  come from Ukraine into Poland. There is so much Americans can do.\n\nPeople in my district raised money to send a shower, for them to buy  a shower so they could put it…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690215/supporting-ukraines-independence"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…is not in session, with changes that--\n\n(1) are within the jurisdiction of such committee; and\n\n(2) would strike any rescissions to programs that support       Palestinian refugees within the Migration and Refugee       Assistance account.\n\n3. A motion to recommit the bill H.R. 4 to the Committee on       Appropriations of the Senate with instructions…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693615/hr-4"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…for the XUAR for the purposes of monitoring       human rights violations and abuses in the XUAR, and for       making reports available to the High Commissioner for       Refugees, the High Commissioner for Human Rights, the Human       Rights       Commission, the General Assembly, and other United Nations       bodies.\n\nI rise today in strong support…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694799/uyghur-policy-act-of-2025"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…student radicals in 1968: ``It is forbidden to forbid.''\n\nThat is what the phrase ``suicidal empathy'' is meant to describe. We  open our borders and import millions of unvetted refugees because we  can't bear to turn a single asylum seeker away. We empty out our  prisons because we just can't stomach the thought of keeping anyone  behind bars.\n\nWe let violent…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699689/immigration"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…of humanitarian aid and philanthropy,  as well. He has shipped over 140 containers of humanitarian assistance  over the last 12 years to support east Tennessee families and refugees  at home and abroad.\n\nJohnny Wayne Farris is not only a great businessman; he is in my  fraternity, Sigma Chi. He is also even a better member of his  community, helping anyone…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698413/recognizing-johnny-wayne-farris"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…Venezuelans. The interim authorities in charge in Venezuela  today know what we expect of them: Stop the drug trafficking and the  weapons trafficking. Accept the return of their refugees and migrants.  Release political prisoners. Expel the Iranians, the Cubans, the  Islamic terrorists, like Hezbollah operatives, who have turned  Venezuela into a launching…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698556/venezuela"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…cloth, never abandoned nor lost,\n\nHe managed to safeguard on the run\n\nTwice from Poland, in Siberian exile and Kazakhstan,\n\nStained by flowing tears,\n\nThe beauty marks of refugees,\n\nAn added layer of essential warmth\n\nWhich sustained a ravaged body and tested soul,\n\nWrapping me, his other saved possession,\n\nIn a magical garb whose sacred fringes I playfully…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699495/recognizing-remarks-of-rabbi-dr-israel-zoberman"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…complaining about Lebanon's human rights atrocities?\n\nThe Democrats were silent when the Lebanese military shot protesters,  silent when they forcibly repatriated Syrian refugees, and silent when  the Lebanese military failed to prevent Hezbollah from indiscriminately  targeting our ally Israel. Yet, they tell us to turn a blind eye and  let the Lebanese…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693678/department-of-defense-appropriations-act-2026"}, {"senator": "Shelley Capito", "party": "Republican", "sentence": "…security of unaccompanied children. Thus, this funding  will help to reimburse States, like Texas and Florida, for the cost of  statutorily required assistance to certain legal refugees and to  support victims of trafficking and victims of torture.\n\nI urge my colleagues to vote against this amendment.", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699430/consolidated-appropriations-act-2026"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…pulled fellow  sailors to safety, and helped rescue Norwegian women and children who  were fleeing the war. Despite the loss of 28 crewmembers, every one of  the 19 Norwegian refugees survived, making this a powerful testament to  the courage and selflessness of Dick Burbine and his shipmates.\n\nHis service did not end with World War II. Dick continued to…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699151/misguided-policy-in-california"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…exacerbate the already  precarious humanitarian crisis in Venezuela and lead to mass migration  into neighboring countries already struggling under the strain of  millions of refugees. And rest assured, many of those who flee the  disaster of the war that will come will make their way to the United  States.\n\nMost consequentially, any military operation…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696562/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…made to embrace life fully if they ever got home.\n\nHowever, Allen's service didn't stop there. In 1980, he made a  daring, unauthorized voyage to Communist Cuba to rescue refugees during  the Mariel boatlift, an act of moral courage that risked his freedom  once again.\n\nIn later years, Allen became a speaker, mentor, and educator. He  published a book…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691271/congratulating-northwest-florida-state-womens-basketball-team"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…Did  Congress claw back the money from Minnesota? No. Congress simply  decided to give another $5 billion in refugee welfare.\n\nMy amendment says: Stop. No more welfare for refugees until there is  a nationwide investigation of the level of this fraud. No more welfare  for refugees until Congress balances the budget.\n\nAmerica can't be the world's sugar…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699441/consolidated-appropriations-act-2026"}]