[{"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…American identity.\n\nI rise today to urge my colleagues to vote ``no'' on S.J. Res. 80 and  H.J. Res. 131, two proposals that would forever alter the Coastal Plain  of the Arctic refuge and the special areas of the western Arctic in the  great State of Alaska.\n\nLet me tell you a little bit about this special place, a place in  which I have had the privilege…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696905/defending-the-arctic-refuge"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…themselves, their  families, their loved ones, and treasured members of their community.\n\nAmerica does not live in fear. That isn't why our country was  founded. We have been a refuge for our entire history, and we need to  continue to be a refuge for those seeking a better life. Who will speak  up for these people while they are painted as worthless or…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690052/trump-tariffs"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…repairing the damage from years of       neglect, and I've asked the Congress for almost $160 million       to resume buying lands to round out our national park and       refuge systems. We also took the lead in developing a new       approach to protecting some 700 miles of undeveloped       coastal areas--the dunes, beaches, and barrier islands…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691582/hj-res-88"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…HEINRICH. Mr. President, nestled in the far northeast corner of  Alaska is one of the wildest and most untouched places left in North  America: The Arctic National Wildlife Refuge.\n\nI have been blessed to see this refuge with my own eyes. I have seen  its towering peaks; I have seen the critical habitat on the Coastal  Plain where caribou drop their…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697413/9999"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…made to protect lands that Tribal Nations have occupied  since time immemorial.\n\nThis misguided bill would lock in oil and gas development in the  Arctic National Wildlife Refuge, an area known to the Gwich'in people  as the sacred place where life begins. The Coastal Plain is the heart  of the Porcupine caribou's calving grounds. It hosts nearly 200…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696832/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…law of the land.\n\nToday, I rise in opposition to all the CRAs, but in particular, I  want to talk about one very special place.\n\nIn 2017, when the Arctic National Wildlife Refuge's Coastal Plain was  first officially opened to drilling, supporters promised that the sale  would raise significant revenue. Instead, only three bidders emerged.  The first…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696880/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…have been  considering here today are going to strip local land managers of the  ability to respond to future challenges, changes,  and needs in the Arctic National Wildlife Refuge, the NPR-A, and the  Powder River Basin. If these reckless resolutions pass, these places  will be locked into outdated plans that fail to account for changes in  community…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696836/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…communities is both mean-spirited and illogical. What kind of       a nation are we? My father would be ashamed of this country       where some of his relatives found refuge before and after the       Holocaust. What kind of a nation are we if we do not to allow       those seeking safety or a better life to live among us and do       the work…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699703/community-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…down a grant that would help some of those       families with       child care. The irony is staggering. This is all while       also creating a renewable, energy-powered refuge that will       protect our most vulnerable residents during extreme       weather events like wildfires and winter storms. When the       lights go out and the community needs…", "date": "2025-07-09", "source_url": "https://justfacts.votesmart.org/public-statement/1693322/greenhouse-gas-reduction-fund"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…(FWS). These specialized teams play an essential role in  managing emerging invasive species, employing strategies tailored to  local conditions across the National Wildlife Refuge System. With 21  teams strategically positioned in various FWS regions, they are on the  front lines, addressing the unique challenges posed by invasive  species.\n\nThe Invasive…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693136/introduction-of-the-invasive-species-response-act"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…Mother Cabrini became a naturalized citizen of the United  States. She believed in the promise of this Nation--not as an abstract  ideal, but as a place where those seeking refuge and opportunity could  find dignity, community, and purpose. At a time when her own community,  the Italian community, was under attack, she chose to claim her place  in this…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692932/holding-power-accountable"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…are rolling in record profits and even though we  are already producing and exporting record amounts of oil and gas. Of  course, their old favorite is to open up the Arctic Refuge for drilling  and pretend that that will bring in money, as well. Last time, it  brought in zero dollars when they did that in 2017.\n\nMr. Chairman, I am going to vote ``no.''…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688067/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Laura Gillen", "party": "Democrat", "sentence": "…hate-filled gunman murdered two young employees of the  Israeli Embassy, Yaron and Sarah. May their memories be a blessing.\n\nWe must send the strongest message to those who seek refuge in our  country, only to come here and commit crimes and harm innocent people.  They should know that their actions will not be tolerated, and they  will have no home here.…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691979/condemning-the-boulder-colorado-anti-semitic-attack"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…City will always be a sanctuary to the oppressed  and the powerless, as will other communities like ours across this  Nation. Our doors will always be open to those seeking refuge and  safety.\n\nNo matter how deeply they try to dehumanize immigrant Americans, the  people of this country know full well where the inhumanity lies. The  President and his…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697453/fighting-dhs-immigration-raids"}, {"senator": "Derek Tran", "party": "Democrat", "sentence": "…Vietnamese military who  fought alongside American allied forces. We also honor the immense  hardships endured by the refugees as they embarked on the perilous  journey to seek refuge and rebuild their lives.\n\nI am so proud to be the first Vietnamese American to represent Orange  County's Little Saigon community in Congress. Home to the largest  Vietnamese…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689425/reaffirm-commitment-to-freedom-during-black-april"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…selfdetermination,       and protect the long-term interests of our Inupiat       shareholders. Kaktovik is the only community located within       the Arctic National Wildlife Refuge (ANWR), and KIC holds       significant ANCSA lands within the Coastal Plain lands that       Congress specifically conveyed to our people so that local       Inupiat not distant…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697510/sj-res-91-and-hj-res-131"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…reject the Biden administration's unlawful attempt to stifle Alaska's  congressionally mandated oil and gas leasing program in the Coastal  Plain of the Arctic National Wildlife Refuge, ANWR. I urge my  colleagues to support the Alaska congressional delegation's joint  resolution of disapproval, H.J. Res. 131 and S.J. Res. 91, to reject  unlawful regulatory…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697739/9999"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…I thank Chairman Westerman, my good friend  and classmate, for his services here.\n\nMr. Speaker, I rise today in support of S. 1596 to rename the Anahuac  National Wildlife Refuge located in the State of Texas and in my  district as the Jocelyn Nungaray National Wildlife Refuge to forever  commemorate the life of 12-year-old Jocelyn Nungaray, who was…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693448/jocelyn-nungaray-national-wildlife-refuge-act"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…which has  produced over 13 billion barrels of oil since production began in 1977.  On either side of Prudhoe Bay are two Federal areas, one being the  Arctic National Wildlife Refuge and the other being the National  Petroleum Reserve in Alaska, the subject of today's legislation. The  U.S. Geological Survey this year reported that half of the estimated…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…July 24, 1847. July 24 is  a State holiday for Utahns. Those hardy, resilient pioneers, carrying  with them the sick and desperately poor from burning Nauvoo, found  temporary refuge among the kind members of the Omaha Tribe.\n\nThey made an agreement with the Omaha through their Chief, Big Elk,  who welcomed the pioneers, understanding the trouble they had…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694022/july-24th-utahs-state-holiday"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…illegal  immigrants who never should have been in our country in the first  place.\n\nTo commemorate Jocelyn's life, I have introduced the Jocelyn Nungaray  National Wildlife Refuge Act, which would permanently rename the  Anahuac National Wildlife Refuge in Texas in her memory.\n\nThis bill would actually codify President Trump's Executive order and  ensure…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691123/jocelyn-nungaray-national-wildlife-refuge"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…than 150,000  children, youth, and families--offering safe homes, educational  opportunities, and pathways to independence. Their programs keep  siblings together, provide refuge for trafficking survivors, and  distribute more than two million pounds of food to families in crisis.\n\nI commend the Founding CEO, Charles L. Bender, III, the dedicated  staff,…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694742/recognizing-place-of-hope"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "…4--unpaid announcement.\n\n``Multiple use'' means that land is sustainably used by the State and  local population, rather than preserved like a national park or a  wildlife refuge. Multiple use lands are used by miners, cattle grazers,  oil and gas developers, and recreationalists alike. They are not meant  to be locked up.\n\nMultiple use is a mandate,…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696136/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…to  maintain the swamp's native alligator population.\n\nHe was instrumental in expanding ecotourism by acquiring the visitor  concession at the Okefenokee National Wildlife Refuge headquarters and  the nomination by the U.S. Department of the Interior as the next  American World Heritage site.\n\nAfter his successful tenure in this role, Dr. Clark has…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690751/recognizing-dr-william-clark"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…repeal a Biden administration-era Record of Decision, ROD, restricting  oil and gas production on 1.16 million acres within the 10-02 area of  the Arctic National Wildlife Refuge, also known as ANWR.\n\nThe 10-02 area of ANWR was specifically set aside by Congress for its  oil and gas potential and is estimated to hold anywhere between 4.25  and 11.8…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696830/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…the Record  remarks submitted at the request of a Virginia Beach constituent, Rabbi  Dr. Israel Zoberman of Temple Lev Tikvah, and are a reflection of his  views:\n\nI found refuge every morning hiding\n\nUnder my grandpa's inviting, embracing Tallit\n\nOf black and white woven of the tapestry\n\nOf a survivor's spared life,\n\nA wondrous cloth, never abandoned…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699495/recognizing-remarks-of-rabbi-dr-israel-zoberman"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…such as an earthquake, volcanic eruption,       submarine landslide, coastal rockfall, or other event, with       the magnitude to cause a tsunami.\n\n(3) Vertical evacuation refuge.--The term ``vertical       evacuation refuge'' means a structure or earthen mound       designated as a place of refuge in the event of a tsunami,       with sufficient height…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "Mr. WESTERMAN. Mr. Speaker, I move to suspend the rules and pass the  bill (S. 1596) to rename the Anahuac National Wildlife Refuge located  in the State of Texas as the ``Jocelyn Nungaray National Wildlife  Refuge''.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693446/jocelyn-nungaray-national-wildlife-refuge-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…in the South.\n\nJekyll Island was ranked as the fifth best beach town in the South,  celebrated for its beauty, pristine wilderness, otherworldly nature,  and function as a refuge for local wildlife.\n\nTybee Island was ranked fourth on the list, being praised as a little  island packing a big punch. Tybee contains over three miles of beaches,  hundreds…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689617/commending-jekyll-island-club-resort-and-sea-island"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…prior administration was the most antimining, anti- oil and gas administration in the history of this country. I was just  up in the great State of Alaska. In the national refuge, they are  safely and responsibly extracting oil that Alaskans need.\n\nThey are going to put in an LNG pipeline, which is the safest and  best pipeline in the world, for Alaskans,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694892/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}]