[{"senator": "Ilhan Omar", "party": "Democrat", "sentence": "…Venezuela and against the transnational criminal organizations  that the administration has designated as terrorists this year.\n\nMr. Speaker, I urge all of my colleagues, regardless of their party  or ideology, to join me in this effort. All of us should agree that the  separation of powers is crucial to our democracy and that Congress has  to fight for its…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695306/venezuela-ftos-and-war-powers"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…embarrassing for our country. It is  making a mockery of this House of Representatives. Republicans should  be ashamed of themselves.\n\nI thought all of us ran for Congress, regardless of party, to try to  help people. What Republicans did a little over a week ago was about  not only hurting people but screwing them over. That is sad.\n\nThen, look at today.…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691944/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…that requires that we go beyond our  partisan affiliations and when something is wrong--dead wrong--when  something is a threat to our democracy, that we call it out regardless  of party. And this is wrong. This is wrong.\n\nWe ask: How do you lose a democracy? How does one lose a democracy?  This is how you lose a democracy: actions like today. But even…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692501/alex-padilla"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…claims all of these firings and  dismissals almost as trophies.\n\nAnd just a few weeks ago we saw something that I believe should  trouble every Member of this body, regardless of which party you belong  to. My staff and I had arranged a visit to the National Geospatial- Intelligence Agency located in my State of Virginia so that I could go  ahead and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695695/authorizing-the-en-bloc-consideration-in-executive-session-of-certain-nominations-on-the-executive-calendar"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…going on in those  detention centers?\n\nIt seems like Republicans are okay with transparency when it is  convenient to them, but when it is about Members of Congress,  regardless of their party that they are a part of, going to one of  these detention centers or holding centers, they are not okay with  transparency. We have heard that pregnant women are…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693072/special-interest-alien-reporting-act-of-2025"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…himself at the taxpayers' expense. If a Democrat were in the  White House, my friends across the aisle would be losing their minds  right now. Wrong is still wrong, regardless of which party this  President belongs to.\n\nWe need to put an end to Donald Trump's pay-for-play political gifts  for the sake of our reputation, our democracy, and our future.", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691208/ending-pay-for-play-political-gifts"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…interest. That's why Congress  has always forward-funded public media--to ensure the consistent access  to nonpartisan, unbiased information for Americans in every state,  regardless of which party controls the White House. These airwaves  belong to every American--and they're a bargain: public media receives  less than 0.01 percent of federal spending, and…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692634/rescissions-act-of-2025"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…are added to the Senate's Executive Calendar.\n\nI do not raise these objections lightly. I recognize the importance  of Federal Agencies having qualified leadership, regardless of which  party is in charge. In several cases, I have voted in favor of  reporting the current administration's nominees out of committee and to  confirm them on the Senate floor,…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691866/nominations-for-the-us-environmental-protection-agency"}, {"senator": "Steven Horsford", "party": "Democrat", "sentence": "…Nation. That is how we honor  Dr. King's legacy: by building an America of equal opportunity, shared  prosperity, and dignity for all.\n\nI encourage all of my colleagues, regardless of party lines, to do  their part in honoring Dr. King through their actions. That is how we  carry on his legacy, and that is how we revive the dream.", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699199/building-a-beloved-community"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…constitutionally mandated duties.\n\nWhen we take office, you may remember that we all swear an oath to  defend and support the Constitution of the United States. That means  regardless of what party affiliation you have or what party affiliation  the President has, regardless of what threats the President or Elon  Musk may make against you, we swear to a higher…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690818/gross-violations-of-law-by-trump-administration"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…two Democratic commissioners.\n\nThis unlawful decision undermines the legitimacy and transparency of  the agency's decisions, sending a message that no commissioner,  regardless of party, is safe, and no business that harms consumers  should fear accountability, so long as it shows sufficient loyalty to  the President.\n\nI urge my Republican colleagues…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690174/transparency-in-charges-for-key-events-ticketing-act"}, {"senator": "Ilhan Omar", "party": "Democrat", "sentence": "…service. The assassination of Melissa and  her husband, Mark, and the harm done to Senator John Hoffman and his  wife, Yvette, is a tragedy that should shake all of us, regardless of  party.\n\nThis resolution calls on us, on both sides of the aisle, to take that  violence seriously.\n\nRecently, we have seen acts of political violence minimized, joked  about,…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692855/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…patients and providers deserve a modernized supply chain, and it  has yet to be proven that VA has the capacity to provide this solution.  I emphasize this has occurred, regardless of which party was in charge  of the Department.\n\nAfter a canceled procurement effort last year, VA has told us that it  plans to restart its supply chain modernization effort for…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695397/va-hospital-inventory-management-system-authorization-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…look at the toxic forces  that are radicalizing too many Americans into embracing violence.\n\nMost of all, when violence strikes, the answer is for us to come  together regardless of party. That is especially important for U.S.  Senators. Sadly, we didn't see that this weekend. I wish I didn't have  to say this, but I was deeply disappointed and sickened…", "date": "2025-06-16", "source_url": "https://justfacts.votesmart.org/public-statement/1692580/national-protests"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…its 60-day statutory deadline to submit a list  of names for a vacancy to the President. The crisis exists because the  President and, to a larger extent, the Senate, regardless of the party  in power, do not prioritize local D.C. judges. For example, there has  been a vacancy on D.C.'s highest local court since 2013.\n\nCongress should give authority to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695614/district-of-columbia-judicial-nominations-reform-act"}, {"senator": "David McCormick", "party": "Republican", "sentence": "…this body--in the Senate--who oppose this bill, I trust that they are  acting in good faith. But I do ask them--I do ask them and all who  oppose the SAVE America Act, regardless of party--to consider the  extraordinary stakes.\n\nWe have the opportunity in this Congress to remove deep  vulnerabilities in our elections and to restore America's trust in…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700069/9999"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…has no place in our country, especially political  violence. Today, my colleagues and I firmly condemn these attacks and  all who seek to harm our elected officials, regardless of party or  ideology.\n\nIn this country, we resolve our differences through spirited debate,  the ballot box, and by working through an intentionally designed  constitutional…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692859/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…months, we will continue this work and  efforts through regular order. This Article I advancement is an  accomplishment that every Member of this Chamber can be proud of  regardless of party. Yet some still need to decide what they stand for  today.\n\nTo my colleagues on the other side of the aisle, do they want the  leverage or do they want to legislate?…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696725/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Joni Ernst", "party": "Republican", "sentence": "…Mulligan would serve as a champion  for small businesses nationwide as the Agency undergoes much needed  changes to policy and direction.\n\nAdvocacy's role remains true regardless of party, to ensure that a  strong chief counsel stands up for the little guy and warns regulators  when small firms will be harmed.\n\nDr. Mulligan understands Main Street and…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690896/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-federal-communications-commission-relating-to-addressing-the-homework-gap-through-the-e-rate-program"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…Democrats. These are precedents that Democrats themselves have  maintained for years.\n\nLet's be clear, this is the way the Rules Committee has operated when  necessary, regardless of which party holds the gavel. It is about  getting the work done. In fact, tonight we may not be reporting in the  dark of night at all but rather as the new day has begun. I…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691514/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…succeed, it would set a  dangerous precedent for suppressing voters across the Nation.''\n\nMr. Speaker, this is a moment for every Californian and every  American of decency, regardless of party affiliation, to speak out  against the abject corruption that our Governor is attempting.\n\nRecognizing Tevis Cup Winners Heather and Jeremy Reynolds\n\nMr. KILEY of California.…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694130/dismantling-californias-citizens-redistricting-commission"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…able to enter the United States through  the front door, this time with a tourist visa, under the Biden  administration.\n\nThis can never be allowed to happen again, regardless of which party  controls the executive branch. While we have a President who is  committed to securing our borders, protecting our communities, and  restoring the enforcement of…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697237/no-immigration-benefits-for-hamas-terrorists-act-of-2025"}]