[{"senator": "Ilhan Omar", "party": "Democrat", "sentence": "…public service. The assassination of Melissa and  her husband, Mark, and the harm done to Senator John Hoffman and his  wife, Yvette, is a tragedy that should shake all of us, regardless of  party.\n\nThis resolution calls on us, on both sides of the aisle, to take that  violence seriously.\n\nRecently, we have seen acts of political violence minimized, joked…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692855/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…instrument, and shutting  down libraries.\n\nIt is so healing when we turn on the radio. We want to go to a  concert. We go to an art performance because that is meaningful,  regardless of your political party. Everyone deserves an opportunity to  enjoy art, to be able to go to a library and have the choice of what  book you want to pick out, but you have…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691088/big-backstabbing-bill"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…constitutionally mandated duties.\n\nWhen we take office, you may remember that we all swear an oath to  defend and support the Constitution of the United States. That means  regardless of what party affiliation you have or what party affiliation  the President has, regardless of what threats the President or Elon  Musk may make against you, we swear to…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690818/gross-violations-of-law-by-trump-administration"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…survivors of domestic  violence.\n\nThrough its dedicated team of professionals and community  partnerships, FCS has transformed countless lives by ensuring that  everyone, regardless of background or financial status, has access to  the care and resources they need to thrive. Their century-long  commitment to mental wellness and family stability has made…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688268/recognizing-the-100th-anniversary-of-family-counseling-service"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…satisfactory. They contend that the Twenty-Third Amendment is       self-enforcing, and effectively mandates the appointment of       electors on behalf of the District of Columbia, regardless of       whether such appointment is called for under a federal       statute. Some of us disagree; indeed, the very existence of       Section 2 of the Amendment makes clear…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695596/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…essential HIV initiatives, and more.\n\nIn another sign of just how out of touch Trump is, we have seen him  attack childcare, trying to rip out a cornerstone of our economy  regardless of how many kids and working parents it would hurt and  regardless of how many small businesses it would send spiraling. Trump  also tried to eliminate preschool development…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699453/appropriations"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…independence, and, if confirmed, they would extend the administration,  in its reach into the courts, in effect, cosigning the President's most  destructive and dangerous impulses, regardless of legality.\n\nI urge my colleagues to join us in opposing these nominees. Mr. Bove  should not be before this body, and I hope my colleagues will recognize  the importance…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694062/9999"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…general, advisory neighborhood  commissioner, and ballot measures.\n\nThe D.C. law does not allow noncitizens to vote in Federal elections,  which is a crime under Federal law.\n\nRegardless of your views on the merits of noncitizen voting for local  elections, we have to acknowledge that D.C. is not the first nor are  they the only jurisdiction in our country…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692318/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…everybody who survived the first strike. Kill everybody.\n\nThose are the alleged words from the leader of our Defense  Department. Just to be clear, killing defenseless people, regardless of  whether they had been engaged in armed conflict, is a war crime, plain  and simple. The administration is trying to brainwash the American  people into thinking that…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697303/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…new version  will ``fix'' this problem by adding in a provision about affidavits to  prove identity. However, the bill remains vague, leaving the process up  to the states. Regardless, millions of women would face additional  burdensome steps to register to vote.\n\nI want to be clear; this bill is not simply a voter ID bill and  labelling it as such is…", "date": "2026-02-13", "source_url": "https://justfacts.votesmart.org/public-statement/1700083/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…negotiated  over months and months and months. This legislation would set national  standards to ensure that all eligible Americans can vote in the way  that works best for them, regardless of their ZIP Code. That is why I  also strongly support the John Lewis Voting Rights Advancement Act to  restore and strengthen key portions of the Voting Rights Act.\n\nBut…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690545/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…expansive and limitless view of the President's authority knows  no bounds. If DOGE wants to cut entire agencies, eliminate programs,  and impound funds, they will do it regardless of the law. The Trump  administration is making clear that funding treatment and prevention  for mental health and substance abuse issues is not a priority.\n\nUnfortunately,…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691876/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…Federal public defenders by $315 million. This helps to ensure due  process is not just a privilege reserved for the wealthy few, but a  protection guaranteed to all of us, regardless of status.\n\nThis package not only supports democracy at home but advances it  abroad. It protects funding to fully meet our treaty obligations,  affirming American leadership…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699057/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…I have heard expressed on both sides of  the aisle. Let's all together say: Fund SNAP, not weeks or months from  now but right now, so America's families in every State--regardless of  how they are represented in this Chamber--will benefit.\n\nMr. MERKLEY. Mr. President, I had really hoped that given the five  basic planks of this resolution, which had…", "date": "2025-11-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696499/unanimous-consent-request"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…archeological resources until they go to drill.\n\nHere is what happens when they find out at that point: It forces  costly delays for their friends in the oil industry because, regardless  of whether this survey work is completed beforehand, companies still  have to comply with laws that protect shipwrecks and mitigate impacts  to sites that were once above…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688632/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…career was defined by  an unwavering commitment to his duties, demonstrating an exemplary work  ethic that inspired colleagues and endeared him to the residents he  served. Regardless of inclement weather or personal hardship, Joseph's  dedication never faltered--his presence was a certainty, ensuring that  his community received their mail with the efficiency…", "date": "2025-03-21", "source_url": "https://justfacts.votesmart.org/public-statement/1688925/recognizing-joseph-bongarzones-retirement-with-the-united-states-postal-service-after-37-years"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…violence has no place in our country, especially political  violence. Today, my colleagues and I firmly condemn these attacks and  all who seek to harm our elected officials, regardless of party or  ideology.\n\nIn this country, we resolve our differences through spirited debate,  the ballot box, and by working through an intentionally designed  constitutional…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692859/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…made by       subsection (a) shall apply with respect to any drug       designated under section 526 of the Federal Food, Drug, and       Cosmetic Act (21 U.S.C. 360bb), regardless of the date on       which the drug was so designated, and regardless of the date       on which the drug was approved under section 505 of such Act       (21 U.S.C. 355)…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697276/mikaela-naylon-give-kids-a-chance-act"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…In fact, leftwing CNN's own  recent polling shows that 83 percent of Americans support voter ID,  including the majority of Republicans and Democrats, as well as voters  regardless of their race.\n\nWho would oppose such a bill and why? Unsurprisingly, my Democrat  colleagues oppose the SAVE America Act because it hurts the Democratic  Party's ability…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699940/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Federal officers, and then you  saw these extreme and horrifying acts of violence.\n\nI will be very clear: I will defend in any way that I can the right  to assemble and protest regardless of the content of what the  protesters are advocating. This is foundational. It is fundamental to  the American system of government, but violence is another matter  entirely.…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693143/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…succeed, it would set a  dangerous precedent for suppressing voters across the Nation.''\n\nMr. Speaker, this is a moment for every Californian and every  American of decency, regardless of party affiliation, to speak out  against the abject corruption that our Governor is attempting.\n\nRecognizing Tevis Cup Winners Heather and Jeremy Reynolds\n\nMr. KILEY of…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694130/dismantling-californias-citizens-redistricting-commission"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…this bill is for the Department of Energy  to take a holistic view of resources that are critical to the economic  as well as the national security of the United States, regardless of  the application.\n\nMr. Speaker, this bill establishes DOE's overarching responsibility  for the security of the supply chains of the energy sector. When the  Department…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699990/securing-americas-critical-minerals-supply-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…Office of the       Department, including the Veterans Health Administration, the       Veterans Benefits Administration, and the National Cemetery       Administration, regardless of the actual location where the       employee performs the functions of the position.\n\n``(B)(i) A critical skill incentive provided under       paragraph (1) to an employee…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693967/protecting-regular-order-for-veterans-act-of-2025"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…221(i) of the Immigration and Nationality Act (8       U.S.C. 1201(i)), revoke any visa or other entry documentation       issued to an alien described in subsection (a) regardless of       when the visa or other entry documentation is issued.\n\n(ii) Effect of revocation.--A revocation under clause (i)       shall take effect immediately and shall automatically…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694815/haiti-criminal-collusion-transparency-act-of-2025"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…Prevention Week to raise awareness and promote hope.\n\nSuicide affects millions of people every year, yet too many struggle  in silence. Suicidal thoughts can affect anyone, regardless of age. It  is among the leading causes of death in the United States.\n\nMental health professionals, advocacy organizations, survivors, and  allies take this month to combat…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695065/promoting-hope-during-national-suicide-prevention-week"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "…extra money, which we would love to have if we had it, if we could  just wave a magic wand and create the money out of thin air, but we  cannot do it.\n\nThe responsible thing, regardless of who has been in charge of this  Chamber, has been to do the best we can for our veterans with one or  the other of these compensation programs. And so for that reason,…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696110/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Tom Kean, Jr.", "party": "Republican", "sentence": "…undersea cabling  infrastructure, we can protect U.S. leadership from the influence of  adversarial governments, like the Chinese Communist Party.\n\nI think we can all agree, regardless of which side of the aisle we  stand on, that there is a need to ensure technologies critical to  America's telecommunications infrastructure do not end up in the wrong…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694821/undersea-cable-control-act"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…whole to be considered a rule of       general applicability; rather, all that is required is that       the rule has general applicability within its intended range,       regardless of the magnitude of the range. In particular, we       have determined that a rule is one of general applicability       even if the rule is limited to a specific geographic…", "date": "2025-07-28", "source_url": "https://justfacts.votesmart.org/public-statement/1694269/us-government-accountability-office-legal-opinion"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "…connecting Americans with history, nature, and  the founding principles of our Republic. We can celebrate America's  birthday in a very American way that invites all people, regardless of  politics, religion, age, or income bracket to be united in taking part  in the freedoms we enjoy as a result of our Constitution.\n\nMaybe, just maybe, by joining together…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697764/semiquincentennial-tourism-and-access-to-recreation-sites-act"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…provided by a       personal security entity that may include the continuous       protection of the Member, the continuous protection of the       Member's residence(s) regardless of the Member's physical       location, secure transportation, and travel-related measures       designed to support threat mitigation.\n\n2.7 Physical security enhancements…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697952/us-senate-member-protection-regulations"}]