[{"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…New York District of the U.S. Army Corps of  Engineers, Joe oversaw a diverse team of engineers and scientists  delivering major military and civil works construction, and regional  infrastructure improvements in New York and New Jersey. Mr. Seebode's  leadership has played a pivotal role in delivering life-saving  technical expertise and environmental…", "date": "2025-11-04", "source_url": "https://justfacts.votesmart.org/public-statement/1696524/recognizing-joseph-seebode"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…proposal that would be ineffective at       best and harmful at worst. The bill, which would require the       U.S. Small Business Administration (SBA) to relocate any       regional, district or local SBA office housed in a `sanctuary       jurisdiction', ignores the fact that millions of small       businesses are located in or near cities that could…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692125/american-entrepreneurs-first-act-of-2025"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…pay will not  do that either.\n\nRight now, working families are watching their access to basic  support services shrink before their eyes. Head Start has seen five of  their regional offices across the country abruptly closed. Medicaid  could face over $800 billion in cuts over the next 10 years. These  lifelines that working families depend on for affordable…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699004/empowering-employer-child-and-elder-care-solutions-act"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…ranking member that, in effect, would  ensure that a number of different water authorities--specifically, the  Eagle River Water and Sanitation District and the Upper Eagle Regional  Water Authority--would have access, as the town of Minturn already  does, to the Bolts Ditch structure.\n\nIt builds on legislation that we successfully got across the finish…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693453/bolts-ditch-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…over more details about Trump's  ``skinny'' budget, which proposes very large cuts to health programs  that American families rely on. These include eliminating programs of  regional and national significance at the Substance Abuse and Mental  Health Services Administration, otherwise known as SAMHSA, which  encompassed nearly all programs aimed at substance…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691944/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…appointment by Governor Roy Romer as the Executive  Director of the Department of Regulatory Agencies, Chancellor Garcia  was appointed by former President Bill Clinton as Regional Director for  the U.S. Department of Housing and Urban Development. He later served  as Lieutenant Governor and the Executive Director of the Colorado  Department of Higher…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692493/congratulating-chancellor-joe-garcia-on-his-retirement"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…County High School, they have achieved  a lot of great things, including bringing home a Class 1 State title  for the women's basketball team and winning a Scholastic Bowl regional  championship. Whether on the field, in the classroom, in the drama  club, or as part of one of Rappahannock County High School's bands, I  know they will carry the lessons…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691978/recognizing-fauquier-high-school-class-of-2025"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…served as a welcoming, world-class venue for  both residents and visitors.\n\nUnder his leadership, the Floreano Convention Center strengthened its  reputation as a hub for regional and national gatherings, driving  economic development and fostering community engagement. Jim's deep  understanding of operations, combined with his steady guidance and…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697211/recognizing-jim-brown"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…appalling illustration  of the highest level of greed, where billionaires rob from hard-working  Americans to augment their wealth.\n\nBy slashing staff, closing 6 out of 10 regional offices, cutting  customer service operations, restricting phone service assistance, and  spreading falsehoods about the Social Security Administration (SSA),  Trump and Musk…", "date": "2025-04-21", "source_url": "https://justfacts.votesmart.org/public-statement/1690131/opposition-to-president-trumps-and-elon-musks-theft-of-social-security-to-pay-for-handouts-to-billionaires"}, {"senator": "Adam Gray", "party": "Democrat", "sentence": "…opening. In 2009, UC Merced celebrated its first  full graduating class with First Lady Michelle Obama delivering the  commencement address. The University received its initial regional  accreditation from WSCUC in 2011, and in 2015, UC Merced is the  youngest university to earn national recognition for community  engagement with a Carnegie Research Classification.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695846/recognizing-the-university-of-california-merced"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Union  Station and therefore should be eligible for funding under the FSP  Program, the CRISI Program, the BUILD Program and the Mega Program.\n\nUnion Station is a vital local, regional and national intermodal  transportation hub that, pre-pandemic, welcomed more than 100,000  travelers and visitors each day--more than either Ronald Reagan  Washington National…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689966/introduction-of-the-union-station-redevelopment-corporation-funding-eligibility-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…New York League of Conservation Voters.      Open Plans.      Tri-State Transportation Campaign.      Transportation Alternatives.      Equitable Commute Project.      Regional Plan Association.                                   ____                                                             NVFC,                                     Washington,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690260/setting-consumer-standards-for-lithium-ion-batteries-act"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "Ms. BALDWIN. Mr. President, I rise to recognize the 50th anniversary  of Wisconsin Regional Training Partnership, WRTP, Building Industry  Group Skilled Trade Employment Program's, BIG STEP. I am delighted to  celebrate this impactful organization's 50 years of service…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695334/recognizing-the-50th-anniversary-of-wisconsin-regional-training-partnership-building-industry-group-skilled-trade-employment-program"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…priority consideration.\n\nReauthorization ensures continued Federal support for this critical  program, which has protected vital habitats, improved water quality,  and fostered regional resilience since its creation in 1987.\n\nProtecting and restoring Mobile Bay, which is in the heart of my  district, is essential to Alabama's environment, flood protection,…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698177/enhancing-science-treatment-and-upkeep-of-americas-resilient-and-important-estuarine-systems-act"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…public  service in our region, including more than two decades representing his  community through the City of Blakely and as a representative with the  Southwest Georgia Regional Commission. Throughout his long career he  has been a steady and principled leader, working to strengthen local  government, improve services for residents, and support community…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698107/recognizing-the-honorable-al-hutchins"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…criteria, evaluation process, and       contracting mechanisms used for selecting such providers;\n\n(B) a description of the extent of coordination with State,       Tribal, and regional partners in the selection and deployment       of such providers;\n\n(C) a description of how such providers are matched to meet       the needs of local communities, including…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695402/water-resources-technical-assistance-review-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…to extend these programs would further destabilize an already  fragile situation, worsening humanitarian conditions. Strengthening  economic opportunity in Haiti promotes regional stability, pushes back  on malign actors trying to gain influence with our neighbors, and  advances U.S. interests. Prosperity in our hemisphere enhances security  right here…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698853/haiti-economic-lift-program-extension-act"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "…volunteerism, philanthropic writing, and foster  parenting--particularly for infants prenatally exposed to illicit  drugs.\n\nDebra has also represented Victorville on numerous regional boards  and commissions, including the San Bernardino County Transportation  Authority, the San Bernardino Council of Governments, and the Victor  Valley Wastewater Reclamation…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696324/recognizing-the-service-of-debra-jones-on-her-retirement"}, {"senator": "Mike Rounds", "party": "Republican", "sentence": "Mr. ROUNDS. Mr. President, I rise in opposition to S.J. Res. 86. This  resolution would repeal the Environmental Protection Agency's approval  of South Dakota's Regional Haze Implementation Plan.\n\nSouth Dakota has made substantial progress toward meeting EPA's  ambitious 2064 visibility goals and has determined that no additional  emissions…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698625/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…under paragraph (1), the Secretary shall       select eligible entities to carry out demonstration projects       and to the maximum extent practicable--\n\n``(A) encourage regional diversity among eligible entities,       including participation by entities located in rural areas;\n\n``(B) encourage technological diversity among eligible       entities;…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688938/innovative-mitigation-partnerships-for-asphalt-and-concrete-technologies-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…Belgium's       capability to meet current and future threats by maintaining       its F-16 and F-35 fleets in combat-ready status and providing       a credible deterrent to regional threats.\n\n(vi) Sensitivity of Technology:\n\nThe Sensitivity of Technology Statement contained in the       original notification applies to items reported here.\n\nThe highest…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696021/arms-sales-notification"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…enforcement officers, as well.\n\nAmerican Rivers, there is a $16 million grant that is being funded by  National Fish and Wildlife. There are matching funds as well with a  number of regional partners. The purpose of the project is to restore  high-severity burned areas near the South Fork of the American River  and Cosumnes River to prevent erosion and flooding…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688626/finding-common-ground"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…almost all cases,  our interventions were counterproductive, making us less safe and less  prosperous.\n\nAs the initial jubilation wears off from those who clamor for war,  the regional situation remains precarious, and American servicemembers  remain in danger. Many advocates for war, giving voice to their real  feelings, have loudly opposed the current…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693121/motion-to-discharge-sj-res-59"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…strategic interests and enduring partnership, particularly through our  joint commitment to NATO. As allies, the United States and Turkiye have  worked together to promote regional stability, strengthen transatlantic  security, and advance the values of freedom and democracy. Our  collaboration continues to play a vital role in addressing global  challenges--from…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696871/recognizing-the-102nd-anniversary-of-the-founding-of-the-republic-of-turkiye"}, {"senator": "John Thune", "party": "Republican", "sentence": "…improve coordination and prevent       unnecessary duplication of effort among Federal agencies with       respect to research on harmful algal blooms; and\n\n``(H) include regional chapters relating to the       requirements described in this paragraph in order to       highlight geographically and ecologically diverse locations       with significant…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695277/harmful-algal-bloom-and-hypoxia-research-and-control-amendments-act-of-2025"}, {"senator": "John Thune", "party": "Republican", "sentence": "…priorities, including a major investment in telehealth, which  can be a key way to access healthcare for those in rural areas.\n\nSouth Dakota will also be using its funding to create regional hubs  for emergency services and to improve access to maternal and infant  health, to ensure delivery of essential medical care.\n\nBack in June, a few months before Democrats…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698574/rural-health-transformation-program"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…Washington, these exceptional students, Sahil  Ganjyal, Jack Carper, Leon Liu, Kevin Chi, and Nathan Kostenko, earned  their spot at nationals by winning the Inland Northwest Regional  Science Bowl this spring.\n\nAt the competition, they joined 63 of their top high school teams  from across the country to compete in one of the most prestigious  science competitions…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690876/congratulating-pullman-high-schools-science-bowl-team"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Honoring Nurse Heather Daniels\n\nMr. CARTER of Georgia. Mr. Speaker, I rise today to recognize Nurse  Heather Daniels, a perinatal services nurse at Liberty Regional Medical  Center in Hinesville, Georgia, who has been named a 2025 Hospital Hero  Recipient by the Georgia Hospital Association.\n\nThis award recognizes the time, talent, and…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699261/recognizing-wayne-barth"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…with us, the  United States: whether America still recognizes our country as an  anchor of transatlantic security, an arsenal of democracy, and a global  leader, not just a regional power.\n\nI need to make a number of points here, and it would be useful to  talk a little bit about its history.\n\nThe Second World War claimed tens of millions of lives, displaced…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699111/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…Congress to act today.\n\nCongress must act because Alaskans have spoken clearly, and they have  spoken loudly.\n\nThe North Slope Inupiat leadership, including the Arctic Slope  Regional Corporation, the North Slope Borough, and the Inupiat  Community of the Arctic Slope, have consistently supported responsible  development in the 10-02 area of our North Slope.…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696831/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision"}]