[{"senator": "Dina Titus", "party": "Democrat", "sentence": "…Nuclear Tests, to  highlight the successful steps taken by the United States and  Kazakhstan to mitigate the dangers of nuclear weapons, institute global  nonproliferation regimes, and adhere to international norms around  nuclear testing.", "date": "2025-08-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694764/marking-the-15th-annual-international-day-against-nuclear-tests"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…colleague, the only Holocaust survivor to serve  in the United States Congress, I have spent years documenting and  standing up to human rights abuses carried out by authoritarian regimes  against their own people.\n\nLet me say this plainly: A functioning democracy does not execute  people in the street. That is the kind of thing you see in North Korea,  Mr.…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699593/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Frederica Wilson", "party": "Democrat", "sentence": "…American democracy and the       promise of liberty and opportunity have drawn countless       Jewish individuals to these shores, including those escaping       from oppressive regimes in Europe, survivors of the       Holocaust, and those seeking a haven from persecution; and\n\nWhereas, the Jewish community has been instrumental in       advancing civil…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690399/proclaiming-this-and-every-april-29th-as-endjewhatred-day"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…coin.\n\nPublic officials being able to sell access using crypto undermine our  democracy and free market system.\n\nLet's look at this for what it is. This is how authoritarian regimes  do business.\n\nTrump has turned the Office of the Presidency into a personal  moneymaking machine, and we must speak truth to power for the Americans  we took an oath to protect.…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…regulatory power and threats to try to take off the  air a comedian or two comedians, it is a sure sign of the loss of press  freedom.\n\nAnd, equally, we see in other requests of regimes an effort to  concentrate power, to concentrate the media itself in the hands of  friendly oligarchs or to create a kind of state-run media, which we are  deeply at risk of…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696336/trump-administration"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…America believes in something good and greater: free speech, free  thought, free practice of religion.\n\nWhen we silence American voices, we slide every day toward the very  regimes that we say we are fighting.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695811/brendan-carrs-words"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…they contradict his political goals.\n\nIn Russia, Vladimir Putin has jailed scientists and censored  research, all to preserve the illusion of control and strength.\n\nWhat these regimes have in common is simple: They know that science,  at its core, is a challenge to authoritarianism. Science is a search  for truth. It cannot be dictated by politicians, so…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695652/respect-for-science-and-pursuit-of-truth"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…insourcing before more jobs disappear and more families pay the price.\n\nOur communities need economic certainty, not higher prices, not pink  slips, not utter chaos, and not tariff regimes that change every couple  of days. America needs a trade and tariff regime that yields good jobs,  well-paid workers, and prices for cars, trucks, and consumer goods that…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694099/trumps-reckless-tariff-policies"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…the same: When authoritarian leaders feel threatened, they silence  critics, shut down independent groups and dismantle the checks meant to  hold them accountable. And the regimes that do this are the same ones  that threaten regional stability and our own security, which is why  supporting democratic movements and civil society abroad remains  squarely…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697939/international-human-rights-day"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…China.\n\nLet's be clear: Regions we assist aren't just aid recipients. They  are emerging economies and future trading partners. Pulling back opens  the door for authoritarian regimes like China to dominate the future,  commerce, connectivity, and development.\n\nThis is not just cruel. It is strategically self-defeating and  economically foolish.\n\nMake no…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692541/rescissions-act-of-2025"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…night sky stays quiet or a story of a father digging through  rubble, his hands bloodied, desperately searching for his wife and  child.\n\nNations are not just governments and regimes. They are people. They  are mothers, sons, teachers, taxi drivers, people whose stories echo  our own because they are us. No matter where someone is born or what  language…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1692987/our-destinies-are-tied"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…do for  the American people. That means no more forever wars, no more military  escapades without congressional authorization, no more tens of billions  to prop up foreign regimes while American families struggle right here  at home.\n\nI want to thank Senator Kaine, I want to thank Senator Schiff, and I  want to thank Senator Paul for joining with me…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699088/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…U.S. Senate, throw him  onto the ground, and cuff him for no reason other than he was doing his  job. The way agents treated Senator Padilla is what you see in  totalitarian regimes.\n\nIt is outrageous that Secretary Noem let this happen and then lied  about the incident after the fact. Neither the Senate, nor any member  of government, can tolerate a…", "date": "2025-06-16", "source_url": "https://justfacts.votesmart.org/public-statement/1692588/alex-padilla"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…while exercising his First Amendment rights to speech  and assembly, rights that are guaranteed to all of us in the  Constitution. That is what separates us from autocratic regimes around  the world.\n\nThe Trump administration is now going after judges, Members of  Congress, political opponents, students, law firms, reporters,  Governors, and now the…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692154/supporting-david-huerta"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…continents, helped build the momentum  to end nuclear testing. We must draw on that same spirit today to  reinvigorate arms control diplomacy, rebuild confidence in  nonproliferation regimes, and press forward on treaties like the  Comprehensive Nuclear-Test-Ban Treaty.\n\nOn this 15th Annual International Day Against Nuclear Tests, I urge  my colleagues to reaffirm…", "date": "2025-08-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694763/marking-the-15th-annual-international-day-against-nuclear-tests"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…reminded, once again, that under President Trump, America  does not bend to tyrants or terrorists. We confront evil. We prove our  dominance on the world stage, and we ensure that regimes like Iran's  will never get their hands on a nuclear weapon.\n\nLet me say one thing for the Ayatollah. He now has a choice. This is  a time for choosing whether he wants peace…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692964/taking-a-step-toward-true-energy-dominance"}, {"senator": "John Rose", "party": "Republican", "sentence": "…discredited ideology.\n\nSocialism has time and again led to economic ruin, human deprivation,  and mass suffering. From the breadlines of Eastern Europe to the failed  Communist regimes of Cuba and Venezuela, socialism promises equality  but delivers it selectively. It promises security but delivers  surveillance. It promises fairness but delivers oppression…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697149/denouncing-the-horrors-of-socialism"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…women who dutifully and  selflessly serve this country with distinction.\n\nAt a time of rising global threats from strategic competitors, like  China and Russia, to unstable regimes and nonstate actors, America must  remain prepared and ready. Deterrence requires strength, and strength  requires sustained investment, which is exactly what this legislation…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693544/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…support we have for this bill shows the seriousness of this problem.  This amendment shows that some Democrats are still willing to turn a  blind eye to attempts by hostile regimes to influence students and  faculty on our college campuses.\n\nI urge my colleagues to oppose this amendment and support the  underlying bill.\n\nMr. WALBERG. Mr. Chair, I yield…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689032/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…movements, defending human rights, and  advancing stability in Southeast Asia are in our American interest.  When international institutions inadvertently enable authoritarian  regimes through new financing, our credibility suffers, and in this  case the Burmese people would pay the price.\n\nBy reaffirming and strengthening this pause, H.R. 4423 provides…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697196/no-new-burma-funds-act"}, {"senator": "Rob Wittman", "party": "Republican", "sentence": "…Russia,  North Korea, and Iran.\n\nThis transparency is critical. Americans deserve to know which  companies inside our tech and telecommunications markets are linked to  hostile regimes. Shining a light on this malign influence is the first  step toward a stronger action to defend our communications  infrastructure and our national security.\n\nWe know what…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690263/foreign-adversary-communications-transparency-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Speaker, we need these minerals to build a better future. Our  choice is whether to lead the world in meeting that need as only we can  or to cede that responsibility to corrupt regimes, systems, and foreign  enemies we know will abuse it. The American people have made their  choice. It is time for us to honor it.\n\nMr. Speaker, I thank Mr. Stauber for his…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699695/critical-mineral-dominance-act"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "…these horrors, we see the  likes of Xi Jinping and his Uighur reeducation camps. Putin routinely  locks dissidents in jail, just like his kindred spirits in other  censorship regimes.\n\nThis tyrant who wants to be treated as a peer in the world's great  halls of democracy should be known by the company he keeps.\n\nWhen the brutal Syrian dictator Bashar al-Assad…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699095/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…fact,  whether the Iranians may well conclude to double down on their efforts  to obtain a nuclear weapon. At this time, it is unknown.\n\nThe lesson Tehran and other unsavory regimes around the world may  learn is that the only way to deter a strike is to maintain a nuclear  deterrent. Pandora's box has been opened, and the consequences remain  to be seen.…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693121/motion-to-discharge-sj-res-59"}, {"senator": "Mario Diaz-Balart", "party": "Republican", "sentence": "…fighting, advocating for freedom around the world. There  is nothing better for our long-term national security than democratic  transitions within those anti-American dangerous regimes around the  globe, and NED is a pivotal part of that, which is why, with great  admiration and respect to the sponsor of this amendment, I must ask for  a ``no'' vote.", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699051/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Carlos Gimenez", "party": "Republican", "sentence": "…trafficking, fueling a crisis that has cost  nearly 400,000 Americans their lives since 2021.\n\nThis resolution would have us pull back from the fight against  designated terrorist regimes and cartels in our own hemisphere, just  miles from our shores. It tells the foreign terrorist regime in  Venezuela and its criminal allies that Congress is willing to look…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698445/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…want to  dominate the world religiously. That is what they are all about. They  export terrorism in the name of religion. They support groups that want  to take down secular regimes. They want a master religion like the  Nazis wanted a master race.\n\nAnd let me tell you what our friends in Israel are saying: Hell, no.  Once is enough.\n\nSo what should Israel…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692780/iran"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…Venezuela signed a 20-year economic cooperation  agreement with Iran, the No. 1 state sponsor of international  terrorism, an agreement between two of the most heavily sanctioned  regimes in the world, all designed to defy the United States and expand  their criminal enterprise.\n\nIn a hearing before the Senate Caucus on International Narcotics  Control that…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698578/trump-administration"}, {"senator": "Tom Emmer", "party": "Republican", "sentence": "…position relies on that status.\n\nThe United States cannot afford to sit on the sidelines. If we fail  to lead in this space, we risk leaving the door open for authoritarian  regimes like China to advance its state-controlled digital currencies.\n\nThis bill is a globally competitive, regulatory framework for dollar- backed stablecoins, one that encourages…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693844/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…a year in savings on a $7  trillion annual budget, up almost twice in a decade, bloated and  expanded under COVID, bloated and expanded under both Democrat and  Republican regimes.\n\nWe have had an extraordinary first 100 days. The President has turned  this ship around. We are securing borders. Apprehensions are down 94  percent. We are resetting our…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690594/fiscal-responsibility"}]