[{"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…New York League of Conservation Voters.      Open Plans.      Tri-State Transportation Campaign.      Transportation Alternatives.      Equitable Commute Project.      Regional Plan Association.                                   ____                                                             NVFC,                                     Washington,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690260/setting-consumer-standards-for-lithium-ion-batteries-act"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…proposal that would be ineffective at       best and harmful at worst. The bill, which would require the       U.S. Small Business Administration (SBA) to relocate any       regional, district or local SBA office housed in a `sanctuary       jurisdiction', ignores the fact that millions of small       businesses are located in or near cities that could…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692125/american-entrepreneurs-first-act-of-2025"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…our veterans  deserve the highest levels of support throughout this time.\n\nRepresentative Garcia's bill will strengthen the System of Excellence  by requiring VA to appoint regional breast and gynecologic cancer care  coordinators to assist veterans in navigating all of these aspects of  their treatment. These trained professionals help ensure that patients…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695419/women-veterans-cancer-care-coordination-act"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…ranking member that, in effect, would  ensure that a number of different water authorities--specifically, the  Eagle River Water and Sanitation District and the Upper Eagle Regional  Water Authority--would have access, as the town of Minturn already  does, to the Bolts Ditch structure.\n\nIt builds on legislation that we successfully got across the finish…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693453/bolts-ditch-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…over more details about Trump's  ``skinny'' budget, which proposes very large cuts to health programs  that American families rely on. These include eliminating programs of  regional and national significance at the Substance Abuse and Mental  Health Services Administration, otherwise known as SAMHSA, which  encompassed nearly all programs aimed at substance…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691944/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…appointment by Governor Roy Romer as the Executive  Director of the Department of Regulatory Agencies, Chancellor Garcia  was appointed by former President Bill Clinton as Regional Director for  the U.S. Department of Housing and Urban Development. He later served  as Lieutenant Governor and the Executive Director of the Colorado  Department of Higher…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692493/congratulating-chancellor-joe-garcia-on-his-retirement"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…have been giving out hundreds of thousands of meals,  very rarely ever turning away anyone.\n\nThe ones in my community include ones like Dulles South Food Pantry,  Haymarket Regional Food Pantry, Mobile Hope, Northern Virginia Food  Rescue, Creating Foundations for Hope, House of Mercy Food Pantry, and,  of course, Loudoun Hunger Relief. They did so much:…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696984/recognizing-food-pantries"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…that strengthen families across the region by addressing  social determinants such as access to care, nutrition, and housing.  Previously, in senior leadership at Rochester Regional Health, she  spearheaded innovative pro-Medicaid programs that prioritized  prevention and compassion by tackling the root causes of health crises.  Through her leadership,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695844/recognizing-lucia-colindres"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…appalling illustration  of the highest level of greed, where billionaires rob from hard-working  Americans to augment their wealth.\n\nBy slashing staff, closing 6 out of 10 regional offices, cutting  customer service operations, restricting phone service assistance, and  spreading falsehoods about the Social Security Administration (SSA),  Trump and Musk…", "date": "2025-04-21", "source_url": "https://justfacts.votesmart.org/public-statement/1690131/opposition-to-president-trumps-and-elon-musks-theft-of-social-security-to-pay-for-handouts-to-billionaires"}, {"senator": "Adam Gray", "party": "Democrat", "sentence": "…opening. In 2009, UC Merced celebrated its first  full graduating class with First Lady Michelle Obama delivering the  commencement address. The University received its initial regional  accreditation from WSCUC in 2011, and in 2015, UC Merced is the  youngest university to earn national recognition for community  engagement with a Carnegie Research Classification.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695846/recognizing-the-university-of-california-merced"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Union  Station and therefore should be eligible for funding under the FSP  Program, the CRISI Program, the BUILD Program and the Mega Program.\n\nUnion Station is a vital local, regional and national intermodal  transportation hub that, pre-pandemic, welcomed more than 100,000  travelers and visitors each day--more than either Ronald Reagan  Washington National…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689966/introduction-of-the-union-station-redevelopment-corporation-funding-eligibility-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…New York District of the U.S. Army Corps of  Engineers, Joe oversaw a diverse team of engineers and scientists  delivering major military and civil works construction, and regional  infrastructure improvements in New York and New Jersey. Mr. Seebode's  leadership has played a pivotal role in delivering life-saving  technical expertise and environmental…", "date": "2025-11-04", "source_url": "https://justfacts.votesmart.org/public-statement/1696524/recognizing-joseph-seebode"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "Ms. BALDWIN. Mr. President, I rise to recognize the 50th anniversary  of Wisconsin Regional Training Partnership, WRTP, Building Industry  Group Skilled Trade Employment Program's, BIG STEP. I am delighted to  celebrate this impactful organization's 50 years of service…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695334/recognizing-the-50th-anniversary-of-wisconsin-regional-training-partnership-building-industry-group-skilled-trade-employment-program"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…address pollution more  effectively and allowing NOAA to work faster and in closer partnership  with State and local governments, as well as Tribal nations,  nonprofits, and regional organizations.\n\nThe bill requires the Marine Debris Foundation to develop and  implement best practices for engaging with Tribal Governments to ensure  that they are included…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698191/save-our-seas-amendments-act"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…Atlanta,  Georgia.\n\nAs an astute entrepreneur, he founded and served as President of  Flint River Construction, a respected general contracting firm known  for projects of regional and national significance, including the  construction of Concourse E at Hartsfield-Jackson Atlanta International  Airport. He worked alongside influential figures such as…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692741/in-memory-of-overseer-roosevelt-carter-i"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "Mrs. MILLER-MEEKS. Mr. Speaker, I rise to highlight the $2 million in  community project funding I secured for Jones Regional Medical Center  in Anamosa to build a permanent, state-of-the-art medical simulation  lab.\n\nFor the past several years, JRMC has trained nurses out of two  temporary trailers.…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696799/recognizing-jones-regional-medical-center-project-funding"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…Joining Deere in 2000, John played  an instrumental role in John Deere's U.S. and International Government  Affairs and International Finance Teams, serving most recently as  Regional Director & Counsel for Government Relations, and led the  global Government Affairs organization.\n\nAt John Deere, John helped strengthen business opportunities for  dealers…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699462/congratulating-john-w-rauber-jr-on-his-retirement-after-25-years-of-distinguished-service-at-john-deere-company"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…The Maritime Law Enforcement Academy in Charleston,       South Carolina.\n\n(7) The Special Missions Training Center at Camp Lejeune in       North Carolina.\n\n(8) The Gulf Regional Fisheries Training Center (GRFTC) in       New Orleans, Louisiana.\n\n(9) The North Pacific Regional Fisheries Training Center       (NPRFTC) in Kodiak, Alaska.\n\n(10) The Northeast…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…off the mat.\n\nThis season, the Clarkston Wolves continued their tradition of  excellence, securing their 18th consecutive District Championship and  capturing their first Regional Championship since 2021. Their  remarkable determination propelled them to the State Semifinals for the  first time since 2007--an extraordinary milestone in the program's…", "date": "2025-03-21", "source_url": "https://justfacts.votesmart.org/public-statement/1688924/recognizing-the-clarkston-high-school-wrestling-teams-outstanding-season"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…thousands of American workers in the process.\n\nAdditionally, there is the independent and smaller scale refiner that  often lack the scale of larger competitors but serve critical regional  fuel markets. They may have made substantial environmental progress in  reducing hazardous air pollutant emissions, but the Biden-era ``once  in, always in'' rule locks them…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691514/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…who have fueled the country's ongoing gang  crisis.\n\nThis is not just about Haiti. It is about protecting U.S. national  security. The chaos in Port-au-Prince is creating regional instability.  Haitians are fleeing the island, using criminal networks to traffic  them and others to our southern border. These actors threaten the  safety of the Haitian…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694815/haiti-criminal-collusion-transparency-act-of-2025"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…primary mission is to destroy America and Israel.\n\nMoney is fungible, and every dollar funneled to Lebanon is another  resource aiding Hezbollah's operations, undermining regional stability,  and threatening Israel's security.\n\nUntil they finally eliminate Hezbollah and stop reporting to their  handlers in Tehran, any more funds to the Lebanese military…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693678/department-of-defense-appropriations-act-2026"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…They are real solutions for the families who  sacrifice so much to serve our great Nation.\n\nFinally, I traveled to Wallops Island in my district to visit the  Mid-Atlantic Regional Spaceport, where Virginia is playing a vital role  in America's return to the Moon and preparation for Mars. The One Big  Beautiful Bill Act provides nearly $10 billion for…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694795/promises-made-promises-kept"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…Band's technical expertise and  creativity, character, and joy. They began preparation for the season  in June and competed throughout the fall in the Cavalcade of Bands--a  regional circuit of nearly 75 bands throughout Pennsylvania, New  Jersey, and Delaware.\n\nThe Marching Bulldogs were one of 16 bands in the Liberty A  Conference, continually placing…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698290/congratulating-the-big-spring-high-school-marching-bulldogs"}, {"senator": "James Risch", "party": "Republican", "sentence": "…once again instituted a maximum-pressure policy  to bring Iran to the negotiating table. I hope our European friends  will also take the next step to counter Iran's threat to regional and  global security for good. This resolution will communicate with our  European friends that it is the intent of this body to do so.\n\nWith that, I yield back to Senator…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694081/9999"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…under paragraph (1), the Secretary shall       select eligible entities to carry out demonstration projects       and to the maximum extent practicable--\n\n``(A) encourage regional diversity among eligible entities,       including participation by entities located in rural areas;\n\n``(B) encourage technological diversity among eligible       entities;…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688938/innovative-mitigation-partnerships-for-asphalt-and-concrete-technologies-act"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…massacred under the mullahs.\n\nFinally, 10 of her 10-point plan, a nonnuclear Iran that is also  devoid of weapons of mass destruction: peace, coexistence, and  international and regional cooperation.\n\nMr. Speaker, I can't say it any better than what Maryam Rajavi has  said. This matters for even our security. It matters for regional  stability, absolutely.…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697723/free-iran"}, {"senator": "James Risch", "party": "Republican", "sentence": "…proposed sale will improve NATO's       capability to meet current and future ground threats with       precision. NATO will use the enhanced capability as a       deterrent to regional threats, and to increase       interoperability within contingency operations.\n\n(v) Justification: This proposed sale will support the       foreign policy goals and national…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693742/arms-sales-notification"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…tenure as mayor, Corbett  served as the Executive Director of the Celina Economic Development  Corporation for ten years. He also served on the Board of the Upper  Trinity Regional Water District and the McKinney Urban Transit  District. He is the past President of the Preston Trail Rotary Club and  the current Chairman of Government Affairs for the…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690167/recognizing-congressional-patriot-award-recipient-corbett-howard"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…were  included in the agriculture appropriations bill: $1 million for  Washington State University's ARS building project, $2 million for NEW  Health's Chewelah expansion and regional workforce center, and $1  million for TriState Health's Family Medicine Residency program.\n\nThese are meaningful wins for eastern Washington families and our  rural economy.…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696843/focusing-on-results"}]