[{"senator": "Dick Durbin", "party": "Democrat", "sentence": "…that has not delivered for their people: record  malnutrition, shortages of basic medicine, horrible repression of women  and girls, and instability that threatens the entire region.\n\nListen to this carefully. The State Department--our State  Department--has put out a notice that Americans should not travel to  Afghanistan because it is too dangerous.…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693450/temporary-protected-status"}, {"senator": "Raul Ruiz", "party": "Democrat", "sentence": "…$715 billion and devastate  access to healthcare for millions of Americans, like Victoria. She is a  young graduate student in the Imperial Valley, a rural and impoverished  region.\n\nShe says: ``Medi-Cal is the only way I can access essential  healthcare. It protects me from financial hardship and ensures I can  get the care I need to live and thrive.''…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691437/trumps-one-big-ugly-bill"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "Ms. KAPTUR. Mr. Speaker, I have the honor of representing Ohio's 9th  Congressional District, a region known for its patriotic spirit, strong  civic institutions, and deep respect for those who have served our  Nation in uniform. Today, I am privileged to recognize a distinguished…", "date": "2025-04-17", "source_url": "https://justfacts.votesmart.org/public-statement/1690126/proclamation-for-national-amvets-auxiliary-president-cindy-rice"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…recipients of  the 2025 Stephen A. McLaughlin Fairfax County Champions of Character  Awards. Since 2001, these awards have been presented to athletes,  coaches, and parents in our region who exemplify the tenets of  teamwork, leadership, good sportsmanship, and community service during  athletic competitions.\n\nIt is my honor to include in Record the following…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697100/recognizing-the-recipients-of-the-2025-stephen-a-mclaughlin-fairfax-county-champions-of-character-awards"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…services,  education, health and human services, and veterans services, with board  members and community volunteers engaged together in dialogue and  action to serve the overall region.\n\nI am pleased that Co-op City is a major contributor to the work of  this board.\n\nFrom the floor of the House of Representatives, we salute Bronx  Community Board 10 and its…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699710/saluting-scarsdale"}, {"senator": "Wesley Bell", "party": "Democrat", "sentence": "Mr. BELL. Mr. Speaker, winter is here, and families across the St.  Louis region and the country are opening their utility bills with a  knot in their stomachs.\n\nRight now, reckless tariff policies and economic uncertainty out of  the White House are driving…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697917/in-support-of-liheap"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Speaker, today I introduce the Protecting Federal  Agencies and Employees from Political Interference Act, which would  prohibit the relocation outside of the National Capital Region (NCR) of  the headquarters for any federal agency located in the NCR or any  federal employee position with a duty station in the NCR. Last week,  the Trump administration…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688344/introduction-of-the-protecting-federal-agencies-and-employees-from-political-interference-act"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…grateful for Sayers Jewelers and congratulate them  on their continued success. I thank them for continuing to pour into  Smyrna, Kent County, and the greater central Delaware region one family  heirloom at a time.                        Congratulating Robbie Stephens\n\nMs. McBRIDE. Mr. Speaker, I rise today to congratulate Robbie  Stephens on becoming the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695077/recognizing-trivits-family"}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "…expanding strikes to include land targets within  Venezuela--that is what we are talking about, within Venezuela--we move  further toward a war that would destabilize the entire region.\n\nThe American people don't want us to start a war within Venezuela,  and their voices should be heard, not ignored by this President.\n\nThere is a final reason why I rise in…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696566/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Jimmy Panetta", "party": "Democrat", "sentence": "…to the oil,  to the cartels, and to the future of democracy in Venezuela.\n\nThis type of military adventurism can also create instability not  just in Venezuela, but in the region, and that creates insecurity for  the United States.\n\nAs we saw this week about Greenland, the President wants spheres of  influence rather than stability from a rules-based…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699363/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…today, Vice President JD  Vance traveled to Toledo, Ohio. He came to talk about the Trump  administration's so-called record to bring jobs and help grow  manufacturing in our region.\n\nThis came as quite a surprise to me. Indeed, his words were empty  because his administration's reckless tariffs and disastrous trade wars  have increased manufacturing job…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699337/applauding-president-zelenskyys-address-in-davos"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…River Basin Commissions and report on  the practices and Federal responsibilities of each commission.\n\nThe Mid-Atlantic River Basin Commissions serve an important role in  the region by managing, protecting, and improving their respective  river basins.  The commissions were created to consolidate a complex web of State,  interstate, and Federal efforts…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695002/mid-atlantic-river-basin-commissions-review-act"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…attention to how crazy a prospect  developing one of our last remaining untouched landscapes is.\n\nThe Arctic Refuge provides subsistence fish and game for people who  live in the region. It serves as a seasonal home to species you might  see in your own State, species like Arctic terns and all sorts of  waterfowl. And it is a remarkable, vast, and breathtaking…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697413/9999"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…recent report from Taxpayers for Common Sense  outlined the lack of economic viability for any oil and gas development  there, citing astronomically high costs in this remote region.\n\nLet me be clear. House Republicans' actions today will do absolutely  nothing to lower your energy bills, but it will allow for the sell-off  of some of our most special…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696832/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…do not disclose on their permit applications, even  if they know that their operations result in the introduction of these  pollutants.\n\nIn Southeastern Virginia, one of our region's most critical resources  is the Chesapeake Bay. The Bay provides our local economy with many  opportunities in recreation, business, education, and tourism.  Throughout the…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698148/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Cap-to-Cap program to visit Washington, D.C., this  week. This was the 53rd annual Capitol-to-Capitol, or Cap-to-Cap,  program where people, community leaders from the Sacramento region come  here to D.C. to participate in programming and to advocate for our  region to lawmakers.\n\nI had the chance to be a part of this in many different ways. We had  a bipartisan…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…that Jesus Christ's first Apostle Andrew and his brother  Peter each established distinct spheres of Christian influence. The  Apostle Andrew established his ministry in the region that encompasses  present-day Turkey, and Ecumenical Patriarch Bartholomew stands as the  269th direct successor of the Apostle Andrew. Similarly, the Apostle  Andrew's brother…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695653/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…Office of Naval Research.  Millersville University is one of the many schools in the Nation that  host this program, bringing in teams of high school students from  across the region. The competition requires that students design and  build robotic systems to use in challenges mimicking military-inspired  missions.\n\nEntering their drone into two challenges…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694803/recognizing-penn-manor-high-school-students-for-their-achievement-in-the-sea-air-and-land-challenge"}, {"senator": "French Hill", "party": "Republican", "sentence": "…and\n\n(B) information about factors contributing to increased       risk of exploitation, including such factors as race, social       isolation, income, net worth, religion, region, occupation,       education, home-ownership, illness, and loss of spouse; and\n\n(3) policy responses and reporting of senior financial       exploitation--\n\n(A) the degree…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693935/national-senior-investor-initiative-act-of-2025"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…market on critical  minerals and exploit Africa's vast resources. Stronger partnerships  with African nations mean we will limit China's ability to make further  gains in the region and protect our national security interests.\n\nMadam Speaker, for example, last year the Trump administration  announced a strategic partnership agreement with the Democratic…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698908/agoa-extension-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…assembled,       SECTION 1. FINDINGS.\n\nCongress finds the following:\n\n(1) The Department of Veterans Affairs outpatient clinic, a       state-of-the-art facility serving the region's largest       veteran population, located at 1055 Hooper Avenue, recently       opened in the Township of Toms River, Ocean County, New       Jersey, in the Fourth Congressional…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693923/leonard-g-bud-lomell-va-clinic"}, {"senator": "Nicholas LaLota", "party": "Republican", "sentence": "…and technology development.\n\nBrookhaven National Laboratory in my district is a perfect example of  how small business and Department of Energy partnerships can transform  a region into a premier center for scientific innovation. The  partnerships made possible by the DOE and SBA Research Act will empower  Main Street America to contribute to cutting-edge…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687908/doe-and-sba-research-act"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…used  blockchain analytics to intercept over a quarter of a million dollars  intended to go to deadly Hamas terrorists who would have used it to  threaten U.S. forces in the region.\n\nLast year, the United States, working with our international  partners, utilized blockchain technology to help dismantle a Russian  money laundering scheme that seized more…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693961/financial-technology-protection-act-of-2025"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…in Mercer  County, Ohio. For seventy-five years, Mercer Health has been dedicated  to providing excellent healthcare to the residents of Mercer County and  the surrounding region. The hard work and spirit shown by staff have  improved the health and quality of life for countless patients.\n\nFounded in 1950, Mercer Health, known then as Our Lady of Mercy…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697414/recognizing-mercer-health-on-their-75th-anniversary"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…Hurricane Katrina.\n\nMr. Speaker, I ask that my colleagues join me in congratulating and  thanking Fire Marshal Brett Lacey for his service to our country and to  the Pikes Peak region.", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689254/recognizing-the-retirement-of-colorado-springs-fire-marshal-brett-lacey"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…pass the torch.\n\nAs Larry steps into retirement, I thank him for his courage,  dedication, and service, both in uniform and in the courtroom. Spokane  County and our entire region owe Larry Haskell a debt of gratitude.\n\nI congratulate Larry on a job well done and wish him all the best in  his next chapter.                        Firefighters Run Toward…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693542/congratulating-larry-haskell-on-his-retirement"}, {"senator": "Richard McCormick", "party": "Republican", "sentence": "…American  interests first. President Trump recognized that, which is why he  requested Congress double the funding for this program to preserve  peace in a critically important region.\n\nTrade in the Indo-Pacific accounts for about 40 percent of the  world's GDP. Around 21 percent of the global trade passes through the  Taiwan Straits, including 40 percent…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695256/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Rob Wittman", "party": "Republican", "sentence": "Mr. WITTMAN. Mr. Speaker, I rise today to congratulate the Tabb High  School Tigers Golf Team of York County, Virginia, for winning the  Virginia Class 3, Region A Golf Championship--their first regional  title since 2001.\n\nThe Tigers were led by Cooper Guldin, whose round of 74 earned him  the individual medalist honor followed by…", "date": "2025-10-28", "source_url": "https://justfacts.votesmart.org/public-statement/1696433/congratulating-the-tabb-high-school-tigers-golf-team"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…that today has an inventory that includes arcade games,  pinball machines, digital jukeboxes, pool tables, dart boards, skill  games, and ATMs.\n\nIn addition to supplying the region with entertainment options, DeLeo  Games has also been active in the community, sponsoring charities like  the UPMC Breast Care Center and drug prevention programs in Blair…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689357/securing-our-elections"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…ever since.\n\nFor 35 years, Stan has been a driving force behind major economic  initiatives to enhance the communities and economy of the Moshannon  Valley and Philipsburg region.\n\nUnder Stan's leadership, the Moshannon Valley Economic Development  Partnership has developed two business parks, two multitenant  buildings, a revolving loan fund program,…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697251/9999"}]