[{"senator": "Paul Tonko", "party": "Democrat", "sentence": "…thanks for the drive  she provides for economic development and, perhaps more importantly,  economic recovery. I thank her for her intellect.\n\nMr. Speaker, in New York's capital region, we know the value of hard  work and the dignity that comes with a paycheck, a steady paycheck. I  think that is driven somewhat, perhaps greatly, by the DNA of our  Nation,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695601/devastating-harm-caused-by-trump-administration"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…do not disclose on their permit applications, even  if they know that their operations result in the introduction of these  pollutants.\n\nIn Southeastern Virginia, one of our region's most critical resources  is the Chesapeake Bay. The Bay provides our local economy with many  opportunities in recreation, business, education, and tourism.  Throughout the…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698148/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…sanctuary. For more than a century and a half, First Baptist Church of  Merrifield has served as a cornerstone of faith, service, and community  for the Northern Virginia region. First Baptist Church of Merrifield  was started in a log cabin between 1871 to 1872. FBCM had then branched  out and began worshipping on property owned by Mr. Robert Bradley…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696034/recognizing-the-first-baptist-church-of-merrifield-on-their-155th-anniversary"}, {"senator": "Jimmy Panetta", "party": "Democrat", "sentence": "…to the oil,  to the cartels, and to the future of democracy in Venezuela.\n\nThis type of military adventurism can also create instability not  just in Venezuela, but in the region, and that creates insecurity for  the United States.\n\nAs we saw this week about Greenland, the President wants spheres of  influence rather than stability from a rules-based…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699363/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…Michigan, we already know that certain communities are facing a  disproportionate burden from electricity generation.\n\nJust ask the residents of southwest Detroit and the Downriver region  in Michigan. They have felt the harm and seen the harm, and they lived  the experience of being next to DTE's oil-fired power plant that made  them sick.\n\nMr. Chairman, it…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698042/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "…expanding strikes to include land targets within  Venezuela--that is what we are talking about, within Venezuela--we move  further toward a war that would destabilize the entire region.\n\nThe American people don't want us to start a war within Venezuela,  and their voices should be heard, not ignored by this President.\n\nThere is a final reason why I rise in…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696566/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…artists, and community members  share food and traditions from around the world. His guidance has  uplifted local entrepreneurs while fostering stronger connections  across the region.\n\nJason's heritage and perspective deeply inform his approach to both  art and education. With more than a decade of experience in the arts  and nonprofit sectors, he has worked…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695841/recognizing-jason-barber"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…permanent jobs will these largely opaque facilities actually  provide? Exactly which out-of-town interests will get the profits if  these firms succeed?\n\nResidents across our region complain State and local approvals are  moving too quickly. In Ohio, the crooked PUCO and Ohio's Legislature  have granted giant tax breaks to data centers, while local township…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697372/rushing-to-build-ai-data-centers"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…Vietnam that we share a strong  security partnership today. It is thanks to our disaster risk  mitigation programs in the Pacific islands that we have as much access  to the region as we do.\n\nSo it is not as if we just invest this money and hope for the best.  This is not charity. This is not charity. It pays off over years and  decades.\n\nThis bill also…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699751/9999"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…until the budget looks better?\n\nDo we fight to stay at the forefront of discovery and innovation, or  do we hand the future to someone else?\n\nMadam Speaker, I represent a region full of young people who believe  they can cure disease, fight climate change, and explore the stars.  What message are we sending them right now?\n\nWe should be investing in…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691392/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Richard Neal", "party": "Democrat", "sentence": "…production of the most  superior firearms for nearly two centuries. Thousands of visitors come  every year to not only marvel at this collection, but also learn about  the region's rich history and its critical role in the founding of our  Nation.\n\nOn Saturday, August 16, 2025, the Springfield Armory NHS will host a  community-wide celebration on the…", "date": "2025-08-12", "source_url": "https://justfacts.votesmart.org/public-statement/1694730/recognizing-the-50th-anniversary-of-the-springfield-armory"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…woman named Delcy Rodriguez, the Vice  President, was sworn in as his successor. I met her during my visit  there. She is a hard-liner when it comes to the politics of the region  and her brother even more so. We spoke for a period of time, and I  became convinced that they would be difficult to deal with, although  that is the reality of the moment.…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698599/venezuela"}, {"senator": "Mike Quigley", "party": "Democrat", "sentence": "…fisheries.  Decades of overfishing, invasive species, and human impact on lakes  threatened the native fish species and led to 20 species going extinct.\n\nFor all those in the region who depend on fisheries for food,  livelihood, and sport, it is critical we continue to monitor the Great  Lakes and our native fish species. The total value of commercial,…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698193/great-lakes-fishery-research-reauthorization-act"}, {"senator": "Wesley Bell", "party": "Democrat", "sentence": "Mr. BELL. Mr. Speaker, another child in the St. Louis region is gone  too early.\n\nMarshaun Futrell, Jr., was 11 years old. He was a football star, a  big brother, and a son. Monday night this 11-year-old was yet another  victim of senseless…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690802/mourning-marshaun-futrell-jr"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…population  receiving some form of Social Security benefits, and this means Social  Security plays a huge role economically in northwestern Ohio's economy.\n\nStanding up for our region and our seniors is one of my highest  priorities in Congress, and that is why last year, when Social Security  celebrated its 90th birthday, I introduced a resolution to demonstrate…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699878/protecting-social-security"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…H.J. Res. 106, a  Congressional Review Act resolution led by Congressman Nick Begich of  Alaska. This CRA reverses a resource management plan, or RMP, for the  central Yukon region in Alaska, which locked up an astonishing 13.3  million acres of land.\n\nAlaska is crucial to our national security and economic prosperity.  In 2020, President Trump announced…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694898/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…in-500-years flood event, they were all flooded. Livingston Parish,  2016--we call it the Great Flood. It affected not just this parish but  all those in what we call the capital region--Tangipahoa Parish, going  up to Monroe, LA--it was almost a statewide event.\n\nNow, if we built resiliency, this doesn't happen. If you look at  this, can you image the Federal…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690105/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…miles and served over 70,000 residents, protecting  $80 billion in assets.\n\nIn these capacities, he has been an outstanding force in protecting  the quality of life in our region by leading the front line of defense  against the all-too-common California wildfires.\n\nChief Estes is widely respected for his exceptional leadership skills  and unwavering…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698099/california-is-the-exact-opposite-of-a-model-of-efficiency"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…background, which includes experience at varying levels in the Security  Forces. He has participated in operations in Africa, Europe, the Middle  East, South Asia, and the Pacific region. He is now retiring after all  of that time.\n\nBeing a servicemember is tough. It is demanding, and the time spent  away from your family is even harder. Yet, we can never forget…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694125/recognizing-usaf-chief-master-sergeant-jason-q-shaffer"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…asset in America's national defense and global power  projection. As the closest U.S. State to both Russia and China, Alaska  provides unparalleled access to the Arctic, a region rapidly growing in  economic and military significance.\n\nWith shifting ice patterns opening new maritime routes, control over  Arctic air and sea lanes is critical to maintaining…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687923/space-dominance"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "…my bill, the PEARL Act.\n\nWith over 800 miles of the Texas-Mexico border, I represent the  largest border district in the country. From Eagle Pass to Del Rio to  the Big Bend region to El Paso, many of America's hardworking Border  Patrol agents call Texas 23 home.\n\nProtecting our Nation's border is no easy feat. It is long hours,  late nights, and time…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696972/providing-emotional-assistance-with-relief-and-love-act"}, {"senator": "Morgan Luttrell", "party": "Republican", "sentence": "…is in transition and terrorist  designations against its new leadership have been lifted, we must not  be naive to other terrorist threats that may still originate in the  region.\n\nThis bill directs the Secretary of Homeland Security to conduct a  threat assessment posed to the U.S. by individuals in Syria associated  with foreign terrorist organizations.…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697014/syria-terrorism-threat-assessment-act"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…the estimated demand for sheep and goat meat in the       United States during the 10-year period beginning on the date       of the enactment of this Act, disaggregated by region and       State;\n\n(iv) the impact of the COVID-19 pandemic on the economic       data and market conditions for imports of sheep and goat meat       and live sheep and goats;…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697537/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…in Mercer  County, Ohio. For seventy-five years, Mercer Health has been dedicated  to providing excellent healthcare to the residents of Mercer County and  the surrounding region. The hard work and spirit shown by staff have  improved the health and quality of life for countless patients.\n\nFounded in 1950, Mercer Health, known then as Our Lady of Mercy…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697414/recognizing-mercer-health-on-their-75th-anniversary"}, {"senator": "James Risch", "party": "Republican", "sentence": "…known all  along: The Iran nuclear program is not civilian, as they claim; it is  the pursuit of a bomb to destroy Israel and threaten U.S. national  security interests in the region.\n\nThe international community must not tolerate this activity any  longer. The decision to initiate the snapback process is only the  beginning. The U.N. Security Council must…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694081/9999"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…workforce demands.\n\nCentral Illinois is fortunate to have had a leader whose vision,  professionalism, and dedication to expanding educational opportunity,  have strengthened our region for many years. Dr. Quirk-Bailey's  unwavering commitment to student success and workforce advancement is  truly inspiring, and her retirement marks the closure of a remarkable…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697402/congratulating-dr-sheila-quirk-bailey-on-her-retirement"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…President Trump showed that he is not willing  to let America be strung along or taken advantage of.\n\nAfter Iran refused to accept a deal and continued to wreak havoc in  the region through its proxy organizations, President Trump carried out  targeted, strategic strikes to prevent the pending threat of Iran's  nuclear enrichment program.\n\nHe was also…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692936/peace-through-strength"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…230 beverage options across 60 well-known Coca-Cola brands.\n\nI also congratulate the Colorado Springs Chamber of Commerce for  bringing this economic boost to the Pikes Peak region. This news shows  once again that Colorado Springs is becoming an economic titan of the  West and a destination for global brands.\n\nMr. Speaker, I am personally very excited…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698080/welcoming-swire-coca-cola-to-colorado-springs"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "…that the potential resurgence of terrorist  groups in the regions, like the Islamic State or al-Qaida, could pose a  significant threat to Americans and U.S. interests in the region and  the homeland.\n\nThe Syria Terrorism Threat Assessment Act is responsive to those  warnings, and I thank my colleague Mr. Luttrell for introducing this.\n\nIt ensures that…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697015/syria-terrorism-threat-assessment-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…statement on the policy.\n\nS.J. Res. 59 fails to account for the dynamic security       threat posed by Iran and its proxies and our commitments to       force protection in the region.\n\nOn June 12, the International Atomic Agency Board of       Governors found that Iran had failed to comply with its       nuclear safeguards obligations. Iran immediately…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693132/motion-to-discharge-sj-res-59"}]