[{"senator": "Betty McCollum", "party": "Democrat", "sentence": "…oil tankers in the region to apply pressure in Venezuela. As a  Member of Congress who voted against authorizing the disastrous Iraq  War, I believe that a war to enact regime change in Venezuela would be  a catastrophic decision. That is why these two war powers resolutions  are so critically important,\n\nPresident Trump and his administration are out…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698418/supporting-of-h-con-res-61-and-h-con-res-64"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…tanker off the coast of Venezuela or threaten CIA  operations, blockades, and strikes on Venezuela.\n\nThis is no joke. This is serious. This is not about drugs. It is  about regime change. It is about being honest with the people of  America. That is what the Chief of Staff of the President just did. She  didn't talk about drugs. She talked about regime…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698456/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…as ``terrorists.'' As I stated  previously, I believe this to be unlawful. These actions are dangerous  mission creep that I fear may lead to another catastrophic war of  regime change in Venezuela. If the Trump administration needs new legal  authorities to conduct strikes on terrorist groups in the Middle East,  then they should seek new authorization…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698005/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…illegal Navy blockade? If this were about drugs, why would the  President pardon a drug-trafficking former President of Honduras?\n\nThis is not about drugs. This is about regime change and control of  Venezuela's resources.\n\nNicolas Maduro is a dictator, and you don't have to defend him to  recognize a simple truth: Venezuela does not pose an imminent…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698448/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…dictator that is Maduro.\n\nBut here is the thing. If my colleagues in this Congress want to go  to war with Venezuela, if they want to use military force to bring  about regime change in Venezuela, or if they want to wage a literal war  using the military and armed force to blow up traffickers, then they  need to come to Congress and seek an authorization…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696120/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…hypocrisy is suffocating. The administration is lying,  consolidating power, and committing war crimes in order to control, to  dominate, and to seize Venezuelan oil and pursue regime change for  their imperialistic agenda in the Western Hemisphere. They do this all  so they can extract resources, they can expand their wealth, and they  can make sure that one…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698443/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…of the fentanyl problem.\n\nI think about how it was the case with George W. Bush that he created  a fake story about weapons of mass destruction to lead us into a  massive regime-change strategy and nation-building strategy in Iraq.  Huge amounts of American treasure and lives paid the price. Four  thousand U.S. servicemembers died, and $2 trillion of…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698617/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…massive quantities of cocaine toward the United  States. If Trump were serious about stopping drugs and not using  counternarcotics as a pretext for military escalation and regime  change, he would not be letting convicted traffickers walk free while  eyeing Venezuela's vast oil resources.\n\nTo this day, the Administration has not provided Congress with a…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698324/supporting-the-war-powers-resolutions"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…left with far more questions than  answers: What will this unending occupation cost the American people?  Why did the administration, led by Secretary Rubio, lie about regime  change? Which is next: Greenland? Cuba? Colombia? Mexico?\n\nBut one answer is perfectly clear: the answer to the question of why  Trump and Rubio did this. It is obvious. This…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698823/9999"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…going to end the endless wars. This  Congress must stand up against another war in Venezuela like we had in  Iraq, Afghanistan, or Libya. The American people do not want a regime  change war in Venezuela.\n\nMr. Speaker, while I have such tremendous respect for the chairman of  the committee and the ranking member, it is not enough for Pete Hegseth  to come…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697796/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…killed almost 100 people. We are beginning a blockade of a country with  which we are not at war and with which the American people do not want  us to go to war--not over regime change, as despicable as the Maduro  regime is. The American people do not want to go to war over regime  change, which is apparently the real objective here.\n\nWe should pass…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698422/unanimous-consent-requests-the-calendar"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…focus the  narrative on drug trafficking so we don't recoil from what may be right  around the corner with Venezuela, and that is the use of force to  achieve the goal of regime change.\n\nI understand the President, this weekend, said he was not  ``inclined'' along those lines. But I urge my colleagues to look at the  administration's actions and not merely…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696564/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…Now, as someone mentioned, we are hearing that we have seized a  Venezuelan oil tanker off the coast of Venezuela. The President has  spoken frequently about his desire for regime change in Venezuela. That  should not be happening. That is not the policy that we should be  headed toward. We shouldn't be wanting to go back to the 19th century  where powerful…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697790/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…promising to  run it for the foreseeable future. An administration that had promised  to end foreign wars has begun a new one. A President who had decried  the use of force for regime change or to engage in nation building has  just committed our country to both.\n\nNo doubt Russia and China see opportunity in this American about- face, with Russia to indict…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698678/venezuela"}, {"senator": "Ilhan Omar", "party": "Democrat", "sentence": "…Mr. Speaker, I thank Ranking Member Meeks for yielding.\n\nMr. Speaker, may I answer that question for Mr. Meeks?\n\nThe answer is that this is not about drugs. This is about regime  change. We also have the White House Chief of Staff on record saying  that this is about regime change. It has nothing to do with drugs.\n\nMr. Speaker, I rise today in strong support…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698240/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…have their  life interrupted daily by ballistic missiles coming from religious  Nazis who want to kill all the Jews like Hitler. They are not going to  put up with that. Regime change is coming to Iran, one or two ways: The  regime renounces what they have been doing since 1979 and changes  course, or it is replaced.\n\nTo expect Israel to do anything…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692780/iran"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…one question only: Does the  Constitution allow one man or one woman to take the Nation to war  without the approval of Congress? Full stop.\n\nThat question is bigger than regime change in Venezuela, bigger than  the claims that the ends justify the means, bigger even than the  depredations and evils that multiple socialist autocrats have  perpetrated…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698611/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Eli Crane", "party": "Republican", "sentence": "…hide behind a noble title.\n\nI thank Mr. Mike Benz and other patriots. We have learned that this  organization has engaged in global censorship, domestic propaganda, and  regime-change politics. It has worked to crush populous movements, fuel  color revolutions, and run off-the-books operations with plausible  deniability.\n\nThe Trump administration attempted…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699052/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…Senator Schumer criticized President Trump  for bragging ``about his Venezuela policy'' but failing to bring ``an  end to the Maduro regime.'' It sounds like a call for regime change to  me, just like Joe Biden's decision to increase the bounty on Maduro's  head seems like a call for Maduro to be apprehended and brought to  justice. Yet when President…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698556/venezuela"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…being a safe haven for drug dealers and international  terrorists.\n\nHe has a plan to rebuild the country and eventually transition it,  through an election, to a new regime. Regime change will come to  Venezuela through the ballot box. In the meantime, he is threatening  military force to people who want to undercut this effort.\n\nHe is taking the oil…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698616/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…nuclear  deterrent. Pandora's box has been opened, and the consequences remain  to be seen.\n\nCongress must now focus its efforts on deescalation and preventing  the call for regime change, the consequences of which, if applied to  Iran, risk the total destabilization of the Middle East. The American  people are sick and tired of sending their children to…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693121/motion-to-discharge-sj-res-59"}, {"senator": "Pat Ryan", "party": "Republican", "sentence": "…and, more importantly, lie to the  American people. Why? Because they know it isn't right or popular.\n\nThe last thing, Mr. Speaker, the American people want is another  regime change war, a forever war for oil. I urge my colleagues to  support this resolution and to not repeat history.", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699360/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…that would bring security at home  and liberty to foreign lands. Topple the government and declare a new  age of freedom. The warmongers have recycled these experiments in  regime change again and again. And what has it brought? Instability,  chaos, suffering, and resentment.\n\nIt is the height of arrogance to think we can forcibly remove the  dictatorship…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696562/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}]