[{"senator": "Joshua Gottheimer", "party": "Democrat", "sentence": "…IPO, an acquisition, or a follow-on offering.\n\nThis bipartisan legislation will further reduce the burden on EGCs  trying to raise capital, cutting red tape and burdensome regulations to  help unleash economic growth.\n\nMr. Speaker, when emerging growth companies were created during the  bipartisan JOBS Act nearly a decade ago, the goal was to make it…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693856/greenlighting-growth-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…in a 2020 report--that was a report--that  domestic refinery margins suffered in the wake of the repeal. This bill  only asks for the report to assess executive actions, regulations, or  policies that have impacted refineries, not a change in the law. If it  were dealing with a change in the law, I think that would make sense.\n\nIt is a massive, massive…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697034/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…emissions from haze-causing  sources through controls or retirements where necessary to make  reasonable progress toward natural visibility conditions.\n\nThe EPA provides guidance regulations that help States develop  appropriate regional haze plans which are due every 10 to 15 years. The  Clean Air Act presumes that additional controls or retirements will be…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698620/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…their ability to  make a living--are further and further undermined.\n\nCitizens United has created a system where Presidential pardons are  pay-to-play, where environmental regulations that keep us safe and  healthy are slashed, where corporate mergers are rubberstamped by  Federal regulators.\n\nFor 16 years now, we have seen the slow, cancerous corruption…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699090/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…sector, you can just go to Staples and Amazon to purchase them  right there, really quickly, and for a pretty good cost.\n\nIn the public sector, there are a lot of rules and regulations in  place to buy things like pens or staples. It is even harder to do this  with technology tools that can help people get their Social Security  payments faster, renew…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692900/congratulating-virginias-10th-district-congressional-award-medalists"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…R.F.K., Jr., is sabotaging food safety. I am  glad that some companies are now choosing to remove artificial dyes  from some of their products. But when it comes to bedrock regulations  that keep all Americans safe and prevent foodborne illnesses, R.F.K.,  Jr., may as well be pro-food poisoning because, on his watch, CDC is  throwing in the towel on food…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694964/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "…to designate unique ZIP Codes for a number of  communities across the country. This bill aims to address certain  issues related to economic development and public safety regulations  and mail delivery.\n\nFor example, Eastvale is a town in southern California that is home  to 69,000 residents. It currently shares two ZIP Codes with neighboring  jurisdictions.…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693861/establishing-new-zip-codes"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "…American technology and demands that the administration act to  protect our interests.\n\nAs technology evolves, so must our technology security policies. Our  export control regulations were written at a time when remote access of  controlled technologies was not an acute threat.\n\nToday, as Russian and PRC entities find more and more creative ways  to evade…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698860/remote-access-security-act"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…rights,  undermines worker protections and hard-earned wages, and downgrades the  U.S. economy.\n\nRight now, the Trump administration is in the process of rolling back  labor regulations that do a lot of things, such as promote  nondiscrimination and strengthen the regulations we have. The ones they  are trying to undermine are the regulations that promote…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695574/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…them as       scarce resources, which we are no more free to contaminate       than we are free to throw garbage into our neighbor's yard.\n\nThis requires comprehensive new regulations. It also       requires that, to the extent possible, the price of goods       should be made to include the costs of producing and       disposing of them without damage…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691582/hj-res-88"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…because the federal  government's land-use interests in the Nation's capital are protected  by federal law and federal agencies.\n\nThe Commission creates the zoning maps and regulations, which must  ``not be inconsistent with the comprehensive plan for the national  capital.'' The mayor is responsible for the local elements of the  comprehensive plan, subject…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692763/introduction-of-the-district-of-columbia-zoning-commission-home-rule-act"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…others who are prohibited       under federal law from possessing firearms will modify       ``less-than-lethal projectile devices'' to circumvent federal       laws and regulations, including those regulating so-called       `ghost guns.' In 2022, an adjudicated domestic abuser who was       prohibited from possessing firearms used a ghost gun to…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700033/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Ilhan Omar", "party": "Democrat", "sentence": "…of Labor that threatens worker  safety, fair pay, and basic protections for millions of Americans.\n\nThe Department is moving to rewrite or repeal more than 60 workplace  regulations. Let me say that again: 60 workplace regulations. It will  affect conditions in farms, factories, construction sites, and mines.\n\nThese changes are being framed as modernization.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695573/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…international  waters, particularly in regions such as Southeast Asia, where most of  the world's coral reefs are located. In many of these countries, there  are weak or insufficient regulations to prevent destructive collection  methods. As the largest importer of ornamental reef fish and corals,  the United States bears a significant responsibility in perpetuating…", "date": "2025-03-18", "source_url": "https://justfacts.votesmart.org/public-statement/1688918/saving-nemo-act"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…York City precisely because we have more flexible multiclass  structures. Yet, our advantage over other financial hubs, like Hong  Kong and Shanghai, is not just one set of regulations. It is the  transparency and openness of our capital markets, and transparency  strengthens markets.\n\nBy doubling down on our strengths, this bill will further cement our…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693912/enhancing-multi-class-share-disclosures-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…finalized new and amended standards for 30 appliance classes,  regulating virtually every appliance in our houses and much of the  equipment in businesses. All of these regulations led to over $60  billion in added costs.\n\nImplementing these certification, labeling, and enforcement  provisions will further solidify the disastrous standards promulgated…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688548/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…compliance with all       applicable privacy law, including section 552a of title 5,       United States Code (commonly referred to as the ``Privacy       Act''), and the privacy regulations promulgated under section       264(c) of the Health Insurance Portability and Accountability       Act (42 U.S.C. 1320d-2 note).\n\n(g) Rule of Construction.--For purposes…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692169/controlled-substance-onboard-vessels"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…acts to give small businesses the relief they  deserve. In just the first 6 months of President Trump's second term,  Republicans have worked to put an end to burdensome regulations through  CRAs and carry out a deregulatory agenda.\n\nWe are responsible for $86 billion in reduced regulatory costs and  over 50 million hours of reduced paperwork burdens.…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697330/small-business-regulatory-reduction-act-of-2025"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…introduced with  the subcommittee chair, Ms. Wagner.\n\nThis bill will make business easier for small companies right here in  America. That is something we all agree on. Too often, regulations make  it harder than it should be, especially for entrepreneurs and emerging  businesses trying to make the next step.\n\nIn 2012, Congress worked to fix that problem, passing…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693854/greenlighting-growth-act"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…penalized. While  aviation professionals are mandated to report if they seek mental  health care, once they take that step, they are faced with delays,  confusion, and broad regulations to return to work. This often means  that relatively minor mental health concerns result in long wait times  and derailed careers for safe and well-trained pilots and air…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695005/mental-health-in-aviation-act-of-2025"}, {"senator": "William Timmons", "party": "Republican", "sentence": "…a detailed list of developmental opportunities       available to the supervisor; and\n\n``(2) the policies of the agency for requiring supervisor       development.\n\n``(f) Regulations.--Not later than 1 year after the date of       enactment of the Federal Supervisor Education Act, and       notwithstanding section 4118(c), the Director of the Office…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698216/federal-supervisor-education-act"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…the export, reexport, and in-country transfer of the items       identified pursuant to subsection (b)(1) for appropriate       controls under the Export Administration Regulations,       including by evaluating, for each item so identified, whether       to add the technology to the Commerce Control List maintained       under title 15, Code of Federal…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694819/undersea-cable-control-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "…decades.\n\nRepublicans have spent the last year cleaning up from the  consequences of Democrats' Big Government philosophy. President Trump  has repealed a number of burdensome regulations and rules, and here in  Congress, we have used the Congressional Review Act to repeal rules,  regulations, and mandates that were creeping into seemingly every facet  of…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697344/biden-administration"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…Research Service  several years ago because I was interested in this. They said we have  no idea.\n\nEstimates range from 4,000 statutes to hundreds of thousands of  criminalized regulations, but no one actually knows because Washington  has never bothered to count them. This is the very definition of  overcriminalization: vague laws, hidden laws, duplicative…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697204/count-the-crimes-to-cut-act"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…contracts tied to the Chinese Communist Party.\n\nNearly 30 percent of disclosed foreign funding lack even basic  details like contract dates or intended purpose. Current regulations  permit anonymous giving. These are not clerical errors. This is a  systemic failure, one that has left our institutions wide open to  foreign influence with real consequences…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689028/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…embargo across this country when the  Arabs cut us off, we were told we had no energy in this country. What  has happened? If you put the right laws in place and have the  regulations that follow and turn the entrepreneurs and innovators loose  in this country, we are number one in the world--number one in the  world. We produce more natural gas. It is…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698073/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…is a bait and switch, Mr. Speaker.\n\nUnder the current waste emissions charge regulation, the so-called  regulatory compliance exemption only applies if methane emission  regulations are in place in every applicable State.\n\nHere is the catch: Many States haven't adopted these regulations,  which means producers can't even comply with these rules that…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688183/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "David Kustoff", "party": "Republican", "sentence": "…that is happening right now across this great  Nation, many taxpayers are having their replacement checks stolen, as  well. This is truly not acceptable. These outdated IRS regulations are  partially to blame.\n\nThe IRS' current process really makes no sense. It exacerbates check  fraud. It creates more bureaucratic hurdles for U.S. taxpayers and  ultimately…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689290/recovery-of-stolen-checks-act"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…are coming  down. They are at their lowest level in 4 years. Real wages are rising  again. Regulatory costs are finally being rolled back after years of  Democrats using regulations as a weapon against affordability.\n\nPresident Trump and congressional Republicans are cleaning up the  mess left behind, undoing the damage of the Biden economic policies,…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699905/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…undue injury to the competitive position of such       person; or\n\n(f) may divulge matters required to be kept confidential       under the provisions of law or Government regulations.       (Paragraph 5(b) of rule XXVI of the Standing Rules.)\n\nRule 3. Written notices of Committee meetings will normally       be sent by the Committees staff director to…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687982/us-senate-committee-on-rules-and-administration-rules-of-procedure"}]