[{"senator": "Jack Reed", "party": "Democrat", "sentence": "…will continue to do so.\n\nMr. REED. Mr. President, on a different topic, I note that the Senate  this week has started debate on the GENIUS Act. This bill establishes a  regulatory framework for so-called stablecoins, which are  representations of dollars recorded on a blockchain.\n\nThe GENIUS Act could be the most significant banking bill that  Congress…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691451/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…and to help shape a bipartisan product that reflects the seriousness of  the moment.\n\nThis bill reflects compromise, collaboration, and months of work to  craft the regulatory framework that meets the moment, because the truth  is, we can't afford to fall behind.\n\nRight now we are at a crossroad. The digital asset industry is  growing, evolving, changing…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693791/digital-asset-market-clarity-act-of-2025"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…IDA began issuing  securities on the bond market which are also distributed in the United  States. These securities are not exempted from the SEC's registration  and regulatory framework.\n\nCongress passed legislation in 1945 and 1955, exempting other arms of  the World Bank, including the International Bank for Reconstruction and  Development and the…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693972/aligning-sec-regulations-for-the-world-banks-international-development-association-act"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…generation because the  American people deserve better than that.\n\nOne of the things I would like to see more of is rather than a  pledge, a concrete proposal, actual regulatory framework that will  protect people's energy costs.\n\nThat is what we are doing in Virginia. Down in Richmond, there is now  legislation that they are moving forward to essentially…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700227/winners-of-the-global-energy-race-are-being-decided"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…Well,  the Republicans decided to jam us anyway. But the Democrats have power  to say no, and that is exactly what we just did.\n\nThe GENIUS Act would establish a new regulatory framework for  stablecoins, a type of cryptocurrency whose value is pegged to the  value of another asset, often, the U.S. dollar. This is a $100 billion  market.\n\nA stablecoin…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690905/genius-act"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…three bills before us  this week, Congress should consider legislation that puts guardrails in  place to protect consumers, prevent fraud, and establish an effective  regulatory framework for crypto. Instead, these H.R. 3633, S. 1582, and  H.R. 1919 fall short of creating an effective regulatory framework,  allow Big Tech and the Trump family to enrich…", "date": "2025-07-25", "source_url": "https://justfacts.votesmart.org/public-statement/1694254/9999"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…concerned that a loophole in the CLARITY Act (HR       3633) would allow non-crypto companies to put their stock on       the blockchain and evade the entire securities regulatory       framework that currently exists. This would reduce reporting       requirements, disclosures and other obligations. These       changes would put pensions and 401k plans in…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693839/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…Agriculture, I rise today in support of both the  CLARITY and GENIUS Acts.\n\nThese bills aren't perfect, but digital innovation is critical to our  economy, and I support a regulatory framework that protects consumers  in the financial system.\n\nHowever, I am concerned about the ability of certain officials to use  these assets for self-enrichment at the highest…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693837/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "…asset space  offers new pathways for economic opportunity, especially for  historically marginalized communities; and I strongly believe we must  craft an inclusive regulatory framework that protects consumers, holds  bad actors accountable, and supports financial inclusion for those who  utilize these services.\n\nI welcome the opportunity to work with…", "date": "2025-03-14", "source_url": "https://justfacts.votesmart.org/public-statement/1688902/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…that  maintains environmental safeguards under bedrock environmental  protections like NEPA and the Migratory Bird Treaty Act. This approach  will provide a reasonable regulatory framework with proper oversight  and require renewal every 5 years to ensure that it is working as  intended and that, moving forward, the Fish and Wildlife Service  conducts…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697640/cormorant-relief-act-of-2025"}, {"senator": "Kirsten Gillibrand", "party": "Democrat", "sentence": "…year, Senators Hagerty, Alsobrooks, Scott, Lummis, and I  introduced the bipartisan GENIUS Act, which is the strongest effort to  date to regulate and create a clear regulatory framework for the  payment stablecoin industry.\n\nIt has a number of commonsense provisions relating to consumer  protections, reserve requirements, illicit finance, national security,…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692380/9999"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…It is paramount that we send this historic piece of legislation, the  GENIUS Act, to the President's desk because this bill is the first of  its kind in creating a regulatory framework for the future of  stablecoin issuance in the United States to revolutionize finance and  payments in this country and around the globe.\n\nNot only will this cement us,…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693841/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…Subcommittee in 2017 and 2018 and held hearings on  cryptoassets, Congress has finally recognized the unique nature of  stablecoin products.\n\nUnder this bill, we established a regulatory framework that targets  the activity, not the technology. After years of indecision, Americans  finally have an administration that is ready to embrace those products.  The time…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693829/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…would be at  their home community financial institution or credit union.\n\nI encourage all of my colleagues to support this resolution to  restore common sense to our regulatory framework and ensure that  consumers continue to have access to the financial services on which  they rely.\n\nMr. HILL of Arkansas. Mr. Speaker, let me say that the gentlewoman…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689849/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "Mr. CARTER of Georgia. Mr. Speaker, I rise today to voice my support  for  S. 1582, the GENIUS Act of 2025, which will provide a clear regulatory  framework for the issuance of stablecoins in the U.S.\n\nThis bipartisan, industry-supported bill will finally give the  stablecoin asset class clear rules of the road for the…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693843/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…modernizing the U.S. financial infrastructure for the digital age while  protecting the interests of consumers, markets, and the Nation.\n\nS. 1582 provides a comprehensive regulatory framework for the  issuance and oversight of payment stablecoins in the United States. It  is designed to support responsible innovation, ensure consumer  protection, and preserve…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693544/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…tests for consumable hemp products. They have been  asking Congress to pass legislation to responsibly regulate their  industry.\n\nRather than adopt this common-sense regulatory framework to protect  children and allow adults to make informed decisions, Section 781 of  this bill essentially imposes a national ban of all ingestible hemp  products with…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696735/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Rick Crawford", "party": "Republican", "sentence": "…affordability, they neglect  the fact that we can address affordability by reducing costs to  potential homeowners.\n\nAt least we can agree that we have a cumbersome regulatory framework  that needs to be fixed. This helps fix and is actually a proactive step  in addressing the affordability crisis. One of those things has to do  with homeownership,…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698040/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…position  ever again.\n\nIt would also streamline the permitting process for projects that  connect U.S. energy resources with international markets, establishing  a clear regulatory framework so energy developers can tackle projects  with confidence and certainty.\n\nMr. Speaker, I am proud to have supported the Promoting Cross-Border  Energy Infrastructure…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695690/promoting-cross-border-energy-infrastructure-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "…say, who had  voted for the bill in committee, inexplicably chose to vote against it  here on the Senate floor. That is pretty difficult to understand.\n\nProviding a regulatory framework for stablecoins is a bipartisan  issue. The bill is the product of a bipartisan negotiation, and the  vote in the Banking Committee was definitely bipartisan--which…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690974/business-before-the-senate"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…comprehensive market structure framework, responsible  actors will now have greater certainty and consumers greater protection  from bad actors.\n\nThis bill establishes a regulatory framework for digital assets that  aligns with our existing financial markets while accounting for the  unique characteristics of digital assets.\n\nMr. Speaker, our markets are…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693769/digital-asset-market-clarity-act-of-2025"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…back into our  schools, push for the largest investment in American agriculture in a  generation, advocate for career and technical education, and establish  a Federal regulatory framework for digital assets like cryptocurrency.\n\nOn the policy front, I helped to ensure the passage of the Secure  Rural Schools Reauthorization Act. I secured numerous provisions…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698682/recognizing-the-honorable-steny-hoyer"}, {"senator": "Tom Emmer", "party": "Republican", "sentence": "…space, we risk leaving the door open for authoritarian  regimes like China to advance its state-controlled digital currencies.\n\nThis bill is a globally competitive, regulatory framework for dollar- backed stablecoins, one that encourages domestic innovation and brings  transaction volume back into the United States' visibility and under  our control.…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693844/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…Speaker, the intent of Congress in enacting the  CLARITY Act is clear: to reestablish the United States as the global  leader in digital asset markets by ensuring our regulatory framework is  clear, forward-looking, and functional.\n\nThe exemptive authority granted to the SEC under Section 204(g) of  the CLARITY Act provides a mechanism to address evolving…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694155/digital-asset-market-clarity-act-of-2025"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…American  technological innovation have allowed us to reduce emissions more than  any other Nation since 2005, all while achieving record energy  production.\n\nWe need a regulatory framework that incentivizes innovation and  rewards it when it happens. That means eliminating one-size-fits-all  regulations like the ``once in, always in'' rule.\n\nSupporting…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691597/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…consumer protection. There  are no rules federally across the board in the digital asset space at  all now. That is why we have seen consumers hurt by the lack of a  regulatory framework. I have to say, Mr. Speaker, in total contrast to  my friends on the other side of the aisle, that is what we are all here  for today.\n\nMr. Speaker, I appreciate your…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693834/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}]