[{"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…help expand access to care for patients with rare diseases and  complex medical needs. It increases research and development into rare  pediatric diseases, improves regulatory certainty, strengthens the  medical product supply chain, and enhances patient access to lower-cost  medicines.\n\nThis bill will help in our efforts to bring new treatments to…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697277/mikaela-naylon-give-kids-a-chance-act"}, {"senator": "Scott Peters", "party": "Democrat", "sentence": "…waste emissions charge, commonly known as the methane fee, which is a  commonsense measure that benefits American industry, protects  consumers, and provides much-needed regulatory certainty in the energy  sector.\n\nAddressing methane emissions, especially fugitive emissions from oil  and gas, is one of the most effective ways to combat the climate  crisis,…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688174/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…comply.\n\nThis should be a no-brainer, a win-win scenario of reducing cancer- causing emissions and promoting innovative technologies to modernize  industry and provide regulatory certainty. I really don't understand  why House Republicans are so fixated on trying to repeal and block the  work of the EPA.\n\nMadam Speaker, for the health of workers and the…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688531/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…outlines the proper  process for updating a resource management plan. That is a process that  centers on the voices and needs of local land users, while preserving  regulatory certainty.\n\nBy contrast, the CRA strips the public out of the process, and it  throws public lands into chaos. What do I mean by that, Mr. Speaker?  Here is what I mean. If Congress…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694909/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Scott Fitzgerald", "party": "Republican", "sentence": "Mr. FITZGERALD. Mr. Speaker, I rise today in support of the  bipartisan CLARITY Act, commonsense legislation that finally gives  digital asset markets the regulatory certainty they need to grow  responsibly right here in the United States.\n\nFor too long, innovators have been stuck in a regulatory gray zone  caught between agencies and overlapping…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693792/digital-asset-market-clarity-act-of-2025"}, {"senator": "Scott Fitzgerald", "party": "Republican", "sentence": "…repeal the CFPB's rule and protect consumers'  access to financial products.\n\nI urge my colleagues to support this CRA resolution, defend consumer  choice, and restore regulatory certainty to our financial system.", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689839/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…showerhead, or they can simply turn down the faucet. It is that simple,  but those choices must be left to individual Americans and not to  Washington.\n\nH.R. 4593 would bring regulatory certainty to manufacturers,  performance effectiveness to a household appliance we all use, and  choice to American consumers.\n\nMr. Speaker, I urge my colleagues to support it,…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698566/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…view of what the  future is. We are fighting hard to preserve a predictable tax code in  this country. We are extending the current tax code so that we can have  regulatory certainty, tax certainty, so that businesses can thrive and  grow and not fear the hammer of government that they did in the Biden  years.\n\nThere was an explosion after election day…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688464/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing-and-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…politicians, in charge of decisions.\n\nBy creating a consistent statutory framework that protects all  existing requirements and environmental reviews, we can provide the  regulatory certainty energy developers need to invest, hire, and build.  Most importantly, this strengthens America's role as a global energy  leader.\n\nMr. Speaker, I urge my colleagues…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695691/promoting-cross-border-energy-infrastructure-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…CLARITY Act is about three related ideas: certainty, protection,  and innovation. I will talk about why each of these ideas is important.\n\nFirst, the CLARITY Act provides regulatory certainty for all corners  of the digital asset ecosystem, including issuers; exchanges;  intermediaries; builders; software developers; and, most importantly,  users of digital…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693788/digital-asset-market-clarity-act-of-2025"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…today in support of H.R. 3898, the PERMIT Act, which would cut  red tape within the Clean Water Act's permitting processes. This  legislation will provide much-needed regulatory certainty for America's  farmers, small businesses, manufacturers, home and road builders, and  many other permit holders.\n\nMy colleagues across the aisle continue to promote…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698025/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Tom Emmer", "party": "Republican", "sentence": "…legislation. This provision provides market certainty for innovators  and clear jurisdictional boundaries for regulators.\n\nSubsequently, elements of the Blockchain Regulatory Certainty Act  were included, clarifying, once and for all, that digital asset  developers and service providers who do not custody consumer funds are  not considered money transmitters.…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693790/digital-asset-market-clarity-act-of-2025"}, {"senator": "John Hoeven", "party": "Republican", "sentence": "…producing  less than 100,000 barrels a day. We took that up to 1.5 million barrels  of oil a day. This doesn't just happen overnight. It is because we work  to provide the regulatory certainty to empower innovation and  entrepreneurial spirit to unlock the potential for energy development  in our State and in our country.\n\nAs North Dakota became an energy…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688157/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…rare diseases that still lack an FDA-approved  treatment.\n\nAs a physician, I know that true medical breakthroughs require bold  investment, sustained commitment, and regulatory certainty. As a  legislator, I am committed to preserving the integrity of the Orphan  Drug Act and ensuring that it continues to drive life-changing  treatments for patients.…", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691696/support-for-the-orphan-drug-act"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…putting together a  bill that cuts red tape, reduces duplicative reviews, and gives  farmers, ranchers, utilities, and communities in Colorado and across  the country the regulatory certainty that they need to build.\n\nI look forward to advancing this important legislation.", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698019/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…of our resources and of our air and water.\n\nAmerican businesses are dedicated to protecting the health, safety,  and vibrancy of their communities. What they need is regulatory  certainty, not a rule that locks them into compliance with outdated  standards even after they have done the right thing. This is about more  than just one burdensome regulation.…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689195/work-highlights-of-western-caucus"}]