[{"senator": "Maxine Waters", "party": "Democrat", "sentence": "…well.\n\nFor questions, please contact Bartlett Naylor.            Sincerely,                                                    Public Citizen.\n\nMs. WATERS. Mr. Speaker, let me reiterate that it is irresponsible to  turn this bill over to the President of the United States, and I  continue to reserve the balance of my time.\n\nMs. WATERS. Mr. Speaker, I continue…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693839/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…great personal sacrifice to fight for everyone in this country and to  sound the alarms, as you have been talking about. So I just personally  want to thank you.\n\nI want to reiterate something that you have said for all of these  hours and, actually, many times to me over the past few months--the  fact that Trump is using his place in government to control…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696355/trump-administration"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…on what they  didn't eat than learning.\n\nMr. Chair, there is more we can do, and that is another reason why I  am so glad I didn't vote for the President's tax cut.\n\nI just reiterate, again, that this mil-to-mil training builds  resilience, support, and respect between the militaries. It keeps their  militaries healthy, and I continue to oppose this amendment.…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693686/department-of-defense-appropriations-act-2026"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…the richest 1 percent. This is a terrible circumstance.\n\nMr. CARBAJAL. Mr. Speaker, I thank Mr. Espaillat for his remarks.\n\nBefore I yield to our next speaker, I wanted to reiterate: Make no  mistake, under this plan we can expect even higher prices for food and  goods, and it further worsens our workforce shortages.\n\nThe reality is that undocumented…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688133/republican-budget-betrayal"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…Eddie Zhou; and members of the  Haynos family, Stephanie, Roger, and their son, Cory.\n\nWe take time to remember them today. I express my deep condolences to  their family. I reiterate my heartfelt thanks to the first responders  supporting this effort. They heard the call, and they rushed out  immediately, risking their lives in the deadly cold and the…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688368/expressing-condolences-to-the-families-friends-and-loved-ones-of-the-victims-of-the-crash-of-american-eagle-flight-5342-and-pat-25"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…Speaker, thank you very much. I am going to take  just a couple minutes to thank all of my colleagues from the  Congressional Black Caucus for being here this evening.\n\nTo reiterate a little of what we have heard here today, I represent a  congressional district in South Carolina that includes ZIP Code 29203.  It happens to be the ZIP Code that I live…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690244/health-disparities-in-minority-communities"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…fund the Department of Homeland Security, but only a  Department that is obeying the law, and for that reason, I would  object.\n\nMr. MURPHY. Mr. President, I just want to reiterate that we got the  language last night. We have been in a 2-week continuing resolution,  and last night, we got the first offer of legislation from the White  House.\n\nWe are…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700057/9999"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…Treasury  confirm that Trump has not decided whether to try to use what powers he  has as President to withdraw us from the IMF.\n\nMost significantly, Trump has refused to reiterate the policy that  the U.S. has had in place since 1979, standing with the people and  security of Taiwan. When asked if the U.S. will maintain its decades- old commitment…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692795/taiwan-non-discrimination-act-of-2025"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…fraud.\n\nI  know she has a trunk full of them.\n\nMs. KAMLAGER-DOVE. Mr. Speaker, I thank the Honorable Jasmine  Crockett for her remarks and for always keeping it real. I will  reiterate  some of the things that she said, which is that this administration has  been targeting Black Americans, possibly because they are so afraid of  our shine. This administration…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690637/trumps-first-100-days"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…receive the healthcare and benefits they need, earned, and deserve.\n\nHow will firing veterans responsible for caring for other veterans  make America greater?\n\nLast, I want to reiterate that what we do here at home reverberates  around the world. One of my constituents spent 10 years dedicating his  life to U.S. foreign policy at the State Department and…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688591/recognizing-federal-employees"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…consideration of H.R. 1, used  cost estimates based on something other than the section 257 baseline  to assess reconciliation legislation for compliance with the Byrd Rule.\n\nTo reiterate: in developing their guidance under the Byrd Rule, the  Parliamentarian's office has never--never--used cost estimates other  than those based on the section 257 baseline.…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693857/hr-1"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…WATERS.  Pressley), an unapologetic leader for justice.\n\nMs. WATERS. Mr. Speaker, may I inquire as to the time remaining.\n\nMs. WATERS.  Kamlager-Dove).\n\nMr. Speaker, let me reiterate: A vote for H.R. 3633 is a vote to give  Trump the pen to write the rules that would put more money into his  family's pockets. A vote for H.R. 3633 is a vote for increased…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693777/digital-asset-market-clarity-act-of-2025"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…fight. This is why I stand.\n\nMr. BOOKER. Yes, I will yield for a question while retaining the  floor.\n\nMr. BOOKER. First of all, thank you for the question. But I just want  to reiterate the friendship I have with Chris Murphy and his  willingness to spend the night with me here on the floor as we go hour  after hour after hour. I just want to say this again,…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…Members of Congress who helped to deliver a Republican  majority, many of us representing districts with high rates of  constituents who depend on Medicaid, we would like to reiterate our  strong support for this program . . . ''\n\nBy the way, it is a program that the one big, ugly bill now will cut  and devastate, gut, Mr. Speaker, by almost $1 trillion.…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…down at the point of sale. Unfortunately, my Democrat  colleagues refuse to recognize this basic truth, choosing instead to  label overdraft products as predatory.\n\nLet me reiterate that point, Mr. Speaker. Consumers choose to use  this service, and they opt into the service voluntarily.\n\nThe first option under the new rule forces financial institutions…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689846/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…enormous  sacrifice that law enforcement makes every single day in our community,  to acknowledge that sacrifice and to honor those heroes who are near  and far.\n\nIn closing, I reiterate my support for H. Con. Res. 9, which will  honor the fallen men and women serving our Nation as law enforcement  officers.\n\nMr. Speaker, I urge support of this resolution,…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689661/authorizing-the-use-of-the-capitol-grounds-for-the-national-peace-officers-memorial-service-and-the-national-honor-guard-and-pipe-band-exhibition"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…STAUBER. Mr. Speaker, I said it: Would it surprise you that the  Representative from the district supports the resolution?\n\nI talked about jobs and the economy. I am going to reiterate: NABTU,  the Operating Engineers, Teamsters, and the Iron Range Building and  Construction Trades have 3 million work hours, with an average mine  salary of $115,000. This…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699271/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…of a flawed  perpetual regulatory machine that prioritizes special interest agendas  over sound science and our soldiers' needs.\n\nMr. BIGGS of Arizona. Madam Chair, let me reiterate: Activist groups  exploit the ESA through relentless litigation and red tape, curtailing  and preventing full training and preparation by our military.\n\nThis amendment is…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695254/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "French Hill", "party": "Republican", "sentence": "…they facilitate a certain number of payments, but they are not  substantively the same. They can't be treated identically. That is a  huge flaw in this rule.\n\nMr. Speaker, I reiterate my support for Mr. Flood's support of S.J.  Res. 28. He has worked hard on this with Senator Ricketts from his home  State of Nebraska. They stand on the facts that a vote…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689950/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…United States does not stand for, does not support, and does not  condone a system of government that makes people poorer, less free, and  less safe.\n\nWith this resolution, we reiterate our Nation's commitment to  remaining a free and prosperous society.", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697155/denouncing-the-horrors-of-socialism"}, {"senator": "John Thune", "party": "Republican", "sentence": "Mr. THUNE. I would say to the Senator from South Carolina the answer  to that is yes.\n\nMr. THUNE. The answer is yes.\n\nMr. THUNE. Yes.\n\nMr. THUNE. Mr. President, let me just reiterate what the Senator from  South Carolina said, and that is that this measure that we passed does,  indeed, give important protections to Members. I think it is an  important…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697049/unanimous-consent-requests"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…Mr. Chair, may I inquire as to the time remaining.\n\nMr. BABIN. Mr. Chair, I yield 1\\1/4\\ minutes to the gentleman from  North Carolina (Mr. Rouzer).\n\nMr. BABIN. Mr. Chair, I reiterate exactly what we said in my opening  statement and what Mr. Rouzer has stated. Many times, the opposition  has nothing to do with clean water whatsoever. It has been weaponized.…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698037/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…colleagues. I know of no other requests for time.\n\nI yield back the remaining time.                        Vote on H.R. 5371, As Amended\n\nMs. COLLINS. Mr. President, I just want to reiterate my gratitude for  my colleagues, our staff who report night and day, literally, and to  all of those who have brought us to this point.\n\nWe are going to reopen government.…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696664/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…today and for generations yet to come.\n\nI urge all of my colleagues to support this bill. I even remember  where I was at that very moment.\n\nMr. Speaker, in closing, I want to reiterate the importance of the  1980 United States Olympic Hockey Team uniting during such a  challenging and turbulent period in American history. Their  unforgettable victory solidified…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695439/miracle-on-ice-congressional-gold-medal-act"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "…personally, about taking bills hostage. But this is a  process that has happened in the past over and over and over again.  This is how it is playing out.\n\nAs to these bills, I reiterate there is not one Republican Senator  objecting to them. Bring them forward. Let's pass them now. If there  are problems, I don't know what they are, why they would arise.…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691666/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…past  some of the policies that have been implemented, or not implemented,  from the previous administration. I am proud as we look out at his  first 100 days.\n\nAgain, to reiterate what has taken place with our southern border,  enforcing very commonsense laws such as making sure that our parole  authority is properly done, ending catch and release,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690427/the-first-100-days"}, {"senator": "French Hill", "party": "Republican", "sentence": "…leadership of  Mike Flood, the chair of our Subcommittee on  Housing and Insurance. They have collaborated for a year to bring these  proposals to the House floor today.\n\nI reiterate that the linkage of housing and community banking is two  sides of the same coin that leads to a better outcome, more choice,  more accessibility, more affordability, and…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…my colleagues to support the bill, and I  reserve the balance of my time.\n\nMr. DAVIDSON. Madam Speaker, I yield myself the balance of my time.\n\nMadam Speaker, in closing, I reiterate the importance of the 1980  Olympic men's ice hockey team uniting during such a challenging and  turbulent period in American history. Their unforgettable victory  solidified…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690279/miracle-on-ice-congressional-gold-medal-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…here in our country, and so we can utilize these abundant  resources that we have.\n\nMr. Speaker, I have no further requests for speakers.\n\nMr. Speaker, in closing, I will reiterate the fundamental fact of  this debate. In the 21st century, America's economy, military,  healthcare, communications systems, and transportation infrastructure  depend on…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699695/critical-mineral-dominance-act"}]