[{"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…already formed  engagements, let them be fulfilled with perfect good faith. Here let us  stop.\n\n``Europe has a set of primary interests, which to us have none, or a  very remote relation. Hence she must be engaged in frequent  controversies, the causes of which are essentially foreign to our  concerns. Hence therefore it must be unwise in us to implicate…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700271/president-washingtons-farewell-address"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…that needs to be said, yet our time is  coming to a close.\n\nLet me end by saying that when I was in college in the late 1970s, I  interned for Senator George McGovern, no relation, but a leader on arms  control issues. I was able to accompany him to a debate with William F.  Buckley at Yale University titled ``Resolved: That the SALT Talks Are  in the…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694117/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…beg you at the same time to do me the justice to be assured that  this resolution has not been taken without a strict regard to all the  considerations appertaining to the relation which binds a dutiful  citizen to his country--and that, in withdrawing the tender of service  which silence in my situation might imply, I am influenced by no  diminution…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700163/reading-of-washingtons-farewell-address"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…implement the bill while  improving customer service for the millions of Americans who rely on  Social Security. Until then, I will object to any unanimous consent  request in relation to this legislation.", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697776/claiming-age-clarity-act"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…without reasonable cause and in violation of the law in retaliation for  their legitimate investigatory and prosecutorial  work under prior administrations, including in relation to the January  6, 2021, attack on the United States Capitol and in retaliation for  attorneys upholding their ethical and legal obligations, including  candor and honesty…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691079/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…crisis, and bipartisan  outrage has erupted over language in this bill to pay millions of  taxpayer dollars to a handful of Senators whose phone records were  subpoenaed in relation to the January 6 investigation.\n\nIt is a bad bill, and I oppose it.", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696744/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…actions taken by the Federal banking regulators,       Financial Stability Oversight Council, Department of the       Treasury, and other relevant financial regulators in relation       to the failure of the insured depository institution; and\n\n``(hh) any additional relevant entities or activities that       may have contributed to the failure of the…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697286/systemic-risk-authority-transparency-act"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…about the amount of time.  It took 45 minutes.\n\nWhat we know from the time we did DNA testing, 30 percent of the  children that were DNA tested by border agents shared no relation to  the illegal aliens who were falsely--falsely--representing themselves  as family members. I think 45 minutes is worth it to save the life of a  child.\n\nAnd my PRINTS Act,…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688161/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Barry Moore", "party": "Republican", "sentence": "…five previous DUI convictions, a  Boulder, Colorado, county judge sentenced this illegal alien to  probation, community service, and work release on December 8, 2023, in  relation to two of those convictions, just 4 days before the drunk  driver crashed and killed the mother and her son.\n\nAnother case to consider is from Florida, where just earlier…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693084/jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…endless states of emergency without congressional  oversight in defiance of every principle I have ever fought for and to  surrender our own power as Members of the House in relation both to our  own leadership and the executive branch. That is something I was not  going to do. There was bipartisan support that this was not a good  idea.\n\nThe rule did…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700046/legislative-calendar-days"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…or a successor regulation), that--\n\n(A) is in interstate commerce; or\n\n(B) provides health care services in a manner that--\n\n(i) substantially affects or has a substantial relation to       interstate commerce; or\n\n(ii) includes use of an instrument (including an instrument       of transportation or communication) of interstate commerce.\n\n(3) Disability.--The…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692719/charlotte-woodward-organ-transplant-discrimination-prevention-act"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…shall determine       whether each of the following foreign persons has knowingly       engaged in significant acts of corruption, or acts of       violence or intimidation in relation to the blocking of Euro-      Atlantic integration in Georgia:\n\n(A) Any individual who, on or after January 1, 2014, has       served as a member of the Parliament of the…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690702/mobilizing-and-enhancing-georgias-options-for-building-accountability-resilience-and-independence-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…providing payments for legal support for  beneficiaries. This isn't to say that HVAC systems in a hot climate or  legal supports aren't important or may have some potential relation to  someone's health, but they fall far outside the scope of what Medicaid  is intended for. They open the door for States to draw down Federal  funds or for services that…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691874/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "William Timmons", "party": "Republican", "sentence": "…opportunities for Federal  supervisors.\n\nThe Federal Supervisor Education Act, a bipartisan bill dating back  to the 114th Congress, articulates and executes best practices in  relation to Federal supervisory training, including how to effectively  manage employees with unacceptable performance.\n\nThese are basic, nonpartisan concepts that are generally available…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698216/federal-supervisor-education-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…beg you, at the same time, to do me the justice to be assured  that this resolution has not been taken without a strict regard to all  the considerations appertaining to the relation which binds a dutiful  citizen to his country--and that, in withdrawing the tender of service  which silence in my situation might imply, I am influenced by no  diminution…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700272/president-washingtons-farewell-address"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…they didn't. The homeless population increased by some 50,000  individuals.\n\nWe have already seen charges brought in both San Francisco and  Florida when it comes to fraud in relation to the expenditure of funds  that were earmarked for homelessness. We have also seen convictions in  Orange County in connection, for example, with workers' compensation…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699151/misguided-policy-in-california"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "…that are more controversial, things on  which there might be sharp disagreements, sometimes sharply divided  down partisan lines, reflected based on where one's desk sits in  relation to the center aisle of this Chamber.\n\nOther times, there might be controversy, but the controversy doesn't  cut cleanly across party lines. We might have some Republicans…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698423/unanimous-consent-requests-the-calendar"}, {"senator": "French Hill", "party": "Republican", "sentence": "…actions taken by the Federal banking regulators,       Financial Stability Oversight Council, Department of the       Treasury, and other relevant financial regulators in relation       to the failure of the insured depository institution; and\n\n``(hh) any additional relevant entities or activities that       may have contributed to the failure of the…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "…subsistence resources, including       nutritional, resource use, and economic effects on       subsistence communities;\n\n``(iii) the relative magnitude of those impacts in relation       to past occurrences of hypoxia or harmful algal bloom events       that occur on a recurrent or annual basis; and\n\n``(iv) the geographic scope of the hypoxia or harmful…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695277/harmful-algal-bloom-and-hypoxia-research-and-control-amendments-act-of-2025"}]