[{"senator": "Al Green", "party": "Democrat", "sentence": "Mr. GREEN of Texas. Will the gentleman yield?\n\nMr. GREEN of Texas. Mr. Speaker, if I may, I want to let people know  this not just for the Honorable Chip Roy, but I have relationships with  people across all lines in this Congress. When he comes to the floor  and says that he wishes me safe travels, I want to let people know that  I will extend that…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693109/tax-cuts-and-spending"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…can be       easily filled, and require a personal relationship between       the staff and the residents that are forged over months and       years together. When these relationships are lost the       residents suffer.\n\nA staffing shortage like this creates a domino effect that       will impact resident care for the foreseeable future. This…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699720/witness-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…funding for the Ukraine  Security Assistance Initiative.\n\nThroughout generations, the fundamental purpose of our Nation is to  guarantee liberty, to develop the kinds of relationships with our  democratic allies who stand with us against tyranny in any form, and to  fill our constitutional duty to provide for our Nation's common  defense. Common defense,…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693693/department-of-defense-appropriations-act-2026"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…years,  they have partnered with my office for our annual Fish `n' Kids and  Kids `n' Kites events, which give kids the opportunity to engage in  outdoor activities, build relationships with local law enforcement, and  interact with members of the community.\n\nMr. Speaker, I am proud of the work that Baldwin and Crystal Hamilton  and It's About the Kids…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692965/recognizing-the-work-of-the-its-about-the-kids-mentor-program"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…course, have thousands of American troops and  soldiers and airmen in Qatar today.\n\nAnd so what we need to say here is not that we are going to  permanently pause our military relationships with these countries, but  for the time being, while these two nations are willing to pay the  President tribute, we cannot endorse or condone business as usual.\n\nThese…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692362/motion-to-discharge-sj-res-54"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…that valuable--in fact, precious--partnership.\n\nThese tariffs are going to hurt all Americans. We have with Canada  one of the most comprehensive and important trading relationships. I  can go into the numbers. In 2024, Canada was the United States' second  largest trading partner, with $761.2 billion in total trade--the  largest single U.S. export…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689487/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…one-third of 1 percent--that we spend on those  programs has an incredible yield not just in doing good works around  the world, but have been doing good for America because of  relationships that are forged through those programs. The respect that  is forged through those programs comes back to benefit us in all kinds  of cooperation on a huge range of diplomatic…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693589/rescissions-act-of-2025"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…talk with a bank manager on the telephone with  these menus that they have? They run you around from so-called  extension to extension to extension. You lose all of these  relationships.\n\nIn fact, while thousands of bank mergers were approved in the last  few decades, the last bank merger application that regulators denied  was denied in 2003, 22 years…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691499/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…achieving youth from both Germany  and the United States to live in each other's country for one academic  year. During their year abroad, students will foster meaningful  relationships between America and Germany, while giving participants  new perspectives on peoples and cultures beyond their own. Many CBYX  alumni go on to distinguished careers in foreign…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693200/recognizing-emiko-mukai"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…fifth of the national forest, approximately 10 million acres in  Washington State.\n\nThe U.S. Forest Service manages these public lands. We also have  agreements and rely on relationships between Federal, State, and Tribal  organizations and governments to manage our public land. When you cut  Federal staffing, it really has ripple effects and leaves State,…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689811/cuts-to-forest-service-endanger-millions"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…the market if another tariff change is inputted and so forth?\n\nEveryone in the agricultural world is terrified that, if they lose  their market, even temporarily, those relationships deteriorate. When  new relationships are forged, it is hard to get people back. If you  have let people down once, then what happens next?\n\nSo this is the situation--this…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…economies and supports hundreds of thousands of  jobs across the continent and the United States. I can think of no  better way for America to continue to expand its trade relationships  with Africa than reauthorizing this very important piece of  legislation.\n\nMadam Speaker, I again ask my colleagues to vote in favor of this  reauthorization and extend…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698903/agoa-extension-act"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…reaffirm the United States as a trusted ally to Pacific Island  nations, help strengthen regional stability and reinforce our  leadership in a part of the world where long-term relationships are  built on trust, continuity and cultural understanding.\n\nI urge my colleagues to join me in supporting this legislation--for  the future of American fisheries, for…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691007/south-pacific-tuna-treaty-act-of-2025"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…line in the sand and saying you  cannot abuse your emergency powers to start an unjustified trade war;  you cannot abuse your emergency powers to hurt one of the finest  relationships in the world; and you cannot drive up prices, eliminate  jobs, and put in place a national sales tax that experts now predict  will altogether--the tariff tax--cost the…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696446/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…in our universities. No one is  against that. No one. That is why I am introducing amendments to this  bill to ensure that transparency around our universities and the  relationships with so-called countries of concern include countries  whose leaders have active arrest warrants issued against them by the  International Criminal Court, to include countries…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689027/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Also, under the Trump National Security Strategy, the United States  will expand our goals and partners in the Western Hemisphere by  bringing in new countries, building new relationships, bolstering  America as the top choice as a security and an economic partner.\n\nThe strength of the Trump administration, combined with the  exceptional execution by our…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698884/successful-operation-to-arrest-nicolas-maduro"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…states covering 88 Members of Congress. Kyle built, promoted, and  facilitated lines of communication between Congress and the Army that  were instrumental in maintaining relationships between the executive  and legislative branches. Through his ability to clearly define the  Army's message and help navigate the needs of Congress to provide  essential…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694098/recognizing-the-service-of-lieutenant-colonel-kyle-frazer"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…prestigious program is run by the Rocklin Area Chamber of Commerce and  provides an opportunity for participants to build upon their leadership  skills while developing meaningful relationships with community and  local business leaders.\n\nThe areas of learning for this program include leadership skills in  theory, education, volunteerism and community service,…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Steve Womack", "party": "Republican", "sentence": "…street, both reflect and shape the culture in  each of our communities.\n\nThese establishments aren't just places to enjoy a good meal. They  are where we foster and grow relationships. From catching up with  friends to shaking hands on new business to marking some of life's  biggest accomplishments--birthdays, anniversaries, graduations, and  promotions.…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698968/tipped-employee-protection-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…of it all is Shawn  Woodruff, a humble and passionate leader whose tireless efforts and  deep compassion inspire everyone around her. She coordinates logistics,  builds relationships, and ensures every person served is treated with  dignity and grace. Her vision has created a ripple effect of kindness  that continues to grow. Nature Coast Outreach Center…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691893/recognizing-shawn-woodruff"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…loyal, caring, and pleasant to  everyone he meets. He has a deep faith that stands him in good stead.\n\nDuring his time at Farm Credit, he built long-lasting friendships and  relationships with the people Farm Credit is proud to serve, and he  created long-lasting value every step of the way.\n\nMr. Speaker, everyone who is fortunate enough to have worked…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697290/recognizing-valencia-abbott"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…responsibility.\n\nBig Tech has become a digital fentanyl that is slowly killing our  children. It is pushing parents to the sidelines. It is acting as  therapists. It is replacing relationships with robots. This must stop.\n\nParents are fighting a system designed to replace them. Algorithms  and chatbots fuel addiction, depression, self-harm, and even suicide,…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699340/repeal-section-230"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…now  so widespread that nearly three quarters of teens have used AI  companions, and of these users approximately one in three have used  them for social interactions and relationships to include the more than  one in ten who sought emotional or mental health support.\n\nThat is why I proudly introduced H.R. 7045, the Promoting Responsible  Online Technology…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699543/true-cost-of-big-tech"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…expected to raise  here on the floor of the Senate.\n\nIn my time here in the Senate, over the past two decades, I have  immersed myself in all things Arctic. I have strong relationships with  friends across the Arctic and in Greenland, specifically. I have been  the cochair of the Arctic Parliamentarians Conference for years now,  and my cochair is a strong…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698821/9999"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…organizing special build days with local elected officials and  continues to make vital community connections to grow the affiliate's  presence. Charlie has continued to build relationships with local  government members and stresses the need for private and public  partnerships. As Habitat's footprint continues to grow throughout its  service area, Charlie…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690164/recognizing-charles-a-rogers"}, {"senator": "French Hill", "party": "Republican", "sentence": "…was a gentle giant. I had so much fun with him over the years. He  was such a committed person to his constituents, to the State of  California, to public service, to his relationships on both sides of  the aisle. He had deep respect. From the most liberal Democrat in  California to the most conservative Republican down in Texas, they all  loved Doug…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698914/warmth-of-collectivism"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…``(5) encourage, as appropriate, United States allies and       partners to oppose the People's Republic of China's efforts       to undermine Taiwan's official diplomatic relationships and       its partnerships with countries with which it does not       maintain diplomatic relations.''.       SEC. 5. REPORT ON THE PEOPLE'S REPUBLIC OF CHINA'S ATTEMPTS…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690676/taiwan-international-solidarity-act"}, {"senator": "Mike Simpson", "party": "Republican", "sentence": "…Star Families, Mountain  Home Airforce Base, and Chobani military employees.\n\nThe collaborative efforts among these groups have strengthened  military families, created new relationships, and better supported  those who serve us.\n\nThroughout the years, Chobani has done incredible work to support  families in the Magic Valley and throughout our country.…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690811/recognizing-chobanis-military-appreciation-efforts"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…initiatives that I have brought to  the Congress in a bipartisan way over the years. It calls upon all of  us to mark Choose Respect Day by teaching our youth about healthy  relationships, supporting survivors, honoring those we have lost, and  recommitting ourselves to the fundamental truth that every person  deserves to live in freedom from violence and…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695990/supporting-the-goals-and-objectives-of-choose-respect-day"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…both a  financial and a lifestyle investment. Through his guidance, the company  has earned a reputation not only for its design expertise but also for  its enduring client relationships through many generations.\n\nNow, as Bucks Country Gardens enters a new chapter, Mr. Hebel looks  with pride to his sons, Gregory and Ryan Hebel, who together represent…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696583/recognizing-bucks-country-gardens-president-tom-hebels-retirement-after-years-of-service"}]