[{"senator": "Jamie Raskin", "party": "Democrat", "sentence": "The police department said that the additional detective would build  trust with community members, increase patrols in hot spot areas,  enhance crime prevention, and sustain a reduction in violent crime in  narcotics-related crime.", "title": "Federal Law Enforcement Officer Service Weapon Purchase Act of 2025", "date": "2025-05-15"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "Third, while this NDAA repeals the 1991 and 2002 Authorizations for  Use of Military Force (AUMF) related to U.S.", "title": "Disinterment of Remains of Fernando V. Cota From Fort Sam Houston National Cemetery, Texas", "date": "2025-12-11"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "(b) Transportation for Illegal Sexual Activity and Related       Crimes.--\n\n(1) In general.--Chapter 117 of title 18, United States       Code, is amended by adding at the end the following:       ``Sec.", "title": "Statements on Introduced Bills and Joint Resolutions", "date": "2026-02-10"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "The amendment  literally said: To strike the section related to reconciliation  instructions to the Committee on Energy and Commerce of the House of  Representatives to cut $880 billion from Medicaid.", "title": "Defending Social Services and Programs", "date": "2025-04-08"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "To shed light on this  descent into authoritarian darkness, to let the American people know  how their own government is centralizing their personal data, I  introduced a resolution of inquiry demanding that the administration  produce all the information related to the creation of this vast  searchable database with its handpicked contractor, Palantir, a company  that one Silicon Valley executive accused of building the  infrastructure of the police state.", "title": "Providing for Consideration of H.R. DC Criminal Reforms to Immediately Make Everyone Safe Act; Providing for Consideration of H.R. District of Columbia Policing Protection Act; Providing for Consideration of H.R. Lowering Age At Which A Minor May Be Tried As Adult for Certain Criminal Offenses in District of Columbia; Providing for Consideration of H.R. District of Columbia Judicial Nominations Reform Act; Providing for Consideration of H.R. Guaranteeing Reliability Through the Interconnection of Dispatchable Power Act; Providing for Consideration of H.R. National Coal Council Reestablishment Act; Providing for Consideration of H.R. Promoting Cross-Border Energy Infrastructure Act; and for Other Purposes", "date": null}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "Americans reasonably question whether this imbalance helps explain  why policies related to taxes, healthcare, corporate regulation, and  environmental protection so often favor powerful interests over working  families, families who are struggling with an affordability crisis that  this administration has exacerbated.", "title": "Citizens United 16th Anniversary", "date": "2026-01-21"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "Members of organized labor  created apprenticeship programs to ensure we had the workforce to bring  this project to fruition, but the so-called big, beautiful bill  terminated the clean hydrogen production tax credit, causing BP to put  the project on indefinite pause for reasons related to economic  uncertainty.", "title": "Devastating Harm Caused By Trump Administration", "date": null}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "Lois Frankel), the distinguished ranking member of the  National Security, Department of State, and Related Programs  Subcommittee.", "title": "Department of Homeland Security Appropriations Act, 2026", "date": "2026-01-22"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "It is instead to cease rewarding our adversaries and  start incentivizing our international friends and allies to assist us  with our domestic merchant marine and related defense sealift needs.", "title": "Introduction of the Merchant Marine Allies Partnership Act", "date": "2025-08-01"}, {"senator": "Eric Sorensen", "party": "Democrat", "sentence": "While we are thankful that survival rates  for many pediatric cancers have improved to over 85 percent, cancer  remains the leading cause of disease-related death among children, and  hematologic conditions continue to require complex, coordinated, and  long-term care.", "title": "Recognizing Childhood Cancer Awareness Month", "date": null}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "When       we talk about environmental justice, we are talking about       mining-related pollution in Appalachia.", "title": "Greenhouse Gas Reduction Fund", "date": "2025-07-09"}, {"senator": "Rick Larsen", "party": "Democrat", "sentence": "section of the International Boundary  and Water Commission, or IBWC, in carrying out its critical water- related missions.", "title": "International Boundary and Water Commission Authority", "date": "2025-06-09"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "It will also allow for  disclosure of certain information related to drug formulations to  generic drug manufacturers to bring lower-cost medications to patients  more quickly.", "title": "Mikaela Naylon Give Kids A Chance Act", "date": "2025-12-01"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "Unfortunately, in its fiscal year '26 budget request, the  administration proposed to virtually eliminate funding for clean water- related infrastructure projects, but it also proposes to cut the  Technical Assistance for Treatment Works Grant Program by over 60  percent.", "title": "Water Resources Technical Assistance Review Act", "date": null}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "An RMP       generally establishes land use designations; allowable       resource uses, resource conditions, goals, and objectives;       program constraints and general management practices; areas       to be covered by more specific plans; and other related       information.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the Bureau of Land Management Relating to ``North Dakota Field Office Record of Decision and Approved Resource Management Plan''", "date": null}, {"senator": "Russell Fry", "party": "Republican", "sentence": "``(B) Arrests for level a offenses.--A person arrested for       any level A offense (or an attorney representing such a       person) may move the district court of the United States for       the district and division embracing the place where the       person was arrested to expunge all records of the arrest if       the conduct or alleged conduct of the person that resulted in       the arrest was directly related to the person having been a       victim of trafficking.", "title": "Trafficking Survivors Relief Act", "date": "2025-12-01"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "The listing was based on flawed science in response to an ESA-related  lawsuit and adds yet another piece of regulatory red tape preventing  water from reaching California's Central Valley and communities further  south.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the United States Fish and Wildlife Service Relating to ``Endangered and Threatened Wildlife and Plants; Endangered Species Status for the San Francisco Bay-Delta Distinct Population Segment of the Longfin Smelt''", "date": "2025-05-01"}, {"senator": "John Thune", "party": "Republican", "sentence": "Now it is ending an emergency related to  fentanyl.", "title": "Terminating the National Emergency Declared to Impose Duties on Articles Imported From Canada", "date": "2025-04-02"}, {"senator": "Ashley Moody", "party": "Republican", "sentence": "Then I hear dire language from the speaker before me--using the term  ``death warrant'' as it related to an issue--but they won't fully  engage and stand up against those who are supporting groups that are  targeting our heroes.", "title": "Halo Act", "date": "2025-12-04"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "(e) Costs.--In addition to the fair market value determined       under subsection (d), the buyer shall pay all costs related       to the applicable conveyance of the reversionary inter est,       including all surveys, appraisals, and other administrative       costs.", "title": "Reversionary Interest Conveyance Act", "date": "2025-05-13"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "(3) Flight logs or travel records, including but not       limited to manifests, itineraries, pilot records, and customs       or immigration documentation, for any aircraft, vessel, or       vehicle owned, operated, or used by Jeffrey Epstein or any       related entity.", "title": "Epstein Files Transparency Act", "date": "2025-11-18"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "331) to amend the       Controlled Substances Act with respect to the scheduling of       fentanyl-related substances, and for other purposes.", "title": "Providing for Consideration of H.R. Prohibiting Voting By Noncitizens in District of Columbia Elections; Providing for Consideration of H.R. District of Columbia Federal Immigration Compliance Act of Providing for Consideration of H.R. Protecting Our Nation's Capital Emergency Act; and Providing for Consideration of S. Halt All Lethal Trafficking of Fentanyl Act", "date": "2025-06-10"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "Certain budgetary changes related to reconciliation\n\nlegislation pursuant to section 3001 of H.Can.", "title": "Fiscal Year 2025 Enforcement Filing", "date": "2025-05-21"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "2.6 Personal security services means services provided by a       personal security entity that may include the continuous       protection of the Member, the continuous protection of the       Member's residence(s) regardless of the Member's physical       location, secure transportation, and travel-related measures       designed to support threat mitigation.", "title": "U.S. Senate Member Protection Regulations", "date": "2025-12-11"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "In this capacity, Walt worked  tirelessly to assist Veterans and Servicemembers in navigating the  complexities of federal benefits, healthcare, and other issues related  to the Department of Veterans Affairs.", "title": "Recognizing the Life and Service of United States Army Veteran Walt Hartnett", "date": "2025-06-12"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "There was an additional $31 million cost for related  expenses, primarily the provision of Federal meeting space.", "title": "Protect America's Workforce Act", "date": "2025-12-11"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "7006, the Financial Services and General Government and  National Security, Department of State, and Related Programs  Appropriations Act for fiscal year 2026.", "title": "Providing for Consideration of H.R. Financial Services and General Government and National Security, Department of State, and Related Programs Appropriations Act, 2026", "date": "2026-01-14"}, {"senator": "Chuck Fleischmann", "party": "Republican", "sentence": "As chairman of  the Energy and Water Development and Related Agencies Subcommittee, I  worked hard to ensure this bill includes many House Republican  priorities.", "title": "Commerce, Justice, Science; Energy and Water Development; and Interior and Environment Appropriations Act, 2026", "date": "2026-01-08"}]