[{"senator": "Jared Huffman", "party": "Democrat", "sentence": "…homelands, and the United States has a  government-to-government responsibility to work with them. Unrelated  policy disagreements should never be used to undermine that  relationship.\n\nThe Miccosukee Tribe has worked for generations to protect their  homelands within the Everglades. H.R. 504 would ensure that a historic  Tribal village is protected,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698657/miccosukee-reserved-area-amendments-act-veto-message-from-the-president-of-the-united-states"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…representative entities for  the largest groups of our country's own indigenous peoples. This will  help more directly link our Nation's indigenous peoples with efforts to  build relationship with those in other countries.\n\nThis bill would also require our Foreign Service Officers to be  trained on the history and culture of indigenous communities that  reside…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689274/indigenous-diplomacy-and-engagement-act"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…Security funding from colleges and  universities with a Confucius Institute, which is known to have CCP  ties, but it expands the prohibition to any institution that has a  relationship with a Chinese entity of concern.\n\nWhat is a Chinese entity of concern? Because a bill defines such  entities so broadly, that list could potentially include every single…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690824/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…that is--says: ``Trump fires back at Elon. The online battle  begins.''\n\nElon Musk says: ``Such an obvious lie. So sad.''\n\nWe are all sad, right? It is always sad when a relationship ends.\n\nMr. Speaker, I think this is when things really got heated. This is  why things are really hard when there is a breakup and there is a love  triangle with the GOP.…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692039/consequences-of-doge"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…other administration, would be  roundly criticized and rejected by this body. And we have seen nominees  whose chief qualification is nothing other than loyalty to and  relationship to Donald Trump.\n\nSo later today, we are going to consider just the latest example of  this when the Senate takes up the nomination of Eric Tung to serve on  the Ninth Circuit…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696538/government-funding"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…Throughout my career, I have worked to support all individuals when  they need emergency assistance, often through no fault of their own. I  also appreciate the longstanding relationship with the Food Bank of  Northwest Indiana and other organizations that are responsible for  distributing these essential food benefits.\n\nThese cuts are being pushed under…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692186/slashes-to-snap-benefits"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…truth is that his nomination was doomed, regardless. I would say  that all of these disqualifications by themselves pale in comparison to  Mr. Martin's long and troubling relationship with a Hitler-loving neo- Nazi named Timothy Hale-Cusanelli, who was sentenced to 4 years in  prison for breaching the Capitol during the January 6 attack.\n\nHale-Cusanelli…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691194/calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism-and-educate-the-public-on-the-contributions-of-the-jewish-american-community"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…security staff, Trump has repeatedly used the U.S. military to  commit reckless and even illegal acts that imperil our security, weaken  our status in the world, hurt our relationship with our closest allies,  and endanger our own citizens.\n\nThe President claims to have broad, undefined, and unchecked  executive power. He has installed corrupt and incompetent…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695109/providing-for-consideration-of-hr-streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-and-providing-for-consideration-of-hr-stop-illegal-entry-act-of-2025"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…Wall  Street. It will not be because the wolves of Wall Street have become  lambs. It will be because they defunded the police of Wall Street.                         Our Relationship with China\n\nMr. Speaker, a lot of attention is being spent here in Congress on  China. With 28 years of experience on the Foreign Affairs Committee, I  would like to address…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688265/problems-caused-by-doge-cuts"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…that shared responsibility to spend that money wisely. But even in the  early years that I was here in the Senate, we were starting to see  signs of the breakdown of that relationship.\n\nIn the last conversation I had with Senator Hatfield before he passed  away, he said: What happened to the Appropriations Committee?\n\nNow, Senator Hatfield was a Republican,…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693589/rescissions-act-of-2025"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…of 1947. Donald John Trump threatened the following:\n\nOne, annexation of the sovereign country of Canada. Donald John Trump  has negatively impacted the deep and historic relationship between the  United States and Canada by stating numerous times that Canada should  become the 51st State, under the threat of both economic coercion and  military force;…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691079/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…debate that we are in.\n\nWhat I don't like, though, Mr. Speaker, was the tariff proposal that  was so aggressive and coming down at us so fast and hard. I value so  much my relationship and the leadership of Shawn Fain at the UAW, the  United Auto Workers union. I was looking at this and saying: Maybe we  can finally start to get our fair share. Maybe we…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689752/reflecting-on-americas-history"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…has indicated that he  may intend next to send U.S. citizens into those same prisons?\n\nThis information will be very relevant to important decisions that we  take in our relationship with El Salvador and also in our decisions we  take with respect to the Appropriations Act. So I urge my colleagues to  vote for S. Res. 195.\n\nMr. KAINE. Mr. President,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691406/motion-to-discharge-s-res-195"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…integrating collections to produce dynamic exhibits for an       engaged community.\n\n``We're not just buying real estate,'' Wartenberg Kagan       said. ``We're buying a relationship.''\n\nBut as one relationship begins, another ends. The American       Numismatic Society traces its origins to 1858, when a teenage       boy named Augustus B. Sage invited…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697235/priceless-coin-collection-heads-to-the-toledo-museum-of-art"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…to be thousands of  children--traumatized children, children with serious mental illness,  with cycles and histories of abuse in their households--who have  created this relationship with an adult--this adult who is helping them  address their potential tendency to act out in violent ways due to  their mental illness, their trauma. And one day, these…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690948/gun-violence"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…work in the program's  respective countries.\n\nAs co-chair of the German-American Caucus, I am proud to support the  CBYX program and will continue working to strengthen the relationship  between our two great nations.\n\nThe CBYX program is a great opportunity for participants to gain a  new perspective on global affairs and politics and immerse themselves…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700248/recognizing-congress-bundestag-youth-exchange-program"}, {"senator": "Adrian Smith", "party": "Republican", "sentence": "…the global trading system.\n\nWhile Canada is one of our most important allies and trading  partners, and a friend, there have been a number of irritants in our  economic relationship. Under President Trump's leadership, we have seen  this change, most recently when Canada removed its discriminatory  digital services tax.\n\nThese productive--and I will…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699963/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…report their  data.\n\nTo help bring an end to trafficking at the border, I also introduced  the End Child Trafficking Now Act, which would require a DNA test to  determine the relationship between illegal aliens at the border and any  accompanying child. Now, it is so important to note, I have introduced  this bill before, and I did it because during the Trump…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688161/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…House Resolution 377, I call up  the bill (H.R. 881) to establish Department of Homeland Security  funding restrictions on institutions of higher education that have a  relationship with Confucius Institutes, and for other purposes, and ask  for its immediate consideration in the House.\n\nThe Clerk read the title of the bill.\n\nMr. PFLUGER.  881.\n\nMr.…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690828/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…indefinitely.\n\nMr. Speaker, I understand that you have to go back to Jefferson's  Manual and old practices to figure that out. Yet, that is, in essence,  what this rule does in relationship to the resolutions that have been  discussed being laid on the table and not being brought up.\n\nMr. Speaker, I will talk about proxies for a minute, if I might. I  have…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689405/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "David Rouzer", "party": "Republican", "sentence": "…the damage  done during this era. Since then, Congress has stepped in, reversed its  previous actions, and recognized 23 Tribes through legislation  reestablishing their relationship with the Federal Government.\n\nLegislation to rectify this for the Lumbee Tribe has been introduced  in Congress more than 30 times with broad bipartisan support. In the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695245/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…consultation process that involves       opposition parties and civil society organizations, which the       people of Georgia have freely elected to pursue;\n\n(4) to reevaluate its relationship with the Government of       Georgia and review all forms of foreign and security       assistance made available to the Government if it takes the       required steps--…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690702/mobilizing-and-enhancing-georgias-options-for-building-accountability-resilience-and-independence-act"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…Virginia Beach constituent, Rabbi  Dr. Israel Zoberman of Temple Lev Tikvah, and are a reflection of his  views:\n\nIsrael At 77--How poignant to affirm the special       relationship between the U.S. and Israel, two close       democratic allies, in our own Hampton Roads and Commonwealth       of Virginia! Hampton Roads' military might is ever ready…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690665/israel-at-77"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…governments, and Alaska Native       corporations established by Congress to serve our indigenous       constituents. For millennia, Inupiaq ingenuity has       transformed our relationship with industry into a partnership       that has both protected our environment and our way of life       and has brought significant economic benefits to the region…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696449/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…prepared close.\n\nMr. STEIL. Madam Speaker, I would like to say, once again, I thank my  colleagues, Representative Houlahan and Representative Fitzpatrick, and  my long working relationship with Ranking Member Morelle for being able  to bring this to the floor.\n\nIt is correctly noted that as we approach the 250th anniversary of  the United States of America,…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688218/procurement-and-placement-of-statue-of-benjamin-franklin-in-the-united-states-capitol"}, {"senator": "James Risch", "party": "Republican", "sentence": "…delegation from  Saudi Arabia visiting Washington, DC, right now. They are a long, long- term ally of the United States going back almost 100 years. We have had  a long relationship with them.\n\nCertainly, nothing I am saying here is to denigrate the murder of  Jamal Khashoggi. That happened. There is absolutely no question about  it. But nothing that--this…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697011/9999"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…Kerry. It is sad to see that. I think it says a lot about the  origination of this bill, the heart of this bill. This is not a  handshake. It is an embrace of somebody with a relationship. That is  what happens.\n\nIf somebody puts their arm around me, that means they have a  relationship with me. To me, this says a lot about who this bill stands  shoulder…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698249/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Ronny Jackson", "party": "Republican", "sentence": "…locations around the  world. As the official spokesperson for the base, Mr. Woodward advised  the commanding general on the effects of policies and actions on the  base's relationship with internal and external audiences and was  responsible for testing and executing crisis communication plans and  procedures, serving as the base liaison with state and…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693070/recognizing-the-career-of-mr-george-woodward"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…Kaysville, Utah, as a city  councilman and a mayor. This is an adjacent community to Hill Air Force  Base. During this time, he ensured that the community fostered a strong  relationship with the base.\n\nAfter serving in elected office, Steve remained highly integrated in  the Hill community by serving as the vice president of the Utah Defense  Alliance,…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699280/highlighting-republican-successes-in-2025"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…meaningful change in  U.S. access to the Arctic.\n\nThat is the definition of ``allies''--plural--because this is about  more than Greenland. It is about more than America's relationship with  its highly capable Nordic allies. It is about whether the United States  intends to face a constellation of strategic adversaries with capable  friends or to commit…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699111/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}]