[{"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…nation, to support a Democratic transition, one that is       led by Haitian civil society. And just this month, I voted to       pass legislation to strengthen Haiti trade relations and to       support its economy. Despite these efforts, we know there is       much more work to do, and I'll not stop fighting, and I'm       grateful to all those who…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699707/congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…border czar  Tom Homan.\n\nIn fact, I will say that when I visited my ICE facilities in Santa  Ana a few weeks back, I was repeatedly lied to, including having ICE  government relations people tell me that there had been zero  warrantless raids in Orange County by ICE, DHS, or CBP and that zero  complaints had been filed or litigation filed against ICE in…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695089/congratulating-colonel-dominic-v-dinh-on-his-retirement"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…for Taiwan, and  help counter Beijing's coercive influence around the world.\n\nU.S. policy toward Taiwan remains consistent across administrations  and guided by the Taiwan Relations Act. What has changed, though, is  Beijing's increasingly aggressive international campaign to exclude  Taiwan from the international community through intimidation, coercion,…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690674/taiwan-international-solidarity-act"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…these statements legitimize violations of the  fundamental principles of Pax Americana and the U.N. Charter. Namely,  the rules of the jungle no longer apply to international relations-- that might does not make right and that powerful nations cannot employ  force to redraw international borders at will.\n\nIt is bad enough that the Trump administration is…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688107/marking-third-anniversary-of-unprovoked-russian-invasion-of-ukraine"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…Society, where she focused on cancer  prevention for medically underserved communities and ultimately served  as the organization's national vice president for government relations.  During her tenure at Cornerstones, she has guided the nonprofit through  a period of remarkable growth and strengthened its role as an  indispensable resource for our region.…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697126/recognizing-cornerstones-ceo-kerrie-wilson-on-the-occasion-of-her-retirement"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…powerhouse in the 21st century.\n\nTherefore, it is in America's national interest to strengthen our  ties with the region and encourage this growth by deepening our trade  relations. If we don't nurture this important relationship, China and  others will. We can ill afford to allow others to fill the void.\n\nAGOA is more than just about tariffs and duty-free…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698903/agoa-extension-act"}, {"senator": "Lizzie Fletcher", "party": "Democrat", "sentence": "…arrived in Washington, D.C., in 2011, after graduating cum  laude from the University of Southern California with a Bachelor of  Arts in Middle East Studies and International Relations. Sarah brought  her passion and deep commitment to public service to her work at the  Woodrow Wilson International Center for Scholars. That commitment  guided her to the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695833/recognizing-sarah-kaplan-feinmann"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…Mr. MERKLEY. Absolutely.\n\nMr. MERKLEY. I so much appreciate the good report and question from  my colleague from New Hampshire and appreciate her leadership on the  Foreign Relations Committee as the top Democrat, working hard to  partner across the aisle for the common cause of international  security.\n\nEvery time I think about Ukraine, I think about…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…organizations make America stronger? It doesn't.  How does cutting off funding for joint USAID-DOD programs with Vietnam,  on the 30th anniversary of the normalization of relations with that  former enemy, which is now a Comprehensive Strategic Partner, advance  U.S. national security? It doesn't.\n\nAnyone can see that Moscow is celebrating these reckless…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688467/usaid"}, {"senator": "Eric Swalwell", "party": "Democrat", "sentence": "…visibility of  women's sports nationwide.\n\nMichelle's contributions extend beyond her work as a journalist. She  also has demonstrated her leadership and service in public relations at  San Jose State University and the Alameda County Office of Education.  Her dedication to public service further includes her tenure as an  elected official on the Zone…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689730/9999"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…been witnesses to the formation of  two treaties, that with Great Britain and that with Spain, which secure  to them everything they could desire, in respect to our foreign  relations, towards confirming their prosperity. Will it not be their  wisdom to rely for the preservation of these advantages on the Union by  which they were procured? Will they not…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700163/reading-of-washingtons-farewell-address"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "Mr. MURPHY. Mr. President, pursuant to section 36(b) of the Arms  Export Control Act, I move to discharge the Committee on Foreign  Relations from further consideration of S.J. Res. 54, as provided under  the previous order.\n\nMr. MURPHY. Mr. President, I am bringing before the Senate an  opportunity for us to take…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692362/motion-to-discharge-sj-res-54"}, {"senator": "Jon Ossoff", "party": "Democrat", "sentence": "…seeking further  information from the administration in order to determine whether these  strikes were effective.\n\nTonight, I voted to discharge S.J. Res. 59 from the Foreign Relations  Committee. Such discharge would require the Senate to debate whether  congressional authorization should be required for any further  offensive military action against Iran.…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693087/sj-res-59"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…Reduced services, longer wait times, staff       reductions, and the potential closure of programs and       facilities,'' Daniel Keenan, vice president of government       relations at Trinity Health of New England, stated in emailed       comments.\n\nKeenan pointed to emergency rooms as an example. When       people don't have coverage, they turn to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694776/congress-long-to-do-list"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…staffs, Peace Corps and  International Monetary Fund officials, global business leaders, and  other professionals dedicated to promoting American interests and  diplomatic relations.\n\nThrough DACOR and the DACOR Bacon House Foundation, which host  regular educational discussions, policy programs, leadership  development opportunities, and musical events,…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692065/recognizing-the-dacor-bacon-house-bicentennial-day"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…including on something as sophisticated and cutting edge as  artificial intelligence, has to be shared and will be shared with their  military.\n\nOn Tuesday, the Senate Foreign Relations Committee Subcommittee on  East Asia, the Pacific, and International Cybersecurity Policy held a  hearing on China's challenge to America's leadership when it comes to  artificial…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697555/china"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…SEC. 3. DEFINITIONS.\n\nIn this Act:\n\n(1) Appropriate committees of congress.--The term       ``appropriate committees of Congress'' means--\n\n(A) the Committee on Foreign Relations and the Committee on       the Judiciary of the Senate; and\n\n(B) the Committee on Foreign Affairs and the Committee on       the Judiciary of the House of Representatives.…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690630/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…clean up a bloated Federal bureaucracy.\n\nSpecifically, this legislation would nullify President Trump's  executive order titled ``Exclusions From Federal Labor-Management  Relations Programs.'' The executive order wisely designated various  agencies as having a national security focus as their primary functions  and exempts them from collective bargaining.…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697995/protect-americas-workforce-act"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…committees.--The term       ``appropriate congressional committees'' means--\n\n(A) the Committee on Foreign Affairs of the House of       Representatives;\n\n(B) the Committee on Foreign Relations of the Senate;\n\n(C) the Committee on Financial Services of the House of       Representatives;\n\n(D) the Committee on Banking, Housing, and Urban Affairs of       the Senate;…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694815/haiti-criminal-collusion-transparency-act-of-2025"}, {"senator": "James Risch", "party": "Republican", "sentence": "…during which the sale may be  reviewed. The provision stipulates that, in the Senate, the  notification of proposed sales shall be sent to the chairman of the  Senate Foreign Relations Committee.\n\nIn keeping with the committee's intention to see that relevant  information is still available to the full Senate, I ask unanimous  consent to have printed in…", "date": "2025-07-28", "source_url": "https://justfacts.votesmart.org/public-statement/1694285/arms-sales-notification"}, {"senator": "James Risch", "party": "Republican", "sentence": "…during which the sale may be  reviewed. The provision stipulates that, in the Senate, the  notification of proposed sales shall be sent to the chairman of the  Senate Foreign Relations Committee.\n\nIn keeping with the committee's intention to see that relevant  information is still available to the full Senate, I ask unanimous  consent to have printed in…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695536/arms-sales-notification"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…Connecticut and later returned to Pennsylvania and worked for the  Williamsport Sun-Gazette as a photographer. In 1973, Bruce accepted a  position as assistant director of public relations at Mansfield State  University and left after 6 years to fully pursue a career as a  freelance photographer.\n\nBruce studied for more than 10 years at the Triangle Institute…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699264/recognizing-bruce-dart"}, {"senator": "James Risch", "party": "Republican", "sentence": "Mr. RISCH. Mr. President, the Committee on Foreign Relations has  adopted rules governing its procedures for the 119th Congress.\n\nAcquisition of land and buildings for embassies and       legations in foreign countries.\n\n2. Boundaries…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691700/us-senate-committee-on-foreign-relations-rules-of-procedure"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…such meeting or meetings:\n\n(a) will disclose matters necessary to be kept secret in       the interests of national defense or the confidential conduct       of the foreign relations of the United States;\n\n(b) will relate solely to matters of the Committee staff       personnel or internal staff management or procedure;\n\n(c) will tend to charge an individual…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687982/us-senate-committee-on-rules-and-administration-rules-of-procedure"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…term       ``appropriate congressional committees'' means--\n\n(A) the Committee on Foreign Affairs of the House of       Representatives; and\n\n(B) the Committee on Foreign Relations of the Senate.\n\n(2) Economic or industrial espionage.--The term ``economic       or industrial espionage'' has the meaning given that term in       section 1637(d) of the…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690679/economic-espionage-prevention-act"}, {"senator": "Keith Self", "party": "Republican", "sentence": "…and regional efforts under the leadership of Chairman Mast.\n\nA significant part of our focus is achieving the policies that put  America's interests first while building our relations with allies  abroad against our common adversaries.\n\nWe have taken major steps in the right direction under President  Trump and his administration, but there is still more…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689088/america-must-not-be-idle-while-adversaries-advance-capabilities"}, {"senator": "Lance Gooden", "party": "Republican", "sentence": "…and barriers to  build peace and reconciliation among diverse faiths and nations. He has  convened conferences with Jewish and Muslim  leaders, strengthened Christian-Muslim relations, and championed  environmental issues worldwide. Because of this work, he is endearingly  known as the ``Bridge Builder and Patriarch of Peace.''\n\nHis All-Holiness's commitment…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695394/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew-to-the-united-states"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…all  administrations, now and into the future, will be required to  periodically update these regulations, specifically with the goal of  deepening and expanding U.S.-Taiwan relations.\n\nWe must stand shoulder to shoulder with our partners in the Pacific  to deter the Chinese threat. I am proud to say that enacting this  legislation, the Taiwan Assurance…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690685/taiwan-assurance-implementation-act"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…Authority............................................       4,098.211      22,927.227      53,373.809     Outlays.....................................................       4,086.136      22,904.608      53,305.155 Foreign Relations     Budget Authority............................................          60.169         256.871         501.910     Outlays.....................................................…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691578/fiscal-year-2025-enforcement-filing"}, {"senator": "Frank Lucas", "party": "Republican", "sentence": "…LUCAS. Mr. Speaker, I thank the chairman for yielding time.\n\nMr. Speaker, I am proud to rise today in support of my bill, H.R.  1531, the PROTECT Taiwan Act.\n\nUnder the Taiwan Relations Act, the President is required to notify  Congress if China poses an immediate threat to Taiwan's security. If  this notification is triggered, my bill states that it is…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699845/pressure-regulatory-organizations-to-end-chinese-threats-to-taiwan-act"}]