[{"senator": "Rob Menendez", "party": "Democrat", "sentence": "…disruptions and the steps communications  providers can take to help secure these networks and everyone who  relies on them.\n\nMy bill would codify the Communications Security, Reliability, and  Interoperability Council, or CSRIC, which focuses on improving next- generation 911, emergency preparedness, network security, resiliency,  and interoperability.…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693436/communications-security-act"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…nearly  40,000 Americans, including thousands of veterans, are employed on  these contracts providing essential products and services for Federal  agencies with excellence, reliability, and pride.\n\nServiceSource, based in my Congressional district, is one of 400  AbilityOne Federal contractors doing this work across the country,  contributing to workforce…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696023/recognizing-national-disability-employment-awareness-month"}, {"senator": "Mike Levin", "party": "Democrat", "sentence": "…clean energy to compete fairly and fully-- then rising demand can be met with falling costs and less volatility.  Infrastructure will be built more intelligently, enhancing reliability  rather than undermining reliability.\n\nAgain, this is not ideology. It is math. It is common sense.\n\nToday, along with my friend from Illinois (Mr. Casten), with whom I…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700230/winners-of-the-global-energy-race-are-being-decided"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…to address these shared  concerns, and we in the Natural Resources Committee came together to  build on that work to ensure that this legislation addresses the real  water reliability challenges facing the people of southeastern Colorado  while remaining consistent with core reclamation law principles.\n\nTogether, Congress sent the President a carefully…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698699/finish-the-arkansas-valley-conduit-act-veto-message-from-the-president-of-the-united-states"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Speaker, I yield myself such time as I may  consume.\n\nMadam Speaker, I rise in strong opposition to this bill. It is a  wholesale attack on clean energy under the guise of reliability.  Americans can see through the nonsense here to the truth, and that is  that Republicans are waging a culture war against wind and solar.  American families are footing…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697886/state-planning-for-reliability-and-affordability-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Regulatory Commission, or FERC, to block any regulation from any other  agency under certain circumstances. It takes what should be an  apolitical process, a neutral review of the reliability of our Nation's  electric sector, and twists it into a fully partisan exercise. That is  why we should reject this bill entirely.\n\nRight now, a number of Federal agencies…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698275/reliable-power-act"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…would elevate the Federal Energy Regulatory Commission  above any other Federal agency, give it unprecedented veto power, and  transform it and the North American Electric Reliability Corporation  into political actors. That is a world away from the independent  agencies that they are now where they act in the public interest and  not in the interest…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698279/reliable-power-act"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…permitted and almost fully constructed offshore wind  projects. We will put that aside. However, to keep the Campbell plant  open, the administration cited a so-called grid reliability emergency,  but they produced no actual evidence of any kind of emergency. Since  their order, the Department hasn't appointed to a single instance where  the plant was…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695767/national-coal-council-reestablishment-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…permitting reform. That is absolutely not true. They do  absolutely nothing to make it easier to expand or improve our power  grid, despite this being a time when our grid reliability is a growing  threat.\n\nFor years, Democrats have been clear: A permitting package is  impossible without reforms to the way we build transmission lines that  transport electricity…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698067/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…least of all directing the USDA  to prioritize the modernization of grain grading technologies. The U.S.  grain inspection system is known around the world for quality and  reliability. By focusing USDA's attention on modernization, we can  continue to hold our place as the world's gold standard in grain  inspection.\n\nReauthorizing the U.S. Grain Standards…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695053/united-states-grain-standards-reauthorization-act-of-2025"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…today in support of this straightforward amendment  to the Electric Supply Chain Act, an amendment that strengthens our  workforce, supports veterans, and helps ensure the reliability and  security of our Nation's energy supply.\n\nAs a Representative of California, I know how essential it is that we  shore up the workforce powering our electric supply…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697895/electric-supply-chain-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…by the jury. In some cases, judges must also pre-qualify  proposed experts before they can state an opinion on a key issue. A  lawyer's questioning then further tests the reliability of those  opinions. Thanks to these established procedures, jurors learn the  court's high valuation of honesty and come to expect it from their  government\n\nRather than…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690041/valuing-truth-fullness-lessons-from-jury-trials"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "Mr. Speaker, I rise in support of H.R. 866, the Removing Our Unsecure  Technologies to Ensure Reliability and Security Act, or the ROUTERS  Act.\n\nThis legislation is an important step to provide Americans with the  confidence to trust that the devices they use in their homes…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690157/removing-our-unsecure-technologies-to-ensure-reliability-and-security-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…can to protect this critical  infrastructure and ensure it is reliable and available to all  Americans.\n\nThe Federal Communications Commission's Communications Security,  Reliability, and Interoperability Council, or CSRIC, is meant to do  just that. It is made up of government leaders at the Federal, State,  and local levels and thought leaders from…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693434/communications-security-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…assessment and draft periodic reports on the state of the electric  supply chain.\n\nI understand that our electric supply chain is important for national  security and grid reliability, but I have to question the Republicans'  seriousness in making this request and the ability of the Department of  Energy to conduct these assessments and draft the periodic…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697896/electric-supply-chain-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…analyze and compare individuals who participate       and do not participate in the initiative controlling for       selection bias or other factors that may impact the       reliability of data.\n\n``(3) Report.--Not later than September 30, 2028, the       Secretary of Health and Human Services shall submit to the       Committee on Ways and Means of the…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697169/hospital-inpatient-services-modernization-act"}, {"senator": "Rob Wittman", "party": "Republican", "sentence": "…breakdown there with  generation, we can find other ways to bring power to people's homes,  bring power to people's businesses. That is why maintaining and  increasing that reliability in the future is key.\n\nResiliency in that grid is key, too. How do we do that? We make sure  that we do even more to empower the decisionmakers to have maximum  flexibility…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695756/guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act"}, {"senator": "Steve Womack", "party": "Republican", "sentence": "…control operations and enable the hiring of 2,500 new  controllers. It will jump-start the modernization of outdated  facilities and equipment, strengthening the safety and reliability of  our national airspace system.\n\nWe provide more than $64 billion for highways, taking care to send  the overwhelming majority of these dollars back to the States because…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699577/consolidated-appropriations-act-2026"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…(2) address the impact that the record of decision has on       hydropower production at Glen Canyon Dam, including costs to       replace hydropower resources and grid reliability; and\n\n(3) identify impacts that the record of decision has had on       species listed as a threatened species or an endangered       species under section 4 of the Endangered…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691060/memorandum-of-understanding-to-address-potential-impacts-of-a-certain-record-of-decision-on-the-upper-colorado-river-basin-fund"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…disruptions, or inaccuracies in electronic or satellite-based       navigation systems.\n\n(C) An assessment of mariner perspectives on the       availability, visibility, and reliability of physical aids to       navigation, based on input from recreational boaters,       commercial fishermen, pilot associations, port authorities,       and other relevant…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…needs assessment to identify and evaluate       the measurement, technical specifications, and conformity       assessment needs required to improve the operation and       reliability of such emergency communication and tracking       technologies; and\n\n``(B) support the development of technical specifications       and conformance architecture to improve…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693439/institute-for-telecommunication-sciences-codification-act"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…My bill requires the Bureau of Reclamation to acknowledge the effect  of the decision through a memorandum of understanding that measures the  economic, environmental, and reliability impacts of the action. I am  grateful that this important legislation is being considered today.", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691059/memorandum-of-understanding-to-address-potential-impacts-of-a-certain-record-of-decision-on-the-upper-colorado-river-basin-fund"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…for use, procurement,       or adoption by an element of the Intelligence Community to       enable such element to make informed decisions regarding the       fitness and reliability of the system and that each element       of the Intelligence Community should, to the greatest extent       practicable, avoid use of any publicly available artificial…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698262/explanatory-statement-for-the-intelligence-authorization-act-for-fiscal-year-2026"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…because of  legitimate water quality impact concern. The basis of these blockades  has been in the name of radical climate agendas, ignoring what is best  for consumers, grid reliability, and economic growth.\n\nDuring the 2013 to 2021 time period, several pipeline projects were  canceled, leading to a pipeline capacity growth of only 26 percent.  Meanwhile,…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698073/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…project funding I secured for  the Newton YMCA childcare expansion.\n\nThis funding will allow the Y to open 50 new childcare slots, giving  working parents in Jasper County the reliability and support they  urgently need.\n\nAccess to childcare is not just a family issue. It is a workforce  issue. When parents can't find childcare, they can't work, which hurts…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696794/highlighting-critical-investments"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Well, good for us.\n\nThe vast majority of the world is producing power with coal and  natural gas, and it is growing exponentially. Meanwhile, we are  crushing our grid, the reliability of American power, making it more  expensive for the average American and doing really nothing about  worldwide CO2 production. That is the truth. China and India  are pumping…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690387/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…legislation directs the Department of Energy to conduct ongoing  assessments and report to Congress on the components and infrastructure  supply chain needed to secure the reliability and affordability of our  bulk power system.\n\nIt is no secret that we find ourselves in the middle of an electric  reliability crisis that is threatening the integrity of…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697890/electric-supply-chain-act"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…interstate  pipeline, then entire regions pay the price. We have already seen this  time and time again in the Northeast. In the Northeast, shortages have  already threatened reliability and driven prices through the roof.\n\nThis bill brings long-overdue accountability and coordination to the  Federal permitting process for interstate natural gas pipelines.…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698057/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…bill.\n\nMr. GUTHRIE.  3628.\n\nMr. GUTHRIE. Madam Speaker, I yield myself such time as I may  consume.\n\nMadam Speaker, I rise in support of H.R. 3628, the State Planning For  Reliability and Affordability Act, sponsored by my colleague  Congressman Evans from Colorado.\n\nH.R. 3628 directs State public utility commissions to consider  implementing measures…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697882/state-planning-for-reliability-and-affordability-act"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…legislation cuts through that red tape, gives developers  certainty, and ensures critical projects can move forward.\n\nIn addition, the rule includes H.R. 1047, the Guaranteeing  Reliability Through the Interconnection of Dispatchable Power Act.\n\nYear after year, projects that would keep the lights on and lower  bills are stuck in the interconnection queues…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695524/providing-for-consideration-of-hr-dc-criminal-reforms-to-immediately-make-everyone-safe-act-providing-for-consideration-of-hr-district-of-columbia-policing-protection-act-providing-for-consideration-of-hr-lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia-providing-for-consideration-of-hr-district-of-columbia-judicial-nominations-reform-act-providing-for-consideration-of-hr-guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act-providing-for-consideration-of-hr-national-coal-council-reestablishment-act-providing-for-consideration-of-hr-promoting-cross-border-energy-infrastructure-act-and-for-other-purposes"}]