[{"senator": "Betty McCollum", "party": "Democrat", "sentence": "…Metals's       Tamarack Nickel Project. Furthermore, recent research from       the Colorado School of Mines, By-product recovery from US       metal mines could reduce import reliance far critical       minerals, concluded that 90% recovery of these minerals/      metals as by-products at active U.S. mines now could meet       nearly all our critical mineral…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699274/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…They provide critical habitats for wildlife, including  pollinators like bees and butterflies, which are essential for  agricultural productivity. They also help reduce our reliance on  chemical fertilizers and pesticides, prevent soil erosion and improve  water quality. Beyond their environmental benefits, native plants are  foundational to the cultural…", "date": "2025-03-21", "source_url": "https://justfacts.votesmart.org/public-statement/1688920/supporting-the-designation-of-april-2025-as-national-native-plant-month"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…Ohioans committed to hard work, community, and service; and\n\nWhereas, for 175 years, Fulton County has stood as a proud       testament to the enduring values of self-reliance, civic       engagement, and American perseverance;\n\nNow, therefore, I, Congresswoman Marcy Kaptur, do hereby       recognize and celebrate the Demisemiseptcentennial of Fulton…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693801/proclamation-for-fulton-countys-demisemiseptcentennial"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…Republican Governor Gary Herbert signed a  comprehensive set of reforms in 2017 with near-unanimous support from  the Republican-led legislature. These reforms have also reduced  reliance on locked detention by diverting more young people into  community-based programs. Early outcomes from these changes show that  the use of locked detention has fallen significantly,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695783/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…effective. We       should be discussing how we can integrate programs such as       HIV and malaria treatment into countries' primary health care       systems and reduce reliance on outside sources. Or how we can       help countries to finance their own health needs. Instead, we       are asking if lifesaving foreign assistance is of benefit to…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691139/us-global-health-programs"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…millionaires and billionaires, and will say ``no'' to piling on more  debt which will raise interest rates, hurting our economic growth,  exploding our trade deficit because of our reliance on foreign firms  and foreign investment, and crippling ordinary Americans' ability to  get loans.\n\nIt is bad economics. We need a new approach.", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691530/tax-cuts"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…rate of growth of  global warming that affects our planet and affects our future with  hotter and hotter summers, flash floods, fires and disasters. It will  increase our reliance on fossil fuels, which make the air dirtier and  people sicker, all while we are taking away people's health care. This  Congress has earned an ``F.'' We do not deserve a…", "date": "2025-07-25", "source_url": "https://justfacts.votesmart.org/public-statement/1694255/condemning-chaotic-and-harmful-failings-of-this-congress"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…break is that it has to be a rule. Like I  said, pretty much any Executive action could be plowed through the  process that is being created here. And so however settled the reliance  on a particular permit or a particular license or a particular  Executive decision from years ago, it is all up for grabs under this.\n\nAnd the third, of course--other than…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691447/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…dishonest loan agents can contribute to fraud,  casting a stain on the SBA's largest lending program and, ultimately,  hurting borrowers and lenders alike.\n\nAs SBA increases its reliance on loan agents, it is essential that  the agency have proper oversight of their involvement to minimize  fraud. This will ensure that competent and honest agents can help…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691856/9999"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…pollution and lowers the cost of energy bills.\n\nClimate change is real, and it is happening now. We must act. These  were commonsense initiatives to move us away from complete reliance on  fossil fuels and move toward a clean energy future.\n\nMr. Speaker, try to spin it any way you want. Americans will suffer.  Our world will continue to burn.", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691602/environmental-protections"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…in perpetuity a reality.\n\nOur energy portfolio domestically must be balanced and comprehensive,  a truly all-of-the-above strategy in order that there be competition  not reliance on dirty crude. That day should be over. That means  continuing progress on renewable energy systems like modern nuclear,  green hydrogen, fusion, biofuels, solar, hydroelectric,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698837/reflecting-on-impact-of-illegal-action-in-venezuela"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…bill opens the door to a more secure, diverse, and  competitive wireless network landscape.\n\nThe shift to Open RAN technology not only enhances national security  by reducing reliance on foreign-made equipment but also boosts American  manufacturing and fosters innovation in 5G and 6G.\n\nThe bill ensures that rural communities are no longer left behind in…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693487/open-ran-outreach-act"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…security.\n\nIn today's interconnected world, a breach in one wireless network can  compromise critical services in transportation, healthcare, finance,  and public safety. As our reliance on digital technologies increases,  so too does the scale and sophistication of these threats, especially  with the rise of artificial intelligence.\n\nWhile AI holds tremendous…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693498/ntia-policy-and-cybersecurity-coordination-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…ICE officers that there was no need.\n\nHer findings, which are airtight and persuasive, are the reason why I  am here to say the National Guard should not be deployed there.  Reliance should be placed on local and State police. There should be  challenges to any deployment in Illinois or California to test whether  it is actually needed to preserve order.…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696181/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…be very difficult  to reverse, even if Trump pulls back his tariffs, supply chains are  clogged already.\n\nPutin has long spoken about his interest in reducing the world's  reliance on America's economic strength and the U.S. dollar. Such a  world leaves each American poorer and with fewer economic  opportunities. Just as Russia relies on oil exports…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691084/liberty-versus-dictatorship"}, {"senator": "Mike Simpson", "party": "Republican", "sentence": "…responsibility,  prioritizes unleashing American energy, and protects public lands and  access to those lands. It bolsters national security and public safety  by reducing our reliance on foreign countries for energy and mineral  resources and by increasing law enforcement funding for our land  management agencies and for our Tribes.\n\nIt protects our communities,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698758/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…and       capabilities in the United States.\n\n(7) Consistent with United States obligations under       international agreements, encourage and incentivize the       reduced reliance of domestic enterprises and domestic       manufacturers on critical goods from countries that are       described in section 7(2)(B).\n\n(8) Encourage the relocation of manufacturing…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690188/promoting-resilient-supply-chains-act-of-2025"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…boost the local, state, and national       economy, and help refill the Trans-Alaska Pipeline System       (TAPS). Development of new energy deposits will also reduce       reliance on imported oil and help maintain American energy       dominance.\n\nGiven the NPR-A was specifically designated by Congress to       produce critical energy resources, it…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…press briefing, referring to Biden's promise to create good-      paying union jobs in the green energy sector as his       administration attempts to end the nation's reliance on       fossil fuels.\n\n``That is something the administration has promised and       there is now a gap so I'm just curious when that happens,       when those people can…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688523/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…legislation that  strengthens America's economic and national security by advancing  domestic mineral production--something we didn't talk about enough  today--which reduces our reliance on foreign sources and supports job  creation here at home.\n\nFinally, a ``yes'' vote on this rule enables us to consider  legislation that preserves equal debate, protects…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699590/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…also drives the local  economy, my State economy, and is also a factor in the security of the  United States of America.\n\nOur bill encourages domestic production, decreases reliance on  foreign minerals, shores up supply chains, and significantly bolsters  national security, all while dealing a critical blow to Putin's war  machine. These factors combine…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689193/work-highlights-of-western-caucus"}, {"senator": "John Rose", "party": "Republican", "sentence": "…can easily turn once-prosperous countries  into wastelands.\n\nAmericans built New York City as a gateway for immigrants seeking a  better life. We built it on freedom, self-reliance, and open markets,  not on forced redistribution or centralized planning.\n\nThe situation now extends to Seattle, where the mayor-elect has  chosen to boycott Starbucks, a…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697149/denouncing-the-horrors-of-socialism"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…stifles investment, and weakens  our energy security. This so-called waste emissions charge won't reduce  methane emissions, but it will punish American producers, increase  reliance on foreign energy, and make life more expensive for America's  working families.\n\nWhile some claim this tax does not directly impact my home State of  Alaska, what is bad…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688188/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…Alaska is ready to power America. We are ready to help  lower energy costs for families and small businesses. We are ready to  strengthen national security by reducing our reliance on foreign  nations. The people who live in Alaska's Far North, the people whose  ancestors have called the region home for 10,000 years, are asking us  to restore the balanced,…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696835/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision"}, {"senator": "Chuck Fleischmann", "party": "Republican", "sentence": "…manufacturing, and industrial efficiency  improvements.\n\nIt also includes essential work on critical materials that will lay  out the groundwork for technologies that will reduce our reliance on  foreign supplies.\n\nI think EERE is an issue that we all can support. The reductions are  there. I think this strikes a very good balance.\n\nFor these reasons, I must respectfully…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694951/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…exactly the kind of bill that they would support.  Instead, they spent years defending policies that left America exposed.  Republicans are choosing strength, security, and self-reliance.  Democrats choose dependence and delay.\n\nMr. Speaker, I urge my colleagues to support this rule, and I reserve  the balance of my time.\n\nMr. Speaker, my colleagues across…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699905/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…clearly demanded and stop asking  the Federal Government to add another program after program after  program, but instead, have the type of government that encourages self- reliance and strong families.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695805/what-charlie-kirk-stood-for"}, {"senator": "John Hoeven", "party": "Republican", "sentence": "…prices to  cook your food. That means higher cost of natural gas for all  consumers. Also, less supply of domestic energy means higher gas bills  for consumers and an increased reliance on energy imports.\n\nInstead of new taxes and regulations designed to stifle production,  we should be supporting innovation to maximize the use of our abundant  and affordable…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688157/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…quiet despair as their towns crumble into  disrepair, their way of life disappears, and the country they love  slips away from them.\n\nThe political ideal of a republic is self-reliance. As our Founding  Fathers understood, the art of self-government is about people's  ability to rely on themselves. There was always trade, of course--this  is a natural and…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690533/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…enhances security  right here at home.\n\nRenewing HOPE and HELP supports nearshoring and more resilient supply  chains, benefiting American workers and businesses, while reducing  reliance on distant and unreliable sources.\n\nI commend Dr. Murphy for his leadership on this issue. Through his  numerous trips to Haiti, he has seen firsthand the human consequences…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698853/haiti-economic-lift-program-extension-act"}]