[{"senator": "Joe Courtney", "party": "Democrat", "sentence": "…Again, these were tariffs that he imposed  unilaterally without consulting Congress.\n\nThe question, though, is whether it is good that again there is going  to be some price relief for some of these items, which never should  have been tariffed to begin with. It begs the question about the rest  of the economy that is getting harmed by tariffs.\n\nThe National…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696749/congress-must-take-action-on-tariffs"}, {"senator": "Nelida Pou", "party": "Democrat", "sentence": "…rise for the first speech on the floor of this  body to  reject the Republicans' so-called budget.\n\nI came to Congress to help my constituents. I came here to provide  direct relief to struggling Americans and lift people up. This  Republican budget does none of those things. It is nothing more than a  blueprint for cruelty. This GOP budget will destroy…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688033/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…the  partnership between Hawaii's citizen soldiers and airmen and their  Philippine counterparts has steadily progressed, encompassing  humanitarian assistance and disaster relief, joint training exercises,  strategic planning and multilateral regional engagement.\n\nThe 25th anniversary of this agreement showcases an important and  long-lasting commitment…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695815/recognizing-the-25th-anniversary-of-the-hawaii-national-guards-state-partnership-program"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…forward an initiative, an  industrial initiative, the likes that this Nation had never seen.\n\nYes, Mr. Speaker, it was money, the taxpayer money out of the  Troubled Asset Relief Program. GM, General Motors, left the stock  market.\n\nI reflected on the 15-year anniversary of this auto rescue last year  in this Chamber during another one of these addresses.…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689752/reflecting-on-americas-history"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "Mrs. McBATH. Mr. Speaker, I thank the gentleman for yielding.\n\nThe Trafficking Survivors Relief Act is very critical, bipartisan  legislation that would provide long-overdue relief to victims and  survivors of human trafficking to help them overcome the lasting  effects…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697180/trafficking-survivors-relief-act"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…years ago, and I was sitting there--I have now been a member  of the parish for 40 years--and I was looking around, and I realized  that times change and they don't.\n\nCatholic Relief Services, which is one of the largest agencies in the  United States that help settle refugees, who are legal immigrants-- refugees are legal immigrants--about 15 years ago…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693592/rescissions-act-of-2025"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…now being deported as they do the right thing and report  for their ICE check-ins.\n\nWe will not stand for it. I will soon be reintroducing the Southeast  Asian Deportation Relief Act, which would prevent the administration  from deporting these refugees to countries where they have often never  lived and ensure that those who have already been deported…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690502/trump-immigration-policies"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…thank you for helping to  save those jobs and those workers who would have been fired--by the  way, a third of them veterans themselves.\n\nBut this 30,000 number is no cause for relief or complacency. In  fact, it is unconscionable because it will undercut veterans' care and  benefits. We have already seen some of the impacts of this haphazard  effort to…", "date": "2025-07-09", "source_url": "https://justfacts.votesmart.org/public-statement/1693321/9999"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…affecting 15 million people across the country.  That includes more than 50,000 Oregonian students and families who,  with this bill, will have limited options for repayment relief. No  question, unless you are from a wealthy family, this bill will close  the doors of opportunity for the next generation to access affordable  college.\n\nFamilies will pay…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691580/big-bad-bill-is-cruel"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…in  place, Americans will spend one-hundred dollars more on everyday goods  each month. In my district, I'm hearing that working families and  seniors on fixed incomes need relief from the high cost of living. They  can't afford to add money for tariffs to their already tight monthly  budgets.\n\nNot only are the President's tariffs hurting my constituents,…", "date": "2025-03-18", "source_url": "https://justfacts.votesmart.org/public-statement/1688917/impact-of-president-trumps-disasterous-tariffs-on-canada"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…across the country get their money back as soon as possible.\n\nAnd how about the families who paid for these products that have been  taxed by the Trump tariff tax? They deserve relief too. If we are  concerned about the cost of living as it hits American families, they  need to have some relief, too, and the President, after losing in the  Supreme Court,…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700151/tariffs"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "…STANTON. Mr. Speaker, Arizona has suffered year after year after  year of record-breaking temperatures. Our summers are getting hotter,  lasting longer, and providing little relief at night. This heat is  incredibly dangerous for our health and for our economy.\n\nLast summer, tragically, more than 600 of our fellow Arizonans lost  their lives to the heat.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695656/extreme-heat-caucus"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…today, Donald Trump is announcing a $12  billion bailout for farmers who have been punished by his trade war and  his tariffs.\n\nLet's be very clear. The reason farmers need relief at all is largely  because Donald Trump betrayed them and decimated their businesses with  his disastrous tariffs.\n\nNow, Donald Trump is patting himself on the back, acting…", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697574/department-of-defense"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…Act. These bills will help increase  the supply of housing, bring down costs, and revive the dream of  homeownership for all.\n\nWhile Democrats are fighting to deliver real relief to families  across this country, President Trump, along with co-president Elon Musk  and Secretary Scott Turner, are working to decimate HUD from the inside  out.\n\nSince January,…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…jurisdictions.       This would deny millions of small businesses, especially       those in underserved communities, access to essential       services such as loans, disaster relief, and technical       assistance, simply based on where they are located. These are       businesses already navigating high prices and ongoing       economic instability caused…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692125/american-entrepreneurs-first-act-of-2025"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…Democrats continue to fearmonger, I want to shed light on what  Republicans are doing to fix the Democrats' affordability crisis, with  policies that deliver real, lasting relief to the American people.  These include eliminating health plan gimmicks like silver loading,  which will lower ACA premiums by 11 percent; increasing transparency  for pharmacy…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698368/lower-health-care-premiums-for-all-americans-act"}, {"senator": "David Kustoff", "party": "Republican", "sentence": "…need to detect, investigate, and prosecute  those behind these thefts.\n\nWe also have to ensure that victims of mail theft are taken care of  and that they can access timely relief. That is why this bill, H.R.  1155, the Recovery of Stolen Checks Act, is so important.\n\nRight now, it can take months and months for the IRS to issue a  replacement for a…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689290/recovery-of-stolen-checks-act"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…and House of Representatives of       the United States of America in Congress assembled,       SECTION 1. SHORT TITLE.\n\nThis Act may be cited as the ``Trafficking Survivors Relief       Act''.       SEC. 2. FEDERAL EXPUNGEMENT FOR VICTIMS OF TRAFFICKING.\n\n(a) In General.--Chapter 237 of title 18, United States       Code, is amended by adding at the…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697182/trafficking-survivors-relief-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…a refund in the same way that those who request a filing extension  receive additional time.\n\nI urge my colleagues to stand with taxpayers and provide this measure  of tax relief to victims of natural disasters.\n\nThis bill passed out of the Ways and Means Committee with a united  vote from Republicans and Democrats. It is not hard to see why.  Disasters…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689314/disaster-related-extension-of-deadlines-act"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…dollars in off-budget spending,  which soared inflation for the American people? Where was the  compassion then?\n\nWhere was the outrage when House Republicans were calling for relief  for the American people in the last Congress?\n\nThey said that we were following the wishes of only President Trump.  They followed the Green New Deal playbook to a t, and…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688464/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing-and-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…in section 332(d)       of the Communications Act of 1934 (47 U.S.C. 332(d))).\n\n(B) Commercial mobile data service (as defined in section       6001 of the Middle Class Tax Relief and Job Creation Act of       2012 (47 U.S.C. 1401)).\n\n(7) Person.--The term ``person'' means an individual or       entity.\n\n(8) United states person.--The term ``United States…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693423/understanding-cybersecurity-of-mobile-networks-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…administration  for working together in the interests of American citizens across our  Nation. Together, we delivered no tax on tips, no tax on overtime, a  doubled child tax credit, relief for our seniors, and so much more.\n\nIn Georgia, families will keep an additional $3,000 of their own  money in 2026 thanks to the One Big Beautiful Bill Act. Republicans are…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694797/promises-made-promises-kept"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…roadside in rural Florida, Martha and Vincent  bring warmth and hope wherever they go. Their service touches every  corner of the Red Cross: Disaster Action Team (DAT), Disaster Relief  Operations (DRO), Service to the Armed Forces (SAF), and countless  outreach events. You'll find them at Homeless Veteran Stand-Downs, the  Mexican Consulate, VA hospitals,…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691268/recognizing-martha-narvaez-and-vincent-leandry"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…in California.\n\nNow, I have spoken about a culture of corruption that exists in  Sacramento, and this latest series of events has cast that culture of  corruption in stark relief. Indeed, the former chief of staff or  communications director for both Jerry Brown and, I think, Dianne  Feinstein used those very words in the aftermath of this indictment…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697101/highlighting-the-state-of-california"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…small businesses represent 99 percent of all businesses in  the State. In President Trump's first term, Congress passed the Tax  Cuts and Jobs Act, giving small businesses the relief that they needed  to grow and hire.\n\nI will also say that there are no Fortune 500 businesses without  first starting as a small business, or a mom and pop.\n\nIf we don't act…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690743/myths-of-medicaid-reform"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…President Trump's Tax Cuts and Jobs Act of  2017, which ushered in historic economic growth for our country.\n\nThe legislation also provides rural Americans with much-needed tax  relief by extending immediate expensing to help our Nation's farmers  secure the most up-to-date technology and by delivering relief from the  death tax to more than 2 million family-owned…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692792/operation-midnight-hammer-success"}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "…House's One Big Beautiful Bill, and whether it passes  freestanding or as part of the bigger bill, one way or another, No Tax  on Tips is going to become law and give real relief to hard-working  Americans.\n\nSo I am proud of what the Senate just did, and I commend Democrats  and Republicans, even at a time of partisan division, coming together  and…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691422/no-tax-on-tips-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…as parens patriae, bring a civil       action on behalf of the residents of the State in an       appropriate district court of the United States to obtain       appropriate relief.\n\n(B) Rights of the commission.--\n\n(i) Notice to the commission.--\n\n(I) In general.--Except as provided in subclause (III), the       attorney general of a State, before initiating…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690200/hotel-fees-transparency-act-of-2025"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…investment in production and job creation, which in turn       stimulates economic growth and strengthens the overall       economy. Disapproving this tax will also provide relief to       small businesses and industries so they can allocate more       resources toward growth, innovation, and workforce expansion.\n\nThis natural gas tax threatens to increase…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688182/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…be punished with frivolous  lawsuits when they comply with the terms of their permits.\n\nI encourage my colleagues to vote in favor of the PERMIT Act to  provide regulatory relief and certainty under the Clean Water Act for  businesses in Ohio and across the Nation.", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698025/promoting-efficient-review-for-modern-infrastructure-today-act"}]