[{"senator": "Doug Jones", "party": "Democrat", "sentence": "Senator Doug Jones (D-Ala.) has released the following statement on the news that the House of Representatives has passed the COVID-19 economic relief bill that the Senate passed earlier this week:\n\n\"I'm glad the House moved quickly to pass this economic relief bill and that President Trump will sign it in to law today."}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "The EIDL emergency grant program was created in the Coronavirus Aid, Relief and Economic Security (CARES) Act, of which Shaheen was a lead negotiator."}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "Dear Secretary Mnuchin and Commissioner Saul:\n\nWe write to express our concern that without additional action from your agencies, many families who receive Social Security benefits and have young children may not receive the full cash assistance that Congress provided in the Coronavirus Aid, Relief, and Economic Security (CARES) Act until 2021."}, {"senator": "Benjamin L. Cardin", "party": "Democrat", "sentence": "Dear Secretary Ross and Assistant Administrator Oliver:\n\n \n\nThe appropriations division of the Coronavirus Aid, Relief, and Economic Security Act, the third bipartisan coronavirus aid and economic relief agreement, contains $300 million to help U.S."}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "In addition, Senator Warren has long taken steps to oppose President Trump's border wall, including the following:\n\n-Less than three weeks after President Trump took office, she led colleagues on a letter to the Secretary of Homeland Security raising concerns about the potential diversion of funds from key DHS priorities to pay for the border wall.-In February 2019, she introduced the Protecting Disaster Relief Funds Act (S."}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "I will continue to advocate for our communities across central and southern New Mexico to ensure access to quality healthcare in the next relief package,\" said Torres Small."}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "Further allocations to New Hampshire through the Coronavirus Aid, Relief, and Economic Security Act (CARES Act) and other response legislation will be announced as they become available."}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "This evening, the Coronavirus Aid, Relief, and Economic Security (CARES) Act passed the Senate by a unanimous 96-0 vote."}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "Senator Sheldon Whitehouse (D-RI) is applauding the introduction of legislation in the House of Representatives to provide a new round of urgently needed relief for Americans."}, {"senator": "Jon Tester", "party": "Democrat", "sentence": "Additional Montana seasonal workers will now be eligible for relief under the Paycheck Protection Program (PPP) after a push from U.S."}, {"senator": "Julia Brownley", "party": "Democrat", "sentence": "Every day, far too many veterans across this country are waiting for  a VA benefit decision, but not only for the benefits they are due, but  for the stability, the security, and the relief that comes with these  benefits."}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "Today, United States Senator Elizabeth Warren (D-Mass.) joined Representatives Joe Neguse (D-Colo.), Ayanna Pressley (D-Mass.) and Rashida Tlaib (D-Mich.) in sending a letter urging House and Senate leadership to include $11.5 billion in funding for Emergency Solutions Grants (ESG) in the next relief package to aid the nation's homeless population who are experiencing heightened vulnerability during the COVID-19 pandemic."}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "Speaker, Congress, Democrats and Republicans alike,  came together to pass the American Relief Act of 2025, securing $12  billion to rebuild communities devastated by disaster."}, {"senator": "Benjamin L. Cardin", "party": "Democrat", "sentence": "Raskin, and David Trone, today announced $170,544,958 in federal funding for Maryland's institutes of higher education under the Higher Education Emergency Relief Fund."}, {"senator": "Josh Hawley", "party": "Republican", "sentence": "Senator Josh Hawley (R-Mo.) announced a new proposal for Phase 4 Coronavirus relief legislation to help get Americans back to work and to position the U.S."}, {"senator": "David Kustoff", "party": "Republican", "sentence": "We also have to ensure that victims of mail theft are taken care of  and that they can access timely relief."}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "Passing this legislation will give much-needed financial relief to organizations across Alaska, allowing them to continue to provide services at a time when they are needed the most.\"\n\n\"During these unprecedented times of COVID-19, YWCAs across the country have seen a sharp increase in demand for services but decreases in revenue,\" said YWCA USA CEO Alejandra Y."}, {"senator": "Susan M. Collins", "party": "Republican", "sentence": "This relief will help prevent small businesses from having to close their doors and help keep their employees paid during the pandemic.\"\n\n \n\nPaycheck Protection Program loans were created by the Keeping American Workers Paid and Employed Act, which was authored by Senator Collins along with Senators Marco Rubio (R-FL), Ben Cardin (D-MD), and Jeanne Shaheen to help small employers continue to pay their workers during the COVID-19 pandemic."}, {"senator": "Cory Gardner", "party": "Republican", "sentence": "Your work is providing valuable assistance in that partnership you so often refer to in your motto to \"Do Right and Feed Everyone.\" The Coronavirus Aid, Relief and Economic Security (CARES) Act passed by Congress and signed into law on March 27th includes several provisions for assistance to agriculture."}, {"senator": "Shelley Moore Capito", "party": "Republican", "sentence": "We are anxious for Congress to come to deal that provides relief to our brave medical professionals.\"\n\nSenator Capito is committed to ensuring all West Virginians are heard during this uncertain time."}, {"senator": "Marco Rubio", "party": "Republican", "sentence": "\"This comes in the context of a pandemic that is already disproportionately harming communities of color, and which has both highlighted and exacerbated racial inequities in our society \"Ensuring that the worker-focused economic relief of the PPP makes it to small businesses in these communities must be an ongoing priority."}, {"senator": "Mitch McConnell", "party": "Republican", "sentence": "These federal resources, made available by the Coronavirus Aid, Relief and Economic Security (CARES) Act, will be used to assist the county with its coronavirus response efforts."}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "Dear Administrator Carranza:\n\nWe wish to thank you and your respective staff for working to implement the Coronavirus Aid, Relief, and Economic Security Act (CARES Act)."}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "Senate passed an additional relief package to combat the outbreak of novel coronavirus."}, {"senator": "Steve Daines", "party": "Republican", "sentence": "Senator Steve Daines today secured a boost of over $480 billion in funding for testing, hospitals, the Paycheck Protection Program (PPP) and the Economic Injury Disaster Loan Program (EIDL) to provide more relief for Montana small businesses, workers, families and healthcare professionals in light of the Coronavirus pandemic."}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "The Senate passed bipartisan legislation introduced by Senate Veterans' Affairs Committee Ranking Member Jon Tester (D-Mont.) and Chairman Jerry Moran (R-Kan.) to amend the Servicemembers Civil Relief Act (SCRA) and provide additional legal protections for servicemembers impacted by the COVID-19 crisis."}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "1526) to amend       title 28, United States Code, to limit the authority of       district courts to provide injunctive relief, and for other       purposes."}, {"senator": "Steve Daines", "party": "Republican", "sentence": "As Congress develops a future package to provide relief to American small business owners, we urge you to consider our proposal for a Small Business Local Relief Fund (The Fund)."}, {"senator": "Ben Sasse", "party": "Republican", "sentence": "To provide these struggling small businesses and their employees relief during this difficult time, the CARES Act created the Paycheck Protection Program (PPP)­ a new small business lending facility at the Small Business Administration (SBA) ­that will provide billions of dollars of forgivable loans to impacted businesses with 500 or fewer employees."}]