[{"senator": "George Latimer", "party": "Democrat", "sentence": "…freedom to Black Americans from slavery  and ensuring their right to vote, and establishing the right of women  and those over 18 to vote, as well--free speech, assembly, and  religious practices for all.\n\nEconomic growth recognizes the buying power of all of our citizens  and the rising tide that allows women, people of color, and those of  every demographic…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693593/dei-policies-build-stronger-future"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…than that, since ascending to his position in 1991, he  has reached beyond Orthodox Christianity to be an inspiration to people  of all faiths around the world suffering from religious persecution,  violence, and displacement.\n\nEcumenical Patriarch Bartholomew has fostered dialogue across the  world and across religions with Christians, Muslims, and Jews.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695345/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…walked across the country in different places and met Russians  who are trying to make a go of it by growing food and getting it into  the bigger cities.\n\nI have tried to visit religious institutions in Russia and learned  how the government there suppresses free religious expression. They  force any church there, if they even allow it in, to speak in Russian,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690215/supporting-ukraines-independence"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…streets  by DHS agents.\n\nToday, in my district and throughout the state, people are afraid to  leave their homes. Children are not going to school. Families are not  attending religious services. Small businesses are closed. Many of my  neighbors now live in a consistent state of chaos and fear. When they  do go out, many citizens and legal immigrants are…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699913/consolidated-appropriations-act-2026"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…collection practices, Big Tech domination,  and predatory lending--then the answer is pretty clear.''\n\nMr. Speaker, S.J. Res. 28 is opposed by nearly 200 consumer, civil  rights, religious, and good governance organizations. It was also  opposed by a bipartisan group of Senators. I urge my colleagues to vote  for American consumers, not the unelected Elon Musk…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689953/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…in the dialogues among the Abrahamic  Faiths--Judaism, Christianity, and Islam--and his presence in our  Nation's capital is an opportunity to highlight the positive role  religious leaders of his stature bring to the cause of peace and  religious liberty.\n\nThe true peacemakers of history not only sought to reduce conflict  but also showed compassion…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695586/recognizing-the-spiritual-head-ecumenical-patriarch-bartholomew"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…thousands living in Western Pennsylvania. Since  his election as the 270th Archbishop of Constantinople-New Rome in  1991, His All-Holiness has continuously worked to promote religious  freedoms, human rights, and stronger environmental protections.\n\nThrough the tireless work to promote international peace and  religious tolerance, His All-Holiness was…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695410/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Joaquin Castro", "party": "Democrat", "sentence": "…authorized  programs that support human rights in China, including initiatives  empowering Chinese and Uyghur-related diaspora groups to combat  transnational repression and defend religious freedom.\n\nDespite the fact that Radio Free Asia helped break the story about  China's program of detention, reeducation, and forced labor, this  administration is trying…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694800/uyghur-policy-act-of-2025"}, {"senator": "Maggie Goodlander", "party": "Democrat", "sentence": "…Secretary to the late Ecumenical Patriarch Demetrios, Metropolitan of  Philadelphia, and Metropolitan of Chalcedon. I want to thank His All- Holiness for his commitment to religious freedom for all faiths as well  as his lifetime of service to all people and our planet. During this  visit, His All-Holiness will receive the Templeton Prize to honor his…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695371/recognizing-the-ecumenical-patriarch-of-constantinople-his-all-holiness-bartholomew"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…persecution of Ukrainian Christians by Russian occupation forces, so  many of our neighbors at home and abroad live with vulnerability and  insecurity as they endure the dangers of religious and ethnic  persecution within their own communities.\n\nIt is important that these incidents, though only a fraction of the  examples we have of the destructive force of hate…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690781/we-have-a-shared-humanity"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…children, is  horrific, completely unacceptable. Blocking food and medicine with the  goal of inducing starvation is horrific and unacceptable. And that is  true under any religious or moral code.\n\nLet me tell you about a few children the AP reported on a couple  weeks ago.\n\nFour children who starved to death, ranging from 4 months old to 2  years old--picture…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694437/providing-for-congressional-disapproval-of-the-proposed-export-of"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…revered Ninth Guru of Sikhism--the world's fifth-largest religion, with  nearly 30 million followers worldwide, including one million here in  the United States.\n\nA champion of religious freedom for all, Guru Tegh Bahadur  courageously confronted the Mughal Emperor Aurangzeb's campaign of  religious persecution, defending the right of every individual to…", "date": "2025-10-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696204/recognizing-the-350th-anniversary-of-the-martyrdom-of-guru-tegh-bahadur"}, {"senator": "Rob Menendez", "party": "Democrat", "sentence": "…constituents in New Jersey's 8th Congressional  District. He has devoted his life to advocating for peace-building  measures, organizing interfaith summits, and promoting religious  freedom and human rights.\n\nIt is a privilege to welcome such a leading figure to the Nation's  Capital and recognize his significant contributions to peace,  interreligious…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695648/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…Mr. Speaker, when I first entered Congress, I was the third Ph.D.  physicist elected to this body. We had at the time Vern Ehlers, a  nuclear physicist and a conservative, religious Republican representing  western Michigan.\n\nWe had Rush Holt, a plasma fusion physicist, a progressive Democrat  representing Princeton.\n\nWe had me, a sort of garden-variety…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694113/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "Ms. ANSARI. Mr. Speaker, I rise today to voice my outrage and strong  opposition to the inhumane treatment of migrants fleeing religious  persecution.\n\nEarlier this month, the Trump administration deported roughly 300  men, women, and children seeking refuge in the United States to Panama  on U.S. military…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688337/migrants-fleeing-religious-persecution"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…only two genders; no more  men playing in women's sports; restoring America's leadership on the  world stage; rebuilding our military; military recruitment up;  defending religious liberty; sending gang members back to their own  home countries; standing up for American workers; adding 345,000 new  jobs; securing billions of dollars in new investments…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690430/the-first-100-days"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…detention, silencing those who oppose them.\n\nThe Burmese military has left a trail of devastation, damaging or  destroying at least 343 Christian churches and numerous other religious  buildings, according to the Burma Research Institute.\n\nThe people of Burma can no longer afford for Congress to sit idly by,  and the Trump administration must adopt a unified…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699832/bringing-real-accountability-via-enforcement-in-burma-act"}, {"senator": "Mario Diaz-Balart", "party": "Republican", "sentence": "…support our allies and friends. It does a lot more  while spending a lot less money.\n\nMadam Speaker, the bill increases funding to counter fentanyl. It  increases support for religious freedom and to address religious  persecution around the planet. It maintains our longstanding pro-life  provisions, and this bill removes controversial funding directives…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699572/consolidated-appropriations-act-2026"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…tuition, books, supplies, and more.\n\nThis bill is expected to benefit over 2 million students nationwide,  opening the door to better opportunities whether in public, private,  religious, or homeschool settings.\n\nUnfortunately, forward-thinking solutions like this are not being  considered in my home State of Pennsylvania where there are some  families that…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689153/advancing-america-first-policies"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…Restrictions on Confucius Institutes and Chinese Entities of  Concern Act.\n\nMr. Speaker, over the past decade, Communist China has persecuted the  Uyghur population for their religious and cultural practices. Xinjiang  authorities have detained Uyghurs in internment camps without formal  charges, forced them into slave labor, and have committed numerous…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690826/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…and human trafficking, confront the  malign influence of the Chinese Communist Party, and counter terrorism.\n\nWe reinforce democracy and human rights efforts, and we defend  religious liberty. As both a moral duty and vital American interest, we  will not tolerate religious persecution and attacks on faith. Upholding  those values strengthens American…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699054/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Mary Miller", "party": "Republican", "sentence": "…begins in the home and parents are, first and       foremost, the primary teachers and protectors of their       children in a free society. Properly constructed social,       religious, and governmental institutions are designed to       support and strengthen the family unit, not restrict it,       regulate, or replace it. No association or government…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688744/declaration-of-mothers-a-proclamation-and-pledge-for-the-preservation-of-freedom-and-virtue"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…mysteriously disappear or fall  out of windows to their deaths or are poisoned, imprisoned, or die of  suspect causes like Alexei Navalny. In Russia, the government targets  religious minorities, imposing fines and criminal charges. In Russia,  the government controls the media. Independent media outlets are  censored, suppressed, or shuttered if they…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690955/ukraine"}, {"senator": "Rick Scott", "party": "Republican", "sentence": "…to affirm my unwavering support for the Jewish  community in Florida, across the United States, and around the world.  For millennia, the Jewish people have preserved their religious,  cultural, and ethnic identity in the face of persecution, enslavement,  genocide, discrimination, and unimaginable adversity. Since the arrival  of the first Jewish immigrants…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690314/recognizing-april-29-as-endjewhatred-day"}, {"senator": "Chuck Fleischmann", "party": "Republican", "sentence": "…leadership and  commitment to peace. Guided by his belief that ``war in the name of  religion is war against religion,'' Patriarch Bartholomew has built  strong relationships with religious and political leaders in every  continent to promote unity among faiths.\n\nIn 1997, Patriarch Bartholomew became the first Ecumenical Patriarch  to visit the United States,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694769/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Roger Marshall", "party": "Republican", "sentence": "…previously bestowed upon renowned figures such as  Mother Teresa, the Dalai Lama, and Archbishop Desmond Tutu.\n\nFor decades, His All-Holiness has been a steadfast advocate for  religious freedom and unity among Christians worldwide. He has  consistently called for the protection of religious minorities and has  championed the rights of Orthodox Christians…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695589/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…group, person, or entity as the Securities       and Exchange Commission may determine by rule;\n\n(2) that is not held in any facility that is owned or       operated by a religious organization, other than an       institution of higher education that is accredited and       operated primarily for post-secondary education;\n\n(3) where any advertising…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692725/helping-angels-lead-our-startups-act-of-2025"}, {"senator": "Mark Amodei", "party": "Republican", "sentence": "…Coast Guard? This bill does that.\n\nWould you like more infrastructure for the Coast Guard? This bill  does that.\n\nWould you like grants for first responders and nonprofit religious  worship institutions? This bill does that.\n\nThe foundation is undeniable. As the tax on houses of worship has  increased over the last few years, we are providing more money…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699349/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…new President not long ago, July 30, 2024. It is not  quite a year ago.\n\nPeople wonder what they are up to. Let me tell you what they are up  to. They are up to enacting a religious agenda that has no place for  anybody but them. If you are a Christian, they want to destroy your  faith. If you are Jewish, they want to wipe you off the planet. And if…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692780/iran"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…credibly accused  by human rights organizations and U.N. experts of orchestrating  systematic, state-run organ harvesting, primarily targeting prisoners  of conscience from religious and ethnic minority groups.\n\nThis is not speculation. The evidence is overwhelming. International  investigations, eyewitness testimony, and growing data confirm that  these…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690630/stop-forced-organ-harvesting-act-of-2025"}]