[{"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…the Biden administration, the National  Telecommunications and Information Administration, or NTIA, did  tremendous work to help connect all Americans to high-speed, reliable,  and affordable broadband. The historic $65 billion in broadband  investments that we included in the bipartisan infrastructure law are  helping supercharge these efforts.\n\nIt is…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690254/national-telecommunications-and-information-administration-reauthorization-act-of-2025"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…Initiative Program. Since its inception, this program has partnered  with over 25 Tribal, coastal, remote and island communities across the  Nation to help them secure reliable and affordable energy.\n\nThe Energy Transitions Initiative Partnership Program provides  customized technical and financial assistance to community projects  aimed at accessing reliable…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692645/introduction-of-the-energy-transitions-initiative-authorization-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…$375 million for electric grid  modernization to help reduce prices to target the primary driver of  skyrocketing utility bills and ensure every American has access to  reliable, affordable power.\n\nThis bill provides $3.1 billion for energy efficiency and renewable  energy programs, an increase of $1.3 billion over the Republican bill.  Our goal seeks to…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698752/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…session, with changes that--\n\n(1) are within the jurisdiction of such committee; and\n\n(2) would preserve investments in a just energy transition       and in clean, reliable, and affordable energy buildout       through development finance investments in Africa that       maximize market opportunities for United States companies and       save lives.", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693615/hr-4"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…colleagues to  join us because their constituents want healthcare, too. Everyone does.\n\nMr. Speaker, I am committed to finding ways to improve healthcare and  make it more reliable and affordable. That is what Texas families want.  That is what the American people want.\n\nMs. JOHNSON of Texas. Sure. I am Julie Johnson. I represent Texas-32.  I am from Dallas,…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688235/democratic-proposals"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…directors,  and all its members on a well-earned centennial. From working to  address our region's housing shortage and infrastructure challenges to  advocating for reliable and affordable energy, thank you for a century  of working to advance Rhode Island's and New England's economic  interests.", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696048/100th-anniversary-of-the-new-england-council"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…and sharing information about  emergencies in times of crisis; teaching children reading and social  and emotional development skills; and reaching areas that lack reliable  and affordable access to broadband internet, particularly in rural  areas.\n\nThe loss of PBS KIDS in particular would deprive millions of children  and families of formative learning…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692414/rescissions-package-corporation-for-public-broadcasting"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…Trump was trying to say. Since States have a lot of influence  in this, what we are doing here in the first bill is ensuring that  States focus on how do you make it reliable and affordable,  particularly in States like Colorado where my colleague, Mr. Evans, who  put the bill forward, is from. Their rates continue to go up because of  policies of their…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697890/electric-supply-chain-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Representative Valadao's bill, H.R.  1044.\n\nThis bill is a commonsense measure to ensure the continued operation  of existing hydroelectric facilities, which have provided reliable and  affordable power to Californians over a century.\n\nThe bill authorizes the Secretary of the Interior to issue four 10- year renewals for a special use permit for the Kaweah Hydroelectric…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693461/amendment-to-kaweah-project-provision"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…petroleum development. By denying or dramatically restricting       development in the region, the Administration is denying       Alaskans--and all Americans--reliable, affordable energy, as       well as billions of dollars in revenues. We cannot afford to       further limit U.S. production which will only increase our       reliance on foreign…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}, {"senator": "Troy Balderson", "party": "Republican", "sentence": "…and further reducing costs for consumers.\n\nBecause of the outdated regulations, a lack of coordination, and  political obstruction, critical pipelines that provide reliable and  affordable energy for our constituents have been delayed or blocked  altogether.\n\nThe truth is America's power demand is surging. To meet this  challenge and power the future,…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698070/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…which energy demand across the United States and the  entire world is growing exponentially, the Federal Government should  make it easier to produce ever cleaner, reliable, and affordable  energy. Rather than supporting domestic energy production, the Biden  administration and my friends on the other side of the aisle used the  so-called Inflation Reduction…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688187/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Troy Balderson", "party": "Republican", "sentence": "…These new  facilities are at the heart of powering the AI revolution, but we must  now figure out how we can power them while ensuring our constituents  have access to reliable and affordable energy.\n\nWe saw how close we were to power scarcity in Ohio over the summer,  as utilities warned Ohio residents to reduce energy power during peak  demand to help…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695755/guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "…the world for years  to come.\n\nOne often overlooked part of our national security is our energy  security, and our legislation will help ensure that America has a  reliable and affordable energy supply for the long term. Our bill also  helps deliver on Republicans' promise of a smaller and smarter  government. Our bill achieves $1\\1/2\\ trillion in Byrd-compliant…", "date": "2025-07-08", "source_url": "https://justfacts.votesmart.org/public-statement/1693279/one-big-beautiful-bill-act"}, {"senator": "Rob Wittman", "party": "Republican", "sentence": "…rising costs of energy,  whether it is at the gas pump or their power bills.\n\nI am proud to cosponsor this bill, H.R. 1047, because policies like  this ensure a supply of reliable, affordable electricity generation. In  turn, we want to do everything we can to lower costs for American  households while providing necessary energy.\n\nWe have challenges now.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695756/guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…It is projected that U.S. electricity demand will grow by as much as  128 gigawatts through 2029, and global energy demand is expected to  double by 2050.\n\nCoal is reliable, affordable, and essential to meet the increasing  power demands of the AI revolution and advanced manufacturing. The RMP  amendment locked up an astonishing 48 billion short tons…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696879/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…warm in their homes. Taking affordable  and reliable options off the table is not sound policy.\n\nIt is assaults like this on consumer choice and on the freedom to use  reliable, affordable energy like coal and natural gas that leave people  more vulnerable when the power goes out. That is why it matters who is  at the table. When it comes to energy policy,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695524/providing-for-consideration-of-hr-dc-criminal-reforms-to-immediately-make-everyone-safe-act-providing-for-consideration-of-hr-district-of-columbia-policing-protection-act-providing-for-consideration-of-hr-lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia-providing-for-consideration-of-hr-district-of-columbia-judicial-nominations-reform-act-providing-for-consideration-of-hr-guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act-providing-for-consideration-of-hr-national-coal-council-reestablishment-act-providing-for-consideration-of-hr-promoting-cross-border-energy-infrastructure-act-and-for-other-purposes"}, {"senator": "Troy Balderson", "party": "Republican", "sentence": "…protecting the right of every  American to choose the vehicle that works best for them. For many  consumers and entrepreneurs, they see conventional gas-powered cars as  reliable, affordable, and able to meet the needs of their families and  small businesses. Yet, the Biden administration chose to team up with  radical climate activists to support the one-size-fits-all…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690487/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…and it defends the Second Amendment and America's right  to bear arms.\n\nRepublicans are working to advance regular order and deliver results  for the American people--reliable and affordable energy, strong  national security, safe communities, and long-term fiscal  responsibility. The appropriations process works for America.\n\nI also highlight the provisions…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698748/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…this Congress, coal is rightfully  back in favor in Washington, D.C.\n\nCoal produced 16 percent of the electricity in this country last  year, and it is one of the most reliable and affordable forms of energy  that we have. It is imperative that we increase domestic production in  order to meet our ever-increasing demand.\n\nMy home State of Wyoming is responsible…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695769/national-coal-council-reestablishment-act"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…but also millions of dollars in direct State  and Federal taxes and royalties.\n\nThese dangerous policies also jeopardize the entire United States and  our access to reliable and affordable energy. These resource management  plans were just another example of the Biden administration's energy  agenda: anywhere but America, any worker but American.\n\nThey…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694892/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…Energy's recent organizational  realignment established the Office of Critical Minerals and Energy  Innovation to fortify American supply chains that are essential to a  reliable, affordable, and resilient energy industry.\n\nH.R. 3617, Mr. Speaker, will absolutely enhance the work being done  by the Trump Administration by  leveraging the expertise of the…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699990/securing-americas-critical-minerals-supply-act"}]