[{"senator": "Gabe Amo", "party": "Democrat", "sentence": "Mr. AMO. Mr. Speaker, I rise today on behalf of my constituent  Pranoy, a remarkable young adult and lifelong learner from Barrington,  Rhode Island.\n\nPranoy is driven by his dream of attending college, but that dream is  at great risk. It can only be realized…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691367/i-stand-with-the-disability-community"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "Mr. Speaker, I rise in support of H.R. 3854, the Modernizing All  Veterans and Survivors Claims Processing Act, as amended.\n\nWe are living in an era of remarkable technological advancement. It  seems every day that there is a new story about how artificial  intelligence is shaping data visualization or modeling. In fact, there  are…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695486/modernizing-all-veterans-and-survivors-claims-processing-act"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…the future of Hawaii's native species for generations to come.  By working together, we can protect one of the world's most exceptional  natural environments and ensure its remarkable biodiversity remains a  source of pride and inspiration for all.", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688377/the-hawaii-native-species-conservation-and-recovery-act"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…the first ever from New  Hampshire.\n\nOn behalf of my constituents in New Hampshire's First Congressional  District, I want to congratulate Northeast Delta Dental for their  remarkable achievement. This well-deserved recognition highlights their  commitment to high standards of care and community involvement in the  Granite State.", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688205/recognizing-the-achievements-of-northeast-delta-dental"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Executive  Board and was inducted as a Hero of the Harbor.\n\nMr. Speaker, please join me in congratulating Joseph Seebode on his  retirement. It is my privilege to recognize his remarkable  contributions to our Nation and offer my best wishes as he enters this  new stage in life.", "date": "2025-11-04", "source_url": "https://justfacts.votesmart.org/public-statement/1696524/recognizing-joseph-seebode"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…in turn support local  businesses and economic development across the State. Certainly all  film producers in Oregon and across the country should aspire to  achieve the remarkable success of ``The Goonies.''\n\nWhether we are learning important life lessons from the stalwart  friendships in ``The Goonies'' or taking note of how Oregon has grown a  film…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689533/recognizing-the-40th-anniversary-of-the-goonies"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…satisfaction regarding school choice.       Mayoral control, council oversight, and deep, targeted       investments in our students, teachers, and buildings made       these remarkable achievements possible.\n\nI look forward to continuing a productive partnership with       the Committee--one that respects the will of DC residents and       honors the principles…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695596/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "Mr. MORELLE. Mr. Speaker, I rise today in honor of Jewish American  Heritage Month to recognize a remarkable leader and educator in our  Rochester Jewish community: Monica Gurell.\n\nMonica Gurell serves as the President of Temple B'rith Kodesh, where  she has led with passion, humility,…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691572/recognizing-monica-gurell"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…engaged with the young man,  and he shared a simple, powerful message: that life is worth living and  that he was important. That heartfelt intervention saved a life. This  remarkable story is a testament to Officer Thomas's character. A belief  that we all have a gift to be something and to do something, and he has  certainly used his. His actions demonstrate…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693669/recognizing-officer-mykul-thomas"}, {"senator": "Chellie Pingree", "party": "Democrat", "sentence": "…honor to recognize  Patrick Keliher as the 2025 recipient of the Atlantic States Marine  Fisheries Commission's Captain David H. Hart Award. This recognition  honors Pat's remarkable leadership and contributions toward improving  Atlantic Coast marine fisheries.\n\nAs former Commissioner of the Maine Department of Marine Resources,  Pat spearheaded countless…", "date": "2026-02-20", "source_url": "https://justfacts.votesmart.org/public-statement/1700092/recognizing-patrick-keliher"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…rise today in support of S. 284, the Congressional  Award Program Reauthorization Act.\n\nSince its inception in 1979, the award program has honored young  people for their remarkable achievements through volunteering in their  communities, personal development, physical fitness, and exploration.\n\nThe Congressional Award is a unique initiative, completely…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698223/congressional-award-program-reauthorization-act"}, {"senator": "Richard Neal", "party": "Democrat", "sentence": "…over the Atlantic, a ``Lunar Flight'' named in honor of his  call sign, ``Moon.'' Upon his return, he was greeted by family,  friends, and fellow airmen who celebrated his remarkable career and  enduring legacy.\n\nMr. Speaker, Colonel Halasi-Kun embodies the very best of our armed  forces: courage, professionalism, and an unwavering commitment to duty.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698681/recognizing-colonel-david-moon-halasi-kun"}, {"senator": "Susie Lee", "party": "Democrat", "sentence": "…General  Kotulich's distinguished service has impacted the lives of countless  soldiers and their families.\n\nAnd she has served in several key leadership roles throughout her  remarkable career. She served as the Director of the Army Recruiting  and Retention Task Force, where she successfully integrated and  synchronized efforts across the Army Enterprise…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692707/recognizing-deputy-chief-of-army-reserve-major-general-deborah-deb-kotulich-on-her-retirement-from-the-us-army-reserve"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…often describe him as insightful, sharp- witted, and deeply dedicated to his craft. His contributions to  journalism and our community have been invaluable, leaving behind a  remarkable legacy that will be difficult to replicate.\n\nAs he embarks on this well-earned retirement, I extend my heartfelt  congratulations and gratitude for his many years of service.…", "date": "2025-03-18", "source_url": "https://justfacts.votesmart.org/public-statement/1688914/recognizing-randy-gorbmans-retirement"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…Class of 2025\n\nMr. SUBRAMANYAM. Mr. Speaker, I rise today to recognize and  congratulate the Rappahannock County High School class of 2025.\n\nThis year's graduating class is a remarkable group of students,  including future firefighters, servicemembers, college and trade school  students, and workers ready to contribute across many sectors.\n\nIn their time…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691978/recognizing-fauquier-high-school-class-of-2025"}, {"senator": "Kat Cammack", "party": "Republican", "sentence": "…disability.\n\nThat is not just wrong, but it is inhumane. It should never ever  happen again.\n\nThis bill that we are considering here today is named after Charlotte  Woodward, a remarkable woman with Down syndrome who received a  lifesaving heart transplant over a decade ago.\n\nCharlotte's story is a living, breathing testament to the truth that  we must affirm…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692717/charlotte-woodward-organ-transplant-discrimination-prevention-act"}, {"senator": "Barry Moore", "party": "Republican", "sentence": "…was commissioned in 1998. Mr.  Tucker served as Chief of Staff at Ft. Novosel, U.S. Army Aviation  Center of Excellence.\n\nColonel Tucker has served our Nation throughout a remarkable career  spanning multiple continents, commands, and combat zones. He is highly  decorated for valor and meritorious service, and his leadership has  been instrumental across…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690779/recognizing-the-accomplishments-of-colonel-richard-tucker"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…achievement serves not just as  personal fulfillment but also as an inspiration to their peers, fellow  competitors, and our community at large.\n\nIt is an honor to represent remarkable individuals such as Heather  and Jeremy in Congress. Therefore, on behalf of the United States House  of Representatives, I proudly extend my heartfelt congratulations to…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694130/dismantling-californias-citizens-redistricting-commission"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…the gross national product, GDP, will actually  be.\n\nA little while ago, they actually updated it saying the U.S. economy  looks like it is running at 3.4 percent.\n\nThat is remarkable. If you stop and think about it, this is  absolutely--think about all the headwinds and all the things over  tariffs and all these  other, the economy actually is surprisingly…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695567/we-are-borrowing-a-second"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, it is a privilege to rise today to  recognize Mr. Jose Santiago for his service at Withlacoochee River  Electric Cooperative (WREC) and his remarkable role in the Light Up  Navajo Project. In May, a courageous team of 16 WREC employees traveled  over 1,800 miles to the remote, rugged terrains of Arizona and New  Mexico,…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692641/recognizing-jose-santiago"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…Honoring Scouts Across America\n\nMr. BAUMGARTNER. Mr. Speaker, I rise today to honor Scouts Across  America. Scouts Across America carries forward with a remarkable legacy  that began with Robert Baden-Powell, a British Army officer whose  simple idea was that outdoor skills, teamwork, and service could build  better citizens and a better…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697297/recognizing-ron-hauenstein"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…Whitehorse High School team from Montezuma  Creek, Utah, for achieving national distinction in the Capitol Hill  Challenge.\n\nOut of hundreds of teams from across the country, this remarkable  group finished in the top ten. This is a truly impressive  accomplishment that speaks to their academic excellence and their  strong grasp of financial markets, economics,…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692339/recognizing-the-capitol-hill-challenge"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…Schools Prize for teaching excellence. Mr. Cook was 1  of only 25 winners throughout the entire Nation and the only teacher in  North Carolina to receive the award in 2025, a remarkable  accomplishment, Mr. Speaker.\n\nMr. Cook's passion and service with a career in technical education  have left an indelible mark on the lives of his students. There is no…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697290/recognizing-valencia-abbott"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…Rawlins led the way with a perfect 6-0 record in Lincoln-Douglas  debate, tackling the timely question of artificial general  intelligence. With four career State titles and a remarkable 29-3  record, Claire's leadership is unmatched.\n\nIn public forum, seniors U.V. Singh and Grayson Smith went  undefeated, while sophomore Dylan Hancock earned Salem's first-ever…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691284/congratulating-salem-high-school"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…department, leaving a lasting impact on those  who had the privilege of working alongside her.\n\nMr. Speaker, let us all join in congratulating Sergeant Christine  Bettis for a remarkable career with the Michigan State Police. I wish  her great happiness in retirement and thank her once more for keeping  Michigan's First Congressional District safe.", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688435/recognizing-the-retirement-of-sergeant-christine-bettis"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…Sydney  Albright, Kayla Frey, Jaclyn Martin, and Katelyn Ranck.\n\nWith their success at the 98th National FFA Convention, the students  at Garden Spot FFA demonstrated their remarkable work ethic and  devotion to agriculture--making all of Pennsylvania's 11th  Congressional District proud. I congratulate the Garden Spot FFA on  their accomplishments, and…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698930/congratulating-the-garden-spot-future-farmers-of-america"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…dear  friend, Marshall Brachman, on the occasion of his 75th birthday on July  6, 2025.\n\nMarshall has long exemplified the best of civic engagement and public  service. His remarkable career spans more than four decades, beginning  in 1978, and is defined not only by professional success but by a  deeply rooted commitment to his community, his faith, and…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693060/recognizing-the-75th-birthday-of-marshall-brachman"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "Mr. NORMAN. Mr. Speaker, I rise today to honor a truly remarkable  individual, Phil Ginn, whose unwavering commitment to his community has  been an inspiration to all of us who know him.\n\nHis lifetime of service to his family, to his faith,…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688470/recognizing-phil-ginn"}, {"senator": "John Boozman", "party": "Republican", "sentence": "…the region and beyond. May their legacy continue to inspire  generations of women to lead with courage, serve with compassion, and  uphold the values that have defined a remarkable first 100 years.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695796/recognizing-100-years-of-the-gamma-nu-chapter-of-kappa-kappa-gamma"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…this important piece of legislation.\n\nI haven't been here very long in this body, but I have learned  something, and it is amplified today. That is that this town has a  remarkable ability to snatch disagreement out of the jaws of consensus.  This is an issue that liberal thinkers and conservative thinkers have  both said is a problem that we ought…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689716/no-rogue-rulings-act-of-2025"}]