[{"senator": "Sheila Cherfilus-McCormick", "party": "Democrat", "sentence": "…in its       traditions;\n\nWhereas, as they reunite for their final concert at Amerant       Bank Arena, this momentous occasion is not just a celebration       of their remarkable career, but also a tribute to the unity,       resilience, and cultural vibrancy of the Haitian community.       Their music has uplifted hearts, provided solace, and…", "date": "2025-08-12", "source_url": "https://justfacts.votesmart.org/public-statement/1694734/9999"}, {"senator": "Eric Swalwell", "party": "Democrat", "sentence": "…impact on public education. Her legacy is one  of integrity, dedication, and a deep commitment to the belief that  every child deserves a champion. We thank her for her remarkable career  and wish her continued success in all her future endeavors.", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691728/recognizing-parvin-ahmadi"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "Mr. MORELLE. Mr. Speaker, I rise today to honor the remarkable career  of Peter Robinson, the Vice President for Government and Community  Relations at the University of Rochester, who retired at the end of  March after more than 35 years…", "date": "2025-04-17", "source_url": "https://justfacts.votesmart.org/public-statement/1690121/recognizing-peter-robinsons-retirement"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…public health crises, or civil unrest, she ensured that the  Guard remained a trusted force for stability and service in our  Colorado communities.\n\nMajor General Clellan's remarkable career has had a lasting impact  and has inspired generations of service members, particularly women  pursuing leadership roles in uniform. Her service reflects the very  best…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696265/recognizing-major-general-laura-clellan"}, {"senator": "Susie Lee", "party": "Democrat", "sentence": "…Kotulich's distinguished service has impacted the lives of countless  soldiers and their families.\n\nAnd she has served in several key leadership roles throughout her  remarkable career. She served as the Director of the Army Recruiting  and Retention Task Force, where she successfully integrated and  synchronized efforts across the Army Enterprise to…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692707/recognizing-deputy-chief-of-army-reserve-major-general-deborah-deb-kotulich-on-her-retirement-from-the-us-army-reserve"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…she lent her expertise to the U.S. Army Medical Research and  Materiel Command and the Naval Research Laboratory.\n\nA Marylander to her bones, Maryam prepared for this remarkable career  at the Free State's world class colleges and universities. She's earned  degrees at the University of Maryland-College Park, Hood College, and  the University of Baltimore…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695862/congratulating-ms-maryam-azarion-on-her-retirement-after-more-than-25-years-of-federal-service"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…and supported countless  colleagues, businesses, and community partners.\n\nMr. Speaker, it is with great pride and deep appreciation that I  recognize Jim Brown for his remarkable career and his enduring  contributions to the Rochester community. His legacy of service will  continue to benefit our region for years to come, and his leadership  will be…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697211/recognizing-jim-brown"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…questions from Members and staff throughout  Capitol Hill. Matt returned to my team as a Staff Assistant and  Legislative Correspondent. From there, he embarked on a remarkable  career with our office, holding nearly every position--from Staff  Assistant to Legislative Correspondent to Legislative Assistant, and  even a brief stint as Scheduler--until…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693380/recognizing-matt-jansen-and-his-service-to-the-house-of-representatives"}, {"senator": "Richard Neal", "party": "Democrat", "sentence": "…the Atlantic, a ``Lunar Flight'' named in honor of his  call sign, ``Moon.'' Upon his return, he was greeted by family,  friends, and fellow airmen who celebrated his remarkable career and  enduring legacy.\n\nMr. Speaker, Colonel Halasi-Kun embodies the very best of our armed  forces: courage, professionalism, and an unwavering commitment to duty.  His…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698681/recognizing-colonel-david-moon-halasi-kun"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…that Ted met his wife, Carol. They  settled in Pearl River, New York, where they raised their children,  Traci and Craig, before later moving to Stony Point.\n\nTed built a remarkable career at Ted Schultz Auto Sales, relocating  the dealership to Nanuet and growing it into a nationally ranked Ford  dealership while earning numerous President's Awards.\n\nBeyond…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699118/recognizing-and-thanking-nate-soule"}, {"senator": "Randy Feenstra", "party": "Republican", "sentence": "…like to thank  Becky for the incredible work she has done for the state of Iowa--and  our great Nation. I ask my colleagues to join me in honoring Becky  Koenig for a remarkable career and wishing her all the best in  retirement.", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693558/recognizing-becky-koenig"}, {"senator": "Barry Moore", "party": "Republican", "sentence": "…commissioned in 1998. Mr.  Tucker served as Chief of Staff at Ft. Novosel, U.S. Army Aviation  Center of Excellence.\n\nColonel Tucker has served our Nation throughout a remarkable career  spanning multiple continents, commands, and combat zones. He is highly  decorated for valor and meritorious service, and his leadership has  been instrumental across…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690779/recognizing-the-accomplishments-of-colonel-richard-tucker"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…packed arenas not only to watch  world-class bull riding, but to be entertained by Flint's iconic  performances that became a hallmark of PBR events.\n\nIn recognition of his remarkable career, Flint was inducted into the  National Rodeo Hall of Fame in 2024 and the Bull Riding Hall of Fame  last year. Flint Rasmussen didn't just shape Montana's rodeo culture,…", "date": "2026-01-27", "source_url": "https://justfacts.votesmart.org/public-statement/1699393/recognizing-rodeo-hall-of-fame-member-flint-rasmussen"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…students. His dedication to academic  excellence, innovative partnerships, and community service have  advanced the institution's legacy and I want to congratulate Jim on his  remarkable career, thank him for his decades of service to Loras  College, and wish him all the best in this well-deserved retirement.", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694164/congratulating-loras-college-president-james-collins-on-his-retirement"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "Mr. LAWLER. Mr. Speaker, today, I rise to honor the remarkable career  and lasting legacy of Congresswoman Nita Lowey. As the first woman to  chair the House Appropriations Committee, she shattered barriers and  paved the way for so many…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689209/in-memory-of-the-honorable-nita-m-lowey"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…and passion for public safety have spanned more than  four decades. Mike's commitment to his community is truly inspiring,  and his retirement marks the conclusion of a remarkable career devoted  to serving others. I am honored to recognize him for his extraordinary  service and congratulate him on his well-earned retirement. I wish Mike  and his loved…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697208/congratulating-mike-oltman-on-his-retirement-with-the-woodford-county-emergency-management-agency"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…committed public servant, and his  contributions to the United States Postal Service will not be  forgotten.\n\nMr. Speaker, I ask my colleagues to join me in celebrating the  remarkable career of Joseph Bongarzone and wishing him a fulfilling and  well-deserved retirement. May his legacy of integrity, commitment, and  service continue to inspire future generations…", "date": "2025-03-21", "source_url": "https://justfacts.votesmart.org/public-statement/1688925/recognizing-joseph-bongarzones-retirement-with-the-united-states-postal-service-after-37-years"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…whom  he served.\n\nAfter earning his degree from the University of Iowa, Colonel Twedt  received his commission in 1999. This marked the beginning of a new  chapter in a remarkable career that advanced from the enlisted ranks to  the highest levels of leadership within the Iowa Air National Guard.\n\nHis service carried him to many parts of the world, including…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696101/recognizing-the-service-of-colonel-trenton-n-twedt"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…for many years. Dr. Quirk-Bailey's  unwavering commitment to student success and workforce advancement is  truly inspiring, and her retirement marks the closure of a remarkable  career devoted to improving lives through education. I am honored to  recognize her for her extraordinary service and congratulate her on her  well-earned retirement. I wish…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697402/congratulating-dr-sheila-quirk-bailey-on-her-retirement"}, {"senator": "Joni Ernst", "party": "Republican", "sentence": "…and sacrifice.\n\nI also have a profound appreciation for Amy, his wife, who has such a  tremendous and beautiful spirit, and for their family, whose support  made this remarkable career possible.\n\nAs he moves into his next chapter, his legacy will endure in the  strength of the U.S. Army and in the countless soldiers who are better  leaders and better…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699779/9999"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…friend, Marshall Brachman, on the occasion of his 75th birthday on July  6, 2025.\n\nMarshall has long exemplified the best of civic engagement and public  service. His remarkable career spans more than four decades, beginning  in 1978, and is defined not only by professional success but by a  deeply rooted commitment to his community, his faith, and…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693060/recognizing-the-75th-birthday-of-marshall-brachman"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…impacted thousands of students who  attended and graduated from Loras College.\n\nI congratulate Jim, his lovely wife, Lisa, and their children and  grandchildren on this remarkable career. I thank him for his decades of  service to Loras College and wish him all the best in his well-deserved  retirement.\n\nGo Duhawks.", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694181/congratulating-the-honorable-james-knecht-illinois-fourth-district-appellate-court-justice"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…department, leaving a lasting impact on those  who had the privilege of working alongside her.\n\nMr. Speaker, let us all join in congratulating Sergeant Christine  Bettis for a remarkable career with the Michigan State Police. I wish  her great happiness in retirement and thank her once more for keeping  Michigan's First Congressional District safe.", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688435/recognizing-the-retirement-of-sergeant-christine-bettis"}]