[{"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…the process to hide from the  American people what is happening and to protect their Members from  having to take a vote about this sweeping intrusion into our privacy.\n\nRemarkably, Palantir has even said they are willing to support the  resolution. That hasn't been enough for our Republican colleagues. This  is the time for sunlight instead of fear…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698920/ending-improper-payments-to-deceased-people-act"}, {"senator": "Veronica Escobar", "party": "Democrat", "sentence": "Ms. ESCOBAR. Mr. Speaker, I rise today to recognize Jennifer and  Stephanie Han, two remarkably accomplished sisters from El Paso whose  dedication and success in women's boxing has inspired all of us.\n\nJennifer Han, former IBF world featherweight champion and soon-to-be…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688664/recognizing-jennifer-and-stephanie-han"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…same thing, given the rhetoric we have all heard over the  last several years.\n\nSo I encourage the American people to watch what House Republicans  do, not what they say.\n\nRemarkably, instead of lowering costs, this reckless budget  resolution bestows tax cuts for the wealthiest 1 percent of Americans  while jeopardizing essential healthcare and nutrition…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688039/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…all these countries to reverse that history? Would the President wield  our military as tax-funded security for the expansion of American oil  giants in these markets?\n\nRemarkably, incredibly, this seems to be his plan. President Trump  has floated sending American troops to secure U.S. companies to rebuild  Venezuela's oil infrastructure. He has even…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698608/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…Garland combined  for over 120 takeaways and 180 ground balls, while goalie Richard Hof  made 125 saves. Face-off specialist Ryan Warren won nearly 70 percent  of his draws. Remarkably, seven players earned first team all-State  honors.\n\nI commend Coach George Revercomb, his staff, and Athletic Director  Drew Barrett. This championship reflects the spirit…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693527/congratulating-central-high-school-womens-softball-team"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…him the Congressional Gold  Medal, Congress' highest honor. This distinguished award has been  bestowed upon such luminaries as George Washington and Winston  Churchill. Remarkably, the legislation for His All-Holiness's Gold  Medal attracted more of the Members of Congress as cosponsors than any  other bill introduced during that entire congressional…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695653/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…product.\n\nWonderful. We are trying to explain that this is a segment of the tax  code we are trying to make easier and more efficient. Once again, just  read the bill. It is remarkably simple.\n\nMr. Speaker, you have an excise tax. You have to go through all these  steps to collect it then to refund it.\n\nSo my friend from California--he is a good guy. We…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700037/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…and  ethical governance flourished under his leadership, with UWPC earning  the highest 4-star rating from Charity Navigator for four consecutive  years and maintaining a remarkably low 6.5 percent overhead. Charles  built strong partnerships with local, state, and federal leaders,  ensuring UWPC played a key role in disaster response and community…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690203/recognizing-chuck-anderson"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…the passion?  Where is the vision? Where is the innovation? Where is the optimism?\n\nLook, I am 63. My wife is 63. I have a 3-year-old and a 9-year-old.  The 9-year-old is remarkably loud.\n\nWe are blessed. We were able to adopt. It is the most greatest joy in  life.\n\nMathematically, my children will be part of the first generation that  is going to be…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694915/facts-and-math"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…The cost of healthcare--it is always fascinating, I always thought I  would get beaten up for saying this behind the microphone, and,  shockingly, we have had people being remarkably kind to us.\n\nThe economist in my Joint Economic Committee--and it was a hard  report to write--a couple years ago wrote a major study saying: What  does obesity cost America?…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693062/stop-bathing-in-folklore-and-start-bathing-in-math"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…slightly sarcastic,  but the math here is really important.\n\nI am going to do it backwards from how I originally thought because I  want to hit a couple of things that are remarkably important.\n\nI have come behind this microphone, heaven knows how many times and  shown the charts. We are borrowing $72,000 a second. We could borrow as  much as $2.3 trillion…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691518/truth-telling-with-math-and-facts"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…last week, where we were  trying to explain some of the things we see going on in the math. I  want to walk through a concept.\n\nWe actually, right now, as a country, are remarkably blessed. The GDP  growth, the economic growth, is actually well beyond almost any of what  even my economists were predicting over the last year.\n\nWe are seeing some data…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699000/growing-the-gdp"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…with us, the President is  absolutely right.\n\nWe have a whole presentation we have done here showing a talent- based, a STEM-based immigration system that turns out to be remarkably  beneficial for tax receipts, for economic growth, and for prosperity.  It turns out you need that as one of an entire unified theory of things  to do.\n\nI want to walk through…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689025/tell-the-truth-about-math"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…giving back. He  volunteered with the U.S. Forest Service in the Bridgeport Ranger  District, helping maintain campgrounds for the benefit of residents and  visitors alike.\n\nRemarkably, even as he approaches his 100th birthday, he continues to  harvest and donate firewood each winter to neighbors in need, quiet  acts of kindness that say as much about his…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699151/misguided-policy-in-california"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…health committee, so I have some experience on Arizona, which has a  very unique Medicaid system. We buy basically managed care policies for  our indigent population.\n\nIt is remarkably good. It is remarkably efficient. It may have the  highest satisfaction rate in the entire Nation. It is something worth  thinking about.\n\nLet's get down to the brass tacks…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688088/republican-budget"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…morality  of--and it is also really good economics.\n\nMr. Speaker, I have two last boards. I want to make a point. We  updated this as of a couple of hours ago. We are actually remarkably  lucky. In other industrialized countries, the debt is starting to scare  the hell out of bond markets. A bunch of our longer term--10 years and  out--have actually been…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695567/we-are-borrowing-a-second"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…going on.\n\nWe just had a doctor of radiology in our office. He walked us through  the statistical abstract of breast cancer and the scans and showed that  his AI platform was remarkably more accurate. It is cheaper, faster,  and more accurate. Why wouldn't we embrace it? We don't reimburse it.\n\nThe barriers to entry here are protection rackets saying we…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694131/dismantling-californias-citizens-redistricting-commission"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Medicaid.\n\nI used to do my State's Medicaid budgets. Arizona has a somewhat  unique system. We actually buy managed care capitated policies for our  indigent population. It is remarkably effective, and we deliver  remarkably effective healthcare cheaper than almost every other State  in the country, demonstrating that planned design, managed design, can…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688035/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…talk about  something that is really interesting. The economy from a GDP  calculation standpoint, and this is just the economists looking at the  vitality in the economy, is remarkably good. We are running over a 5  percent GDP, which if you go back and look at the economic projections,  it is double what many of our smartest economists in the country…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699257/debt-deficits-and-demographics"}]