[{"senator": "Betty McCollum", "party": "Democrat", "sentence": "…intended for our small  businesses. As Trump administration and ICE are terrorizing our  community and small businesses, it is more important than ever that the  CDFI Fund remain fully funded to assist small business owners as our  community rebuilds after this crisis.\n\nWhile these bills were not ideal, I urge my colleagues to support  this bipartisan…", "date": "2026-01-27", "source_url": "https://justfacts.votesmart.org/public-statement/1699388/supporting-hr-7006"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…reports dealing with so many provisions,  antifraud, manipulation. You can't commingle funds.\n\nBut let me be clear: The bill isn't perfect. I have been vocal about  that, too.\n\nI remain concerned about the absence of meaningful conflict-of- interest provisions dealing with the executive branch. It doesn't  matter who occupies the White House. The bottom line…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693791/digital-asset-market-clarity-act-of-2025"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…without incurring more  debt than they could ever pay off.\n\nThe Trump administration's illegal actions to dismantle the  Department of Education will ensure that these gaps remain. The  administration claims that it is just returning control of public  education back to States and localities. States and localities have  always had that control, but they…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689639/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…Ukraine and other free nations that used to be part of the Soviet  Union. Putin also wants a veto over defense measures being taken in the  former Warsaw Pact states that want to remain free. Putin doesn't want  that. This means he wants to dictate the fate of many of our NATO  allies in Europe and beyond.\n\nInstead of strategically pushing back on Putin's…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691084/liberty-versus-dictatorship"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…that Ukraine is responsible for the invasion,  they are lying.\n\nYesterday's anniversary reminds us that the Ukrainian people continue  to suffer, but I know that they will remain strong and resilient. This  is not a regional fight. Ukraine's sovereignty is a U.S. national  security issue. We must hold the line in Ukraine now or we may have  American…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687990/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…the right thing by the  Miccosukee Tribe and pass this veto override. Let's ensure that this  Tribe continues to have access to the historic Osceola Camp and their  homelands remain protected for future generations.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698657/miccosukee-reserved-area-amendments-act-veto-message-from-the-president-of-the-united-states"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "…Independent, and Democrat--was  horrified at this, and the administration, ultimately, had to abandon  their family separation policy.\n\nStill, today, over 1,000 of these kids remain separated from their  parents. Yet, despite this despicable, absurdly cruel policy, a 2018  study found zero--zero statistically significant relationship between  the family…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695359/stop-illegal-entry-act-of-2025"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…and       solar PV projects.\n\n``With the pushing forward of deadlines, renewable capacity       additions are now projected to peak in 2027, then decline in       2028 and remain stable through 2030,'' the agency said.       ``After this period, renewable power growth will rely largely       on state-driven renewable portfolio or clean energy standards…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696127/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…keep their home.\n\n``Since the inception of the Veterans Affairs Servicing Purchase  program (VASP) in May 2024, over 17,000 veterans have been able to  avoid foreclosure and remain in their homes.''\n\nThis represents 0.46 percent of the 3.7 million total loans under the  VA home loan program.\n\n``VASP was established as a last resort option within VA's…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689686/prioritizing-veterans-survivors-act"}, {"senator": "Scott Peters", "party": "Democrat", "sentence": "…about producing the cleanest, most  efficient natural gas on the market.\n\nRepealing the fee would hurt American industry by eliminating  incentives to modernize operations and remain competitive in an  international market that increasingly values low-emission energy.\n\nNow, I am supposed to get up here and bash Big Oil, but actually, Big  Oil is for the…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688174/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "…Our Nation's Capital           Emergency Act Which Would Allow Dangerous Officers Who           Have Been Terminated for Criminal Conduct or Police           Misconduct to Remain Employed as D.C. Metropolitan Police           Officers Endangering Public Safety, Evading           Accountability, and Eroding Public Trust.\n\nDear Representative: The American…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692304/protecting-our-nations-capital-emergency-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…changed.\n\nThe numbers of agents in Minneapolis may be reduced, but the  tactics--the police state and paramilitary tactics--that have caused  this brutality and violence will remain the same unless we take action.  The reduction in numbers of agents is a hollow and disingenuous attempt  to nullify the intense criticism that DHS is seeing--a criticism and…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699650/9999"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…withhold the benefits of Americans as a result of mistakes made by the  Social Security Administration. Instead of making the Social Security  Administration work better and remain solvent, the Trump administration  is accusing seniors of fraud and calling their earned benefits waste.\n\nThe fraud is an unelected billionaire, the richest man in the world,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690424/social-security-administration-is-there-to-help-not-hurt-americans"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…rescinded within the prescribed 45-day period, such amounts must be  made available for obligation,'' which requires that the ``budget  authority must not be expired.'' And I remain in agreement with Senator  Lindsey Graham and Representative Hal Rogers, as the Senate Chairman  and House Ranking Member of the Subcommittee on State, Foreign  Operations,…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694158/senate-amendment-to-hr-4"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…sources  of clean energy. The proof is really in the pudding here. The Trump  Department of Energy recently forced two fossil fuel plants that were  days away from retiring to remain open and is directly forcing  homeowners hundreds of miles away from these plants to pay to keep the  plants online.\n\nThe Consumers coal plant in Michigan was slated to close…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695765/national-coal-council-reestablishment-act"}, {"senator": "Troy Nehls", "party": "Republican", "sentence": "…achieve the broadest implementation and  the greatest safety benefits in the most efficient and effective manner  possible.\n\nThe ROTOR Act isn't perfect. No bill ever is. But I remain committed  to working with my colleagues to strengthen aviation safety without  placing unnecessary burdens on those we depend on to keep America  flying.", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700109/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…mother-in-law risked her life  crossing the DMZ lines multiple times to rescue loved ones from the  North Korean regime. To this day, tens of thousands of Korean families  remain separated by a system that tears apart communities and crushes  basic human dignity.\n\nNow more than ever, as socialist ideas gain traction here at home-- and as our Nation's…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697152/denouncing-the-horrors-of-socialism"}, {"senator": "Mike Collins", "party": "Republican", "sentence": "…practices  when integrating AI into their businesses.\n\nThrough this legislation, we will level the playing field. We will  ensure small businesses have the ability to modernize and remain  competitive against their larger counterparts. Main Street is what  keeps the American spirit alive. With this bill, we will ensure that  Main Street is safe for generations…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700126/small-business-artificial-intelligence-advancement-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…while  still preserving the regulations that work.\n\nThe DUMP Red Tape Act strengthens our commitment to a pro-job, pro- innovation economy by ensuring that Federal agencies remain accountable  and responsive to the needs of Main Street.\n\nMr. Speaker, with that in mind, I urge my colleagues to vote ``yes''  on H.R.\n\nMr. WILLIAMS of Texas.  Hageman).…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697346/destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…service, community, and care for all seniors in  Wood County. The hard work and spirit shown by staff at the Committee  have made it possible for countless older adults to remain independent  and improve their quality of life.\n\nFounded in 1975, the Wood County Committee on Aging was established  to provide comprehensive services to the county's seniors.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695853/recognizing-the-semicentennial-of-the-wood-county-committee-on-aging"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…through a voter initiative  to make crime illegal again, passed overwhelmingly by California voters  in 2024, but we have a long way to go to reverse the reckless laws that  remain on the books and protect Californians from the most heinous of  offenders.                                Cost of Living\n\nMr. KILEY of California. Mr. Speaker, it is undeniably…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700217/prices-in-california-are-too-high"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…administration vetoed the resolution,  choosing to prioritize leftwing environmental and social issues ahead  of retirees' financial security.\n\nAs chairman of the HELP Subcommittee, I remain committed to  protecting the retirement savings of workers, retirees, and their  families. The Protecting Prudent Investment of Retirement Savings Act  would codify that retirement…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699156/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…General.--The Committee on Foreign Relations shall keep       verbatim transcripts of all committee and subcommittee       meetings and hearings and such transcripts shall remain in       the custody of the committee, unless a majority of the       committee decides otherwise. Transcripts of public hearings       by the committee shall be published…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691700/us-senate-committee-on-foreign-relations-rules-of-procedure"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…fictitious       applicants receiving Obamacare subsidies.\n\n100 percent of the fake applicants were approved for       subsidies in 2024.\n\n18 out of 20 (90 percent) fake identities remain enrolled       and subsidized in 2025, proving the system cannot detect       fraudulent identities.\n\nMarketplaces approved coverage even when required documents       were…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698438/uncovering-widespread-fraud-in-obamacare"}, {"senator": "Mike Crapo", "party": "Republican", "sentence": "…eliminate obstacles preventing families and  caseworkers from accessing the records needed for recovering America's  POWs and MIA.\n\nThis POW/MIA Recognition Day, and every day, I remain deeply grateful  for the committed individuals and groups, such as the POW*MIA Awareness  Rally Corp. of Pocatello, ID, and others across our country who keep an  unwavering…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695075/national-powmia-recognition-day"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…her high school sweetheart, Sheriff Lane Akin,  and they raised several children and have many more grandchildren.\n\nAfter retiring early from teaching, Kay has continued to remain  involved in our community through numerous initiatives. She is a  longtime volunteer with the Helping Hands program to provide clothing  for those in need in the Wise County…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690286/recognizing-congressional-patriot-award-recipient-kay-akin"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Saseen speak to the sense of  family and shared purpose that defines Gallery 209.\n\nAs Savannah continues to grow, Gallery 209 stands as a reminder that  local art and culture remain essential to our community. I commend its  artists for sustaining this tradition and wish them continued success  for generations to come.                           Recognizing…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698926/recognizing-riverview-hotels-110th-anniversary"}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "…Unfortunately, cartels are now using technology like miniature remote  control drone ships to  smuggle drugs across our maritime border.\n\nWithout this legislation, the Coast Guard would remain unable to  prosecute criminals who are using these remote control autonomous  vessels.\n\nThe Coast Guard Authorization Act of 2025 also expands the Coast  Guard's and Customs…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688519/coast-guard-authorization-act-of-2025"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…group or individual seeking to do us harm with this emerging  technology. The Generative AI Terrorism Risk Assessment Act ensures  that our homeland security and capabilities remain ahead of adversary  tactics.\n\nOur response cannot be reactive. We must anticipate the future of  terrorist methods and be prepared before these threats materialize.\n\nMr. Speaker,…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696918/generative-ai-terrorism-risk-assessment-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…other facilities nationwide.\n\nMr. Speaker, correctional officers serve with professionalism and  courage. As we recognize these important law enforcement officers this  week, I remain committed to resolving these challenges to protect those  who protect our communities. They deserve our full support, and I thank  all correctional officers for their service.", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690778/recognizing-national-correctional-officers-week"}]