[{"senator": "Patty Murray", "party": "Democrat", "sentence": "…totally upended because Trump yanked the  funding. That research is halted and that researcher is forced to move  on to topics that don't rely on NIH funding.\n\nIt is worth remembering, for many of our rare, deadly diseases, cures  are not viewed as a payday for private investors, which makes NIH not  just the best hope for finding a cure but the only…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695670/cloture-motion"}, {"senator": "Rob Menendez", "party": "Democrat", "sentence": "…sustained  serious injuries and five of whom have passed away since the attack,  including Brian Sicknick, a New Jersey native and a proud Capitol  Police officer.\n\nInstead of remembering and healing from the events of that day,  President Trump pardoned close to 1,600 seditious and violent  insurrectionists who were convicted of criminal charges. The President…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698775/holding-ice-accountable"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…to  have. Chairman Rogers handled that incredibly well. It was a very fair  debate, a fair discussion, and we produced what I think was an  excellent product.\n\nIt is worth remembering what is in that base bill. The single biggest  thing is acquisition reform, which is every little bit as important as  it is boring to talk about. It is hard to dive into…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695253/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…loved       and knew, You showed us how to live with grace, with courage       strong and true. And when the wind sings through the Gombe       trees, chimps call at dawn, Remembering one who loved them--      Though she's gone, her work lives on.", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696844/the-ballad-of-jane-goodall"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…sufferings. The women in Six Triple Eight have  suffered erasure. It removes their names from the rolls and gravestones  from the earth. It doesn't just forget. It forbids remembering.\n\nThese 885 women who put together 17 million pieces of mail that kept  the morale of our troops high were given no recognition until today,  after 80 years. I thank Speaker…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690321/ending-of-dei-programs-through-executive-order"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…monuments, our memorials, our museums, and our public spaces are the  places in which those memories are inscribed.\n\nNow, I begin tonight with a simple premise: that the act of  remembering is a deeply political and a deeply powerful act. So, too,  is the act of erasure, of erasing and removing history. These are not  merely acts of omission, but acts of power,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699713/rewriting-history"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…certified  as the President of the United States, as the winner of the 2020  election. And democracy, though bent and battered and bruised, was not  broken. That is what we are remembering here this evening.\n\nBut today, we confront something that perhaps is even more sinister  than the heinous violence that occurred that day. Today, we face the  systemic attempt…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698517/anniversary-of-january-6"}, {"senator": "Derek Tran", "party": "Democrat", "sentence": "…unyielding commitment to preserving our history and to ensuring that no  Communist regime can rewrite our history.\n\nMr. Speaker, I urge my colleagues to join me in not only remembering  the hardships we face, but also in celebrating the incredible  resilience of the Vietnamese people. Let us honor the lives of those  who sacrificed everything for freedom:…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690347/recognizing-black-april"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…H.R. 5346, the Fair and Accountable  IRS Reviews Act.\n\nMr. Speaker, I thank Chairman Jason Smith for putting this bill on  the floor, and I thank the gentleman for always remembering that it is  better to do things in a bipartisan way.\n\nThis bill clarifies procedures under section 6751 of the Internal  Revenue Code and fixes an ongoing controversy regarding…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697250/fair-and-accountable-irs-reviews-act"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…CROCKETT. If we are going to be real about crime, about  communities, about second chances and even third chances, then it needs  to start with us looking in the mirror and remembering that even the  author of this bill has a story, too, before he tries to lecture D.C.  on safety.\n\nIt would be complete hypocrisy to have, hypothetically, someone  convicted…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695555/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…was marked by persistence,  compassion, and vision. She left our country better than she found it,  and her record of achievements continues to touch lives every day. In  remembering her, we not only honor her history, but we recommit  ourselves to the unfinished work of justice and inclusion she so  valiantly advanced.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695548/moment-of-silence-for-mary-rose-oakar"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…horrific act by a white  supremacist.\n\nRepresentative Wendell Gilliard has introduced a hate crime bill. It  still hasn't been passed. We must pass it.\n\nToday isn't just about remembering the Emanuel Nine. It is also about  confronting the attacks on Black history. President Trump called the  African-American history museum oppressive and gave Vice President…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692130/defending-black-history"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…had a chance over the weekend to do a couple of things. Friday,  Saturday, Sunday, and Monday, I had a chance to visit churches and  groups that were celebrating Dr. King, remembering Dr. King. I went to  First Baptist Church of Highland Park, Faith Temple No. 2, and the AKAs  had a day of service that I was happy to attend and have a chance to  speak…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699200/building-a-beloved-community"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…Their leadership strengthened our  institutions. Their resilience expanded the promise of American  democracy. As we observe Black History Month, let us commit not only to  remembering this history but to protecting it, teaching it, and  honoring those who continue to serve today. The strength of our  military and our democracy depends on truth, inclusion,…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699864/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…the people of Minnesota.\n\nI particularly extend my sympathies to my House colleagues  representing the Minnesota delegation. We mourn the loss of Melissa and  Mark Hortman, remembering their lives and the lasting impact they had  on the State they loved so deeply.\n\nWe send warm wishes of recovery to John and Yvette Hoffman, who have  displayed true courage…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692859/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…Mr. Speaker, President Calvin Coolidge once  said, ``The nation which forgets its defenders will be itself  forgotten.'' His words perfectly encapsulate the importance of  remembering our Vietnam War veterans.\n\nI rise today with great honor to recognize the legacy and great  sacrifice of our Vietnam War veterans through The Wall That Heals,  which will…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690073/town-of-hilliard-remembers-our-vietnam-veterans"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…sister, Betty.  We offer them our condolences and our heartfelt prayers.\n\nMr. Speaker, please join me, and all members of Pennsylvania's 13th  Congressional District, in remembering the incredible life and legacy  of Lieutenant Lloyd Peck.", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688957/president-trump-bringing-back-investments"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "…supported that  resolution that you just announced that passed. It is very meaningful  to North Dakota, and I express my appreciation for the support.                       Remembering James Richard Bjorge\n\nMr. President, ``James Richard Bjorge, child of God, went home to be  with his Lord and Savior, Jesus Christ, on September 29, 2025. He was  94.''…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696152/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "…given, but as  history has illustrated time and time again, women have found ways to  push forward and to pioneer better ways.\n\nAs we honor the women who come before us by remembering, I hope we  will be grateful and humble to have inherited the progress of past  generations. As Americans and visitors to our country visit the  Nation's Capital and explore…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689363/womens-history-month"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…Sugohasyeosseumnida\n\nSugohasyeosseumnida Take that, Doug.\n\nMr. MOORE of Utah. Mr. Speaker, we will continue on to the great  State of California with bipartisan voices in support and in  remembering Mr. LaMalfa.\n\nI yield to the gentlewoman from California (Ms. Lofgren).\n\nMr. MOORE of Utah. The list is very long of individuals on this side  of the aisle that like to…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698737/9999"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…job very well done.  Their incredible win is inspiring. They have made their community and  the State of Florida very, very proud. God bless. Go Raiders.                    Remembering Captain Allen Colby Brady\n\nMr. PATRONIS. Mr. Speaker, I am privileged to represent more than  75,000 veterans that I represent in my district in northwest Florida.  Florida…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691271/congratulating-northwest-florida-state-womens-basketball-team"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…Semitism  and anti-Semitic violence into some immigration gotcha game.\n\nWhat are we thanking ICE agents for in a resolution commemorating and  condemning anti-Semitism and remembering and honoring the victims when  there were no ICE agents there? ICE has nothing to do with it. It is  because ICE is spending so much time pulling nonviolent, noncriminal…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692192/denouncing-the-antisemitic-terrorist-attack-in-boulder-colorado"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…President Trump. We told them what we were going to do. It is now time  to do it, and this is step one of that process.\n\nThe ranking member referenced the American people. We are remembering  the American people, exactly what we told them, and why they elected  us. To do all of that, it takes resources, particularly the one that  focuses in our committee on…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688069/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…they have given back to our Buckeye State communities. We are  cheering them on and can't wait to see what they will achieve in the  years ahead.                         Remembering Matthew Juniper\n\nMr. TAYLOR. Mr. Speaker, I rise today to remember Matthew Juniper, a  former member of the Wellston Police Department, who tragically passed  away on August…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695223/congratulating-miss-ohio-olivia-fosson-and-miss-ohios-teen-allison-payton"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…years later, they still get together and talk and visit,  catch up with each other. There are survivor networks that still engage  and still keep in contact with each other, remembering what happens  when out-of-control anger took the lives of 168 people.\n\nOn that sacred ground, there is still a quiet reflection pool. There  are 168 chairs there to remind…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690112/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}]