[{"senator": "Al Green", "party": "Democrat", "sentence": "…This is one of the remedies that we have. It is probably  the only one that we have currently that we can impose upon the  Congress for a vote; it is impeachment.\n\nThe other remedy is one that belongs to this country and has been  here since, probably, before the arrival of the pilgrims at Plymouth  Rock; the farmers coming to Washington, D.C., with their…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694943/bloody-sunday-and-voting-rights-act"}, {"senator": "Nelida Pou", "party": "Democrat", "sentence": "…educational outcomes, and the negative consequences for  our kids will be felt for years to come.\n\nOur school districts have been willing to work with the Trump  administration to remedy any issue to find a fair path forward, but  that willingness has not been matched.\n\nAcross the U.S., the Department of Education is dismantling public  schools. New Jersey…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698570/lodi-teachers-recognition"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…gouging and political spin.\n\nIf we want to protect our food supply and keep our family farms  alive, we must accelerate development of a safe and effective vaccine  and flu remedy as well as coop control and sanitary protocols. Farmers  can't afford to have their flocks wiped out time and again.\n\nOn this National Egg Day, I stand with the people who…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691814/recognizing-national-egg-day"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…by avoiding the  constitutional responsibilities imposed upon him by his oath of office,  by the Constitution itself, I believe that when  he does this, impeachment is the remedy. If the courts cannot control  him and my Republican colleagues, who have the majority in the House  and the Senate, won't control him, then the only thing left is  impeachment.…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692296/and-still-i-rise-denouncing-the-presidents-authoritar-ianism-and-recognizing-the-impeachment-warriors"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…is exactly the opposite of  what we need in rural America.\n\nMy Republican colleagues know exactly how devastating these Medicaid  cuts will be. That is why they attempted to remedy the situation by  including a $50 billion rural health transformation grant in their Big  Beautiful Bill. Let's do some math here. They are cutting $1 trillion  out of Medicaid,…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698601/healthcare"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…normal politics up until that  dramatic confrontation between the executive branch and the judicial  branch, for which the Constitution, as we know, really has no  prescribed remedy.\n\nFor many Americans, they may breathe a sigh of relief that America's  most influential private sector leaders would rise up to defend  democracy; that if this confrontation…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690111/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…satisfied.\n\nThis is a temporary change that will give Congress time to assess its  overall efficacy and conduct robust review before deciding whether to  renew, adopt an alternative remedy, or create a permanent, long-term  fix.\n\nMr. Speaker, I suppose you could say this is a Band-Aid solution, but  having cut my finger recently, I like Band-Aid solutions. Band-Aids…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698843/crime-victims-fund-stabilization-act-of-2025"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…won't beat the  indictment. You will have to pay. This is all so obvious in terms of  what he is doing.\n\nHowever, back to this. Censured but not silenced. Well, there is a  remedy. If my colleagues who generally sit on this side won't rein him  in, if the Supreme Court has decided that it won't, for whatever  reasons, then there is but one option left.…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697060/no-mandate-to-cut-medicaid"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…are demands, not requests. I will oppose any  additional funding for DHS and any DHS funding package unless it  includes these changes.\n\nLet's be very clear: Rights without remedy are empty promises. Rights  without enforcement, when they are violated, are a mirage. And so I  proposed, along with a number of my colleagues Senator Padilla  and Senator…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699650/9999"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…deeply concerned by all of the DOGE cuts to  the VA's outreach efforts.\n\nOverall, we have seen an underutilization of survivors' benefits, so  we must do whatever we can to remedy that situation. This bill is a  small but important step in that process.\n\nI would be remiss, however, if I didn't also point to other  legislation that we can and should be…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689686/prioritizing-veterans-survivors-act"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…Coast Guard, and we need  to make sure that there is a statutory structure in place to make sure  that with this type of activity, people will be able to report it and  get a remedy and a response, in some cases punishment to, again, make  sure people are not hindered because of this unacceptable conduct.\n\nTomorrow when we take up this bill, those brave…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694038/supporting-our-coast-guard"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…now. We should never have trusted him. He  has been given a second chance to steal fire from the gods. We should  never have allowed him to do so.\n\nMr. Speaker, there is a remedy. When the courts can't control him and  when his party won't control him, then the only remedy left is  impeachment. That is all that we have.\n\nThere are some people who would…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697472/president-trump-is-a-threat-to-our-republic"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…continue to build these values into his life as a  civil rights movement leader.\n\nRustin attended City College of New York, where he joined a  progressive club that aimed to remedy racial issues during turbulent  times. His time with the club was short-lived, but it inspired him to  join the Fellowship of Reconciliation, an organization that became a…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699806/introduction-of-the-bayard-rustin-stamp-act"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…as the falsity of  the fact upon which their decision depended has been proven over and  over and over again.\n\nI will close by pointing to the DISCLOSE Act--a bill that can remedy  this by requiring contributions over 10 grand into a political race to  be disclosed by the actual donor. No more hiding behind a 501(c)(3)  that converts to a 501(c)(4) that…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699104/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…intensify with the  rise of artificial intelligence and autonomous financial agents.\n\nThis legislation will require the Federal Reserve Board to develop a  written plan to remedy deficiencies like those to be identified during  the review process. This review and remediation will lead to more  accessible, responsive, and secure discount window operations.…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699860/bringing-the-discount-window-into-the-21st-century-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…16 years under Presidents Obama and Biden. This can  severely curtail America's energy.\n\nH.R. 3062, introduced by the gentlewoman from North Dakota (Mrs.  Fedorchak), would remedy these permitting inconsistencies by  establishing a uniform process for authorizing energy infrastructure  construction that crosses U.S. boundaries. Instead of the complex…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695688/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…future development.\n\nThe RMPA unfairly targets coal at the expense of working       families and rural economies. Congressional disapproval under       the CRA is the swiftest remedy and will pave the way for a       thoughtfully drafted future management plan that guarantees       the prosperity of the United States, Montana, and       individuals. I urge…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694888/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…in the Lower Health Care Premiums  for All Americans Act, cut red tape, protect choice, and lower costs.\n\nI plead with my Democrat colleagues to join us in bringing about a  remedy to our healthcare system which is broken because of the  unaffordable care act.\n\nThey broke it, but please join us to fix it.\n\nMr. WALBERG.\n\nMr. WALBERG. Mr. Speaker, may I…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698404/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…nearly 40  years.\n\nShocked to see so many people suffering from diseases no longer  considered to be a widespread threat, such as tuberculosis, Dr. Hotz  made it his mission to remedy the lack of accessible medical care that  plagued rural Georgia. From snake bites to cervical cancer, Dr. Hotz  treated thousands of patients who otherwise would have been…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692753/recognizing-uga-2025-boren-award-winners"}, {"senator": "Mike Crapo", "party": "Republican", "sentence": "…himself and his staff available to Congress and the American  people to restore faith in our institutions. When issues have arisen,  Secretary Kennedy has worked quickly to remedy the problem. In fact, in  recent days, Secretary Kennedy has appeared before two Senate  committees to have an open, transparent conversation about the  Department's efforts.…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691446/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "…agency can either say: Yes, this is adequate for  a permit, and issue the permit, or say: No, it is not adequate for a  permit, and give the applicant what they need to do to remedy that so  that we can have quicker permitting, especially on infrastructure  projects.\n\nRight now, it takes years and millions of dollars to permit  infrastructure projects,…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689196/work-highlights-of-western-caucus"}]