[{"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…the excesses and the wrongs that are going on there.\n\nOn Friday, I went with a group of Democrats to Minnesota to deal with  the protests there, to see them firsthand. They reminded me in some  ways of the civil rights protests from back in that era, the protests  in Selma that led to the Voting Rights Act passage, the protests in  Birmingham. The violence…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699200/building-a-beloved-community"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…New York community to honor those who selflessly  served our country and their family members who have carried the weight  of that service with unwavering strength. I was reminded of their  commitment to this country and how the liberties we enjoy today were  paid for in duty, courage, sacrifice, and blood.\n\nYet, honoring their service demands more…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696762/veterans-compensation-cost-of-living-adjustment-act-of-2025"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "…celebrate Black History  Month.\n\nBlack History Month means a lot to me, and it means a lot to my  constituents in northeast Ohio.\n\nJust in the last few days, we have been reminded of how the past and  present are connected. Last week, in Cleveland, we celebrated the 90th  birthday of the Reverend Dr. Otis Moss, Jr., and his wife, Edwina Moss,  two local…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688144/recognizing-resilience-resistance-and-relentless-struggle-lessons-of-black-history"}, {"senator": "Derek Tran", "party": "Democrat", "sentence": "…am proud to be the third Vietnamese American ever elected to  Congress, following Congressman Joseph Cao of Louisiana and  Congresswoman Stephanie Murphy of Florida.\n\nI am reminded every day of our strength, our determination, and our  unyielding commitment to preserving our history and to ensuring that no  Communist regime can rewrite our history.…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690347/recognizing-black-april"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…on this when he was President, but it  came to fruition under President Johnson. President Johnson went there,  and he signed the bill in the presence of Harry Truman. He reminded the  American people of a shared tradition:\n\n``Never to be indifferent toward despair. . . . never to turn away  from helplessness. . . . never to ignore or spurn those who…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691417/gop-tax-scam-hurts-everyone"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…demanding that we cut money to fund cancer research,  Mr. Speaker, I promise you that. They are not calling for these cuts.\n\nOf course, as the irrepressibly cheerful Joni Ernst reminded  Americans last week, that is okay because we all are going to die. I  just don't think Americans thought the Trump administration would be  actively trying to speed up our…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691727/republican-budget-will-make-us-sicker"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "Mr. VASQUEZ. Mr. Speaker, I rise today to urge my Republican  colleagues to reject the President's proposed takeover of Greenland.\n\nAs we celebrate Dr. King's legacy, I am reminded of his belief that  the ultimate measure of a person is not where they stand in moments of  comfort and convenience but where they stand at times of challenge and  controversy.…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699297/takeover-of-greenland"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…nature that would not go away, and we would always need virtue to  be able to defeat tyranny.\n\nAnd so as you are talking about authoritarianism and where we are, I  am just reminded of the fact that Virginians predicted in 1776 that the  Nation would need to always be on guard against tyranny.\n\nAnd in the formation of the Constitution--and my colleague…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696334/trump-administration"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…so well-respected in our State were asked to  investigate Renee Good's wife after she was gunned down. And they said:  No, we will not do that, and they stepped down.\n\nIt reminded me of the decorated war veteran in New York in their U.S.  Attorney's Office when asked to dismiss a case that had been rightfully  brought against then-Mayor Eric Adams.…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700059/9999"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…history 100  years ago, I know he was not intending it to be for only 1 month, but  for us to kick it off in February and continue it for the rest of the  year.\n\nTonight, we are reminded that Black military history is not a  footnote. It is foundational. From the Revolutionary War to today's  All-Volunteer Force, Black servicemembers have defended this Nation…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699864/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…about  what this section of the Constitution means.\n\nIn one of the previous debates with the War Powers Resolution, War  Powers Act being debated on the floor, Senator Kaine reminded us of  that historic moment when the Founding Fathers decided to write this  Constitution, which we have all sworn to uphold and defend. And leading  that Constitutional Convention,…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696557/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…1960s, for example, Japanese-American civil rights activist,  Yuri Kochiyama, worked alongside Malcolm X during the civil rights  movement.\n\nDuring Black History Month, we are reminded that the civil rights and  Asian-American movements have always gone hand in hand in seeking  justice against systemic racism.\n\nAs we celebrate our progress this Black History…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687997/black-history-month-and-the-alliance-between-the-black-and-asian-community"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…Senator yield for one more question?\n\nMr. MERKLEY. I will yield for another question. Thank you.\n\nMs. BLUNT ROCHESTER. As you talked about the small businesses,  Senator, I was reminded that, as we look at who is actually purchasing  this healthcare in the marketplace--a lot of people don't even know  they are on ACA and receiving the tax credit--that half…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…commit a crime. It is that simple.  If someone is a servicemember, he can't follow an order that requires  him to commit a crime.\n\nRecently, my Democratic colleagues merely reminded our servicemembers  of their lawful duty. The President's reaction was that these  Democratic Members of Congress were traitors and should be hanged.\n\nFast-forward to last…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697546/holding-war-criminals-accountable"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…so for the people of Ukraine, and we  must do it through strength.\n\nI will end with this: With the passing of the Holy Father and holding  on to a promise of my faith, he reminded us over and over again of the  Gospel of Matthew: Blessed are the peacemakers, for they shall be  called the children of God.\n\nI plead for this administration to help bring…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690214/supporting-ukraines-independence"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…that  threatens American lives and our global stability that when President  Trump draws a red line, he means it. This is what peace through  strength looks like.\n\nWe are all reminded, once again, that under President Trump, America  does not bend to tyrants or terrorists. We confront evil. We prove our  dominance on the world stage, and we ensure that…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692964/taking-a-step-toward-true-energy-dominance"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…out immediately. I know  firsthand that the county attorney from Sarpy, Lee Polikov, values her  hard work and support.\n\nBeth is an inspiration to her fellow students. She reminded them, and  all of us, that learning, service, and ambition never end at any stage  of life.\n\nHer unyielding spirit inspires us all to work hard for whatever we  desire. Her…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699725/happy-90th-birthday-to-beth-ragland"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Chamber. As a number of my colleagues were  debating a resolution honoring a friend to many of us, Charlie Kirk,  who, as is well known now, lost his life last week, I am reminded of  the importance of truth. Truth matters.\n\nCharlie stood for the proposition that you should go into the public  square and put forward your ideas and put forward what you…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695719/highlighting-flawed-policies"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…country to compete in one of the most prestigious  science competitions in the Nation. This team from Pullman not only  showcased their talent on the national stage, but they reminded us why  it matters to invest in STEM education and to recognize young people  who are willing to push themselves, think deeply, and work together in  the pursuit of excellence.…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690876/congratulating-pullman-high-schools-science-bowl-team"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…law.\n\nPhoto identification is almost the touchstone of what election  integrity is. It is making sure people are who they say they are. It is  a simple provision.\n\nI am often reminded of a time when I was driving back home in  Wisconsin. I was heading back home, and I walked in to buy a six-pack  of beer. The clerk recognized me and said: Hey, Bryan, how…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692319/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Tom Emmer", "party": "Republican", "sentence": "…being forced  to endure the consequences of inexplicable evil is heartbreaking,  devastating, and infuriating for us all, but it is through tragedies  like this that we are reminded that we are stronger together. There is  more that unites us than divides us, and when we turn to our faith in  God, we can maintain hope in the midst of absolute turmoil.…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692785/in-memory-of-mark-and-melissa-hortman"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "…critical infrastructure. Our current standards are  simply insufficient. The United States is vulnerable to attack on our  defense infrastructure by our adversaries, as we were reminded of today  like no other.\n\nFortifying our defense critical infrastructure is imperative, and  funding it is our job. My amendment No. 269 directs a comprehensive  review of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695343/protecting-americas-infrastructure"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…just about every conceivable product.\n\nVoters in the last election indicated they were fed up with high  prices. Every time Americans went to the grocery store, they were  reminded that inflation and putting food on their family's table was  more difficult and left them with less money for other necessities.\n\nMany pundits say the 2024 election hinged…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690543/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "Mr. FINE. Mr. Speaker, as I sat here and listened to that panoply of  speeches or motions over the last few seconds, I was reminded of the  fact that when we say there should be no cuts to Medicaid, we are  saying there should be no  cuts to illegal immigrants who are getting Medicaid.\n\nWe live in a world…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693215/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "…are  here to make sure that the women who came before us get credit for what  they have done. Their influence is undeniable.\n\nWhen we think of remarkable women, let us be reminded of women like  Martha Hughes Cannon, a physician, suffragist, and pioneer who went on  to become the first female State Senator in the United States.\n\nWe are a Nation of pioneers.…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689363/womens-history-month"}, {"senator": "Michael Cloud", "party": "Republican", "sentence": "…playing  a role. As one local paper put it, ``lt took all of Ganado.'' And it  did.\n\nIn a time when the spotlight so often falls on the wrong examples,  these young women reminded us what it means to fight for something  bigger than yourself. Their victory is more than a trophy. It's a  testament to hard work, unity, and the enduring spirit of Texas.…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693499/congratulating-the-ganado-maidens-softball-team"}, {"senator": "Cliff Bentz", "party": "Republican", "sentence": "…visiting their memorials and the WWII Memorial, because of the  efforts of the Honor Flight of Southern Oregon. Whenever I have the  opportunity to meet these heroes, I am reminded of the words of  President Abraham Lincoln: ``The struggle of today, is not altogether  for today, it is for a vast future also.'' Our veterans embody this  spirit, having…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691306/recognizing-the-honor-flight-of-southern-oregon"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…Controller Alert       reminding agencies that they must establish financial and       administrative controls to identify and assess fraud risks.       In addition, the alert reminded agencies that they should       adhere to the leading practices in the Fraud Risk Framework       as part of their efforts to effectively design, implement,       and operate…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698800/breaking-the-gridlock-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…as will many of my staff  who counted her as a mentor.\n\nWhen I think of the people who have devoted their life to the cause  and they come and they go and they pass, I am reminded that we are here  for these fleeting moments, what will be our legacy? What will be the  legacy of this generation? Are we going to put this country back on a  sustainable…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690594/fiscal-responsibility"}, {"senator": "James Risch", "party": "Republican", "sentence": "…Government sources is subject to the same       approval and substantive reporting requirements as U.S.       Government-funded travel. In addition, members and staff are       reminded to consult the Senate Code of Conduct, and, as       appropriate, the Senate Select Committee on Ethics, in the       case of travel sponsored by non-U.S. Government sources.…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691700/us-senate-committee-on-foreign-relations-rules-of-procedure"}]