[{"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…Bible, and an  envelope fell out I had never noticed, and inside was his poll tax  receipt from when he first registered to vote. Then I understood: He  kept it in his Bible to remind him of the sacred right of the right to  vote. He kept this Bible even when we tried to give him new ones. This  was the one he used to write his sermons every Sunday.\n\nNow,…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689341/fighting-voter-suppression"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…funding  for a Department that has shown repeated disregard for the  Constitution, the rule of law, and the safety of the people it is  supposed to protect.\n\nMr. Speaker, I remind the American people and this body: Every Member  of Congress has sworn an oath to uphold the Constitution. That means  all aspects of it--the Fourth Amendment, the Fifth Amendment,…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699309/providing-for-consideration-of-hr-consolidated-appropriations-act-and-providing-for-consideration-of-hr-department-of-homeland-security-appropriations-act-and-for-other-purposes"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…upon essentially local District matters,'' yet  the House today is denying D.C. residents local self-government and  spending its time on local D.C. matters.\n\nMr. Speaker, I remind my Republican colleagues what Republican  President Richard Nixon said when he signed the Home Rule Act: ``One of  the major goals of this administration is to place responsibility…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696933/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…room. They test one another's  recollections and assumptions and assess witness credibility. Studies  show that, during deliberations, a jury polices itself. Individual  jurors remind others of the obligations of their oaths and the  requirements of the law as stated by the judge.\n\nAs a new year--with a new Congress and President--is underway, it is  high…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690041/valuing-truth-fullness-lessons-from-jury-trials"}, {"senator": "Robin Kelly", "party": "Democrat", "sentence": "…KELLY of Illinois. Mr. Speaker, I rise in opposition to President  Trump's rescission package that steals $400 million from PEPFAR, a  lifesaving global health program.\n\nLet me remind my colleagues that PEPFAR is a bipartisan effort first  led by Congresswoman Barbara Lee and signed by President George W.  Bush. It has been reauthorized on a bipartisan basis…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692543/rescissions-act-of-2025"}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "Ms. SIMON. Mr. Speaker, I would like to remind us what this Nation  used to do to its children.\n\nBefore 1975, this country locked up 200,000 disabled children in  institutions. We shut the schoolhouse door on children who…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698108/dismantling-department-of-education-is-not-reform"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "…President's face that  would even make Kim Jong-un blush.\n\nThis is a toxic agenda, and the President knows it. That is why he is  changing the rules in the middle of the game. Need I remind you, 4  years ago, he demanded Georgia find him votes? Now, he is demanding red  States find him more seats in Congress.\n\nAll this for what? So Donald Trump can enrich himself…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694808/northeast-ohioans-are-getting-squeezed"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…should be outraged by that.\n\nHe also bragged about the fact that he has been in Congress for 10  months, and the government has been shut down twice. I hate to be the  one to remind the gentleman, but the last time I checked, his party is  in control of everything: the White House, the Senate, and the House.  You run the show. Maybe November will be a…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699593/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Jahana Hayes", "party": "Democrat", "sentence": "…told American families that these investments don't matter, that their  child's future does not count, and that Federal dollars are better  spent elsewhere.\n\nI am here to remind the American people that the President's  shameless assault on early intervention and Medicaid paints a grim  picture for the future of special education and for the future…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698939/protecting-education-for-children-with-disabilities"}, {"senator": "Brad Schneider", "party": "Democrat", "sentence": "…Saturday's U.S. strike on Iran, on the intelligence that  justified it, on the legal justification, on the objectives, and on the  consequences.\n\nMr. Speaker, we should not have to remind you that the Constitution  gives only Congress, not the President, the exclusive power to declare  war. The War Powers Resolution of 1973 requires the President, after  taking…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692935/cancellation-of-iran-classified-briefing"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…unjustly cut.\n\nThese are not abstract numbers. These are real people who planned  their lives around commitments and promises that were made to them and  then broken.\n\nLet me remind you that when the auto rescue moved forward, corporate  interests were stabilized, made whole, but working people were left  behind, and that imbalance has lingered for two…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699158/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "…is still time for Republicans to reaffirm to the world that  America does not bow to our foreign adversaries.\n\nThere is still time for Republicans to join with Democrats and remind  Donald Trump that America does not abandon our friends.\n\nFor our future and theirs, we cannot--we must not--betray the  courageous people of Ukraine.", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688655/america-still-supports-ukraine"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "Ms. TLAIB. Mr. Speaker, I remind many of my constituents in the 12th  Congressional District that I hear you and I understand the pain and  the fear that you all are going through as you continue to hear about…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688625/michigan-has-million-people-on-medicaid"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "…I rise in opposition to this partisan and  misleading resolution under consideration.\n\nWe have heard our colleague distort the facts already through this  debate. I want to remind the American people and everybody that it was  local law enforcement that got the situation under control before the  National Guard and the Marines showed up. I know because…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693137/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…highest form of patriotism.\n\nLet Chuy Garcia's examples lead us out of our complacency and to a  greater level of integrity and to a higher calling. Let this unyielding  spirit remind us that America becomes America only when ordinary people  dare to demand the extraordinary.", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696773/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…would you just shrug it off and pay for it?  I think not. You would demand answers. You would challenge it. That is  exactly what DOGE is doing with your tax dollars.\n\nLet me remind you of something else. In November, the American people  voted for change. They chose a different direction because the status  quo simply wasn't working. Now, because DOGE…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688492/demanding-transparency-efficiency-and-accountability-from-our-government-is-not-extreme"}, {"senator": "Anna Luna", "party": "Republican", "sentence": "…legislation that  requires two things, voter ID, plus proof of citizenship, is being  labeled by people in the Senate and people in this very Chamber as Jim  Crow-era laws.\n\nLet me remind the American people of history. It was the Democratic  Party who championed the Jim Crow-era laws. And this is the farthest  thing from it. In fact, Mr. Speaker, if you are…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700010/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…that is what the  Democrats are best at.\n\nHouse Republicans are going to fight back to restore that personal  choice, all while ensuring fiscal responsibility.\n\nMr. Speaker, I remind my colleague on the other side of the aisle  that House Republicans did pass a funding mechanism out of the House of  Representatives to the Senate, and because of the 60-vote…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698637/providing-for-consideration-of-hr-saving-homeowners-from-overregulation-with-exceptional-rinsing-act-providing-for-consideration-of-hr-affordable-housing-over-mandating-efficiency-standards-act-and-providing-for-consideration-of-hr-commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…leverage. Don't take my word for it. Take theirs. It  was leverage for more wasteful Washington spending, spending that no  one other than the radical left ever wanted.\n\nTo remind the American people, Democrats wanted to waste $1.5  trillion of their hard-earned tax dollars. What did Democrats get in  return? Democrats got nothing. Democrats got nothing…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696724/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Brad Finstad", "party": "Republican", "sentence": "…we will continue  to do so together.\n\nMr. FINSTAD. Mr. Speaker, over the past week, I have been reminding  myself that hope, faith, and resilience are the enemy of evil. I remind  my fellow Minnesotans--not just the Republicans and not just the  Democrats but my fellow Minnesotans--that hope, faith, and resilience  are the enemy of evil. While one person's…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692856/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…sources like nuclear and hydropower.\n\nIt shouldn't be a left versus right issue. If an energy source is  reliable and drives down costs, it should be on the table.\n\nI would remind my colleagues on the other side of the aisle that  financial stress induced by higher utility costs also increases  negative health outcomes.\n\nWe need balance, not heavy-handed…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697881/state-planning-for-reliability-and-affordability-act"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…I know how tenuous it is and that people need  support and help.\n\nThis day reminds us that every life has value and every person  deserves support. Let us work together to remind those who are  struggling that they are not alone and that help is always within  reach.                             Honoring LaVern Harvey\n\nMrs. MILLER-MEEKS. Mr. Speaker,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695074/raising-awareness-of-world-suicide-prevention-day"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "…acre- feet of water per year to as many as 50,000 Coloradans across 40  different communities in Pueblo, Otero, Bent, Kiowa, Prowers, Crowley,  and Baca Counties.\n\nI boldly remind my colleagues here today that this project broke  ground during the first Trump administration in 2020 due to major  investments from the Trump-led Bureau of Reclamation and…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698700/finish-the-arkansas-valley-conduit-act-veto-message-from-the-president-of-the-united-states"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…it is apparent subjectively that they are probably doing  better than the average American who was born here and, indeed, larger  minorities for which we have statistics.\n\nI remind everybody that people who come here from India, who are the  most successful minority, Philippines, China, Japan, Cuba, the coast of  western Africa all are succeeding wildly…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689133/educating-young-people"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…issue and come  together to pass this bill and continue to work together in 2026 to  deliver more affordable healthcare to all Americans.\n\nMr. GUTHRIE. Mr. Speaker, I will remind my friends that the premium  tax credits from the ACA are extended. They are permanent. These are  the enhanced premium tax credits. It is good, and sad, that my  colleagues…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698368/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…specific technology, which is  still largely under development, in a manner that can prove burdensome  to some operators and create burdens to its adoption.\n\nMr. Speaker, I remind my colleagues that we have been down this road  before. We have been in this position before. Congress mandated the  exact technology prescribed in the ROTOR Act in 2012. Due…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700111/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…and shoved out the  door. That is not 1,400 pages. That is 1,400 regulations, most of which  were long, so this chart is actually much higher.\n\nMr. Speaker, I rise tonight to remind all of my colleagues and all of  us who serve in these roles how important it is that, during this Small  Business Week, as we are doing our reconciliation bill and doing all…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690784/big-beautiful-bill"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…dozens  and dozens, or maybe hundreds. I haven't done a study, Mr. Speaker. I  will just tell you that it has been interesting to listen to all of  this discussion.\n\nI will remind you, Mr. Speaker, that over the last 4 years, the Biden  administration finalized more than 30 new or updated energy efficiency  standards that ended up totaling over $60 billion…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688547/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…provides for consideration of this  rescissions package and advances H.R. 1 by adopting the engrossment  resolution.\n\nSince Democrats seem to have selective memory, let me remind them,  and Americans, that during the 117th Congress, very recently, House  Democrats deemed 29 items total. Also included in that number is the  engrossment correction resolution…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692391/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…the people, take power out of Washington,  D.C., and truly put America first.\n\nMr. WESTERMAN.  Greene).\n\nMr. Speaker, as we wrap up this so-called debate today, I want to  remind everyone of something that they are not seeing on the news every  day like they were several months ago, and that is hordes coming across  our southern border.\n\nI want to remind…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690939/gulf-of-america-act"}]