[{"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…against the Palestinian people and the need for refugee  rights. We know that thousands of Palestinians were ethnically cleansed  in 1948, and nearly 800,000 were violently removed from over 400  villages, completely erased. Many of them carry their keys to this day,  Mr. Speaker, hanging them on the wall of their new, temporary homes in  hopes that…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691384/the-nakba-never-ended"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…helping to keep small businesses afloat  during troubling and uncertain economic times.\n\nUnfortunately, bad actors took advantage of the program early in the  pandemic when SBA removed or weakened internal controls. Upon taking  office, the Biden administration reinstituted longstanding antifraud  controls and put new safeguards into place to curb the flow…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687932/assisting-small-businesses-not-fraudsters-act"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…and Congress' and damage the country's  democratic future.\n\nAt the same time, Trump has undone Congress' decades-long ethics  rules and enforcement laws. In doing so, he has removed many of the  institutions and watchdogs that would serve as a check on his own self- profiteering.\n\nHe has gutted the Corporate Transparency Act, frozen enforcement of  the…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…serve millions of people.\n\nThis program doesn't stop at cleanup. It fuels economies and  strengthens resilience. Since its creation in 2006, the Marine Debris  Program has removed more than 36,000 metric tons of debris. According  to NOAA, last year, the program's removal projects drove more than $474  million in tourism and $248 million in recreational…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698190/save-our-seas-amendments-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…D.C.  National Guard was not deployed to the Capitol for several hours,  likely costing lives and prolonging the attack. At Lafayette Square,  the D.C. National Guard forcibly removed peaceful protestors.  Currently, the D.C. National Guard is deployed in D.C. in response to a  crime emergency declared by President Trump.\n\nNot only does presidential control…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694829/introduction-of-the-district-of-columbia-national-guard-home-rule-act"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…Vermont, all 14  counties, were hit by flooding. That billion dollars in damages  affected homes; it affected businesses; it affected farms.\n\nWe had 6,000 tons of debris that was removed, 77 State bridges and 63  State roads were closed; 704 miles of rail was closed, and 159 miles of  rail trail was closed.\n\nWe are far from alone in Vermont in having suffered…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693402/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…bad  guys acted, actually, independent of the Venezuelan Government, not at  the behest of foreign officials. Yet their findings were rejected and  their leadership positions removed simply because the truth didn't fit  a politically convenient story.\n\nAnd again, to be clear, there is no question that Maduro's regime in  Venezuela and the TDA are ruthless…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695695/authorizing-the-en-bloc-consideration-in-executive-session-of-certain-nominations-on-the-executive-calendar"}, {"senator": "Grace Meng", "party": "Democrat", "sentence": "…rather than for their own political  purposes.\n\nLast but not least, every single one of the extreme, partisan policy  riders contained in the previous House CJS bill has been removed from  the bill before us today.\n\nI am proud of the work we have done in this bipartisan package. I  thank Chairman   Tom Cole and his team, and our subcommittee Chairman…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698751/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…yield for a question?\n\nMr. SCHIFF. I thank the Senator for yielding.\n\nI just watched footage of our colleague--my California colleague-- Senator Alex Padilla, being forcibly removed from a briefing by the  Secretary of Homeland Security's staff. He went there to observe and to  ask questions, and I watched with horror on this video, seeing these  agents…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692501/alex-padilla"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…They took their conclusion to the Senate  of the United States of America, to the House of Representatives, and  my dear friend and brother was impeached. He was impeached and removed  from office.\n\nYet, because I am a believer, I often say there is a God. He was  thereafter elected to the Congress of the United States of America.\n\nThe point is, however,…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690560/a-message-to-the-cabinet"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…message that  they are sending, referring to the movie ``Hidden Figures,'' the  African-American women who did the math to put man on the moon but  somehow were unceremoniously removed from all the accolades and all the  parades, these women who were called human calculators. It came to my  mind that they are really not hidden. Hidden is to be made inconvenient…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690321/ending-of-dei-programs-through-executive-order"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…peaceful use of atomic energy.\n\nIn 1992, Kazakhstan ratified the Strategic Arms Reduction Treaty  (START 1) and a few years later, all of Kazakhstan's 104 ICBMs were  safely removed and destroyed. The Kazakh government doubled-down on its  commitment to global peace, security, and nonproliferation by becoming  a party to the Treaty on Non-Proliferation…", "date": "2025-08-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694764/marking-the-15th-annual-international-day-against-nuclear-tests"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…threat to the due process rights of  everyone in this Nation.\n\nInjustice anywhere is a threat to justice everywhere.\n\nUnderstand what we saw today: A U.S. Senator forcibly removed from a  room in a Federal building--a Federal official forcibly removed from a  Federal building after he identified himself as a U.S. Senator. But  after he was out of that…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692454/alex-padilla"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…that I had to leave because the Speaker concluded that I was out of  order.\n\nI have no hard feelings as it relates to the Speaker. I have no  animus to his requiring me to be removed, although I am the only person  who has ever been removed from a joint session of Congress.\n\nHere is what happened after I left. The President, from this podium,  looked over…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697060/no-mandate-to-cut-medicaid"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…week, 168 of my colleagues at the National Science       Foundation were fired in a mass meeting and then waited for       hours for an email with instructions before they were removed       from NSF systems.\n\nTwo in my division were program assistants who provided       crucial support for the review process--both early in their       career and with tremendous…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688192/fired-by-president-trump"}, {"senator": "Barry Moore", "party": "Republican", "sentence": "…59 Democrats voted in favor of this legislation when I brought  it to the House floor last February.\n\nIf you are a guest in our country and you drive drunk, you should be  removed from this country, period.\n\nDrunk drivers are involved in 31 percent of all crash deaths in this  country. On average, drunk driving killed roughly 11,000 people in the  United…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693084/jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-2025"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…Democrat voted against that, too, because  they have never cared about lowering premiums.\n\nThat bill goes to the Senate. Senate Democrats worked overtime to get  that provision removed. If we look at the Senate Committee on the  Budget website, they still brag that they removed that provision that  would have lowered premiums for families.\n\nRepublicans absolutely…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696745/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…sponsor reportedly later kidnapped his wife  for 24 hours and threatened to kill her.\n\nThankfully, the Health and Human Services Department told my office  the children have been removed, and HHS has transmitted this evidence  to law enforcement.\n\nThe final case I am going to bring to you today concerns a 4-year-old  boy who was released to someone who claimed,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699108/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Adrian Smith", "party": "Republican", "sentence": "…and a friend, there have been a number of irritants in our  economic relationship. Under President Trump's leadership, we have seen  this change, most recently when Canada removed its discriminatory  digital services tax.\n\nThese productive--and I will say oftentimes uncomfortable-- conversations must continue, though, as we strengthen and extend USMCA…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699963/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…illegally.\n\nI want to point out to everyone that, again, in the last year we had  many new Americans who were naturalized. There are people who say about  the people who are being removed: Why can't we let them stay? We have a  system in this country to make sure that we are getting the best  people, the law-abiding, the self-reliant people, which is all we…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689133/educating-young-people"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…complain that H.R. 1's engrossment is not getting  its own vote.\n\nNothing was added to H.R. 1. Let me repeat, nothing was added to H.R.  1. Every change was technical or simply removed provisions to make sure  this big, beautiful bill has its day in the Senate.\n\nLet's remind the American people what the Democrats voted against in  H.R. 1. Democrats went…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692391/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…Washington Post. This is how ridiculous  it was.\n\nCorporate America bought into the misstatements and the falsities of  President Biden. If we recall, Major League Baseball removed the All- Star Game out of Atlanta, Georgia, following Georgia passing this piece  of legislation.\n\nOf course, two elections have passed since that legislation went into  effect.…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692319/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…allegedly sent on the platform indicated that the victim was       underage. To use their platform, the traffickers allegedly       paid a fee to craigslist who never rejected or removed any       posts.\n\nAlthough the Court explained that ``some of her allegations       demonstrate craigslist's appalling lack of diligence in       preventing trafficking, not…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699543/true-cost-of-big-tech"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "…the Federal Land Policy and Management Act, FLPMA,  passed, it has been the policy of the Federal Government that we don't  dispose of land anymore, so that threat has been removed. The need for  a President to move quickly no longer exists, and the act is just being  used to create land policy that couldn't get through Congress.\n\nThe process matters…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689196/work-highlights-of-western-caucus"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…pronouncement of censure;\n\n(3) Representative Cory Mills be censured with a public reading of  this resolution by the Speaker; and\n\n(4) Representative Cory Mills be, and is hereby, removed from the  Committee on Armed Services and the Committee on Foreign Affairs of the  House.", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697012/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…trafficker, someone who repressed his  own people, even if they then immediately want to eat their cake and  have it too by saying that President Trump still shouldn't have removed  him. I think it is just that they are so blinded by their hatred of  President Trump that they feel they have to condemn this action in some  way.\n\nInstead, why don't we…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698556/venezuela"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…be viewed favorably.\n\nWe had a judge in Wisconsin stop the hearing. Oh, let's not worry  about putting this guy in jail. Let's let him sneak out the back door  so he is not removed from this country.\n\nThis was after about a month ago, our Governor, Tony Evers, nice guy,  came out with a directive implying that State employees ought not be  that gung…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690195/wisconsin-in-the-news"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…previous resource management plan would be in existence.\n\nAgain, it is just fear-mongering to say that there will basically be  no rules if this resource management plan gets removed under the  Congressional Review Act.\n\nAgain, I thank the gentlewoman from North Dakota for her leadership  on this important issue. The North Dakota RMP will have devastating…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694908/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…administration scrapped a rule that required  childcare centers to verify that kids actually attended their  facilities in order to receive Federal funding. Think about this: They  removed the provision that says you have got to tell us you are  actually enrolling children in your childcare center. So what does that  do? That invites fraud. In total, his administration…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698560/fraud-accountability-act"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…White House, House, and Senate. We saw  the worst inflation we have seen in my lifetime under the guise of a  COVID relief package.\n\nThat company, which had some tax pressure removed from their books,  went straight to their employees. They created wage growth  opportunities. The other thing was that they had extra discretionary  income to take to their…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691960/supporting-the-big-beautiful-bill"}]