[{"senator": "Mark Takano", "party": "Democrat", "sentence": "…of Veterans Affairs to work  with the Department of Justice to provide resources on  landlord-tenant practices and securing vacant property.\n\nHowever, nothing in this bill removes the requirement that someone  seeking an eviction will need to follow a legal process to do so, which  may include seeking assistance from law enforcement or going to local…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695470/servicemember-residence-protection-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…to the  big, ugly Republican reconciliation bill, which adds $3 trillion to the  deficit and--get this--includes a provision that Republicans have been  bragging about that removes a tax on gun silencers, which has been on  the books for a century.\n\nAccording to the Joint Committee on Taxation, the JCT, this new tax  break on silencers alone will increase…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692385/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…the improvements  made to humanitarian assistance programs, this bill also makes strides  in international conservation  and environmental programs. The conferenced agreement removes  Republican policy riders that would have prohibited any funding to the  Green Climate Fund, the Clean Technology Fund, and implementation of  the Paris Climate Agreement,…", "date": "2026-01-27", "source_url": "https://justfacts.votesmart.org/public-statement/1699388/supporting-hr-7006"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…. this resolution to me doesn't make much  sense because we are not in hostilities inside Venezuela.''\n\nCongressman Keith Self said: `` . . . which is not necessary, as it  removes our Armed Forces from hostilities against a country where there  have been no hostilities.''\n\nCongressman Warren Davidson said: `` . . . is the contention that  this is a…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699359/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Raul Ruiz", "party": "Democrat", "sentence": "…H.R. 1949, the Unlocking our Domestic LNG  Potential Act, is a direct threat to working people and middle-class  families in my district and across the country.\n\nThis bill removes the requirement that the Department of Energy  determine whether LNG exports are in the public interest, like lowering  costs, before approving shipments to countries without…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697083/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…give the Mine Safety and Health  Administration the power to act, even if the offices stay open.\n\nLet me walk you through just how dangerous these rollbacks are.\n\nOne repeal removes the requirement to inspect drilling areas for  hazards before operations begin and gets rid of the need to repair  dangerous drilling equipment.\n\nAnother rollback narrows…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695577/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…for that time. The bill allows employers       to label training as ``voluntary,'' even when workers feel       pressured to attend to keep their jobs or advance, and       removes current protections that ensure training closely tied       to a worker's job is paid. As a result, employers could push       essential training outside of regular work hours…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699005/empowering-employer-child-and-elder-care-solutions-act"}, {"senator": "Lori Trahan", "party": "Democrat", "sentence": "…this year alone, nearly 10,000 children will be diagnosed with  pediatric cancer. This is an issue that could not be more important and  pressing.\n\nThe Give Kids a Chance Act removes many of the hurdles and barriers  to researching treatments for rare pediatric diseases. It restores FDA  incentives through the Rare Pediatric Disease Priority Review Voucher…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695859/recognizing-september-as-childhood-cancer-awareness-month"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…Robbing homeowners--homeowners--of the  ability to save money on energy bills, breathe safer air indoors at  home, and ensure a livable future for their families. And it also  removes support for families looking to buy a clean vehicle, an  electric vehicle, and saving money at the pump.\n\nIt imposes draconian restrictions on large-scale solar and wind…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692644/one-big-beautiful-bill"}, {"senator": "Darren Soto", "party": "Democrat", "sentence": "…capabilities to accelerate innovation. One of the next generation  semiconductor technologies that IBAS is focusing on is called Advanced  Packing.\n\nAdvanced Packaging essentially removes the green circuit board, and  connects each component chip onto each other, like how individual Lego  pieces can be stacked on top of each other to form a Lego set. This…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693817/department-of-defense-appropriations-act-2026"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…prices of natural gas and reliability. Section 3       gives DOE wide latitude to protect U.S. consumers now and in       the future as larger amounts are exported.\n\nH.R. 1949 removes Section 3 and the protection that it       affords. The bill removes DOE's authority and responsibility       to consider the public interest when considering approval of…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697080/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Sylvia Garcia", "party": "Democrat", "sentence": "…ERA pin I wore that day. I have kept it for nearly  50 years because the fight isn't over.\n\nThis week, I stood with powerful women in Congress to introduce a  resolution that removes our final barrier: the arbitrary deadline set  decades ago. If it passes, the ERA becomes the 28th Amendment.\n\nWe must pass this resolution. We must remove all barriers to…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689199/fighting-to-guarantee-equal-rights-for-all-women-under-the-constitution"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…enforcement background checks of an alien required under       subparagraph (A) shall be completed, to the satisfaction of       the Secretary, before the date on which the Secretary removes       the conditional basis of the alien's permanent resident       status.\n\n(b) Treatment for Purposes of Naturalization.--\n\n(1) In general.--For purposes of title III of…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697541/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…struggling to  explain ICE attacks to children, and Americans are desperately trying  to protect their neighbors.\n\nThe American people support orderly immigration enforcement that  removes violent criminals from our streets, but how we do it matters.  Indiscriminate violent roundup of American citizens, legal residents,  and people with no criminal record erodes…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699485/department-of-homeland-security"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…Right now, there are bottlenecks in the system that  prevent renewable energy from getting from where it is generated to  where it can be used.\n\nOur Energy Bills Relief Act removes the red tape. It makes sure that  we can build our domestic energy supply so that we keep your beer cold  and your showers hot, and lower your bills at the same time.\n\nMr.…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700229/winners-of-the-global-energy-race-are-being-decided"}, {"senator": "Mario Diaz-Balart", "party": "Republican", "sentence": "…much-needed  reforms there.\n\nThese are historic changes in our approach that the American people  have been demanding for decades, Mr. Chairman.\n\nThe fiscal year 2026 bill removes controversial funding directives  from the CR, like the U.N. climate funds and others.\n\nThroughout this process, the goal is to be good stewards of American  taxpayer money,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699051/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…frustrates a  lot of us around here is the typical year-end healthcare policy  extender mess.\n\nThe legislation in front of us takes the successful hospital at home  program and removes it from that chaos by providing it with a renewed  5-year authorization so more Americans can receive care in the comfort  and convenience of their own home.\n\nHospital at…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697169/hospital-inpatient-services-modernization-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…supporting the  CRA.\n\nThis CRA allows us to turn the page on a disgraceful chapter of  radical environmentalism pursued at the expense of the American people.  H.J. Res. 105 removes the bureaucratic barriers designed to prevent the  use of our abundant natural resources. It is an important step  necessary to unshackle American energy and minerals and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694908/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Mario Diaz-Balart", "party": "Republican", "sentence": "…fentanyl. It  increases support for religious freedom and to address religious  persecution around the planet. It maintains our longstanding pro-life  provisions, and this bill removes controversial funding directives like  the U.N. Framework Convention on Climate Change. It makes double-digit  reductions to the U.N. funding. More importantly, or equally…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699572/consolidated-appropriations-act-2026"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…the 11th District of Texas.\n\nThis legislation will streamline regulatory approvals of LNG export  facilities to meet the movement of global energy demands.\n\nThis legislation removes unnecessary and burdensome reviews at the  Department of Energy for exporting U.S. LNG while maintaining the  required site and environmental reviews at FERC. Increasing…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697081/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…organization, it  takes an act of Congress to make changes in its charter to permit the  FBA to update those bylaws.\n\nS. 616 amends the FBA's current charter in several ways: It removes  the requirement for the FBA to be incorporated and domiciled in  Washington, D.C.;\n\nIt allows the board of directors to choose the location of the  principal office;\n\nIt…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697185/foundation-of-the-federal-bar-association-charter-amendments-act-of-2025"}, {"senator": "John Rose", "party": "Republican", "sentence": "…Tennessee families whom I represent.\n\nI am proud that my bipartisan bill, the Housing Supply Expansion Act  of 2025, was included in the Housing for the 21st Century Act. My bill  removes an outdated Federal chassis requirement that has stifled  manufactured housing construction for decades.\n\nWhen we hear the term ``manufactured home,'' many people still think…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699802/housing-for-the-21st-century-act"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…officers and the communities they protect.\n\nThe bill does something straightforward but important. It creates a  new classification for less-than-lethal projectile devices and removes  them from outdated regulatory categories that were never designed with  today's equipment in mind.\n\nFor years, departments across the country have faced unnecessary  hurdles…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699900/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…pharmaceutical ingredients, to the cartels in Mexico who are  then making the drugs and bringing them across our borders.\n\nBy making these analogues permanently schedule I, it removes the  incentive to traffic these drugs into our country due to the penalties  if they are caught.\n\nChina has even realized the risk of analogues themselves and has  permanently…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692345/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…plans are stalled by an outdated Federal deed restriction put in place  by the National Park Service on the land where the Boys & Girls Club  currently operates.\n\nH.R. 1276 removes that restriction, which would, in turn, allow the  city of Paducah to transfer the parcel directly to the club.\n\nMr. Speaker, I thank Representative Comer for working with…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697651/removing-restrictions-from-a-parcel-of-land-in-paducah-kentucky"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…making homeownership more affordable in 2026 and  beyond.\n\nOne great example is the Affordable Homes Act, led by my colleague  Congresswoman Erin Houchin. This commonsense bill removes unnecessary  Federal interference and eliminates costly energy mandates that drive  up the price of manufactured housing. This is one of the most  affordable pathways to homeownership…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698635/providing-for-consideration-of-hr-saving-homeowners-from-overregulation-with-exceptional-rinsing-act-providing-for-consideration-of-hr-affordable-housing-over-mandating-efficiency-standards-act-and-providing-for-consideration-of-hr-commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…the age of 25 to be given the same leniency  that is afforded to minors. This bill requires that we treat adult  criminals as adults, like the rest of the country. It also removes  judicial discretion to sentence youth offenders under the minimum  sentencing structures in place.\n\nOur Capital cannot continue to let criminals freely roam the streets…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695558/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…The Buffalo RMPA designates approximately 481,000       acres of subsurface federal coal mineral estate as closed to       coal leasing by any person or entity. This action removes an       estimated 48.12 billion short tons of federal coal from       future leasing. As a result, BLM has precluded nonagency       parties from pursuing new federal coal…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695880/government-accountability-office-opinion-letter"}, {"senator": "Byron Donalds", "party": "Republican", "sentence": "…for children.\n\nThis is simply insane, and that is why I introduced the DC CRIMES  Act, which lowers the definition of youth from under the age of 25 to  under the age of 18, removes the ability of judges to sentence youth  offenders below mandatory minimum guidelines, and requires the D.C.  attorney general to establish a public website containing much-needed…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695561/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…this costly, unwise policy. My amendment does just that. It  eliminates the ban on purchasing conventionally powered, nontactical  vehicles which would start in 2035. It also removes the statutory  preference for electric and hybrid nontactical vehicles.\n\nCongress must give the Department of War the proper authorities to  protect this great country that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695161/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}]