[{"senator": "Ilhan Omar", "party": "Democrat", "sentence": "Speaker, two of my constituents, Renee Good and Alex  Pretti, beloved neighbors and community members, were murdered by  Federal immigration enforcement agents.", "title": "Horrific Ice Abuses", "date": "2026-02-04"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "They shot Renee Good in the  face four times.", "title": "Horrific Ice Abuses", "date": "2026-02-04"}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "People can watch the videos of the murders of Renee Good and Alex  Pretti at the hands of Federal agents and see that something is wrong  and that it isn't over.", "title": "-9999", "date": "2026-01-28"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "President, the American people can be forgiven  for wanting to turn off their computers or TVs and feeling a sense of  abhorrence and repulsion at what they are seeing again and again and  again as the video of Renee Good's killing is replayed for them.", "title": "Commerce, Justice, Science; Energy and Water Development; and Interior and Environment Appropriations Act, 2026", "date": "2026-01-14"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "We ought to be  shocked, angry, and disgusted by the taking of life of Renee Good and  Alex Pretti.", "title": "Consolidated Appropriations Act, 2026", "date": "2026-02-03"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "Renee Good and Alex Pretti were murdered just 2  weeks apart.", "title": "No More Money for Ice", "date": "2026-02-02"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "Millions have seen the videos of ICE shooting and killing Renee Good,  a poet and mother who was unarmed and trying to drive away.", "title": "End Qualified Immunity for Ice Agents", "date": "2026-01-12"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "The killings of Renee Good and Alex Pretti really shock the  conscience.", "title": "Appropriations", "date": "2026-01-30"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "Speaker, people across the country and in the Inland Empire are  scared that they could join the roughly 50 individuals who have died  under Donald Trump's and Kristi Noem's brutal immigration crackdown,  such as Renee Good, Silverio Villegas Gonzalez, Alex Pretti, and many  more.", "title": "Horrific Ice Abuses", "date": "2026-02-04"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "That crackdown led to last week's killing of Renee Good by       an ICE officer Wednesday.", "title": "Supporting Pregnant and Parenting Women and Families Act", "date": "2026-01-21"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "We must see an end to the surge in Minnesota, and a guarantee of  independent investigations into the killings of Renee Good and Alex  Pretti, and of other abuse and misconduct by DHS agents.", "title": "Consolidated Appropriations Act, 2026", "date": "2026-02-10"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "The shooting of  Renee Good is just one example of those that has reached the media  attention, but there are more of these going on all across the country.", "title": "Building A Beloved Community", "date": "2026-01-20"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "Before  him was Renee Good, shot and killed by ICE agents in her car on January  7.", "title": "-9999", "date": "2026-01-28"}, {"senator": "Rob Menendez", "party": "Democrat", "sentence": "Speaker, in the span of 12 weeks, our country was  shaken by the tragic killings of Renee Good and Alex Pretti, who lost  their lives because of the violent and reckless choices that the Trump  administration has made.", "title": "Horrific Ice Abuses", "date": "2026-02-04"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "Speaker, 2 weeks ago, Minnesota stood up to call out these  illegal abuses by masked Federal agents, and a citizen, a mother of  three in Minneapolis, Renee Good, was shot and killed.", "title": "Department of Homeland Security Appropriations Act, 2026", "date": "2026-01-22"}, {"senator": "Pete Ricketts", "party": "Republican", "sentence": "We should all continue to  pray for the families of Renee Good and Alex Pretti.", "title": "Providing for Congressional Disapproval Under Chapter 8 of Title United States Code, of the Rule Submitted By the Internal Revenue Service Relating to ``Interim Guidance Simplifying Application of the", "date": "2026-02-10"}]