[{"senator": "Adam Gray", "party": "Democrat", "sentence": "…recent history. He played a vital role in helping Madera  County survive and thrive through COVID. Thanks to his hard work,  Madera County played an important part in the reopening of Madera  Community Hospital.\n\nUnder Mr. Varney's direction and guidance, Madera County has seen  significant growth in revenue, housing and business. Capital  improvements…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694999/recognizing-jay-varneys-retirement"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…began to imagine stability.       Children began to feel safer because their caregivers felt       safer. The current administration's actions surrounding       TPS are now reopening wounds that never fully healed.\n\nThe possibility of TPS being taken away has had a       devastating emotional impact on our Haitian clients. Many are       survivors of…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699638/expert-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…$34 billion in  disaster funding to help Californians recover. This includes funding  that supports rebuilding homes and schools, restoring critical road and  water systems, reopening small businesses, and helping communities  achieve lasting wildfire resilience.\n\nMr. Speaker, I will continue to push to make sure that residents in  my district and across…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698644/recognizing-sister-mary-jesus-ochoa-on-her-centennial-birthday"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…that this is a bipartisan effort to  fund local police officers.\n\nSo I ask my colleagues to pass these bills as I amend them so that we  can refocus on the urgent work of reopening the government and then  providing all law enforcement agencies with the resources they need,  ensuring every law enforcement agency has a fair opportunity to secure  funding…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696004/unanimous-consent-requests"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…plan. They are  fortunate that the Secretary of the Interior happens to be a former  Republican Governor of North Dakota, and I imagine if they call him  that he will pursue a reopening of this resource management plan.  However, taking this step, foreclosing the ability of those Alaska  natives who are Vietnam-era veterans from being able to access these…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694899/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…proposed in the United States Congress. It was  tucked into this legislation, and I speak directly to Republicans who  say that they can't vote with us because it will delay the reopening of  the government.\n\nFirst off, that is exactly what these corrupt Senators were hoping  they would say. Second, we absolutely can send this back to the Senate.  They can…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696693/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…full-year appropriations bill, we would  just want an agreement during that 30 or 45 days--whatever it is--that  a deal is a deal; that we not write it, agree to it, celebrate  reopening the government, and then have President Trump on day two  start to fire a whole lot of people or claw back more money from the  Virginia Department of Health or cancel more…", "date": "2025-10-01", "source_url": "https://justfacts.votesmart.org/public-statement/1695967/en-bloc-nominations"}, {"senator": "Addison McDowell", "party": "Republican", "sentence": "…poison our communities with deadly  fentanyl.\n\nThat is not governing. That was extortion of the American taxpayer.  That ends today.\n\nToday, we are in the process of finally reopening the government,  returning to the business of the people, and further implementing the  mandate our constituents sent us here to deliver on.\n\nDemocrats chose to have a month…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696677/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…within 90 days with a concrete plan to reopen and restore service,  including in western North Carolina. Second, the Postal Service's  Inspector General must submit a specific reopening plan for facilities  closed due to Hurricane Helene.\n\nMr. Chairman, I urge all of my colleagues to support this bill.", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699044/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "John Carter", "party": "Republican", "sentence": "…longtime friend and  colleague and the chairman of Appropriations Committee, Mr. Cole, for  yielding me the time.\n\nMr. Speaker, I rise in support of H.R. 5371. I look forward to  reopening the government. The shutdown has gone on long enough, and it  is time to end it.\n\nYesterday was Veterans Day. It is a timely reminder of the commitment  our Armed Forces…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696733/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…it looks like we will not have Democratic support to pass.\n\nThere are a lot of empty dinner tables and a lot of children going to  bed hungry. Democrats have voted against reopening our government 13  times. Thirteen times they have voted to deny children food, sending  families to food banks instead.\n\nI am told that food banks will not be able to keep…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696452/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…President, once again, Senate Democrats are  threatening to shut down the government. A government shutdown is bad  for everyone. The cost of a Democrat shutdown is staggering.\n\nReopening the government after a shutdown is even more costly. And  who pays the price of a Schumer shutdown? Well, it is the American  people.\n\nIt is not the people in this room.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695529/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…access to defense sexual                assault incident database. Sec. 524. Director of Coast Guard Investigative Service. Sec. 525. Modifications and revisions relating to reopening retired                grade determinations. Sec. 526. Inclusion and command review of information on covered                misconduct in personnel service records. Sec.…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…or having the President do it by executive order,  but here we are.\n\nThe President has unlocked America's energy potential, or at least  taken a giant step to doing so, by reopening 625 million acres for  drilling, withdrawing from the disastrous Paris climate agreement, and  approving new LNG projects.\n\nMr. Speaker, here before us today, we have what…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690387/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…Appropriations, or their designees.\n\nI rise in support of this rule and the underlying legislation. This  bill delivers on our commitment to the American people by finally  reopening the government. It delivers on the promises that we have made  to our veterans, our farmers, and our taxpayers.\n\nLet's be honest: This government shutdown was completely…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696682/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…permanently close the Nation's capital  airport to general aviation landings. Eventually, that seven-year  effort of Mary and her many colleagues led to the airport's successful  reopening through the DCA Access Standard Security Program (DASSP).\n\nMary has been an unfailingly genuine, wise, and shrewd contributor to  the interests of the general aviation community…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688717/recognizing-mary-miller"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…foreign  territory. This is a dangerous double standard.\n\nTherefore, I encourage my colleagues to vote no on this resolution  and to get back to the more pressing business of reopening our  government.", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696118/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…American mineral dominance is  because of outdated or misguided policies like the one we are  overturning today.\n\nThe resolution before us would correct these policies by reopening  mineral-rich land to exploration and reducing our reliance on China for  minerals.\n\nMr. Speaker, I thank the gentleman from Minnesota (Mr. Stauber) for  his leadership on…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699275/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…This is a political stunt by the Democrats. The  resolution they are offering is empty. It is meaningless.\n\nDemocrats shut down this government. Democrats have voted against  reopening the government 13 times. Democrats are holding food  assistance for 42 million Americans hostage, and they are going to do  it again tomorrow. They are doing it tonight.…", "date": "2025-11-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696498/unanimous-consent-request"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…followed by  the largest legal deportation and repatriation in history.\n\nNew laws would be helpful to prevent a future Joe Biden from making a  mockery of our sovereignty and reopening our borders to the most  violent criminal gangs, cartels, criminals, and terrorists on the  planet, and it would be helpful to give a future President Donald Trump  the added…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697237/no-immigration-benefits-for-hamas-terrorists-act-of-2025"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…years.\n\nThis is one of many stories of entrepreneurs and families, of  veterans, of servicemembers, of constituents that have reached out to  me.\n\nThere is an urgency about reopening the government--yes, I agree--and  an urgency about finding a path forward on healthcare. We should be  negotiating both now.", "date": "2025-10-30", "source_url": "https://justfacts.votesmart.org/public-statement/1696488/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "John Rose", "party": "Republican", "sentence": "…Yet, when we sent our funding bill to the  Senate last week, we gave Senate leadership a taste of their own  medicine and forced them to choose between the Senate payday or  reopening the government.\n\nLet me be very clear. I support real accountability. Last October, I  signed onto a letter urging Attorney General Pam Bondi to launch a  criminal investigation…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699753/repeal-of-senate-payday-provision"}]