[{"senator": "Robin Kelly", "party": "Democrat", "sentence": "…implementing solutions  mothers desperately need. Only three government data sources report  maternal deaths in the U.S., and they are all in dire risk with the  current reorganization plans at HHS.\n\nThese cuts to Medicaid and our country's healthcare infrastructure  are simply cruel and will leave all Americans' health in limbo.\n\nI refuse to go backward.…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690242/health-disparities-in-minority-communities"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…decimated the Department of Energy,  purging more than 3,500 dedicated and hardworking Department staff. On  top of that, just a few weeks ago, Secretary Wright unveiled a  reorganization of the agency that eliminated key offices, including the  Office of Manufacturing and Energy Supply Chains, which would have been  tasked with carrying out the very report…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697896/electric-supply-chain-act"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…apology to Native Hawaiians. The resolution also committed the  United States to a process of reconciliation. Senator Akaka also  championed the Native Hawaiian Government Reorganization Act, which  sought to establish a pathway for Federal recognition of Native  Hawaiians and their right to self-governance, based on their unique  political and historical…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695588/hawaiian-history-month"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…up piecemeal over the years. The time has come to       organize them rationally and systematically. As a major step       in this direction, I am transmitting today two reorganization       plans: one to establish an Environmental Protection Agency,       and one to establish, within the Department of Commerce, a       National Oceanic and Atmospheric…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691582/hj-res-88"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…destruction  of USAID, been dismantled.\n\nWith that said, I am proud to say that we worked hard to produce the  bill to affirm U.S. leadership on the world stage, recognizing the  reorganization of the State Department and reasserting Congress'  constitutional power of the purse.\n\nThis bill funds what should be the core missions of the State  Department: diplomacy,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699057/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…that are being gutted  currently by the Trump administration, a gift for traffickers and  criminals that only illustrates just how dangerous the administration's  proposed reorganization and so-called streamlining of the government  has been for United States' national security. The sanctions in this  bill may help to hold perpetrators accountable and deter…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690646/falun-gong-protection-act"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…children deserve better than this.\n\nI cosponsored H.R. 433, the Department of Education Protection Act,  to prohibit the use of congressional appropriated funds for any  reorganization or dismantling of the Department of Education. I urge my  colleagues across the aisle in this room to fight for our schools,  fight for our teachers, fight for every child…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689640/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…harvesting organs from prisoners of conscience, including  religious and spiritual adherents.\n\nMr. Speaker, I worry deeply about the administration's proposed State  Department reorganization plans that will gut the funding and experts  working to address these crimes, giving the PRC and others a pass.  Instead of these cuts, the administration should be strengthening…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690629/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…her.  She continually avoided giving committee members any specific  information about her role in realigning the senior executives at the  VA or her role in the firing or reorganization or her role in requiring  employees to sign nondisclosure agreements or any of the substantive  work she has been doing as a political appointee. She denied any role  in…", "date": "2025-07-31", "source_url": "https://justfacts.votesmart.org/public-statement/1694542/9999"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…treaty, most Tribal members opted not to live on their  reservation, instead choosing rivers, shorelines, and sites of their  ancestral burial grounds.\n\nThrough the Indian Reorganization Act of 1934, the Federal Government  acquired 372 acres of land and assigned it to 14 families in the Tribe.  In 1968, the Tribe received Federal recognition, which included…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697609/lower-elwha-klallam-tribe-project-lands-restoration-act"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…State for Intelligence and       Research, in coordination with any other bureau or office the       Assistant Secretary determines appropriate, to explore       optimized reorganization of management of the entirety of the       Department's information technology networks and to provide a       briefing to the Committees, not later than 180 days after…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698262/explanatory-statement-for-the-intelligence-authorization-act-for-fiscal-year-2026"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…talked about how the  locals in the area just wished someone would listen to them. Director  Leavitt said this: ``Had the administration acted according to the  Indian Reorganization Act or its own orders, its leadership and staff  would have made allowance for the fact that the ICAS [the Inupiat  Community of the Arctic Slope], alongside many other…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696830/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…prohibit funds made available to the       Department of Education by previous Appropriations Acts from       being used for any activity relating to implementing a       reorganization of the Department, and for other purposes. All       points of order against consideration of the bill are waived.       The bill shall be considered as read. All points…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689054/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers-providing-for-consideration-of-hr-defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…with Penn State Extension began in 1988. Ultimately, he  became Lancaster County Extension Director in 2001. Though his titles  and duties changed over the years with the reorganization of Penn State  Extension, he managed finances, developed budgets, and coordinated with  local counties on development and grants. He took a step back from his  role in…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692202/congratulating-leon-ressler-on-his-retirement"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…Department in which the Coast Guard is operating, shall--\n\n(A) develop a plan on the structure, feasibility of the       Secretary of the Coast Guard position and the reorganization       and restructuring of the Coast Guard needed to incorporate       the new position; and\n\n(B) submit such plan to the Committee on Transportation and       Infrastructure…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…1970 (30 U.S.C. 1001 et seq.), the       Mineral Leasing Act for Acquired Lands of 1947 (30 U.S.C. 351       et seq., as amended), Section 402 of the President's       Reorganization Plan No. 3 of 1946, 16 U.S.C. 520, and 16       U.S.C. 508b, in order to protect and preserve the fragile and       vital social and natural resources, ecological integrity,…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699271/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…acres as a rancheria, but the construction of Highway 50  cut the residents off from easy access and the members dispersed into  the surrounding communities.\n\nThe Indian Reorganization Act breathed new life into the isolated,  disbanded descendants, and the members returned and reorganized as the  Shingle Springs Band of Miwok Indians, the only federally…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697668/shingle-springs-band-of-miwok-indians-land-transfer-act-of-2025"}]