[{"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…history. From all who have been awarded, for all of those who earned  this honor, they do so through the acts of service that are incredible.\n\nThere is no paycheck that could repay their sacrifice and no thank- you letter that could truly convey our Nation's gratitude. We cannot  ever hope to repay this debt, but we can show our fullest support for  them…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688216/medal-of-honor-act"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…whose sons have served in the Marines, being punched repeatedly in the  head by ICE agents this past Sunday.\n\nIs this something my Republican colleagues are proud of? That we  repay veterans of the United States Marine Corps by assaulting,  detaining, and deporting their father who was simply trying to provide  for his family?\n\nLast week, I joined several…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692930/holding-power-accountable"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…bureaucrat:\n\nEvery lie we tell incurs a debt to the truth. Sooner or       later, that debt is paid.\n\nThis administration has run up a debt to the truth that will take  generations to repay.\n\nOver the last several years, the President of the United States  suggested people inject bleach to cure COVID, that windmills cause  cancer, that climate change is a hoax…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700183/state-of-the-union-address"}, {"senator": "Maggie Hassan", "party": "Democrat", "sentence": "…lethal.\n\nTo all members of law enforcement who responded that day and to their  families--but especially to the Capitol Police--thank you. We are  grateful to you. We cannot repay what we owe you, but you are in our  hearts today.             250th Anniversary of the Declaration of Independence\n\nMr. President, I come to the floor today because I find…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698503/9999"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…Congressional Black Caucus  refuses to allow the sacrifices of these patriotic Americans, Black  Americans, to go unnoticed or to be erased.\n\nWe will never be able to fully repay our veterans, given the  sacrifices they have made for our country, but as Congress, it is our  responsibility to make sure we do all we can to ensure that they have  what…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699863/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…from the federal government. In  both cases, the maximum withdrawal would be $100,000. Individuals would  be able to make a withdrawal for up to a year after separation and to  repay the withdrawn amount within three years to avoid the existing  early withdrawal penalty, which is a 10 percent additional tax.\n\nI urge my colleagues to support this bill.", "date": "2025-12-23", "source_url": "https://justfacts.votesmart.org/public-statement/1698468/introduction-of-the-thrift-savings-plan-emergency-withdrawal-act-of-2025"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…rating agencies, the  bond rating agencies that rate the creditworthiness of countries. We  need to tell those who rate the other countries' creditworthiness that  if they don't repay a phony debt to China, a debt trap debt to China,  that should not be counted against them.\n\nWhat do I mean? When China makes a loan to Sri Lanka, that they know  Sri Lanka…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688265/problems-caused-by-doge-cuts"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…novel example of a  people always guided by an exalted justice and benevolence. Who can  doubt that in the course of time and things the fruits of such a plan  would richly repay any temporary advantages which might be lost by a  steady adherence to it? Can it be, that Providence has not connected  the permanent felicity of a nation with its virtue?…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700163/reading-of-washingtons-farewell-address"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…Columbia have enacted 36 percent APR caps or banned  payday loans. Lenders in these States have incentives to offer more  affordable loans that borrowers have an ability to repay. The same  incentives should apply across the Nation.\n\nI thank the 176 consumer advocacy groups, faith-based organizations,  veteran service organizations, and trade associations…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699792/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Josh Harder", "party": "Democrat", "sentence": "…dozen fire agencies south to  combat the deadly megafires. Our local agencies never hesitate to  answer the call, and we owe them a debt of gratitude that words alone  cannot repay.\n\nFew incidents better encompass the bravery of our local agencies than  the 2024 Corral Fire, which burned 14,168 acres, forced the evacuation  of thousands of homes in the…", "date": "2025-05-23", "source_url": "https://justfacts.votesmart.org/public-statement/1691677/recognizing-the-1st-anniversary-of-corral-fire-in-san-joaquin-county-california"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…Columbia have enacted 36 percent APR caps or banned  payday loans. Lenders in these States have incentives to offer more  affordable loans that borrowers have an ability to repay. The same  incentives should apply across the Nation.\n\nI thank the 176 consumer advocacy groups, faith-based organizations,  veteran service organizations, and trade associations…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699782/9999"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…It is shocking that anyone can defend these shameful words by this  President.\n\nDepartment of Justice lawyers, in briefs filed during the case,  promised more than once to repay the tariffs if they lost. We have that  in writing. I am happy to share it with the gentleman and any of my  Republican colleagues. They stated: ``If tariffs imposed on plaintiffs…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700195/providing-for-consideration-of-hr-dont-mess-with-my-home-appliances-act-and-providing-for-consideration-of-hr-homeowner-energy-freedom-act"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…novel example  of a people always guided by an exalted justice and benevolence. Who  can doubt that in the course of time and things the fruits of such a  plan would richly repay any temporary advantages which might be lost by  a steady adherence to it? Can it be, that Providence has not connected  the permanent felicity of a nation with its virtue?…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700269/president-washingtons-farewell-address"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…Foreign Wars  Post 10095, and all the volunteers who dedicated their time and effort  to bring this distinct honor to Northeast Florida.\n\nMr. Speaker, we will never be able to repay our debt to those who  have given their last measure of devotion for the spirit of America.  But we can continue to do our duty: to remember. May the lives of those  who served…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690073/town-of-hilliard-remembers-our-vietnam-veterans"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "…the repayment terms  for small rural communities in my district so they are able to afford  their 35 percent cost share of the project that they are statutorily  obligated to repay.\n\nAfter the project broke ground, inflation took place. Costs doubled  under the previous administration. The price tag of this project  doubled due to construction and labor…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698700/finish-the-arkansas-valley-conduit-act-veto-message-from-the-president-of-the-united-states"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…exposure. We remember those who faced brutal captivity as prisoners of  war, and the 1,200 servicemembers still missing in action from Vietnam.\n\nMr. Speaker, we may never be able to repay our debt to those who have  given the last measure of devotion for the spirit of America, but we  can continue to do our duty to remember.\n\nMr. Speaker, on National Vietnam…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689202/saluting-vietnam-veterans"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…district where an individual  was collecting her dead mother's Social Security checks for 3 years.  Her blatant fraud was finally discovered, and she was sentenced and  ordered to repay $25,000 in restitution. This case is not isolated. The  Government Accountability Office estimates that the Federal Government  loses up to $521 billion to fraud every single…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699247/epidemic-of-waste-fraud-and-abuse"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…our law enforcement and first responders across our  country do each year.\n\nThere is not a recognition that can ever bring them back. There is  not an award that could ever repay their sacrifice. What we can do is  ensure that their courage and their service and their legacies are  recognized by the highest office of our land, the Office of President.…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699504/medal-of-sacrifice-act-of-2025"}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "…living Medal of Honor recipients, 61 men who  faced unthinkable odds, who put their country before themselves so that  the rest of us could live in peace. We cannot truly ever repay them.  There is no sum, there is no medal, there are no words that can measure  up to their sacrifice. But there are ways that we can continue to honor  them, by ensuring that…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696586/medal-of-honor-act"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…construction, increase the Federal share, or create any new  entitlement. It doesn't bail out any mismanagement. It simply gives  rural communities more time and flexibility to repay the Federal  Government. It extends the repayment period and lowers the interest  rate in cases of economic hardship. It prevents hundreds of millions of  dollars from being…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698701/finish-the-arkansas-valley-conduit-act-veto-message-from-the-president-of-the-united-states"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…ObamaCare fraud, such as requiring the exchange to verify       Social Security numbers and income data before enrolling       applicants in plans. It also requires people to repay the       government if their incomes turn out to be higher than       what they estimated on their applications. The       Congressional Budget Office projected that the tax…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697906/affordable-care-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…military award. It is  reserved for servicemembers who have demonstrated extraordinary bravery  and self-sacrifice in combat.\n\nThe Medal of Honor special pension is intended to repay part of the  debt that our Nation owes them. The Medal of Honor pension is separate  from the compensation that a veteran receives when they are unable to  work due to service-related…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688213/medal-of-honor-act"}]