[{"senator": "Maxine Waters", "party": "Democrat", "sentence": "…not stop until our Nation's affordable housing and  homelessness crisis ends once and for all.\n\nBut that is not all. Let's take a look at Social Security. Trump  promised repeatedly not to cut Social Security under his  administration. He said: ``Social Security will not be touched, it will  only be strengthened.''\n\nBut listen carefully to what Trump…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "Chellie Pingree", "party": "Democrat", "sentence": "…a cover story for institutional failure.\n\nAs the top Democrat of the Appropriations Subcommittee that oversees  the Kennedy Center's funding, I can tell you this: We have repeatedly  asked for financial information, for meetings, for transparency about  what is happening inside the center. Our requests have been ignored.\n\nThat should alarm every Member…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699704/changes-at-the-kennedy-center"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…greenhouse gas emissions, and California has  been proud to set the example for other States who may choose to follow  suit.\n\nNow, I use the word ``choose,'' and I will use it repeatedly, because  over and over again in this debate, I have heard some arguments coming  from Republicans that I think are misleading the American public. I  hear arguments like,…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691454/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…was abused and detained for  months. He was deprived of adequate food and reportedly lost a third of  his body weight. Senator Van Hollen, I, and other Members of Congress  repeatedly raised concerns about him, and thankfully, on Thanksgiving  Day, he was released. It is now the Israeli Government's obligation to  hold accountable the soldiers who beat…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697313/palestine"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…Representatives.\n\nTo Speaker Johnson and Leader Jeffries: In 2014, a       Washington, DC resident (name withheld to protect the       victim's privacy) abused his wife with a TASER, repeatedly       shocking her in the face and head. While she was still       suffering the effects of the TASER, he repeatedly hit her in       the head with a baseball bat, punched…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700034/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…Member of the Appropriations Committee Rosa DeLauro,  I introduced a new bill called the Appropriations Compliance and  Training Act. Unfortunately, this Administration has repeatedly  demonstrated their lack of understanding and respect for the direction  provided through the Appropriations process.\n\nThe Power of the Purse rests with the Article I branch…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693088/introduction-of-the-appropriations-compliance-and-training-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…their firearms, or slept on the job. H.R.       2096 would also restore a 90-day statute of limitations for       claims against police officers that, in the past, was       repeatedly used by officers seeking to avoid accountability.       Every MPD Chief for the past 15 years has supported this       reform because it empowers police leadership--not a…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692302/protecting-our-nations-capital-emergency-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…resident who drives drunk and doesn't hurt anybody. That is  not where we are losing lives. We are losing lives because there is a  small percentage of people who drive drunk repeatedly. The vast  majority of them are citizens.\n\nWe are not taking that seriously enough, but a lot of States are. In  fact, a majority of the States have now imposed the compulsory…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693082/jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-2025"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…the funding is going to come back. Elon  Musk even put out a tweet where he named the factory in my district and  said they are going to get their funding back. Marco Rubio repeatedly,  including in front of the House Foreign Affairs Committee, said that  funding for emergency food aid would be restored. They leaked a story  to FOX News about how they…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693021/trump-administration-needs-to-honor-its-word-on-food-aid"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…6 get off without any charges.\n\nWhat is happening to this country? What is happening?\n\nAnd if that is not enough to disqualify him, one whistleblower  testified Mr. Bove repeatedly told DOJ lawyers to ignore court orders  and even deliberately mislead judges. Mr. Bove encouraged officials not  to tell judges the truth, the same sort of judges he is…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693921/nomination-of-emil-j-bove-iii"}, {"senator": "Nelida Pou", "party": "Democrat", "sentence": "…our district that it was rescinding $8 million in critical funding.\n\nI urgently appealed to Secretary McMahon. My office met with the  Department, and our school districts repeatedly sought engagement. We  were ignored.\n\nOver the holidays, the Department informed us that the cuts were  final and will begin immediately.\n\nOver the next 3 years alone, schools…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698570/lodi-teachers-recognition"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…Representatives.\n\nTo Speaker Johnson and Leader Jeffries: In 2014, a       Washington, DC resident (name withheld to protect the       victim's privacy) abused his wife with a TASER, repeatedly       shocking her in the face and head. While she was still       suffering the effects of the TASER, he repeatedly hit her in       the head with a baseball bat, punched…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700033/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…foreign nation, the administration dispatched American  servicemembers to invade and arrest the corrupt leader of Venezuela,  Nicolas Maduro--military action that we were repeatedly told would  never come to pass, by a President who promised to avoid starting new  foreign wars, engaging in nation building, or conducting regime change  operations.\n\nThis…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699093/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…Stacie, herself a proud Marine who would later retire  as a First Sergeant.\n\nFollowing the tragic attacks on our Nation on September 11, 2001,  Sergeant Major Black deployed repeatedly to the frontlines of the  Global War on Terror. With the 2nd Battalion, 1st Marines, he completed  two combat deployments to Iraq during Operation Iraqi Freedom, and  later,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694958/recognizing-the-retirement-of-sergeant-major-troy-e-black"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…to school, and workers  and vendors fear being pulled from the streets and detained simply for  the way they look or the language they speak.\n\nThe Trump administration has repeatedly justified these militarized  raids as necessary to target the ``worst of the worst.'' But the facts  tell a different story, one that I have laid out repeatedly on this…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698781/operation-midway-blitz"}, {"senator": "Ron Estes", "party": "Republican", "sentence": "…career.\n\nMany Kansans know Debbie and have appreciated her dedication to  serving the people of the Fourth District of Kansas. She is a pillar in  Kansas politics and has been repeatedly recognized for her service,  most recently receiving the Spirit of Unity Award from the Sedgwick  County Black Republican Council. She has also twice received the Kansas…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690554/recognizing-debbie-lupers-tenure-as-district-director-for-the-fourth-district-of-kansas"}, {"senator": "Troy Balderson", "party": "Republican", "sentence": "…security. Boosting  natural gas production in Ohio and expanding LNG exports are essential  to our vision of energy dominance.\n\nUnder the last administration, President Biden repeatedly undermined  the domestic energy producers, including imposing a ban on new LNG  export permits. This misguided action discouraged investments in  American natural gas and…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697093/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…this reality and instead  offers a theory that would convert the NFA from a tax statute into a  freestanding gun registry, an outcome Congress has never authorized and  has repeatedly rejected. Even the 1986 Firearm Owners' Protection Act  prohibited a Federal registration scheme: `` . . . nor that any system  of registration of firearms, firearms owners,…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697383/restoring-second-amendment-rights"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…aspect of his  life. His business, Cameron Tire Store, has been a staple of the  community since he purchased the property in 1992. Bill has served on  committees and boards repeatedly since moving to Milam County, as his  leadership cannot go unnoticed. In the early 2000's, he was selected to  serve on the committee tasked with developing the new jail…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696330/recognizing-william-bill-forest-harris-with-a-congressional-veteran-commendation"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…Speaker, I recently had a constituent write to me, outlining her  and her husband's experience, demonstrating systematic fraud within the  ACA marketplace. Her husband has been repeatedly enrolled in an ACA  plan without consent since November 2023 in a scheme where brokers and  agents are fraudulently enrolling individuals to collect commissions  and meet…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698387/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…on is that the  government needs to stay shut down and that the American people need to  suffer even more than they have already made them suffer.\n\nWe heard from Democrats repeatedly about the millions of people they  believe are going to be affected when their own temporary COVID credits  sunset at the end of this year--their own temporary COVID credits.…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696692/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…people here. We educate them with our system, and  then we send them home to compete with us.\n\nHave we lost our minds? To President Trump's credit, he has talked  about this repeatedly.\n\nForgive me, but I am going to have to reach over here to do a little  sorting of these charts because they are out of order.\n\nFirst, I need to work out some principles.…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692327/math-always-wins"}, {"senator": "Darrell Issa", "party": "Republican", "sentence": "…once, but multiple times. Each time this body has voted down, on a  broad bipartisan basis, this amendment.\n\nThere is reason for that, Madam Chair. It has been voted down  repeatedly because, in fact, it is misguided, and it relies on facts  that simply aren't facts.\n\nI don't know about the author of this bill, where he got it, but I  can tell you this.…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693681/department-of-defense-appropriations-act-2026"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…advocate for Taiwan's voice to be  heard where membership is not possible. This principle has lasted  decades across Republican and Democratic administrations, and it has  repeatedly been reaffirmed in bills passed by this Congress.\n\nMr. Speaker, advocating for Taiwan's membership in the IMF would also  unlock access to other international financial institutions.…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692794/taiwan-non-discrimination-act-of-2025"}, {"senator": "Ken Calvert", "party": "Republican", "sentence": "…Mr. CALVERT. Mr. Chair, the gentlewoman's amendment would strike $500  million in funding for the vital Israeli missile defense capability.\n\nOver the past 2 years, Israel repeatedly has been attacked by Iran  and its terrorist proxy groups, Hezbollah, Hamas, and the Houthis. Each  time, these groups have vowed to destroy the State of Israel.\n\nThe United…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693682/department-of-defense-appropriations-act-2026"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…do it. During President Biden's State of the Union Addresses, which, by  the way, his last one was one of the most caustic, partisan speeches I  have ever seen, where he repeatedly compared himself to his  predecessor; that is, his political opponent at the time. Dozens of  times, Democrats stood and applauded.\n\nBy the way, on our side, for a lot of…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688626/finding-common-ground"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…spending,'' because it is not  mandatory. We have just chosen to put it on autopilot. It is automatic  spending. It is not mandatory.\n\nMr. ROY. I have been saying in this building repeatedly that the math  has to math. The math has to add up.\n\nWould the gentleman agree that that is the fundamental and core  problem in this town when we are talking about the state…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690587/economic-anxiety"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…live in peace with the nations it formerly enslaved and with the West.\n\nIn other words, the invitation was open to join us and be a part in  what we were doing. Putin has repeatedly rejected such peaceful  coexistence. Instead, what he has done is he has chosen bloody, neo- Soviet empire-building instead.\n\nTo the extent that NATO has grown, it has been…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699111/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "David Rouzer", "party": "Republican", "sentence": "…legislation under  suspension, most recently on December 17, 2024.\n\nOutside of Congress, the Lumbee Fairness Act has the support of 236  Tribes across the country that have repeatedly cited the unfair  treatment of the Tribe under the 1956 Lumbee Act.\n\nToday, Congress can take a major step forward to end the unfair and  unjust treatment of the Lumbee Tribe…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695245/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…fewer polling  places and vote centers for people to actually vote in.\n\nIt is voter suppression through and through in an attempt to reverse  the clearly articulated and repeatedly expressed view of the California  electorate.\n\nThat is not all. For those voters who do turn out, the Governor needs  to make sure that they are unable to express their true…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694972/the-california-redistricting-war"}]