[{"senator": "Al Green", "party": "Democrat", "sentence": "…measure of a man. . . .'' Where do you stand in times  of challenge and controversy?\n\nLet's talk about this. Where do you stand when the President of the  United States has replaced Congress with corporate America; when the  President of the United States will consult corporate America before he  consults Congress; and when the President of the United…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699134/where-do-you-stand"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…beneficiaries. It is true it's been becoming harder for       people to access their benefits but also for other services       such as getting their Social Security card replaced. There       [are] some days where people are waiting for 8 hours just to       talk to a customer service representative or they don't even       get the call back and have…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690633/nomination-of-frank-bisignano"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…Moreover, it  allows them to be sold at salvage value, effectively making it so that  the Federal Government and the taxpayers would actually be subsidizing  gun sales. They replaced fair market value with salvage value.\n\nMy colleagues have claimed that the bill would not really allow for  the sale of all of these types of firearms because it only applies,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691349/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…examples. When there is a culvert out, there is  a road out, there is a bridge down, the people whose bridge is  affected, the people who are threatened if we have a culvert replaced  that is too small for what now we know will be the required carrying  capacity of a culvert, the best people to make that are right there in  that community. They have a…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693402/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…DOGE access to the  Social Security database and all the sensitive personal data it holds  on everyday Americans. Bravo to Michelle.\n\nThe administration got rid of her and replaced her with Leland Dudek,  a man who was already under investigation for sharing highly sensitive  data with the DOGE team.\n\nWhile courts across our country step in to try to…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689396/trump-administration-lies-about-social-security"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…States Constitution,  vital to our democracy and to accountability.\n\nHowever, we have seen attack after attack, threats on the media and  communications companies, outlets replaced in the Pentagon, an order  attacking PBS and NPR just this very week, and an attempt to throw the  AP out of the White House for daring to tell the truth.\n\nThese attacks are…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690908/a-free-press-is-vital-to-democracy"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…validation of the slate.\n\nAnd it is at that moment that we journeyed back from the House of  Representatives here, and those beautiful wooden boxes with straps and  buckles were replaced on the table here before the dais of the Senate.  And then as we were in that moment of preparing to debate whether or  not we would agree or disagree with the acceptance…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698521/anniversary-of-january-6"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…General this bill would require to testify  before our committee was one of the people Trump arbitrarily fired  earlier this year.\n\nSince that firing, the acting HUD IG has been replaced again, and  there is no one being considered by the Senate for confirmation. As a  result, no one in this Chamber knows when our committee will be able to  receive this testimony.…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697210/hud-transparency-act-of-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…businesses to replace their  commercial refrigerator equipment. These standards don't go into effect  until 2029, and even then it is only when existing products need to be  replaced that businesses will be looking at the upfront cost of any new  products.\n\nMany of these products already exist on the market, the ones with the  new standards, so it is not…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689127/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…still dealing with the  consequences of this unauthorized and unlawful military strike. Nicolas  Maduro, a brutal tyrant, was removed from power. The Trump  administration replaced Maduro with his own damned vice president. Is  that the big victory that my friends think we should be celebrating?  Meet the new boss. Same as the old boss.\n\nThey left in…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699359/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…another report pointed out, some of the  benefits that our natural systems provide to humankind ``are not  substitutable, meaning they must be protected as they cannot be  replaced by technology when they are gone.'' Irreplaceability is one  danger; irreversible acceleration is another.\n\nSome of the harms fossil fuel emissions cause hit tipping points…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699613/9999"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…ending World War II--we are so  thankful for the sacrifice, the bravery, and the courage of the  Greatest Generation. A few months after, he unexpectedly became  President, he replaced the great FDR. On November 19, 1945, he  delivered a special message to Congress recommending a comprehensive  health program.\n\nI want to read just a few of those words because…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…under the       waiver.\n\nWith very few exceptions, payments were halted for our       lifesaving work. USAID's efficient and reliable financial       system was destroyed, and replaced by a wasteful and       inaccurate patchwork that fails to provide needed funding to       implement our programs.--and--\n\nAnd--The Global Health workforce was slashed from…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691139/us-global-health-programs"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…during our prior debate, in this instance is probably the most  insidious of all.\n\nThere are a couple of reasons why. One, the resource management plan  that was adopted replaced a plan that was nearly 40 years old. This  resource management plan provided a modern framework that balances  responsible energy and mineral development with the protection…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694909/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…to rest for over 100 years under a  headstone etched with a Latin cross.\n\nIn a moving ceremony sponsored by Private Moser's family, these  American heroes' headstones were replaced, properly honoring their  heritage after all these years. It was so moving to honor the  tremendous sacrifices Jewish Americans paid in service to our Nation,  fighting for…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695467/fallen-servicemembers-religious-heritage-restoration-act"}, {"senator": "Tom Emmer", "party": "Republican", "sentence": "…major changes and  challenges during his 22 years of service, including the construction  and completion of Carver's new fire station. Completed in 2005, the new  fire station replaced the Old Carver Fire Hall, which originally opened  for service around 1880.\n\nThe Old Carver Fire Hall stored the volunteer Carver Fire  Department's one horse-drawn hook and…", "date": "2025-11-04", "source_url": "https://justfacts.votesmart.org/public-statement/1696511/recognizing-carver-fire-chief-cally-trimbo-after-22-years-of-service"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…accident can be even if there are no  physical injuries. These accidents cause not only bodily injury but  property damage to a person's car, and it must either be repaired or  replaced, often costing hundreds or even thousands of dollars.\n\nIn the case of a hit-and-run, the situation is even more difficult  because the victim cannot get the insurance information,…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698979/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…more'' in a minute.\n\nToday, an American homeowner spends about 34 percent more money on  appliances than they did just 15 years ago. From 1995 to 2005, the  average homeowner replaced their appliances about every 12 or 13 years.  These days families get new appliances about every 8 or 9 years. Maybe  it is because they are not as efficient as they used…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688547/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "…Land       Management (BLM) issued the North Dakota Field Office Record       of Decision and Approved Resource Management Plan (North       Dakota RMP). The North Dakota RMP replaced the 1988 North       Dakota Resource Management Plan and provides directives and       guidance for the management of BLM-administered lands across       North Dakota.\n\nThe…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693059/us-government-accountability-office-legal-opinion"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…this ROD was well-intentioned, it comes at a very serious cost  to communities and power customers. Due to the bypass requirements, the  lost hydropower generation must be replaced with power purchased on the  open market.\n\nWAPA makes these purchases from the Upper Colorado River Basin Fund  which is funded by power revenues or, in other words, by the…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691059/memorandum-of-understanding-to-address-potential-impacts-of-a-certain-record-of-decision-on-the-upper-colorado-river-basin-fund"}, {"senator": "James Risch", "party": "Republican", "sentence": "…previously reported MDE item:       the remanufactured Embedded Global Position Systems with       Inertial Navigation (EGI) with Multi-Mode Receiver (MMR) are       being replaced with thirty-six (36) EGIs with MMR from new       procurement. This transmittal also notifies an adjustment to       the following previously reported non-MDE item: the…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699550/arms-sales-notification"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…of powers and one that we ought to have. The Constitutional Convention  originally considered giving Congress the exclusive power to make war.  Elbridge Gerry successfully replaced ``make war'' with ``declare war.''\n\nMadison explained this distinction as ``leaving to the executive the  power to repel sudden attacks.'' That distinction has been widened…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698660/lessons-from-caracas"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…Partnership, a voluntary industry initiative administered by       API and whose members represent nearly 70 percent of U.S.       onshore oil and gas production, have removed or replaced more       than 180,000 gas-driven pneumatics, resulting in the       permanent reduction of an estimated 355,421 metric tonnes of       CH4 per year released into the atmosphere…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688182/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…rules, regulation, guidance, or other materials of the Social       Security Administration, whether online or in print--\n\n(1) the term ``early eligibility age'' is replaced with the       term ``minimum monthly benefit age'';\n\n(2) the terms ``full retirement age'' and ``normal       retirement age'' are replaced with the term ``standard…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697232/claiming-age-clarity-act"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…agents are fraudulently enrolling individuals to collect commissions  and meet enrollment quotas. This broker gained unauthorized access to  his prescription records and replaced his legitimate employer-sponsored  insurance coverage at his pharmacy.\n\nI wish I could say that these examples are one-time instances, but we  know they are not. The system…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698387/lower-health-care-premiums-for-all-americans-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…couple of years.\n\nWe have already been being lobbied by, ``We are the archaeological  guild. We are the geological guild,'' we are this and that because we  don't want to be replaced by the technology, so it should take 2 years.  We are going to do permitting reform, saying we want to do it in half  the time, so we are going to have these people walk twice…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694915/facts-and-math"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…talking about children. We are not talking about the  elderly. We are not talking about the disabled. We are talking about  able-bodied adults.\n\nThe Welfare Reform Act of 1996 replaced AFDC, as it was called, with  TANF, or Temporary Assistance for Needy Families, which imposes a 5- year limit on cash assistance and required recipients to either work or…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689668/government-funding"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…redevelopment that transformed outdated housing into modern  neighborhoods where military families can thrive.\n\nThe results speak for themselves. Nearly 2,000 obsolete units were  replaced, and hundreds more were renovated. New homes were built to  meet the needs of today's airmen and their families.\n\nThe community now known as Rising View was recognized for…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696802/recognizing-lisa-yanney-roskens"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…trivialize the battered  victim in the womb. Unborn babies need Members of Congress to be their  friends and advocates, not powerful adversaries.\n\nAbortion violence must be replaced with compassion and empathy for  women and respect for the weakest and most vulnerable.\n\nMr. SMITH of Missouri. Mr. Speaker, I remind this body that the  reason why these…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698800/breaking-the-gridlock-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…Atlantic region.\n\n(vi) Sensitivity of Technology: The GBU-39/B Tactical       Training Round (TTR) is identical to a live tactical weapon,       except that the live warhead is replaced with an inert fill.       The TTR functions the same as a GBU-39/B. The TTR is suited       for training missions.\n\nThe Sensitivity of Technology statement contained in the…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693742/arms-sales-notification"}]