[{"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…the FTC do important work to protect all Americans from  dangerous products, including emerging technologies. While this bill  will help assist in those efforts, it is no replacement for strong,  independent, and bipartisan agencies or proper funding and staffing  levels.\n\nI hope, in addition to supporting this bill, that my Republican  colleagues will…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693412/consumer-safety-technology-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…bills to reimburse benefits.\n\nI ask my Republican colleagues, where were you in December when the  law expired? Republicans tanked the bipartisan deal to continue benefit  replacement.\n\nWe don't need more gratuitous bills from Republicans who just voted  to cut SNAP by $300 billion. We need them to step up and tell Speaker  Johnson to schedule a vote…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692258/end-hunger-now-snap-skimming"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…cuts services, has announced that it will not keep the  Social Security Administration's hearing office in White Plains, New  York. Closing this hearing office with no local replacement is  unacceptable to the community it serves, and it covers multiple  congressional districts.\n\nSeniors and people who are disabled come to this office from  Westchester…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687931/white-plains-social-security-hearing-office-closure"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…new steps to  specify which projects to fund at which amounts. For example, this bill  sets aside $100 million for light rail on the I-5 bridge for the  Interstate Bridge Replacement Program and $82 million for bus rapid  transit in Spokane. Both projects, I have been fighting for, for a very  long time.\n\nThe guardrails that we secured for CIG are one…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699453/appropriations"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…consuming. Whether it is fruit, vegetables,  electronics, or otherwise, they just find somewhere else to get it.  When those other countries, those other markets, find a replacement for  their supply, they are not going to give it up in 2 months, maybe, if  Donald Trump wakes up in a better mood and sees the error of his ways  when it comes to these…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690535/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…Area.\n\nMr. Speaker, Park Service has to have a rule in place if they want to  authorize any access. That is what this rule does. If Congress repeals  it and the CRA says no replacement rule can be issued, that is how it  works. It is like Cortez when he got to Mexico, he burned the boats so  nobody would go back. That is how the CRA works.\n\nYou burn the…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690404/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…investigations.\n\nHouse Republicans have similarly remained totally mute about the fact  that as of today, almost a year later, Trump has continued his failure  to nominate a replacement inspector general. They are apparently not  too eager about addressing fraud to have a real watchdog there.\n\nJust as they yell ``fraud'' as an excuse to replace ObamaCare…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698920/ending-improper-payments-to-deceased-people-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…the authority of the       Government of Ukraine, including governmental entities within       Ukraine, engaged in resisting Russian aggression against       Ukraine for replacement of any weapons or articles provided       to the Government of Ukraine from the inventory of the United       States, and to recover or dispose of equipment procured using…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693693/department-of-defense-appropriations-act-2026"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…before us  today.\n\nThe CRA, as we have said several times in the course of this debate,  is a blunt instrument. It would prevent BLM from ever issuing a  substantially similar replacement, and so this path would strip local  land managers of the ability to respond to on-the-ground changes and  needs for the future of the NPR-A.\n\nMy friends across the aisle…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696836/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…America is so costly to our image and esteem around the  world.\n\nThe White House is a symbol of America, and he is destroying a part  of it. What he intends to build as a replacement to the East Wing is a  gargantuan insult to America, and it is unfortunately emblematic of a  lot of the other destruction he is doing in so many other areas as we  watch…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696345/trump-administration"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…pandemic crunch.) Inevitably it seems that we are going to       end up spending more money to provide less care to our       residents. If we are not able to pivot and find replacement       workers this will lead to nursing home closing and hospitals       being stuck with the overflow, people being sent home from       the hospital without much needed…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699720/witness-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…D.C.  Council approval.\n\nUnder current law, when the Board is performing functions regarding  an application by a foreign mission with respect to the location,  expansion or replacement of a chancery, the Board consists of the  Executive Director of NCPC, the Director of the National Park Service  (or, if the President so designates, the Secretary of Defense,…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693426/introduction-of-the-district-of-columbia-board-of-zoning-adjustment-home-rule-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…as states are eligible for these programs. It would also  make D.C. eligible in the same manner as states are eligible for a  transportation program that would support the replacement and removal  of infrastructure that damages the ecosystems of the Anacostia and  Potomac rivers. D.C. residents pay the same federal taxes as residents  of the states and…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698538/introduction-of-the-district-of-columbia-transportation-funding-equality-act"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…understands the  gravity of this moment. Negotiating a successor agreement will take  years, not months, and we are already past the danger zone.\n\nIf New START expires without a replacement, there will be no legally  binding limits on the world's two largest nuclear arsenals for the  first time in more than half a century. The consequences of that  outcome…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699037/expiration-of-new-start"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…the last remaining major arms control agreement between  the Soviet Union, or Russia, and the United States, is set to expire.\n\nIf we allow this treaty to lapse without a replacement, then we will  be entering a world we haven't seen in decades, a world without limits  on the nuclear arsenals of the two largest nuclear powers: Russia and  the United…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699035/expiration-of-new-start"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…Missouri. Mr. Speaker, I move to suspend the rules and  pass the bill (H.R. 1155) to amend the Internal Revenue Code of 1986 to  allow taxpayers to elect to receive certain replacement refunds  electronically, as amended.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:                                 H.R. 1155\n\nBe it enacted…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689291/recovery-of-stolen-checks-act"}, {"senator": "Nicole Malliotakis", "party": "Republican", "sentence": "…David Kustoff, introduced H.R. 1155, the Recovery of Stolen  Checks Act, a bipartisan bill that would allow taxpayers whose tax  refunds were stolen in the mail to receive a replacement payment via  direct deposit. This legislation passed out of the Ways and Means  Committee last month on a bipartisan basis, and it was unanimous.\n\nIn my district alone,…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689293/recovery-of-stolen-checks-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…establishment       of a plan to--\n\n(1) address the effects that the record of decision may       have on Fund obligations including routine operations,       maintenance, and replacement of critical infrastructure;\n\n(2) address the impact that the record of decision has on       hydropower production at Glen Canyon Dam, including costs to       replace hydropower…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691060/memorandum-of-understanding-to-address-potential-impacts-of-a-certain-record-of-decision-on-the-upper-colorado-river-basin-fund"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…Sunday night before the markets opened on Monday  morning: I will not allow any Board member for the Federal Reserve to  go through the Banking Committee for a Chair or for replacement of  expired terms until this matter is settled. I have no problem with us  having an investigation, like we should with so many other areas of the  government.\n\nI would…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700062/9999"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…State, and that is  true within the NPR-A.\n\nWe had a good framework for responsible development in our petroleum  reserve back in 2020. Today, we can vote to nullify the 2022  replacement and go back to it.\n\nI would urge my colleagues, when we have this measure before us  tomorrow--I would urge support for the resolution.\n\nRe Support for S.J. Res. 80 and…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696449/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "…that Tucson's first responders have reliable vehicles  when every second counts in their line of work. It also includes  funding for the Sahuarita Police Department radio replacement, so  officers can communicate clearly and safely in the field.\n\nAs the Colorado River continues to face a worsening drought, water  security is more important than ever.…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698633/providing-for-consideration-of-hr-saving-homeowners-from-overregulation-with-exceptional-rinsing-act-providing-for-consideration-of-hr-affordable-housing-over-mandating-efficiency-standards-act-and-providing-for-consideration-of-hr-commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…the  equipment our troops depend on from the front lines to forward  operating bases.\n\nEvery rifle sight calibrated, every artillery shell inspected, and  every 3D-printed replacement part shipped from Rock Island shortens the  time between a soldier's need and the answer that keeps that soldier  alive.\n\nWhen rumors surfaced of workforce reductions at…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693676/department-of-defense-appropriations-act-2026"}, {"senator": "David Kustoff", "party": "Republican", "sentence": "…access timely relief. That is why this bill, H.R.  1155, the Recovery of Stolen Checks Act, is so important.\n\nRight now, it can take months and months for the IRS to issue a  replacement for a stolen refund check. That is a long time. Due to the  frequency of mail theft that is happening right now across this great  Nation, many taxpayers are having their…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689290/recovery-of-stolen-checks-act"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…was so that I could  do something that I believe some people in the White House are not  particularly concerned about.\n\nThe night that I told the President he should find a replacement--the  press has gotten this wrong. The President did not ask for people to  replace me, and then I decided to retire. The President and I were  having a dialogue that night.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699082/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…availability, if the event is postponed for       not more than 6 months and the original event ticket is no       longer valid for entry to the rescheduled event, a       replacement event ticket for the rescheduled event in the       same or a comparable location once the event has been       rescheduled; or\n\n(3) if the event is postponed for more than…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690175/transparency-in-charges-for-key-events-ticketing-act"}, {"senator": "David Rouzer", "party": "Republican", "sentence": "…critical step toward strengthening our port infrastructure and  national security by expanding the eligible use of the port  infrastructure development program to include the replacement of  Chinese port hardware and software, most notably Chinese cranes and the  software used to operate them.\n\nAs we all know, our country's ports serve an absolutely critical…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692198/maritime-supply-chain-security-act"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…competition since  2017.\n\nIn both competitions, his project centered on experimenting with and  designing fully biodegradable fishing lures as an eco-friendly, cost- effective replacement for plastic lures. The worm-shaped lure, made  from a biopolymer recipe, could substitute for traditional soft plastic  lures which can break off hooks and sink to the bottom…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693515/recognizing-mr-ethan-albright-for-his-achievement-in-local-and-international-science-fair"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…the demand for electricity is only going up.\n\nSince 2022, the retirement of 29,000 megawatts of coal capacity has  been delayed because of rising demand and insufficient replacement  resources. To put it bluntly, removing coal from the grid at this  moment in time would lead to higher costs and greater instability for  families and businesses. This…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695524/providing-for-consideration-of-hr-dc-criminal-reforms-to-immediately-make-everyone-safe-act-providing-for-consideration-of-hr-district-of-columbia-policing-protection-act-providing-for-consideration-of-hr-lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia-providing-for-consideration-of-hr-district-of-columbia-judicial-nominations-reform-act-providing-for-consideration-of-hr-guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act-providing-for-consideration-of-hr-national-coal-council-reestablishment-act-providing-for-consideration-of-hr-promoting-cross-border-energy-infrastructure-act-and-for-other-purposes"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…up. It is substantial because of a couple of  things.\n\nWe got older as a population. We have gone 30 to 40 years with  falling fertility rates. Remember, we are well below replacement rates  in the number of children we have. There is math that, last year and  this year, there was pretty much flat population growth.\n\nThen there is this. I'm trying to…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699674/united-states-fiscal-situation"}, {"senator": "French Hill", "party": "Republican", "sentence": "…regulation.\n\n(5) Infill development.--The term ``infill development''       means a residential housing development on small parcels in       previously established areas for replacement by new or       refurbished housing that utilizes existing utilities and       infrastructure.\n\n(6) Mixed-income housing.--The term ``mixed-income       housing'' means…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}]