[{"senator": "Greg Casar", "party": "Democrat", "sentence": "…Representative Cory Mills' residence, where officers were called to the  1300 block of Maryland Avenue, Southwest, around 1:15 p.m. for the  report of an assault;\n\nWhereas, police reports obtained by NBC4 Washington confirmed that  the Washington, D.C., Metropolitan Police Department was investigating  Representative Cory Mills for an alleged assault of a 27-year-old…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695580/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…that the PIF will establish a mission  to the U.S., direct the President to consult and coordinate with allies  and partners in the Pacific Islands region and update certain reports  regarding transnational crime affecting the Pacific Islands.\n\nI urge my colleagues to join me in supporting this legislation to  sustain and expand U.S. engagement in this…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693376/introduction-of-the-pacific-partnership-act"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…Venezuela doesn't produce any fentanyl. What Venezuela  produces and ships is cocaine.\n\nNow, cocaine can kill you. But that cocaine isn't even coming to the  United States. Reports are that 90 percent of that cocaine is going to  Europe.\n\nSo to the extent we were targeting drug boats off the coast of  Venezuela, to the extent that any of the rationale…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698610/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…numerous arrests, were reportedly conducted without prior       notice, causing severe disruption and significant damage to       the affected businesses.\n\nDisturbingly, reports indicate that individuals with       limited English proficiency or those unable to immediately       provide documentation verifying their legal status were       detained…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692896/condemning-violence-by-ice"}, {"senator": "Raul Ruiz", "party": "Democrat", "sentence": "…and intensifying scrutiny of Federal tactics.\n\nLast year was the deadliest year in over 20 years, with over 56  people dying under ICE and CBP custody in detention centers. Reports of  detainees like Luis Beltran Yanez-Cruz, who died in a hospital in my  district after complaining for days of chest pain without receiving the  appropriate urgent care,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699658/horrific-ice-abuses"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "…Scottsdale Police  Department, and Officer Zane Tristan Coolidge of the Phoenix Police  Department.\n\nPolice Officer Zane Coolidge was shot in the line of duty while  responding to reports of larceny, passing away at the hospital. He  served with the Phoenix Police Department for 5 years and is survived  by his wife and infant daughter.\n\nOfficer Buckner was…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689660/authorizing-the-use-of-the-capitol-grounds-for-the-national-peace-officers-memorial-service-and-the-national-honor-guard-and-pipe-band-exhibition"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…Safety and Wellness Through Data Act, which seeks to improve law  enforcement officer safety and wellness by requiring that the AG and  other Federal officials issue regular reports on attacks on police  officers, aggression against police officers, and on officer mental  health.\n\nI salute Mr. Fry, a freshman to this body, for his stewardship of  this…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691320/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…her husband who tragically died  in 2023. She was a devout Christian who participated in youth mission  trips to Northern Ireland when she was younger. According to multiple  reports, she was a poet, a writer, a wife, and a mother.\n\nShe had lived most of her life in Colorado and briefly moved to  Kansas to stay with her parents after her second husband,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698835/americans-in-state-of-desperation"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…licensing laws in the  United States and no longer accept attestation?\n\nEach of us must submit records to the FEC, attesting under penalty of  perjury that our campaign committee reports are accurate. Do  Republicans now want to provide the American people greater  transparency around political spending because if they do, I have a  bill they can support,…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690001/safeguard-american-voter-eligibility-act"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…faced in the last 3 years.\n\nMeanwhile, my district and my community are under assault by our own  government, and I ask my colleagues to listen. Members may have seen  the reports, but pictures don't convey the screams of families being  separated, U.S. citizens being arrested without cause, and the  indiscriminate gassing of innocent families, including…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696777/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…was visiting his family in the West Bank.\n\nHe was beaten on his own family's land by settlers. We have grown too  used to this kind of violence. We have grown weary of news reports  detailing the onslaught of deaths, but we should never accept the  killing of innocence, let alone the killing of an innocent American  citizen.\n\nIn an unusual and forceful…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693759/saif-musallet-killing"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…use that term  because that is how so many agents are acting, either voluntarily or  not.\n\nICE and DHS have no credibility, and neither do their stories. They  have lost it.\n\nReports indicate that officers involved were not wearing body  cameras. This is not law enforcement. This is becoming an American  gestapo.\n\nSilverio's tragedy is not alone. It affects…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695742/ice-and-dhs-lost-credibility"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…Portland. It  is outrageous. The situation has been completely distorted by the  President to suggest that there is major civil upheaval. That is not  the case at all from the reports I have heard.\n\nHis also suggesting that military personnel can enforce the laws of  the United States violates the Posse Comitatus Act, which has been a  barrier to police…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696343/trump-administration"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…Federal Government, through the EPA, isn't  willing to step up to meet the challenge of air quality in California,  let California take care of Californians. As these studies and reports  lay out, California's leadership is working. Kids are breathing cleaner  air.\n\nBut we still have a lot more work to do. We have a track record of  successfully developing…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691583/hj-res-88"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…way that ensures  it is as effective and robust as possible. I would like to take this  time to highlight some of those concerns.\n\nFirst, based on congressionally mandated reports that the committee  has received, VA has not established enough metrics to allow Congress  to monitor the success of the program. Additionally, in our view,  grantees are…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691508/no-wrong-door-for-veterans-act"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…areas of our border.\n\nI did note a couple things that I have read. That was interesting for  me to actually go down and to be able to see because I have seen all  these media reports, all these different pieces of fake news that are  coming up or all these different challenges about what the Trump  administration is doing at our border.\n\nI could highlight…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690878/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…comparable system       for senior-level Government employees, as defined by the       Secretary, who were provided a critical skill incentive under       paragraph (1).\n\n``(ii) Reports submitted pursuant to clause (i) may be       submitted by incorporating their contents into other       congressionally mandated reports to the committees described…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693967/protecting-regular-order-for-veterans-act-of-2025"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…can make it harder for the radiologist reading  the mammogram to see the breast cancer. So last year, the Food and Drug  Administration started requiring that all mammogram reports sent to  patients must include breast density, which should be described as  either ``not dense'' or ``dense.''\n\nIf someone is notified that they have dense breasts, they…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696323/breast-cancer-awareness-month"}, {"senator": "Diana Harshbarger", "party": "Republican", "sentence": "…welcoming both  domestic and international visitors to experience the rich musical  heritage we have across America.\n\nIt also ensures that Congress stays informed, with regular reports on  our progress, our success, and any challenges that we face.\n\nImportantly, let me emphasize this bill will not require any  additional taxpayer dollars. It is a smart,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690269/american-music-tourism-act-of-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…California High-Speed Rail  Authority's own estimates, the total project cost has now ballooned by  over $100 billion above that original estimate. Moreover, California's  auditor reports that the HSRA will miss its latest 2033 deadline . . .  without having completed a single segment of the track. Indeed, The New  York Times reported that, according to `projections…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688626/finding-common-ground"}, {"senator": "Troy Balderson", "party": "Republican", "sentence": "…requiring that grid operators  provide opportunities for public comment and stakeholder engagement  before submitting proposals to FERC. Operators must also provide  regular reports to FERC on the state of grid reliability and actions  taken under this bill.\n\nFinally, FERC must review and, if necessary, update its regulations  to ensure they remain effective…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695755/guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…communities are safer, and the economic turnaround has  been equally dramatic. America's energy dominance is back. Gas prices  have dropped to the lowest point in 4 years. AAA reports prices are  expected to continue to fall and perhaps stay low over the busy  Thanksgiving period that is upcoming. Inflation has cooled. Things are  more affordable. Remember,…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696537/government-funding"}, {"senator": "Paul Gosar", "party": "Republican", "sentence": "…This is a report. It has nothing to do with  immigration or immigration-like actions. It is a simple report. If you  do your oversight right, you better be following these reports. You  better be finding where those little glitches may be, and this is one  of those aspects.\n\nMr. Chair, I ask that everyone vote for this amendment, and I yield  back the…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697892/electric-supply-chain-act"}, {"senator": "Tom Emmer", "party": "Republican", "sentence": "…core  tenet of President Biden's policy agenda. In 2022, President Biden  issued an executive order placing urgency on CBDC research and  development.\n\nMoreover, the agency reports created under that executive order made  it clear that the previous administration was eager to create a CBDC  and was willing to trade Americans' right to financial privacy…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693735/anti-cbdc-surveillance-state-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…This legislation would codify the National Coal Council, an important  advisory committee that had aided our Federal Government for 37 years  with expertise and technical reports on all matters affecting the coal  industry and its workers.\n\nThe reestablishment of the National Coal Council couldn't come at a  better time. It is no secret that our energy…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695764/national-coal-council-reestablishment-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Department policies, that involve hundreds  of billions of dollars in the capital markets. Yet, Members are voting  on that while trading stocks on a daily basis.\n\nCapitol Trades reports that 113 Members of Congress made 9,261 trades  in 2024 involving 706 million shares or other assets. We had a Democrat  who made 4,000 trades for a 20 percent return. We…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691214/stock-trading-ban-for-members-of-congress"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…crazy thing-- this idea of fixing the waste-fraud misalignment--this reform bill  could be Republican and Democrat because anyone who has bothered to  actually read the MedPAC reports for the last half a decade knows we  have a problem.\n\nHow do I get the talent around here to not be terrified of the army  of lobbyists and actually step up and do what is…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692327/math-always-wins"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…international border.\n\n(b) Revocation.--The Secretary of State may revoke a       passport previously issued to any individual described in       subsection (a).       SEC. 5. REPORTS ON FORCED ORGAN HARVESTING AND TRAFFICKING IN                     PERSONS FOR PURPOSES OF THE REMOVAL OF ORGANS                     IN FOREIGN COUNTRIES.\n\nThe Foreign Assistance…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690630/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…doing, but the American people do.\n\nPoll after poll is showing that an increasing number of people now  believe this country is heading in the right direction. A Rasmussen  Reports survey shows that this is the first time in 20 years that the  majority of respondents have felt that way.\n\nGo ahead and vote against these things that will increase work…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691940/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…or partnered  with trusted local firms to work in the following countries: United  States, Iraq, Afghanistan, Pakistan, UAE, Australia, Kenya, Malaysia,  and Kuwait. Public reports indicate companies owned by Representative  Mills sought or entered into contracts to sell munitions to foreign  nations while serving as a member of the Committee on Foreign…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697012/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}]