[{"senator": "Cory Booker", "party": "Democrat", "sentence": "…conviction that this  is about right or wrong, and it is wrong to take away healthcare for  millions of people.\n\nLet me explain, if I can, or speak to a few points from a recent  report by Protect Our Care to explain what the administration is trying  to do to our healthcare system. They want to slash almost a trillion  dollars--about $850 billion--from Medicaid,…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…the ``law'' part of the slogan. But  Republicans continue to leave out that fact and the fact that the  overwhelming majority of those deported had no criminal records.\n\nA report from ``60 Minutes'' just last month showed that 75 percent  of those deported to CECOT had no criminal record. These were people  who in many cases had pending asylum cases…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691401/motion-to-discharge-s-res-195"}, {"senator": "Mike Quigley", "party": "Democrat", "sentence": "…should not receive COVID vaccines. He has pulled funding  for vaccines for diseases like bird flu and HIV. He has spread lies and  stigma about autism. Last week, he released a report citing research  that does not exist--written by AI.\n\nHow many children have to die from measles and other preventable  diseases for RFK Jr. to resign? How many pregnant women…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692028/demanding-resignation-of-robert-f-kennedy-jr"}, {"senator": "George Whitesides", "party": "Democrat", "sentence": "…dealing with gas prices that keep on climbing.\n\nIn just the past couple of weeks, we have received more proof of what  our constituents are telling us. According to a recent report,  California families saw their costs go up by more than $2,000 in 2025  due to inflation. That breaks down to $482 more going toward housing,  like rent or a mortgage, and…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699583/stop-the-republican-affordability-crisis"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…readiness and performance resulted in  their safe return. However, the commanding officials who are  responsible for their deployment have not responded to requests by  Congress to report from which accounts the money was withdrawn-- billions and billions of dollars, for almost 6 months--for the  deployment and actions in the Gulf and Atlantic theater.\n\nThe…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698837/reflecting-on-impact-of-illegal-action-in-venezuela"}, {"senator": "Zoe Lofgren", "party": "Democrat", "sentence": "…enforcement authority. In fact, I  think it did aggravate tensions in the area.\n\nNow, the National Guard remains in Los Angeles to this day. They have  nothing to do. We heard a report from a former commander that less than  20 percent are doing anything and they have been taken away from jobs  where they were needed; for example, helping in efforts of forest…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693144/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…successor in 2021, is widely accepted as free, fair, and  transparent and that the results are honored in and outside of  Honduras.\n\nAt that time, I expressed concern about a report that on July 16,  Counselor Ana Paola Hall had resigned from the National Electoral  Council due to political pressure and threats against her and her  family. I also expressed…", "date": "2025-10-30", "source_url": "https://justfacts.votesmart.org/public-statement/1696472/honduras"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…successful track record demonstrates that providing  reasonable, responsible limits on interest rates does not cut off  consumers' access to credit. According to a May 2021 report from the  Department of Defense, ``credit cards, auto loans, and personal loans  are widely available at risk-based rates under the 36 percent  [military] APR'' and ``[s]ervice…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699792/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "André Carson", "party": "Democrat", "sentence": "Mr. CARSON. Mr. Speaker, I am proud to reintroduce the Justice for  Shireen Act today. I thank my House Colleagues who joined me in calling  for a report to Congress from the FBI and State Department, in  consultation with the Attorney General, Secretary of Defense and  Director of National Intelligence, on the death of American-Palestinian…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699427/reintroduction-of-the-justice-for-shireen-act"}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "…accountability and transparency to power.\n\nEsophageal cancer is the fastest increasing cancer among American  men. It is also one of the deadliest. This bill would direct the GAO to  report on key issues relating to esophageal cancer, including Federal  spending for it under the Federal Employee Health Benefit Program and  the screening rates among high-risk individuals…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691833/gerald-e-connolly-esophageal-cancer-awareness-act-of-2025"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "…top, a twisted  agenda that pardons the powerful, protects the predators, and punishes  the people. Black Americans are paying the price.\n\nMr. Speaker, buried in the last jobs report was this number: The  Black unemployment rate is now 7\\1/2\\ percent. That is a recession- level rate, the highest rate since the pandemic.\n\nDo you think they care at Mar-a-Lago?…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697467/recognizing-myesha-watkins"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…all Georgian Dream officials for sanctions. If  they are found to have undermined Georgian democracy or engaged in  corruption, they will be sanctioned.\n\nIt also creates a report on Russian intelligence assets in Georgia  and Russia-China cooperation undermining Georgian sovereignty. What is  going on is basically a revolution where Ivanishvili, who…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690701/mobilizing-and-enhancing-georgias-options-for-building-accountability-resilience-and-independence-act"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…Government. Students display  understanding about historical and contemporary constitutional issues,  and their breadth of knowledge is incredibly impressive.\n\nI am proud to report that both top teams are from public high schools  in Oregon. Lincoln High School and Sprague High School won the national  competition in Virginia after competing at the State…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691209/supporting-the-womens-bureau-at-the-department-of-labor"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…``run'' Venezuela, and with  the regime in Caracas over which they now claim to have control.\n\nThe unusual thing about where we are right now is this is not some  after-action report where kinetic activities is already done and now  Congress is complaining that it hasn't been brought into the loop.  Fifteen thousand troops are off the coast of Venezuela…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698608/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…of the top school districts not  just in Stark County but throughout the State of Ohio.\n\nJust last year, the district received a 5-star rating, the highest,  on its school report card from the Ohio Department of Education for the  2023-2024 school year.\n\nThroughout his career, Superintendent Wendorf has led by example,  demonstrating perseverance, compassion,…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690330/recognizing-superintendent-jeff-wendorf"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…agents who were obstructed by their  leadership and then-Secretary of State John Kerry during the Obama  administration. For example, at that time, I released a majority staff  report just last year. That report made public FBI emails that showed  agents tried to arrest high-level Iranians but were stopped from making  those arrests. Those agents were stopped…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699769/whistleblowers"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…GOATS.\n\n(a) In General.--During the period beginning on the date of       the enactment of this Act and ending on the date that is 1       year after the date on which the report is submitted under       subsection (b), the Secretary of Agriculture, and any other       Federal official, may not finalize, implement, administer, or       enforce the proposed…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697537/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…like my home district in  central and eastern Montana, often lack the resources and information  needed to facilitate technology adoption.\n\nFor example, according to a 2025 report from the U.S. Chamber of  Commerce, 59 percent of small businesses in Montana have adopted AI  into their operations. While this figure may seem significant, it pales  in comparison…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699207/artificial-intelligence-wisdom-for-innovative-small-enterprises-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…GUTHRIE. Mr. Speaker, pursuant to House Resolution 879, I call up  the bill (H.R. 3109) to require the Secretary of Energy to direct the  National Petroleum Council to issue a report with respect to  petrochemical refineries in the United States, and for other purposes,  and ask for its immediate consideration in the House.\n\nThe Clerk read the title of…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697031/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…Ukraine . . . But not just to Ukraine, its new found       capabilities pose a longer term challenge to stability in       Europe and threatens NATO allies.''.       SEC. 3. REPORT.\n\n(a) In General.--Not later than 90 days after the date of       the enactment of this Act, the Secretary of State, in       coordination with the heads of relevant Federal…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690679/economic-espionage-prevention-act"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…citizenry from sea to shining sea should ask  themselves right now. What exactly is the problem?\n\nThey say again and again, oh, DHS could do this if they wanted to.  They already report to us. We are saying exactly that: The special  interest alien data should be reported to Congress along with the rest  of the data.\n\nWhy would the Democrats take a big stand?…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693077/special-interest-alien-reporting-act-of-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…(H.R. 1679) to direct the Secretary of Commerce, in coordination  with the heads of other relevant Federal departments and agencies, to  conduct an interagency review of and report to Congress on ways to  increase the global competitiveness of the United States in attracting  foreign direct investment.\n\nThe Clerk read the title of the bill.\n\nThe text…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692697/global-investment-in-american-jobs-act-of-2025"}, {"senator": "Rick Crawford", "party": "Republican", "sentence": "…efforts have ensured a graduation rate of 98 percent with  a growing academic proficiency rating. Cross County High School has  been included in the lists by U.S. News and World Report for both Best  High Schools and Best Charter High Schools. At the elementary school  level, Cross County Elementary Technology Academy has been recognized  as Top 10 World's…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695857/recognizing-nathan-morris-2026-arkansas-superintendent-of-the-year"}, {"senator": "Tim Sheehy", "party": "Republican", "sentence": "…PRESIDING OFFICER (Mr. Sheehy). Under the previous order, the  Senate will proceed to executive session and resume consideration of  the following nomination, which the clerk will report.\n\nThe bill clerk read the nomination of Terrance Cole, of Virginia, to  be Administrator of Drug Enforcement.", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694056/executive-calendar"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "Mr. BAUMGARTNER. Mr. Speaker, I move to suspend the rules and pass  the bill (H.R. 2643) to require the Secretary of State to submit an  annual report to Congress regarding the ties between criminal gangs and  political and economic elites in Haiti and impose sanctions on  political and economic elites involved in such criminal…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694815/haiti-criminal-collusion-transparency-act-of-2025"}, {"senator": "Tim Sheehy", "party": "Republican", "sentence": "The PRESIDING OFFICER (Mr. Sheehy). The clerk will report the bill by  title.\n\nThe senior assistant legislative clerk read as follows:\n\nA bill (S. 1837) to improve rights to relief for       individuals affected by non-consensual…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698997/disrupt-explicit-forged-images-and-non-consensual-edits-act-of-2025"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…to establish a dedicated working group  focused on countering the threats posed by the CCP to our Homeland  Security. Specifically, it requires them to examine, assess, and report  on DHS' efforts to address these threats.\n\nTo ensure accountability, my bill also mandates that DHS provide an  annual report to Congress, allowing us to monitor and evaluate…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688749/strategic-homeland-intelligence-and-enforcement-legislation-to-defend-against-the-ccp-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…contract referred to in paragraph (1) shall include       a competitive salary and benefits package consistent with the       employment standards of the Department.''.\n\n(b) Report.--\n\n(1) In general.--Not later than 180 days after the date of       the enactment of this Act, and every 180 days thereafter       until the termination date specified in…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695434/health-professionals-scholarship-program-improvement-act-of-2025"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…businesses, these programs were sometimes  exploited by criminals seeking to defraud American taxpayers and  illegally secure illegitimate loans and grants. According to a 2023  report from the SBA's Office of Inspector General, SBA distributed over  $200 billion in potentially fraudulent funds in its COVID-era programs.\n\nThis level of fraud undermines the…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697225/sba-fraud-enforcement-extension-act"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "Mr. COMER. Mr. Speaker, I move to suspend the rules and pass the bill  (H.R. 3490) to require the Government Accountability Office to produce  a report on esophageal cancer, and for other purposes, as amended.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:                                 H.R. 3490…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691831/gerald-e-connolly-esophageal-cancer-awareness-act-of-2025"}]