[{"senator": "Mark Takano", "party": "Democrat", "sentence": "…Federal Trade  Commission, and the Consumer Financial Protection Bureau, which is,  unfortunately, more pressing than ever.\n\nAccording to the Federal Trade Commission, veterans reported some of  the highest numbers of fraud complaints and greatest total losses in  2024, amounting to nearly $600 million. Veterans also continually face  higher losses than their…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699190/veterans-scam-and-fraud-evasion-act-of-2025"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…right decision in the next couple of months.\n\nNow, like I said, Americans are already feeling the pain. It is going  to get worse. Just this morning, the Commerce Department reported our  Nation's gross domestic product for the first quarter. The results: Our  quarterly GDP declined by 0.3 percent. It wasn't a reduction in growth.  It was a decline of…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690535/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…lifechanging motion-preserving procedures,  focusing on artificial disc replacement.\n\nThe Foundation continues to be strongly committed to spine health  research. Patient reported outcomes have long been part of fabric of  NSHF since its inception. As they are deeply invested in supporting  evidence-based healthcare decisionmaking, it is important to…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696032/recognizing-october-as-national-spine-health-awareness-month"}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "…southern California that is home  to 69,000 residents. It currently shares two ZIP Codes with neighboring  jurisdictions.\n\nWithout a unique ZIP Code, Eastvale residents have reported mail  delivery issues for delivery of legal notices, code enforcement  activities, public outreach, and election mail.\n\nEastvale residents have also reported higher insurance…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693861/establishing-new-zip-codes"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…not an afterthought, where Black  pain is believed.\n\nAs we stay head down working toward that vision, the status quo is  stark. In 2023, the Boston Public Health Commission reported that  diabetes mortality for Black women was three times that of White women.\n\nThe same report detailed that our Hispanic and Latino neighbors were  four times more likely…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690241/health-disparities-in-minority-communities"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "Mrs. SHAHEEN. Madam President, I call up my amendment No. 1602 and  ask that it be reported by number.\n\nMrs. SHAHEEN. This bipartisan amendment supports extending vital  healthcare tax credits for working families.\n\nTwenty-two million Americans rely on premium tax…", "date": "2025-04-04", "source_url": "https://justfacts.votesmart.org/public-statement/1689568/9999"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…was  done with regard to the 3 years that this assassin lived here in  America? Was his post-traumatic stress from his prior violent work  considered? Was the caseworker who reported his possible radicalization  interviewed and reviewed? Was his inability to even get a job a factor?  Did this review include biometric information, checking social media…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697312/attack-on-two-national-guard-members"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…two-thirds of the centers promoted patently false or biased  medical claims about pregnancy, abortions, contraception, or  reproductive health providers, and fewer than half reported having a  licensed medical professional on staff.\n\nThese are not isolated incidents. These are standard practices for  these centers.\n\nMorrison).\n\nMs. CHU. Mr. Speaker, well,…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699223/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…also evolved.       Immediately after Citizens United, many newly empowered       groups purchased their own ads to influence elections. Some       of these purchases were reported to the Federal Election       Commission (FEC), which makes such information publicly       available. However, since at least 2020, dark money groups       have largely shifted…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699084/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…encountered       challenges with my own patients--some have lingered on       inpatient units for extra days waiting for a rehab facility       to have a bed available. Others have reported feeling rushed       out of the rehab facilities before they were ready--      potentially a result of the high demand and backlog of bed       availability.\n\nThese problems…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699720/witness-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…authority. We need to speak the truth to America about  what happened on January 6.\n\nNotwithstanding all of those conspiracy theorists, the Department of  Justice inspector general reported there is ``no evidence . . . that  the FBI had undercover employees in the various protest crowds, or at  the Capitol, on January 6. No FBI CHS [confidential human source]…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698494/9999"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…that if this reporting is accurate, this strike appears to  constitute a war crime. Indeed, many of my Republican colleagues have  joined Democrats in recognizing that the reported facts of this strike  would be clearly illegal. Yet, in his own words yesterday, the  Secretary of Defense claimed that the second strike was the ``correct  decision.'' This…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697387/caribbean-boat-strike"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…oppose this resolution.\n\nMr. Speaker, these fee increases that Republicans are trying to jam  down Americans' throats couldn't come at a worse time. The Federal  Reserve reported that a key metric of inflation is going up, and that  was before President Trump sent the stock market further into the tank  with the global trade war he launched last week.…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689845/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…the movie theater, schools,  grocery stores, concerts, and places of worship. No one feels safe  because, oftentimes, nowhere is safe.\n\nThe Gun Violence Archive has already reported that 133 mass shootings  have happened this year, and it is only the first week of June.\n\nEvery shooting leaves behind a shattered family, a traumatized  community, and a…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691752/national-gun-violence-awareness-month"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "Mr. SCHUMER. Madam President, on tariffs, early this morning, it was  reported that Donald Trump caved to Xi Jinping and the Chinese  Communist Party, with virtually nothing to show for American workers.  Donald Trump has changed his mind, once again,…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690986/tariffs"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…the previous reporting period       through the foreign military sales program and through direct       commercial sales and how those averages compare to the       averages reported in the previous reporting period;\n\n(B) the leading causes of delays;\n\n(C) any steps taken to reduce those delays; and\n\n(D) any defense articles and services added to or removed…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694809/made-in-america-defense-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…prices as a result of the tax increase on them. Can  you imagine what that would do to already high prices as a result of  inflation?\n\nNearly half of these small businesses reported that they would have  to postpone or cancel capital investments; in other words, they  couldn't grow their business, hire more employees, or improve their  equipment.\n\nNow,…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689668/government-funding"}, {"senator": "Byron Donalds", "party": "Republican", "sentence": "…National Era, which chronicled Black  progress throughout the Nation.\n\nDouglass was the first Black reporter admitted to the Capitol press  galleries. From 1871 to 1875, he reported on the House and Senate  action, keeping the African-American community informed during  Reconstruction after the 13th, 14th, and 15th Amendments. He spent  countless hours…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692222/designating-the-house-press-gallery-in-the-united-states-capitol-as-the-frederick-douglass-press-gallery"}, {"senator": "James Risch", "party": "Republican", "sentence": "…this total.\n\nThis transmittal notifies an increase in MDE value by $100       million, due to recent cost increases. There are no       additional MDE or non-MDE items being reported with this       notification. The total case value will increase by $100       million to $270 million. MDE will constitute $226 million of       this total.\n\n(iv) Significance:…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687983/arms-sales-notifications"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…their designees. It provides for one motion to  commit.\n\nFinally, the rule provides for the flexibility to consider a rule  related to reconciliation on the same day it is reported from the Rules  Committee in order to expeditiously enact President Trump's agenda.\n\nMr. Speaker, I rise in support of this rule and in support of the  underlying legislation.…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691514/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…Committee rose; and the Speaker pro tempore (Mr.  Fulcher) having assumed the chair, Mr. Walberg, Acting Chair of the  Committee of the Whole House on the state of the Union, reported that  that Committee, having had under consideration the bill (H.R. 7148)  making further consolidated appropriations for the fiscal year ending  September 30, 2026, and for…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699284/amendment-no-1-offered-by-mr-massie"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…their refusal to hold criminals  accountable. We need to start with recognizing that 19- to 24-year-olds  shouldn't be treated as youthful offenders.\n\nLocal news has recently reported that the number of juveniles  arrested in Washington, D.C., has increased every year since 2020 and  that 60 percent of carjackings in the District in 2025 so far are for…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695563/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Mr. HILL of Arkansas. Mr. Speaker, I include the Congressional Budget  Office estimate for this bill in the Record.     H.R. 1450, OFAC LICENSURE FOR INVESTIGATORS ACT, AS REPORTED BY THE          HOUSE COMMITTEE ON FINANCIAL SERVICES ON MARCH 27, 2025 ------------------------------------------------------------------------…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693944/ofac-licensure-for-investigators-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…dental clinic and performed dental  procedures on patients, despite not having a license for more than 20  years. His clinic was uncovered after one of his former patients  reported he was convicted of a dentistry act violation and indecent  assault.\n\nAnother criminal illegal alien and his family members ran a sex  trafficking operation where they would…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "Ron Estes", "party": "Republican", "sentence": "…we face a massive problem continuing to pay people for all  sorts of Federal programs, including Social Security, who have passed  away. In FY 2024 alone, Federal agencies reported over $162 billion in  improper payments. By making this data exchange permanent, the Bureau  of Fiscal Service projects that we will save $330 million across the  Federal…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698921/ending-improper-payments-to-deceased-people-act"}, {"senator": "Nicole Malliotakis", "party": "Republican", "sentence": "…50 times checks were stolen twice, 7 times  they were stolen 3 times, and in some cases, checks were even stolen 4  times in a row from the same constituent.\n\nIt has been reported that for IRS checks alone, approximately 40,000  were stolen nationally in 2024 and that is up from 100 checks in 2022.\n\nThe value stolen has been approximately $1 billion,…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689293/recovery-of-stolen-checks-act"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…businesses and working families.\n\nEmployers are looking for innovative solutions to lower costs and  increase coverage for their employees. When asked, 79 percent of  employers reported they were interested in joining an association  health plan. We know these plans work. Under the first Trump  administration's association health plan rule, healthcare costs…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698379/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…world and simply go arrest them and send  the military to quiet down all of their defense systems so we could  arrest them?\n\nWe had intelligence reports in our country that reported that, per  our intelligence, the leader of Saudi Arabia was guilty of or was  involved with killing an American journalist. What if a President  decided they wanted to arrest…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698611/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "French Hill", "party": "Republican", "sentence": "…time.\n\nMr. HILL of Arkansas. Mr. Speaker, I include in the Record the CBO  estimate for this bill.   H.R. 3190, BRINGING REAL ACCOUNTABILITY VIA ENFORCEMENT IN BURMA ACT AS REPORTED BY THE HOUSE COMMITTEE ON FINANCIAL SERVICES ON OCTOBER 3, 2025 ------------------------------------------------------------------------…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699831/bringing-real-accountability-via-enforcement-in-burma-act"}, {"senator": "John Rose", "party": "Republican", "sentence": "…pursuing anyone that uses government programs       for their own personal gain.''\n\n``Mello's penchant for extravagance is what brought her       down. We identified that her reported income was well below       the lavish lifestyle she lived. As we uncovered the details,       the criminal scheme grew, the dollar amount grew, and the       reach of her…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695237/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}]