[{"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…of agency organization, procedure, or practice that do       not substantially affect the rights or obligations of non-      agency parties.\n\nNCUA did not submit a CRA report to Congress or to the       Comptroller General on the withdrawal of the Reporting       Requirements. In its response to us, NCUA provided additional       information and stated…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699835/government-accountability-office-opinion-letter"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…preparedness capabilities rather than UASI designations.\n\nThe bill, Mr. Speaker, also establishes performance metrics, enhances  oversight of expenditures, and requires DHS to report to Congress on  program participation and any further changes.\n\nMr. Speaker, I applaud Representative Carter's leadership on this  measure. I encourage my colleagues to support H.R.…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688696/securing-the-cities-improvement-act"}, {"senator": "André Carson", "party": "Democrat", "sentence": "…like The New National Era, a Black weekly  newspaper. Douglass and his sons covered Congress for this publication.\n\nFrederick Douglass was the very first Black man to report on Congress  and be allowed into the Capitol press gallery, where he was a member  from 1871 to 1875. He covered the critical debates in Congress during  reconstruction, including…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692225/designating-the-house-press-gallery-in-the-united-states-capitol-as-the-frederick-douglass-press-gallery"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…apportionments for  the accounts at issue available to the Government Accountability Office  for their required review under the Impoundment Control Act of 1974. In  its report to Congress on the June 3, 2025, special message proposing  these rescissions, the Government Accountability Office noted that for  ``previous special messages, GAO has reviewed…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694158/senate-amendment-to-hr-4"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…actors.\n\nH.R. 1709 is an important step toward addressing these concerns.\n\nThis bill directs the Assistant Secretary of Commerce for  Communications and Information to report to Congress on the  cybersecurity threats our mobile networks and mobile devices face at  the hands of foreign adversaries and other bad actors. Among other  things, the report will…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693422/understanding-cybersecurity-of-mobile-networks-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…monitor from the outside and understand where things  stand on a particular project.\n\nThis bill helps to bring more transparency to the process. It  requires an annual report to Congress on the status of each license  application and outstanding actions that are required of regulatory  agencies or the applicants themselves. This is particularly important…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693477/hydropower-licensing-transparency-act"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…Venezuela. And when we have demanded oversight, the Republican majority  and Trump's Pentagon have delayed and obstructed it. This bill's  solution, requiring DoD to report to Congress only after unlawful  actions occur, is wholly inadequate.\n\nCongress can fix this. Sadly, this bill does not rise to the moment.  Asking for reports after wrongdoing is…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697806/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "André Carson", "party": "Democrat", "sentence": "Mr. CARSON. Mr. Speaker, I am proud to reintroduce the Justice for  Shireen Act today. I thank my House Colleagues who joined me in calling  for a report to Congress from the FBI and State Department, in  consultation with the Attorney General, Secretary of Defense and  Director of National Intelligence, on the death of American-Palestinian…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699427/reintroduction-of-the-justice-for-shireen-act"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…report at their office, and this was done in 2023.  However, they have marked this unclassified report ``For Official Use  Only'' and have refused to provide copies of the report to Congress or  to make it public in response to Freedom of Information Act requests.\n\nSo I asked then-Director Easterly to release the report. When she  didn't act on my request,…", "date": "2025-07-28", "source_url": "https://justfacts.votesmart.org/public-statement/1694259/telecom-cybersecurity-transparency-act"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…vulnerabilities in American homes posed by routers  and modems manufactured or sold by entities with ties to our foreign  adversary countries. The Secretary must also deliver a report to  Congress of this study within 1 year.\n\nIt is crucial that we understand the cybersecurity and national  security risks networks face from equipment that originates from our…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690157/removing-our-unsecure-technologies-to-ensure-reliability-and-security-act"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…in opposition to  the amendment, and I yield myself such time as I may consume.\n\nMr. SCOTT of Virginia. Mr. Speaker, this amendment appears to require  GAO to submit a report to Congress that compares the returns generated  through the brokerage windows with those of other investments available  through retirement plans.\n\nBrokerage windows allow plan…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699154/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Herb Conaway, Jr.", "party": "Democrat", "sentence": "…amendments would require the Department of Homeland Security to  create a registry of all undocumented immigrants held at DOD facilities  and require a joint DOD-DHS report to the Congress on the use of force  and compliance with Federal detention standards, standards designed to  ensure humane treatment.\n\nUnfortunately, these amendments aren't just needed…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695107/providing-for-consideration-of-hr-streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-and-providing-for-consideration-of-hr-stop-illegal-entry-act-of-2025"}, {"senator": "Laura Gillen", "party": "Democrat", "sentence": "…undermine safe navigation  for all.\n\nMy amendment, which is included in section 283 of this bill, would  require the Commandant of the Coast Guard to examine this issue and  report to Congress with concrete recommendations to address hazards in  the East Rockaway Inlet and present a plan to update the aids to  navigation there to keep boaters safe.\n\nI am grateful…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694194/coast-guard-authorization-act-of-2025"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…agency       organization, procedure, or practice that do not       substantially affect the rights or obligations of non-      agency parties.\n\nFWS did not submit a CRA report to Congress or the       Comptroller General on the Barred Owl ROD. In its response to       us, Interior provided additional information about the Barred       Owl ROD but did not…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693338/us-government-accountability-office-legal-opinion"}, {"senator": "Darren Soto", "party": "Democrat", "sentence": "…used for data storage and helping AI to analyze  major issues. In addition, it could be in the digital currency form.\n\nThe next section also instructs that the FTC shall report to Congress  on its efforts to address unfair and deceptive trade practices related  to tokens, also known as digital currency, and make any recommendations  to improve our Federal…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693413/consumer-safety-technology-act"}, {"senator": "Abraham Hamadeh", "party": "Republican", "sentence": "…post-graduation.  They will not wait. Veterans will not be forgotten. We are going to  drain the VA swamp one regulation at a time.\n\nOur bill also requires an annual report to Congress on hire dates and  placement rates. Transparency generates performance.\n\nWe are not just addressing the issue today. We are ensuring  bureaucrats cannot hide and escape…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695432/health-professionals-scholarship-program-improvement-act-of-2025"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…the retail industry.\n\n(D) Consumer product manufacturers.\n\n(E) Consumer product safety organizations.\n\n(F) Any other person the Commission considers appropriate.\n\n(c) Report to Congress.--Not later than 1 year after the       conclusion of the pilot program established under subsection       (a), the Consumer Product Safety Commission shall submit to…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693414/consumer-safety-technology-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…with us,  for 27 minutes. That is what this was made up of. It was incredibly  brief, targeted, and very successful.\n\nThe War Powers Act requires a President to submit a report to  Congress within 48 hours of ``introducing U.S. forces into  hostilities.'' The President did that. If U.S. troops stay in  hostilities, the President is required to submit reports…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699089/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "…Additionally, H.R. 4058 directs the Government Accountability Office  to report on the effectiveness of FEMA's efforts within 2 years and  mandates that FEMA submit a detailed report to Congress on stakeholder  outreach and engagement.\n\nMy bill ensures that the Urban Area Security Initiative and the State  Homeland Security Program grants are responsive to local…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696945/enhancing-stakeholder-support-and-outreach-for-preparedness-grants-act"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…EDWARDS. Mr. Chair, that is why I fought to include two  provisions that bring real oversight and real answers. First, the  United States Postal Service is now directed to report to Congress  within 90 days with a concrete plan to reopen and restore service,  including in western North Carolina. Second, the Postal Service's  Inspector General must submit…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699044/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…Mr. Green deliberately disrupted  Congress' proceedings during a joint session yesterday.\n\nThis was an affront to the Constitution, which commands that the  President report to the Congress from time to time. It was an insult to  the Presidency, and it was a disgrace to this body.\n\nIt was perpetrated not by some lunatic wearing buffalo horns but,  rather,…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688497/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…margins of such clauses accordingly; and\n\n(B) by striking ``Reports to congress'' and all that       follows through ``For each fiscal year'' and inserting       ``Annual report to congress.--For each fiscal year''.\n\n(4) Report to president.--Section 105(a) of the National       Telecommunications and Information Administration       Organization Act (47…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690257/national-telecommunications-and-information-administration-reauthorization-act-of-2025"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…businesses  start, grow, and build cannot also be the one that increases their  financial and regulatory burden.\n\nIn addition, H.R. 2965 requires the SBA Office of Advocacy to report  to Congress on the total cost of all Federal regulations impacting  small businesses. Unlike what we just heard from the other side of the  aisle, to be clear, this bill does not…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697330/small-business-regulatory-reduction-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…a gun- free school zone; and H.R. 2240, Improving Law Enforcement Officer  Safety and Wellness Through Data Act, which would require the Attorney  General to submit a report to Congress that includes data on attacks on  law enforcement.\n\nThese bills are widely supported by law enforcement groups. The  Association of State Criminal Investigative Agencies,…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691169/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Vince Fong", "party": "Republican", "sentence": "…largest component of  China Lake, the Naval Air Warfare Center Weapons Division. It would  direct the Secretary of the Navy to review the challenges NAWCWD is  facing and report back to Congress on how they are working to address  them.\n\nMy third amendment supports Edwards Air Force Base by extending an  existing provision for several more years, helping to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695160/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…1621, the Entrepreneurs with  Disabilities Reporting Act of 2025, introduced by Representatives  McGarvey and Stauber.\n\nMr. Speaker, this legislation requires the SBA to report to Congress  on the challenges facing individuals with disabilities and what  resources or programs the SBA provides to assist them. The report will  also include legislative recommendations…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691756/entrepreneurs-with-disabilities-reporting-act-of-2025"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…available by such       Act meet the requirements of section 1133(c) of title 14,       United States Code.       SEC. 117. REGULAR POLAR SECURITY CUTTER UPDATES.\n\n(a) Report.--\n\n(1) Report to congress.--Not later than 120 days after the       date of enactment of this Act, the Commandant and the Chief       of Naval Operations shall submit to the Committee…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…router that are designed, developed, manufactured,       or supplied by persons owned by, controlled by, or subject to       the influence of a covered country.\n\n(b) Report to Congress.--Not later than 1 year after the       date of the enactment of this Act, the Secretary shall submit       to the Committee on Energy and Commerce of the House of…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690158/removing-our-unsecure-technologies-to-ensure-reliability-and-security-act"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…rise in support of my legislation, H.R.  3638, the Electric Supply Chain Act.\n\nMy legislation would direct the Department of Energy to conduct  ongoing assessments and report to Congress on all matters affecting the  supply chain for the power sector.\n\nThe Electric Supply Chain Act will seek to uncover risks,  vulnerabilities, and security considerations…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697897/electric-supply-chain-act"}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "…the CPSC to determine       the applicable scope of covered consumer products and to       monitor and evaluate future revisions to the voluntary       standards and report to the Congress within five years of       enactment.\n\nUsing information from the CPSC, CBO estimates that       implementing S. 389 would cost $8 million over the 2025-2030…", "date": "2025-07-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694306/ads-for-mental-health-services-act"}]