[{"senator": "Cory Booker", "party": "Democrat", "sentence": "Let me explain, if I can, or speak to a few points from a recent  report by Protect Our Care to explain what the administration is trying  to do to our healthcare system.", "title": "Privileges of the Floor", "date": "2025-03-31"}, {"senator": "Mike Quigley", "party": "Democrat", "sentence": "Last week, he released a report citing research  that does not exist--written by AI.", "title": "Demanding Resignation of Robert F. Kennedy, Jr.", "date": "2025-06-05"}, {"senator": "George Whitesides", "party": "Democrat", "sentence": "According to a recent report,  California families saw their costs go up by more than $2,000 in 2025  due to inflation.", "title": "Stop the Republican Affordability Crisis", "date": "2026-02-03"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "However, the commanding officials who are  responsible for their deployment have not responded to requests by  Congress to report from which accounts the money was withdrawn-- billions and billions of dollars, for almost 6 months--for the  deployment and actions in the Gulf and Atlantic theater.", "title": "Reflecting on Impact of Illegal Action in Venezuela", "date": "2026-01-08"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "4 to the       Committee on Appropriations with instructions to report the       same back to the Senate in 3 days, not counting any day on       which the Senate is not in session, with changes that--\n\n(1) are within the jurisdiction of such committee; and\n\n(2) would strike provisions that prevent Americans in rural       communities from having access to Wireless Emergency Alerts       or presidential emergency alerts.", "title": "H.R. 4", "date": "2025-07-16"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "At that time, I expressed concern about a report that on July 16,  Counselor Ana Paola Hall had resigned from the National Electoral  Council due to political pressure and threats against her and her  family.", "title": "Honduras", "date": "2025-10-30"}, {"senator": "Jacky Rosen", "party": "Democrat", "sentence": "4 to the Committee on       Appropriations of the Senate with instructions to report the       same back to the Senate in 3 days, not counting any day on       which the Senate is not in session, with changes that--\n\n(1) are within the jurisdiction of such committee; and\n\n(2) strike provisions that would cut funding from broadcast       stations that receive more than 30 percent of their annual       budget from the Corporation for Public Broadcasting.", "title": "H.R. 4", "date": "2025-07-16"}, {"senator": "André Carson", "party": "Democrat", "sentence": "I thank my House Colleagues who joined me in calling  for a report to Congress from the FBI and State Department, in  consultation with the Attorney General, Secretary of Defense and  Director of National Intelligence, on the death of American-Palestinian  Journalist, Shireen Abu Akleh.", "title": "Reintroduction of the Justice for Shireen Act", "date": "2026-01-30"}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "This bill would direct the GAO to  report on key issues relating to esophageal cancer, including Federal  spending for it under the Federal Employee Health Benefit Program and  the screening rates among high-risk individuals within that program.", "title": "Gerald E. Connolly Esophageal Cancer Awareness Act of 2025", "date": "2025-06-03"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "Speaker, buried in the last jobs report was this number: The  Black unemployment rate is now 7\\1/2\\ percent.", "title": "Recognizing Myesha Watkins", "date": "2025-12-03"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "Since July 2022, I have repeatedly urged CISA to release an  important, unclassified report by independent cybersecurity experts  that the Agency commissioned, titled ``U.S.", "title": "Nomination of Sean Plankey", "date": "2025-04-09"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "I am proud to report that both top teams are from public high schools  in Oregon.", "title": "Supporting the Women's Bureau At the Department of Labor", "date": "2025-05-14"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "This week, we saw new reports that insiders made nearly $100 million  on Melania's meme coin.", "title": "Protecting Americans From Harmful Crypto Practices", "date": "2025-05-08"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "Just last year, the district received a 5-star rating, the highest,  on its school report card from the Ohio Department of Education for the  2023-2024 school year.", "title": "Recognizing Superintendent Jeff Wendorf", "date": "2025-04-29"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "My legislation simply requires this office to identify and report to  Congress the challenges faced by rural small businesses when trying to  access our capital markets.", "title": "Expanding Access to Capital for Rural Job Creators Act", "date": "2025-06-23"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "This bill would also require the SBA to provide annual reports on the  true cost to small businesses imposed by government regulations.", "title": "Small Business Regulatory Reduction Act of 2025", "date": "2025-12-02"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "No further amendment to the bill, as amended, shall       be in order except those printed in the report of the       Committee on Rules accompanying this resolution.", "title": "Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Department of Energy Relating to ``Energy Conservation Program: Energy Conservation Standards for Walk-In Coolers and Walk-In Freezers''; Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Office of Energy Efficiency and Renewable Energy, Department of Energy Relating to ``Energy Conservation Program: Energy Conservation Standards for Commercial Refrigerators, Freezers, and Refrigerator-freezers''; Providing for Consideration of H.R. Defending Education Transparency and Ending Rogue Regimes Engaging in Nefarious Transactions Act", "date": "2025-03-25"}, {"senator": "Ron Johnson", "party": "Republican", "sentence": "I am happy to report that the Shutdown Fairness Act, as I now amended  it by adding furloughed workers, is supported by the American  Federation of Government Employees, the Federal Managers Association,  the Federal Law Enforcement Officers Association, the National Air  Traffic Controllers Association.", "title": "-9999", "date": "2025-11-07"}, {"senator": "James Risch", "party": "Republican", "sentence": "Chairman: Pursuant to the reporting requirements       of Section 36(b)(5)(C) of the Arms Export Control Act (AECA),       as amended, we are forwarding Transmittal No.", "title": "Arms Sales Notification", "date": "2025-07-29"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "The good news to report is that the number of people coming across  the border is down 99 percent.", "title": "Election Promises Made, Promises Kept", "date": "2025-06-11"}, {"senator": "Ken Calvert", "party": "Republican", "sentence": "Some reports indicate China owns or operates  ports and terminals at nearly 100 locations in over 50 countries.", "title": "Secure Our Ports Act of 2025", "date": "2025-06-09"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "Approximately 20 percent of American adults report using CBD or a  hemp-derived product in the preceding 12 months.", "title": "Continuing Appropriations and Extensions Act, 2026", "date": "2025-11-12"}, {"senator": "James Risch", "party": "Republican", "sentence": "Chairman: Pursuant to the reporting requirements       of Section 36(b)(5)(C) of the Arms Export Control Act (AECA),       as amended, we are forwarding Transmittal No.", "title": "Arms Sales Notification", "date": "2025-10-06"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "News & World  Report and Ophthalmology Times.", "title": "-9999", "date": "2025-06-05"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "And if you are one of these Senators that is  concerned about that, I would like to say, this morning, I want to  discuss a Department of Homeland Security inspector general report that  everyone in the Senate or their staffs ought to be on top of.", "title": "-9999", "date": "2025-04-02"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "News and World Report as one of the  best underrated travel destinations in the U.S.", "title": "Recognizing St. Simons Island", "date": "2025-06-10"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "His  input has been especially helpful in the creation of an electronic  Daily Activity Report, which captures trackable information pertaining  to the calls-for-service handled by CSU Volunteers.", "title": "Recognizing John Wajdowicz", "date": "2025-05-07"}]