[{"senator": "Patty Murray", "party": "Democrat", "sentence": "…President  Trump requested and includes $9.4 billion for global health programs,  more than double what Trump requested.\n\nIt protects investments in nutrition programs, in reproductive health  programs, for global vaccination efforts that Trump sought to outright  eliminate, and to combat HIV, tuberculosis, and malaria.\n\nIt restores funding Trump canceled…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699453/appropriations"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…2026 Labor, Health and Human Services, and  Education, and Related Agencies funding bill that assaults public  health, slashes medical research, eliminates funding for reproductive  health, and eviscerates education and job training.\n\nThey used this bill not to right the wrongs of their big, ugly law,  but to make healthcare even more expensive and slash…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695289/9999"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…month, Secretary Kennedy fired the entire  team at CDC who works on IVF and infertility research. Secretary  Kennedy fired most of the employees at the CDC's Division of  Reproductive Health, which helps to promote healthy pregnancies.  Secretary Kennedy fired staff at the Maternal and Child Health Bureau,  which oversees important programs that support…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691450/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…cut back  services or close, and people will die prematurely. Republicans are  also defunding Planned Parenthood, which provides necessary family  planning services and reproductive health care. No other provider  network has the capacity, expertise, or reach to replace Planned  Parenthood's essential care, particularly in underserved communities.  When…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693169/one-big-beautiful-bill-act"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…deception, misinformation, and patient harm.\n\nNearly two-thirds of the centers promoted patently false or biased  medical claims about pregnancy, abortions, contraception, or  reproductive health providers, and fewer than half reported having a  licensed medical professional on staff.\n\nThese are not isolated incidents. These are standard practices for  these…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699223/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…medical information without their consent. It means  they can and often do provide false and misleading medical information  about abortion, contraception, and other reproductive health services  for women.\n\nIn California, my home State, our attorney general was compelled to  issue a consumer alert warning the public about deceptive practices  employed…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699226/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…RFRA as a justification for  trying to overturn D.C. non-discrimination laws. For example, since  2015, Republicans have repeatedly tried to nullify or block D.C.'s  Reproductive Health Non-Discrimination Amendment Act of 2014, which  prohibits employers from discriminating against employees and their  families based on reproductive health decisions,…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692151/introduction-of-the-district-of-columbia-non-discrimination-home-rule-act-of-2025"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…Women's Issues, End Rape On Campus, Equal Rights Advocates,       Feminist Majority, Girls for Gender Equity, Guttmacher       Institute, Healthy Teen Network, Ibis Reproductive Health,       Just Solutions, Justice and Joy National Collaborative, Know       Your IX, Legal Momentum, the Women's Legal Defense &       Education Fund.         MANA, A…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699317/pregnant-students-rights-act"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…colleagues might think that is terrible, but had I been in a post- Dobbs world or a State where that wasn't possible, I could have just  been made to wait and risk my reproductive health. I went on to have  two healthy children because I had that procedure.\n\nThe intent of this bill is clear, Mr. Speaker. It is clear from the  text. It is clear from the…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699313/pregnant-students-rights-act"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…already passed into law.  The rescissions package enacts the extreme and out-of-touch agenda that  includes DOGE slashing support, reducing support for AIDS prevention,  reproductive health, and even public broadcasting.\n\nAs a member of the Foreign Affairs Committee, I am particularly  disturbed by the $8.3 billion in cuts to foreign assistance targeting…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692398/rescissions-package"}, {"senator": "Laura Gillen", "party": "Democrat", "sentence": "…shameful, backwards attempt to  cancel $9.8 billion in funding that had already been passed into law.  It cuts critical investments in lifesaving programs that support  reproductive health and education.\n\nIt also slashes funding for the U.S. President's Emergency Plan for  AIDS Relief, also known as PEPFAR. This bipartisan initiative has been  supported…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692564/rescission-package"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…downright fabricated evidence, much of which  he got from a personal connection.\n\nThis wasn't oversight; this was raw partisanship intended to target  and intimidate reproductive health providers and the women seeking  their care.\n\nThis is shocking behavior from the person nominated to oversee the  privacy and protection of the private health information…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697900/9999"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…any rescissions to programs within the       Global Health Programs account that support child and       maternal health, including through increased access to       reproductive health care and family planning.\n\n5. A motion to recommit the bill H.R. 4 to the Committee on       Appropriations of the Senate with instructions to report the       same…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693615/hr-4"}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "…basic medical care.\n\nEarlier this year, the largest Planned Parenthood health center in  the country opened in my district, named after my predecessor and  champion of reproductive health and access, Congresswoman and now Mayor  Barbara Lee. The Barbara Lee Oakland Health Center has over 19 exam  rooms and is transit accessible, but the Republican budget…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694154/defunding-planned-parenthood"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…transgender,  intersex, and queer global movements; $3 million for Iraqi ``Sesame  Street''; $2.5 million for teaching young children how to make  environmentally friendly reproductive health decisions; and $833,000  for services for transgender people, sex workers and their clients, and  sexual networks in Nepal.\n\nThe American people are begging Congress…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692532/rescissions-act-of-2025"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…Workforce project whose curriculum includes teaching  practitioners about environmental racism and the importance of DEI.\n\nThis spending, guised under the terms ``equity, reproductive health,  and family planning,'' stray far from the mission of sustaining life  and serve no benefit to the populations they are intended to help.\n\nThese are wasteful programs…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692391/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…for sedentary migrants in Colombia. That  seems like an oxymoron.\n\nThere is $2.5 million for teaching young children, get this, how to  make environmentally friendly reproductive health decisions. I scratch  my head on that one.\n\nThere is $833,000 for services for transgender people, sex workers  and their clients and sexual networks in Nepal.\n\nThe…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692534/rescissions-act-of-2025"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…Sesame Street, $18 million to improve  gender diversity in the Mexican street lighting industry, $2.5 million  to teach children how to make environmentally friendly reproductive  health decisions, whatever that means.\n\nThis abuse of taxpayer dollars must end. The Rescissions Act would  prioritize the needs of Americans over everyone else.\n\nMr. WALBERG.…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693709/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}]