[{"senator": "Bobby Scott", "party": "Democrat", "sentence": "…instead risks further stigmatizing       pregnant and parenting students. The proposed bill relies on       anti-abortion language and seeks to limit students'       reproductive healthcare decisions. This language is part of a       political ploy that the anti-abortion movement hopes to use       to further its case for a national abortion ban now that…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699317/pregnant-students-rights-act"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "Ms. ROSS. Mr. Speaker, this week marks the 53rd anniversary of Roe v.  Wade when the Supreme Court finally granted women the right to control  their own reproductive healthcare. Tragically, in 2022, one-half  century of reproductive freedom was stripped away when the conservative  majority on the Court overturned Roe.\n\nSince then, we have…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699244/womens-health"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…amendment.\n\nRepresentative Kelly Morrison had an amendment that strikes the  defunding of Planned Parenthood, which provides access to lifesaving  cancer screenings and reproductive healthcare.\n\nLast year, Republicans, Mr. Speaker, promised that reproductive  healthcare and reproductive freedom was a State issue. President Trump  promised that reproductive…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…Members of Congress.\n\nIn the wake of Dobbs, many States have prohibited or tried to  prohibit healthcare providers and health plans from offering or  covering certain reproductive healthcare services. These anti-abortion  efforts have disproportionately harmed some students whose access to  services and information is affected by their geographical barriers,…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699313/pregnant-students-rights-act"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…is not about choice. People will have the choice to be  refused health insurance for preexisting conditions by unregulated junk  health insurance plans and be denied reproductive healthcare.\n\nInstead of making the ACA tax credits permanent, Republicans have  once again proposed a piecemeal, nonsolution that makes health  insurance more expensive and strips…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698405/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…private  information in so many places, everywhere he can make it stick. When he  was chief counsel for a select House panel, he made public a slew of  information on reproductive healthcare providers and patients that he  targeted with a sham investigation, all while they were being subjected  to threats and physical harm.\n\nStaff and even Members of Congress…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697900/9999"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…they couldn't get care for  miscarriages or other pregnancy-related complications.\n\nHouse Republicans today are joining the effort to limit women's  access to full reproductive healthcare and information. Instead of  acting to lower healthcare costs, we are in a healthcare crisis.  Instead of addressing the affordability crisis, they are trying to pass…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699220/providing-for-consideration-of-hr-supporting-pregnant-and-parenting-women-and-families-act-providing-for-consideration-of-hr-pregnant-students-rights-act-and-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…State, our attorney general was compelled to  issue a consumer alert warning the public about deceptive practices  employed by these centers.\n\nAt a time when access to reproductive healthcare is under attack, our  Republican colleagues are advancing a bill that funnels resources to  organizations that mislead women rather than provide comprehensive  medical…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699226/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…people and, specifically, my constituents in Ohio. That is why  I proposed an amendment to remove the section responsible for  increasing costs and limiting access to reproductive healthcare.\n\nRight now, any and all abortion coverage provided under marketplace  plans are not paid for by Federal dollars. However, this bill would  impose unprecedented restrictions…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698303/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…dollars  away from helping families afford necessities like food, rent, and  childcare to crisis pregnancy centers that prey on vulnerable women  seeking legitimate reproductive healthcare.\n\nWe have heard today that wonderful, caring people staff these crisis  pregnancy centers, and I don't doubt that, but crisis pregnancy centers  do not provide medical…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699228/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…crisis pregnancy centers do and do not offer.\n\nAlso, pregnant students deserve access to medically accurate,  comprehensive planning resources and a full range of reproductive  healthcare options. Yet, the Pregnant Students' Rights Act only  requires colleges to provide information about carrying a child to  term.\n\nI offered an amendment to this bill…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699221/providing-for-consideration-of-hr-supporting-pregnant-and-parenting-women-and-families-act-providing-for-consideration-of-hr-pregnant-students-rights-act-and-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…weakening the protections  that so many Americans rely upon.\n\nI offered an amendment to protect working families from losing health  coverage and to protect access to reproductive healthcare. But guess  what. Republicans blocked it. Once again, they chose politics over  people.\n\nWe cannot forget the real people caught in the middle of this. These  are…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698555/rising-healthcare-costs"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…been the centerpiece of Republican attempts to repeal  the Affordable Care Act for decades.\n\nIt doesn't work.\n\nThe plan also creates a backdoor ban on abortion and reproductive  healthcare.\n\nRepublicans have shown they have no agenda to address healthcare  affordability and access. As Americans stare down notices that their  healthcare costs will increase…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698225/healthcare-affordability-crisis"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…hinder VA's  ability to serve all veterans. Especially harmful are provisions that  deny women veterans the full range of necessary medical care, including  necessary reproductive healthcare which includes abortion care and  counseling.\n\nOn top of that, this bill abandons the premise that all veterans  deserve the same level of care they have earned, by…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692950/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…yet  another partisan divide.\n\nThis time around, Republicans have loaded the national defense bill  with provisions to prevent female servicemembers from accessing  reproductive healthcare. They have given a green light to  discrimination against LGBTQ servicemembers.\n\nThis bill does nothing to address the gross mismanagement of the  Pentagon by Pete…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693551/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}]