[{"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…citizenship,  including paying Federal taxes, serving on juries, and registering with  the Selective Service, yet Congress denies them full local self- government and voting representation in Congress. The only solution to  this undemocratic treatment is to grant D.C. statehood.\n\nMr. Speaker, I include in the Record a letter explaining why D.C.  statehood…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695559/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…Brother overseeing what takes place in our  universities, it is a sign of a democracy in decline.\n\nNo. 3, when an administration, when a ruler goes after the right of  representation by attacking lawyers, law firms, legal professionals and  says: Thou shall not represent this cause which is deeply unpopular to  me, you shall not take on this client…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696336/trump-administration"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…February, we fell off a cliff. We fell  off a cliff. And why? Because now the Atlanta Fed is saying we had one  swing of 5 percent in just 1 week. And now, this drop is the  representation of a cliff that President Trump is pushing the American  economy over.\n\nSo you can see they are going down to negative--not just zero growth,  but negative. We can't afford…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688430/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…he a greater threat? Well, you first have to understand, if  you don't, that we have a Republic. A Republic is government by the  public, but it is done by and through representation, representatives,  the House of Representatives. Representatives, the Senate. The Republic  speaks through representatives. We have a Republic. He indicates that  this…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697472/president-trump-is-a-threat-to-our-republic"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…the D.C.  Council who were elected by the people who live here. They claim to  care about the taxpayers of D.C., but I guess they don't care enough to  give them the real representation that they deserve: a vote in the  United States Congress.\n\nThat alone shows us what this is all about. They don't care about the  taxpayers of D.C. They have no problem…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699681/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…citizenship, including paying Federal taxes, serving on  juries, and registering with the Selective Service, yet Congress denies  them full local self-government and voting representation in Congress.\n\nThe only solution to this undemocratic treatment is to grant D.C.  statehood.\n\nI include in the Record a letter from leading constitutional scholars  explaining…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696933/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…in not mentioning this: I love the fact that we  have this body that represents so many American traditions, so many  streams of lived experiences that make this a great representation of  our Nation. But the truth is, we are still seeing so many firsts in  this body.\n\nOne first we should recognize is the one that  Andy Kim exemplifies.  He is the first…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697705/9999"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…United States Department of Justice,           Washington, DC.\n\nDear Attorney General Bondi: We are members of the legal       profession and entities that provide legal representation and       work in law. We do not agree on all matters and, in fact, at       times have been or are adverse to each other in court or       other professional settings.…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689713/no-rogue-rulings-act-of-2025"}, {"senator": "Maggie Goodlander", "party": "Democrat", "sentence": "…deal for America's rural  small businesses and entrepreneurs by cutting red tape, delivering  access to key Federal resources, and ensuring experienced and  accountable representation and leadership within our government. It is  a bill that will ensure the voices of rural America aren't just heard  but are truly prioritized within our government.\n\nRunning…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697281/office-of-rural-affairs-enhancement-act"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…moment when so many Members of Congress  have conceded their power to Donald Trump, voting rights are on the  line, super-PACs continue to buy congressional seats, and the  representation of Black and Brown working families is threatened, this  resolution is nothing more than a cheap political stunt pulled from the  playbook of some of my Republican colleagues.…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696784/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…Foster for his always wise and  important words.\n\nMs. STEVENS. Mr. Speaker, I thank Mr. Whitesides for his comments.  How lucky the people of California are to have his representation and  how lucky the United States Congress is to have his expertise.\n\nMs. STEVENS. Mr. Speaker, I thank Congresswoman Foushee for her  ongoing leadership for women in the…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691394/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…member. It's a very different  job, with a direct line of responsibility to the residents who elect  you to deal with everything from potholes to public safety. That local  representation and local responsiveness is a key part of our democracy,  and Republicans are proposing to strip that local self-governance away  from the residents of the District of…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692632/opposition-to-hr-hr-and-hr-2096"}, {"senator": "Sam Liccardo", "party": "Democrat", "sentence": "…of their monetary  contributions is exceeded only by the change they cultivated on behalf  of the Latino community by pushing for cultural preservation and more  diverse representation in nonprofit leadership.\n\nOn April 26, Al Castellano passed away in his Saratoga home  surrounded by loved ones. His most important role, of course, was that  of a loving…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691561/recognizing-life-and-contributions-of-alcario-al-castellano"}, {"senator": "Alma Adams", "party": "Democrat", "sentence": "…featured in a solo exhibit at the Whitney Museum  of American Art and also the first to have her art displayed in the  White House's permanent collection.\n\nWe need more representation of African-American artists like Alma  Thomas and Eva Hamlin Miller in the Women's History Museum. To exclude  their work is to miss significant parts of our country's…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689365/womens-history-month"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "…foreign prisons by the U.S. Government. Our entire system  of justice hinges on the rights afforded to us by the Constitution, the  rights of due process, access to legal representation, and the ability  to be heard in a court of law.\n\nIt is a dark day for our democracy when the Federal Government  snatches people off of the streets, flies them out of…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690509/trump-immigration-policies"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…you taxed something, you got less of it, so that if  you place a new tax on trade, you will get less trade.\n\nThere was also this idea that you didn't do taxation without  representation. That idea goes not only back to our American  Revolution, it goes back to the English civil war as well.\n\nIt goes back to probably Magna Carta. I mean, for hundreds of…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690543/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…of professional training of United States attorneys       on indicators of human trafficking.       SEC. 4. USE OF GRANTS FOR POST-CONVICTION RELIEF                     REPRESENTATION.\n\nThe Office of Justice Programs or the Office on Violence       Against Women, in awarding a grant that may be used for legal       representation, may not prohibit a…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697182/trafficking-survivors-relief-act"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…own ``cis White mobility privilege.''\n\nMr. Speaker, most Americans, including myself, didn't know what that  meant until reading this.\n\nShe wrote about the ``politics of representation,'' and, of course,  ``toxic masculinity.''\n\nShe also wrote about herself, about one of her major pet peeves,  which is whenever she goes on an airplane and finds out that…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693722/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…cryptographically secured distributed ledgers       or any similar technology or implementation.\n\n(3) Digital asset.--The term ``digital asset'' means any       digital representation of value that is recorded on a       cryptographically secured digital ledger or any similar       technology.\n\n(4) Emerging technologies.--The term ``emerging       technologies''…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693963/financial-technology-protection-act-of-2025"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…In 2016, he made history as the first African American elected  Chairman of the City of Opelika Board of Zoning Adjustments, breaking  barriers and fostering inclusive representation for the citizens of  Opelika.\n\nOn February 17, 1970, Mr. Payne was drafted into the United States  Army at the age of 19, serving with valor in the Vietnam War and later…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693602/recognizing-the-birthday-of-wilbert-d-payne-jr"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "…more equitable nation for all.\n\nMr. Speaker, I urge my colleagues to join me in supporting H.R. 3095.  Let us give these communities and the millions of Americans the  representation, the recognition, the resources, and the respect that  they rightfully deserve. Let us ensure that every town has the tools it  needs to thrive, from accurate mail delivery…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693904/single-unique-zip-codes-for-certain-communities"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…Government of       the People's Republic of China as the only lawful       representatives of China to the United Nations. The       resolution did not address the issue of representation of       Taiwan and its people in the United Nations or any related       organizations, nor did the resolution take a position on the       relationship between the People's…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690676/taiwan-international-solidarity-act"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…opportunities generally low.\n\nOver fifty years ago, the Federal Government directed       Alaska Native people to organize into a new structure of       indigenous representation. The Alaska Native Claims       Settlement Act of 1971 (ANCSA) was a dramatically different       and transformative approach by the Federal Government to       federal…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696449/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…voters--to fool voters--into dismantling the very independent  commission that they recently established.\n\nThe point of this is that the Governor would like to reduce the  representation of Republicans in Congress in our State to 3 Members out  of 52, so that Republicans will hold 6 percent of the seats even though  Republicans typically get over 40 percent…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694130/dismantling-californias-citizens-redistricting-commission"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…agency by women, for women, it works to  support all survivors and victims. It offers a 24-hour crisis hotline,  emergency shelter, crisis counseling, legal advocacy, legal  representation, and transitional housing.\n\nCentre Safe also works to address violence before it begins by  educating children and youth about healthy relationships.\n\nMr. Speaker, domestic…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693919/recognizing-centre-safe"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…and about best practices       for the use of a pictorial (as defined in section 2(a) of the       Consumer Review Fairness Act of 2016 (15 U.S.C. 45b(a)))       visual representation of the information to be disclosed.\n\n(d) Tailored Guidance.--A manufacturer of a covered device       may petition the Commission for tailored guidance as to how…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690179/informing-consumers-about-smart-devices-act"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…leases, dedication instruments, financing  documents, resolutions and ordinances. These wide-ranging  responsibilities afforded Mac the opportunity to provide expert legal  representation to several county offices, boards, commissions, and  employees.\n\nAfter a four-year tour in private practice, Mac joined the office of  United States Representative Martha…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695496/thanking-john-mcintyre-mac-tolar-for-his-dedicated-service-to-our-nation"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…or near-cylindrical packaging.\n\n(d) Representations of Flushability.--With respect to a       covered product, a covered entity may not make any express or       implied representation that such covered product can or       should be flushed.\n\n(e) Enforcement by Federal Trade Commission.--\n\n(1) Unfair or deceptive acts or practices.--A violation of…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692751/wastewater-infrastructure-pollution-prevention-and-environmental-safety-act"}, {"senator": "David McCormick", "party": "Republican", "sentence": "…that State  elections comply with existing law.\n\nNow, there are other electoral reforms that are also necessary and  critical, including Senator Hagerty's proposed Equal Representation  Act, which I am proud to cosponsor.\n\nIt ensures that the census does not count noncitizens when  determining congressional seats and electoral college votes.\n\nFrankly,…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700069/9999"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…preparations related to participation       by the United States in international telecommunications and       information policy conferences and negotiations;\n\n``(6) ensure NTIA representation with respect to       international telecommunications and information policy       meetings and the activities related to preparation for such       meetings;\n\n``(7) in…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690257/national-telecommunications-and-information-administration-reauthorization-act-of-2025"}]