[{"senator": "Al Green", "party": "Democrat", "sentence": "…State of Texas, and the Honorable Ken  Paxton.\n\nDear friends, at the end of the day, if they can fulfill what they  proclaim in this letter, there will be more White representation in  Congress from Texas and less Black and Latino representation. This is  nothing more than an attempt to silence many of the voices that are  emanating from communities of…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694163/racism-infused-in-texas-politics"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…primaries, you can't have  White pre-primaries.\n\nThis is something that is consistent in Texas, in terms of its  behavior as it relates to people of color having proper representation  in Congress.\n\nWe now have a circumstance where but one person of color will now be  coming from the Houston area because of these two districts. But one  will come from the…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700075/black-history-stolen-legacies"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…citizenship,  including paying Federal taxes, serving on juries, and registering with  the Selective Service, yet Congress denies them full local self- government and voting representation in Congress. The only solution to  this undemocratic treatment is to grant D.C. statehood.\n\nMr. Speaker, I include in the Record a letter explaining why the D.C.  statehood bill…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695641/district-of-columbia-policing-protection-act"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…is diluting the voice of  American citizens.\n\nI haven't heard a single Republican in this debate talk about  ensuring that citizens who live in D.C. can have full representation in  Congress.\n\nWhere is that?\n\nI bring it up again. In every issue Republicans want to talk about  protecting us by taking away stuff from other people. They never want  to talk…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692318/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…almost a year after the tragic  death of our late colleague, Sylvester Turner, the citizens of the 18th  Congressional District of Texas in Houston have been denied  representation in this Congress.\n\nAfter Governor Abbott delayed the call for the election for almost 8  months and then delayed the runoff election another 3 months, these  Texans finally have…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699521/welcoming-the-honorable-christian-d-menefee-to-the-house-of-representatives"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…citizenship,  including paying Federal taxes, serving on juries, and registering with  the Selective Service, yet Congress denies them full local self- government and voting representation in Congress.\n\nThe only solution to this undemocratic treatment is to grant D.C.  statehood.\n\nMr. Speaker, I enter into the Record a letter explaining why the D.C.  statehood…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695596/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Yet, D.C. residents cannot  consent to any action taken by Congress, whether on local or Federal  matters, and they pay full Federal taxes while being denied voting  representation in Congress.\n\nIf Republicans cared about D.C. residents or democracy, they would  take up H.R. 51, the Washington, D.C. Admission Act. H.R. 51 would  admit the residential and…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692302/protecting-our-nations-capital-emergency-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…seamless, because  D.C. already operates as the functional equivalent of a state,  providing state-, county- and city-level services, despite being denied  voting representation in Congress and full local self-government. This  bill would not change any legal authorities.\n\nI urge my colleagues to support this bill.", "date": "2025-10-28", "source_url": "https://justfacts.votesmart.org/public-statement/1696437/introduction-of-the-district-of-columbia-government-title-equality-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…since the  Revolutionary War, which was fought to end taxation without  representation and to give consent to the governed. Yet, Congress has  denied them voting representation in Congress and full local self- government over the past 200 years.\n\nLast Congress, 100 bills and amendments were introduced to repeal or  block local D.C. laws and policies.…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692373/district-of-columbia-federal-immigration-compliance-act-of-2025"}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "…The more than 700,000 D.C. residents who have all the obligations of  citizenship, including paying Federal taxes and serving in our Nation's  wars, deserve voting representation in Congress and full home rule. I  call on the House of Representatives to pass H.R. 51, the Washington,  D.C. Admission Act.\n\nMr. LYNCH. Madam Speaker, I yield 7 minutes to…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692304/protecting-our-nations-capital-emergency-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…citizenship, including paying Federal taxes, serving on  juries, and registering with the Selective Service, yet Congress denies  them full local self-government and voting representation in Congress.\n\nThe only solution to this undemocratic treatment is to grant D.C.  statehood.\n\nI include in the Record a letter from leading constitutional scholars  explaining…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696933/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…citizenship,  including paying Federal taxes, serving on juries, and registering with  the Selective Service, yet Congress denies them full local self- government and voting representation in Congress. The only solution to  this undemocratic treatment is to grant D.C. statehood.\n\nMr. Speaker, I include in the Record a letter explaining why D.C.  statehood is constitutional…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695559/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…District of Columbia. D.C. citizens pay federal taxes       and comply with all the other duties of residence, yet they       are deprived of not only any voting representation in       Congress, but also of control over their own local       governance. With these votes, Congress would yet again       micromanage the affairs of the District and relegate…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696914/letter-led-by-the-leadership-conference-on-civil-and-human-rights-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…these southern legislatures, let me tell you what happened  in South Carolina. When more than 50 percent of the population was  African American, they had zero representation here in the Congress. In  fact, the last African American left Congress in 1897, and there was  not another African American in this body until I took the oath of  office 95 years…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689339/fighting-voter-suppression"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…taxes, register with the Selective Service System, and serve on  Federal juries in the same manner as residents of States. Yet, D.C.  residents have no voting representation in Congress, and Congress has  the ultimate say on local D.C. matters.\n\nThe council has 13 members. If D.C. residents do not like how the  members vote, residents can vote them out…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692314/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}]