[{"senator": "Emily Randall", "party": "Democrat", "sentence": "…because of the cuts to Medicaid and Medicare.\n\nMr. Speaker, who is being hit hardest when these tax credits  disappear? Women who are already struggling with restrictions to  reproductive care, who make less money than men do, and who are on the  front lines of growing childcare crises.\n\nWho else will be impacted? LGBTQ Americans, who are more likely to…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698673/protecting-healthcare-for-millions-of-americans"}, {"senator": "Sara Jacobs", "party": "Democrat", "sentence": "…belong.\n\nTheir proposed facilities ban is a huge violation of privacy and  would make all women and girls less safe. Will Republicans require  menstrual monitoring, checking reproductive organs, as has happened, as  my colleague pointed out? Girls and women who are tall, strong, and  gender-nonconforming are already being questioned and yelled at.  Republicans…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695241/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…reckless 2026 Labor, Health and Human Services, and  Education, and Related Agencies funding bill that assaults public  health, slashes medical research, eliminates funding for reproductive  health, and eviscerates education and job training.\n\nThey used this bill not to right the wrongs of their big, ugly law,  but to make healthcare even more expensive and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695289/9999"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…to reach the  Republicans' preferred outcome.\n\nMs. Hermandorfer followed this playbook to a tee in the Tennessee  Attorney General's Office. She opposed LGBTQ rights and reproductive  rights as well as environmental and anti-discrimination policies to  protect the most vulnerable in America.\n\nI believe we need judges on the bench who follow the law and…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693415/nomination-of-whitney-d-hermandorfer"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…benefit children and the neediest and  most vulnerable of our districts, in rural areas as well as urban; and,  of course, the damage to our fundamental freedoms, women's reproductive  freedoms, the suspension of title X grants, and the assault on women's  healthcare--other freedoms: the basic due process of people who should  have a right to receive…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690353/9999"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…Governor Walz  and DFL legislators during the 2023 legislative session, Minnesota's  students have free meals in school. Families have access to paid family  leave. Women's reproductive rights are protected. All Minnesota  individuals and families are supported and protected--with no  exceptions.\n\nMelissa was the best of Minnesota. She cared about others,…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693118/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…century.\n\nIn that moment, the Court did not just revoke a legal precedent, they  set in motion a wave of chaos, cruelty, and control. What followed was  a full-scale assault on reproductive healthcare: abortion,  contraception, IVF, and even access to emergency care.\n\nIn Ohio, we felt the effects immediately. Just hours after the Dobbs  decision was handed…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692969/dobbs-decision-anniversary"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…cut back  services or close, and people will die prematurely. Republicans are  also defunding Planned Parenthood, which provides necessary family  planning services and reproductive health care. No other provider  network has the capacity, expertise, or reach to replace Planned  Parenthood's essential care, particularly in underserved communities.…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693169/one-big-beautiful-bill-act"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…went behind the wall at two remote detention facilities. These  facilities have a history of unjust and unsafe conditions. Behind the  wall, as co-chair of the House's Reproductive Freedom Caucus, I met  women who were pregnant, entering the latter months of their pregnancy  and being denied routine prenatal care. I spoke to a woman diagnosed  with…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690241/health-disparities-in-minority-communities"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…deception, misinformation, and patient harm.\n\nNearly two-thirds of the centers promoted patently false or biased  medical claims about pregnancy, abortions, contraception, or  reproductive health providers, and fewer than half reported having a  licensed medical professional on staff.\n\nThese are not isolated incidents. These are standard practices for  these…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699223/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…9 years  ago. In addition to a lack of experience, Mr. Divine has taken some  extreme positions on issues that are important to people across the  United States, such as reproductive rights and ballot access.\n\nMr. Divine--if you can believe this, in this day and age, 2025--has  argued in  favor of literacy tests at the ballot box. Let me say that again.…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693940/judicial-nominations"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…tanning bed taxes.\n\nAnd, of course, at the last minute, the anti-choice radicals snuck in  a new provision, penalizing enrollees in private plans on ACA exchanges  covering reproductive care. Defunding Planned Parenthood wasn't enough.  The radicals got their pitchforks and added a provision to effectively  ban every insurance premium on every ACA exchange…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691671/budget-reconciliation"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…have children through surrogacy. Her advocacy shed light  on the real-world implications of our outdated legal system and the  need for reform as we continue to fight for reproductive freedom across  our Nation.\n\nOn behalf of Michigan's Third Congressional District, I am proud to  honor Tammy Myers for her advocacy and leadership. We thank her for her…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691857/recognizing-tammy-myers"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…additional debt.\n\nMr. Speaker, I include in the Record a letter from over 50  organizations representing civil rights, labor organizations, youth  advocates, women's rights, reproductive rights, and others.                                                   January 20, 2026.      Hon. Mike Johnson,      Speaker, House of Representatives,      Washington,…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699317/pregnant-students-rights-act"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…the most  dangerous and cancer-causing air toxins in the world, such as arsenic  and lead.\n\nAs an OB/GYN, I am extremely concerned because these toxins are known  to cause reproductive harm and birth defects.\n\nJust last night, in this Chamber, President Trump claimed: ``Our goal  is to get toxins out of our environment.'' President Trump also  highlighted…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688527/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…million for sedentary migrants in Colombia. That  seems like an oxymoron.\n\nThere is $2.5 million for teaching young children, get this, how to  make environmentally friendly reproductive health decisions. I scratch  my head on that one.\n\nThere is $833,000 for services for transgender people, sex workers  and their clients and sexual networks in Nepal.\n\nThe…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692534/rescissions-act-of-2025"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…Workforce project whose curriculum includes teaching  practitioners about environmental racism and the importance of DEI.\n\nThis spending, guised under the terms ``equity, reproductive health,  and family planning,'' stray far from the mission of sustaining life  and serve no benefit to the populations they are intended to help.\n\nThese are wasteful programs…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692391/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…transgender,  intersex, and queer global movements; $3 million for Iraqi ``Sesame  Street''; $2.5 million for teaching young children how to make  environmentally friendly reproductive health decisions; and $833,000  for services for transgender people, sex workers and their clients, and  sexual networks in Nepal.\n\nThe American people are begging Congress…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692532/rescissions-act-of-2025"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…operation industry.\n\nGarrett has demonstrated this through his graduation from the Ohio  State University's animal science program and his work to effectively  use genetic and reproductive science on the farm. Garrett is a lifelong  cattleman. He was raised on Stanfield Farms, which has been operated  for generations by the Stanfield family in southern Ohio.…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690854/recognizing-garrett-stanfield"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…Iraqi Sesame Street, $18 million to improve  gender diversity in the Mexican street lighting industry, $2.5 million  to teach children how to make environmentally friendly reproductive  health decisions, whatever that means.\n\nThis abuse of taxpayer dollars must end. The Rescissions Act would  prioritize the needs of Americans over everyone else.\n\nMr. WALBERG.…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693709/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}]