[{"senator": "Emily Randall", "party": "Democrat", "sentence": "Women who are already struggling with restrictions to  reproductive care, who make less money than men do, and who are on the  front lines of growing childcare crises."}, {"senator": "Sara Jacobs", "party": "Democrat", "sentence": "Will Republicans require  menstrual monitoring, checking reproductive organs, as has happened, as  my colleague pointed out?"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "Last night, Republicans on the Appropriations Committee forced  through their reckless 2026 Labor, Health and Human Services, and  Education, and Related Agencies funding bill that assaults public  health, slashes medical research, eliminates funding for reproductive  health, and eviscerates education and job training."}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "She opposed LGBTQ rights and reproductive  rights as well as environmental and anti-discrimination policies to  protect the most vulnerable in America."}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "Women's reproductive rights are protected."}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "What followed was  a full-scale assault on reproductive healthcare: abortion,  contraception, IVF, and even access to emergency care."}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "Republicans are  also defunding Planned Parenthood, which provides necessary family  planning services and reproductive health care."}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "Behind the  wall, as co-chair of the House's Reproductive Freedom Caucus, I met  women who were pregnant, entering the latter months of their pregnancy  and being denied routine prenatal care."}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "Nearly two-thirds of the centers promoted patently false or biased  medical claims about pregnancy, abortions, contraception, or  reproductive health providers, and fewer than half reported having a  licensed medical professional on staff."}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "Divine has taken some  extreme positions on issues that are important to people across the  United States, such as reproductive rights and ballot access."}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "And, of course, at the last minute, the anti-choice radicals snuck in  a new provision, penalizing enrollees in private plans on ACA exchanges  covering reproductive care."}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "Her advocacy shed light  on the real-world implications of our outdated legal system and the  need for reform as we continue to fight for reproductive freedom across  our Nation."}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "Speaker, I include in the Record a letter from over 50  organizations representing civil rights, labor organizations, youth  advocates, women's rights, reproductive rights, and others."}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "As an OB/GYN, I am extremely concerned because these toxins are known  to cause reproductive harm and birth defects."}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "There is $2.5 million for teaching young children, get this, how to  make environmentally friendly reproductive health decisions."}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "This spending, guised under the terms ``equity, reproductive health,  and family planning,'' stray far from the mission of sustaining life  and serve no benefit to the populations they are intended to help."}, {"senator": "David Taylor", "party": "Republican", "sentence": "Garrett has demonstrated this through his graduation from the Ohio  State University's animal science program and his work to effectively  use genetic and reproductive science on the farm."}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "Here are just  a few: $3 million for Iraqi Sesame Street, $18 million to improve  gender diversity in the Mexican street lighting industry, $2.5 million  to teach children how to make environmentally friendly reproductive  health decisions, whatever that means."}]