[{"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…with Senators  Wyden, Kaine, and Paul that nullifies Donald Trump's trade war. To  nobody's surprise, the President has already threatened to veto this  bill.\n\nSenate Republicans who know how bad tariffs are for their States  should join us to nullify Donald Trump's trade war and ignore his veto  threat, and, if necessary, we should override the President's…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690192/business-before-the-senate"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…They threw cold water on the idea  of the President cooperating with the Democrats to solve this problem.  The President has been tough to pin down on this subject, and  Republicans know that they have a losing hand because they have no  plan.\n\nSo far, their signature accomplishment is a law that would kick 11  million Americans off Medicaid and shutter…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697295/affordable-care-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…response plans.  This infrastructure is essential for emergency alerts, geotargeted text  messages, and first responder communications. My colleagues know all of  this. The Republicans know how devastating this defunding will be.\n\nEven Chairman Aderholt acknowledged yesterday in the Committee on  Rules that these cuts will harm his State's public broadcasting…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692385/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…half  people. The average American with an ACA plan has seen their premiums  double, and many have seen them much worse than that. It is outrageous;  it is wrong, and Republicans know it.\n\nThere is a demand from one end of the country to the other to undo  the crisis by very simple--there is a very simple way to do it. All  Republicans have to do is…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699088/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Trump's tariffs are hurting  people.\n\nBy the way, on tariffs, if I may, Republicans are once again rigging  the rules to protect Donald Trump and hide from accountability.\n\nRepublicans know his tariffs are economic poison and know voters hate  them, but House Republicans are too cowardly to go on record. The  majority is trying to sneak around with a procedural…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689864/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…happen to this program.\n\nWhat the Republicans are doing is cruel. It is unnecessary. There is  a straightforward, simple solution. It should not be a partisan issue.  Republicans know we have to extend those subsidies. Why not now? That  is the mystery to the American people.\n\nAnd there will be no credit for a shutdown. The American people know  that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695873/9999"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…from CBO confirms what we've been saying all       along: the math doesn't work without devastating Medicaid       cuts,'' Pallone said Wednesday in a statement. ``Republicans       know their spin is a lie, and the truth is they have no       problem taking health care away from millions of Americans so       that the rich can get richer and pay less…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…Does anyone want to know why Republicans are so scared of the mayor  of New York? It is because he wants to lower grocery bills,  transportation costs, and housing costs. Republicans know that Trump's  policies are the reason costs are so high.\n\nMr. Speaker, the evidence and the facts are right before us about  what is happening with this economy. The President…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697150/denouncing-the-horrors-of-socialism"}, {"senator": "Norma Torres", "party": "Democrat", "sentence": "…about power and silencing Americans. Republicans don't want  voting. Thousands of Americans are protesting, demonstrating against  the policies of this administration.\n\nRepublicans know that they will lose the midterms.\n\nThe President asked them to cancel the election, and guess what, Mr.  Speaker, this bill is the next best thing to that. This is a show-your-…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700013/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…answered.\n\nUnfortunately, the Republican majority is also using the same shady  tactic to take away the authority of Congress to legislate tariff  policy, likely because Republicans know their positions are wildly  unpopular and proper oversight would highlight these failings.\n\nThis is yet another example of the erosion of separation of powers  that we…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690500/blocking-resolutions-of-inquiry"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…don't know what Donald Trump will do next. They  can't plan for the future. Their costs are rising. They can't hire new  workers. It is happening all over America.\n\nSenate Republicans know deep down that Donald Trump's tariffs are  awful for their States. So today they have to choose: Stick with Trump,  or stand with your States and the people of America.…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690523/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…off of these  lifesaving programs.\n\nMr. Speaker, 3 weeks ago, House Republicans jammed through their  multitrillion-dollar budget scam by a one-vote margin. Some Republicans  didn't even know what was in the bill. They rushed it through so fast  that we are reportedly going to have to revote on it later this week to  fix all the errors in the bill.…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692265/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…for, many in my hometown of Selma, Alabama.\n\nWe know that it is so important that we safeguard these important  truths. Our freedom is under assault. Make no mistake, Republicans know  that their policies are failing, that prices are going up, that jobs  are going away, that healthcare is being slashed, and that the American  people are struggling to…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700009/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Diana DeGette", "party": "Democrat", "sentence": "…bill, week by week. They will keep waiting  for the Trump healthcare plan that will be promised but will never  come.\n\nFor anybody at home sitting there asking: Do the Republicans know  what they are doing? The answer is, sadly, yes, they do.\n\nAmericans are watching. They know that the Democrats are fighting  like hell for them and for their healthcare.…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698646/extend-enhanced-premium-tax-credit"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…Senate Republicans now.\n\nHello, where are you, Senate Republicans? Are you paying attention?  It is in your House. You have the opportunity to save this system,  Senate Republicans. I know that Senate Democrats are already on board.  They want to do this. Let's get this done.\n\nSo let's challenge the Senate Republicans, see where they stand. We  know where…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698666/protecting-healthcare-for-millions-of-americans"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…to continue the war on American energy, and  that is why they are going to line up today and oppose what President  Trump is trying to do to bring energy prices down.\n\nRepublicans know that the best way to lower prices for the American  people is to support more American energy production. We have it here;  we ought to use it. We have the energy. But…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688189/energy"}]