[{"senator": "Maxine Dexter", "party": "Democrat", "sentence": "Republicans want to slash hundreds of billions of dollars from the  Medicaid committee, gutting healthcare for the most vulnerable, while  billionaires and corporations get another payday."}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "If Republicans want the administration to publish information on who  is getting enhanced screening, they should work with DHS to do so in a  way that does not jeopardize Homeland Security, not with a messaging  bill, which, if signed by the President, could tip off terrorists."}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "Like every other  issue, Republicans want our people to believe that in order to protect  us, we have to take something away from somebody else."}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "Instead, Republicans want to take away food from hungry people, not  to balance the budget, because we know this bill actually increases the  deficit by nearly $3 trillion, and not to better serve our veterans,  because this bill actually reduces funding for our vets."}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "Republicans want to take food off the tables of  families who are just trying to get by."}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "Eighty  million Americans are struggling to pay their utility bills, and  Republicans want to make that financial pain even worse."}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "Speaker, why do Republicans want to roll this rule back?"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "If Republicans want to get tough on crime,  they should stop protecting the criminals in the Epstein files and  demand transparency from Donald Trump."}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "As the ranking member of the Committee on Education and Workforce, I  am particularly outraged that Republicans want to partially fund these  tax cuts for corporations and billionaires by making cuts to education  programs and child nutrition programs."}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "The Consumer Financial Protection Bureau's rule that  Republicans want to repeal by passing S.J."}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "All of this because  Republicans want to raise the cost for people with ObamaCare health  insurance."}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "Republicans want to have it both ways."}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "The foreign currency markets are  evolving, but Republicans want to stick their heads in the stand."}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "That is what Republicans want to  do--they want to not only restore Jim Crow in the South; they want to  have Jim Crow spread from one end of this country to the other."}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "The Republicans want to deal with that."}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "Republicans want people who need assistance  to receive assistance."}, {"senator": "Randy Fine", "party": "Republican", "sentence": "This is the kind of person the Republicans want to defend."}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "It is very important that we have transparency throughout our  government, and that is what Republicans want."}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "Republicans want to lower healthcare costs and premiums for all  Americans, all the Americans on commercial insurance, all the small  businesses, all the people on the ACA exchanges, and all the self- insured, not just a select few, and not subsidizing profitable  insurance companies."}, {"senator": "Roger Marshall", "party": "Republican", "sentence": "Boy, do Republicans want to fix healthcare, but  the real problem is the cost of healthcare."}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "It is because Democrats are on the defensive to protect the Big  Government that they have created over time, while Republicans want to  put government closer to the people, take power out of Washington,  D.C., and truly put America first."}, {"senator": "Mark Alford", "party": "Republican", "sentence": "The message sent  on that is clear: Republicans want to further limit women's access to  healthcare."}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "What Republicans want to do is focus on what we are here to do today."}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "I can tell my  colleagues that Republicans want to ensure that the promises that have  been made to the American people will be kept."}, {"senator": "Roger Marshall", "party": "Republican", "sentence": "What  Republicans want to do is put patients in charge, not insurance  companies."}]