[{"senator": "Alex Padilla", "party": "Democrat", "sentence": "…preparing to have this  Senate go nuclear not just once but twice. First, we will go nuclear  and overturn the rule on points of order during a CRA, which is in the  law. Then Republicans plan to go nuclear a second time: to throw out  the rulebook and use the CRA against any Agency action that any Agency  submits, no questions asked. Like I said, this goes…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691542/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…Seattle, and then to go to college. There is absolutely  no way that anyone in my district can do that with a part-time job at  an entry-level grocery store position.\n\nHouse Republicans' plan is to pay for $4.5 trillion, with a t, in tax  giveaways for the Elon Musks of the world to gut the programs that  allow Oregonians to afford healthcare, put food on…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688236/democratic-proposals"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "…February when they spiked my amendments to support Medicaid and SNAP,  and they refused again today. This is despite the pleas of Americans  protesting Donald Trump and Republicans' plan to steal their healthcare  and let kids go hungry and despite the overwhelming majority crying out  for everyday Americans over the whims of billionaires.\n\nClearly, Republicans…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689908/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…insurance company. I hear  it from Vermonters all the time: Our healthcare system is on the brink,  and every choice Republicans make leads us further into collapse.\n\nRepublicans have no plan for healthcare, and they never have. For the  last 15 years, all they have done is try to repeal, defund,  deauthorize, and dismantle the Affordable Care Act with…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696754/medicare-for-all"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "…did it in the middle of the night so it wouldn't be covered and so  nobody would see. House Republicans voted to take away food assistance  from hungry Americans.\n\nHouse Republicans' plan would slash and cut $300 billion from SNAP.  That means ripping away meals from children, seniors, veterans, and  families just trying to get by. Why? It is all to pay…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691951/protecting-snap-from-budget-cuts"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…the community. Not only are they critical places  for emergency medical care, but they are the anchors of the local  economy.\n\nSpeaking of the economy, one of the ways Republicans plan to cut  Medicaid is by imposing burdensome, redtape requirements.\n\nPut paperwork in the path of an individual looking for medical care.  Pile it up. Make it hard. Pitched…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690984/medicaid"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…cover the $4.5 trillion gap that House  Republicans made because they want to give tax cuts to the wealthiest  of the wealthy.\n\nWhat else does that mean? It means that Republicans plan to cut $900  billion to Medicaid, kicking 8.7 million people off of Medicaid over  the next 10  years. The plan calls for new requirements for beneficiaries, for those…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691088/big-backstabbing-bill"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…can you please go back to Washington and pass  legislation on commercial refrigerators? It is really important.''  Nobody said that.\n\nThey are really concerned about the Republicans' plan to gut  Medicaid. They are pretty concerned about the Republican plans to  dismantle Social Security offices across the country. They are deeply  concerned about reports…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689052/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers-providing-for-consideration-of-hr-defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…itself.\n\nWe begin tonight with a topic close to home for all of us: Medicaid.\n\nIt is my honor to join my fellow Democrats to lay the case before the  American people for how Republicans plan to destroy Medicaid as we know  it and harm millions and millions and millions of Americans. We will  share the stories of people back home. We will illustrate the full…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689512/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…healthcare and putting food on the table.\n\nIn every State, hundreds of thousands of seniors, children, and  working families could lose their health insurance, thanks to  Republicans' plan to cut those hundreds and hundreds of billions of  dollars from Medicaid.\n\nIt would impose, they seek, burdensome work requirements for people  on Medicaid. The last…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "…and what is the response from Republicans in  Congress? The majority plans to follow Trump off the cliff and make it  worse while we are on the way down.\n\nThis month, Republicans plan to pass the new tax cuts for their  billionaire donors and big corporations, and their giveaway to the  wealthy will be paid for by cuts to Medicaid, basically healthcare,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690420/put-hardworking-american-families-first"}, {"senator": "Laura Gillen", "party": "Democrat", "sentence": "Ms. GILLEN. Mr. Speaker, I rise today to raise the alarm on Senate  Republicans' plan to rip Medicaid from 1.5 million New Yorkers,  including children, seniors, and veterans on Long Island.\n\nMr. Speaker, Medicaid is not a luxury. It is a lifeline. In…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692748/medicaid-is-a-lifeline"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…comes to transportation, we were able to increase funding for  air safety. We secured crucial investments for highways and bridges,  ports, and more. We rejected the House Republicans' plan to zero out  funding for Amtrak, making sure to meet the full Amtrak funding request  so our trains could keep running safely and on time.\n\nWe also rejected the House…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699453/appropriations"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "Ms. BARRAGAN. Mr. Speaker, Americans should run away as far and as  fast as they can from Republicans' last-minute mess of a healthcare  plan.\n\nUnder the Republicans' plan, millions of Americans will not be able  to afford health insurance because Republicans don't provide money for  Americans to pay for the healthcare under the Affordable…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698399/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…Minnesota. How could my colleagues across the aisle, in  good faith, call this affordable healthcare and stewardship of the  sacred treasure of our fellow Americans?\n\nRepublicans have a plan. It works. It is not perfect. There are some  things Congress could work together on. But for the love of God and  country, please, it is intellectually dishonest…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698812/breaking-the-gridlock-act"}]