[{"senator": "Jacky Rosen", "party": "Democrat", "sentence": "…safety of our children. It is about making sure  diseases like polio and smallpox remain eradicated. It is about  standing up for the overwhelming majority of parents--Republican,  Democrat, Independent alike--who want their children just protected  from these horrific, terrible illnesses.\n\nSo, today, I am calling on my colleagues in the Senate to join…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695532/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Kevin Mullin", "party": "Democrat", "sentence": "…needs better than Federal standards.\n\nThis isn't new. It has been the law for more than 50 years, and the  Clean Air Act has been upheld by every administration, Republican and  Democrat. Republicans are making an extremist attack on this precedent,  and it is utterly hypocritical for them to call for States' rights when  it suits them.\n\nI spent 10…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690436/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-nox-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…House are comparable  to an indictment but not the same. They are comparable to it in a  sense.\n\nThe Senate then has a trial. I would hope that the Senate would vote,  Republican and Democrat, to convict and remove this President from  office. That would be my desire. I don't always get what I want, which  means I have got to be prepared to file again.…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697060/no-mandate-to-cut-medicaid"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…brought it up, every  Republican has voted to defend dark money, and every Democrat has voted  to rid our politics of this corrupting scourge. Every time, every  Republican, every Democrat. It is a clear divide, a clear difference  between us. And the public is with us. The public is infuriated that  big, secretive special interests can control our…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699104/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Rules.\n\nClearly, our debate on this bill is something Republicans don't want  the American people to see. I invite every single American--it doesn't  matter if they are Republican, Democrat, Independent, or someone who  doesn't follow politics--to tune in to the Committee on Rules. It will  be up on our website. I will be live-streaming on YouTube. It will…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691512/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…sex-trafficking ring. Our side of the aisle, at least, supports the  release of information relating to anybody who had anything to do with  it, whether they are a Republican, Democrat, Independent, or what have  you, period. We insist on complete, full disclosure.\n\nThis resolution has nothing to do with that. This seems to me to be  one more pathetic…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696885/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…everyone's personal data and information.\n\nRanking Member Neal and I are going to introduce a resolution of  inquiry to bring DOGE before Congress. Every Member, Republican and  Democrat, should be concerned about this. Every American citizen should  be aware that DOGE has taken all of that information and stored it in a  cloud, a/k/a another site…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695514/accountability-for-doge"}, {"senator": "Alexandria Ocasio-Cortez", "party": "Democrat", "sentence": "…apiece. We are robbing people of their food assistance  and of their healthcare to pay for it.\n\nHow is this even on the floor? How can we, as Members of Congress-- Republican or Democrat--vote to enrich ourselves by stealing from the  American people? That is what this legislation does. In fact, Senator  Graham went before the press earlier today, and…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696688/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…their lives.\n\nMr. Speaker, there is no inherent authority for the President to  impound and steal funds, and there never has been. I don't care if the  President is Republican or Democrat. The late Justices Scalia and  Rehnquist said so. Chief Justice Roberts and Justice Kavanaugh have  said so. By the way, they are no liberal torchbearers.\n\nThe Department…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692541/rescissions-act-of-2025"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…with. Tell me an  issue where you have bipartisan sponsorship: Senator Grassley, chairman  of the Senate Judiciary Committee; I am ranking member of that  committee--a Republican, a Democrat supporting it. Tell me an issue  where you have President Trump supporting our position and a Democratic  Senator like myself on the floor espousing the same position…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694204/military-construction-veterans-affairs-and-related-agencies"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…that obeys the law. This Department of Homeland Security is not obeying  the law. They are not. And I would argue that every Member of this  body, whether you were a Republican or a Democrat, in order to uphold  your oath of office, should not be funding an Agency that isn't  complying with the Constitution and the statutes of the United States.\n\nSo I…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700057/9999"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…why. It is because they want to privatize Social  Security. They are dissembling Social Security from within.\n\nDemocrats are aware of this, but all citizens--whether Republican,  Democrat, or unaffiliated--ought to be concerned and shocked by the  fact that your data, your personal information, has been hacked by  people who were not vetted and are unaccountable…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695217/data-collected-by-doge"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…will save lives for generations  to come.\n\nThis is not a partisan issue. Well, rather, it should not be a  partisan issue. Disease does not care whether you are a Republican or a  Democrat. Cancer doesn't check your voter registration. Alzheimer's  doesn't ask where you fall on the ideological spectrum. This is about  protecting the health of every…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689421/nih-cuts-put-american-lives-at-risk"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…is legal. But because Donald Trump  ordered it stopped. It falls on his shoulders.\n\nLet's be clear: This does not need to happen. Never before under any  President, Republican or Democrat, has SNAP been cut off during a  shutdown. We are not talking about--we are talking, with the shutdown,  we all know our position. We need a negotiation, but this SNAP…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696462/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-record-of-decision-for-the-barred-owl"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…forth. We did a lot of consternation, and  we came up with the winners.\n\nThey  were all anonymous to me. I don't know which pages they were. I don't  know if they were Republican or Democrat. I don't know if they were the  pages that told me bad jokes or the pages that told me really bad jokes  because there were really just two categories in this class.…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699130/senate-pages"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Mr. Speaker, one of their headlines said--I think it was actually  more than a single-year period, but $50 billion of fraud. Are we  allowed to work on that? Is that Republican or Democrat, or is it just  time to find a better way to actually think about these things?\n\nThat is maybe what we just opened up, assuming that my own leadership  and my own committee…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688088/republican-budget"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…number of 18 year olds we have today. Next year,  the number of 18 year olds goes down, the year after that it goes down,  and the year after that it goes down.\n\nIs that Republican or Democrat or is it just demographics? It is a  little hard to campaign on that. It is a little hard to attack the  other side, but the fact of the matter is, if we all read our…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694131/dismantling-californias-citizens-redistricting-commission"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…population is  functionally stable. Then the next year you start to actually fall in  your numbers of working-aged people in the population. It is  demographics. It is not Republican or Democrat, it is just math.\n\nOne more chart of this, and then I am going to give you the one that  scares me the most. This is Social Security and disability benefits.  Here…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689025/tell-the-truth-about-math"}, {"senator": "James Risch", "party": "Republican", "sentence": "…committed they would require, as is required by law, to send a new  report under the law, and Congress could then act. That is the law.\n\nLet me be clear. No President, Republican or Democrat, will ever  consider a prospective War Powers Resolution vote as binding on the  President's constitutional article II powers as Commander in Chief, and  they shouldn't.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699089/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…suffered when the insurrectionists beat  them, that we should honor the police who protected our democracy and  indeed protected every single one of us. Whether you are Republican or  Democrat, a House Member or a Senator, you were protected by the  police.\n\nAre you willing to vote for this? If you vote against the previous  question, you are saying we will…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691169/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…literacy, wouldn't it? Someone would actually have to sit down and read  the stuff with a calculator.\n\nWe have a crisis. Having a society that is getting older is not  Republican or Democrat; it is just what we are. It is math.\n\nLook, if we are not willing to tell the truth, we can continue to use  our campaigns--all right. I will take a slight non sequitur.…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692327/math-always-wins"}, {"senator": "Rick Scott", "party": "Republican", "sentence": "…is no risk in the world,  and so, at some point, we are going to all have to come together to  start accelerating this. We have so many nominees. Whether it is a  Republican or a Democrat President, we have got to allow these nominees  to get through and get confirmed in a much more expedited manner.  Otherwise,  none of our Presidents are ever going…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691405/motion-to-discharge-s-res-195"}, {"senator": "John James", "party": "Republican", "sentence": "…ago:  real transparency, real competition, and real power will be back in the  hands of patients.\n\nI am asking every one of my colleagues to join our bipartisan bill,  Republican and Democrat, to stand with the families getting hammered by  these bills.\n\nMr. Speaker, cosponsor the Patients Deserve Price Tags Act. Let's  finally give the American people,…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697860/obamacare-isnt-working"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…the new Supreme Court interpretations of  reasonable suspicion, let's do it. If they want to debate the very  authorities of ICE stretching back decades over both Republican and  Democrat administrations, let's do that. If they want to have concrete  debates about the authorities or changes of laws, let's do that. But we  should not attack the operational…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699311/providing-for-consideration-of-hr-consolidated-appropriations-act-and-providing-for-consideration-of-hr-department-of-homeland-security-appropriations-act-and-for-other-purposes"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…Republicans and  Democrats, I have come to the Senate floor to raise concerns and  warnings about how immigrant children called unaccompanied children are  handled by Republican and Democrat Departments of Health and Human  Services. When immigration people don't have the capabilities or  probably the legal right to determine where unaccompanied children…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699108/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "James Risch", "party": "Republican", "sentence": "…case, President Bush deployed more than 9,000  troops, and they fought for 2 weeks on the ground in Panama before they  got their hands on Noriega. At that time, both Republican and Democrat  leaders of the Senate praised this move.\n\nCompare that to what happened here. There were only about 200 troops  involved, and they were engaged for 47 minutes. And…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698707/venezuela"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…numbers in 10, 20 years,  it is you and your partner, you and your spouse and a little bit more,  you have your own retired person you are paying for. That is not  Republican or Democrat. It is demographics.\n\nIn 2033, so 7.5 years from now, the Social Security trust fund is  empty. The law says you cut benefits. That would be a 21 percent cut,  meaning…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689614/its-the-math"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…healthier society, and we use technology.\n\nI am wearing one of these Oura rings. We are doing experiments in our  office with other wearables trying to build data. Is that Republican or  Democrat? It is just data. I don't know why we haven't been able to  build a love connection here or a policy connection or whatever the  hell we are supposed to call it between…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690748/the-math"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…his legal rights under article II to  use military force to advance the national interest, which is to end  the drug trafficking dictatorship of Maduro, which every Republican and  Democrat condemned, and President Trump finally did something about it.  He was flooding our country with drugs, and it was a safe haven for  Hezbollah and other drug cartels.…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698616/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…that if the people of this country have  chosen the President of the United States, then that is the direction  we will go. We will give that President, whether it be Republican or  Democrat, whether it be a man or a woman, we will give that President  the opportunity for the control of this nomination and the system here  in Washington, D.C.\n\nWe have…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695616/district-of-columbia-judicial-nominations-reform-act"}]