[{"senator": "Alex Padilla", "party": "Democrat", "sentence": "Then Republicans plan to go nuclear a second time: to throw out  the rulebook and use the CRA against any Agency action that any Agency  submits, no questions asked.", "title": "Providing for Congressional Disapproval Under Chapter 8 of Title United States Code, of the Rule Submitted By the National Highway Traffic Safety Administration Relating to ``Federal Motor Vehicle Safety Standards; Fuel System Integrity of Hydrogen Vehicles; Compressed Hydrogen Storage System Integrity; Incorporation By Reference''", "date": "2025-05-21"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "House Republicans' plan is to pay for $4.5 trillion, with a t, in tax  giveaways for the Elon Musks of the world to gut the programs that  allow Oregonians to afford healthcare, put food on the table, and keep  a roof over their heads.", "title": "Democratic Proposals", "date": "2025-02-26"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "This is despite the pleas of Americans  protesting Donald Trump and Republicans' plan to steal their healthcare  and let kids go hungry and despite the overwhelming majority crying out  for everyday Americans over the whims of billionaires.", "title": "Concurrent Resolution on the Budget for Fiscal Year 2025", "date": "2025-04-09"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "Republicans have no plan for healthcare, and they never have.", "title": "Medicare for All", "date": "2025-11-17"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "House Republicans' plan would slash and cut $300 billion from SNAP.", "title": "Protecting Snap From Budget Cuts", "date": "2025-06-04"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "Speaking of the economy, one of the ways Republicans plan to cut  Medicaid is by imposing burdensome, redtape requirements.", "title": "Medicaid", "date": "2025-05-12"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "It means that Republicans plan to cut $900  billion to Medicaid, kicking 8.7 million people off of Medicaid over  the next 10  years.", "title": "Big, Backstabbing Bill", "date": "2025-05-13"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "They are really concerned about the Republicans' plan to gut  Medicaid.", "title": "Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Department of Energy Relating to ``Energy Conservation Program: Energy Conservation Standards for Walk-In Coolers and Walk-In Freezers''; Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Office of Energy Efficiency and Renewable Energy, Department of Energy Relating to ``Energy Conservation Program: Energy Conservation Standards for Commercial Refrigerators, Freezers, and Refrigerator-freezers''; Providing for Consideration of H.R. Defending Education Transparency and Ending Rogue Regimes Engaging in Nefarious Transactions Act", "date": "2025-03-25"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "It is my honor to join my fellow Democrats to lay the case before the  American people for how Republicans plan to destroy Medicaid as we know  it and harm millions and millions and millions of Americans.", "title": "Establishing the Congressional Budget for the United States Government for Fiscal Year 2025 and Setting Forth the Appropriate Budgetary Levels for Fiscal Years 2026 Through 2034", "date": "2025-04-03"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "In every State, hundreds of thousands of seniors, children, and  working families could lose their health insurance, thanks to  Republicans' plan to cut those hundreds and hundreds of billions of  dollars from Medicaid.", "title": "Privileges of the Floor", "date": "2025-03-31"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "This month, Republicans plan to pass the new tax cuts for their  billionaire donors and big corporations, and their giveaway to the  wealthy will be paid for by cuts to Medicaid, basically healthcare, and  food stamps that hardworking American families rely on.", "title": "Put Hardworking American Families First", "date": "2025-04-30"}, {"senator": "Laura Gillen", "party": "Democrat", "sentence": "Speaker, I rise today to raise the alarm on Senate  Republicans' plan to rip Medicaid from 1.5 million New Yorkers,  including children, seniors, and veterans on Long Island.", "title": "Medicaid is A Lifeline", "date": "2025-06-23"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "We rejected the House Republicans' plan to zero out  funding for Amtrak, making sure to meet the full Amtrak funding request  so our trains could keep running safely and on time.", "title": "Appropriations", "date": "2026-01-30"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "Under the Republicans' plan, millions of Americans will not be able  to afford health insurance because Republicans don't provide money for  Americans to pay for the healthcare under the Affordable Care Act.", "title": "Lower Health Care Premiums for All Americans Act", "date": "2025-12-17"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "So the bottom line: The Republicans do not have a serious plan to fix  our healthcare problems, but we Democrats do--a clean, simple extension  to prevent premiums from rising and rising and rising.", "title": "Healthcare", "date": "2025-12-10"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "Republicans have a plan.", "title": "Breaking the Gridlock Act", "date": "2026-01-08"}]