[{"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…America. They are the ones who were rewarded with  the taking of this money.\n\nMeanwhile, Democrats have been listening to our constituents and  hosting townhalls--even in Republican-led States--and fighting back  against a law that does nothing for working families and everything for  the ultrarich.\n\nSenate Democrats are offering Republicans another chance…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694383/9999"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…that this offset has been employed historically and in  some form since the 1960s. However, in light of this administration's  ongoing efforts, enabled by a complacent Republican-led Congress, to  systematically weaken VA, we must reevaluate whether it remains  appropriate to rely on this offset. I believe it would be prudent to  discuss with the Senate…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689624/vietnam-veterans-liver-fluke-cancer-study-act"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…thought I would share what I am hearing from my neighbors across  the Gulf Coast. They want policymakers in Washington, D.C., to tackle  the cost of living. During this Republican-led Congress, there has not  been one bill brought to the floor of the House--and here we are in  May--to lower the cost of living for families along the Gulf Coast and  all…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690936/gulf-of-america-act"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…history in their  so-called ``Big Beautiful Bill'', taking away Medicaid from millions of  Americans.\n\nWhile I will vote in favor of the SUPPORT Act, my concern is that  this Republican led Congress has authorized these programs with no one  left at the agencies to see them through.", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692133/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…Black Caucus  to bring awareness to the fast-approaching ACA tax credit funding  deadline, 30 days to go, and to give voice to everyday Americans who  will be harmed by the Republican-led healthcare crisis.\n\nThe enhanced ACA tax credits are set to expire on December 31 unless  congressional Republicans join Democrats to extend them.\n\nWithout an extension…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697213/medical-bills-are-too-high"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…been completely and totally  unacceptable, hurting everyday Americans and exploding the debt and the  deficit at the same period of time.\n\nNothing has been done by this Republican-led Congress to lower the  high cost of living. Donald Trump promised that costs would go down on  day one. Costs have not gone down. They are going up. Inflation is on  the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695292/9999"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…billionaire who has no accountability, did not have to go  through Senate approval, is not a government employee, and isn't even a  volunteer. Yet, he is placing his will on a Republican-led Congress in  both the House and Senate.\n\nAll that is needed is three Republicans to stand up and say: No. Wait  a minute. This is not what the Nation needs. We do not need…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688396/preeminent-antipoverty-program-for-elderly-and-children"}, {"senator": "Brad Schneider", "party": "Democrat", "sentence": "…inflation. Inflation in healthcare has been going on for  generations. In fact, during the years of the George W. Bush  administration, premiums increased 118 percent.\n\nThe Republican-led legislation they are presenting to us today is  barely even a concept of a healthcare plan. After 15 years of efforts,  they should be embarrassed by this slapdash effort.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698395/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "…the chase. I will repeat. Half of the people who have died in police  car chases were innocent bystanders. That should alarm every single one  of us.\n\nAcross the country, Republican-led States have recognized the dangers  of high-speed cases. States like Texas, Florida, and Tennessee have all  implemented tighter standards to limit pursuits of violent…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695640/district-of-columbia-policing-protection-act"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…understand that this  offset has been used in the past and has existed in some form since the  1960s. However, given that this administration, with the enabling of a  feckless Republican-led Congress, has been working overtime to hollow  out VA, we must rethink whether or not it is appropriate to continue  its use.\n\nAside from the moral failing of cutting one…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689677/clear-communication-for-veterans-claims-act"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…with a history of tough-on-crime stances, many are  moving in a more rehabilitative direction.\n\nThis approach aligns with a broader national trend, including in  several Republican-led states, to reform juvenile justice with a focus  on rehabilitation rather than punishment. For example, Texas, a state  known for its traditionally tough stance on crime,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695783/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…commitment by interfering with  the independent process that aligns child nutrition standards with the  latest science.\n\nFurthermore, let me just point out that after months of Republican- led political brinksmanship, we are still considering a bill that does  nothing meaningful to address childhood obesity, nutrition, or hunger.\n\nThe bottom line is that Members…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698183/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…Congressional  Black Caucus to bring awareness to the fast approaching ACA tax credit  funding deadline and to give voice to everyday Americans who will be  harmed by the Republican-led healthcare crisis. The enhanced ACA tax  credits are set to expire on December 31 unless congressional  Republicans join Democrats to extend them.\n\nIn a few short weeks,…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697649/restoring-enhanced-premium-tax-credits"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "…in the House, including many of my  colleagues here this evening.\n\nMr. Speaker, it has been a disastrous 100 days, but I feel the worst  is yet to come.\n\nThis week, the Republican-led committees are working on Trump's  Republican rip-off, a plan to take from our constituents so that they  can give to the ultrawealthy and the very well-connected. We are…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690635/trumps-first-100-days"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "Mrs. RAMIREZ. Mr. Speaker, from the start of the Trump  administration, this Republican-led Congress has willingly given up our  powers and authority: our power of the purse, our oversight authority,  our legislative authority, and now, our war powers.\n\nMembers…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698443/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Missouri,  Arkansas, South Carolina. See a little trend there? It is actually  Republicans. Don't come and talk to us about that. It is dangerous to  live and work in many Republican-led States.\n\nLet's get back to what we do to honor and respect law enforcement on  this Police Week.\n\nMs. LEGER FERNANDEZ.\n\nWe have heard a lot of claims today, but here is…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691169/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…Democratic-controlled  Congresses, the Rules Committee produced 127 total rules in the 116th  Congress and 163 in the 117th Congress. Contrast this to the 200 total  rules in the Republican-led 118th Congress. For the 119th, we are on  pace to once again produce nearly 200 rules for the Congress.\n\nMr. Speaker, we are doing our job. We are not closing out debate.…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696900/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision-providing-for-consideration-of-h-con-res-denouncing-the-horrors-of-socialism-providing-for-consideration-of-hr-unlocking-our-domestic-lng-potential-act-of-providing-for-consideration-of-hr-researching-efficient-federal-improvements-for-necessary-energy-refining-act-providing-for-consideration-of-hr-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-providing-for-consideration-of-hr-district-of-columbia-cash-bail-reform-act-of-and-for-other-purposes"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…my view, have avoided the issue of healthcare out of  political fear historically. I believe that this Republican Congress,  this Republican House and Senate, and this Republican-led White House  have the opportunity today to transform healthcare for the American  people so that it can be affordable, so that they can have choice and  they can go to…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698106/bringing-america-back-to-its-roots"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…was President Trump's  Department of Justice that indicted Jeffrey Epstein in July 2019. It  was President Trump's DOJ that arrested and indicted Ms. Maxwell. It  was the Republican-led Oversight Committee, through 13 subpoenas, that  has released 65,000 pages of files in just 10 months.\n\nMeanwhile, my colleagues on the other side of the aisle have largely…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696812/epstein-files-transparency-act"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…a motion at the desk.\n\nMr. ARRINGTON.  Con. Res. 14.\n\nMr. Speaker, in the most historic election of our lifetime, Americans  resoundingly elected President Trump and a Republican-led Congress to  reverse course on the failed policies and the string of self-inflicted  disasters of the past 4 years.\n\nUnbridled spending and bad economic policies have weakened…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689910/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}]