[{"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "Speaker, or we have seen, at the President's request,  congressional Republicans cut Medicaid, cut SNAP benefits, put lifetime  caps on student loans, Federal student loans, cut funding that Congress  appropriated for cancer research, for the National Institutes of  Health, a whole host of things.", "title": "Better is Possible", "date": null}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "If Republicans wanted to find a solution to bipartisan concerns about  SBA's capacity to oversee an increased number of licenses, Democrats  would have been happy to work together on this.", "title": "Capping Excessive Awarding of Sblc Entrants Act of 2025", "date": "2025-06-05"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "We have Republicans in the Chamber who have never voted to impeach  Donald Trump for inciting a violent insurrection against this Congress,  this Constitution, and his own Vice President, who have never voted to  even censure the President for doing that, and yet they want to censure  the gentleman from Texas.", "title": "Raising A Question of the Privileges of the House", "date": "2025-03-05"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "At the same time as  congressional Republicans are creating additional bureaucratic hurdles  for K-12, the Trump administration is actively dismantling the  Department of Education.", "title": "Transparency in Reporting of Adversarial Contributions to Education Act", "date": "2025-12-03"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "It started in 1996, when the Republicans wanted to pass tax giveaways  for the wealthy and didn't have the required 60 votes so they turned to  the reconciliation process.", "title": "H.R. 1", "date": "2025-07-21"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "Trump did       not replace Comey with a loyalist, largely because such a       move was vetoed by key Senate Republicans.", "title": "Trump Administration", "date": "2025-10-21"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "Let's be clear: Republicans have been on a crusade against SNAP all  year.", "title": "Providing for Congressional Disapproval Under Chapter 8 of Title United States Code, of the Rule Submitted By the United States Fish and Wildlife Service Relating to ``Record of Decision for the Barred Owl", "date": "2025-10-29"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "Republicans know this will put our last most wild place at  risk.", "title": "H.J. Res. 131", "date": "2025-12-04"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "Republicans have tied in with billionaires and restricted the rights  of workers to organize and have union representation wherever possible  while they are telling them that their enemy is their neighbor.", "title": "Economic Populism", "date": "2025-03-25"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "In my district alone, nearly 100,000 people rely on these tax credits  to afford coverage, and because Republicans let them expire, many of  them are starting off the year without access to care.", "title": "Providing for Consideration of H.R. Breaking the Gridlock Act", "date": "2026-01-07"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "Speaker, I rise and join Democrats, Republicans, and other  leaders because the Justice Department's criminal investigation into  Chair Powell is yet another attempt by Trump to take control of the  Fed, endangering household finances across the country.", "title": "Recognizing Jerome Powell", "date": "2026-01-14"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "Republicans would be beside themselves.", "title": "Nominations", "date": "2025-12-17"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "Yet, House Republicans base their entire resolution on this  falsehood and advance a false equation between democratic socialism and  Communist dictatorship, a preposterous assertion that contaminates the  entire resolution.", "title": "Denouncing the Horrors of Socialism", "date": "2025-11-21"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "In July, Republicans passed their big, ugly bill, which will saddle  American families with price hikes of at least $110 next year and up to  $4,000 annually within a decade.", "title": "Researching Efficient Federal Improvements for Necessary Energy Refining Act", "date": "2025-11-20"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "Why are Republicans even bothering to show up if my Republican  colleagues are just going to give all of our constitutional authority  to the executive to levy these taxes on middle-class Americans who  can't afford it?", "title": "Providing for Consideration of Senate Amendment to H. Con. Res. Concurrent Resolution on the Budget for Fiscal Year 2025", "date": "2025-04-09"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "The question is whether Republicans have the nerve to put  it on must-pass legislation, to fight for it, to break the filibuster  in the Senate, to move the bill and get it to the President's desk,  along with some other good changes, like voter ID and other things we  should do.", "title": "Ice Under Attack", "date": "2026-01-13"}, {"senator": "Mike Crapo", "party": "Republican", "sentence": "As Republicans predicted, the book minimum tax has proven to be  highly complex and burdensome.", "title": "-9999", "date": "2026-02-10"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "The  Republicans, including me and President Trump, believe we will never  have orderly immigration until you get to the root cause of the  problem.", "title": "-9999", "date": "2026-02-12"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "Republicans saw the  threat then posed by this thug and his cronies.", "title": "Mobilizing and Enhancing Georgia's Options for Building Accountability, Resilience, and Independence Act", "date": "2025-05-05"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "Ensuring the safety and security of the homeland will always be the  top priority of Republicans in Congress.", "title": "Providing for Consideration of H.R. Streamlining Procurement for Effective Execution and Delivery and National Defense Authorization Act for Fiscal Year and Providing for Consideration of H.R. Stop Illegal Entry Act of 2025", "date": null}, {"senator": "John Joyce", "party": "Republican", "sentence": "This Congress, Republicans on the Energy and Commerce Committee have  worked diligently to improve grid reliability as well as the permitting  process for Federal projects, ultimately supporting President Trump's  goal of unleashing American energy dominance.", "title": "Letterkenny Army Depot Plays Important Role", "date": "2025-12-09"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "House Republicans are united behind President Trump's efforts to  secure our border, strengthen our immigration enforcement, and fix our  immigration system.", "title": "Stop Illegal Entry Act of 2025", "date": null}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "Our Republican House Conference, the President, and the Senate  Republicans are committed to doing this for America and to making our  Nation, our States, our energy producers, our farmers, our  manufacturers, and our communities great again.", "title": "Work Highlights of Western Caucus", "date": "2025-03-27"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "This landmark legislation, passed by House Republicans last July,  delivers meaningful tax relief to working Americans by expanding the  child tax credit, allowing nonitemizers to claim charitable deductions,  eliminating taxes on tips and overtime, and more.", "title": "Disapproving the Action of the District of Columbia Council in Approving the D.C. Income and Franchise Tax Conformity and Revision Temporary Amendment Act of 2025", "date": "2026-02-04"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "Let's actually walk through a chart that has upset a number of my  fellow Republicans, but the math is honest.", "title": "A Real Math Problem", "date": "2025-03-06"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "The Republicans want to deal with that.", "title": "Increasing Medicaid Funding", "date": "2025-05-07"}, {"senator": "John Moolenaar", "party": "Republican", "sentence": "Let's stand together, Republicans and Democrats, to protect our  students, safeguard our campuses, and push back on foreign influence.", "title": "Dhs Restrictions on Confucius Institutes and Chinese Entities of Concern Act", "date": "2025-05-07"}, {"senator": "Mary Miller", "party": "Republican", "sentence": "House Republicans are standing up for the American people here today.", "title": "Veterans Accessibility Advisory Committee Act of 2025", "date": "2026-02-11"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "Speaker, when it comes to healthcare, Republicans are focused on  lowering costs and expanding choice for all Americans.", "title": "Lower Health Care Premiums for All Americans Act", "date": "2025-12-17"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "Fortunately,  thanks to the leadership of President Trump and congressional  Republicans, we are back on track and moving away from the iceberg that  was President Biden's administration.", "title": "Following Through on Americans' Priorities", "date": "2026-01-08"}]