[{"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…abuse and neglect. I ought to file a 51A on  Republicans for that. Every person in this Chamber and every person in  our country has lost a loved one to cancer, and yet Republicans would  vote to deny people lifesaving cancer treatment and research.\n\nRepublicans control the House, the Senate, and the White House, and  with a majority they have chosen to…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696696/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…the  USDA's own guidance that they removed from their website that justifies  this.\n\nAny failure to do so right now falls squarely on the Trump  administration and Republicans. We could vote on this today, on this  bill or one that Senator Hawley has authored as well that has many  Republican colleagues that are cosponsors, to prevent a hunger crisis.…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696457/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-record-of-decision-for-the-barred-owl"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…Affordable Care Act enhanced premium tax credits  so that we can lower the healthcare costs for 22 million Americans.\n\nThose Americans get that protection today. If the Republicans do not  vote for that protection to be continued tomorrow, then 22 million  Americans and their families are going to see a dramatic rise in their  healthcare bills beginning the…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697772/healthcare"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…standing strong against the administration's many  attacks against families' healthcare. This is just one of them.\n\nWith this Special Order hour, we are calling out Republicans to  either vote to protect their constituents' healthcare, or to vote to  take it away. That is the choice.\n\nIn stark contrast to the President and Republicans in Congress,  Democrats…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691417/gop-tax-scam-hurts-everyone"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…Parliamentary Inquiry\n\nMr. NEGUSE. Mr. Speaker, I have a parliamentary inquiry.\n\nMr. NEGUSE. Mr. Speaker, my understanding is that House Republicans  have kept this vote open longer than any other Congress in the history  of the House of Representatives.\n\nAt what point will the Speaker ascertain whether this practice is  violative…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693214/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…Remember, cut these moneys so that my colleagues on the other side of  the aisle can give a tax cut to their billionaire, Musk-like donors.  That is just not true. Republicans can't vote for a structure that  takes $880 billion out of the healthcare safety net and claim not to  have done it. Republican Members voted to cut Medicaid, which will hurt…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690628/republican-tax-cuts"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Speaker. If this House voted today to stop  premiums from exploding, it would pass. It would pass easily. Democrats  would vote for it, and I know there is a chunk of Republicans who would  vote for it, as well. The Republican leadership will not bring it up  because they care more about tax breaks for billionaires than tax  credits for working families.…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697303/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…consumers $5 billion a year. Not surprisingly, more than 80 percent of  Americans, including Republicans, want to get these high overdraft fees  under control, yet Republicans will vote to take off the limits on  these fees and say that higher fees are good for America.\n\nLet's clear up a few myths. The Consumer Financial Protection  Bureau's rule does…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689845/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "Mr. SCHUMER. Mr. President, finally, on the nomination of Bedford to  the FAA, later this evening, Senate Republicans will vote to advance  Donald Trump's nominee to lead the FAA, Bryan Bedford.\n\nTo say that Mr. Bedford is a deeply flawed nominee would be putting  it mildly. Throughout his career…", "date": "2025-07-08", "source_url": "https://justfacts.votesmart.org/public-statement/1693275/nomination-of-bryan-bedford"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…choosing cowardice. They are choosing obedience to  Trump, so they cooked up this nonbinding resolution, a press release,  pretending to do something.\n\nLet's be clear: Republicans can either vote to release the files or  vote to bury them. If every Republican votes to block our attempt to  release the records, they are telling Epstein's victims that they…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693718/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Ted Lieu", "party": "Democrat", "sentence": "…national TV and told the American people that Jeffrey  Epstein's client list was ``sitting on my desk right now.''\n\nWhy won't she release that client list?\n\nWhy won't House Republicans vote to release that list?\n\nIn fact, House Republicans are shutting down Congress early. Shortly  after my speech, Congress is going to shut down until September because  House…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694127/release-the-epstein-files"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…other, try to help  the American people, and vote for our plan.\n\nI implore my Republican colleagues: We need just 13 of you to push  this bill over the finish line.\n\nIf Republicans vote this bill down, they will unleash healthcare  chaos throughout the country.", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697877/healthcare"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "Mr. AMO. Mr. Speaker, budgets are a statement of values. Republicans  are showing they have none.\n\nPeople will suffer. People will die. It will be at the hands of  Republicans who vote ``yes.''\n\nThe top 1 percent are salivating over getting an extra $300,000 a  year because of this dangerous bill. Billionaires win.\n\nMr. Speaker, 17 million Americans…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693181/one-big-beautiful-bill-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Republicans refuse to display the plaque honoring the brave law  enforcement officers who protected our democracy and protected all of  us on January 6. We all know why Republicans vote again and again and  again for all these giveaways for the rich and powerful.\n\nIt is Donald Trump. He wants to rewrite history. He wants to hide the  truth about Jeffrey…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694886/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…to vote.\n\nRepublicans have refused this amendment. Republicans are refusing  your ability to go and make it easy for citizens to register to vote in  this country. Republicans can now vote to pass this amendment.\n\nMs. JOHNSON of Texas. Mr. Speaker, I have a motion to recommit at the  desk.\n\nMs. JOHNSON of Texas. Mr. Speaker, on that I demand the yeas…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690011/safeguard-american-voter-eligibility-act"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…they do that? When  you vote ``no'' to continue funding, that means you deny food stamps  for hungry families. No means no, you don't want to pay them. Yes, like  the Republicans vote, that means, yes, we do want to pay them.\n\nDemocrats left our troops wondering when they would get their next  paycheck, and for what, Mr. Speaker? Democrats did that…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696724/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…are fighting for  right now in the House is for crumbs. I haven't decided whether I will  vote for it or not vote for it. Why? Because I am one vote. Out of 220  Republicans, I am one vote, and I have to figure out how we build a  majority and how the Senate builds a majority and then work with the  White House to get a bill signed. I recognize that.…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690594/fiscal-responsibility"}]