[{"senator": "Jim McGovern", "party": "Democrat", "sentence": "…I do know this, because I am on the Rules Committee, and I  do know the gentlewoman time and time and time again voted against  releasing the Epstein files. I know my Republican friends are hoping  that they don't have to go on record because they don't want to get  Trump upset at them, but the bottom line is every single Republican  will go on record,…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696693/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…destroyed resources in our national marine sanctuaries.\n\nHere is what really stinks about this bill: While working American  families are facing an affordability crisis, our Republican friends  prioritize special favors like this for the wealthiest corporations on  the planet. These are companies that could easily afford to just follow  the rules and just pay…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699959/undersea-cable-protection-act-of-2025"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…agency that is  killing American citizens right before our very eyes. That is what we  want.\n\nI don't understand for the life of me why that is such a heavy lift  from my Republican friends, but that is what we are asking for. We  don't want to shut the government down. That is not who we are.\n\nBy the way, again, Republicans are responsible for the last…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699593/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…poor. They are making a conscious decision to betray their  constituents and sell out their best interests to MAGA billionaires.\n\nAt the end of the day, no matter what my Republican friends say,  because of this budget, more kids will go without food. More kids will  be malnourished. Because of this budget, parents and grandparents will  have to sell their…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689864/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "…number one: Get rid of tariffs, which are a tax on bananas,  coffee, vegetables, pasta sauce, pasta, televisions, automobiles, and  burgundy, a fine French claret for my Republican friends over there.\n\nNumber two: Stop canceling generation projects, which will make  electricity cheaper.\n\nThat was my speech. Instead, we are here to denounce the horrors of…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697156/denouncing-the-horrors-of-socialism"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…with disabilities.\n\nWe know what this is. This is an attempt to distract from what is  going on behind the scenes here in Washington, D.C. I have to say I  think my Republican friends are out of touch with working people.\n\nPeople are tired of being ripped off by special interests and  politicians in Washington. This resolution is another example of…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689130/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…their nutrition benefits.\n\nThe SNAP benefit, on average, is about $2 per person per meal. That  is it. You can't buy a damn cup of coffee in the Capitol with that. My  Republican friends are obsessed with trying to throw people off of this  benefit. I have no idea why.\n\nMost of the people on the benefit are children and senior citizens.  They include…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693225/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…week to set in motion devastating cuts to Medicaid and  SNAP or that, a few days ago, Elon Musk said that Social Security is a  Ponzi scheme. Yet, the other night, my Republican friends stood and  applauded for him like he was Elvis Presley.\n\nThe majority also doesn't want people to remember that the Trump  administration has announced plans to cut staffing…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688632/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…Tax credits that help working people  afford healthcare are vanishing, and Americans are watching  billionaires get huge tax cuts while the cost of living goes up.\n\nMy Republican friends knew that refusing to renew these tax credits  would cause healthcare costs to skyrocket.\n\nMr. Speaker, they decided to cancel work for 2 months and simply  ignored the…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698789/breaking-the-gridlock-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…even get into Donald Trump actually being recorded--it is  recorded--asking for 11,800 votes to basically change the results in  Georgia during the 2020 election.\n\nIf my Republican friends want to talk about voter fraud, look in the  mirror.   Johnson).\n\nMr. Speaker, I love the fact that all these guys have are  statistically insignificant anecdotes that…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699941/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…and the Republican majority were  elected last November to deliver on a simple promise, to lower costs  for Americans. Unfortunately, this budget does not do that.\n\nMy Republican friends have decided that providing billions of dollars  in tax breaks for a few millionaires and billionaires is worth ordinary  Americans bearing, as Elon Musk put it last…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688065/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…thank my colleagues who have come to the floor: Senators Durbin, Kim,  Welch, Whitehouse, Hirono, Schiff, and now my great friend and  colleague Senator Booker.\n\nTo my Republican friends, let me just say that there is ample  evidence on the record already to say no to this nominee. But even if  you disagree, what is undeniable here is the point that Senator…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694062/9999"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…Article I, Section 8, of the U.S. Constitution says that it is the  Federal Government and Congress who should coin money and determine the  value thereof. However, our Republican friends tell us that that means  that the Federal Government should be stuck with 1776 technology while  the competitors of the dollar race forward in the 21st century.\n\nThe…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693738/anti-cbdc-surveillance-state-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…on a party-line vote, all  because of obeisance and fear of Donald Trump, not a conviction that he  is doing the right thing. This is a dark omen moving forward.\n\nOur Republican friends say they fight for the middle class. They say  they fight for working people. Then they turn around and take  investments away from middle class and rural America.\n\nI…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693459/rescissions"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…concern,  how about you start with President Trump, who has pardoned or commuted  not one, not two, but 12 people. He pardoned 12 people convicted of  healthcare fraud. My Republican friends have been silent, not a word.\n\nOne guy was convicted of $1.3 billion in a Medicare fraud scheme, the  largest healthcare fraud scheme charged by the Department of Justice.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698312/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…voice? If this gentle and decent and caring man  is treated this way, what is happening along the margins in the dark  spaces in the places we cannot see?\n\nSo I call on my Republican friends and colleagues to look hard at  this moment and say: What comes next? What comes next? Are we to be at  risk of arrest if we threaten to ask a question or deign to interrupt?…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692447/alex-padilla"}]