[{"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…efforts that make America and the world safer--and it underfunds  efforts to clean up sites contaminated by our Nation's early atomic  energy program.\n\nAll of this after Republicans passed the Big Ugly Bill, a law that  gives massive tax breaks to billionaires and the biggest corporations  while driving up home energy bills for families by as much as 30…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694862/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…very well the debate that this House engaged in a mere 3  months ago, 2\\1/2\\ months ago, regarding the budget bill and the  terrible cuts to Medicaid that this Chamber, Republicans, passed, and  that the President signed into law. I remember after that legislation  was signed into law, several of my Republican colleagues, including one  Republican Senator…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694899/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…want to go back to that one thing. They are still adding  nearly $4 trillion to the national budget to give tax breaks to their  wealthy billionaire friends. When the Republicans passed that bill and  the President signed it into law, 83 percent of the benefits went to  the top 1 percent, adding $2 trillion to the national debt. They are  doubling down…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691417/gop-tax-scam-hurts-everyone"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…Household electricity prices are up across America by about 13 percent  and a lot higher in some places.\n\nWhy is that the case? First of all, the big, ugly bill that  Republicans passed in July to provide tax breaks to the wealthy and  well-connected took away tax credits to keep cleaner, cheaper energy  producing across America. They ripped away rebates…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698279/reliable-power-act"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…across the aisle  simply haven't thought through. There is so much chaos and uncertainty  when the sledgehammer of the CRA is used in this reckless manner.\n\nHouse Republicans already passed, and the administration implemented,  unprecedented giveaways to the coal industry through the One Big  Beautiful Bill Act, including slashing the royalty rates for…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696881/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Jim Costa", "party": "Democrat", "sentence": "…face higher premiums and out-of-pocket  costs. Nationwide, nearly 100,000 American families could lose their  coverage each year if Congress fails to act.\n\nLast year, Republicans passed a partisan bill that failed to renew  the essential premium tax credits, forcing millions of Americans to pay  higher costs this year, even though a bipartisan solution…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698830/putting-americans-first"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…rising costs, this bill locks in devastating cuts to health care and  drives up the cost of health insurance--in many cases significantly.\n\nJust a few months ago the Republicans passed a cruel budget in which  they paid for tax cuts for billionaires by making the largest cuts to  Medicaid and SNAP in history. Now they are continuing their heartless…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696722/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…by President Trump's flagrant  lack of regard for Congress and our laws, and it has not been made any  easier by the unprecedented partisan rescissions package that  Republicans passed last week. But we cannot afford another slush fund,  full-year CR, and we cannot accept the draconian cuts being pushed by  Trump and House Republicans. So we do need…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694203/military-construction-veterans-affairs-and-related-agencies"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…growth rate.  Not only did the CBO take into account the growth rate, but so did  every other think tank that did a budget analysis on the great big,  ugly bill that Republicans passed.\n\nI should also say to the gentleman and to the gentlewoman that many  of these programs have already been halted illegally by the Trump  administration.\n\nJust for the…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692385/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…program, have driven poverty among seniors, for years, to  record lows. The best poverty-fighting program there is: Medicare,  Medicaid.\n\nBut the budget that congressional Republicans passed earlier this  summer, without our votes--again, they didn't listen to us--makes the  biggest cut in history to Medicare and Medicaid. That is right--the  biggest cut…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695910/government-funding"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "Mr. BEYER. Mr. Speaker, earlier this year, House Republicans passed a  bill that strips healthcare from millions of Americans and raises costs  for millions more.\n\nThat was a monstrous bill, but this is a cowardly bill. It does  nothing…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698375/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…lower electric bills. In fact, they are making it worse.\n\nElectric bills are going up for a number of reasons. Let's talk about  it.\n\nThere is the big, ugly bill that Republicans passed in July. That is  projected to raise electricity rates by 61 percent. Why? They took away  a lot of the tax credits to speed cheaper energy onto the grid. They  ripped…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697883/state-planning-for-reliability-and-affordability-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…families across this country right now.\n\nThe only thing Republicans care about is making their fossil fuel  friends even richer.\n\nAll of this comes a few months after Republicans passed their big,  ugly bill. That law will cause Americans' utility bills to go up by  about nearly $300 per year. That is on top of the nearly $29 billion in  electricity…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695693/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Jimmy Gomez", "party": "Democrat", "sentence": "…That is what they are going after.\n\nThey want to intimidate people. They want to intimidate people who  don't agree with them, and that was before Donald Trump and the  Republicans passed the one big, beautiful bill. That included a $175  billion slush fund that would turn ICE and CBP into its own personal  national police force, where he could send it…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697459/fighting-dhs-immigration-raids"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "Mr. McGOVERN. Mr. Speaker, last month Republicans passed a budget  that enables massive cuts that are going to kick people off of food  assistance. Children, seniors, disabled veterans, workers--people who  all rely on SNAP,…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689041/impact-of-proposed-snap-cuts"}, {"senator": "Ron Estes", "party": "Republican", "sentence": "…ESTES. Mr. Speaker, I rise today in support of advancing  President Trump's America First agenda.\n\nIt was less than 2 months ago that I stood on this House floor as  Republicans passed our budget resolution, putting a marker in the  ground to restore and secure our country both physically and  financially.\n\nWhile I don't think this resolution goes far…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689919/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…promises that we have made  to our veterans, our farmers, and our taxpayers.\n\nLet's be honest: This government shutdown was completely avoidable.  On September 19, House Republicans passed a continuing resolution that  funded critical services and would have given us time to negotiate  long-term solutions. It was a yes vote to keep the government open and…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696682/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…of Utah. Mr. Speaker, I thank the gentleman from Georgia  for his comments. I appreciate his thoughts and for articulating much  of that.\n\nMr. Speaker, last year House Republicans passed the working families  tax cuts. This was a reconciliation bill that included monumental  progrowth and profamily legislation that lowers costs for American  families.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699064/how-republicans-have-delivered-for-americans"}, {"senator": "John Thune", "party": "Republican", "sentence": "…would have been facing a big tax hike at the start of this  year. Instead, thanks to the Working Families Tax Cut, Americans will  continue to pay the lower tax rates Republicans passed in 2017. And  that is not all.\n\nIn addition to making permanent the tax relief we passed in 2017,  Republicans have added a number of new tax relief measures to ensure…", "date": "2026-01-05", "source_url": "https://justfacts.votesmart.org/public-statement/1698482/senate-agenda"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…truth about healthcare and insurance companies: If you  don't stop fraud, the chronic high costs will never be cured. In fact,  they are going to get worse. That is why Republicans passed this past  summer strong, anti-fraud protections as part of our Working Families  Tax Cut bill.\n\nOur reforms make it harder to cheat the system. Democrats don't like…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697878/healthcare"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…where Republicans don't want to have the  debate on this floor. They are hiding behind these things they stick in  these rules.\n\nThey actually thought they stopped time. Republicans passed a rule  that stops time for the purposes of voting  on whether or not we should have these tariffs. They actually passed a  rule that said this: ``Each day for the remainder…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690387/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "Mr. ROY. Mr. Speaker, I thank the gentlewoman from Minnesota for  yielding.\n\nMr. Speaker, here we are on September 19, House Republicans passed  legislation which would have funded government through November 20.  Here we are on November 12, and we are basically where we would have  been had we just passed the…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696681/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…leadership  where 8,000 illegal immigrants were apprehended in one day. It is  amazing. Deploying common sense and actually enforcing the law goes a  long way.\n\nHouse Republicans passed legislation like the Laken Riley Act and the  Violence Against Women by Illegal Aliens Act that protect American  citizens. That is what Americans overwhelmingly voted…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688493/america-is-back"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…President Trump has been able to execute effectively  and efficiently.\n\nThe Senate has also acted decisively to secure the border. Within  days of taking office, Senate Republicans passed the Laken Riley Act.  The Laken Riley Act is named after a young nursing student in Georgia.  She was murdered by an illegal immigrant. She was just out for a jog.  We…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688471/joint-session-of-congress"}, {"senator": "John Thune", "party": "Republican", "sentence": "…chain disruptions;  natural disasters and drought; and things like bird flu, African swine  fever, and the New World screwworm that threaten livestock.\n\nJust 2 weeks ago, Republicans passed a reconciliation bill that  addresses many of the challenges head-on by bolstering programs that  farmers and  ranchers depend on. But as I said then, farmers' and ranchers'…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693501/agriculture-appropriations"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…rejected, limited  choice. It has failed. That experiment has failed.\n\nThe only game in town that has actually lowered costs of healthcare,  reduced premiums is what Republicans passed out of the House. There was  not a single Democrat vote to join us.\n\nHere is what I can't understand for the life of me, and I have some  good friends over there, and…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698812/breaking-the-gridlock-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "…legislation that will help  fulfill those promises. That starts with permanent tax relief for hard- working Americans.\n\nBack in 2017, during the first Trump administration, Republicans  passed the Tax Cuts and Jobs Act, legislation that cut Americans' tax  rates, doubled the child tax credit, and nearly doubled the standard  deduction. But without action from…", "date": "2025-07-08", "source_url": "https://justfacts.votesmart.org/public-statement/1693279/one-big-beautiful-bill-act"}]