[{"senator": "Betty McCollum", "party": "Democrat", "sentence": "…for  them. They deserve access to affordable healthcare and nutritious food  for their families. That is what Democrats are fighting for. I wish the  President and Republicans would join us in this fight and share our  priorities.", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696728/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…personally--he would keep his word, and I believe he will. I think we  will have a vote this week, but a vote is not enough if we can't come  to an agreement.\n\nWe need 13 Republicans to join us in a bipartisan effort to extend  this tax credit so that millions of Americans don't lose their health  insurance--13 of them. They need to step forward and, frankly,…", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697576/department-of-defense"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…not committed to allowing a vote on the floor in this body.\n\nLeader Jeffries has a discharge petition open right now to extend the  tax credits, and we just need four Republicans to join us in signing  it.\n\nHouse Democrats have come forward with a plan. Senate Democrats have  come forward with a plan. Senate Republicans have come forward with a  plan.…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697649/restoring-enhanced-premium-tax-credits"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…control here in  Washington.\n\nMr. Speaker, let's understand who is doing you in. It is the people  on the other side of the aisle. It is not too late. All we need are  four Republicans to join us and to show John McCain levels of courage,  not on the battlefield as he did in such an extraordinary way. Yes,  John McCain was an American hero and patriot.\n\nHe…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…more work to do to  hold this administration accountable, including the work Democrats have  been demanding to be part of the DHS funding bill.\n\nWe pushed hard to force Republicans to join us at the table on this  because it is plain as day to Americans across the country that ICE and  CBP have gotten out of control. We have seen with our own eyes how…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699453/appropriations"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…other goods.\n\nThe contrast between what is happening in the House and Senate today  is glaring. In the House, there will be, from what I am told, a good  number of Republicans who will join in saying: Extend the tax credits  for 3 years.\n\nLeader Thune has even refused to put that on the floor.\n\nBut what is happening here? The ability, the strength, the…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698818/venezuela"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…way to give survivors the justice they deserve.\n\nRight now, there is a bipartisan effort in this House to force a vote  on releasing the files. We need only two more Republicans to join us,  two Members who believe their oath to the truth is stronger than their  loyalty to Donald Trump. We need two Members who are willing to live up  to the words they…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695278/jeffrey-epsteins-abuse"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…the Education and the  Workforce Committee once this year and has since taken the most extreme  actions and attacks on public education this country has ever seen.\n\nRepublicans must join me and my colleagues in conducting oversight  for the students in this country. We are living in a time when more and  more Americans don't feel like the American Dream…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698129/dismantling-the-department-of-education"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…United States, should feel secure, not  fearful, when they get sick. They deserve better.\n\nI am fighting to make health care accessible and affordable, and I'm  asking Republicans to join House Democrats in this important work.  We've had weeks to address the rising costs--to consider good-faith  proposals that could prevent pushing millions off a health…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696722/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…Four Republicans joined us last time to pass a resolution blocking  tariffs on Canada because they knew how bad those tariffs were for  people back home. Many more Republicans should join us today as the  disastrous economic consequences of Trump's reckless trade war gets  worse every single day.\n\nIf the Senate passes this bill, Speaker Johnson and…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690523/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…ally to the  north in Canada. It is a step that should have been taken a long time  ago, but Republicans have been blocking this vote.\n\nI just hope that a handful of Republicans will join every single  House Democrat in opposing this rule so we can get to a debate on the  actual substantive effort to stop the reckless, dangerous, and harmful  Trump tariffs…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699898/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…constituents, who know their constituents in red States and districts  will be hardest hit.\n\nWell, now is the time to show it.\n\nMs. BALDWIN. My sincere hope is that the Republicans join me so I can  make this amendment to the continuing resolution and let 22 million  Americans rest easier. I hope my Republican colleagues choose to join  us.\n\nAnd now I…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696658/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "…Republican friends to speak  up.\n\nThere is still time for Republicans to reaffirm to the world that  America does not bow to our foreign adversaries.\n\nThere is still time for Republicans to join with Democrats and remind  Donald Trump that America does not abandon our friends.\n\nFor our future and theirs, we cannot--we must not--betray the  courageous people…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688655/america-still-supports-ukraine"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…None of them are accountable for what they are doing. For the  President to allow them to have access to every American's personal  data is an outrage.\n\nDemocrats and Republicans should join together and do our  responsibility as a separate branch of government and the branch of  government that has control over Social Security to make sure that  these…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695464/condolences-to-the-family-of-charlie-kirk"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…Moore. No one also has called out the fact and reality that at some  point, with some of the larger mandatory spending programs, we are  going to need Democrats and Republicans to join forces to put the  Nation first to solve the problems of sustainability and solvency of  programs like Social Security and Medicare that our seniors depend on  so that…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691961/supporting-the-big-beautiful-bill"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…bad. Make Trump defend those  tariffs.\n\nWhy is he doing this to us? Why is he creating this disaster? This is  a disaster of Trump's own creation. We are seeking four Republicans to  join us to stop this. They already have some Republicans over on the  Senate side. We have some that might be moving here. Let's stop this  craziness of the tariffs.\n\nPelosi),…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690387/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}]