[{"senator": "Stephen Lynch", "party": "Democrat", "sentence": "…so-called CLARITY Act.  I believe this misguided legislation will have devastating impacts on  our financial stability, national security, and investor protection.\n\nWhile my Republican friends claim that this bill will regulate crypto  market structure, in reality, it eviscerates the longstanding history  of investor protections that have made our markets the…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693784/digital-asset-market-clarity-act-of-2025"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…week to set in motion devastating cuts to Medicaid and  SNAP or that, a few days ago, Elon Musk said that Social Security is a  Ponzi scheme. Yet, the other night, my Republican friends stood and  applauded for him like he was Elvis Presley.\n\nThe majority also doesn't want people to remember that the Trump  administration has announced plans to cut staffing…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688632/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…even get into Donald Trump actually being recorded--it is  recorded--asking for 11,800 votes to basically change the results in  Georgia during the 2020 election.\n\nIf my Republican friends want to talk about voter fraud, look in the  mirror.   Johnson).\n\nMr. Speaker, I love the fact that all these guys have are  statistically insignificant anecdotes that…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699941/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…with disabilities.\n\nWe know what this is. This is an attempt to distract from what is  going on behind the scenes here in Washington, D.C. I have to say I  think my Republican friends are out of touch with working people.\n\nPeople are tired of being ripped off by special interests and  politicians in Washington. This resolution is another example of…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689130/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…better than this.\n\nWow, the gentlewoman is defending this process.\n\nI just want to repeat, when I was chairman, I made one out of every  four amendments in order. My Republican friends are making 1 out of  every 50 amendments in order, and 0 bipartisan amendments.\n\nAgain, I don't quite know--well, I guess I do know. I mean, again,  the way the Republican…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692265/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…healthcare for 4 million people. Mr. Speaker, it is your turn to act.  Hold the vote to save healthcare now.\n\nIt is important to point out that the CBO analysis that my Republican  friends keep talking about says that it is going to cost 100,000 people  more every year for healthcare.\n\nHold the vote on the bill that will save healthcare.", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698390/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…poor. They are making a conscious decision to betray their  constituents and sell out their best interests to MAGA billionaires.\n\nAt the end of the day, no matter what my Republican friends say,  because of this budget, more kids will go without food. More kids will  be malnourished. Because of this budget, parents and grandparents will  have to sell their…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689864/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…destroyed resources in our national marine sanctuaries.\n\nHere is what really stinks about this bill: While working American  families are facing an affordability crisis, our Republican friends  prioritize special favors like this for the wealthiest corporations on  the planet. These are companies that could easily afford to just follow  the rules and just pay…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699959/undersea-cable-protection-act-of-2025"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…and the Republican majority were  elected last November to deliver on a simple promise, to lower costs  for Americans. Unfortunately, this budget does not do that.\n\nMy Republican friends have decided that providing billions of dollars  in tax breaks for a few millionaires and billionaires is worth ordinary  Americans bearing, as Elon Musk put it last…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688065/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…I do know this, because I am on the Rules Committee, and I  do know the gentlewoman time and time and time again voted against  releasing the Epstein files. I know my Republican friends are hoping  that they don't have to go on record because they don't want to get  Trump upset at them, but the bottom line is every single Republican  will go on record,…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696693/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…Tax credits that help working people  afford healthcare are vanishing, and Americans are watching  billionaires get huge tax cuts while the cost of living goes up.\n\nMy Republican friends knew that refusing to renew these tax credits  would cause healthcare costs to skyrocket.\n\nMr. Speaker, they decided to cancel work for 2 months and simply  ignored the…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698789/breaking-the-gridlock-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…thank my colleagues who have come to the floor: Senators Durbin, Kim,  Welch, Whitehouse, Hirono, Schiff, and now my great friend and  colleague Senator Booker.\n\nTo my Republican friends, let me just say that there is ample  evidence on the record already to say no to this nominee. But even if  you disagree, what is undeniable here is the point that Senator…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694062/9999"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…Article I, Section 8, of the U.S. Constitution says that it is the  Federal Government and Congress who should coin money and determine the  value thereof. However, our Republican friends tell us that that means  that the Federal Government should be stuck with 1776 technology while  the competitors of the dollar race forward in the 21st century.\n\nThe…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693738/anti-cbdc-surveillance-state-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…President is just how blatant  and erroneous he is doing it, almost daring Republicans to stand up to  him and defend our country--daring Republicans.\n\nSo where are our Republican friends with this kind of egregious,  grubby, awful enrichment? Silence and total obedience.", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690971/qatar"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…making sure that we have a  fair, equitable tax system in which the superwealthy and the  billionaires will pay their fair share. We will not go down the path  that our Republican friends intend to go, and that is to extend the  2017 tax cut law that actually provided more than 85 percent of the  trillions of dollars of benefits of lower taxes that go…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688233/democratic-proposals"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…voice? If this gentle and decent and caring man  is treated this way, what is happening along the margins in the dark  spaces in the places we cannot see?\n\nSo I call on my Republican friends and colleagues to look hard at  this moment and say: What comes next? What comes next? Are we to be at  risk of arrest if we threaten to ask a question or deign to interrupt?…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692447/alex-padilla"}]