[{"senator": "Betty McCollum", "party": "Democrat", "sentence": "…on their energy bills. While most U.S. households spend 3  percent of their income on energy costs, low-income households often  spend 15 percent or more. Under the MAGA Republican plan, many senior  citizens and families would be forced to choose between buying  groceries or cooling their homes during record-breaking heat.\n\nIt could get even worse for…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695056/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Maggie Hassan", "party": "Democrat", "sentence": "…administration and some of my Republican colleagues  are poised to end Medicaid as we know it in order to pay for tax breaks  for corporate special interests and billionaires.\n\nThe Republican plan to eviscerate Medicaid would be devastating to  our country. The Republican plan is, unsurprisingly, short on details.  But they have put forward proposals that, if you…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689509/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "Mr. MERKLEY. Madam President, families lose, and billionaires win.  That is the Republican plan. It is a plan that slashes $1.5 to $2  trillion from programs that families depend on. And why? To fund tax  cuts for the very richest Americans.\n\nBut that is not all…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689508/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…future--all for the sake of tax cuts for the ultrarich.  This is the Republican agenda: Billionaires win; American families  lose. Billionaires win; American families lose in the Republican plan.\n\nRepublicans have failed to be honest with the country about the true  nature of their plans. They have tried to hide their Medicaid cuts.  They have tried to hide their…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689512/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…congratulate the Dubs.\n\nSadly, that is where the good news ends. What we are going to talk  about for the rest of this evening is some bad news, bad for the  American people.\n\nThe Republican plan to extend the Trump tax cuts for billionaire  donors like Elon Musk is a bad deal for the American people.\n\nDuring this Special Order, we are going to lay out exactly…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690628/republican-tax-cuts"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "Mr. REED. Mr. President, well, we are back here again with another  variation of the Trump plan and the Republican plan to do further  damage to our economy and to the working men and women of this country.  It has been sliced and diced and repackaged and unpackaged, but it  still boils…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689546/h-con-res-14"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…hacksaw to  Medicaid, targeting blue States and cities in yet another attempt to  weaponize the Federal Government against the Republicans' political  opponents. This new Republican plan would unleash insurance companies  and shady brokers to push more junk plans that I can tell you aren't  worth the paper they are written on.\n\nAmericans are fed up with…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699115/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…that  covers half of all children and 40 percent of all births, is not how  you persuade women to have more children.\n\nIt is hard to imagine a more antifamily agenda. The Republican plan  pressures women to have more children then abandons them, gutting the  healthcare, education, and support they need to be healthy and to  thrive.", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690416/eliminating-head-start"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…That is a very small percentage of the Federal budget. You can never  achieve what is in this budget resolution on wasteful, woke, and  weaponized policies.\n\nWith this Republican plan, how do they address it? They double down  on the policies that will widen the growing wealth gap of this Nation  by giving billionaires trillions in handouts and providing…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688065/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…decision  they are making. And they are hoping--they are hoping with fingers  crossed--that neither one of them is going to have an emergency next  year.\n\nWell, that is the Republican plan for Laurie and her husband: Just  cross your fingers. Pray that no healthcare catastrophe hits your  family for a year--because they cannot afford $26,000 a year, up from…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697772/healthcare"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…will increase;  Terry, a $1,600-a-month increase; and the Banergee family told me they  are going to see their premium go up by more than $1,600 every single  month.\n\nThe Republican plan: talk about it; do nothing. For all of us who  have been here, we have been waiting for the plan for a long time and  have never seen it--have never seen it. It is always…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696460/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-record-of-decision-for-the-barred-owl"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…While today's bill essentially duplicates existing efforts to prevent  erroneous payments, the focus on improper payments to deceased people  is just another part of the Republican plan to undermine public  confidence in Social Security, a social insurance program that has been  one of the most valuable initiatives ever approved in this Congress.\n\nYet…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698920/ending-improper-payments-to-deceased-people-act"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…negotiate these subsidies over the shutdown,  they said: Don't worry. That doesn't expire until later in the year. We  are working on a plan.\n\nLater is here. What does this Republican plan do to extend the ACA  subsidies? It does nothing. It does absolutely nothing. This is  unacceptable and downright cruel. While I am disappointed that  Republicans refuse…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698373/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…fraud, and abuse. I will talk about a little child in my remarks  who is not waste, fraud, and abuse.\n\nThis Special Order comes together to shine a bright light on the  Republican plan to fund tax breaks for billionaires by making huge cuts  to Medicaid.\n\nThat is what it looks like. The fact is they will still with their  tax bill add nearly $4 trillion…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691417/gop-tax-scam-hurts-everyone"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…roof? That is what is at stake on  the vote this Thursday.\n\nLeader Thune just gave a speech blasting the ACA.\n\nBut, Leader Thune, you blast the ACA; well, where is the Republican  plan?\n\nThe Republicans have no plan. They are so divided between themselves  that they can't even put a plan together.\n\nWe Democrats do have a plan, and it is this bill for…", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697574/department-of-defense"}, {"senator": "Andy Harris", "party": "Republican", "sentence": "…common core math--I know it is popular on that side of the  aisle--you can see that Medicaid expenditures of the Federal Government  go up over the next 10 years with the Republican plan, even after  eliminating fraud, waste, and abuse, which a clear majority of  Americans agree we should eliminate across the Federal Government. We  spend $656 billion…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690515/republicans-are-protecting-and-preserving-medicaid-for-the-truly-needy"}, {"senator": "Andy Harris", "party": "Republican", "sentence": "…Republicans are going to cut  Medicaid.\n\nIt reminds me of what Groucho Marx once said: Who you going to  believe, these claims or your lying eyes?\n\nThis is the graph of what the Republican plan is for Medicaid  spending over the next 10 years. This assumes that we actually get all  the able-bodied, single people without children on Medicaid to agree to  work…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690807/medicaid-rumors"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…are asking the States to do is verify eligibility  and issue payments to protect people in poverty, pregnant women, the  disabled, and children.\n\nMr. Speaker, what the Republican plan is doing is saving Medicare for  the people it was intended to be there for.", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690820/cleaning-up-medicaid-rolls"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "Mr. BARRASSO. Mr. President, I just heard the minority leader come to  the floor and talk about our Republican plan for healthcare, and he  called it ``insulting.''\n\nWhat is insulting is that the minority leader and the Democrats want  to send $83 billion of taxpayer money directly…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697878/healthcare"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…Meeks).\n\nThis bill lowers premiums for Americans, creates more insurance  options, brings greater transparency, and cuts red tape.\n\nUnlike our Democrat friends' plan, our Republican plan actually  lowers premiums by double digits, roughly 11 percent, according to the  data.\n\nAll the Democrats want to do is throw billions more dollars toward  insurance…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698304/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…way, Americans would be paying more taxes  today, not less. The refund checks coming would be smaller rather than  larger, which is what they are going to get with the Republican plan  when they get their tax refunds this year.\n\nEven now, Democrats are still trying to raise your taxes. These  Democrats are trying to undo the very policies that are putting…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700171/state-of-the-union-address"}]