[{"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…designed, and created: to help start  businesses. Now, we have a President who wants to cut that, maybe  because he wants all the money.\n\nWe have a President, supported by the Republican Party, who is  sending in the National Guard and militarizing soldiers against  citizens in those cities and States. They are right here at Union  Station in Washington, D.C.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695040/better-is-possible"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…Review Act was first passed--has always been to  address Agency rulemaking under the Administrative Procedures Act.\n\nWell, the fossil fuel industry pretty much runs the Republican Party  here in Washington. And for a long time, it has objected to California  having clean air standards that many States, including my State,  voluntarily follow because it…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691447/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…way. Republican administrations didn't  always demonstrate such hostility to the environment. At a different  moment in our history, there was a very different kind of Republican  Party.\n\nSo I would like to begin tonight by reading verbatim a message from  President Ronald Reagan. The date was July 14, 1984. The then-President  turned on a microphone…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691582/hj-res-88"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…without  this legislation that we passed today. This is nothing short of a  crisis, and it is a crisis created entirely by the President of the  United States and his Republican Party.\n\nLet me say this clearly to the American people. If you cannot afford  health insurance anymore, you have one person and one party to blame:  Donald Trump and the Republican…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698671/protecting-healthcare-for-millions-of-americans"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…families across this country, and this crisis did not  happen by accident. No, this is manufactured, man-made. It was  manufactured by an occupant of the Oval Office and a Republican Party  that is hell-bent on making families poorer, sicker, hungrier, and less  safe. It is the same party that was content to let these lifesaving tax  credits expire until…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698836/aca-tax-credits-extension"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…He has inserted us into this war with zero thought to the  consequences. We are bombing Iran. Iran is bombing us. The risk of  miscalculation is massive, and the entire Republican Party is just  going along for the ride.\n\nStephen Miller, a top administration official, is on TV talking about  Donald Trump like he is Kim Jong-un. It is creepy.\n\nThe majority…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692813/providing-for-consideration-of-hr-military-construction-veterans-affairs-and-related-agencies-appropriations-act-providing-for-consideration-of-hr-special-interest-alien-reporting-act-of-providing-for-consideration-of-hr-jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-and-providing-for-consideration-of-h-res-condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…feet  of gas to China. At a time when Americans are struggling to pay their  heating bills and our power grids are facing unprecedented demand,  President Trump and his Republican Party care more about subsidizing  China's economic development and basically lining the pockets of their  fossil fuel friends.\n\nRepublicans claim to be obsessed with beating…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697094/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…embarrass him on  a global stage.\n\nCan anyone here imagine Ronald Reagan being played over and over  again by the Russians like this? How about John McCain? How about the  Republican Party before Trump, which has sat quietly month after month  afraid to speak the truth about Vladimir Putin?\n\nIs there anyone in this Chamber who would argue with a straight…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695519/north-atlantic-treaty-organization"}, {"senator": "Ilhan Omar", "party": "Democrat", "sentence": "…politics to point out the hypocrisy on the  other side and to point out people's inconsistencies when their own  party is in charge. Yet, I can't ignore the irony that the Republican  Party has spent my entire life railing about Big Brother when Democrats  want to put simple things like energy standards on appliances.\n\nFor the last 4 years, the majority…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692431/ice-surveillance-and-trump"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…to just kill them.  This was followed by a lackluster apology. It makes me think that maybe  they meant it.\n\nI don't think this is the position of the rightwing or the Republican  Party. What this administration is doing is banning encampments with no  long-term strategy and cutting funding for community services to those  individuals.\n\nOut of sight…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695728/making-homelessness-a-national-priority"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "Mr. MAGAZINER. Mr. Speaker, when we say that the Republican Party has  turned into a cult, this is what we mean. Our Republican colleagues are  pushing a bill that would throw their constituents under the bus, a  bill that flies in the…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693238/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…people apart  on the floor, Democrat and Republican, for doing the same stupid thing  over and over again.\n\nListen to John McCain explain why he voted no the last time the  Republican Party tried to unite and tear down healthcare with no idea  how to fix it and threatening to put millions of Americans in financial  crisis and healthcare crisis.\n\nI can't believe…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…other cuts to higher education to help pay for this.\n\nThe bottom line is, at the end of the day, we are still going to be  adding to the deficit. The deficit hawks in the Republican Party are  adding to the deficit with this measure on top of the deficits that we  are already running today.\n\nThis bill is fiscally irresponsible and outrageously unfair in…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687944/republican-budget-betrays-middle-class"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…mother in our country, and it is absolutely irresponsible and  absolutely unnecessary, except for the role that the oil and gas  industry plays in the politics of the Republican Party.", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690527/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…The SAVE America Act is a terrible bill that makes it harder for  American citizens to participate in our democracy. That is it.\n\nAmerica does not want to be saved by a Republican Party that spent a  year propping up Trump's tariffs, which have driven costs through the  roof. We don't want to be saved by the people who continue covering up  for pedophiles…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699941/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…advocate for more work-from-home policies for our  Federal employees.\n\nI think the American people have spoken loud and clear. They support  our Federal employees, like the Republican Party, but we expect them to  show up for work, not get paid to be home and not be accessible by  phone or by computer or by email.\n\nThat is what we heard from the leader of…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697996/protect-americas-workforce-act"}, {"senator": "Ron Estes", "party": "Republican", "sentence": "…recognized for her service,  most recently receiving the Spirit of Unity Award from the Sedgwick  County Black Republican Council. She has also twice received the Kansas  Republican Party's Huck Boyd Volunteer of the Year Award.\n\nShe has been an integral member of winning campaigns locally and  statewide. She served as the chief of staff for the Kansas…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690554/recognizing-debbie-lupers-tenure-as-district-director-for-the-fourth-district-of-kansas"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "Mr. BERGMAN. Mr. Speaker, today I rise to recognize and honor Camilla  ``Cam'' Williams for her extraordinary dedication, service, and  unwavering commitment to the Republican Party and to our shared  conservative values.\n\nFor well over a decade, Cam has been a faithful Republican precinct  delegate and a constant presence in efforts to support Republican…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695818/recognizing-ms-camilla-cam-williams-for-her-dedicated-service-to-the-republican-party"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…us not  only to understand a different way to handle this but a way that we can  look back and say we have made Washington, D.C., just a little bit  better because the Republican Party cares deeply about Washington, its  success, and, mostly, the safety of the people who live here.\n\nMr. Speaker, I thank the young chairman for allowing me to bring this…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695616/district-of-columbia-judicial-nominations-reform-act"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…Medicaid. I would submit that I  have heard not one syllable from the Democratic Party from 5 years ago  when Joe Biden took power until today protesting that fact. The  Republican Party wants to protect Medicaid and get the 1 million-plus  illegals on it out of the country and off of the program.\n\nMr. Speaker, I mentioned earlier that some of the ridiculous…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690711/outrageous-government-funded-incentives"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…system. Why? Because two parties create  competition, and competition makes all of us better. It does. The  Democratic Party--the opposite of my party, the Republican Party--the  Democratic Party is competing within itself right now, and there is a  distinct wing of the Democratic Party that is winning that competition.  If I wanted to use a pejorative…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695979/government-funding"}, {"senator": "Nicole Malliotakis", "party": "Republican", "sentence": "…the Senate joined President Donald Trump at the  White House to launch the GOP Women's Caucus.\n\nI would remind my colleagues from the Republican side that it was the  Republican Party who helped champion women's rights and protections. It  was Republican Susan B. Anthony who led the suffrage movement. It was a  Republican Senator who sponsored the 19th…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689367/womens-history-month"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…Bruce Westerman,                                                          Chairman.\n\nMr. STAUBER. Madam Speaker, I will make a comment that the Republican  Party will always defend the police, not defund them.\n\nMadam Speaker, I yield 6 minutes to the gentleman from California  (Mr. McClintock), the lead sponsor of this bill.…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693931/law-enforcement-officer-and-firefighter-recreation-pass-act"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "Mr. BARRASSO. Mr. President, the Republican Party has delivered for  the American people. We promised and delivered a country that is safer,  stronger, and more prosperous. That is what we have seen in the last  year.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698252/nominations"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…they wanted to do in retirement, but they met some wonderful friends  and soon became very involved with the Tea Party, the State of  Jefferson, and the Nevada County Republican Party. It was a full-time  passion for both Nancy and Eddie.\n\nEddie joined the Nevada County Fairgrounds Foundation in 2011 as a  director. In 2015, Eddie and Nancy, as well…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697101/highlighting-the-state-of-california"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…back. We are going to protect every woman  and girl, every single daughter in the United States, but particularly  for our servicemembers, our women in uniform. The Republican Party is  the party of common sense. We are the party of normal. We are the party  of women.\n\nMr. Chair, I yield back the balance of my time.\n\nMs. MACE. Are you--", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695260/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…left, I am afraid it won't be.\n\nI am proud to know that I believe every Republican who votes today  will vote ``yes'' on this important measure. That is because it is the  Republican Party, my colleagues with common sense who believe that we  need election integrity in our Nation's Capital. More importantly, we  need election integrity across the country.…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692319/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…of the Avery County Education Foundation, Chairman of Avery County  Impact, a member of the First Baptist Church Crossnore Youth Team,  Chair of the Ingalls Precinct Republican Party, and an active member of  the Avery County Schools Improvement Team. These roles reflect his deep  commitment to education, civic engagement, faith, and the future of…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699450/recognizing-phillip-barrier"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…be more likely to hear  Democrat legislators want.\n\nIn any event, I think we have to follow the negotiations that are  going on, and we have to see whether within the Republican Party we  wind up with a product to encourage more work, encourage families, or  whether we wind up with a bill designed to encourage State governments  to raise the income…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690921/big-beautiful-bill"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "Mr. ROY. Mr. Speaker, today a united Republican Party and a  bipartisan supermajority is going to pass a bill to increase  transparency regarding the egregious abuses by Jeffrey Epstein, a goal  that anyone of conscience…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696812/epstein-files-transparency-act"}]