[{"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…policies that make work and entrepreneurship more  accessible, providing accommodations, tackling ableism, and the list  goes on.\n\nMr. Speaker, to pull this off, our bill would require SBA to conduct  a comprehensive study of the resources that are available to  entrepreneurs with disabilities, examine their effectiveness, and  determine what actions need…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691755/entrepreneurs-with-disabilities-reporting-act-of-2025"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…to be peace. To have peace, there must be justice. To have  justice, we have to at least decide that there are certain things that  we are willing to do. Justice is going to require equal respect for the  lives of all babies--equal respect for the lives of all babies.\n\nI will tell you that I, just as early as this morning, had tears well  in my eyes when…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688271/impact-of-president-on-peace-process"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "Ms. NORTON. Mr. Speaker, today, I introduce the Federal Government  Advertising Equity Accountability Act, which would require all federal  agencies to include in their annual budget requests to Congress the  amount they spend on advertising contracts with small disadvantaged  businesses (SDBs) and…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696333/introduction-of-the-federal-government-advertising-equity-accountability-act"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…clearly, Federal law already prohibits noncitizens from voting  in Federal and State elections. Over 21 million Americans lack easy  access to the documents this law would require for voter registration.\n\nThe SAVE Act would target marginalized communities like those in my  district, and of course impacting people of color, naturalized  citizens, and…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689318/voter-suppression-plain-and-simple"}, {"senator": "Jacky Rosen", "party": "Democrat", "sentence": "…other diseases that we don't even think about anymore on a daily basis.\n\nThat support crosses party lines. In fact, three-quarters of  Republican parents agree schools should require vaccines for measles  and polio, including 73 percent of parents who identify themselves with  the MAGA movement.\n\nEven my Republican colleagues have spoken up about this,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695532/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…experiment with crypto in their operations, including by paying  grantees in stablecoin or crypto. One of Trump's executive orders  leaves the door wide open for Trump to require the use of his  stablecoins and meme coins in order to pay taxes or enter into other  arrangements with the government. This would be just another in a  string of this administration's…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…ambitious public health protections,  they can propose an amendment to the Clean Air Act to change the law  and end the waiver process. No one has proposed this because it would  require hearings and markups and convincing people of the merits of  upending more than 50 years of Clean Air Act precedent, which has been  the most successful public health law…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690480/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…American  military history, Rear Admiral Alene B. Duerk.\n\nAdmiral Duerk was the first woman in the United States Navy to  achieve the rank of Rear Admiral. Our legislation would require the  Navy to rename a naval vessel in her honor.\n\nAdmiral Duerk was born in Defiance, Ohio, raised in Holgate, and  graduated from the Toledo Hospital School of Nursing in…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697052/request-to-name-us-vessel-after-rear-admiral-duerk"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…fight.\n\nPeople expect us to fight even when we can't win. It is not a  question of whether you are going to win, it is will you take a  principled stand. That is what the times require, a principled stand.  Yes, there may be consequences. Don't hurt anyone. Don't destroy any  property. Get in the way, as the Honorable John Lewis put it, whom I  got to know…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690560/a-message-to-the-cabinet"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…great city of  Los Angeles. Yet, even I recognize the importance of getting capital to  our small businesses in rural areas.\n\nI strongly support this legislation, which would require the SEC's  Office of the Advocate for Small Business Capital Formation to report  on capital access issues faced by small, rural businesses.\n\nCurrently, the SEC small business…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692757/expanding-access-to-capital-for-rural-job-creators-act"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "Mr. Speaker, I rise in support of H.R. 1450, the OFAC Licensure for  Investigators Act, sponsored by Representative Beatty.\n\nThis bill would require the Secretary of the Treasury to develop a  pilot program at the Office of Foreign Assets Control, OFAC, by which  private-sector firms like blockchain analytics firms or…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693941/ofac-licensure-for-investigators-act"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…installing security  updates and using multifactor authentication, and Federal Agencies  failing to hold these companies accountable.\n\nThe Federal Government still does not require U.S. phone companies to  meet minimum cybersecurity standards. While it is too late to prevent  the Salt Typhoon hack, there is still time to prevent the next  incident. As…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689978/nomination-of-sean-plankey"}, {"senator": "Sara Jacobs", "party": "Democrat", "sentence": "…that includes all of us, that we can all  belong.\n\nTheir proposed facilities ban is a huge violation of privacy and  would make all women and girls less safe. Will Republicans require  menstrual monitoring, checking reproductive organs, as has happened, as  my colleague pointed out? Girls and women who are tall, strong, and  gender-nonconforming are already…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695241/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "…unfair and  bad policy. Under this bill, if someone is charged with certain crimes,  he will automatically be locked up before his trial. For other crimes,  this bill would require cash bail or bond.\n\nThis will make D.C.'s local law much more strict that even Federal  law. Pretrial release should be based on a judge's determination of  flight risk and…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696980/district-of-columbia-cash-bail-reform-act-of-2025"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…strongly oppose the budget resolution authored by House  Republicans.\n\nShockingly, gutting programs our communities rely on isn't harmful  enough because this resolution will also require taxpayers to borrow  another $1.6 trillion over the next 10 years.\n\nOur Nation's Founders vested in the House of Representatives the  unique set of powers to make it responsive…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688039/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…naloxone or other similar medication to treat opioid,       including fentanyl, overdoses.\n\n(b) Availability.--The updated policy required under       subsection (a) shall require naloxone or other similar       medication be available for members of the Coast Guard--\n\n(1) on all Coast Guard installations; and\n\n(2) in each operational environment.…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692169/controlled-substance-onboard-vessels"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Mr. BILIRAKIS. Mr. Speaker, I move to suspend the rules and pass the  bill (H.R. 859) to require the disclosure of a camera or recording  capability in certain internet-connected devices.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690179/informing-consumers-about-smart-devices-act"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…H.R. 5125, Rules Committee Print 119-      13.\n\nSec. 4.  Upon adoption of this resolution it shall be in       order to consider in the House the bill (H.R. 1047) to       require the Federal Energy Regulatory Commission to reform       the interconnection queue process for the prioritization and       approval of certain projects, and for other purposes.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695524/providing-for-consideration-of-hr-dc-criminal-reforms-to-immediately-make-everyone-safe-act-providing-for-consideration-of-hr-district-of-columbia-policing-protection-act-providing-for-consideration-of-hr-lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia-providing-for-consideration-of-hr-district-of-columbia-judicial-nominations-reform-act-providing-for-consideration-of-hr-guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act-providing-for-consideration-of-hr-national-coal-council-reestablishment-act-providing-for-consideration-of-hr-promoting-cross-border-energy-infrastructure-act-and-for-other-purposes"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "Mrs. WAGNER. Mr. Speaker, I move to suspend the rules and pass the  bill (H.R. 3352) to require the Securities and Exchange Commission to  revise rules relating to general solicitation or general advertising to  allow for presentations or other communication made by…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692725/helping-angels-lead-our-startups-act-of-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "Mr. HILL of Arkansas. Mr. Speaker, I move to suspend the rules and  pass the bill (H.R. 3395) to require the Comptroller General of the  United States to carry out a study of the costs associated with small-  and medium-sized companies to undertake initial public offerings, as…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693907/middle-market-ipo-cost-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "Mr. BOST. Mr. Speaker, I move to suspend the rules and pass the bill  (H.R. 970) to amend title 38, United States Code, to require the  Secretary of Veterans Affairs to periodically review the automatic  maximum coverage under the Servicemembers' Group Life Insurance program  and the Veterans' Group Life…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689629/fairness-for-servicemembers-and-their-families-act-of-2025"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "Mr. WILLIAMS of Texas. Mr. Speaker, pursuant to House Resolution 916,  I call up the bill (H.R. 2965) to require the Administrator of the  Small Business Administration to ensure that the small business  regulatory budget for a small business concern in a fiscal year is not  greater…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697330/small-business-regulatory-reduction-act-of-2025"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…pretty much impossible to deport anybody.\n\nBody cameras, that makes sense. If you want to find out how to make  ICE more professional, count me in.\n\nBut your proposal is to require a judicial warrant to deport  somebody. Can you imagine how many judges you would need if you got 15  million illegal people here, to go get a warrant from a judge? This is…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700070/9999"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…outdated and obstructive government regulations that prevent  and delay new construction. That is why I introduced the bipartisan  Streamlining Rural Housing Act.\n\nThis bill would require HUD and USDA to develop a joint environmental  review process for rural housing projects, cutting red tape and making  rural housing easier to build.\n\nIf we are to help more…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697479/making-homes-affordable"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…within our Conference.\n\nFrequently, Republicans have to go home and explain why they aren't  getting done what they want to get done. It is because the rules in the  Senate require 60 votes to break a filibuster, which means that you  need Chuck Schumer to sign off in order to get almost anything done in  the Senate.\n\nHowever, three times in this 2-year…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694987/calling-for-use-of-reconciliation-process"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…infections that, left untreated, can cause animals to die within 1  week. We do not have vaccinations, unfortunately, to prevent screwworm  infections. So outbreaks in cattle herds require labor-intensive daily  inspections of livestock to make sure they have not been infested.\n\nNow, some may be wondering: That sounds pretty horrific, but what  does it have…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699770/9999"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…perhaps it will soon restore Congress'  exclusive control over tariffs. I certainly hope so.\n\nReasserting Congress' supremacy and the momentous question of war and  peace will require a serious and sober discussion in Congress. When I  hear the hyperbolic and hyperpartisan rhetoric of the Democrats in this  House with their hatred of Donald Trump dripping…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698660/lessons-from-caracas"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…Sec. 4.  Upon adoption of this resolution it shall be in       order to consider in the House the bill (H.R. 22) to amend       the National Voter Registration Act of 1993 to require proof       of United States citizenship to register an individual to       vote in elections for Federal office, and for other purposes.       All points of order against…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689703/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "James Risch", "party": "Republican", "sentence": "…closed to the public on a       motion made and seconded to go into closed session to       discuss only whether the matters enumerated in paragraphs       (1) through (6) would require the meeting or hearing to be       closed followed immediately by a record vote in open       session by a majority of the members of the committee or       subcommittee when…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691700/us-senate-committee-on-foreign-relations-rules-of-procedure"}, {"senator": "Rob Wittman", "party": "Republican", "sentence": "…fourth-order  separates from these main organizations to be able to obfuscate those  connections back to the CCP.\n\nThat is where the bipartisan FACT Act comes in. It would require the  Federal Communications Commission to publish a list of these companies  that hold FCC authorizations and have any ownership by foreign  adversarial governments, including…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690263/foreign-adversary-communications-transparency-act"}]