[{"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…and of  itself may not sound like a lot, but Virginia is also facing a hole  blown in its budget through cuts to Medicaid.\n\nVirginia now is being forced to implement work requirements it  decided not to implement because when it looked at the other States  that did, the administrative costs of the work requirements cost more  than the cost to provide…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691771/151-days-without-a-vote-to-lower-costs"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…does that mean? It means that Republicans plan to cut $900  billion to Medicaid, kicking 8.7 million people off of Medicaid over  the next 10  years. The plan calls for new requirements for beneficiaries, for those  who are on Medicaid, work requirements.\n\nSome say: Well, I don't have a problem with people going to work.  They are also saying: We want seniors,…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691088/big-backstabbing-bill"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…worked together on legislation we had originally  introduced called the Safe Operations of Shared Airspace Act and,  working with him, achieved a date certain for when these requirements  had to be met. We came together to craft that bill because safety is  not a partisan issue, and this bill reflects it. Most of all, I want to  thank the families for their…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698319/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…to state that nothing in this  part may be construed to restrict TANF funding for pregnancy centers,  this bill actually overrides TANF's statutory purposes, reporting  requirements, penalty authority, and HHS enforcement provisions.\n\nAs a result, any future Federal effort to limit condition or review  TANF funding for these crisis pregnancy centers…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699223/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…out and more. We will  be in the strongest possible position to fight for and win the drastic  changes we all know are needed to protect our communities: judicial  warrant requirements, no more detentions or deportations of United  States citizens, an enforceable code of conduct, taking off the masks,  putting the badges on, requiring body cameras, and…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699573/consolidated-appropriations-act-2026"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…already facing a workforce crisis.\n\nLet's talk about what is actually in the Republican proposal. The  majority party wants to impose needless and excessive paperwork  requirements that serve no purpose but to push people off the rolls.  They are importing the worst parts of the private health insurance  industry, needless bureaucratic barriers and…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691329/nearly-one-in-four-delawareans-rely-on-medicaid"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…ICE's formal response  to our visit.\n\nMr. Speaker, let me tell you what the sign said:\n\n``ICE field offices are not detention facilities and fall outside of  the section 527 requirements.\n\n``When planning to visit an ICE facility, ICE asks for requests to be  submitted at least 72 hours in advance. Visit requests should be  submitted during business hours…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692932/holding-power-accountable"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…because of the historic mistake that was made by  both parties to let China into the World Trade Organization without  having an understanding that they should obey the requirements of good  membership in the WTO and not manipulate their currencies. That is not  what President Bush was about.\n\nThen, it went up, of course, during President Obama, down…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695605/devastating-harm-caused-by-trump-administration"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…EGCs. It also makes it  easier for companies to have access to capital by giving them the  ability to gauge interest from institutional investors without added  regulatory requirements of registration.\n\nMr. Speaker, I ask my colleagues to support this bill, and I yield  back the balance of my time.", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692736/encouraging-public-offerings-act-of-2025"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…would hurt working people by       chipping away at existing legal protections meant to protect       workers from harm. They are unnecessary and burdensome new       legal requirements that do nothing to improve working       conditions. We strongly urge you to vote NO on all the above       bills.\n\nIf you have any questions, please contact Sarah Heydemann.…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698964/tipped-employee-protection-act"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…out of four children, 17 million  children nationwide, are excluded from full credit because their family  incomes are too low to qualify. This is not an issue of work  requirements. The current version of the CTC functions as an income  requirement, hurting families who work hard or are retired grandparents  who are now caring for a second generation,…", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691687/providing-for-consideration-of-hr-one-big-beautiful-bill-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…just in it for  himself. In fact, that kind of equipping of the plane will take  billions of dollars of taxpayer money and years of work to bring this  aircraft up to the requirements--the minimal requirements--of Air Force  One, ready in time for the President to use it after he leaves office.  And President Trump won't even pay the transfer fees.\n\nThe…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691071/9999"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…enforcement agencies are easily able to       procure firearms, including ``less-than-lethal projective       devices'' currently classified as firearms, with many       civilian requirements for purchasing firearm--and federal       taxes--being waived. And contrary to a further argument in       support of H.R. 2189/S. 1283, removing ``less-than-lethal…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700033/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…prove they are working.  That is in spite of the fact that the number of nondisabled adults on  Medicaid who don't work is very low--about 8 percent.\n\nHow do these work requirements actually function? Well, in Arkansas,  which is one of the two States that tried this and then pulled it back  because it was a failure, the reporting portal was only open…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693485/one-big-beautiful-bill-act"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…to go out of  business.\n\nI heard from State legislators who wonder how am I going to fill the  hole in my State budget caused by cuts to Medicaid, cuts to SNAP, and  the requirements on States to pay more when I am also trying to fill  the holes in NIH funding and in all the other healthcare funding that  helps me meet the needs of my constituents. How…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695041/better-is-possible"}, {"senator": "Cindy Hyde-Smith", "party": "Republican", "sentence": "…adjusted for inflation as appropriate       and broken down by credentials, experience, and levels of       education of the individual nurses, in accordance with such       requirements as the Secretary may specify;\n\n``(ii) an attestation of the average nursing faculty salary       at the school of nursing during the most recent 3-year period       prior…", "date": "2026-01-27", "source_url": "https://justfacts.votesmart.org/public-statement/1699386/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…United       States, the United Kingdom, and Australia.'' and inserting       ``the United States, the United Kingdom, and Australia. The       congressional notification requirements of subsections (c)       and (d) of section 36 shall not apply with respect to the       export or transfer of defense articles or defense services       subject to the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694783/aukus-reform-for-military-optimization-and-review-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…you, Mr. Speaker, as a family business owner, we would invest  in it. We would not have to be mandated to invest in it.\n\nThis final rule does not even meet the statutory requirements laid  out in ECPA for new or amended energy efficiency standards. With a cost  of at least $8 billion, questions surrounding the  technological feasibility of the standards…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689129/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…I am referring to is the  policy of providing free, full-scope, comprehensive Medi-Cal coverage  to all illegal immigrants in the State who meet the income eligibility  requirements.\n\nThis, again, is a policy that is singular to California. No other  State has it. It was initially estimated to cost $3.1 billion. Since  that time, the cost, just for…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…why has it been unauthorized by this body  for more than 20 years? The reason is it has lost its moorings. It is  wandering around. It hasn't complied with transparency requirements. It  more closely resembles covert political operations designed to entangle  the United States in foreign disputes and undermine diplomatic efforts  than support them.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699047/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "French Hill", "party": "Republican", "sentence": "…(1) that such waiver is in the national interest of the       United States; and\n\n(2) that contains an explanation of the reasons therefor.\n\n(d) Sunset.--This Act and the requirements of this Act       shall have no force or effect on the date that is the earlier       of--\n\n(1) 5 years after the date of the enactment of this Act; or\n\n(2) 30 days after…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699846/pressure-regulatory-organizations-to-end-chinese-threats-to-taiwan-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…Protection and Affordable Care Act (PPACA)       provides premium tax credits to those who purchase private       health insurance plans and meet certain income and other       requirements. Individuals may have the federal government pay       this credit to their health insurance issuers in advance on       their behalf, known as the advance premium tax credit…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698381/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…for commercial and military aviation.\n\nWe are doing that right now.\n\nThe ROTOR Act closes the loopholes that have been described by my  colleagues and strengthens ADS-B requirements for commercial and  military aircraft, among many other things.\n\nIt requires safety reviews of DCA, and it requires better  coordination between the FAA and DOD. I commend…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698321/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…reported widely by The Wall Street  Journal and others? They are openly and knowingly doing it. Why  wouldn't we fix that?\n\nWhy wouldn't we apply eligibility rules and work requirements,  combined with lowering that abusive Federal match rate subsidizing blue  States to game the system when they are using Federal borrowed money to  prop up their weak State…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690594/fiscal-responsibility"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…provider is not liable to a member, a banned member, or a       former member for a claim based on an online dating service       provider's action to comply with the requirements for       providing a fraud ban notification under this subsection.\n\n(b) Enforcement.--\n\n(1) Enforcement by the commission.--\n\n(A) Unfair or deceptive acts or practices.--A…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692730/romance-scam-prevention-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "Mr. WILLIAMS of Texas. Mr. Speaker, I move to suspend the rules and  pass the bill (H.R. 1816) to establish requirements relating to  certification of small business concerns owned and controlled by women  for certain purposes, and for other purposes, as amended.\n\nThe Clerk read the title…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691798/wosb-accountability-act"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…offerings of not fewer than 400,000 acres.\n\nCongress left little discretion to DOI. DOI's role was only to  establish and administer a competitive program and incorporate TCJA  requirements to instill success and economic feasibility, including  granting any easements or rights-of-way across the Coastal Plain for  exploration, development, production, and transportation…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697739/9999"}, {"senator": "James Risch", "party": "Republican", "sentence": "…Relations Committee, room SD-423.\n\nHon. Mike Johnson,      Speaker of the House, House of Representatives,      Washington, DC.\n\nDear Mr. Speaker: Pursuant to the reporting requirements of       Section 36(b)(1) of the Arms Export Control Act, as amended,       we are forwarding herewith Transmittal No. 25-49, concerning       the Air Force's proposed Letter(s)…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696549/arms-sales-notification"}, {"senator": "James Risch", "party": "Republican", "sentence": "…Committee, room SD-423.\n\nHon. James E. Risch,      Chairman, Committee on Foreign Relations,      U.S. Senate, Washington, DC.\n\nDear Mr. Chairman: Pursuant to the reporting requirements       of Section 36(b)(1) of the Arms Export Control Act, as       amended, we are forwarding herewith Transmittal No. 25-88,       concerning the Army's proposed Letter(s)…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695912/arms-sales-notification"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…instruct Agencies not to undertake certain activities that  would waste taxpayer dollars and impose burdens, like the regulation of  lead tackle and greenhouse gas reporting requirements for farmers and  livestock producers.\n\nWe also provided funds for America250. I mentioned that the Interior  Subcommittee has oversight of the arts, whether it is the national…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699014/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}]