[{"senator": "Dianne Feinstein", "party": "Democrat", "sentence": "If you wish to begin preparing your application, you can download a sample form to see the information that will be requested from you."}, {"senator": "Debbie Stabenow", "party": "Democrat", "sentence": "Representatives Dan Kildee (MI-05), Debbie Dingell (MI-12), Brenda Lawrence (MI-14), Elissa Slotkin (MI-08), Andy Levin (MI-09), Haley Stevens (MI-11) and Rashida Tlaib (MI-13) -- wrote to Air Force Secretary Barbara Barrett requesting that the Air Force prioritize Wurtsmith Air Force Base and key former military installations in Michigan."}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "We also respectfully request responses to the following questions: \n\n1."}, {"senator": "Doug Jones", "party": "Democrat", "sentence": "Dear President Trump:\n\nWe write to echo the request of America's coal miners by urging the Mine Safety and Health Administration (MSHA), the federal government's principal agency directed to prevent mine illness, injury, and death, to exercise its authority to issue emergency standards to safeguard miners as the nation continues to grapple with the COVID-19 pandemic."}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "Department of Education's (\"Department\") continued backlog of federal student loan discharge requests under \"borrower defense\" and the Department's ongoing efforts to dismantle debt relief for students who have been cheated, misled, or defrauded by colleges or been displaced by a closed school."}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "According to these reports, USCIS received the man's request for a reasonable accommodation and his optometrist's certification of his 100 percent visual impairment before his appointment."}, {"senator": "Tina Smith", "party": "Democrat", "sentence": "Dear Secretary Pompeo:\n\nI am writing to request that the U.S."}, {"senator": "Richard J. Durbin", "party": "Democrat", "sentence": "Durbin asked Azar about an HHS Inspector General investigation, requested by Senators Durbin and Murray and 39 other Senate colleagues, which found that thousands of additional children had been separated by the Trump Administration before the zero-tolerance policy was made public, and that the total number of children forcibly removed from their parents was unknown."}, {"senator": "Benjamin L. Cardin", "party": "Democrat", "sentence": "Dear Administrator Wheeler:\n\nWe are writing to request specific information on how the U.S."}, {"senator": "Dianne Feinstein", "party": "Democrat", "sentence": "Senator Dianne Feinstein (D-Calif.) today wrote a letter to the Department of Health and Human Services requesting information on steps the department is taking to protect the country from global pandemics."}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "Every yearthe requests for WAP support far exceed the funds available, leaving many households withoutthe support they need to improve their energy efficiency and reduce energy costs."}, {"senator": "Richard J. Durbin", "party": "Democrat", "sentence": "Durbin also joined a group of 30 Senators in sending a letter to Environmental Protection Agency (EPA) Administrator Andrew Wheeler requesting he provide an updated timeline for when the EPA will implement commitments made in the agency's plan to combat exposure to PFAS."}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "The Trump administration just requested that some of these attorneys  temporarily come back to work this week to clean up the mess that the  administration caused, but students and their families have already  paid the price."}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "Dear Inspector General Horowitz:\n\n            We write to request that you investigate an apparent pattern of political interference in Justice Department matters of personal or political interest to the President."}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "Their loved ones, the Fort Stewart community, and  all those impacted by this tragic loss of life have been in our  prayers, and we humbly request that they be in yours, as well."}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "Following requests from bipartisan members of Congress, including Senate Finance Committee Chairman Chuck Grassley (R-Iowa), the Treasury Department today modified its decision to bar employers that continue providing health insurance to furloughed workers from claiming the employee retention tax credit (ERTC)."}, {"senator": "James Lankford", "party": "Republican", "sentence": "We thank you for your careful consideration of this request and look forward to working with the Commission to ensure that this funding will go to the places that need it the most."}, {"senator": "James Lankford", "party": "Republican", "sentence": "Senator James Lankford (R-OK) today questioned Secretary of Education Betsy DeVos at a Senate Appropriations Committee hearing on the President's budget request for the Department of Education for fiscal year 2021 (FY2021)."}, {"senator": "Mitch McConnell", "party": "Republican", "sentence": "The measure requires the USACE, at the request of a Kentucky landowner, to forfeit any rights the government has to certain residential properties at Rough River Lake, and authorizes $10 million in funding for necessary work to extinguish these rights."}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "Cruz sent a letter to Jovita Carranza, Administrator for the Small Business Administration (SBA), requesting access for Chambers of Commerce and other 501(c)(6) organizations to the PPP."}, {"senator": "Josh Hawley", "party": "Republican", "sentence": "Since the outbreak began, he has also called for the United States to consider restricting all commercial travel to and from China and requested federal agencies outline their plans on when and how to implement travel restrictions."}, {"senator": "Mike Rounds", "party": "Republican", "sentence": "The White House has requested funds to help deal with COVID-19."}, {"senator": "John Kennedy", "party": "Republican", "sentence": "On behalf of the nonprofit charities in each of our districts providing critical services to our constituents, we appreciate your attention to this request and believe that the inclusion of these provisions will directly help charitable nonprofits respond to the fallout from this pandemic and will continue to serve our communities in the aftermath."}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "Consider the recent controversy over DOGE's request that Federal  Government employees account for what they did that week, as I  mentioned earlier."}, {"senator": "David Schweikert", "party": "Republican", "sentence": "Then if we were to take care of the President's requests,  that is another $8 trillion, functionally saying we will borrow more in  this 10-year period than we did in the previous 240 years."}, {"senator": "Steve Daines", "party": "Republican", "sentence": "I'm glad the Small Business Administration acted on my request to help Montana workers.\"\n\n\"Small businesses across Montana have been shut down as we confront the coronavirus outbreak, and the Paycheck Protection Program has been a critical lifeline to Montana workers and small businesses,\" Gianforte said."}, {"senator": "James E. Risch", "party": "Republican", "sentence": "(iii) Description and Quantity or Quantities of Articles or       Services under Consideration for Purchase: The Government of       Australia has requested to buy long lead items, engineering       development activities, and other defense services to support       the Australian Surface Combatant Program, including the       modernization of three Hobart Class Destroyers, and       construction of the first three (of nine total) Hunter Class       Frigates."}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "Speaker, I have no further requests for time."}]