[{"senator": "Jack Reed", "party": "Democrat", "sentence": "…making has never been higher. Our troops deserve better--much  better.\n\nThis War Powers Resolution would restore that balance. It reaffirms  that the Constitution has always required that decisions of war and  peace belong to the legislature, not the Executive.\n\nMr. President, for that reason, I urge my colleagues to support this  resolution and to reassert…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696129/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…weakens the protections because it  would permit employers to provide job-related training after hours but  off the clock so long as they do not state that it is technically  required.\n\nHowever, employers can still lead workers to believe that the  training is needed. You can just imply that if you want a raise or  promotion, it would be nice to get the…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698955/flexibility-for-workers-education-act"}, {"senator": "Jon Ossoff", "party": "Democrat", "sentence": "…this bill mandates  specific funding levels for rural health, women's health, caregivers,  research, and veteran homelessness prevention programs, in some cases,  including required spending levels for those programs for the first  time in legislative history.\n\nIt also provides funding for the VA to address the claims backlog  related to toxic exposures…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694129/9999"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…and the public alike.\n\nUnlike in the past, OMB has refused to make the apportionments for  the accounts at issue available to the Government Accountability Office  for their required review under the Impoundment Control Act of 1974. In  its report to Congress on the June 3, 2025, special message proposing  these rescissions, the Government Accountability…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694158/senate-amendment-to-hr-4"}, {"senator": "Greg Casar", "party": "Democrat", "sentence": "…Ethics of the House of  Representatives a report indicating that there was substantial reason  to believe that Representative Cory Mills may have omitted or  misrepresented required information in his financial disclosure  statements, accepted excessive contributions to his campaign committee  in the form of personal loans and contributions that may not…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695580/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…cut funding contracts within the  Department that support data collection, learning tools, and programs  to increase test scores.\n\nMrs. McMahon does not have the experience required to support the  more than 62 million students in their elementary to postsecondary  education across the country. Mrs. McMahon has no experience teaching  or working in a…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688592/confirmation-of-linda-mcmahon"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…administration to run roughshod  over the very concept of safety, repealing numerous rules designed to  protect our communities and workers, and even withdrawing the rule that  was required by law that President Trump himself signed.\n\nThis bill, Mr. Speaker, and other energy bills we considered this  week out of the Committee on Energy and Commerce are not a…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698067/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…to hurt people or that is  actually going to cost them more money.\n\nThe bottom line is and the way this works is that the Department of  Energy, under the existing law, is required to look at appliances and  see whether or not they can be made more efficient and more cost- effective. That is what they did. They found that these standards were  more efficient…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689127/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…Instead, it continues to restrict access to the ballot  box, imposing a modern-day poll tax and a dangerous show-your-papers  mandate.\n\nUnder this bill, Americans would be required to appear in person or  by mail, just hoping that the elections clerk accepts their  documentation, and present either a passport or a birth certificate to  register to vote,…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699996/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…bipartisan way. I hope we will continue to work together to make sure  that the National Cemetery Administration is given the resources it  needs and the personnel that are required to make sure this Nation  honors our veterans.\n\nAs we speak, members of that workforce, the National Cemetery  Administration, have been fired or are being fired or will be…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691275/9999"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…notice-and-comment procedures for       matters relating to public property, loans, grants, benefits,       or contracts and not requiring such procedures unless       otherwise required by law. The Policy Statement further       states that ``the good cause exception should be used in       appropriate circumstances in accordance with'' APA       requirements…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694840/government-accountability-office-legal-opinion"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…profiting off crypto at the  expense of American families in his crypto legislation. That is all I  asked for.\n\nUnlike other hearings in Congress, this one was different. It  required every Member--Democrat and Republican--to agree to hold this  hearing. Well, I had to think whether I could agree to this hearing if  there wasn't a commitment to address…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Council or not  every 2 years. Instead, CSRIC must become a permanent fixture at the  FCC.\n\nH.R. 1717 requires the FCC to do just that. Under this bill, the FCC  would be required to establish a permanent council to advise the agency  on the security, reliability, and interoperability of communications  networks within 90 days. This Council would include…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693434/communications-security-act"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…care for Dylan, whom  Randi loves so much. Medicaid covers the costs and his critical  prescription medications.\n\nAnd then there is Theresa, who recently lost her job, and required  urgent medical assessments due to a medical issue that was discovered  by her doctor.\n\nDuring what was a difficult time where you go to the doctor and the  doctor discovers…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…from disrupting social media and       automotive industries to targeting the federal government       itself.\n\nThe indignities were swift and demoralizing. We were       required to provide weekly accounts of ``five things'' we       accomplished, as though our decades of service meant nothing.       They dictated what we could use in our email signatures…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694772/president-trumps-attack-on-the-federal-workforce"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…April 5,  2025, the Senate amended and adopted H. Con. Res. 14, and on April 10,  the House agreed to the amended resolution without changes. As such, I  am submitting the required filing.\n\nSpecifically, section 4002 of the fiscal year 2025 congressional  budget resolution requires the chairman to file an allocation for  fiscal year 2025 for the Committee…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691578/fiscal-year-2025-enforcement-filing"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…Massie-Khanna piece  of legislation that my colleagues on the other side want. It gives us  the ability to subpoena banking records, estate files, and depositions,  none of which are required in the Massie bill.\n\nFurther, I find it interesting, because ours is a resolution that  gives the endorsement of the House, gives more power in the oomph  behind the Oversight…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694880/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…functions vested in or subject to the approval of       the President); and\n\n(2) with respect to which--\n\n(A) a covered entity holds an equity or voting interest       that is required to be reported to the Commission under the       ownership rules of the Commission; or\n\n(B) an appropriate national security agency has determined       that a covered entity…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690265/foreign-adversary-communications-transparency-act"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…resources that are essential to the daily lives of the hardworking  Americans as well as a linchpin to the next-generation economy.\n\nThese resources, Mr. Speaker, are absolutely required in virtually  everything we need to compete as well as defend our country from  foreign threats: semiconductors, nuclear reactors, oil and gas  infrastructure, the transmission…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699990/securing-americas-critical-minerals-supply-act"}, {"senator": "Byron Donalds", "party": "Republican", "sentence": "…milestone for fish and wildlife conservation. Statewide action  plans serve as a vital blueprint for identifying the unique  conservation needs of each State and territory and are required for  States to take part in the State and Tribal Wildlife Grant program.\n\nThese plans play a leading role in helping to prevent and recover  endangered species and guide the…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697625/make-state-wildlife-action-plans-efficient-act-of-2025"}, {"senator": "Andy Ogles", "party": "Republican", "sentence": "…This amendment provides clarity and ensures that any U.S. college or  university entering into a contract with or receiving a donation from a  section 1260H list company is required to first receive a section 117A  waiver from the Department of Education.\n\nAgain, the reporting threshold for foreign entities of concern is  zero, meaning that a gift or…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689026/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…which is implemented pursuant  to what we refer to as resource management plans, or RMPs.\n\nThese RMPs are designed to maximize resource values for the public.  The BLM is required to comply with a multiple use mandate, ensuring  that these combination of uses meet current and future needs of the  American people.\n\nIn its waning days, the Biden administration…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696878/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Membership means the ongoing state of being qualified       to use the fitness facilities by meeting the criteria to be       an eligible senator or staffer and paying the required       membership fee.\n\n2.8 Membership fee means the monthly or annual payment made       to maintain a fitness facilities membership.\n\n2.9 Rules Committee means the U.S. Senate…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690978/us-senate-health-and-fitness-facilities-regulations"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…section 3(b) are authorized to       erect upon the Capitol Grounds such stage, sound       amplification devices, and other related structures and       equipment, as may be required for the Memorial Service and       Exhibition.       SEC. 5. ENFORCEMENT OF RESTRICTIONS.          The Capitol Police Board shall provide for enforcement of       the restrictions…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689661/authorizing-the-use-of-the-capitol-grounds-for-the-national-peace-officers-memorial-service-and-the-national-honor-guard-and-pipe-band-exhibition"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…sections 231 and 235 of the Countering America's Adversaries       Through Sanctions Act (22 U.S.C. 9525 and 9529).\n\n(b) Form and Availability.--\n\n(1) Form.--The report required by subsection (a) shall be       submitted in unclassified form, but may include a classified       annex.\n\n(2) Availability.--The unclassified portion of the report…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690679/economic-espionage-prevention-act"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…entity.''; and\n\n(B) by amending paragraph (5) to read as follows:\n\n``(5) Direct funding.--If an eligible entity does not make       a distribution to a local government required under paragraph       (2) within       60 days of the anticipated grant disbursement date, such       local government may petition the Secretary to request the       Secretary…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696787/protecting-information-by-local-leaders-for-agency-resilience-act"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…I thank the previous speakers for their  kind words and assistance on this bill. I also will address the Fair  and Accountable IRS Reviews Act.\n\nFor decades, Federal laws required that before the IRS can impose  penalties on a taxpayer, an agent must first receive written approval  from that agent's immediate supervisor.\n\nCongress put this safeguard…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697249/fair-and-accountable-irs-reviews-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…with application procedures       established by the Secretary.''.\n\n(b) Fees and Schedules.--Section 9(c) (16 U.S.C. 973g(c))       is amended to read as follows:\n\n``(c) Fees required under the Treaty shall be paid in       accordance with the Treaty and any procedures established by       the Secretary.''.\n\n(c) Minimum Fees Required To Be Received in Initial…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691006/south-pacific-tuna-treaty-act-of-2025"}, {"senator": "Kevin Hern", "party": "Republican", "sentence": "…of programs and  urging schools to consider the threat they may pose to academic  freedom. The State Department found that approval from the PRC's  Minister of Education is required when filling teaching positions  associated with Confucius Classrooms.\n\nConcerns over the threat posed by Confucius Classrooms are not always  exclusive to the United States.…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697531/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Hugh consistently  attends meetings to keep us updated on new laws and changes affecting  his community. He pursued certification as a Homeowner Board member  before it was required by the state. Regardless of the issue, he  remains positive and works towards reasonable resolutions, even while  facing medical challenges. Beyond his own community, Hugh…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692162/recognizing-hugh-townsend"}]