[{"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…concerning provisions buried in it over the coming weeks.\n\nBut today, I want to focus on section 60002 of the so-called ``One  Big Beautiful Bill Act,'' which repealed and rescinded all unobligated  funds from the Greenhouse Gas Reduction Fund. There has been some spin  put on this section, including in court filings. And so I aim to fix  some misconceptions,…", "date": "2025-07-09", "source_url": "https://justfacts.votesmart.org/public-statement/1693322/greenhouse-gas-reduction-fund"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…is not even necessary.\n\nWhy do my Republican colleagues need to take up our valuable floor  time here debating a rule that their friends in the administration have  already rescinded? They just returned from a 53-day, taxpayer-funded  vacation, canceled 5 weeks of votes, and still have a long to-do list  before the end of the year. That list, I hope,…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696836/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision"}, {"senator": "Mike Levin", "party": "Democrat", "sentence": "…been  wiped out or delayed. Projects capable of powering roughly 13 million  homes have been canceled or frozen. Clean energy tax credits are under  attack. Grants have been rescinded. Permitting for wind and solar has  been effectively paused. Billions of dollars in private investment are  sitting idle because Federal policy has injected uncertainty into…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700230/winners-of-the-global-energy-race-are-being-decided"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…than a year, only causes  harm and disparages them. That is why I was so proud to lead a letter  with my Washington colleagues calling for Forest Service terminations  to be rescinded and for the administration to halt any further cuts.\n\nThis has disproportionately hit Washington State. I will continue  fighting for the employees in my district, for the…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689811/cuts-to-forest-service-endanger-millions"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "…ROSS. Mr. Speaker, I rise today to join millions of American  women in condemning Trump's attempt to gut funding for women's health  research.\n\nThe Trump administration has rescinded women's research projects at  an alarming rate. These projects include lifesaving research on early  breast cancer detection and so much more. Trump even shut down the  Women's…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690578/protecting-womens-health-research"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…funding for community health centers in our country.\n\nNo. 40, ordered the suspension of EV charging funding.\n\nNo. 41, tried to rename the Gulf of Mexico.\n\nNo. 42, illegally rescinded $80 million in congressionally  appropriated FEMA funding for New York City bank accounts.\n\nNo. 43, fired--and then rehired--over 300 staffers at the National  Nuclear Security…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690442/trump-administration-first-100-days"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…adversaries to fill in the role the United States has abandoned.\n\nThree, created the so-called Department of Government Efficiency,  DOGE, which has imposed payment holds and rescinded funds after  disbursement. Donald John Trump has utilized DOGE to unlawfully block  or impound appropriated funds to dozens of Federal agencies, including  the National Institutes…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691079/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…contraceptives were intended for people in  poor countries with high rates of morbidity and mortality for pregnant  women, infants, and children.\n\nJust 1 day later, the spokeswoman rescinded her previous statement,  claiming that there had been a ``miscommunication'' and that the  contraceptives in question had not yet been incinerated. This was  confirmed by…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696465/womens-health"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…don't  want these agencies eliminated because they actually play a major role  in helping people with mental and behavioral health problems.\n\nThe Trump administration has rescinded over a billion dollars from  State and local behavioral health programs under mental health and  substance use block grants. This is the money that goes back to the  States,…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691876/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…successfully halted.\n\nIn February, over a dozen religious organizations filed a lawsuit.  These organizations sued the Department of Homeland Security after the  administration rescinded guidance that would prevent immigration  enforcement in sensitive locations, like schools, hospitals, and houses  of worship.\n\nMr. Speaker, you could be praying at a church…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690851/opposing-illegal-power-grabs"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…providing the  Department with new authority to move funds absent Congressional  approval should be a non-starter for the Appropriations Committee. This  provision must be rescinded in the Defense Appropriations Act.\n\nAs the Ranking Member of the House Appropriations Subcommittee on  Defense, I completely agree that the United States must maintain a…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698005/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…Project 2025. Some tried to warn us of the dangers  and, well, here we are.\n\nLet's talk about education. Within weeks of taking office, the  Department of Education quietly rescinded guidance encouraging schools  to teach honest, inclusive Black history. Instead, they are attempting  to whitewash history and have begun promoting so-called patriotic  education,…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690636/trumps-first-100-days"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…entity as systemically  important, however, have been controversial and short-lived. In 2013  and 2014, FSOC designated four nonbank firms, but those designations  were later rescinded following legal challenges, corporate  restructuring, and policy shifts across administrations.\n\nSince its creation, Congress and administration officials have  debated whether…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699823/financial-stability-oversight-council-improvement-act-of-2025"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "…Biden took steps to prevent the remote access of U.S.  chips by our adversaries in his Artificial Intelligence Diffusion Rule.  That rule is not perfect, but President Trump rescinded it and failed  to replace it with any new policy framework.\n\nThanks to Donald Trump repealing the rule, there are currently no  clear or consistent safeguards in place to…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698860/remote-access-security-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…respective agency buildings in D.C.\n\nIn 2022, President Biden issued an executive order (E.O.) requiring  federal law enforcement agencies to use body cameras. President Trump  rescinded this E.O.\n\nI urge my colleagues to support this legislation.", "date": "2025-08-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694762/introduction-of-the-federal-police-camera-and-accountability-act-of-2025"}, {"senator": "John Thune", "party": "Republican", "sentence": "…have threatened the viability of a  number of South Dakota nursing homes. The Biden staffing mandate was  unworkable in my State and many others. The One Big Beautiful Bill  rescinded it, ensuring South Dakota nursing homes can continue serving  our residents.\n\nThere is a lot more I could talk about that we have accomplished for  South Dakota this year.…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698212/senate-accomplishments"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…is the statute that we are invoking here to invalidate this  Biden-era regulation.\n\nThe gentlewoman from California says that: This is a waste of time.  The Trump OCC has rescinded the rule. We don't need to do this. I would  remind the gentlewoman from California the reason why we need to do  this. The reason why we are invoking the provisions  of…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691498/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…this resolution, the House       shall be considered to have taken from the Speaker's table       the bill (H.R. 4) to rescind certain budget authority       proposed to be rescinded in special messages transmitted to       the Congress by the President on June 3, 2025, in accordance       with section 1012(a) of the Congressional Budget and       Impoundment…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693717/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…Resolved, That upon adoption of this resolution it shall be       in order to consider in the House the bill (H.R. 4) to       rescind certain budget authority proposed to be rescinded in       special messages transmitted to the Congress by the President       on June 3, 2025, in accordance with section 1012(a) of the       Congressional Budget and Impoundment…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692391/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…Committee on Financial Services or their       respective designees; and (2) one motion to commit.\n\nSec. 9.         4) to rescind certain budget authority proposed to be       rescinded in special messages transmitted to the Congress by       the President on June 3, 2025, in accordance with section       1012(a) of the Congressional Budget and Impoundment…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693544/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…repealed and the unobligated       balances of amounts made available under those sections (as       in effect on the day before the date of enactment of this       Act) are rescinded.\n\n(b)(1) Section 71107 of the Act titled ``An Act to provide       for reconciliation pursuant to title II of H. Con. Res. 14''       (Public Law 119-21) is repealed and…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699590/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…continue good stewardship  of hard-earned taxpayer dollars. Families in Kansas must make tough  choices every day, and they expect their government to do the same.  Last year, we rescinded $9.4 billion in waste, fraud, and abuse found  in Federal programs, such as funding for Iraqi ``Sesame Street,''  electric buses in Rwanda, and LGBTQ programs in Uganda.…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698651/following-through-on-americans-priorities"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…from disclosure under that section, that document or       information, as the case may be, shall not be subject to the       requirements under this Act.       SEC. 6. RESCINDED GUIDANCE DOCUMENTS.\n\nOn the date on which a guidance document issued by an       agency is rescinded, or, in the case of a guidance document       that is rescinded pursuant…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688391/guidance-out-of-darkness-act"}, {"senator": "Ryan Zinke", "party": "Republican", "sentence": "…is.\n\nThen, oh, Deb Haaland--I respect Deb Haaland. I had her in committee,  Mr. Speaker. I asked her one question after a few: What minerals were  in the mine area which she rescinded and put a moratorium on? I was  amazed at her answer. She couldn't name one. So let's follow the  science.\n\nI agree. There is a place to mine, and there is a place not to…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699276/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "David Rouzer", "party": "Republican", "sentence": "…comply with this rule would be four times  what EPA has suggested: 100 million in capital costs and $20 million in  other annual costs.\n\nMadam Speaker, this regulation must be rescinded. We must reinstate  common sense. Rubber tire manufacturing facilities have complied with  the existing standards, and keeping this rule in place would bring  economic harm…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688526/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "Mrs. McCLAIN. Mr. Speaker, pursuant to House Resolution 499, I call  up the bill (H.R. 4) to rescind certain budget authority proposed to be  rescinded in special messages transmitted to the Congress by the  President on June 3, 2025, in accordance with section 1012(a) of the  Congressional Budget and Impoundment Control…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692534/rescissions-act-of-2025"}]