[{"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…proposing to literally eliminate the vast majority of SAMHSA, which is  the mental health program for this country, in the fiscal year 2026  budget. They just transmitted a rescission package to this Chamber last  night that would cut billions of dollars in public health assistance  for starving children and people suffering from AIDS and preventable  infectious…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691917/reconciliation"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…communications are now under attack by congressional Republicans  and the White House.\n\nSenate Democrats are sounding the alarm and leading the charge to  stop this dangerous rescission package before it harms families,  communities, and the public broadcasting that they all rely on. From  the moment we wake up to the time we turn in at night, New Mexicans…", "date": "2025-07-09", "source_url": "https://justfacts.votesmart.org/public-statement/1693299/9999"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…integrating into American life.\n\nThe practice of American religious organizations assisting in legal  immigration goes back more than a century, and President Trump's  rescission package that is before us wipes out funding to a dramatic  degree for virtually all of them.\n\nHebrew Immigrant Aid Society has had to lay off hundreds of staff.\n\nWorld Relief…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693592/rescissions-act-of-2025"}, {"senator": "Valerie Foushee", "party": "Democrat", "sentence": "Mrs. FOUSHEE. Mr. Speaker, I rise today in opposition to Trump's  rescission package, which includes an unfathomable $8.2 billion cut to  USAID funding.\n\nMy home State of North Carolina is the fourth largest recipient of  USAID funding, which invests…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692405/trump-rescissions-request-and-usaid-cuts"}, {"senator": "Laura Gillen", "party": "Democrat", "sentence": "Ms. GILLEN. Mr. Speaker, I rise today to address the cruel rescission  package that passed the House strictly on partisan lines.\n\nLet me be clear: This legislation is a shameful, backwards attempt to  cancel $9.8 billion in funding that had already…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692564/rescission-package"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…While Republican leadership is busy playing procedural games trying  to slip this through, let's talk about what they are attaching this  rewrite to.\n\nThe Republican rescission package is based on a scam, a con job, and  a grift. This is not about actual savings, nor is it about rooting out  waste, fraud, and abuse. This is based on cementing stupid,…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692385/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…it is publicly funded.  Just like public broadcasting should be objective, so should the  funding decisions about it.\n\nMr. Speaker, I urge my colleagues to reject this rescission package.                      IRA Clean Energy Incentives Defense\n\nMs. BONAMICI. Mr. Speaker, in their big, ugly bill, Republicans are  once again trying to rip away clean energy…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692414/rescissions-package-corporation-for-public-broadcasting"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "Ms. STANSBURY. Mr. Speaker, I rise today to oppose this harmful,  shameful, and offensive rescission package.\n\nThe GOP is canceling $9.4 billion, yes, billion, in funding for  programs that fund lifesaving work across the world. It is funding for  public television and public…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692386/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…dominate the future,  commerce, connectivity, and development.\n\nThis is not just cruel. It is strategically self-defeating and  economically foolish.\n\nMake no mistake, this rescission package is Project 2025 in action-- dismantling our institutions, silencing oversight, and handing U.S.  global leadership over to the dictators on a silver platter, leaving…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692541/rescissions-act-of-2025"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…the building. Yet,  unfortunately, his legacy of chaos and corruption lives on. The zombie  of DOGE lurches on here in the House with the delivery of a $9.4  billion rescission package to make those cuts permanent, a fiscal year  2026 budget delivered in front of the Committee on Appropriations to  eviscerate Federal programs, and, yes, the disgusting…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691867/zombie-of-doge-lurches-on"}, {"senator": "Robin Kelly", "party": "Democrat", "sentence": "Ms. KELLY of Illinois. Mr. Speaker, I rise in opposition to President  Trump's rescission package that steals $400 million from PEPFAR, a  lifesaving global health program.\n\nLet me remind my colleagues that PEPFAR is a bipartisan effort first  led by Congresswoman…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692543/rescissions-act-of-2025"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…House is finally doing what the American  people have demanded for years. We are cutting wasteful spending and  restoring fiscal sanity.\n\nThis week, we are voting on a rescission package sent by President  Trump to eliminate $9.4 billion in reckless spending. That includes $3  million for Iraqi Sesame Street, $500,000 for electric buses in Rwanda,  and…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692312/recognizing-new-freedom-farm-and-lois-mcgill"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…you can't lower spending.''\n\nLet's see if we can do this. How many hours are there in a year?  There are 8,700 hours in a year. Work with me on this, Mr. Speaker. The  rescission package takes care of 28 hours of that 8,700 hours of  borrowing. Yet, listen to people come behind these microphones. It is  like the world is coming to an end.\n\nPlease understand…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692327/math-always-wins"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…as DOGE.\n\nThe American people are getting a front row seat to one party who is  perfectly content to bankrupt this country, one party. We will get no  votes on this rescission package, none from the Democratic Party.\n\nThey had their time. When their President, who was cognitively, let's  just say, deficient, where were the cuts? None. They didn't say…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692389/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…will just  mention one more.\n\nCongresswoman Ocasio-Cortez got very, very upset, as did the  socialist wing of her party, when the President sent over what is  called a rescission package.\n\nBasically, President Trump said: We want you to take some stuff out  of the budget that we think is a waste.\n\nWe did, and that upset the Congresswoman. She is entitled…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695979/government-funding"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…rescissions package is the first step in ensuring that taxpayer  dollars are used to promote everyday Americans in very real ways.\n\nI look forward to passing this first rescission package and look  forward to continuing to support the work of President Trump and the  DOGE team to identify and eliminate wasteful government spending.…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692496/rescissions-package-is-first-step"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…what will destroy America as we know it,  and that is this unsustainable debt that we are passing on to our kids  and grandkids. I urge my colleagues to support this rescission package.", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692542/rescissions-act-of-2025"}]