[{"senator": "Adam Smith", "party": "Democrat", "sentence": "…lifetime of remarkable service to our Nation. Phil  graduated from the U.S. Naval Academy in 2000, serving on active duty  until 2009 and continuing to serve in the U.S. Navy Reserves until  2021, retiring at the rank of Commander.\n\nIt has been a privilege working with Phil, and I thank him for his  service to the House Armed Services Committee. His departure…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699643/services-committee"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…a  loving husband, father, and grandfather.\n\nNo one deserves retirement more than Jerry, but I know that he won't  be retiring for real, as he has been sworn into the APD Reserves. I am  sure we will continue to see him serving our community in his own  special way.\n\nOn behalf of Ohio's 13th Congressional District, I congratulate and  thank Detective…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687992/congratulating-jerry-gachett-on-his-retirement"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…the burden of service.\n\nBlack Americans have served in the United States military since the  Revolutionary War, with over 350,000 currently serving on Active Duty  or in the Reserves, making up approximately 20 percent of enlisted  personnel.\n\nAs of 2025, 21 percent of Army soldiers, Black or African American,  while represented in the enlisted ranks,…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699864/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…compliance with the U.S.       Constitution. If the State of Texas fails to rectify the       racial gerrymandering of TX-09, TX-18, TX-29 and TX-33, the       Attorney General reserves the right to seek legal action       against the State, including without limitation under the       14th Amendment.            Respectfully,      Harmeet K. Dhillon,\n\nAssistant…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694943/bloody-sunday-and-voting-rights-act"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…these various proposed operations,  and their personal agendas converged. Their goal was ultimately to  destabilize and depose Maduro and secure access to Venezuelan's oil  reserves.\n\nOver the summer and fall, the Department of Defense flowed massive  military assets into the Caribbean: the Iwo Jima Amphibious Ready  Group, the 22nd Marine Expeditionary…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699116/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…cautiously.\n\nAmong the illegally terminated--and I should stress ``illegally  terminated''--are 2,400 VA employees, many of them veterans themselves,  members of the Guard or Reserves now, caregivers, military spouses. In  the DOD, many of them--45 percent--are former veterans. The overall  impact will be disastrous on the 640,000 veterans who are public…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688443/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…money.\n\nVenmo is holding $7 billion of consumers' money. If you have a tiny  bank that is one-tenth or one-hundredth the size of Venmo, you have to  make sure that you have reserves. You can't take the money to the horse  races. Yet, Venmo can do anything with the money. If they lose the $7  billion, you as a consumer are out of luck, and Trump can say:…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689952/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "Mr. Speaker, I rise to express my support for H.R. 983, the  Montgomery GI Bill Selected Reserves Tuition Fairness Act of 2025.\n\nThis bill mandates the Department of Veterans Affairs to deny courses  that do not charge in-State tuition rates to veterans using certain…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689694/montgomery-gi-bill-selected-reserves-tuition-fairness-act-of-2025"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…this bill is that stablecoins will, in fact,  be stable because they will be backed one to one with solid, safe  assets. I invite anyone to read the bill.\n\nWhile some of the reserves are cash and short-term Treasury  securities, this bill allows for uninsured deposits. We already know  how dangerous these deposits are. When Silicon Valley Bank failed,…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693839/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…General Lopez's distinguished legacy of service and his  dedication to our country, serving in the United States Marine Corps  for over 30 years, both in Active Duty and the Reserves.\n\nGeneral Lopez was born in Santa Barbara as the oldest of six siblings  and spent his childhood between the communities of Santa Barbara and  Lompoc, and later in Goleta.…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697745/brigadier-general-frederick-r-lopez-post-office-building"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…The  last sentence in the last paragraph reads: ``If the State of Texas  fails to rectify the racial gerrymandering of TX-09, TX-18, TX-29, and  TX-33, the Attorney General reserves the right to seek legal action  against the State, including without limitation under the 14th  Amendment.''\n\nRace has been infused into this letter. It was sent to the Honorable…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694163/racism-infused-in-texas-politics"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…Army\n\nTrailblazer Award: The Honorable Robert R. Rigsby,       Associate Judge, District of Columbia Superior Court and       Colonel (Retired), Judge Advocate, U.S. Army Reserves\n\nHigh School Essay Contest First Place Winner: Gabriella E.       Celestine, James W. Robinson, Jr. Secondary School\n\nBrigadier General Charles Young Military Leadership Award:…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697131/recognizing-omicron-kappa-kappa-chapter-of-omega-psi-phi-fraternity-inc-for-its-achievement-week-and-honorees"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…Marshall Khalifa       Haftar.\n\nIn exchange, the Government of National Unity envisions       boosting business and investment ties--particularly regarding       Libya's vast reserves of oil--with an administration known       for its deal-based transactional foreign policy. The Libyan       authorities also aim to solidify security ties that may…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697384/recognizing-the-importance-of-libyas-return-to-stability"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…President.\n\nNow, he has already given them a lot of favorable treatment, but,  boy, this would be a coup--the oil industry having full access to the  world's largest petroleum reserves.\n\nBut, today, this morning, in our briefing, we did learn that there is  another objective.\n\nYes, Trump wants control of the oil for his friends. But today in our  briefing--and…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698610/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…recent declaration of a  blockade on oil tankers from Venezuela is not about stopping drug  traffickers. The real goal is regime change and to grab Venezuelan oil  and gas reserves for the President's billionaire friends.\n\nThese escalating abuses demonstrate an administration increasingly  willing to sidestep the law using military force. They also underscore…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698254/nominations"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…surrounded by friends and family.\n\nBorn on Christmas Eve in 1919, Hazel would go on to serve her country  with extraordinary courage in World War II. Hazel enlisted in the Navy  Reserves and served as an operating room nurse at U.S. naval hospitals  from Portsmouth to Newport and even overseas in Bermuda.\n\nIn the darkest days of the war, she answered her country's…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699733/happy-106th-birthday-to-hazel-womble"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…before. Yet, while  the private sector has raced ahead, Washington has been stuck.\n\nThe GENIUS Act fixes that. It gives stablecoin issuers a regulatory  framework for strong reserves, real redemption rights, and smart risk  management.\n\nFinally, the Anti-CBDC Surveillance State Act is about protecting  liberty. It blocks the Federal Government from launching…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693544/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Maria Salazar", "party": "Republican", "sentence": "…is  thriving. Grenada is thriving.\n\nOnce Maduro is gone and order is restored to the country, it will be  the most prosperous country in Latin America, having the largest  reserves of oil in the world, which will give them enough resources not  to depend on the charity of the United States or any other country to  fix the destruction that Maduro wrought.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698241/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…oil and gas  leasing program to be administered through piecemeal offerings of land  tracts which exclude areas known to have proven potential for  significant hydrocarbon reserves, but in doing so, the 2024 ROD ignored  explicit instructions put forth by Congress in the TCJA. Congress  clearly stated the Secretary ``shall establish and administer a…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697739/9999"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…programs. It is clearer  than ever that VA education programs need to meet veterans where they  are and not the other way around.\n\nAdditionally, this bill would ensure guard and reserves who get  called up on orders during a semester can receive a grade. This bill  would also give school certifying officials, or SCOs, time to prepare  for a required survey…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699511/veterans-education-and-technical-skills-opportunity-act-of-2025"}, {"senator": "Troy Balderson", "party": "Republican", "sentence": "…revolution has ushered in a new era of American energy  independence and revitalized communities in Ohio and across the  Appalachian region as they tap into the vast natural gas reserves  beneath our feet.\n\nIn order to move this energy from the well pad to the customer, we  need modern and reliable infrastructure. Far and away, the best way to  transport natural…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698070/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "John Hoeven", "party": "Republican", "sentence": "…imports.\n\nInstead of new taxes and regulations designed to stifle production,  we should be supporting innovation to maximize the use of our abundant  and affordable oil and gas reserves.\n\nOur energy producers utilize the latest and the greatest technology,  enabling more energy production with the best environmental  stewardship.\n\nToday, the United States…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688157/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…consulted and involved as       this bill or similar legislation moves forward so that we may       address any remaining issues within our jurisdiction.\n\nThe Committee also reserves the right to seek appointment       of an appropriate number of conferees to any House-Senate       conference involving this or similar legislation, and       requests your…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694826/stop-chinese-fentanyl-act-of-2025"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…consideration at this time, we do not waive any jurisdiction       over any subject matter contained in this or similar       legislation. The Committee on Agriculture also reserves the       right to seek appointment of an appropriate number of       conferees, should it become necessary, and ask that you       support such a request.         We would…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698235/utah-wildfire-research-institute-act-of-2025"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…potential. In the early 1900s, as the U.S. Navy began transitioning  from coal to oil-burning engines, the Federal Government became  increasingly concerned about the supply of oil reserves in the event of  war or national emergency. In response, the Federal Government made  multiple withdrawals of public land to ensure a stockpile of fuel  supplies for the Navy…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…understanding that the Committee's       jurisdictional interests over this and similar legislation       are in no way diminished or altered. In addition, the       Committee reserves the right to seek conferees on H.R. 3620       and requests your support when such a request is made.\n\nI would appreciate your response confirming this       understanding…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698113/southcentral-foundation-land-transfer-act-of-2025"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…want the world price  produced by what we have here in our country. The price does fluctuate  on a stop price day-to-day. However, just because we are sitting on  massive reserves of natural gas where our friends in Europe are  suffering, where our friends in Korea and Japan are asking for it, the  argument is, if you don't export any natural gas, the…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697089/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…earned him the National Defense Service Medal, the Vietnam  Service Medal, and the Vietnam Campaign Medal. After being honorably  discharged in 1970, Bill served in the Army Reserves until 1975.\n\nAlthough his military service had ended, Bill stayed committed to the  honorable life of a public servant, becoming a firefighter with the  Temple Fire Department…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696330/recognizing-william-bill-forest-harris-with-a-congressional-veteran-commendation"}, {"senator": "John Hoeven", "party": "Republican", "sentence": "…This flawed plan, finalized during the closing days of the Biden  administration, undermines BLM's multiple-use mandate and restricts  access to vast, taxpayer-owned energy reserves in North Dakota. It is  yet another example of the Biden administration's overreaching Green  New Deal agenda intended to block access to domestic energy production.\n\nNorth…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696141/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…something called the vault, which will be a  repository for critical minerals. It will be similar to our Strategic  Petroleum Reserve. We will have strategic critical mineral reserves.\n\nWe need to be able to produce those critical minerals here in the  United States to put in that reserve, which will insulate against  foreign bad actors dumping in our markets…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699695/critical-mineral-dominance-act"}]