[{"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…the heart of Corey's  world. He cherished his grandmother, the late Margaret Lucinda Sidney,  his aunt Sylvia Sidney, and his cousin Arthur Dennis Sidney, both of  whom now reside in Washington, D.C. Corey was proud of his close-knit  family and maintained affectionate relationships across the country.\n\nThough he might have claimed to be shy, Corey was…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697070/recognizing-the-life-of-corey-lee-sidney"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…70  percent of Eaton fire survivors have not yet returned home, and the  majority have not even begun the arduous process of rebuilding. Almost  one-half of survivors still reside in either temporary or unstable  housing. Families are exhausting their savings, taking on debt,  skipping medical care, and making impossible choices just to get by.\n\nSmall…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698642/marking-anniversary-of-los-angeles-fire"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…hours of service have been contributed to  communities across the country as part of the Congressional Award  program. There are currently over 50,000 youth enrolled, and they  reside in every congressional district across this country. This award  encourages young Americans to do and to be their best, but the program  has lapsed. My office is receiving…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698224/congressional-award-program-reauthorization-act"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…luxury, that healthcare should be available to those  who can afford it, that healthcare should be dependent on where you  come from, where you were born, the ZIP Code that you reside in. I  believe that healthcare is a basic human right. We know Jesus gave it  for free.\n\nI subscribe to the notion that no one should be left without access  to a doctor, a…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690245/health-disparities-in-minority-communities"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…not live up to its purpose, and will instead, create       further barriers for the low-income Black community in D.C.\n\nWe all want our communities to feel safe for all who reside       and visit, and the District of Columbia is no different. The       changes proposed by these bills have proven to be ineffective       in deterring crime and will only…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697021/opposition-letter-by-the-naacp-legal-defense-and-educational-fund-inc-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…communities.\n\nIn the Bronx--specifically, in Co-op City--we have a public debt of  gratitude that we owe to the Co-op City Times, which is serving the  40,000-plus people who reside there.\n\nOwned and operated by the Riverbay Corporation, the Co-op City Times,  led by Rozaan Boone, editor-in-chief, and her team of reporters, covers  the work of the Co-op…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698631/recognizing-co-op-city-times"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…relationship with those in other countries.\n\nThis bill would also require our Foreign Service Officers to be  trained on the history and culture of indigenous communities that  reside near their posts of assignment. Our Foreign Service Officers  will often be the primary American officials for interaction with these  communities, and should be well versed…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689274/indigenous-diplomacy-and-engagement-act"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…nationally about Hawaiian  history, many Americans remain unaware that there are over 700,000 now  who identify in whole or in part as Native Hawaiian. Roughly half  continue to reside in their homeland of Hawaii, and I am deeply humbled  to join my Hawaii Congressional delegation colleagues in our kuleana  (responsibility) to represent them and their `ohana…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695915/recognizing-hawaiian-history-month"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…centuries, the Miccosukee Tribe's way of life has been challenged  through forced relocation, damage to wetland drainage projects, and the  need to acquire special use permits to reside in their own villages.\n\nIn 1998, Congress established the Miccosukee Reserved Area, granting  the Tribe rights to much of their ancestral lands within the park while  supporting…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693409/miccosukee-reserved-area-amendments-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…federal agencies, the Court Services and Offender  Supervision Agency for the District of Columbia (CSOSA) and the  District of Columbia Pretrial Services Agency (PSA), to reside in the  District of Columbia during their terms. There are residency  requirements for government positions in federal law, D.C. law and the  laws of jurisdictions throughout…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690239/introduction-of-the-requirement-of-the-director-of-the-court-services-and-offender-supervision-agency-for-the-district-of-columbia-and-the-director-of-the-district-of-columbia-pretrial-services-agency-to-reside-in-the-district-of-columbia"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…programs of regional and national  significance.\n\nThis is the umbrella under which nearly all of the SUPPORT for  Patients and Communities Reauthorization Act of 2025 programs reside.  My colleagues have also proposed gutting the mental health block grant,  the substance abuse block grant, the State opioid response grants, and  consolidating them into one…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691876/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…States and also the world to this cradle of our natural heritage.\n\nEqually vital, the 9,000-strong Gwich'in Nation, whose subsistence  and culture depend on the caribou herd, reside along the herd's  migratory route, making any disruption not only a threat to  biodiversity but also an assault on indigenous livelihoods and  traditions.\n\nLet me read a quote…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696832/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…historically incorrect, but as I described earlier, it is also  hypocritical.\n\nRepublicans have fought tooth and nail to defeat legislation that  would give the American citizens who reside in D.C. voting  representation in the House and Senate. We, of course, continue to push  for D.C. statehood.\n\nMadam Speaker, I urge the House to reject H.R. 884 and, instead,…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692318/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…companion bill.\n\nIndividuals living in federally assisted housing should not be denied  admission, or fear eviction, for using a product that is legal in the  state where they reside. Adult-use marijuana, medical marijuana or both  are currently legal in 40 states, the District of Columbia and three  territories, and approximately 90 percent of Americans…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698317/introduction-of-the-marijuana-in-federally-assisted-housing-parity-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…introduce the District of Columbia  National Guard Commanding General Residency Act, which would require  the Commanding General of the District of Columbia National Guard to  reside in D.C. Two Congresses ago, the House Committee on Oversight and  Reform passed this bill.\n\nThe president controls the D.C. National Guard. In contrast,  governors of the states…", "date": "2025-07-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694307/introduction-of-the-district-of-columbia-national-guard-commanding-general-residency-act"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…Department has lost over 2,000 officers, leaving  the department critically understaffed and unable to adequately respond  to this crisis.\n\nOne of my neighbors here where I reside in D.C. had a terrible,  violent incident that happened to her with her child. When the incident  was over, she had lost her pocketbook. She had lost her phone. When  they…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696932/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…plan that actually makes sense, that actually takes into account  America's need for energy, and that actually listens to the people in  these States where these resources reside. While they are doing that,  the previous resource management plan would be in existence.\n\nAgain, it is just fear-mongering to say that there will basically be  no rules if…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694908/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…estimate of how many criminal  laws exist either in statute or in regulation.\n\nIn the 1980s, the Department of Justice tried to count the number of  Federal criminal laws that reside within the code and estimated there  are ``about 3,000 criminal offenses.'' The American Bar Association, in  the 1990s, said it was much higher than 3,000 but couldn't figure…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697203/count-the-crimes-to-cut-act"}, {"senator": "Ryan Mackenzie", "party": "Republican", "sentence": "…National Championship  as a member of the Indiana University Hoosiers, starting on the  defensive line as his team captured the national title.\n\nBack home in Emmaus, where I reside, friends, former teammates,  coaches, and neighbors came together to cheer him on, a testament to  the character and leadership that Mario has shown, both on and off the  field.…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699907/recognizing-joshua-hobson"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…Greenland, they are  sharing with me their concern, their deep anxiety about what is going  on. What is it that the United States is asking for?\n\nThink about the 57,000 people who reside in Greenland. That is the  total population of this massive, massive island--57,000 people. But  those 57,000 people are their own autonomous country. They have been  striving…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698821/9999"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…many  battleships are stationed here--that would be the prerogative of the  President.\n\nThe beginning of the war, the initiation of the war, the declaration  of the war would reside with the people and their representatives to  make it less likely that we go to war.\n\nThe founding generation was largely united in the opinion that the  American President…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698611/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…would say to you as a Member of the U.S. Senate, the U.S. Congress  is the lawmaking body for the country. The U.S. Constitution begins  with ``All legislative power shall reside in a Congress,'' not an  Agency that wants to have electric vehicle mandates for every American.  That is not how it works.\n\nSo we worked to make sure that we were clarifying…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691634/congressional-review-act"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…Inupiat have called the Arctic home for       over 10,000 years. We are proud of our self-determination       efforts to ensure future generations of Inupiat continue to       reside in our communities and have access to essential       services. Without a stable economy, our communities will       suffer, along with our ability to fully engage in and sustain…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696449/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Inupiat have called the Arctic home for       over 10,000 years. We are proud of our self-determination       efforts to ensure future generations of Inupiat continue to       reside in our communities and have access to essential       services. Without a stable economy, our communities will       suffer, along with our ability to fully engage in and sustain…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696834/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…honoring the Adams family. The bill would authorize a new site for  the memorial just south of the White House, where John and Abigail  Adams were the first Presidential family to reside.\n\nDuring a legislative hearing in the Federal Lands Subcommittee,  Jackie Gingrich Cushman, the chair of the Adams Memorial Commission,  testified: ``The Adamses exemplified…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697633/adams-memorial-great-american-heroes-act"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…``Superintendent''), shall--\n\n(1) install an electronic locking mechanism for each room       at the Coast Guard Academy within which 1 or more Coast Guard       Academy cadets reside overnight;\n\n(2) test each such mechanism not less than once every 6       months for proper function and maintained in proper working       order; and\n\n(3) use a system that…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…in municipal elections.  Right here in our Nation's Capital, noncitizens are eligible to vote in  these municipal elections. In Washington, D.C., a noncitizen only has  to reside in the District for 30 days in order to register to vote.\n\nMr. Speaker, 388 noncitizens cast ballots here in our Nation's  Capital in Washington, D.C., in the most recent election.…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690007/safeguard-american-voter-eligibility-act"}, {"senator": "Eli Crane", "party": "Republican", "sentence": "…Olympic City USA,  with the U.S. Olympic and Paralympic Committee headquarters in Colorado  Springs.\n\nToday, I am honored to highlight three incredible athletes on Team  USA who reside in my hometown of Colorado Springs: Amber Glenn, Danny  O'Shea, and Ellie Kam. They are among the 16 U.S. figure skaters  nominated to the 2026 U.S. Olympic team.\n\nMr. Speaker,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699727/recognizing-olympians-from-colorado"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…tirelessly to produce the dairy  products that we know and love.\n\nMy home State of Pennsylvania produces 9.8 billion pounds of milk  annually from the nearly 465,000 dairy cows that reside in  Pennsylvania. The 4,850 dairy farms located throughout Pennsylvania  represent nearly 20 percent of our Nation's dairy farms. These farms  provide 52,000 jobs across the…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692145/doge-rescissions-package"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…but we have oversight of the  EPA, we have the arts, and we have the Indian health and Tribal  programs. It is a challenge. It is complex. There are a lot of matters  that reside under the Department of the Interior and the EPA. And,  oftentimes, we don't always see eye to eye on the issues that are  within this jurisdiction, and that certainly would…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699014/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}]