[{"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…prohibited him from possessing       a firearm. While the sample size is small, these sustained       terminations are unquestionably the right outcomes for MPD,       our residents and visitors, and the local and national       elected officials that MPD serves.\n\nThe law enforcement disciplinary reforms implemented by the       District were long overdue.…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692302/protecting-our-nations-capital-emergency-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…local self-government.'' Giving the president the power to direct the  services of MPD is a violation of D.C. home rule. MPD's first  responsibility is to protect D.C. residents and visitors, and it must  always remain under the authority of the D.C. mayor, who knows D.C.  better than the president, to accomplish its mission.\n\nSection 740 is also unnecessary.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694806/introduction-of-the-district-of-columbia-police-home-rule-act"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…shaping and leading the Puerto Rican Festival for over 15 years. He has  worked tirelessly to honor Puerto Rican heritage and create a welcoming  space where thousands of residents and visitors gather each year. Under  his leadership, the festival has become more than an event, it is a  unifying force that strengthens community bonds and promotes cultural…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695838/recognizing-orlando-ortiz"}, {"senator": "Eric Sorensen", "party": "Democrat", "sentence": "…powered by biodiesel, construction of improved riverfront  docks, and even plans for future electric ferries.\n\nThe Channel Cat has provided over one million rides, giving residents  and visitors alike a unique and sustainable way to cross the  Mississippi River--connecting two states, three downtowns, and  countless cultural and recreational opportunities.…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691090/recognizing-the-30th-anniversary-of-the-channel-cat-passenger-ferryboat-service-in-the-quad-cities"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…Director on October  8, 2014. In every role, Jim led with humility and purpose, ensuring  that the Convention Center served as a welcoming, world-class venue for  both residents and visitors.\n\nUnder his leadership, the Floreano Convention Center strengthened its  reputation as a hub for regional and national gatherings, driving  economic development and…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697211/recognizing-jim-brown"}, {"senator": "Eric Sorensen", "party": "Democrat", "sentence": "…advancing economic  growth, clean energy, and smart technology.\n\nHe introduced the Channel Cat water taxi service, which has provided  over one million rides, giving residents and visitors a unique way to  travel the Mississippi River. He also led the adoption of electric  buses, placing the Quad Cities at the forefront of sustainable transit  solutions.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694971/recognizing-jeff-nelson-on-his-retirement"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…fair in the State of Ohio, which has 88  counties, surpassed only by the State fair. Hallelujah, Fulton County.  I was honored to spend the day there recently with residents and  visitors from other counties.\n\nI was able to listen to farmers and veterans at the hallowed Veterans  bean dinner and people both young and old from far and wide. The show…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694992/fulton-county-fair"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…oversight  over the District by prohibiting the D.C. council from further pursuing  its progressive, soft-on-crime sentencing guidelines.\n\nThe council has failed to keep residents and visitors from our  country and from around the world safe. Even as violent crime has  soared, police staffing has dropped to a 50-year low. This measure  takes direct aim at…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695524/providing-for-consideration-of-hr-dc-criminal-reforms-to-immediately-make-everyone-safe-act-providing-for-consideration-of-hr-district-of-columbia-policing-protection-act-providing-for-consideration-of-hr-lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia-providing-for-consideration-of-hr-district-of-columbia-judicial-nominations-reform-act-providing-for-consideration-of-hr-guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act-providing-for-consideration-of-hr-national-coal-council-reestablishment-act-providing-for-consideration-of-hr-promoting-cross-border-energy-infrastructure-act-and-for-other-purposes"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…did not step away from giving back. He  volunteered with the U.S. Forest Service in the Bridgeport Ranger  District, helping maintain campgrounds for the benefit of residents and  visitors alike.\n\nRemarkably, even as he approaches his 100th birthday, he continues to  harvest and donate firewood each winter to neighbors in need, quiet  acts of kindness…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699151/misguided-policy-in-california"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…freedom and prosperity, has been overwhelmed by violent crime.  As millions of people visit D.C. every year, it is imperative that our  Nation's Capital is safe for all residents and visitors. Yet, in recent  years, this simply has not been the case.\n\nIn 2024, D.C.'s homicide rate exceeded 27 homicides per 100,000  residents, higher than that of any State…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696932/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…And what we have seen at home is, since August, National Guard troops  have been deployed right here in Washington, DC. As a result,  Washington, DC, is safer for residents and for visitors, for people who  come from your State and from mine who want to come and see the  Nation's Capital. What we have seen since this has begun is that  the numbers of…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697356/wyoming-servicemembers"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…Speaker, I urge my colleagues to support this  commonsense legislation to allow police officers in the District of  Columbia to pursue and apprehend criminals to keep residents and  visitors in the District safe. I yield back the balance of my time.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695642/district-of-columbia-policing-protection-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…River Street into a festive  destination filled with local vendors, holiday entertainment, seasonal  food and drink, and family-friendly activities. It brings together  residents and visitors alike and highlights the unique charm that makes  Savannah such a special place. This recognition not only celebrates the  creativity of our local artisans and businesses…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698573/recognizing-the-savannah-christmas-market"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…officials. His leadership reflected a practical, community-first  approach, focused on maintaining New Hope's unique identity while  addressing the everyday needs of its residents and visitors alike.\n\nUnder his leadership, New Hope continued to strengthen its position  as one of Bucks County's most recognizable destinations, balancing  tourism with quality…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699203/congratulating-larry-keller-on-his-service-as-mayor-of-new-hope-pennsylvania"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…the Lady Lake Historical Society Museum,  the town's heritage reflects a century of resilience.\n\nThe recent weeklong celebration brought that heritage to life,  uniting residents, visitors, and community partners in a series of  events to honor 100 years of hometown pride.\n\nI extend my sincere appreciation to the town commission, along with  Town Manager…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697751/recognizing-lady-lake-florida"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…cherished. Their vision remains alive today in the city's commitment to  protecting its waterways, enhancing quality of life, and fostering a  welcoming atmosphere for residents and visitors alike. From its early  days as a fishing and boating hub to its present role as a vibrant city  with a growing economy and engaged citizenry, Port Richey has held…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691599/recognizing-100th-anniversary-of-the-city-of-port-richey-fl"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…Department Chief\n\nMichael Doan, Emergency Management Coordinator\n\nNeal Stone, Municipal Judge\n\nMichael Staiger, Chief of Police\n\nOn August 30, 2025, the town's officials, residents, and visitors  will celebrate its 100th anniversary. The community festival will  include a 5K walk/run, children's games and activities, as well as  plenty of vendors in the heart…", "date": "2025-07-31", "source_url": "https://justfacts.votesmart.org/public-statement/1694485/100th-anniversary-of-fort-laramie-wyoming"}, {"senator": "Byron Donalds", "party": "Republican", "sentence": "…colleagues have been victimized by the crime here in  Washington, D.C. Rather than prioritizing the safety of law-abiding  citizens and protecting the lives of innocent residents and visitors,  District officials have actively facilitated dysfunction and chaos  through  their progressive, soft-on-crime policies.\n\nInstead of addressing the clear epidemic…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695561/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…reforms to the District of Columbia criminal code.\n\nIt is clear to Members of the committee and the public that D.C.'s  soft-on-crime policies have failed to keep D.C. residents and visitors  safe.\n\nThe DC CRIMES Act overturns targeted portions of the D.C. Council's  Youth Rehabilitation Act by amending the definition of a ``youth  offender'' from a person…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695558/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}]