[{"senator": "Joe Morelle", "party": "Democrat", "sentence": "…the opening. I am not sure that is possible, but I will do everything I  can.\n\nThis year's celebration of America's anniversary offers an  opportunity to reflect on the resilience of the American experiment.  Our Nation has faced countless tests to our strength and our unity,  including a civil war, two world wars, natural disasters, and more.\n\nYet…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699839/semiquincentennial-congressional-time-capsule-act"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…families in the Michigan 12th Congressional District.  The most beautiful, Blackest city is in the 12th District, the city of  Detroit.\n\nIt is a celebration of freedom, Black resilience, and the ongoing  fight for justice for all. In our community, we remember and honor  generations of Black Americans who fought for liberation.\n\nAs we speak, right now, Republican…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692494/violations-of-rights-by-ice"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…is more we can do, and that is another reason why I  am so glad I didn't vote for the President's tax cut.\n\nI just reiterate, again, that this mil-to-mil training builds  resilience, support, and respect between the militaries. It keeps their  militaries healthy, and I continue to oppose this amendment.\n\nMr. Chair, I yield back the balance of my time.…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693686/department-of-defense-appropriations-act-2026"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…tragically  lost to Huntington's, it has become her life's mission to advocate for  proper care of those with Huntington's and for a cure. I am so moved by  her strength and resilience.\n\nIn honor of Rachel's family and the tens of thousands of others who  face Huntington's Disease, I am proud to lend my voice to this cause.  May this month serve not only…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691197/recognizing-may-as-huntingtons-disease-awareness-month"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…voyages of the Hokule`a,  reawakened the ancient art of navigation and connected Native Hawaiians  with their voyaging ancestors.\n\nToday, Native Hawaiians continue to embody resilience and leadership.  Their revival across all enriches not only Hawaii but also the entire  Nation, offering a living example of perseverance, identity and  contribution. We…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695915/recognizing-hawaiian-history-month"}, {"senator": "Veronica Escobar", "party": "Democrat", "sentence": "…Paso's  continuum of services through increased access to critical behavioral  health resources, collaboration with local and national partners, and  the promotion of dignity, resilience, and recovery among those who have  served and sacrificed for others. This community-focused asset will  undoubtedly help thousands of El Pasoans in need of support. I am…", "date": "2025-11-04", "source_url": "https://justfacts.votesmart.org/public-statement/1696519/recognizing-the-grand-opening-of-the-endeavors-health-wellness-center-in-el-paso"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…Americans who have made our  country.\n\nBlack history is a living, breathing narrative that enriches our  Nation and influences our daily lives. It is a powerful testament to  resilience, creativity, and the pursuit of justice.\n\nWe think about those who came before us and fought for freedom,  trailblazers like Frederick Douglass and Sojourner Truth, whose…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687894/black-history-month"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…Nation, this is  not the first time the Evergreen community has been touched by gun  violence. Yet, in the aftermath of this tragedy, Evergreen has  demonstrated extraordinary resilience, uniting in support of one  another as the process of healing begins.\n\nOn behalf of the people of Colorado's 7th Congressional District, I  stand with the Evergreen community,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695839/recognizing-the-evergreen-high-school-shooting"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…America, and America should  be outraged by these attacks on American businesses.\n\nIn the meantime, my main takeaway from this trip--my ninth--was the  incredible endurance and resilience of the Ukrainian people. But they  don't want our applause; they want ammunition. They need weapons. They  want weapons, not words. And so I am here to advocate, on this…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700241/9999"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…Mary Jesus led the rebuilding efforts to  make sure that services were not interrupted for those who need it the  most.\n\nSister Mary Jesus' work reflects steady leadership, resilience in  times of crisis, and a clear commitment to serving others with dignity  and purpose.\n\nI wish Sister Mary Jesus a happy 100th birthday. The San Fernando  Valley is grateful…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698644/recognizing-sister-mary-jesus-ochoa-on-her-centennial-birthday"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…H.R. 1608--The Department of Homeland  Security Vehicular Terrorism Prevention and Mitigation Act of 2025;\n\nYea on Roll Call No. 287, H.R. 2659--The Strengthening Cyber  Resilience Against State-Sponsored Threats Act; and\n\nYea on Roll Call No. 288, Table H. Res. 878--Disapproving the  behavior of Representative Jesus G. ``Chuy'' Garcia of Illinois.…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696780/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…that improve cancer prevention, early  detection, treatment, and patient support. It is truly an honor to have  these advocates with us this week sharing their stories of resilience,  loss, determination, and hope.\n\nLike so many of these advocates, I know firsthand the impact cancer  can have on our families. On June 10, 2021, I lost my beloved mother,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695554/american-cancer-society-fly-in"}, {"senator": "Chellie Pingree", "party": "Democrat", "sentence": "…with operating a small farm-- brutal physical work, tight budgets, long hours, unpredictable  weather--the list goes on. This work demands adaptability,  determination, and resilience. Annie exemplifies all these traits and  more. She is a leader. She has not only grown a successful dairy  business but uplifted the voices of farmers across Maine and the…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699302/recognizing-annie-watson"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…struggling readers build  confidence, skills, and joy.\n\nTheir CEO said this recognition reflects the trust placed in them by  educators, the hard work of their Fellows, and the resilience of the  students themselves.\n\nMoreover, Acting Librarian of Congress Newlen said the awardees this  year had a particular focus on family and community, something  Delawareans…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696940/recognizing-shae-parks"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…Taylor Green; and beloved community members Dorothy ``Dot'' Morris,  Phyllis Schneck, and Dorwan Stoddard.\n\nAt the same time, we are thankful to God for the survival, the  resilience, the courage, the strength, the persistence of Congresswoman  Giffords and all those who survived on that fateful day.\n\nPrior to this assassination attempt, Congresswoman…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698770/marking-15-years-since-tucson-shooting"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…they are incorporated into this act.\n\nMr. Speaker, I will take just a moment to tell you about the Shingle  Springs Band of Miwok Indians because it is a remarkable tale of  resilience, determination, and triumph.\n\nThe members of this Tribe are the descendants of the Miwok and  Southern Maidu people who populated the Sierra Nevada mountains and the  Central…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697668/shingle-springs-band-of-miwok-indians-land-transfer-act-of-2025"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…and three meals per  day. The Menominee community rallied around the team and raised nearly  $30,000 in two days. Such generosity and determination speak to the  spirit, resilience, and pride that define the people of the Upper  Peninsula.\n\nMr. Speaker, let us all join in recognizing the Menominee High School  football team for winning the Division…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698002/recognizing-the-menominee-maroons-2025-division-7-michigan-state-football-champions"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…government spending.\n\nJust look at what we have been funding with taxpayer dollars: $6  million for net-zero cities in Mexico; $5.1 million for programs to  strengthen the resilience of lesbian, gay, bisexual, transgender,  intersex, and queer--good grief--global movements; $1.5 million to  advance diversity, equity, and inclusion in Serbia's workplaces;…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692388/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Randy Feenstra", "party": "Republican", "sentence": "…lives  cut short by this horrible disease.\n\nThey sadly became the youngest twin girls in history to lose their  lives to FUS-ALS, an even rarer form of this disease.\n\nLori's resilience in the face of unthinkable loss is inspiring, and  she shared with me the positive memories that she had of her brave  daughters.\n\nJaci and Alex embraced life with remarkable…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691604/als-awareness-month"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…Taiwanese officials and saw  firsthand how we can strengthen U.S. posture and deepen collaboration  in the region. I was also struck by the warmth, hospitality, and the  resilience of the Taiwanese people.\n\nFor decades, our partnership with Taiwan has been anchored in  democracy, in freedom, and in economic opportunity. Today, it is  equally defined…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694962/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…of Roanoke's 150th Anniversary\n\nMr. CLINE. Mr. Speaker, I rise today to honor the 150th anniversary  of First Baptist Church of Roanoke, a beacon of faith, service, and  resilience, since its founding as Big Lick Baptist Church on May 16,  1875.\n\nFrom just 20 charter members in a small village, this church has  grown alongside the city it calls home.…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691575/recognizing-the-75th-anniversary-of-james-wood-high-school"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…the  beautiful shores of the Pithlachascotee River--known locally as the  Cotee River--Port Richey has grown from a small riverside community  into a city rich in heritage, resilience, and charm. Over the past  century, Port Richey has served as a gateway to Florida's Nature Coast,  offering a unique blend of coastal beauty, community spirit, and small-…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691599/recognizing-100th-anniversary-of-the-city-of-port-richey-fl"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…emergency medical  teams. They all answered the call, keeping our communities safe and our  roads open. Their bravery, professionalism, and dedication embody the  spirit of resilience and unity that defines northern Michigan.\n\nThe determination of all those affected has not gone unnoticed. My  colleagues and I stand ready to support the State's request…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689858/congress-supports-northern-michigan-and-the-upper-peninsula"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…the 2025 Pan American Inline Hockey Championships in  Oaxtepec, Morelos, Mexico.\n\nRepresenting our Nation with pride and determination, the team  demonstrated remarkable resilience by winning four consecutive games to  capture the championship title. I am especially proud to note that Izzy  is from Myrtle Beach and was the only member of the Women's…", "date": "2025-10-28", "source_url": "https://justfacts.votesmart.org/public-statement/1696435/recognizing-izzy-soto-and-the-us-national-development-team"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…that Fernando Serrano has made through his work with the  Pasco County Human Services Team. The Pasco County Human Services Team  has proven itself to be a comerstone of resilience, innovation, and  unwavering commitment to the community. Amidst the devastating impacts  of Hurricanes Helene and Milton, they emerged as an indispensable  force, transforming…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690698/recognizing-fernando-serrano"}, {"senator": "Morgan Luttrell", "party": "Republican", "sentence": "…remarkable victory and his second career win under  what many are calling the worst conditions in track history this year.\n\nThis wasn't just a race. It was a test of endurance, resilience, and  unwavering determination. In the face of deep ruts, relentless mud, and  brutal terrain, Mr. Plessinger, ``The Cowboy,'' displayed not only  exceptional athleticism…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689821/congratulating-supercross-rider-aaron-plessinger"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…taxpayers of the United States of America's children. Today's taxpayers  aren't paying for it because it is all borrowed money.\n\nThey want to spend $2.1 million for climate resilience in Southeast  Asia, Latin America, and East Africa; $500,000 for electric buses in  Rwanda. Rwanda is more than free to go buy all the electric buses they  want or diesel…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692544/rescissions-act-of-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…internationally  acclaimed. It attracted people from across the world. This July will  mark the 62nd annual Trans-Tahoe Regatta.\n\nThe Tahoe Yacht Club has exhibited endurance and resilience over the  past century, briefly closing over COVID-19 but overcoming the  challenges of that time to reopen to a wave of new members. Today, the  Tahoe Yacht Club boasts…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…children--Sarah,  Grace, Naomi, Camille, and Nate--for their unwavering support  throughout his career. The sacrifices made by military families are  profound, and their strength and resilience are vital to the success of  our armed forces.\n\nAs Mr. Austin embarks on this next chapter, I wish him and his family  a future filled with peace, joy, and well-deserved…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696046/recognizing-mr-stephen-d-austin-assistant-chief-of-us-army-reserve"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…do this? How about we cut $3 million for circumcisions,  vasectomies, and condoms in Zambia? How about that? How about we cut  $5.1 million that is used to strengthen the resilience of lesbian, gay,  bisexual, transgender, intersex, and queer global movement? I have got  an idea. How about instead of spending it there, how about we spend  that money…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692534/rescissions-act-of-2025"}]