[{"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…Americans who fought for liberation.\n\nAs we speak, right now, Republican extremists across our country are  attempting to erase Black history right before our eyes. We stand with  residents in Detroit and throughout the country who refuse to let Black  history be erased. We are committed to uplifting their stories and  carrying on the movement for true equity…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692494/violations-of-rights-by-ice"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…States--blue  States or red States--to follow California's lead, but these other  States see the benefits of what California is doing, and they choose to  do so to protect their residents and to protect their environment.\n\nLastly, let me just conclude by stating something that has  conveniently been stifled in this whole debate--limited debate--and  conversation.…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691620/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…release often force poor defendants to remain in jail, which  can cost them their jobs and housing and leads to more convictions and  longer sentences.\n\nThe over 700,000 D.C. residents, the majority of whom are Black and  Brown, are capable and worthy of governing themselves. If residents do  not like how the D.C.'s local legislature votes, residents can…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696979/district-of-columbia-cash-bail-reform-act-of-2025"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…be impacted by the proposal, the so-called  reconciliation, that is going through this Chamber. We know that  children and families will go hungry with this proposal.\n\nOur residents can't simply stop being hungry or stop being sick, Mr.  Speaker. For me, being on the front lines of a community that continues  to get left behind with policies here in…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691614/budget-cuts-will-harm-families"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…public stations are often the only ones available to reach  people during an emergency.\n\nWNMU out of Marquette is the only source of emergency alert services  for over 250,000 residents in Michigan's Upper Peninsula. This singular  station covers an area larger than Connecticut, Massachusetts, Rhode  Island, and Delaware combined. If Republicans pass this…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693590/rescissions-act-of-2025"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…status.\n\nJust last month, the administration announced it would stop  adjudicating all immigration benefit requests for nationals of 19  countries. That means law-abiding residents who have lived in this  country--many, for years--are seeing their naturalization interviews  paused and their citizenship ceremonies canceled. Now, these decisions  build…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698866/commerce-justice-science-energy-and-water-development-and-interior"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…The bill would expand the coverage for Federal  assistance to cover the cost of repairing property and flood damage to  basements after a major disaster.\n\nMr. Speaker, our residents must be able to live safely and fully  rebuild their lives after disaster strikes. I urge my colleagues on  both sides of the aisle to support this legislation. It is critically…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694896/providing-recovery-for-flood-victims"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "Ms. TLAIB. Mr. Speaker, disastrous floods, horrific floods are  devastating the lives of our residents in southeast Michigan and across  the Nation.\n\nThe dangers don't stop when the flooding ends. Too many of our  families are denied FEMA assistance because current rules and…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694123/disastrous-floods"}, {"senator": "Ami Bera", "party": "Democrat", "sentence": "…Carmichael  Recreation and Park District on their 80th Anniversary. Through their  mission, they have provided valuable community resources that have  enriched the lives of its residents.\n\nStarting in 1945, Carmichael Park and Recreation District acquired  its first land parcel that went on to become their flagship park,  Carmichael Park. After further land…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696717/recognizing-the-80th-anniversary-of-carmichael-recreation-and-park-district"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…Floridians could lose their healthcare because of these Medicaid cuts.\n\nWe can just go on and on. Twenty percent of Iowans are on the  Medicaid Program, 20 percent of Indiana residents, and 25 percent of  Kentucky residents. Thirty percent of Louisianans are on their State's  Medicaid Program, and 500,000 residents of Louisiana could lose their  healthcare.…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689306/privileges-of-the-floor"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "…marched, the guard yelled at them: This is the price of  the American Dream.\n\nIt should not matter who these women are. It should not matter  whether they are citizens, legal residents, or undocumented people  trying to make a life for themselves.\n\nIt is shameful and embarrassing for our country that we would treat  any human being like this. The detention…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694186/pushing-back-against-ices-authoritarian-overreach"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "…should allow  the people of D.C. to decide when a car chase is appropriate.\n\nCongress should not require D.C. police to use tactics that the  community does not want. D.C. residents should be empowered to decide  when to authorize their police to use dangerous tactics.\n\nUnder current D.C. law, pursuits are allowed if a fleeing suspect has  committed…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695640/district-of-columbia-policing-protection-act"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "Mr. CARBAJAL. Mr. Speaker, I represent California's Central Coast  where close to half of our residents are Latino and where farmworkers  are essential pillars of our community.\n\nSince Trump's return to the White House, our community has  experienced an unprecedented level…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697456/fighting-dhs-immigration-raids"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "…today the  first of four bills which represent a serious violation of the rights  of Washington, D.C., and the democratic process.\n\nMr. Speaker, we know that D.C. has more residents than two States;  D.C. taxpayers pay more Federal taxes per capita than any State; and  D.C., as a whole, contributes more Federal taxes than 12 States. There  are over 700,000…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695557/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…completely out of control when  compared to the nations in the European Union or Canada, our next-door  neighbor. We are losing 5, 10, or 20 times the number of people that  the residents of those countries are losing because our gun laws are  like Swiss cheese. They are filled with holes. Let's close those  loopholes. It doesn't diminish anybody's Second…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691242/leosa-reform-act"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…tax  revenue and franchise fees, and incorrect Census counts. Each of these  issues poses significant challenges for Mills as it continues to grow,  develop, and attract new residents across Wyoming and beyond.\n\nPassage of this bill will go a long way to correct this oversight,  not only for Mills but for communities nationwide.\n\nThe city of Mills has…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693862/establishing-new-zip-codes"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…2025.\n\nOn December 20, 2025, the District of Columbia Council enacted,  without the Mayor's support, legislation to decouple areas from the  Federal tax code and deny District residents and businesses the local  tax conformity impacts of several tax benefit provisions of the One Big  Beautiful Bill Act.\n\nSimply put, the District of Columbia Council doesn't…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699590/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…through a period of substantial growth and  change.\n\nFrank's steady leadership helped preserve the unique character of our  community while meeting the evolving needs of our residents.\n\nMr. Speaker, as he prepares to close this chapter, I thank Frank for  his dedicated service to Brevard County, and I congratulate him on his  well-earned retirement.", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690852/congratulating-frank-abbate-on-his-retirement"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…Weddington, North Carolina,  reached out to me to let me know that the city had a problem. Having  different ZIP Codes across a single city has caused confusion about  where residents file property taxes or even show up to vote.\n\nConcerned about how this problem might continue to compound, my  office was able to work together with Representative Boebert…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693902/single-unique-zip-codes-for-certain-communities"}, {"senator": "Jake Ellzey", "party": "Republican", "sentence": "…began at its state-of-the-art facility. In  just twelve short months, the company has already created more than  1,200 good-paying Texas jobs, including 200 held by proud residents of  Texas' 6th Congressional District.\n\nBy all accounts, the Wilmer facility is exceeding expectations,  surpassing production goals and selling out its entire 2025 inventory.…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696803/recognizing-the-first-anniversary-of-t1-energys-operations-in-wilmer-texas"}, {"senator": "Cindy Hyde-Smith", "party": "Republican", "sentence": "…directions clearly and safely.\n\nIn addition, I cosponsored Senator Moody's Safer Truckers Act, which  restricts the issuance of CDLs to only U.S. citizens, lawful permanent  residents, and individuals who are authorized for employment by U.S.  Citizenship and Immigration services.\n\nThese are commonsense reforms to restore integrity, accountability,  and…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697478/commercial-drivers-license-system"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…ability to bring people together and inspire  civic pride has strengthened the community's appreciation for its past  while fostering a sense of unity and belonging among its residents.  Andrea's service extends beyond preservation efforts. Andrea  consistently demonstrates a deep commitment to the well-being of  others. Her selflessness and drive to create…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690145/recognizing-andrea-read"}, {"senator": "Tom Kean, Jr.", "party": "Republican", "sentence": "…our community.  Since its founding as a volunteer fire department in 1875, the WFD has  grown into a career department, providing essential fire protection  services to the residents of Westfield and the surrounding area. Over  the past 150 years, they have answered the call in times of need--often  under dangerous and demanding conditions--a true testament…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692630/recognizing-the-westfield-fire-department-on-their-150th-anniversary"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…under       any other provision of law.\n\n(2) Enforcement by states.--\n\n(A) In general.--If the attorney general of a State has       reason to believe that an interest of the residents of the       State has been or is being threatened or adversely affected       by a practice that violates subsection (a), the attorney       general of the State may, as…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690200/hotel-fees-transparency-act-of-2025"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…commonsense  reforms to the District of Columbia criminal code.\n\nIt is clear to Members of the committee and the public that D.C.'s  soft-on-crime policies have failed to keep D.C. residents and visitors  safe.\n\nThe DC CRIMES Act overturns targeted portions of the D.C. Council's  Youth Rehabilitation Act by amending the definition of a ``youth  offender'' from…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695558/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…Police Social Worker Program, the Office of  Community Engagement, and expanded bike patrols, all of which  strengthened trust and collaboration between law enforcement and  residents.\n\nChief Mendez has devoted the past 25 years to keeping Lancaster safe.  I am extremely grateful for the positive impact he has had on the  community. I wish him the best…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696839/congratulating-lancaster-city-police-chief-richard-mendez-on-his-retirement"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…contributions, he has shared his vast experiences and  leadership abilities with generations of the department's officers.  Above all, Lieutenant Moffett's pride in serving the residents of Bucks  County was always evident--so much so that this legacy continues, with  all three of his sons now serving as police officers in communities  across the county.…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694744/recognizing-buckingham-township-police-department-lieutenant-william-moffetts-35-years-of-service"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "…demonstrated unwavering energy and  passion for services. Its enduring support of West Orange County and  communities beyond has made a lasting and positive impact on  generations of residents.\n\nI commend the Rotary Club of Winter Garden for a century of service  above self and extend my congratulations on this remarkable milestone.", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699377/recognizing-the-100th-anniversary-of-the-rotary-club-of-winter-garden"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…legislation. In this case, it should do just  that.\n\nIn December of this past year, the D.C. Council enacted, without the  Mayor's support, legislation that denies tax relief to D.C. residents  and businesses that was afforded to them by the Working Families Tax  Cut Act.\n\nWhile D.C. taxpayers still enjoy the benefits of such tax relief with  their Federal tax…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699678/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…for the first time has  Canada dealing with fentanyl because of the pressure being put on them,  who is going to pay the price? It is going to be 5,000 more of his  State's residents. That is who is going to pay the price.\n\nI think the gentleman next to me mentioned as well, when he goes  home, this is what he sees when he goes home. When he goes home…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699965/relating-to-a-national-emergency-by-the-president-on-february-2025"}]