[{"senator": "Jack Reed", "party": "Democrat", "sentence": "…painful  milestone. This week marks the third anniversary of Russia's full-scale  invasion of Ukraine.\n\nOver the past 3 years, the world has witnessed the incredible bravery  and resolve of the Ukrainian people as they have stood up to Russia's  unspeakable brutality and destruction.\n\nWe have seen--and, indeed, the United States should take great pride  in…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688332/ukraine"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…happening to the Palestinians. For those who would  claim that they have no reason to be, that this is just something that  we should allow the Israelis and the Palestinians to resolve, here is  my retort. Your tax dollars, your tax dollars are fueling the genocide  that is taking place. If you wanted to do something about it, you  wouldn't fund it. Those…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695338/dark-days"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…stigma associated with  a person who is lactose intolerant.\n\nSo thank you so much for your cooperation on this, Senator, and you  have my commitment to work with you to try to resolve what is an  anomaly and shouldn't be there.", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697064/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…to work with a bipartisan group of Members to  remove an outdated and unnecessary regulatory barrier.\n\nFinally, the Access to Small Business Investor Capital Act seeks to  resolve the AFFE issue with BDCs being removed from indices by  eliminating the double counting of fees and, consistent with this  intent, it is expected that comparable 1940 Act…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697831/increasing-investor-opportunities-act"}, {"senator": "Rick Larsen", "party": "Democrat", "sentence": "…Midway Island in the  middle of the Pacific--I don't even know which day it was on Midway at  the time--but Jack helped facilitate the phone call that helped the  chair and me resolve a sticky wicket issue that we had to get done to  get the bill done. I appreciated Jack's help in making that happen.\n\nEven when we disagreed, Jack was never disagreeable,…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692223/designating-the-house-press-gallery-in-the-united-states-capitol-as-the-frederick-douglass-press-gallery"}, {"senator": "Greg Casar", "party": "Democrat", "sentence": "…manner that reflects discredit upon the House of  Representatives;\n\nWhereas, on February 19, 2025, Washington, D.C., Metropolitan Police  Department officers were called to resolve a private matter at  Representative Cory Mills' residence, where officers were called to the  1300 block of Maryland Avenue, Southwest, around 1:15 p.m. for the  report of…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695580/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…documented the shortcomings of the prior disciplinary       process. It chronicled the cumbersome, union-negotiated       process that on average took eight years to resolve a       termination case. Over the 18-month period considered in the       audit, 36 terminated police officers were reinstated within       five and a half years of their…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692302/protecting-our-nations-capital-emergency-act"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…bureaucratic red tape. If  you can't get it right in the bill, if you don't list marriage license  in the Federal bill, and it is left to the States, who knows how and  when we resolve these issues.\n\nBonamici).\n\nMr. Speaker, I want to make note of the point that REAL ID in the  United States does not have citizenship in almost all States. A handful  have…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690001/safeguard-american-voter-eligibility-act"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…exactly the arrangement  that produced two world wars. It is exactly why, after World War II,  the United States and our allies established the rules-based order to  peacefully resolve conflicts, regulate global trade, and ultimately  ensure rules-based international exchange. That order was never  perfect.\n\nAnd the United States often undermined it with…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698608/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…H.R. 2916 would finalize a longstanding land claim in  New York for the Saint Regis Mohawk Tribe by ratifying and confirming  the Agreement of Settlement and Compromise to resolve the Akwesasne  Mohawk Land Claim in the State of New York.\n\nUnder this settlement, the Tribe will see 3,500 acres of land  returned to reservation status and have the opportunity…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697674/resolving-the-akwesasne-mohawk-land-claim-in-the-state-of-new-york"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…Beijing to push harder,  not pull back.\n\nWe say we want to be tough on China, yet here we are entertaining  whether to cut one of the clearest demonstrations of our strength and  resolve. The fact that this amendment has even been made in order  undermines us. Just giving this amendment airtime sows seeds of doubt  in Taiwan as to our support and further emboldens…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695235/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…perjury that the       alien--\n\n(i) has no unpaid applicable Federal tax liability, which       is assessed and is not being disputed;\n\n(ii) has entered into an agreement to resolve any such       assessed and undisputed Federal tax liability (via an       installment agreement, an offer in compromise, or otherwise)       which has been approved by the…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697541/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…defense platform when you are punishing their  economy and when we are punishing our own citizens.\n\nSo that is why we need to vote for this resolution.\n\nThere is a right way to resolve this, and my colleague mentioned it:  the U.S.-Mexico-Canada Agreement. It was one of the highlights, the  stellar achievements of Donald Trump's first term. NAFTA was 20…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696447/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…dead? And, of course, tragically, their worst fears happened.  What Omer and Itay's family have endured is beyond comprehension.\n\nI am inspired by their perseverance, by their resolve to keep calling  for the safe return of remaining hostages, even though their loved ones  are gone, and for the return of the bodies of their loved ones, which  is essential…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688408/joint-session-of-congress"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…what  happened? DOGE and this administration came in and started  indiscriminately firing OPM employees. This even included the  congressional liaisons who help our offices resolve retirement issues  for Federal retirees.\n\nI have heard directly from my constituents who spent their careers  serving this country. These folks are now waiting months or even…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690798/pending-opm-claims"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…support  servicemembers and their families, invest in next-generation defense  capabilities, and ensure that the United States can meet global threats  with confidence and resolve.\n\nMr. Speaker, I urge my colleagues to join me in voting ``yes'' on the  previous question and ``yes'' on the rule, Mr. Speaker.", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693544/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Richard McCormick", "party": "Republican", "sentence": "…publicly  constrains the Commander in Chief does not promote peace. What it does  is it telegraphs weakness to a hostile regime like Venezuela and  encourages them to test U.S. resolve.\n\nThis is not a distant theater. This is our hemisphere. Supporting the  President's authority is not a blank check for war. It is a  recommendation that timely, flexible…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698454/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Frank Lucas", "party": "Republican", "sentence": "…and severe results.\n\nWe should have a proactive policy toward Beijing today. As China  continues to show aggression in the South China Sea, the United States  must show clear resolve that aggression will not be tolerated.\n\nThe United States' response to an invasion of Taiwan should be robust  and include numerous sanctions and economic penalties. Exclusion…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699845/pressure-regulatory-organizations-to-end-chinese-threats-to-taiwan-act"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…quiet but profound dedication to others. He was  a proud combat veteran who served in the U.S. Army's 9th Infantry  Division during the Vietnam war.\n\nThat same courage and resolve stayed with him throughout his life,  whether it was in service to his country, in business, or in leadership  with the Nassau County Ocean, Highway & Port Authority.\n\nCarrol…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694060/may-beam-continue-to-light-the-way"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…many things have changed in American  attitudes in 50 years. But what hasn't changed is we still haven't come  to an  agreement about abortion. We still haven't been able to resolve that  issue.\n\nNow, science has resolved that issue, but we in American values and  culture have not. Science would say that a child's life begins at  conception, that that…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699097/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…support personnel also  contributed significantly to the experience in planning, preparation,  and execution.\n\nJust this past weekend, the world saw, once again, what American  resolve looks like when we are paired with unmatched precision and  capability. B-2s launched from Whiteman and executed a long-range  strike against Iran in Operation Midnight Hammer.…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692964/taking-a-step-toward-true-energy-dominance"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…something bigger and  better for our kids and grandkids that is rooted in the sacrifice of  the millions who came before us.\n\nThis reprieve must be met with the energy and the resolve of those  who died before us: the men of the Alamo, the men who stormed the  beaches of Normandy, the men on the fields of Lexington and Concord,  the men and women who have…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695203/people-are-sick-and-tired"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…throughout the resolution of the individual's       case. The single point of contact shall track the       individual's case to completion and coordinate with other       units to resolve issues as quickly as possible.\n\n``(b) Single Point of Contact.--\n\n``(1) In general.--For purposes of subsection (a), the       single point of contact shall consist of a team…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697186/improving-social-securitys-service-to-victims-of-identity-theft-act"}, {"senator": "Claudia Tenney", "party": "Republican", "sentence": "…United States, including in my home State of New York.\n\nUnder President Trump, that era of weakness is over. Criminals no  longer get a free pass.\n\nThrough Operation Absolute Resolve, U.S. forces and law enforcement  partners successfully captured Nicolas Maduro and his wife, Cilia  Flores, both tied to narcotics trafficking, in a carefully planned,  coordinated…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698881/successful-operation-to-arrest-nicolas-maduro"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…of conquest in Europe--the most significant since  the days of Nazi Germany--and allies and adversaries half a world away  are watching it closely for clues about America's resolve.\n\nCertainly, Europe's deepening commitments to collective defense will  make real peace more enforceable. The President's insistence has driven  much of this progress. Putin's…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692870/9999"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…excellent  acts of valor that have protected our country and our freedoms in our  great nation. His story is a testament to the American spirit of  service, sacrifice, and resolve, and it is an honor to recognize him as  our Veteran of the Month.", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693382/recognizing-united-states-marine-sgt-richard-loughran-as-july-2025-veteran-of-the-month"}, {"senator": "James Risch", "party": "Republican", "sentence": "…conflict.\n\nAdditionally, we should be very cautious against getting ahead of the  negotiations of both our President and our democratic ally Israel, who  are working diligently to resolve this conflict. In fact, the  administration has worked with Israel to establish a new system of aid  distribution that prevents diversions by terrorists.\n\nMore aid was delivered…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695665/cloture-motion"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…I rise today to recognize the  United States Army's remarkable 2025, defined by service, sacrifice,  and strength; and filled with moments that showcase the character and  resolve of our soldiers and support teams across the globe.\n\nIn 2025, the Army marked its 250th birthday with community  celebrations and tributes to the generations that defended…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698838/recognizing-the-us-army-2025-year-in-review"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…reflects the very best  of our Nation's character, courage, and commitment to service. Richard  ``Dick'' Burbine represents a generation that answered history's call  with quiet resolve and uncommon bravery.\n\nDick Burbine was born on January 9, 1926, in Melrose, Massachusetts.  Like so many young Americans of his time, his life was forever changed  by the…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699151/misguided-policy-in-california"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…protracted war.  Guess what. We weren't. We haven't been, not for one moment since then.\n\nMy Democratic colleagues are batting zero in predicting forever wars.  Operation Absolute Resolve was a law enforcement action to bring  Nicolas Maduro, an indicted narcoterrorist with a $50 million bounty,  to justice. President Trump finished the job.\n\nThank you, President…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699364/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}]