[{"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…I appreciate the comments of my colleague from  California and particularly appreciate that my colleague from Virginia  Senator Kaine has proposed this War Powers Resolution, a resolution  that reaffirms a basic principle: The decisions of war and peace belong  under our Constitution to Congress, not to the President.\n\nBut on June 21, President Trump…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693126/motion-to-discharge-sj-res-59"}, {"senator": "Marilyn Strickland", "party": "Democrat", "sentence": "Ms. STRICKLAND. Madam Speaker, this week House Republicans are  bringing forth their ill-conceived, cruel budget resolution. This  resolution will set the stage across the board for cuts on the basic  services our constituents depend on the most. These constituents, by  the way, live in both red States…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688111/ill-conceived-budget-resolution"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…against boats  in international waters. We came up a few votes short. But while we  remain concerned about those ongoing strikes,  this debate is about a different resolution. This resolution is tailor- written to stop one thing: a war with the nation of Venezuela. The  Trump administration has not asked Congress to authorize such a war,  but the administration…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696564/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…prisons, Federal  prisons. The notion of sending American citizens to foreign prisons  without scrutiny is truly shocking, and that is the reason that I filed  the resolution.\n\nWhat is this resolution?\n\nIt is a privileged motion--available to any Senator--directing the  administration to produce a human rights report about a nation--in this  case, El Salvador.…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691406/motion-to-discharge-s-res-195"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…resolution on this  falsehood and advance a false equation between democratic socialism and  Communist dictatorship, a preposterous assertion that contaminates the  entire resolution.\n\nThe resolution even tries to conscript to these ideological  deceptions the words of Presidents Thomas Jefferson and James Madison,  enlightenment liberals who lived long before…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697148/denouncing-the-horrors-of-socialism"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…freshman 20 years ago. I thank my co-leads, Representative Troy Carter,  Congresswoman Miller-Meeks, and Congressman Fitzpatrick, for joining me  in co-leading this resolution. It is a resolution that highlights the  enduring contributions of Jewish Americans to our country.\n\nEvery May, we come together to celebrate Jewish American Heritage  Month, also…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691194/calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism-and-educate-the-public-on-the-contributions-of-the-jewish-american-community"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…duty to act in a bipartisan way to repeal these tariffs.\n\nAs you know, the previous resolution by Senator Kaine got four  Republican votes here in the Senate. Our resolution, this resolution,  would terminate the emergency that Donald Trump has declared in order  to slap tariffs on 49 percent of products Americans buy from other  countries. It would…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689739/resolution"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…Senate has in S.J. Res.  90. This is a resolution brought before the Senate and has been voted  on but was voted down.\n\nLet's examine briefly an excerpt from the resolution.\n\nThe resolution reads: ``A joint resolution to direct the removal of  United States Armed Forces from hostilities within or against Venezuela  that have not been authorized by Congress.''…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699134/where-do-you-stand"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…the secret bombing of  Cambodia--a new country that had not been covered by war  authorizations. So Congress stepped up and acted and passed the War  Powers Resolution of 1974.\n\nThat resolution did a number of things. It established some protocols  for when the President initiates military action, providing notice to  Congress so that there can't be…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692637/war-powers-resolution"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…floor focusing on  repealing commonsense energy efficiency standards that save businesses  and consumers money.\n\nThis whole Congress has been a revolving door of resolution after  resolution attacking conservation standards for different appliances.  In fact, I should point out, we were on the floor just yesterday  afternoon debating an effort to repeal…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689263/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…floor, and we  have gotten nothing but obstruction, opposition, resistance, evasion,  distraction, and diversion from the other side, and now we get one more  resolution like this.\n\nThe resolution actually proposes a disciplinary censure against  Representative Stacey Plaskett but, amazingly, alleges no misconduct.  It does not allege a violation of the…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696885/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…surprise. It is why it is important for  Members who represent communities that are besieged by tragedies like  this one to have the opportunity to introduce a resolution and have  that resolution considered on the floor.\n\nLet me give you some examples, Mr. Speaker. Mr. Evans' resolution  claims that there were 14 victims of this attack. He is wrong. There…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692191/denouncing-the-antisemitic-terrorist-attack-in-boulder-colorado"}, {"senator": "Raja Krishnamoorthi", "party": "Democrat", "sentence": "…Competition Between the United  States and the Chinese Communist Party, the CCP, to express serious  concerns about the proposed cuts in the Republicans' budget resolution.\n\nFirst, the resolution includes $880 billion in cuts to programs that  risk stalling the advancement of technologies crucial to our  competition with the CCP.\n\nSecond, these cuts will…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688048/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…be provided to students and to  educators so that they can use them even when they are not in the  school, even when they are not in the library.\n\nIf we pass this resolution--the resolution which the Republicans are  malevolently bringing out onto the floor--we are not simply undoing a  regulation; we are pulling the plug on progress in our country;…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690803/addressing-the-homework-gap-through-the-e-rate-program"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…replicas of  that plaque being put up.\n\nNow they want to pass a resolution deploring violence that took place  thousands of miles away from here, and it is just a resolution, a  hortatory resolution. They can't even get bipartisan support because of  course they have to set it up on a polemical, partisan basis instead.\n\nWhat is the utility of that resolution…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693146/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…question begged by my  colleague. Who will pay the price? It is a very sad thing to have been  asked this by my colleague.\n\nIt is important to remember what this resolution is. This resolution  ends an emergency related to fentanyl. I would say to the gentleman  over here that 5,000 people a year die in his State alone from  fentanyl.\n\nIf he wants to…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699965/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Carlos Gimenez", "party": "Republican", "sentence": "Mr. GIMENEZ. Mr. Speaker, I rise today in strong opposition to this  resolution.\n\nThis resolution would prohibit the use of United States Armed Forces  off the coast of Venezuela without regard for the real and growing  threats posed by the foreign terrorist…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698445/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…enrich itself-- not just the regime but the senior leaders of the regime as well, if  you know anything about their spending habits or their tastes.\n\nYet this resolution--this very resolution we are debating--might very  well require the removal of our Navy ships from the Caribbean that are  enforcing the quarantine. Is that what our Democratic friends…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698556/venezuela"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…wasteful spending, unleashes  American energy, secures the border, curbs inflation, and restores  American growth and competitiveness, we first must pass the budget  resolution.\n\nThis resolution, Mr. Speaker, is no more than a bridge to  reconciliation and to the golden era of the American economy. Frankly,  what that bridge is made of really makes no difference,…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689890/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…think that is a  real good use of taxpayer money, so I am in support of clawing some of  that money back. I thank President Trump.\n\nMr. Speaker, moving on to the resolution, this resolution offered by  my good friend from Pennsylvania (Mr. Joyce) would reverse a waiver  granted by the Biden EPA that allows States to ban the sale of gas- powered vehicles.…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690491/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…commemorate the victims who were  the subject of this resolution that he so misguidedly introduced  because this resolution is the exact opposite of Mr. Van Drew's  resolution.\n\nThis resolution uses anti-Semitism, uses Jews, for a political  objective. This was an anti-Semitic attack. The victims were Jewish.  One victim was a Holocaust survivor. There…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692192/denouncing-the-antisemitic-terrorist-attack-in-boulder-colorado"}]