[{"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…Nearly 175 Nepali language books and around 250 Urdu language books  were received as donations by community members. This is a testament to  the value of public libraries as a resource to our communities and the  growing diversity of our region, as well.\n\nPublic libraries, including where our office hosts our office hours,  continue to be an asset for all…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695057/school-funding-slashed"}, {"senator": "Adam Gray", "party": "Democrat", "sentence": "…as he  retires after four decades of public service.\n\nMr. Varney earned his Master of Science degree in Criminology from  Fresno State and his Bachelor of Science degree in Resource Development  from Michigan State University.\n\nHe went on to serve with the Dallas Police Department and the  Lansing, Michigan, Police Department before becoming Police Chief…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694999/recognizing-jay-varneys-retirement"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…Opportunity Act.\n\nWe have also heard concerns that the information collected under this  bill could be shared with immigration enforcement. This could turn the  SBA from a resource for all small businesses into an enforcement arm of  DHS. That is not what the SBA is for.\n\nFinally, let me point out the double standard here. For years,  Republicans have…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692125/american-entrepreneurs-first-act-of-2025"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…Republicans are trying to sell off  our public lands for a quick buck.\n\nRepublicans are working to undo protections for national monuments,  trying to block updates to outdated resource management plans, and  pushing reckless development for extractive industries no matter the  public health or environmental consequences.\n\nRepublicans are attacking bedrock…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697763/semiquincentennial-tourism-and-access-to-recreation-sites-act"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…outreach to  prospective students about educational opportunities and resources  offered by the state, including speaking with high school students and  families at a FAFSA resource fair held by my office at Bear Creek High  School in April of 2025.\n\nOn behalf of the people of Colorado's 7th Congressional District, it  is my honor to thank Dr. Paccione…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698659/recognizing-dr-angela-angie-paccione"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…Government.\n\nAdditionally, I am concerned this bill will create a fast-tracked  review procedure that advantages wealthier appellants. Taking the case  to district court is time-and resource-intensive, so only the  wealthiest appellants are likely to use the expedited review process.\n\nBy making the IBLA focus its limited resources on expedited appeals,  anyone…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691036/expedited-appeals-review-act"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…bunch of nuclear energy online. Likewise, geothermal is,  maybe, 5 to 8 years in the most optimistic scenario. Again, I love  geothermal energy. I think it is an untapped resource across the United  States of America.\n\nWe have about a 6-year gap before any of those other technologies are  ready. So a lot of fossil advocates go: Well, why don't we do…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693485/one-big-beautiful-bill-act"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…under chapter 8 of  title 5, United States Code, of the rule submitted by the Bureau of  Land Management relating to ``Buffalo Field Office Record of Decision  and Approved Resource Management Plan Amendment.''", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697183/vote-explanation"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…Eagan Police Department as a Community  Service Officer in 1994. Over the next two decades, he took on several  roles with the department including as a DARE officer, School Resource  Officer, detective, sergeant and lieutenant. New also earned a master's  degree in public administration from Metro State University and  graduated from the FBI National…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696271/congratulating-chief-roger-new-on-his-retirement"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…and use. It will also direct the SBA to keep  their resources updated on innovations in AI technology through an  expert working group. Finally, the bill will allow the SBA resource  partners to develop specialized and localized assistance to best  educate their communities.\n\nI thank my colleagues, Ms. Scholten and Mr. Downing, for  collaborating over…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699205/artificial-intelligence-wisdom-for-innovative-small-enterprises-act"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…leadership began at an  early age and has remained a guiding force throughout his life. He  helped establish organizations such as the Puerto Rican Youth  Development and Resource Center and the Spanish Action Coalition, and  he was involved in the first Puerto Rican Festival in Rochester, New  York. At the heart of his activism has always been a dedication…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695845/recognizing-henry-padron-morales"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…domestic  businesses as those resources go elsewhere, as well?\n\nOne of FERC's responsibilities is to keep prices affordable. That is  made possible by competition. You want this resource to be as resource  neutral as much as possible. If you don't believe in neutrality, what  you are going to do? You are going to stifle American innovation and  entrepreneurship.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695752/guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…Service have managed these  lands under management plans required by the Federal Land Policy and  Management Act and the National Forest Management Act. These plans,  known as resource management plans, or RMPs, establish safeguards for  watersheds and recreation areas. They facilitate energy development and  grazing and logging and other commercial activities…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696836/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…addition to overseeing the 60-plus programs ACF administers, Ms.  Barlow has also served as ACF's liaison to the Committees on  Appropriations. She has been an indispensable resource to the  Subcommittee on Labor, Health and Human Services, and Education. Her  budgetary expertise and round-the-clock responsiveness has helped the  Subcommittee to draft…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692562/recognizing-amanda-barlow-on-her-retirement"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…additionally served as the director of the city's  Office of Emergency Management from 2015 to 2022. His leadership was  instrumental in launching the police department's community resource  and crime prevention division and its social media and emergency  communications systems.\n\nDeeply respected in the community by all the citizens, please join me  in thanking…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697972/recognizing-police-chief-denton-carlson"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…served as an important military outpost.  Renamed Fort Laramie by the U.S. Army, the post played a pivotal role  during the Westward expansion. The fort served as an integral resource  for settlers, traders, and the U.S. military throughout the Western  Territories. As an important stop for people traveling to Oregon, Utah,  and California, it was the largest…", "date": "2025-07-31", "source_url": "https://justfacts.votesmart.org/public-statement/1694485/100th-anniversary-of-fort-laramie-wyoming"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…title 5, United       States Code, of the rule submitted by the Bureau of Land       Management relating to ``Miles City Field Office Record of       Decision and Approved Resource Management Plan Amendment''.\n\n(b) The joint resolution (H.J. Res. 105) providing for       congressional disapproval under chapter 8 of title 5, United       States Code,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694880/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…affordable electricity rates and an influx of  investment into energy-intensive industries, such as domestic  manufacturing, that drive economic growth.\n\nThe central focus on resource planning must be affordability and  reliability.\n\nWhile climate and environmental justice goals of States seem  laudable, the greatest harm that could come to our communities…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697887/state-planning-for-reliability-and-affordability-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…public opportunities those organizations have       identified to attract foreign direct investment to help       increase investment described in subparagraph (A); and\n\n(D) resource gaps or other challenges that prevent those       organizations from increasing such investment; and\n\n(2) to develop recommendations for--\n\n(A) how SelectUSA can increase…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690162/securing-semiconductor-supply-chains-act-of-2025"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…the authority to utilize the Department of Energy's  national labs to identify and develop new technologies related to  biodefense, they have yet to take advantage of this resource.\n\nMy legislation will advance America's bioweapon defense posture by  directing the Secretary of Homeland Security to conduct an assessment  of how, if at all, DHS has utilized…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688731/dhs-biodetection-improvement-act"}, {"senator": "Vince Fong", "party": "Republican", "sentence": "…Temporary Assistance for Needy Families program was created to  strengthen families, reduce dependency, and ensure children can be  cared for in their own homes.\n\nPregnancy resource centers, especially in rural communities, clearly  advance those goals. However, under the Biden administration, a  proposed rule was issued that singled out pregnancy centers…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699225/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "…in a little while, we are going to vote to  proceed to S.J. Res. 62, which I introduced with Senator Hoeven to  repeal the Biden administration's Bureau of Land Management resource  management plan for North Dakota.\n\nOf course, H.J. Res. 105, which mirrors our bill, introduced by  Congresswoman Fedorchak, has already passed the House of  Representatives,…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696136/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…training resources.--The       Director shall coordinate with the Administrator of the Small       Business Administration regarding the distribution and use       through the resource partners of the Small Business       Administration of the resources described in paragraph (1).\n\n``(5) Voluntary resources.--The use of the resources       described in paragraph…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700127/small-business-artificial-intelligence-advancement-act"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…is foundational--economically,  strategically, and culturally.\n\nThe 10-02 area of ANWR, the coastal plain, is the most studied piece  of land in Alaska and one of the most resource-rich energy basins in  North America. Congress set this area aside specifically because of its  oil and gas potential, and Congress has twice mandated that it be  leased for…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696831/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…to visit it multiple times. It reminds me of Alaska,  my home State. It is extraordinarily beautiful in so many ways. It is  also, like Alaska, very geostrategic. It is a resource-rich area just  like my State of Alaska. We have cultural connections thanks to the  Inuit people, who migrated from Alaska to Greenland centuries ago. We  see that. We see…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698821/9999"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…under chapter 8 of title 5, United States Code, of the rule  submitted by the Bureau of Land Management relating to ``Buffalo Field  Office Record of Decision and Approved Resource Management Plan  Amendment'', and ask for its immediate consideration in the House.\n\nThe Clerk read the title of the joint resolution.\n\nMr. WESTERMAN.  Res. 130.\n\nMr. Speaker,…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696879/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…dominance, securing critical minerals,  and investing in nuclear power. We uphold stewardship by protecting  public lands, supporting wildland firefighters, ensuring responsible  resource management, and fulfilling our obligations to our Tribal  nations.\n\nAll of this is achieved while cutting waste and keeping total fiscal  year `26 spending below the current…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698749/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…stability, and examine every issue with the care required to secure a  better future for Warminster residents.\n\nBeyond her elected service, Ms. Hoover has been an invaluable  resource to constituents in her part-time role with the Office of State  Representative Brian Munroe. In that capacity, she has assisted  residents of Warminster Township and the 144th…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697487/recognizing-warminster-township-board-of-supervisors-judy-hoover"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…administration's rule, oil and gas companies were  only required to complete these reports when BOEM, the Bureau of Ocean  Energy Management, had a reason to believe an archeological resource  may be present.\n\nInstead, the Biden administration made that archeological report  mandatory, even when it was clearly unnecessary.\n\nThese unnecessary reports would lead…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688634/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…researching youth mental health and grief, then  redesigning the children's waiting room at Valerie House to create a  more welcoming space. She repainted the room and assembled a resource  box filled with toys and activities to support the well-being of  grieving children. Her efforts will have a lasting positive impact on  the community.\n\nOn behalf of the…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690441/recognizing-dakota-partelow-gold-award"}]