[{"senator": "Brad Sherman", "party": "Democrat", "sentence": "…to work with a bipartisan group of Members to  remove an outdated and unnecessary regulatory barrier.\n\nFinally, the Access to Small Business Investor Capital Act seeks to  resolve the AFFE issue with BDCs being removed from indices by  eliminating the double counting of fees and, consistent with this  intent, it is expected that comparable 1940 Act…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697831/increasing-investor-opportunities-act"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…deicing equipment and structures but not the storage facilities that  house that equipment. It is almost comical, but this is a serious issue  and something that we have to resolve.\n\nThis is a commonsense piece of legislation that we have gotten  together in a bipartisan way here to address.\n\nH.R. 3423 would address this oversight by clarifying that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695008/facility-for-runway-operations-and-safe-transportation-act"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…paid while you are out? That is what they did.\n\nMr. Speaker, the time has come to get this done finally, to make some  kind of an effort to reach a bipartisan solution and resolve this  crisis that was created entirely by my Republican colleagues, that was  totally avoidable, that they decided to run into the fire anyway.\n\nLet's fix this. Let's protect…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697216/medical-bills-are-too-high"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…happening to the Palestinians. For those who would  claim that they have no reason to be, that this is just something that  we should allow the Israelis and the Palestinians to resolve, here is  my retort. Your tax dollars, your tax dollars are fueling the genocide  that is taking place. If you wanted to do something about it, you  wouldn't fund it. Those…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695338/dark-days"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…conflict with each other. One law says  you can grant the waiver, and the other law says if something was  struck down through the CRA, nothing similar can be done.\n\nHow are we to resolve this? My colleagues have no answer. They have  taken us down a path where words have no meaning and where sheer power  by one of the richest enterprises in America--the fossil…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691625/congressional-review-act"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…the root of the problem. The underlying cause behind the IBLA's  delays is a lack of capacity and resources.\n\nThe Board has stated it does not have the resources needed to resolve  every appeal filed every fiscal year. Instead  of setting more deadlines that we know the IBLA can't meet, we should  be appropriately staffing our agencies and review boards…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691036/expedited-appeals-review-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…forward.\n\nI contrast it today with what we are faced with: full-scale battles  and war over immigration in cities across this country. It is  unnecessary. There are ways to resolve this fairly, humanely, and in an  American fashion. I hope the Senator from Oregon agrees with me.\n\nIt is time for us to sit down and do this. Hiring more ICE agents is  not…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696348/trump-administration"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…parent, child, sibling, or friend whose life has been altered  by a diagnosis. The grief that follows the loss of a loved one to  cancer is profound, and it strengthens our resolve to do everything in  our power to prevent this disease wherever possible.\n\nThis month reminds us that while cancer has affected so many lives,  there are meaningful steps…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700185/recognizing-national-cancer-prevention-month"}, {"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "…Kansas City AFL-CIO, Mr.  Thomas continues to provide leadership and vision for the future. Those  who have worked with Reggie know him as a man of principle, integrity,  and resolve. He is respected by colleagues, union members, and public  officials alike. His legacy includes not only stronger institutions but  a more empowered, united labor force in…", "date": "2025-06-20", "source_url": "https://justfacts.votesmart.org/public-statement/1692686/recognizing-reginald-l-thomas-for-his-distinguished-service-to-laborers-local-264-and-the-missouri-afl-cio"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…also responded to  humanitarian crises, assisted in natural disasters, and stood sentry in  times of peace. They are not just warfighters; they are ambassadors of  American resolve and resilience. This milestone of 250 years is an  opportunity to reflect, to honor, and to recommit.\n\nWe honor the thousands of marines who never made it home, who gave…", "date": "2025-11-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696623/recognizing-the-250th-anniversary-of-the-united-states-marine-corps"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…what  happened? DOGE and this administration came in and started  indiscriminately firing OPM employees. This even included the  congressional liaisons who help our offices resolve retirement issues  for Federal retirees.\n\nI have heard directly from my constituents who spent their careers  serving this country. These folks are now waiting months or even…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690798/pending-opm-claims"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…tired of bringing their  expertise to the Senate and basically being an automaton in a  nomination factory. So that is why there is great sympathy for us  working together to resolve this.\n\nI put forward a somewhat different version of the world from my  colleague from Oklahoma and said: Let's do a block of time where  multiple people can be debated simultaneously.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695308/cloture-motion"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…perjury that the       alien--\n\n(i) has no unpaid applicable Federal tax liability, which       is assessed and is not being disputed;\n\n(ii) has entered into an agreement to resolve any such       assessed and undisputed Federal tax liability (via an       installment agreement, an offer in compromise, or otherwise)       which has been approved by the…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697541/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…control this Chamber. You decide  what happens, and Donald Trump is not a king.\n\nI call on my Republican colleagues to find your backbones, find your  moral compass, find your resolve, do what is right, and do your jobs.\n\nI say to the American people: Keep marching. Keep speaking.", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692793/we-say-no"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…dead? And, of course, tragically, their worst fears happened.  What Omer and Itay's family have endured is beyond comprehension.\n\nI am inspired by their perseverance, by their resolve to keep calling  for the safe return of remaining hostages, even though their loved ones  are gone, and for the return of the bodies of their loved ones, which  is essential…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688408/joint-session-of-congress"}, {"senator": "Bill Hagerty", "party": "Republican", "sentence": "…terrorist-sponsoring regime but also to every adversary who  is seeking to exploit our domestic debates and internal divisions. This  resolution would signal that America's resolve can be hamstrung by  congressional hesitation at the very moment when clarity, unity, and  strength are most needed.\n\nI cannot state this strongly enough: President Trump…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693130/motion-to-discharge-sj-res-59"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…Begich of Alaska, would  finalize the Cape Fox Corporation's remaining Alaska Native Claims  Settlement Act, or ANCSA, land entitlement. In addition, this  legislation will resolve land management issues tied to the Mahoney  Lake power project.\n\nANCSA was enacted by Congress to settle the aboriginal land claims of  Alaska Natives. Under ANCSA, Alaska…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698209/cape-fox-land-entitlement-finalization-act-of-2025"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…1985, she was  recently divorced, living rent-free in a friend's home, and inspired by  a then-up-and-coming Martha Stewart.\n\nWhat she lacked in resources, she made up for with resolve, talent,  and a sparkling sense of humor. Over the next four decades, Susan Mason  Catering became synonymous with silver service, culinary perfection,  and timeless Southern…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693702/susan-mason-savannahs-style-and-service-icon"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…quiet but profound dedication to others. He was  a proud combat veteran who served in the U.S. Army's 9th Infantry  Division during the Vietnam war.\n\nThat same courage and resolve stayed with him throughout his life,  whether it was in service to his country, in business, or in leadership  with the Nassau County Ocean, Highway & Port Authority.\n\nCarrol…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694060/may-beam-continue-to-light-the-way"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…approved coverage for our fictitious applicants.       Nearly all of these fictitious applicants remained covered       after we sent fictitious documents or no documents to resolve       issues with our applications. Further, in July 2017, we found       that CMS did not design processes to verify eligibility for       APTC, including preventing duplicate…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698800/breaking-the-gridlock-act"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…through  mutual aid. When disaster strikes and the stakes are high, these men  and women grab their gear and get moving, facing flames, chaos, and the  unknown with unshakable resolve.\n\nTheir station, nestled on Dailey Hill Road, is home to a well- equipped fleet that reflects their forward-looking mindset. From modern  engines and tankers to EMS response…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693639/hornoring-the-kennedy-fire-department-on-its-100th-anniversary"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…college campuses should be treated exactly  the same as every other organization on any college campus? That should  be basic.\n\nSo I bring a very simple bill to be able to resolve that one big  issue and to say let's make this once and for all just a policy that we  have as Americans.\n\nNow, I bring this up because it needs to be addressed, but I also…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695773/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…that the skies  are darkening, that the steady advance of the grip of state power  should alarm all of us.\n\nLincoln concluded his remarks at Gettysburg saying:\n\nWe here highly resolve that these dead shall not have died       in vain--that this nation, under God, shall have a new birth       of freedom.\n\nWe have to do that again today: Call out the alarm,…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699917/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Ryan Mackenzie", "party": "Republican", "sentence": "…administration  and President Trump are speaking out about changes to our housing  situation right here in the United States.\n\nCongress is now working in a bipartisan way to resolve this issue and  bring back housing affordability. In 2025, as a part of the Working  Families Tax Cuts Act, we passed what has been called the largest  expansion ever of affordable…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699814/lowering-housing-costs-and-advancing-main-street-community-banks"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…world faced aggression in the 20th century, voices  like Winston Churchill refused to surrender to hopelessness. He spoke  truth when others stayed silent. He strengthened resolve when others  faltered. He understood that a single courageous leader speaking  plainly, boldly, and without apology could ignite the moral energy of  millions.\n\nWe are seeing…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697723/free-iran"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…approved coverage for our fictitious applicants.       Nearly all of these fictitious applicants remained covered       after we sent fictitious documents or no documents to resolve       issues with our applications. Further, in July 2017, we found       that CMS did not design processes to verify eligibility for       APTC, including preventing duplicate…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698381/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…considerable cost to the future of his  country. This is no time to permit him to claim a victory, either on  the battlefield or at the negotiating table. We must share the resolve  of Ukrainian people and make certain that Putin's invasion remains the  blunder it was when it started 4 years ago.\n\nWhile both Washington and Brussels have engaged in public…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700139/ukraine"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…saw its math scores drop to new lows with  just 20 percent of students meeting or exceeding standards.\n\nRecognizing this challenge, Mrs. Rost spearheaded an extraordinary  resolve. She retooled her instruction, built targeted interventions,  and created a classroom culture where growth in math became not just a  goal but an expectation.\n\nEach year since…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Elise Stefanik", "party": "Republican", "sentence": "…Covington and Bombay, and the New  York Power Authority.\n\nFor more than 40 years, the Saint Regis Mohawk Tribe and the Mohawk  Council of Akwesasne have worked diligently to resolve the Akwesasne  land claim in northern New York in my district. The last decade has  seen very focused efforts between the Tribe, local, and county  officials, and our congressional…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697676/resolving-the-akwesasne-mohawk-land-claim-in-the-state-of-new-york"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…I rise today to recognize the  United States Army's remarkable 2025, defined by service, sacrifice,  and strength; and filled with moments that showcase the character and  resolve of our soldiers and support teams across the globe.\n\nIn 2025, the Army marked its 250th birthday with community  celebrations and tributes to the generations that defended…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698838/recognizing-the-us-army-2025-year-in-review"}]