[{"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…that encroach on DC's Home Rule:\n\nBills like H.R. 5183, the District of Columbia Home Rule       Improvement Act, make the District less efficient,       competitive, and responsive to the needs of a highly complex       unique local government that serves local, county and state       functions. Bogging down legislative and executive action only…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696979/district-of-columbia-cash-bail-reform-act-of-2025"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…require taxpayers to borrow  another $1.6 trillion over the next 10 years.\n\nOur Nation's Founders vested in the House of Representatives the  unique set of powers to make it responsive to the will of the people.  The father of our Constitution, James Madison, said that ``the House  should have an immediate dependence on, and intimate sympathy with, the…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688039/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…ongoing       armed conflict, environmental disaster, or other       extraordinary and temporary conditions that prevent safe       return. The program is designed to be responsive to facts on       the ground, not to operate on arbitrary timelines, quotas,       and motives that ignore documented country conditions. The       Haitian community has…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699630/constituent-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…arguments against what the Department of Homeland Security, its  leadership, and what this administration has wrought on the American  people.\n\nWe serve in this body to be responsive to the American people. They  are clamoring, and they are crying out for help. We can help them with  passing five bills that meet their needs, and we can help them by  gaining…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699573/consolidated-appropriations-act-2026"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…that these young women and men are not  waiting for the future to arrive. They are shaping it. They labor to  build a society that is more just, more inclusive, and more responsive  to the needs of all people.\n\nLet us take the inspiration from their dedication. The strength of  our Nation rests in the courage and the vision of its youth.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695393/recognizing-more-action-for-students-organization"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…that encroach on DC's Home Rule:\n\nBills like H.R. 5183, the District of Columbia Home Rule       Improvement Act, make the District less efficient,       competitive, and responsive to the needs of a highly complex       unique local government that serves local, county and state       functions. Bogging down legislative and executive action only…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695559/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Jan Schakowsky", "party": "Democrat", "sentence": "…trust that Kathryn's work would be handled  with care, diligence, and respect for the people we serve.\n\nOver the years, Kathryn earned a strong reputation as a thoughtful,  responsive, and reliable member of my team. She coordinated the  office's participation in the Congressional App Challenge, engaging  with high school students across the district as…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699929/recognizing-the-service-of-kathryn-angell"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "…Homeland Security and protect civil rights and civil liberties in the  post-9/11 era.\n\nThe teams at GAO led by Mr. Dodaro have made Americans safer, made  their government more responsive, and saved them money. It is because  of GAO's audits of Federal Emergency Management Agency (FEMA) grant  programs and response efforts that Americans facing natural disasters…", "date": "2025-12-23", "source_url": "https://justfacts.votesmart.org/public-statement/1698469/recognizing-the-service-of-us-comptroller-general-gene-l-dodaro"}, {"senator": "Raphael Warnock", "party": "Democrat", "sentence": "…more than 9,000 degrees in social work and nonprofit  management and leadership while strengthening the University of  Georgia's academic excellence by preparing culturally responsive  practitioners and scholars to be leaders in addressing social problems  and promoting social justice, locally and globally, through teaching,  research, and service.\n\nThroughout…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688815/recognizing-the-60th-anniversary-of-the-university-of-georgia-school-of-social-work"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…that encroach on DC's Home Rule:\n\nBills like H.R. 5183, the District of Columbia Home Rule       Improvement Act, make the District less efficient,       competitive, and responsive to the needs of a highly complex       unique local government that serves local, county and state       functions. Bogging down legislative and executive action only…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696933/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…Board to develop a  written plan to remedy deficiencies like those to be identified during  the review process. This review and remediation will lead to more  accessible, responsive, and secure discount window operations.\n\nMr. Speaker, I encourage my colleagues to support this bill.", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699860/bringing-the-discount-window-into-the-21st-century-act"}, {"senator": "Ilhan Omar", "party": "Democrat", "sentence": "…legislation to require mental health training for  teachers and expanded crisis and early intervention services. Thanks to  Sue's unwavering commitment to expanding culturally responsive, person- centered mental health care, our communities are safer and healthier.\n\nMr. Speaker, I am grateful for her years of service, and I hope she  has a wonderful retirement.", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691125/recognizing-sue-abderholden"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…bipartisanship. What a great  way to start off the week.\n\nI again say, in the interests of modernization, saving important  taxpayer dollars, and making sure that we are more responsive to the  American people, I urge all of my colleagues to vote in favor of this  legislation. I thank Mrs. Bice again for her bipartisanship, and I  yield back the balance…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689323/repeal-requirement-for-congressional-research-service-to-prepare-annotated-constitution-and-supplements-in-hardbound-version"}, {"senator": "Doris Matsui", "party": "Democrat", "sentence": "…Fire is a vital safeguard for the lives of over 720,000  Sacramentans across a 359-square-mile area. From humble beginnings, it  has evolved into one of the largest and most responsive fire agencies  in California, operating 41 state of the art fire stations  strategically positioned across the region. Sacramentans can rest  assured knowing Metro Fire's…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698078/recognizing-sacramento-metropolitan-fire-districts-25th-anniversary"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…The Boston Passport Agency tirelessly serves the public trust. Day in  and day out, agency professionals uphold the highest standards of  security, while delivering the responsive, compassionate service  Commonwealth residents have come to know and appreciate. Whether it is  assisting a college student preparing for a semester abroad, a  grandmother…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695617/recognizing-the-boston-passport-agency"}, {"senator": "Mario Diaz-Balart", "party": "Republican", "sentence": "…nearly a $10 billion cut, in recognition of the  President's and the Secretary of State's effort to make the Department  of State, frankly, more efficient, streamlined, and responsive to the  national security priorities.\n\nWithin these really, I think, dramatic but necessary reductions, the  bill will make sure that the Secretary has the resources that…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699051/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…support of H.R. 1155, the Recovery of  Stolen Checks Act.\n\nWith the April 15 tax filing deadline right around the corner, we are  reminded of the need to make the IRS more responsive to the American  people. Unfortunately, the manner in which the IRS currently responds  to stolen tax refund checks is truly insane.\n\nRight now, if someone has their refund…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689291/recovery-of-stolen-checks-act"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…every community across this  Nation.\n\nMr. Speaker, by restoring their collective bargaining rights, we  strengthen a system that keeps government effective, stable, and  responsive, all without compromising security or mission readiness.\n\nReinstating these rights is not a concession. It is a commitment, a  commitment to treat federal workers with dignity,…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697991/protect-americas-workforce-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…burst capability, and       effective range between 15 and 70 kilometers.\n\n4. The Extended Range Guided Multiple Launch Rocket System       (ER GMLRS) provides a persistent, responsive, all-weather,       rapidly deployed, long-range, surface-to-surface, area- and       point-precision strike capability. The M403 Alternative       Warhead variant carries…", "date": "2025-10-02", "source_url": "https://justfacts.votesmart.org/public-statement/1695978/arms-sales-notification"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "…detailed report to Congress on stakeholder  outreach and engagement.\n\nMy bill ensures that the Urban Area Security Initiative and the State  Homeland Security Program grants are responsive to local needs and  truly effective in protecting our communities.\n\nThe coordination between local, State, and Federal Government is all  the more important as we face increasing…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696945/enhancing-stakeholder-support-and-outreach-for-preparedness-grants-act"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…measurement and integrated modeling, with an emphasis on--\n\n``(A) enhancing activities to achieve improved snow and       water supply forecasting results that are more responsive to       changing weather and watershed conditions;\n\n``(B) real-time integration of activities described in this       section with water supply forecasts;\n\n``(C) activities…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697627/snow-water-supply-forecasting-reauthorization-act-of-2025"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…Mayor Taylor has  responded to emergencies in the middle of the night, helped families in  their moments of greatest need, and ensured that Langhorne's government  remained responsive, compassionate, and responsible. His legacy is  built on countless acts of service which are many unseen, but all  deeply felt.\n\nToday, we express gratitude not only for…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697645/commending-mayor-joe-taylor-for-his-dedicated-service-to-langhorne-borough"}, {"senator": "John Thune", "party": "Republican", "sentence": "…farmers and ranchers through the economic  headwinds they continue to face.\n\nOur bill increases reference prices for every covered commodity and  makes these prices more responsive to market conditions in the coming  years. It increases crop insurance coverage and affordability. It  supports livestock producers by making existing programs more  responsive…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698212/senate-accomplishments"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…make sure that laws  are faithfully executed by the executive branch of government. I expect  Linda McMahon to respond to all the congressional inquiries in a timely  and responsive manner.", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688387/nomination-of-linda-mcmahon"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…qualified public companies  in good standing to use automatic shelf registration. This reduces the  cost and complexity of a public offering and allows companies to be  more responsive to market conditions.\n\nThe WKSI construct has a track record of success in expanding access  to public markets while protecting investors.\n\nAccording to Joel Trotter, one…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697266/expanding-wksi-eligibility-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…chronic disease, whether it be heart disease,  diabetes, or cancer.\n\nSo many Americans would benefit from having healthcare coverage that  is not only more affordable but more responsive to their needs so that  they can better manage their health.\n\nLast Congress, the House of Representatives approved a version of  this legislation, but unfortunately, we were…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688475/chronic-disease-flexible-coverage-act"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…and helped lead one of  the most active offices in the State assembly. Our team delivered real  results for the Hudson Valley and built a reputation for being  accessible, responsive, and relentless when it came to constituent  services.\n\nWhen I was elected to Congress, Nate once again stepped up, first as  deputy chief of staff and communications director…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699118/recognizing-and-thanking-nate-soule"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "…lands,  fostering economic growth, and empowering our communities. They are  about letting ranchers, families, small businesses, and entrepreneurs  benefit from thoughtful and responsive government as opposed to  government that drowns out their voices and ignores their needs.\n\nMr. Speaker, I urge my colleagues to support these measures, which  offer pragmatic…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689196/work-highlights-of-western-caucus"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…that? They said the FBI is producing records ``in response to  longstanding inquiries by Republicans on Capitol Hill.'' The House and  Senate have finally begun to receive responsive productions to our  oversight requests as the New York Times has correctly stated. Some of  those requests date back many years. Indeed, some requests date back to  the first…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699769/whistleblowers"}, {"senator": "Mike Johnson", "party": "Republican", "sentence": "…future. We  have a secure border to protect American families. We have a strong  military to restore peace through strength. We have a government that  is now accountable and responsive to the people once again.\n\nThat is what we are delivering. For everyday Americans, this means  real, positive change that they can feel, and they will feel much more  when…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693177/one-big-beautiful-bill-act"}]