[{"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…burdens imposed by a       British parliament an ocean away. That parliament, meanwhile,       grew frustrated by what leaders saw as Americans' efforts to       evade the responsibilities of being part of the British       Empire.\n\n``The British were trying to raise money by capturing       vessels that were sneaking stuff in and not paying duty,''…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691707/253rd-anniversary-of-the-gaspee-raid"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…potentially choke off  further information to the Congress.\n\nThe Constitution demands otherwise. The Founders split the  government's wartime powers, just as they divided responsibilities for  so many other things. It is Congress which declares a war, which raises  an army and a navy and pays for the financial cost of defense and war.\n\nAnd keep in mind…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693120/motion-to-discharge-sj-res-59"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…for Telecommunication Sciences, or ITS, is the premier  engineering laboratory of the National Telecommunications and  Information Administration, NTIA.\n\nAmong its many responsibilities, ITS manages various technology  development programs for NTIA and the Department of Commerce and  oversees cutting-edge studies concerning the use of our country's  airwaves.…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693437/institute-for-telecommunication-sciences-codification-act"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…we       reached out to NCUA on July 30, 2025. We received NCUA's       response on August 14, 2025.                                  BACKGROUND       NCUA's Role and Responsibilities\n\nNCUA is an independent federal agency which ``insures       deposits at [FICUs], protects the members who own credit       unions, and charters and regulates federal…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699835/government-accountability-office-opinion-letter"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…interagency agreements which  would offload core functions of the Department of Education and spread  them across other Federal agencies.\n\nYet this bill assigns additional responsibilities to what is left of  the Department of Education. It simply doesn't add up. Who will be left  in the Department of Education to enforce these mandates?\n\nFor these reasons,…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697410/combating-the-lies-of-authoritarians-in-school-systems-act"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…chaotic policies of the       administration. Punishing them because their local       governments instituted policies to draw a line between local       law enforcement responsibilities and federal immigration       enforcement will only deepen inequities and disrupt local       economies.\n\nH.R. 2966 adds insult to injury by imposing sweeping new…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692125/american-entrepreneurs-first-act-of-2025"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…funding to meet that obligation.\n\nLastly, we have to note that the Trump administration is in the  process of trying to abolish the Department of Education, with key  responsibilities being shifted to other agencies. We are left with a  chaotic patchwork of authority and no one apparently left to actually  administer the provisions of this bill.\n\nFor…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697533/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…this funding so that States can connect as many Americans as  possible to fast, reliable, and affordable internet.\n\nCongress has also tasked NTIA with other meaningful responsibilities.  The agency manages Federal spectrum and its users, as well as  coordinates with the Federal Communications Commission to ensure that  our airwaves are effectively managed…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690254/national-telecommunications-and-information-administration-reauthorization-act-of-2025"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…that immigration enforcement is the job of the Federal Government and  that State and local authorities cannot be co-opted or forced into  performing inherently Federal responsibilities. It means that while  Federal Agencies carry out immigration enforcement, State and local law  enforcement will choose to focus their time, their energy, their  resources…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700066/9999"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…the middle class, working families, and future  generations.\n\nMy district has asked me: Where is the solution to this?\n\nIt rests right in this Chamber. Let us assume the responsibilities,  the duties, the authority, and the power we have by the Constitution  with the power of the purse placed in our hands here in the House of  Representatives. Let's act…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688070/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "…responsible for sending people to  face persecution, especially those who have risked everything to seek  refuge right here. These actions not only violate our moral  responsibilities and our shared humanity, but they are in direct  conflict with the values upon which our Nation was founded.\n\nI am the proud daughter of immigrants from Iran. My parents…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688337/migrants-fleeing-religious-persecution"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…celebrate the multiple cultures and diversity of this country.\n\nThe administration is trying to dismantle Tribal schools, which were  created because of our trust and treaty responsibilities, trying to  turn them into a voucher program and school choice. There are no  choices in many of our rural and Tribal communities. The choice is to  keep our Tribal schools…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689636/impact-of-trump-administration-anti-dei-actions"}, {"senator": "Katherine Clark", "party": "Democrat", "sentence": "…creation.''\n\nGuiding the world's 300 million Eastern Orthodox Christians since his  election in 1991, Ecumenical Patriarch Bartholomew has been a powerful  voice for our common responsibilities to one another--our shared  obligation to defend the freedom, dignity, and wellbeing of our  neighbors and of future generations.\n\nI am especially grateful for the impact…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695285/welcoming-ecumenical-patriarch-bartholomew-to-washington-dc"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…living up to the Founders' goals.\n\nMr. Speaker, I urge my colleagues on both sides of the aisle to  examine their conscience, renew their courage, and carry out the  responsibilities that the first Article of the Constitution demands.  Only in that way can we ensure that our 250 years will be a preface to  a stronger and brighter beacon in a free and…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698817/retirement-announcement-of-steny-hoyer"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…This bill would  support family caregivers by reauthorizing the Lifespan Respite Care  Program, which allows full-time caregivers to take a temporary break  from their responsibilities caring for aging or disabled loved ones.\n\nAcross the country, there are over 53 million Americans who currently  provide uncompensated care for their families, which provides…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688456/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…cybersecurity policy efforts before the Commission, Congress,       and elsewhere;\n\n``(H) provide advice and assistance to the Assistant       Secretary in carrying out the policy responsibilities of the       NTIA with respect to cybersecurity policy matters, including       the evaluation of the impact of cybersecurity matters pending       before the Commission,…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693497/ntia-policy-and-cybersecurity-coordination-act"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…sides of the Capitol.\n\nEnacting this package will represent a major milestone and show that  Congress can work together in a bipartisan manner to carry out our  article I responsibilities and deliver real results for the people that  we are honored to represent.\n\nAgain, my thanks to the leadership and to the committee members and,  of course, to our great…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699433/consolidated-appropriations-act-2026"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…noted that the Lumbee community has no  treaties with the Federal Government, no reservation land, and no  common language.\n\nAs Members of Congress, one of our most solemn responsibilities is to  ensure that laws are applied fairly, objectively, and consistently.\n\nFor over 40 years, the Department of the Interior through the Office  of Federal Acknowledgement…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697785/ensuring-fairness-and-integrity-in-federal-tribal-recognition"}, {"senator": "Andy Ogles", "party": "Republican", "sentence": "…Federal agencies have taken important steps to respond, the  overall effort has revealed significant challenges in the way our  government organizes its cybersecurity responsibilities. Multiple  agencies share roles in protecting critical infrastructure, but they  operate under different missions, structures, and authorities. Through  fast-moving or…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696757/strengthening-cyber-resilience-against-state-sponsored-threats-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…the notice and removal process       established under paragraph (1)(A) that--\n\n(A) is easy to read and in plain language; and\n\n(B) provides information regarding the responsibilities of       the covered platform under this section, including a       description of how an individual can submit a notification       and request for removal.\n\n(3) Removal…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690186/tools-to-address-known-exploitation-by-immobilizing-technological-deepfakes-on-websites-and-networks-act"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…Chairman Cole  that doing the right thing for the American people is something that  does not get old.\n\nCongress holds an explicit mandate that is outlined in our Article I  responsibilities to appropriate funding for the missions of departments  across the government. When we fail to uphold that mandate, we fail to  serve the American people. We fail to do…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699591/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…decades--including Business Agent, Delegate, Trustee,  Steward, Legislative Coordinator, and Health & Welfare Fund Trustee and  has received substantial training in fiduciary responsibilities and  public employee benefit trusts.\n\nHer community involvement has been no less impressive. Ms. Hoover has  served as a Township Auditor, a Township Supervisor, and Secretary.…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697487/recognizing-warminster-township-board-of-supervisors-judy-hoover"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…fraud, waste, and  abuse is on display for all Americans, not only in Minnesota, but all  across this country, we find it unacceptable. We believe that one of  our first responsibilities here in the people's House is to steward the  people's sacred treasure.\n\nWe put financial controls, anti-fraud measures, and, again, program  integrity reforms so that…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699637/supporting-safety-net-services"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…first say that screaming doesn't make up for  substance.\n\nIn closing, the rule I presented today, H. Res. 1032, enables the  House of Representatives to carry out its responsibilities and to  govern in an orderly and fair manner for the American people.\n\nAs a reminder, a ``yes'' vote on this rule enables us to consider  legislation that ends the Democrats'…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699590/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Nathaniel Moran", "party": "Republican", "sentence": "…case backlog. It  does this by allowing special trial judges, who are experienced legal  professionals who already handle much of the court's work, to take on  additional responsibilities with the consent of the taxpayer. If the  taxpayer agrees, these special trial judges can hear certain additional  matters, issue final decisions in specific cases, and…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697270/tax-court-improvement-act"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…protect the  criminals and ignore victims. The D.C. CRIMES Act puts an end to this  madness and ensures safety and security across D.C.\n\nAt 18 years old, you are given adult responsibilities, like being  able to vote or sign up for the military. At 18 years, you become  responsible for your  choices and your decisions and should be treated as such. At 21 years…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695556/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…assured that the nominee does not       have any interests which could conflict with the interests of       the government in the exercise of the nominee's proposed       responsibilities; (4) for persons nominated to be chief of       mission, ambassador-at-large, or minister, the committee has       received a complete list of any contributions made by…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691700/us-senate-committee-on-foreign-relations-rules-of-procedure"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…Card Exchange, and Young Professionals Summits, Susan  has created career development and community building opportunities.\n\nSusan's impact reaches far beyond her formal responsibilities Her  tireless work ethic, meticulous attention to detail, and steadfast  support for others have made her a cherished mentor and friend. She has  played a vital role in…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694735/recognizing-susan-harkins-for-45-years-of-service-with-the-lower-bucks-county-chamber-of-commerce"}, {"senator": "Laurel Lee", "party": "Republican", "sentence": "…to destroy themselves or to  harm others is child abuse. It is criminal, and it will be prosecuted.\n\nMadam Speaker, protecting children is one of Congress' most solemn  responsibilities. H.R. 6732 is a necessary, targeted, and responsible  response to a real and growing threat.\n\nI urge my colleagues to support this bill.", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698877/coercion-and-sexual-abuse-free-environment-act"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…international  telecommunication forums, and developing cybersecurity policy.\n\nAs the chairman has mentioned, Congress has not reauthorized NTIA  since 1992, before many of these responsibilities existed or were  relevant. This legislation ensures that NTIA has the right structure  and resources to fulfill its 21st century mission as directed by  Congress.\n\nToday's…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690256/national-telecommunications-and-information-administration-reauthorization-act-of-2025"}]