[{"senator": "Terri Sewell", "party": "Democrat", "sentence": "…this: This bill also requires States to turn over personal identifiable  information to the Department of Homeland Security, the same Department  whose rogue agents are responsible for the deaths of two American  citizens in Minnesota.\n\nHere is the truth: Under this bill, tens of millions of eligible  American voters will be blocked from casting their…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700009/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…expertise in public  health or environmental protections, would just be able to stop another  agency's regulation meant to protect public health.\n\nThese are regulations that are responsible for safe drinking water,  for  reducing air pollution, and preventing exposure to cancer-causing  chemicals. We are not just talking about price increases here that the…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698275/reliable-power-act"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…coordinated all the rooms JCCIC needed to hold guests and other  Inauguration Day assets, accommodating special requests, furniture, and  catering. Elizabeth was additionally responsible for the signing  ceremony in the President's Room.\n\nAs platform director, Jordan ensured the platform was ready to hold  more than 1,300 guests, each with a specific seat…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691709/recognizing-the-joint-congressional-committee-on-the-inauguration"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…their wealth--from getting climate  right. So this is a two-sided equation: Continue to fail and ignore it  and these warnings of economic calamity become our future. Be  responsible and get it right and greater wealth and prosperity become  our future.\n\nA third of global GDP lost in this century if the climate crisis and  the polluters causing it are…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699613/9999"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…three bills that fail to  make consumers safer and stifle innovation, Congress should instead  consider a comprehensive regulatory framework for crypto that will  promote the responsible development of these digital assets while  protecting American consumers and investors. I urge my colleagues to  reject H.R. 3633, S. 1582, and H.R. 1919.", "date": "2025-07-25", "source_url": "https://justfacts.votesmart.org/public-statement/1694254/9999"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…Specialist and later as a Library  Media Specialist. Her talent for instructional leadership led her to  Middletown, Connecticut, where she became an Instructional Consultant  responsible for diagnostic testing and monitoring literacy and math  programs. In 1987, JoAnne made history as the first Black principal in  the Hamden Connecticut School District.…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698084/the-year"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…slamming him onto the pavement, and handcuffing him as he  bled out.\n\nSilverio didn't make it. DHS' story doesn't add up.\n\nA man is dead. A family is shattered, and the agency responsible  keeps hiding behind masked thugs and unmarked cars. I use that term  because that is how so many agents are acting, either voluntarily or  not.\n\nICE and DHS have no credibility,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695742/ice-and-dhs-lost-credibility"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…with ICE. The American public gets it.  They understand it. This is a marauding band of masked and armed agents  all over our streets, terrorizing our communities and being responsible  for the killing of Renee Good and Alex Pretti. It is unconscionable.\n\nThe Democrats have made reasonable demands for reform, reforms that  have been in the public view…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700220/homeowner-energy-freedom-act"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…Even more damaging, we have seen highly sensitive intelligence  declassified and released, clearly for political purposes, without  proper coordination with the Agencies responsible for protecting  sources and methods--that is how we do our work and who are the people  involved. The disclosures actually risked revealing the identities of  assets--and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695695/authorizing-the-en-bloc-consideration-in-executive-session-of-certain-nominations-on-the-executive-calendar"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…the gas industry and their lobbyists want carte blanche to export  gas to anyone, even our foreign adversaries.\n\nNow, under current law, the U.S. Department of Energy is responsible  for authorizing exports of domestically produced gas to foreign  countries. In doing so, DOE makes a determination whether or not that  export is consistent with the public…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697080/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…at the  source.\n\nThe Save Our Seas 2.0 Amendments Act reauthorizes the Marine Debris  Program so communities can keep doing this important work. It also  makes targeted, responsible administrative fixes to the Marine Debris  Foundation, so the public-private partnerships deliver results faster  and more effectively.\n\nThe Senate passed this bipartisan…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698190/save-our-seas-amendments-act"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…pregnant and parenting       students. Education Secretary Linda McMahon fired nearly       half of Department staff--with the Office for Civil Rights       (OCR), which is responsible for ensuring schools comply       with federal civil rights laws, being particularly       impacted. And Secretary McMahon also closed most of OCR's       twelve regional…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699317/pregnant-students-rights-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…day  against that motion to dismiss the charges. He said there was nothing  that could be done, even though Donald Trump was actually, factually,  ethically, and morally responsible for everything that happened.\n\nWhen will my colleagues finally break from the cultish obedience to  Donald Trump, who is now over in the Middle East on what looks like a…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691349/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…agenda to dismantle the Department of Education.  President Trump has even said that he hopes that Mrs. McMahon ``puts  herself out of a job.''\n\nThe Department of Education is responsible for distributing funds to  K-12 schools and administering Pell grants, the Federal Student Loan  Program, and programs that help support students with disabilities.  Already,…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688592/confirmation-of-linda-mcmahon"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…stakeholders to align Federal  resources with local needs.\n\nThe bill would maintain full compliance with Federal environmental  standards, including NEPA and FLPMA, ensuring that responsible growth  and environmental stewardship go hand in hand.\n\nFinally, the bill would simplify mineral sales during land grading,  cutting delays when competition is not feasible…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691120/apex-area-technical-corrections-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…Secretary from among individuals       the Secretary considers qualified to perform the duties of       the position;\n\n``(B) report directly to the Secretary; and\n\n``(C) be responsible for carrying out the functions of the       Office set forth under subsection (c).\n\n``(c) Function.--The functions of the Office are as       follows:\n\n``(1) Carrying out…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693967/protecting-regular-order-for-veterans-act-of-2025"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…annual surveys recorded  the defendant agency, plaintiff category, and case results, showing  that special interest groups, not individual citizens or communities,  were responsible for the most NEPA cases.\n\nAlthough these CEQ studies provided useful data on the cumbersome  review timelines and resource strains resulting from NEPA analysis,  they have…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697711/studying-nepas-impact-on-projects-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…another lost her  rental property, the team prioritized the welfare of the community,  working tirelessly to ensure safety and stability for all. Post-storm,  the team was responsible for helping shelter residents whose homes were  no longer safe, find appropriate alternatives for housing. Their  dedication shone through in rapid response efforts. In…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691174/recognizing-maria-wilkinson"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…tourism,  and strong sense of community. Throughout his time in public service,  Mayor Keller has worked diligently to preserve the character of the  borough while supporting responsible growth, public safety, and  economic vitality.\n\nAs Mayor, Larry Keller placed a strong emphasis on collaboration  between borough council, local businesses, residents, and…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699203/congratulating-larry-keller-on-his-service-as-mayor-of-new-hope-pennsylvania"}, {"senator": "Bernie Moreno", "party": "Republican", "sentence": "…businesses, and  our long-term competitiveness against geoeconomic rivals like China.\n\nAs Under Secretary, Mr. Kimmitt will lead the International Trade  Administration and will be responsible for: No. 1, promoting market  access for American goods and services; and No. 2, enforcing our trade  laws to combat unfair practices. Both functions are critical to our…", "date": "2025-07-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694342/confirmation-of-william-kimmitt"}, {"senator": "John Thune", "party": "Republican", "sentence": "…textbooks--well, that  comes from State and local governments and from private sources. But  while the Federal Government provides a small percentage of education  funding, it is responsible for an outsize amount of bureaucracy and  mandates in education. More often than not, it is these policies that  are holding back school districts from innovating and ultimately…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688343/nomination-of-linda-mcmahon"}, {"senator": "Tom Kean, Jr.", "party": "Republican", "sentence": "…built not only on the courage of its members but also on the  support of the community it serves. Comprised of more than 65  volunteers, the Liberty Corner Fire Company is responsible for  providing fire and rescue service 24 hours a day, 365 days a year to  the Liberty Corner section of Bernards Township. Through community  fundraising events and donations,…", "date": "2025-08-26", "source_url": "https://justfacts.votesmart.org/public-statement/1694757/recognizing-liberty-corner-fire-companys-115th-anniversary"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…undergo strict reviews.\n\nThe Treasury Department announced today that they are taking action  to ensure no tax benefits will go to illegal aliens.\n\nThis year, we advanced a responsible budget, along with President  Trump, to reflect our well-established goal to return to pre-COVID  spending.\n\nLet's look at more. This Congress, working with the President,…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697130/congress-is-back"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…without direction and consumers  without protection.\n\nThe CLARITY Act addresses that gap. It defines the role of the SEC  and CFTC, establishes clear rules of the road for responsible  innovation, and protects the rights of Americans to hold and use their  own digital property.\n\nAt the same time, the Anti-CBDC Surveillance State Act, which I  cosponsor,…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693545/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…2025.                                  BACKGROUND       BLM Public Land Management\n\nUnder the Federal Land Policy and Management Act of 1976,       as amended (FLPMA), BLM is responsible for developing,       maintaining, and, when appropriate, revising ``land use plans       which provide by tracts or areas for the use of the public       lands.'' BLM land…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695880/government-accountability-office-opinion-letter"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…welcomed this fiscal sanity.\n\nThe reality is, our national debt is unsustainable. If every single  household was to contribute and bring our debt to zero, we would each  be responsible for $289,000. Consider that the average mortgage in  America is about $245,000. No one in this body would allow a loved one  to make continuously poor financial decisions…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695600/we-are-better-together"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…again: It does not cut Medicaid for any U.S. citizen  who needs it. It does strengthen the system and makes sure it benefits  the people who really need it. We need to be responsible to the  taxpayers, and we are going after waste, fraud, and abuse.\n\nI will say it, again: Anyone who needs Medicaid will have it.\n\nMr. Speaker, as expected, my colleagues…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691940/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…leaders to move ahead with planned capacity and safety improvements to  the Crow Creek Reservoir without running into red tape and wasting  taxpayer money.\n\nThis is a fiscally responsible bill that will cut costs for the local  community and for the Forest Service. A land transfer will allow the  City to advance upgrades to the Crow Creek Reservoir. H.R.…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697754/dalles-watershed-development-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…produce this. They did, and we believe it is already way out of  date because of the change in interest rates--Social Security and  Medicare and their interest carry are responsible for almost  functionally every dime of debt from today through the next 30 years.  It is $116-some trillion of debt.\n\nThe rest of the budget actually has about a $9 trillion…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688088/republican-budget"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…disburse money to  Alaska Natives. The Cape Fox Corporation, or CFC, has yet to receive  their full conveyance, with 180 acres remaining.\n\nThe Bureau of Land Management is responsible for conveying the  remaining acres to CFC and has proposed specific acreage to complete  the entitlement. However, CFC has rejected the BLM's proposal, as the  proposed…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698209/cape-fox-land-entitlement-finalization-act-of-2025"}]