[{"senator": "André Carson", "party": "Democrat", "sentence": "…ethnic minorities throughout the Democratic Republic of the Congo. It  reaffirms that the United States has held and continues to hold the  governments of the DRC and Rwanda responsible for upholding the rights  of all citizens, regardless of ethnicity, in accordance with  international obligations.\n\nMy timely resolution also holds accountable all state…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699456/reintroduction-of-the-resolution-to-condemn-the-ethnic-violence-in-the-democratic-republic-of-the-congo"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…PFAS as hazardous air pollutants, this bill sets the  foundation for strong, science-based standards that will reduce  emissions. The PROTECT Act also holds major polluters responsible for  the cleanup of these poisons, delivering real transparency and  accountability to affected communities.\n\nMr. Speaker, I thank my bipartisan cosponsors from Michigan…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698778/removing-pfas-from-our-environment"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…Administration is  dangerously close to dragging us into a disastrous and unauthorized  war, this bill does not do enough to reinforce Congress's role as a co- equal branch responsible for matters of war and peace.\n\nTo be clear, the bill contains many provisions I am proud of. As the  Ranking Member of the Readiness Subcommittee, I fought for military…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697806/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…needs now to protect our  shores, keep our maritime moving, and the Coast Guard and its  responsibilities need the support of this legislation.\n\nAll in, the Coast Guard is responsible for facilitating over $5  trillion of maritime commerce in our waterways. The Coast Guard is also  the sole operator of icebreakers in our polar regions, and they are our…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688520/coast-guard-authorization-act-of-2025"}, {"senator": "Valerie Foushee", "party": "Democrat", "sentence": "…story of a Federal scientist, in  their own words, who was fired by President Trump and Elon Musk.\n\nI worked for the Department of Health and Human Services. I       was responsible for leading technical oversight over the       Organ Procurement and Transplantation Network in order to       ensure patient safety, maximal usage of donated organs,…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688136/fired-by-president-trump"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…choose compassion or cruelty.\n\nI know Democrats will keep fighting. We will keep speaking truth to  power, and we will make damn sure that the public knows exactly who is  responsible when services disappear, when costs go up as a result of  these crazy tariffs, and when families are left behind.\n\nI urge my colleagues to reject these bills, to reject…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692265/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…expertise in public  health or environmental protections, would just be able to stop another  agency's regulation meant to protect public health.\n\nThese are regulations that are responsible for safe drinking water,  for  reducing air pollution, and preventing exposure to cancer-causing  chemicals. We are not just talking about price increases here that the…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698275/reliable-power-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…knew that somebody might be taking a look at their finances.\n\nIf this amendment fails, it will increase the deficit by $46 billion.  So I hope all of you who are fiscally responsible and care about  fundamental fairness to workers across America will vote for this  amendment.", "date": "2025-03-14", "source_url": "https://justfacts.votesmart.org/public-statement/1688893/full-year-continuing-appropriations-and-extensions-act-2025"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…First of all, the DOGE operation starts out with a premise that it is  attacking waste, fraud, and abuse. And I am for that. Anyplace that we  can save taxpayers money by responsible assessment of what programs are  working or aren't, anytime we can uncover waste or certainly fraud and  abuse, I want to do that, and I want that to be done across the…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688257/department-of-health-and-human-services"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…our closing the homework gap. We made sure that  every single student had access to a laptop and to high-speed  broadband. I am so proud of everyone in Connecticut who was responsible  for this program of combining Federal and State resources in the best  way; but, unfortunately, Federal funds ran out.\n\nRather than leave students behind, the Federal Communications…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690726/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-federal-communications-commission-relating-to-addressing-the-homework-gap-through-the-e-rate-program"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…agencies.\n\nThe Commission creates the zoning maps and regulations, which must  ``not be inconsistent with the comprehensive plan for the national  capital.'' The mayor is responsible for the local elements of the  comprehensive plan, subject to Council approval. The National Capital  Planning Commission (NCPC), which is the central planning agency for…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692763/introduction-of-the-district-of-columbia-zoning-commission-home-rule-act"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…Club; Colorado Wild Public Lands; Conservation Colorado;       Conservation Lands Foundation; Conservation Minnesota;       Conservation Northwest; Conservatives for Responsible       Stewardship; Crow River Trail Guards.\n\nCURE; Earthjustice Action; Earthworks; EcoFtight; Elders       Climate Action; Endangered Species Coalition; Environment…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699274/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…up and say, yes, we want to know information before we make  this critical decision.\n\nIt is not partisan. It is not ideological. It is simply doing what  the Congress is responsible to do, and that is have oversight and make  judgments based upon the best information they can receive.\n\nMr. HOYER. In closing, let me emphasize that this is consistent…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699075/providing-for-consideration-of-hr-financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…Anybody who knows local  government from the FBI to the ATF to ICE, all over New Jersey, we are  cooperating with Federal authorities. What we have simply said is we  are responsible for local law enforcement. We are not going to do  things that create such fear in our communities that immigrant  communities are afraid to come to local police to report…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696004/unanimous-consent-requests"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…the  Tax Cuts and Jobs Act are supposed to have, note that this is going to  add $7 trillion to our national debt. It will blow up our deficit. In  fact, Donald Trump is responsible for roughly 40 percent of the  national debt just in the 4 years in which he was in office.\n\nHe oversaw, of course, the worst jobs record of any President since  Herbert…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690818/gross-violations-of-law-by-trump-administration"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…Farmer's Home  Administration and then USDA Rural Development. During his tenure as a  Program Director, a role he served in until his retirement in September  2025, Clark was responsible for more than 3,700 obligations totaling  more than $2.4 billion in assistance to rural Missouri communities and  businesses.\n\nOver the course of Clark's 58 years of service…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699718/recognizing-mr-clark-d-thomas"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…significant role in global supply chains,  particularly in the semiconductor and advanced manufacturing sectors.  Yet, despite its economic strength and proven track record of  responsible financial governance, Taiwan continues to be marginalized  and held to a second-class standard by the IMF.\n\nMake no mistake, Mr. Speaker, Taiwan is eligible to join the…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692796/taiwan-non-discrimination-act-of-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…priorities that have  saddled us with an annual deficit of $2 trillion.\n\nThe resolution before us today offers a path forward to rein in  wasteful spending and put our Nation on a responsible and sustainable  fiscal path. It reflects the commitment to the American people that  would secure a better future for all of us.\n\nThis resolution secures the opportunity…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689915/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…represents an       important step toward a more efficient, predictable and       durable federal permitting framework. By improving permitting       efficiency, expanding responsible access to our nation's       mineral endowment on federal lands and reducing unnecessary       regulatory burdens, H.R. 4090 will help reposition the U.S.       to compete…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699694/critical-mineral-dominance-act"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…interactions and relationships to include the more than  one in ten who sought emotional or mental health support.\n\nThat is why I proudly introduced H.R. 7045, the Promoting Responsible  Online Technology and Ensuring Consumer Trust (PROTECT) Act, to  immediately repeal Section 230 of the Communications Decency Act and to  restore accountability for online…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699543/true-cost-of-big-tech"}, {"senator": "Mike Simpson", "party": "Republican", "sentence": "…Mr. Speaker, renewable energy is cut by $34 million,  while providing targeted increases that preserve our Nation's natural  heritage and ensure a sustainable and fiscally responsible future.\n\nPassage of these bills will send a strong message that Congress is  determined to return to regular order and deliver results for our  districts.\n\nMr. Speaker,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698758/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…ensuring Federal services and programs are  operational. In the simplest terms, we are putting the government back  to work for our people.\n\nThe bill is fundamentally the same responsible approach House  Republicans offered on September 19, but with an important addition:  three full-year appropriations bills for FY26. These bipartisan,  bicameral, full-year…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696725/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…their community, participating in educational events and  even hosting a live nativity scene for the public each December.\n\nI am proud to have a family so committed to both responsible  agriculture and their community. It is because of family like theirs  that our rural communities thrive.", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693572/congratulating-joe-jensen"}, {"senator": "Bernie Moreno", "party": "Republican", "sentence": "…businesses, and  our long-term competitiveness against geoeconomic rivals like China.\n\nAs Under Secretary, Mr. Kimmitt will lead the International Trade  Administration and will be responsible for: No. 1, promoting market  access for American goods and services; and No. 2, enforcing our trade  laws to combat unfair practices. Both functions are critical to our…", "date": "2025-07-29", "source_url": "https://justfacts.votesmart.org/public-statement/1694342/confirmation-of-william-kimmitt"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…many  obstacles and barriers put in place that it has driven that industry  overseas to other places.\n\nIt is time we bring it back here and do it in a more environmentally  responsible manner--again, with human rights protections, health and  safety protections, environmental protections, and the standards of the  United States. It is time we start doing…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699695/critical-mineral-dominance-act"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…right is the most important part of governance, like delivering quality  education, maintaining safe neighborhoods, ensuring well-maintained  infrastructure, and practicing responsible fiscal stewardship.\n\nThis approach is validated by this national ranking, showing that  going back to the basics leads to residents prospering, businesses  flourishing,…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693581/congratulating-provo-utah-as-americas-best-run-city"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…identifying individual development companies       by name, a consolidated analysis of the risk created by       development companies making loans under this title that are       responsible for not less than 1 percent of gross loan       approvals under this title, set forth separately by--\n\n``(A) the dollar value of the loans made by such       development…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699188/504-program-risk-oversight-act"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…and requested  that Congress slash the funding for this office. This amendment does  exactly that and deals with this out-of-control agency.\n\nHistorically, this office was responsible for some of the most  egregious rules regulating the lives of Americans. Previous regulatory  actions undertaken include air cleaners, fans and blowers,  dehumidifiers,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694950/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Rick Scott", "party": "Republican", "sentence": "…patrols, was a nuclear weapons safety  officer, nuclear weapons security officer, and nuclear weapons  radiological control officer. He is pretty competent.\n\nThis role is responsible for the maintenance of a safe, secure, and  reliable nuclear stockpile.\n\nConfirmation is critical to President Trump's ``peace through  strength and strategic deterrence''…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691405/motion-to-discharge-s-res-195"}, {"senator": "John Thune", "party": "Republican", "sentence": "…textbooks--well, that  comes from State and local governments and from private sources. But  while the Federal Government provides a small percentage of education  funding, it is responsible for an outsize amount of bureaucracy and  mandates in education. More often than not, it is these policies that  are holding back school districts from innovating and ultimately…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688343/nomination-of-linda-mcmahon"}]