[{"senator": "Jason Crow", "party": "Democrat", "sentence": "…On Capitol Hill, the men and women of the U.S. Capitol Police protect  us and the seat of our democracy. I personally owe a great debt of  gratitude to these officers who responded to the attack on the U.S.  Capitol on January 6, 2021.\n\nMany of my colleagues and I were trapped right up there in the House  gallery that day as an insurrectionist mob converged…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691167/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…Security information, and more.\n\nIt was a blatant power grab, long before Elon Musk started tapping  into Federal servers, by the way. It was a blatant power grab which was  responded to: 44 States, both Republican and Democratic, said no.  Republican and Democratic elections officials throughout the country  joined together to reject Donald Trump's demands…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690535/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…this city, in this       very room. The safety of Americans is very much at risk as       global health security programs are shuttered. Programs we       implemented that responded to the plague, Ebola, and drug-      resistant tuberculosis have suddenly ended, even as the       United States experiences its largest TB outbreak in decades.       These…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691139/us-global-health-programs"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…that the funding cuts to Federal nutrition  programs have created.\n\nWhen Operation Midway Blitz brought chaos and pain to our community,  Pastor Matt and New Life Centers responded by supporting immigrant  families, taking food to their homes, and helping find loved ones that  ICE had taken.\n\nMr. Speaker, the work of New Life Centers helps strengthen…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697323/9999"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…squeaking by today have told me they will fall into the red because of  the Republican healthcare cuts in this law. Recently, I surveyed all of  the hospitals in Illinois, and 129 responded to my survey. They wrote  to me to say they will struggle greatly with these cuts from the big  beautiful budget bill of the Trump administration. These hospitals will  face…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698601/healthcare"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…assurances that Sam Brown will do his job. But when he  was asked specifically at his hearing whether, if directed by the  President to take action that would break the law, he responded that he  could not ``imagine a scenario where the President would ask me to do  anything unlawful.'' We know the President has asked members of this  administration to do…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691275/9999"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…than 40 days,  families across our country suffered through the longest government  shutdown in history.\n\nHow did our President and Congressional Republicans respond?\n\nThey responded by amputating the East Wing of the White House to make  way for a $300 million gilded ballroom.\n\nThey responded by throwing a lavish Gatsby-themed party at Mar-a-Lago  where…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697099/careless-people"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…rule and  puts us at odds with our allies, allies that in the post-World War II  era have helped us restrain Russian aggression for nearly a century.  Denmark, as an ally, responded to our action in Afghanistan. They lost  43 men there simply because they honored their NATO commitment and  stood by their friend, the United States of America.\n\nPerhaps…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698929/greenland"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…provided over the years, their readiness and performance resulted in  their safe return. However, the commanding officials who are  responsible for their deployment have not responded to requests by  Congress to report from which accounts the money was withdrawn-- billions and billions of dollars, for almost 6 months--for the  deployment and actions in…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698837/reflecting-on-impact-of-illegal-action-in-venezuela"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…threats against my  offices came with the email subject line ``MAGA'' and from an email  address alleging the ``2020 election was rigged.''\n\nLocal and Federal law enforcement responded immediately and are  conducting full security sweeps, and investigations are ongoing.  Everyone, thank God, is safe, and I am grateful for the quick and  professional response…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697230/political-violence"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…month ago, they said that they were going to issue an RFP now and  get this aid moving again. The RFP was issued. Nonprofit organizations,  including Edesia Nutrition, have responded to it. The administration  has been sitting on it for a month.\n\nWhat are they waiting for? Every day that they fail to act is a day  that children die. They need to keep…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693466/lives-lost-due-to-us-ending-food-aid"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…the President of the United States of America. For the President  of the United States to say that people should be--let me read it to  you one more time. The President then responded with 16 Truth Social  posts, including one that advocated for hanging Democrats.\n\nThere is something wrong with the President. There is something  wrong. We can't ignore…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697060/no-mandate-to-cut-medicaid"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…withholding of federal funds from sanctuary       cities, the White House denounced the judgment as an attack       on the rule of law by an ``unelected judge.'' Trump himself       responded by threatening to break up the Ninth Circuit.\n\nThe president took an indirect swipe at the judiciary in       August 2017 when he pardoned the controversial former Arizona…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…there is $23  billion in there waiting to be used. So there is absolutely no reason  not to fund the full SNAP benefits for the month of November.\n\nBut then the administration responded to the court, and they said: We  are not going to do it. We will use the contingency funds, but we are  not going to use the interchange authority.  We cannot fund--we choose…", "date": "2025-11-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696499/unanimous-consent-request"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…people of South Korea have witnessed the mortal danger  to democracy posed by lies, by corruption, and by illegal actions  directed by those at the very top.\n\nThe Korean people responded with courage and defended their democracy  through peaceful civil disobedience, through lawful impeachment, and,  now, through a free and fair election.\n\nThey have shown…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691847/south-korea-election"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…destroyed 18,000 homes and tragically  killed 30 people, there was a FireAid concert in which a number of  high-profile musicians generously agreed to perform and people  responded in an amazing way. Tens of thousands of people donated,  raising $100 million for what they were told was direct relief for the  victims. Now we have learned that this money…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694134/investigation-into-the-fireaid-concert-in-los-angeles"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…help. They have also announced more tariffs  as well.\n\nThe threat of tariffs seems to have worked. We need not make Canada  and America go through this when they have already responded to our  request.\n\nThe chaos of one day the tariffs are on, one day they are off, the  next day there is a loophole for this industry or that industry, is  chaotic and is…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689478/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…for spending billions and  billions on the high-speed rail. In fact, he just doubled the amount  that will be spent this year through the cap-and-trade fund.\n\nThis gentleman responded to my criticism of the high-speed rail by  saying that we are creating all these jobs. That is what this is about.\n\nI am all for creating jobs. In fact, it would be great…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…impacted Coast Guard facility beginning in 2021 and accounted       for annually thereafter.\n\n(9) The number of search and rescue incidents in which a       facility responded to a search and rescue incident in an area       previously covered by an impacted Coast Guard facility but       was unable to fulfill the mission, including--\n\n(A) the…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…honor the  courageous firefighters who have put their lives on the line to fight  the two wildfires in Pennsylvania's Michaux State Forest.\n\nMore than 170 firefighters have responded to the emergency, including  Vigilant Hose Company No. 1 in Shippensburg, Pennsylvania. While their  work is yet to be finished, these brave men and women have already  contained…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690194/repealing-green-new-deal-policies"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…Braunscheidle, who has  devoted 62 years to serving the Town of Pendleton and the Wendelville  Volunteer Fire Company. Over the course of his long and distinguished  career, Gary has responded to over 200 emergencies in the past year  alone, demonstrating his unwavering commitment to public safety.\n\nGary has held multiple roles within the company, including Assistant…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699580/recognizing-gary-braunscheidle"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…happened.\n\nBy the way, if you come here illegally, I think you ought to have  jail time. As a former prosecutor as the attorney general of Missouri,  I can tell you that people responded to incentives. They knew when we  had a partnership with Federal prosecutors in St. Louis that, if they  were being busted for a Federal crime, they were going to jail. If…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700065/9999"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…GAO just last week and said: As  far as you know, has GAO ever--ever--declared something not a rule when  the Agency said it was a rule? And after a moment of silence, he  responded: As far as I know, GAO has always deferred to the Agencies,  until now.\n\nThey literally broke their own policy. They literally violated their  own legal counsel. So now,…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691634/congressional-review-act"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…overdraft is one of the most transparent and competitive  products available in depository banking, they make up about 2 percent  of consumer complaints.\n\nHow have the banks responded? They have responded by proactively  taking steps to promote further transparency in their overdraft  products without government intervention. This includes low-balance…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689844/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "John McGuire III", "party": "Republican", "sentence": "…because Biden's open-border policy brought more illegal  criminals into our country who are robbing, raping, and killing the  American people.\n\nIn November the American people responded to this lack of respect in  the polls. They elected the Republican majority in the House, the  Senate, and the President in the White House who truly believes in law  and…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691170/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…for less  incarceration and less policing: decarceration, procriminal policies  that undermine public safety.\n\nOn January 22, 2025, San Antonio Police Department officers responded  to calls at a San Antonio apartment complex reporting a suicidal  individual who was armed and firing his weapon. When officers arrived,  the suspect, Brandon Scott Poulos,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695203/people-are-sick-and-tired"}, {"senator": "Ashley Moody", "party": "Republican", "sentence": "…a few days ago--in my home State of Florida, Sergeant  Erik LeVasseur, from Port St. Lucie, while doing his job as a law  enforcement officer, was shot in the face when he responded to a call  for help. These attacks, threats, and harassment cannot begin to feel  commonplace in our country--not in our States, not in our cities. We  cannot get used to…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697550/halo-act"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…and supporting daily operations.\n\nMr. Speaker, the measure of a true leader is not found in titles  alone, but in the lives improved because they cared. Mayor Taylor has  responded to emergencies in the middle of the night, helped families in  their moments of greatest need, and ensured that Langhorne's government  remained responsive, compassionate,…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697645/commending-mayor-joe-taylor-for-his-dedicated-service-to-langhorne-borough"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…reclassifying if and when they reduce emissions below  the legal threshold.\n\nDo you know what, Mr. Speaker? That rule actually worked. It  encouraged improvements, and businesses responded.\n\nUnder the Biden-Harris rule, companies have absolutely no incentive  to decrease their emissions.\n\nWe should encourage industries, Mr. Speaker, to lower their emissions…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691596/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…at the  county level, helping guide emergency response efforts, mentoring  future firefighters, and shaping fire service standards. Throughout his  decades of service, he responded to countless emergencies and earned  the respect of all who served alongside him.\n\nAl represented the very best of our community, and I extend my  heartfelt condolences to…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699731/recognizing-extraordinary-service-of-cardinal-timothy-dolan"}]