[{"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…burdens imposed by a       British parliament an ocean away. That parliament, meanwhile,       grew frustrated by what leaders saw as Americans' efforts to       evade the responsibilities of being part of the British       Empire.\n\n``The British were trying to raise money by capturing       vessels that were sneaking stuff in and not paying duty,''…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691707/253rd-anniversary-of-the-gaspee-raid"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…potentially choke off  further information to the Congress.\n\nThe Constitution demands otherwise. The Founders split the  government's wartime powers, just as they divided responsibilities for  so many other things. It is Congress which declares a war, which raises  an army and a navy and pays for the financial cost of defense and war.\n\nAnd keep in mind…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693120/motion-to-discharge-sj-res-59"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…authorizes the  existing  Office of Policy Analysis and Development at the NTIA and renames it  the Office of Policy Development and Cybersecurity. It also codifies  the responsibilities of NTIA in administering parts of the Secure and  Trusted Communications Networks Act and requires the office to  coordinate and develop policy initiatives to enhance…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693495/ntia-policy-and-cybersecurity-coordination-act"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…we       reached out to NCUA on July 30, 2025. We received NCUA's       response on August 14, 2025.                                  BACKGROUND       NCUA's Role and Responsibilities\n\nNCUA is an independent federal agency which ``insures       deposits at [FICUs], protects the members who own credit       unions, and charters and regulates federal…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699835/government-accountability-office-opinion-letter"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…thrive when their educational       institutions listen to them, support them, and prevent       discrimination against them, While balancing their health,       caregiving responsibilities, and educational goals is       challenging, these added responsibilities often renew       students' dedication to their studies. While the decision to       parent and/or…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699317/pregnant-students-rights-act"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…chaotic policies of the       administration. Punishing them because their local       governments instituted policies to draw a line between local       law enforcement responsibilities and federal immigration       enforcement will only deepen inequities and disrupt local       economies.\n\nH.R. 2966 adds insult to injury by imposing sweeping new…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692125/american-entrepreneurs-first-act-of-2025"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…funding to meet that obligation.\n\nLastly, we have to note that the Trump administration is in the  process of trying to abolish the Department of Education, with key  responsibilities being shifted to other agencies. We are left with a  chaotic patchwork of authority and no one apparently left to actually  administer the provisions of this bill.\n\nFor…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697533/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…this funding so that States can connect as many Americans as  possible to fast, reliable, and affordable internet.\n\nCongress has also tasked NTIA with other meaningful responsibilities.  The agency manages Federal spectrum and its users, as well as  coordinates with the Federal Communications Commission to ensure that  our airwaves are effectively managed…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690254/national-telecommunications-and-information-administration-reauthorization-act-of-2025"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…interests on the world stage. And that  request traditionally includes a justification and a rationale for the  proposed plan.\n\nFor over 60 years, Congress has met its responsibilities, not by  rubberstamping the Department of Defense's requests but by, yes,  identifying areas of agreement, identifying and negotiating or saying  no to areas of disagreement,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698259/nominations"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…the middle class, working families, and future  generations.\n\nMy district has asked me: Where is the solution to this?\n\nIt rests right in this Chamber. Let us assume the responsibilities,  the duties, the authority, and the power we have by the Constitution  with the power of the purse placed in our hands here in the House of  Representatives. Let's act…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688070/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "…responsible for sending people to  face persecution, especially those who have risked everything to seek  refuge right here. These actions not only violate our moral  responsibilities and our shared humanity, but they are in direct  conflict with the values upon which our Nation was founded.\n\nI am the proud daughter of immigrants from Iran. My parents…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688337/migrants-fleeing-religious-persecution"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…celebrate the multiple cultures and diversity of this country.\n\nThe administration is trying to dismantle Tribal schools, which were  created because of our trust and treaty responsibilities, trying to  turn them into a voucher program and school choice. There are no  choices in many of our rural and Tribal communities. The choice is to  keep our Tribal schools…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689636/impact-of-trump-administration-anti-dei-actions"}, {"senator": "Katherine Clark", "party": "Democrat", "sentence": "…creation.''\n\nGuiding the world's 300 million Eastern Orthodox Christians since his  election in 1991, Ecumenical Patriarch Bartholomew has been a powerful  voice for our common responsibilities to one another--our shared  obligation to defend the freedom, dignity, and wellbeing of our  neighbors and of future generations.\n\nI am especially grateful for the impact…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695285/welcoming-ecumenical-patriarch-bartholomew-to-washington-dc"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…Public  Defender services, which are constitutionally required, providing an  increase of $315 million or 22 percent over the 2025 enacted level to  meet constitutional responsibilities.\n\nOther programs for the Department of the Treasury, including the  community development financial institutions, so critical for small  communities and communities of…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699056/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…This bill would  support family caregivers by reauthorizing the Lifespan Respite Care  Program, which allows full-time caregivers to take a temporary break  from their responsibilities caring for aging or disabled loved ones.\n\nAcross the country, there are over 53 million Americans who currently  provide uncompensated care for their families, which provides…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688456/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…cybersecurity policy efforts before the Commission, Congress,       and elsewhere;\n\n``(H) provide advice and assistance to the Assistant       Secretary in carrying out the policy responsibilities of the       NTIA with respect to cybersecurity policy matters, including       the evaluation of the impact of cybersecurity matters pending       before the Commission,…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693497/ntia-policy-and-cybersecurity-coordination-act"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…prescribes law or policy, because it designates which areas       of BLM-administered land are available for coal leasing       consideration in accordance with BLM's responsibilities for       land use management under FLPMA. Specifically, the Buffalo       RMPA designated approximately 48.12 billion short tons of       coal as unavailable for further…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695880/government-accountability-office-opinion-letter"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…Card Exchange, and Young Professionals Summits, Susan  has created career development and community building opportunities.\n\nSusan's impact reaches far beyond her formal responsibilities Her  tireless work ethic, meticulous attention to detail, and steadfast  support for others have made her a cherished mentor and friend. She has  played a vital role in…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694735/recognizing-susan-harkins-for-45-years-of-service-with-the-lower-bucks-county-chamber-of-commerce"}, {"senator": "Andy Ogles", "party": "Republican", "sentence": "…Federal agencies have taken important steps to respond, the  overall effort has revealed significant challenges in the way our  government organizes its cybersecurity responsibilities. Multiple  agencies share roles in protecting critical infrastructure, but they  operate under different missions, structures, and authorities. Through  fast-moving or…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696757/strengthening-cyber-resilience-against-state-sponsored-threats-act"}, {"senator": "Laurel Lee", "party": "Republican", "sentence": "…to destroy themselves or to  harm others is child abuse. It is criminal, and it will be prosecuted.\n\nMadam Speaker, protecting children is one of Congress' most solemn  responsibilities. H.R. 6732 is a necessary, targeted, and responsible  response to a real and growing threat.\n\nI urge my colleagues to support this bill.", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698877/coercion-and-sexual-abuse-free-environment-act"}, {"senator": "Mark Messmer", "party": "Republican", "sentence": "…within the group and rose from sales  manager to general manager. In 1998, Mr. Farabaugh and his brother-in- law purchased the dealership and now share ownership and  responsibilities at D-Patrick.\n\nD-Patrick has invested hundreds of thousands of dollars annually in  an array of local Indiana organizations, such as Ark Crisis Children's  Center, Boone…", "date": "2025-04-21", "source_url": "https://justfacts.votesmart.org/public-statement/1690130/time-dealer-of-the-year-2025"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…sides of the Capitol.\n\nEnacting this package will represent a major milestone and show that  Congress can work together in a bipartisan manner to carry out our  article I responsibilities and deliver real results for the people that  we are honored to represent.\n\nAgain, my thanks to the leadership and to the committee members and,  of course, to our great…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699433/consolidated-appropriations-act-2026"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "…President, is narrow in scope. It does       not encompass the development of land-use plans, or the       allocation of resources on public land. Congress assigned       those responsibilities to the Secretary of the Interior and       BLM under FLPMA. The Grand Staircase RMP explains that       Alternative E       designates management areas primarily as a…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700255/us-government-accountability-office-decision"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…response plans at the Department; and\n\n``(2) serve as a central point of contact to direct       veterans to resources to prevent and mitigate fraud and       scams.\n\n``(b) Responsibilities.--The Veterans Scam and Fraud       Evasion Officer shall carry out the following       responsibilities:\n\n``(1) Providing comprehensive communication from the       Secretary…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699191/veterans-scam-and-fraud-evasion-act-of-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…in Congress assembled,       SECTION 1. SHORT TITLE.\n\nThis title may be cited as the ``Promoting Resilient Supply       Chains Act of 2025''.       SEC. 2. ADDITIONAL RESPONSIBILITIES OF ASSISTANT SECRETARY OF                     COMMERCE FOR INDUSTRY AND ANALYSIS.\n\nIn addition to the responsibilities of the Assistant       Secretary on the day before…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690188/promoting-resilient-supply-chains-act-of-2025"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…protect the  criminals and ignore victims. The D.C. CRIMES Act puts an end to this  madness and ensures safety and security across D.C.\n\nAt 18 years old, you are given adult responsibilities, like being  able to vote or sign up for the military. At 18 years, you become  responsible for your  choices and your decisions and should be treated as such. At 21 years…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695556/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…from political performance.\n\nIn her 250 years, America has never shied away from hard work, nor  does the Appropriations Committee in carrying out our constitutional  responsibilities for fiscal year 2026. Even after the longest  government shutdown in history, political obstruction, and tough  deadlines, we remained resolute and took responsible steps…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698749/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…noted that the Lumbee community has no  treaties with the Federal Government, no reservation land, and no  common language.\n\nAs Members of Congress, one of our most solemn responsibilities is to  ensure that laws are applied fairly, objectively, and consistently.\n\nFor over 40 years, the Department of the Interior through the Office  of Federal Acknowledgement…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697785/ensuring-fairness-and-integrity-in-federal-tribal-recognition"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…favorable jurisdictions abroad.\n\nH.R. 3633 addresses these issues directly by clarifying the legal  status of digital assets and establishing well-defined regulatory  responsibilities between the SEC and CFTC, creating a more predictable  landscape for market participants while preserving critical investor  protections and maintaining the integrity…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693544/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Robert Bresnahan, Jr.", "party": "Republican", "sentence": "…study and compile recommendations for the Mid-Atlantic river  basin commissions to ensure they have proper ethics policies in place,  conduct an inventory of their Federal responsibilities, and look to see  if any of their responsibilities have become duplicative since their  inceptions.\n\nMy legislation then directs these river basin commissions to report…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695001/mid-atlantic-river-basin-commissions-review-act"}]