[{"senator": "Steve Cohen", "party": "Democrat", "sentence": "Graves, I hate to speak against one of  his bills because he was such a good ally when I was on Transportation,  and I have great respect for him, but nevertheless I am against the  bill.", "title": "Promoting Efficient Review for Modern Infrastructure Today Act", "date": "2025-12-11"}, {"senator": "Al Green", "party": "Democrat", "sentence": "The greatness of America is achieved by the people having the power  and the people making the decisions; by having a Supreme Court that is  respected, that is honored; by having a judiciary that is respected; by  having a Congress that is respected; by avoiding what could become  authoritarianism that metamorphoses into something even greater in harm  to this country than the authoritarianism that we face today.", "title": "Authoritarianism", "date": "2025-06-06"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "She has spent decades  being a driving force of opportunity, making sure to uplift her  community and ensure that other veterans receive the respect that they  deserve.", "title": "Recognizing Joann Williams", "date": "2025-02-27"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "Yeah, I just--again, I have so much respect for my  colleague that I want to respond to some of the things he said,  because, again, I just want to affirm that he is right on the urgency  to help our police officers.", "title": "Unanimous Consent Requests", "date": "2025-10-03"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "It is about jobs, economic stability, and respect for the  successful agreement that we committed to in the past.", "title": "Terminating the National Emergency Declared to Impose Duties on Articles Imported From Canada", "date": "2025-10-29"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "New Jersey is a State that often I call the Rodney Dangerfield State  where we get no respect, but the truth of the matter is, New Jersey has  a representative that in this body that is known for partisanship, he  is a person that is seen by colleagues on both sides of the aisle as  someone that has a soul force, someone who has a heart, someone who is  determined to be the kind of patriot this Nation needs.", "title": "-9999", "date": "2025-12-09"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "Congress should respect the District's authority to govern       itself, especially on matters of public safety.", "title": "Opposition Letter Led By the DC Justice Lab on the Common-Sense Law Enforcement and Accountability Now in DC Act of 2025 (H.R.", "date": "2025-11-19"}, {"senator": "Joshua Gottheimer", "party": "Democrat", "sentence": "After sacrificing so much, our great veterans should never struggle  to get the care, recognition, and respect they have rightfully earned.", "title": "Military Construction, Veterans Affairs, and Related Agencies Appropriations Act, 2026", "date": "2025-06-25"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "The funny thing  about those little pieces of soot created in fuel-burning powerplants  is they have no respect for State boundaries, none.", "title": "Providing for Congressional Disapproval Under Chapter 8 of Title United States Code, of the Rule Submitted By the Internal Revenue Service Relating to ``Gross Proceeds Reporting By Brokers That Regularly Provide Services Effectuating Digital Asset Sales''", "date": "2025-03-26"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "These extraordinary ideals reflect the Sikh tradition of seeking  peace through equality, fraternity, and respect, while striving to  overcome division through sacred teachings and the admirable tenets of  honest work, charity, volunteerism, and sharing with those in need.", "title": "Recognizing the 350th Anniversary of the Martyrdom of Guru Tegh Bahadur", "date": "2025-10-10"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "Throughout my career in the House  and Senate, I have tried to be consistent on this issue and respect the  Constitution and its wisdom.", "title": "Directing the Removal of United States Armed Forces From Hostilities Within or Against Venezuela That Have Not Been Authorized By Congress--", "date": "2025-11-06"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "Republicans  are using this moment to remind us just how little they respect women's  lives or our choices.", "title": "Providing for Consideration of H.R. Supporting Pregnant and Parenting Women and Families Act; Providing for Consideration of H.R. Pregnant Students' Rights Act; and Providing for Consideration of H.J. Res. Providing for Congressional Disapproval of the Rule Submitted By the Bureau of Land Management Relating to Public Land Order No. 7917 for Withdrawal of Federal Lands; Cook, Lake, and Saint Louis Counties, Mn", "date": "2026-01-21"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "Maybe it is because the shows on PBS, like the very popular ``Daniel  Tiger's Neighborhood,'' teach children the importance of kindness,  respect, empathy, and caring for others.", "title": "Rescissions Package: Corporation for Public Broadcasting", "date": "2025-06-11"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "This is coming from an administration who has been clear that they  have no respect for the Federal workforce or even in some cases for the  rule of law, who has said that they want to put the Federal workforce  in trauma to force them to leave.", "title": "Providing for Consideration of H.R. 2550 to Nullify the Executive Order Relating to Exclusions From Federal Labor-Management Relations Programs, and for Other Purposes", "date": "2025-12-10"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "I first will say how much respect  I have  for Mr.", "title": "Gulf of America Act", "date": "2025-05-08"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "I have a  tremendous amount of respect for my ranking member.", "title": "Unlocking Our Domestic Lng Potential Act of 2025", "date": "2025-11-20"}, {"senator": "Ashley Hinson", "party": "Republican", "sentence": "They deserve to be treated with respect and  surrounded with care and love.", "title": "Pregnant Students' Rights Act", "date": "2026-01-22"}, {"senator": "Rick Crawford", "party": "Republican", "sentence": "328, a Democratic-sponsored bill that  excoriates the Maduro regime which ``has refused to respect the  overwhelming choice of  the people of Venezuela and subsequently arrested and abused thousands  of innocent citizens of Venezuela, including children, for peaceful  political participation.''\n\nMr.", "title": "Successful Operation to Arrest Nicolas Maduro", "date": "2026-01-12"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "However, I respect the President's views on this legislation and his  commitment to fiscal responsibility, and I reserve the balance of my  time.", "title": "Miccosukee Reserved Area Amendments Act--Veto Message From the President of the United States", "date": "2026-01-08"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "His impact on these student-athletes was  recognized with the Regional Coach of the Year award and the  prestigious Michigan Division 1 Coach of the Year honor--achievements  that underscore his dedication to fostering a winning culture built on  hard work, respect, and perseverance.", "title": "Recognizing the Clarkston High School Wrestling Team's Outstanding Season", "date": "2025-03-21"}, {"senator": "Chuck Fleischmann", "party": "Republican", "sentence": "I respectfully think my colleague's amendment goes too far in  eliminating this program.", "title": "Energy and Water Development and Related Agencies Appropriations Act, 2026", "date": null}, {"senator": "Roger Williams", "party": "Republican", "sentence": "(2) With respect to a cancelled covered solicitation which       the Federal agency does not intend to reissue, establishing       procedures for the referral of a small business concern (as       defined under section 3 of the Small Business Act (15 U.S.C.", "title": "Transparency and Predictability in Small Business Opportunities Act", "date": "2025-06-03"}, {"senator": "French Hill", "party": "Republican", "sentence": "5323) is amended--\n\n(1) in subsection (a)--\n\n(A) in paragraph (1), by striking ``The Council'' and       inserting ``Subject to paragraph (3), the Council''; and\n\n(B) by adding at the end the following:\n\n``(3) Initial determination.--The Council may not vote on a       proposed determination with respect to a U.S.", "title": "Financial Stability Oversight Council Improvement Act of 2025", "date": "2026-02-09"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "Chair, I rise today with deep respect and unwavering  gratitude for the brave men and women who have worn the uniform of the  United States of America.", "title": "Military Construction, Veterans Affairs, and Related Agencies Appropriations Act, 2026", "date": "2025-06-25"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "Over the past century, Solebury School has remained steadfast  in its founding ideals such as personal attention, intellectual  curiosity, and a deep respect for individuality.", "title": "Recognizing the 100th Anniversary of Solebury School", "date": "2025-10-21"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "For 170 years, Brooksville has stood as a testament to  resilience, civic pride, and a deep respect for tradition, while  continually embracing progress and growth.", "title": "Recognizing the City of Brooksville", "date": "2026-02-20"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "WREC's participation in the ``Light Up Navajo'' initiative  reflects not only their technical expertise but also their heart and  respect for the people they serve.", "title": "Recognizing Patrick Sullivan", "date": "2025-06-17"}]