[{"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…South County.\n\nMy heart goes out to his wife, Jean, all of his brothers and sisters,  and all who were lucky enough to know and love him.\n\nMay his legacy endure, and may he rest in peace.", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688521/9999"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…deep principles and kindness.\n\nMr. Speaker, I and so many in my community are sending prayers to his  family and friends and all who had the privilege to know him.\n\nMay he rest in peace.", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691338/in-memory-of-nihaal-grandhi"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…America, the voters, had rejected him. He can  never be trusted with power again.\n\nMr. Speaker, I will bring Articles of Impeachment because what Vice  President Cheney--may he rest in peace--what Vice President Cheney said  on September 6, 2024, is true now. We should never have trusted him. He  has been given a second chance to steal fire from the gods. We…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697472/president-trump-is-a-threat-to-our-republic"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…something and why.\n\nBob's memory and legacy will live on through the lives that he  touched. Our hearts go out to all of his family. Our prayers go with  him as well. May he rest in peace.               Commemorating Korean War Veterans Armistice Day\n\nMr. SUBRAMANYAM. Mr. Speaker, I rise to commemorate Korean War  Armistice Day and to honor the millions…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693866/recognizing-the-remarkable-work-of-sewa-international"}, {"senator": "Marc Veasey", "party": "Democrat", "sentence": "…Lavonne Harris Rischer was truly a pillar of our community,  and her legacy of kindness, faith, and family will endure in the hearts  of those she leaves behind. May she rest in peace, and may her memory  continue to inspire all who knew her.", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687993/recognizing-sharon-lavonne-harris-rischer"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…life of Sheriff John Bowens be a beacon to those who follow:  a call to serve without expectation of fame, to lead with humility, and  to love without reservation. May he rest in peace, and may his memory  be a blessing to us all.", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699826/in-memory-of-sheriff-john-bowens"}, {"senator": "Jim Costa", "party": "Democrat", "sentence": "…role model for all of us.\n\nDoug, we miss you. Doug had a life well lived. He was a person who  cared passionately about our country and about the people's House. May  you rest in peace. I give my condolences to your wife and your family.  I thank all of you for giving us an opportunity to serve with our  friend, Doug LaMalfa.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698716/9999"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…be here, and it breaks my heart that  their lives were cut so short from this disgusting act of cruelty.\n\nLet us keep them and their families in our thoughts. May they rest in  peace.", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692058/in-memory-of-officers-samuel-riveros-and-darius-wong"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…local Democratic politics and community service.  John's legacy lives in all of the lives and communities that he  touched.\n\nMy heart goes out to his family, and may he rest in peace.                   Corruption and Controversy at Fannie Mae\n\nMr. SUBRAMANYAM. Madam Speaker, for decades, Fannie Mae has played a  critical role in supporting home buyers…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697218/recognizing-bishop-michelle-c-thomas"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…broken the hearts of our community.\n\nMr. Speaker, our prayers are with the families of these students. May  the souls of Arely, Jacqueline, Natalia, Cynthia, and Manny rest in  peace. Our community will never forget them. We miss them dearly. We  thank them for the time they spent with us.", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690780/five-santa-ana-students-taken-too-soon"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…inspired to teach, children  who learned they mattered, neighbors who found courage, and a family  that will carry his love forward.\n\nMay his memory be a blessing. May his soul rest in peace, and may his  example continue to inspire lives of service, faith, and love.", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699459/in-memory-of-mr-adrian-earl-jenkins-sr"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…brought us       to the light. For in every child who plants a tree, in every       soul who cares, In every word of hope and faith, we find you       standing there.\n\nRest now in peace, dear Jane Goodall, in earth you loved       and knew, You showed us how to live with grace, with courage       strong and true. And when the wind sings through the Gombe…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696844/the-ballad-of-jane-goodall"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…adventure, and this tragic loss has  broken all of our hearts.\n\nThe families of these students are in our prayers. May the souls of  Arely, Arlene, Jaqueline, Natalia, and Manny rest in peace. Our  community will never forget them, and we will miss them dearly.", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690664/in-memory-of-santa-ana-car-accident-victims"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…generations to come. She was always present. She always cared. She  took her family's experience and moved it into the highest levels of  lawmaking in the State of Ohio.\n\nMay she rest in peace, and may her courage, her grit, and her fierce  dedication inspire us all. We miss her, and we know that her work in  Ohio has made a difference in the lives of our 12…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694099/trumps-reckless-tariff-policies"}, {"senator": "Neal Dunn", "party": "Republican", "sentence": "…will miss  his wisdom and his company.\n\nIt was an honor to know John. As people mourn his loss, please keep  his wife, Jean, and their family in your prayers.\n\nMay John rest in peace.", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692063/recognizing-john-thrasher"}, {"senator": "Ron Estes", "party": "Republican", "sentence": "…today to offer our sincerest  condolences to each person who is grieving the loss of a loved one and  to honor the victims of Flight 5342 and PAT 25.\n\nMr. Speaker, may they rest in peace.", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688372/expressing-condolences-to-the-families-friends-and-loved-ones-of-the-victims-of-the-crash-of-american-eagle-flight-5342-and-pat-25"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…My team and I continue to pray for Doug, his family, and for  all who loved him during this particularly difficult time.\n\nMay God bless Doug LaMalfa's memory and may he rest in peace.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698733/9999"}, {"senator": "Ron Estes", "party": "Republican", "sentence": "…thoughtful, and kind person  who loved our country, and he gave his life in service to others. I  thank him for his service and for the impact he made on our lives. May  he rest in peace.\n\nMr. ESTES. Mr. Speaker, I ask that the House observe a moment of  silence to remember Eric Jachym.", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693538/moment-of-silence-in-memory-of-eric-tarpinian-jachym"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…area, and  Indianola during this difficult time. Iowa has lost a leader, Simpson  College has lost a champion, and many of us have lost a dear friend.\n\nMr. Speaker, may Jay rest in peace. Our prayers are with him.", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690743/myths-of-medicaid-reform"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…our community, and I extend my  heartfelt condolences to his family, friends, and all who had the  privilege of knowing him. His legacy will never be forgotten. May he  rest in peace.                        Commending Chief Daniel Hyman\n\nMr. LAWLER. Mr. Speaker, I rise today to recognize an extraordinary  act of courage and public service by Ramapo…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699731/recognizing-extraordinary-service-of-cardinal-timothy-dolan"}, {"senator": "Dan Newhouse", "party": "Republican", "sentence": "…both  sides of the aisle to join us in honoring the great work that Doug  accomplished over the years.\n\nMay we preserve his legacy. May we be more like him, and may he rest  in peace.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698741/9999"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…assured, we will continue to carry on the torch that Doug  championed so well.\n\nWe know where Doug is at this moment. Our prayers are with him, with  Jill, and with his family. Rest in peace. May God bless him.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698718/9999"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…Wolfe families. May He watch over our  National Guard, and may He bring comfort and healing to all who are  hurting.\n\nMr. Speaker, may Specialist Sarah Beckstrom's soul rest in peace.                        Less Regulation, More Freedom\n\nMr. MANN. Mr. Speaker, every year, small businesses spend nearly  $15,000 per employee to comply with Federal laws.…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697294/national-guard-shooting"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…incredible life of service and  sacrifice. Katie and I, all Floridians, and this Nation offer our  thoughts and prayers to  the Brady family as they celebrate his life. May he rest in peace.", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691271/congratulating-northwest-florida-state-womens-basketball-team"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…this unimaginable loss, we keep them in our thoughts  and prayers. Gia's memory will forever shine brightly in the hearts of  all who were blessed to know her.\n\nMay Gia rest in peace and may we all strive to live each day in the  spirit of kindness that she exemplified.", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689204/gia-deborah-gentile-leaves-behind-a-legacy-of-kindness"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…dedication to his community and country. His  accomplishments, generosity, and leadership set a gold standard that  will continue to inspire generations to come. May he rest in peace.", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690585/recognizing-the-life-of-service-of-dick-young"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…loved the West. He loved 1-minute  speeches. I will miss his humor, his directness, and the clarity he  brought to a town that too often hides behind big words. May he rest in  peace.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698710/9999"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…River, and spending time with his grandchildren. His legacy lives on  through the lessons he passed on to his family, his friends, and the  many lives he touched. May he rest in peace.                   Recognizing S.W. Johnson Fire Department\n\nMr. LAWLER. Mr. Speaker, I rise today to recognize the S.W. Johnson  Fire Department in Rockland County on…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699118/recognizing-and-thanking-nate-soule"}]