[{"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…result of our visit and the visits of  Members that they have conducted in New Jersey, California, New York,  and Illinois last week, ICE issued new guidance that unlawfully  restricts Members of Congress to access ICE facilities.\n\nMr. Speaker, you heard me right. They decided that they were going to  issue new guidance to go above Congress and further…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692932/holding-power-accountable"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "Ms. KAPTUR. Mr. Speaker, this bill unnecessarily restricts the free  market. It dictates what private sector fiduciaries can and cannot  consider when making investment decisions that directly affect the  savings and retirement savings…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699158/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Alma Adams", "party": "Democrat", "sentence": "…middle-class families  when they are already struggling to make ends meet. It strips away  protections for patients, opening them up to discrimination and  predatory practices. It restricts access to abortion care which, by the  way, is healthcare, putting the government, not a woman and her doctor,  in charge of her body.\n\nPeople are dying, Mr. Speaker, and…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698385/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Zoe Lofgren", "party": "Democrat", "sentence": "…joint research, coauthored publications,  collaboration on awards, and formal mentor relationships) that awardee  has had in the past five years. Furthermore, the amendment restricts  post-award activity, prohibiting covered individuals from sharing  ``expertise'' with ``hostile foreign entities,'' or those affiliated  with them, for five years. This…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695251/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…and South Korea.\n\nOur measure directly responds to the real-world consequences of  gaping loopholes in the Merchant Marine Act of 1920, better known as  the Jones Act, which restricts domestic shipping including routes  between the U.S. West Coast and Hawaii to vessels that are U.S.-built,  U.S.-flagged, U.S.-owned and U.S.-crewed. The rationale for this…", "date": "2025-08-01", "source_url": "https://justfacts.votesmart.org/public-statement/1694572/introduction-of-the-merchant-marine-allies-partnership-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…through arbitration. The CPJRAA corrected this. These bills       would take us backward.\n\nThe CPJRAA also protects residents from dangerous and       deadly encounters.\n\nIt restricts deadly force; bans neck restraints; limits       high-speed police pursuits in a dense city where bystanders       are most likely to be hurt; and regulates the acquisition…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696988/opposition-letter-led-by-the-dc-justice-lab-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…marijuana  laws.\n\nUnder this bill, HUD must develop regulations that restrict smoking  marijuana in federally assisted housing in the same manner and in the  same locations as HUD restricts smoking tobacco in federally assisted  housing.\n\nI urge my colleagues to support this bill.", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698317/introduction-of-the-marijuana-in-federally-assisted-housing-parity-act"}, {"senator": "Rick Larsen", "party": "Democrat", "sentence": "…This bill guts Federal, State, Tribal, and  local authority and resources to attain clean water and protect locally  important water bodies.\n\nFirst, this bill significantly restricts Federal oversight and  regulatory authorities under the Clean Water Act. The current  administration has already acted to slash Federal funding for clean  water and eliminate…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698022/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "John Hoeven", "party": "Republican", "sentence": "…Management resource management plan for North Dakota.\n\nThis flawed plan, finalized during the closing days of the Biden  administration, undermines BLM's multiple-use mandate and restricts  access to vast, taxpayer-owned energy reserves in North Dakota. It is  yet another example of the Biden administration's overreaching Green  New Deal agenda intended to…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696141/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…$1.5 billion in  state tax revenue.\n\nThe hemp industry has stepped forward to self-regulate in the absence  of uniform federal regulations--uniting behind a framework which  restricts the sale and possession of hemp products to adults 21 years  and older, standardizes packaging to eliminate ``look-a-like'' products  that are appealing to children, standardizes…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696735/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…responsible for protecting the city. Its  antipolice law strips the Metropolitan Police Department officers of  due process protections. It weakens collective bargaining. It restricts  the use of nonlethal tools during civil unrest and has fueled a  devastating staffing collapse.\n\nSince the law took effect under emergency authority in 2020, the  Metropolitan…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696932/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…Act.''\n\nIn September of 2024, the OCC and the Federal Deposit Insurance  Corporation, FDIC, revised their approach to evaluating bank merger  applications. The updated rule restricts a bank's ability to scale,  manage risk effectively, and broaden product offerings, ultimately  discouraging mergers altogether.\n\nBy dismantling a longstanding standard,…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691514/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…Alaska, NPR-A, Integrated Activity Plan, IAP, Record of  Decision, ROD, locks away more than 6 million acres previously made  available for responsible oil and gas leasing and restricts  infrastructure across 8 million acres--completely undermining the  intent of Congress and ignoring the needs and input of local residents.  Passing this joint resolution…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}, {"senator": "Eric Burlison", "party": "Republican", "sentence": "…simultaneously choking off the supply  through regulation, licensing barriers, and protection of entrenched  interests. When government pours taxpayer dollars into a system that  restricts competition, prices rise, efficiency collapses, and  accountability disappears.\n\nThrough it all, the one group that was systematically excluded from  decisionmaking is the…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698105/bringing-america-back-to-its-roots"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "…the rules submitted by the National Park  Service on the Glen Canyon National Recreation Area pertaining to motor  vehicles.\n\nThe National Park Service finalized a rule that restricts off-road  vehicles and all-terrain vehicles, ORVs and ATVs, to access certain  areas within the Glen Canyon National Recreation Area in my district.\n\nThis would prohibit…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690403/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…secretive settlement against  the wishes of local communities.\n\nUnder that agreement, the Park Service issued a revised rule in the  waning days of the Biden administration that restricts motorized uses  in Glen Canyon, overturning decades of precedent and severely  restricting public access and recreation opportunities.\n\nUnder this new rule, dozens of miles…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690405/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…needs of everyday Alaskans. The plan also  designates more than 3.6 million acres as Areas of Critical  Environmental Concern with little or no justification.\n\nThe Biden plan restricts access to Alaska Native lands, violating  commitments made under the Alaska Native Claims Settlement Act. Sadly,  the plan also continues outdated land withdrawals that block…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694897/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Cindy Hyde-Smith", "party": "Republican", "sentence": "…read traffic signs, communicate with law enforcement, and  understand directions clearly and safely.\n\nIn addition, I cosponsored Senator Moody's Safer Truckers Act, which  restricts the issuance of CDLs to only U.S. citizens, lawful permanent  residents, and individuals who are authorized for employment by U.S.  Citizenship and Immigration services.…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697478/commercial-drivers-license-system"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…military  families. There is the $35 million that it authorizes for impact aid in  support of the communities who support our fighting men and women.  There is the provision that restricts and precludes the downsizing of  certain military healthcare installations so we can continue to provide  for the health and well-being of our servicemembers and their families.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695108/providing-for-consideration-of-hr-streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-and-providing-for-consideration-of-hr-stop-illegal-entry-act-of-2025"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…the  issues.\n\nThere is a good chance you will see Senator Sullivan and me here on  the floor of the Senate seeking to disapprove any administrative action  that unreasonably restricts access to public land in our home State.  That is exactly what happened in this 2022 plan. Like we saw so much in  the Biden administration, it lacked balance, and it failed…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696449/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…it has come true.\n\nAmerican families and the businesses that employ most of them are  spending about $25,000 a year for insurance premiums that give them  fewer options and restricts them on what they can do, gives them higher  copays, higher deductibles, and fundamentally makes it impossible for  them to have actual care.\n\nI go back to my point about…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698106/bringing-america-back-to-its-roots"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…even       though the device is no more dangerous and, in many respects,       safer than previous models that remain unregulated under the       GCA.\n\nThis misclassification restricts access to modern,       effective less-than-lethal tools for law enforcement, tribal       agencies, correctional institutions, and healthcare       facilities. It also slows…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700037/law-enforcement-innovate-to-de-escalate-act"}]