[{"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…Speaker, what do House Republicans propose instead?\n\nIt is a collection of failed policies that would raise prices,  leaving an additional 100,000 people without insurance and restricting  access to abortion care, setting the stage for a national abortion ban.\n\nHowever, I believe it is my job to offer solutions to help the  American people and, specifically,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698303/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…government's  violent and regressive persecution.\n\nMr. Speaker, this bill authorizes several economic levers available  to the United States. This includes potential sanctions and restricting  Burma's access to support from the International Monetary Fund. These  are sensible steps to demonstrate Congress' continuing support for the  people of Burma.\n\nMr. Speaker,…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699833/bringing-real-accountability-via-enforcement-in-burma-act"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…because occasionally one is done wrong. That  happens.\n\nThis decision should be made by doctors and patients. It should not  be made by Congressmen and legislators. This is restricting healthcare  that could be incredibly necessary for young people and also for other  family members. It is bigoted, discriminatory, and unnecessary. I hope  this body will…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695253/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…the wake of the shooting at Club Q, we raised the age to purchase a  firearm from 18 to 21. This year, Governor Polis signed three  commonsense gun violence prevention laws restricting the sale of  certain semiautomatic firearms, requiring retailers to keep ammunition  locked, and setting age limits for gun shows.\n\nColorado is making progress, but States…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695673/cloture-motion"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…grid to keep up with the  proliferation of AI and data centers. But the truth also is, President  Trump and the harmful actions his administration is taking are actually  restricting supply, killing good-paying jobs, and increasing energy  prices, which have risen at more than twice the rate of inflation this  year under President Trump.\n\nI will highlight…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696129/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…rates are regulated at the State  level, but they also understand, just as we do here, that Federal  policy plays a role in whether our Nation is increasing energy supply  or restricting it.\n\nIt is simple economics. When supply goes up, prices go down.  Unfortunately, recent actions by this administration have moved us in  the wrong direction.\n\nIn northwest…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699652/when-supply-goes-up-prices-go-down"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…1942, women were restricted to certain occupations and       comprised just 1 percent of the military. Not only that, but       people were discriminatory to Black Americans, restricting       their education, housing, and neighborhoods. Even the       military was segregated by race. Despite these barriers,       Charity Adams-Early overcame both racism…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688375/recognizing-virginias-fourth-district-black-history-month-essay-contest-1st-place-middle-school-winner-augustus-rezba-patel"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…is unified in demanding real  accountability provisions, including requiring ICE agents to identify  themselves, prohibiting agents from wearing masks during enforcement,  restricting the use of deadly force, strengthening hiring and training  standards, enforcing humanitarian standards in ICE custody, and  protecting sensitive locations.\n\nMembers of…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699655/horrific-ice-abuses"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…from privatizing medical care for  veterans and hurt military readiness.\n\nThis extreme proposal also furthers Republicans' constant attempts to  roll back women's rights by restricting healthcare access for  servicemembers and their families.\n\nHouse Republicans' Legislative Branch funding bill, typically a bill  that has been quickly agreed to by both…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695289/9999"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…long-term ecological balance.\n\nI urge my colleagues to support this critical legislation to help  safeguard our coral reefs and the diverse marine life they support. By  restricting the importation of ornamental reef species collected  through harmful practices, we can protect these vital ecosystems for  future generations.\n\nMahalo.", "date": "2025-03-18", "source_url": "https://justfacts.votesmart.org/public-statement/1688918/saving-nemo-act"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…where billionaires rob from hard-working  Americans to augment their wealth.\n\nBy slashing staff, closing 6 out of 10 regional offices, cutting  customer service operations, restricting phone service assistance, and  spreading falsehoods about the Social Security Administration (SSA),  Trump and Musk jeopardize Americans' earned benefits and security. Let…", "date": "2025-04-21", "source_url": "https://justfacts.votesmart.org/public-statement/1690131/opposition-to-president-trumps-and-elon-musks-theft-of-social-security-to-pay-for-handouts-to-billionaires"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…last Congress, Republicans weakened that bipartisan  bill, which I think commanded unanimous support in Congress, by  stripping the background check requirement while still restricting the  bill to handgun sales to current law enforcement officers only. So we  were willing to go along with that compromise. We accepted that in the  last Congress.\n\nWhen…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691349/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…center-right  newspaper whose headline states: ``Dealing With Social Security Is  Heading From Bad to Worse.''\n\nThe agency that administers benefits is cutting staff and restricting  benefits as part of the Department of Government Efficiency review, or  DOGE, the Trump initiative.\n\nLet's be more specific. What are some of those intentional policies…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689134/dont-touch-social-security"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…other States are facing an  illegal reduction of about $8.9 billion in TANF and SSBG funds due to  political retaliation, the Republican leadership chooses to move a bill  restricting women's reproductive choices.\n\nIf Republicans really wanted to help parents care for their children,  they would work with Democrats to ensure that HHS follows the law and…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699231/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…The Congressional Budget Office called their bluff and confirmed that  these Medicaid cuts proposed by the Republicans are not about waste or  efficiency. They are about restricting access to coverage to patients  all across the United States, including in my State of Illinois.\n\nUnder Republicans' watch, CBO stated that 13.7 million Americans will…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690984/medicaid"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…Provisions, and Enforcement Provisions.\n\nOver the past 4 years, the Biden-Harris administration has flooded  our economy with burdensome regulations, stifling growth and  restricting Americans' freedoms. In total, these regulations have  imposed a staggering $1.7 trillion in costs on the American people.  Fortunately, House Republicans and President…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688545/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…It is imperative that the full weight of the United States stands  firmly and publicly against these provocations.\n\nFor decades, our Nation employed a strategy of opacity, restricting  our formal engagement with Taiwan to avoid upsetting or insulting the  Chinese Communist Party.\n\nIn 2020, this body enacted the Taiwan Assurance Act, and the first  Trump…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690685/taiwan-assurance-implementation-act"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…exploitation,  and facilitates immigration enforcement. It protects the Second  Amendment by keeping long-standing safeguards in place that prevent  Federal agencies from restricting lawful firearms, ammunition, and  sporting equipment without congressional approval, and decreases  funding for the ATF. It also maintains pro-life Hyde protections to…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698637/providing-for-consideration-of-hr-saving-homeowners-from-overregulation-with-exceptional-rinsing-act-providing-for-consideration-of-hr-affordable-housing-over-mandating-efficiency-standards-act-and-providing-for-consideration-of-hr-commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "…throughout the whole country.\n\nMs. MALOY. It has had a negative impact on energy production--as soon  as I get in front of a microphone, I have a tickle in my throat--by  restricting the areas that are open for use, withdrawing them from  mineral exploration, oil and gas exploration, and energy production.\n\nThe original intent of the Presidential proclamation…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689196/work-highlights-of-western-caucus"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Service issued a revised rule in the  waning days of the Biden administration that restricts motorized uses  in Glen Canyon, overturning decades of precedent and severely  restricting public access and recreation opportunities.\n\nUnder this new rule, dozens of miles of popular trails and shorelines  are closed off to highway vehicles in what the State…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690405/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…restrict PRC investments in U.S. tech, agriculture,  energy, raw materials, and more.\n\nBut as Chinese companies get richer and richer from American  investment, it is clear that restricting inbound investment is not  enough. We need to prevent the People's Republic of China from using  capital investments by the United States to gain access to and copy our…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688824/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…which are Congressional Review Act  Resolutions of Disapproval.\n\nThese resolutions overturn the Biden administration's Bureau of Land  Management plans that were aimed at restricting gold mining and oil and  gas drilling on Federal lands.\n\nH.J. Res. 104, sponsored by Congressman Downing of Montana, overturns  the Montana Resource Management Plan, which…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694880/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…citizen, while keeping a watchful eye on each and every one of your  financial transactions, crediting or discrediting, or punishing you  based on your personal behavior, and restricting that behavior with the  tap of a button. Nothing could be more inimical to the liberty and  privacy on which American greatness depends.\n\nMr. Speaker, I am proud to be a…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693728/anti-cbdc-surveillance-state-act"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…minority climate lobby.\n\nWhen the Powder River Basin turns off, so does America.\n\nEnergy security is national security. The Biden administration's RMPA  undermines both. By restricting access to our own resources, it pushes  America toward greater dependence on foreign nations, including our  adversaries.\n\nI applaud Congressman Downing of Montana for introducing…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694893/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…purchases.\n\nToday, Congress has an opportunity to invalidate this Biden-era rule  that, if implemented, would severely impact community banks and local  credit unions by restricting the services they can offer, while at the  same time depriving millions of Americans of an important financial  safety net.\n\nAccording to a 2024 survey, consumers stated…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689844/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "French Hill", "party": "Republican", "sentence": "…or government control. Central bank  digital currencies, or CBDCs, put the government at the center of every  financial transaction: monitoring, controlling, and possibly  restricting how Americans could use their own hard-earned money. An  American Government-controlled digital dollar threatens to open the  door to government overreach here at home.…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693731/anti-cbdc-surveillance-state-act"}, {"senator": "Shelley Capito", "party": "Republican", "sentence": "…production.\n\nNatural gas is an affordable, reliable, and clean source of energy  vital to our country and our economy. We should be expanding natural  gas production, not restricting it. Instead, the natural gas tax will  constrain American natural gas production, leading to increased energy  prices and providing a boost to the production of natural…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688160/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…joint resolution.\n\nMr. WESTERMAN.  Res. 131.\n\nMr. Speaker, I rise today in support of H.J. Res. 131 which would  repeal a Biden administration-era Record of Decision, ROD, restricting  oil and gas production on 1.16 million acres within the 10-02 area of  the Arctic National Wildlife Refuge, also known as ANWR.\n\nThe 10-02 area of ANWR was specifically…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696830/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…restrict PRC investments in U.S. tech, agriculture,  energy, raw materials, and more.\n\nBut as Chinese companies get richer and richer from American  investment, it is clear that restricting inbound investment is not  enough. We need to prevent the People's Republic of China from using  capital investments by the United States to gain access to and copy our…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688807/cormick-and-mmcr-fettermanhagerty-kim-cormick-schumer-sullivan-fetterman-and-others-for"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…emphasized numerous times       before, the NPR-A is a petroleum reserve with a proven record       where surface resources and subsistence can be protected       without unduly restricting highly prospective areas to       leasing.\n\nDecades of oil and gas activity on the North Slope clearly       demonstrate industry can operate in the Arctic while       maintaining…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}]