[{"senator": "Sarah McBride", "party": "Democrat", "sentence": "…simple.\n\nIt is cruelty disguised as policy. It punishes families not for  failing to work, but for living through a hard season. I will not stop  fighting until we restore this funding so that no one in Delaware goes  hungry.", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693522/thanking-officer-robert-scisco"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "Mr. MAGAZINER. Mr. Speaker, I rise today for the seventh time to call  on the Trump administration to restore funding for lifesaving food aid  for malnourished children.\n\nRhode Island's Edesia Nutrition has helped save 25 million lives with  this ready-to-use therapeutic food manufactured…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690893/impact-of-volatility-and-policy-reversals"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…Mr. Speaker, I urge this body, Democrats and Republicans, to stand up  for our healthcare heroes, invest in breakthroughs that millions of  lives are depending on, and restore the funding and workforce our  Nation's healthcare system depends upon.\n\nMrs. RAMIREZ. Mr. Speaker, I thank the gentleman from New York (Mr.  Kennedy) for his comments.\n\nMr. Speaker,…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689781/defending-social-services-and-programs"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "Mr. MAGAZINER. Mr. Speaker, I rise today for the 27th time to call on  the Trump administration to restore funding for lifesaving food aid for  malnourished children.\n\nAccording to data compiled by Boston University, more than 70,000  children--children--have died this year because…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693466/lives-lost-due-to-us-ending-food-aid"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "Mr. MAGAZINER. Mr. Speaker, I rise for the fifth time to bring  attention to the Trump administration's failure to restore funding for  food aid for malnourished children, despite their promise to do so.\n\nI speak today about the biology of hunger. A 2-year-old child may  weigh the same as a newborn.…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690758/biology-of-hunger"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "Mr. MAGAZINER. Mr. Speaker, I rise today for the 26th time to call on  the Trump administration to honor its word and restore funding for  lifesaving food aid around the world.\n\nMr. Speaker, the words from the Trump administration have been pretty  good on this. Elon Musk said that funding for emergency…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693095/calling-on-trump-administration-to-restore-lifesaving-food-aid"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…Our Nation is safer and more competitive as a result of our goodwill  toward others.\n\nSo I rise the third time to urge the White House and my colleagues in  Congress to restore funding to protect America's global leadership.", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690575/call-for-restoration-of-global-emergency-food-aid-funding"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…millions, forcing  layoffs and cuts. Worse, the current budget would slash dedicated CVI  funding even further, jeopardizing these lifesaving efforts.\n\nCongress must act to restore funding and protect proven prevention  strategies.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695493/community-violence-intervention-funding"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…my colleagues to evoke one of my son's favorite programs,  ``Mister Rogers,'' and be a good neighbor. Vote ``no'' on the cuts to  public broadcasting.                   restore funding for lifesaving food aid\n\nMr. MAGAZINER. Mr. Speaker, I rise today for the 16th time to beg the  Trump administration to honor its word and restore funding for  lifesaving…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692007/cuts-to-public-broadcasting"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…and R.F.K., Jr.,  ended Federal funding for that work.\n\nWhat do my colleagues want to say to those parents? I don't even know  what there is to say. Yes, we can fight to restore funding. Yes, we  will fight here to restore funding, especially as so many of Trump's  cuts are, in fact, outright illegal. But we cannot restore from here  lost time--invaluable…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694964/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…enforcement officers whether  they are local or State, Tribal, or Federal, and let's support them  symbolically with our words but more importantly with our actions.  Let's restore all of the funding, the hundreds of millions of dollars  that have been cut or that face cuts by this new administration.\n\nMr. Speaker, I am delighted to hear the distinguished chairman…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691030/expressing-support-for-local-law-enforcement-officers"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "Mr. MAGAZINER. Mr. Speaker, I rise today for the sixth time to call  for the Trump administration to restore funding for lifesaving food aid  for malnourished children.\n\nIt has been 2 months since Congress passed and President Trump signed  a funding bill for fiscal year 2025. It included…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690809/funding-food-aid-for-malnutrition"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…survive.\n\nIf we allow Edesia and MANA's mission to fail, it will be a moral  failure on our part.\n\nI urge the administration and my colleagues to do the right thing.  Restore the funding for emergency food aid. Keep America's promise to  the world's most vulnerable children. We do not have another day to  waste. This is a moment of urgency.\n\nThat is…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690379/edesia-nutrition-saves-malnourished-children"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…included this provision, he blocked all  of my committee members' financial services amendments from  consideration in this bill.\n\nWhat did he block? I offered an amendment to restore funding to the  Consumer Financial Protection Bureau that Trump unlawfully cut. I also  offered language to protect workers, small businesses, and small  community banks and credit…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695151/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Nelida Pou", "party": "Democrat", "sentence": "…Education is dismantling public  schools. New Jersey is the latest victim.\n\nI will continue working with our district school officials to use  every single tool available to restore this funding and to fight to  support public education. I will not give up on our children.", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698570/lodi-teachers-recognition"}]