[{"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Students who strive to make  the most of their education, like Avtar, develop crucial skills and a  work ethic that will guide them for the rest of their lives.", "title": "Recognizing Avtar Gross", "date": "2025-04-08"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Students who strive to make  the most of their education, like Kloey, develop crucial skills and a  work ethic that will guide them for the rest of their lives.", "title": "Recognizing Kloey Kehl", "date": "2025-06-04"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Students who strive to make  the most of their education, like Eamon, develop crucial skills and a  work ethic that will guide them for the rest of their lives.", "title": "Recognizing Eamon Vandyke", "date": "2025-06-03"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Students who strive to make  the most of their education, like Alexya, develop crucial skills and a  work ethic that will guide them for the rest of their lives.", "title": "Recognizing Alexya Sandoval-Perez", "date": "2025-04-10"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Students who strive to make  the most of their education, like Nayeli, develop crucial skills and a  work ethic that will guide them for the rest of their lives.", "title": "Recognizing Nayeli Andazola", "date": "2025-04-02"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Students who strive to make  the most of their education, like Arthur, develop crucial skills and a  work ethic that will guide them for the rest of their lives.", "title": "Recognizing Arthur Lane", "date": "2025-06-03"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Students who strive to make  the most of their education, like Jordan, develop crucial skills and a  work ethic that will guide them for the rest of their lives.", "title": "Recognizing Jordan Reil", "date": "2025-05-13"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Students who strive to make  the most of their education, like Kariza, develop crucial skills and a  work ethic that will guide them for the rest of their lives.", "title": "Recognizing Kariza Cortez", "date": "2025-05-20"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Students who strive to make  the most of their education, like Tasia, develop crucial skills and a  work ethic that will guide them for the rest of their lives.", "title": "Recognizing Tasia Howard", "date": "2025-04-08"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Students who strive to make  the most of their education, like Bellatrix, develop crucial skills and  a work ethic that will guide them for the rest of their lives.", "title": "Recognizing Bellatrix Fail", "date": "2025-04-08"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Students who strive to make  the most of their education, like Valeria, develop crucial skills and a  work ethic that will guide them for the rest of their lives.", "title": "Recognizing Valeria Seanz Alvarado", "date": "2025-04-02"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "I congratulate the team on a game and a season that they will  remember, again, for the rest of their lives.", "title": "Divine Child Championship", "date": "2025-12-11"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Students who strive to make  the most of their education, like Abel, develop crucial skills and a  work ethic that will guide them for the rest of their lives.", "title": "Recognizing Abel Harris", "date": "2025-04-08"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Students who strive to make  the most of their education, like Presley, develop crucial skills and a  work ethic that will guide them for the rest of their lives.", "title": "Recognizing Presley Griego", "date": "2025-06-04"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Students who strive to make  the most of their education, like James, develop crucial skills and a  work ethic that will guide them for the rest of their lives.", "title": "Recognizing James Millard", "date": "2025-04-08"}, {"senator": "David Taylor", "party": "Republican", "sentence": "It takes teamwork to achieve  great things, and that is something I hope the girls carry with them  for the rest of their lives.", "title": "Recognizing Brandan Holliday", "date": "2025-12-09"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "And now, another American  family will have to live the rest of their lives with the pain most of  us cannot even begin to comprehend.", "title": "Immigration", "date": "2026-02-04"}, {"senator": "Tom Emmer", "party": "Republican", "sentence": "It was a transformational experience that we will keep with us for  the rest of our lives, and it was, in large part, thanks to Father  Kelly's leadership, faith, and commitment to helping others experience  the power and the history of the Holy Land.", "title": "Welcoming Reverend Eamon Kelly", "date": "2025-11-20"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "We must not let our veterans' time in service be what holds them back  from living the rest of their lives.", "title": "No Wrong Door for Veterans Act", "date": "2025-05-20"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "My bill creates accountability and ensures fraudsters are banned from  receiving SBA resources for the rest of their lives.", "title": "Assisting Small Businesses Not Fraudsters Act", "date": "2025-02-24"}, {"senator": "Mike Johnson", "party": "Republican", "sentence": "Before I respond to the  allegations from across the Chamber, I just want to take us back to a  day that most of us will remember so very fondly for the rest of our  lives and that is November 5 of 2024.", "title": "One Big Beautiful Bill Act", "date": "2025-07-02"}]