[{"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…major emitters--a coal  plant, a cement plant, and a lime plant--and it failed to demonstrate  that that inaction was reasonable. The Trump EPA approved the plan  anyway.\n\nThe resulting pollution will blow downwind toward Midwestern and  Eastern States. The EPA's approval puts forward a reading of the Clean  Air Act that is blatantly at odds with the text,…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698620/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "…take a case to arbitration.       From 2015-2021 officers who were fired and/or their       representatives allowed years to pass before bringing a case       to arbitration resulting in large awards for backpay and high       administrative costs for the District.\n\n3. H.R. 2096 would remove the transparency requirement for       the police department…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692304/protecting-our-nations-capital-emergency-act"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…Russ Vought confirmed that the bill cuts PEPFAR by $400  million.\n\nWhen you cut funding to family planning programs, tens of millions  will be denied modern contraceptives, resulting in millions of  unintended pregnancies and tens of thousands of preventable pregnancy- related deaths.\n\nWhen you cut funding for international peacekeeping and to people…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692547/rescissions-act-of-2025"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…from FNS, State agencies must recode their eligibility       systems to adjust for the reduced maximum allotments. See 7       C.F.R. 271.7(d)(1)(ii); 274.2(a). The resulting reduced       benefits amounts for certified SNAP households will be sent       to States' EBT processors in ``issuance files.'' See Penn       Decl. Doc. No. 14-2 \f 7, 24.…", "date": "2025-11-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696499/unanimous-consent-request"}, {"senator": "Sharice Davids", "party": "Democrat", "sentence": "…5342, flying from Wichita, Kansas, to Ronald Reagan National  Airport, collided with UH-60 Army Black Hawk helicopter PAT 25 while on  final approach to runway 33 at DCA, resulting in both aircraft crashing  over the Potomac River.\n\nThere were no survivors. Mr. Speaker, 67 innocent lives were lost: 60  passengers, 4 flight crew, and 3 Army soldiers.…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688369/expressing-condolences-to-the-families-friends-and-loved-ones-of-the-victims-of-the-crash-of-american-eagle-flight-5342-and-pat-25"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…that the Israeli Government, self-consciously, has restricted  the aid that is necessary to get in, has interfered with organizations  that were delivering aid, and it is resulting in an extension of the  suffering.\n\nWars are terrible, not always avoidable. But after the horrors of  World War II, we had, as part of the international community, the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695678/cloture-motion"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…breaking the rules. They       suggested that officers may be more likely to engage in       misconduct when they believe they have a good chance of       overturning any resulting discipline.''\n\nH.R. 5107 would also repeal many other common-sense reforms       of D.C.'s laws that have been adopted across the country,       including:\n\nTimely and thorough…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696949/opposition-letter-led-by-the-american-civil-liberties-union-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…nuclear arms control to the top of his  national security agenda. Even the modest steps I have mentioned to  reduce the chance of a catastrophic mistake or miscalculation resulting  in the use of nuclear weapons should be among our highest national  security priorities.", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699676/the-new-start-treaty"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…harmful air pollutants from all segments of the  rubber tire manufacturing process.\n\nWhile the economic impacts on these firms are small, the rule will  reduce air pollution, resulting in greater public health protections  for the communities near those 12 facilities.\n\nThis resolution is just the latest on a long and growing list of  legislation to give…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688528/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…Defense       (DoD) described the potential impacts to military operations       for the project.\n\nAs a result of discussions between ;rsted and the U.S. Air       Force and a resulting mitigation agreement signed by the       Assistant Secretary of Defense for Energy, Installations, and       Environment on November 4, 2024, the Military Aviation and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695066/halt-work-orders"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…Administration have resulted in longer wait times for seniors applying  for benefits.\n\nI have been proud to join legal briefs filed against the  administration, which are resulting in the reinstatement of thousands  of Federal workers. I will continue to push back against the President  and oppose illegal cuts to the Federal workforce, which block Americans…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692075/illegal-cutting-of-federal-workforce"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…deeply rooted in faith,  deeply rooted in nonviolence, and was ultimately tested that night. He  met the test that night and continued forward.\n\nPart of that movement ended up resulting in the civil rights  legislation that became the crown jewel of the American democracy,  because America wasn't really a democracy in 1776 or when the  Constitution was written…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699200/building-a-beloved-community"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…depends on whether the disease was caught early  enough to benefit from treatment options. The gradual onset of CIDP can  delay diagnosis by several months or even years, resulting in  significant nerve damage that may take several courses of treatment  before benefits are seen. The chronic nature of CIDP differentiates  long-term care from GBS patients.…", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691695/recognizing-may-2025-as-gbscidp-awareness-month"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…months, the Trump Administration has       undone six decades of investments that made the United States       more respected and influential than any other nation. The       resulting chaos has left us weaker and more vulnerable. Like       all of my colleagues, I have always supported reforming       government and making sure our tax dollars are spent…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691139/us-global-health-programs"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…because of unreasonable travel distances for  appointments, especially specialists.\n\nFor some veterans, this can be a reason to delay or forgo routine  exams or care, later resulting in poorer health outcomes. We hear many  stories of veterans who have appointments scheduled hours away,  requiring them to secure transportation, which can often be difficult.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695497/rural-veterans-improved-access-to-benefits-act-of-2025"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…12 people were killed.\n\n``Enemy warplanes launched raids on the Wadi Fara area in       the northern Beqaa Valley, one of which targeted a camp for       displaced Syrians, resulting in the deaths of 12 martyrs,       including seven Syrians, and eight wounded,'' the country's       state-run National News Agency reported.\n\nThe strikes in Lebanon's northeastern…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693678/department-of-defense-appropriations-act-2026"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…Boyajian has transitioned  Freedom House with dignity and care for its staff and partners, while  incredibly navigating the volatile worldwide of democratic backsliding,  resulting from years of unchecked authoritarian rule. Under her  guidance, the organization has adapted to these turbulent times while  maintaining its core mission, emerging stronger…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700047/recognizing-the-service-of-annie-wilcox-boyajian"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…line of duty, 12 of whom tragically lost their  lives.\n\nMr. Speaker, even more alarming is there have been 21 ambush-style  attacks on law enforcement officers this year, resulting in 25 officers  shot, 5 of whom were killed. These numbers do not account, though, even  for the many instances where officers were fired upon but, fortunately,  were not…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691319/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Congress of any threat to the security or the social or       economic system of the people on Taiwan and any danger to the       interests of the United States arising therefrom resulting       from actions of the People's Republic of China, it is the       policy of the United States to seek to exclude       representatives of the People's Republic of China,…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699846/pressure-regulatory-organizations-to-end-chinese-threats-to-taiwan-act"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…API and whose members represent nearly 70 percent of U.S.       onshore oil and gas production, have removed or replaced more       than 180,000 gas-driven pneumatics, resulting in the       permanent reduction of an estimated 355,421 metric tonnes of       CH4 per year released into the atmosphere based on 2023 EPA       reporting. Operators are…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688182/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…requirements.--Such memorandum shall       establish a strategy satisfactory to the State and Federal       agencies that are parties to the memorandum, to address water       pollution resulting from mine drainage at sites eligible for       reclamation and mine drainage abatement expenditures under       section 404, including specific procedures for--\n\n``(A) ensuring…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691092/community-reclamation-partnerships-act-of-2025"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…hundreds of rural counties and school districts across the  country who have seen their budgets slashed through no fault of their  own.\n\nThe program expired in the fall of 2023, resulting in county payments  reverting to the rate under permanent law, which equates to a nearly 70  percent reduction.\n\nToday's legislation will extend Secure Rural Schools for…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697653/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…Colorado, in  support of the release of hostages held captive by Hamas. While  shouting, ``Free Palestine,'' Soliman attacked the peaceful  demonstrators with Molotov cocktails, resulting in the hospitalization  of at least eight people who suffered burns and other injuries. At  least one of the victims had survived the Holocaust.\n\nAccording to the Justice…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697237/no-immigration-benefits-for-hamas-terrorists-act-of-2025"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…in schools, including       statistical problem solving and data science, is not keeping       pace with the rapidly evolving needs of the public and       private sector, resulting in a STEM skills shortage and       employers needing to expend resources to train and upskill       employees.\n\n(2) According to the Bureau of Labor Statistics, the United…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688976/mathematical-and-statistical-modeling-education-act"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…unleash American energy and to end the era  of overregulation.\n\nIn just 7 months, President Trump has already taken those historic  steps to boost domestic energy production, resulting in gas prices  dropping by 50 cents over the past year.\n\nIn March, President Trump and EPA Administrator Lee Zeldin undertook  the largest day of deregulation in American…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693885/unleashing-american-energy"}, {"senator": "French Hill", "party": "Republican", "sentence": "…region that our adversaries, such as China,  are trying to exploit.\n\nAn American presence in a region rich in critical minerals.\n\nAmerican values are being promoted abroad, resulting in governance  improvements that align sub-Saharan African nations with American  foreign policy.\n\nAGOA greatly benefits our national security and economy. For those  reasons,…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698905/agoa-extension-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Trump. It was a Democrat, Representative Plaskett, who  literally texted with Jeffrey Epstein as we questioned Michael Cohen.  It was Democrats who shut down the government, resulting in the delay  of swearing in of Members.\n\nAs we vote to pass this legislation--and it will pass--it is  impossible, however, to avoid problems with its politicization. One…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696812/epstein-files-transparency-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…lower-      income individuals for tax years 2021 and 2022. For example,       the law increased the premium tax credit amounts for eligible       individuals and families, resulting in access to plans with       no premium contributions for those earning 100 to 150 percent       of the federal poverty level. It also expanded eligibility       for premium…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698381/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Mr. Speaker, America is back and, like the President says, hotter  than ever.\n\nThroughout 2025, Republicans worked to undo the damage of the Biden- Harris administration, resulting in less red tape, bigger paychecks, a  blue-collar boom, and a stronger, more resilient workplace.\n\nThe United States will always be the land of opportunity, but the  previous…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699063/how-republicans-have-delivered-for-americans"}, {"senator": "John Thune", "party": "Republican", "sentence": "…strategies,       technologies, and measures that eliminate or reduce, through       biological, chemical, or physical means, the levels of       harmful algae and associated toxins resulting from harmful       algal blooms.\n\n``(d) Database.--The program shall include a database for       cataloging the licensing and permitting requirements,       economic costs,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695277/harmful-algal-bloom-and-hypoxia-research-and-control-amendments-act-of-2025"}]