[{"senator": "Lucy McBath", "party": "Democrat", "sentence": "…enforcement officers of their hard-earned  retirement benefits.\n\nI will put on the Record that, unlike other Federal employees,  Federal law enforcement officers are eligible to retire voluntarily  after serving our country for at least 20 years and reaching the age of  50 or after 25 years of service at any age.\n\nNow, the Special Retirement Supplement for…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691321/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…play by the rules, you should be able to provide a comfortable  living for yourself and for your family. You should be able to educate  your children, purchase a home, one day retire with grace and dignity,  go on vacation every now and then, and, of course, have access to high- quality affordable healthcare, not to take healthcare away from the  American…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688227/solving-problems-for-the-american-people"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…National Weather Service are already  understaffed and overworked. He fears for what the terminations of  younger staff will mean for expertise when more senior forecasters  retire. Without passionate, dedicated, trained meteorologists,  Americans' lives and property are at risk.\n\nHow will firing workers in charge of warning the public of weather  emergencies…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688591/recognizing-federal-employees"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…losing their health coverage, including many of  the 370,000 Medicaid beneficiaries in my district.\n\nThis includes people like Yvette from Van Nuys who said that she  wants to retire without spending a large portion of her pension on  medical coverage.\n\nI also heard from Joe from Panorama City who, without the help of  Medicaid, would not be able to afford…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691409/gop-tax-scam-hurts-women-and-families"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…Tribute to German Vazquez\n\nMr. President, finally, let's say good-bye to German Vazquez--a very  special good-bye to one of the Senate's unsung heroes, German Vazquez,  who will retire soon, after 28 incredible years of service.\n\nThe public may not know German, but every single Senator knows him.  You see his face, and you smile. You  can always find him…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698255/nominations"}, {"senator": "Wesley Bell", "party": "Democrat", "sentence": "…solve.\n\nFor generations, the American Dream meant that if you worked hard,  you could build a stable life, you could afford a home, you could raise  a family, and you could retire with dignity. Today, that dream feels  farther away for millions of people, not because they stopped believing  in it but because it is becoming impossibly unaffordable.\n\nAffordability…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699585/stop-the-republican-affordability-crisis"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…is, did  anything to extend benefits. That includes a COLA that is out of place,  as AARP indicates, as well as tax cuts for people who continue to have  to work after they retire and then have their Social Security double  taxed. It also applies for an across-the-board increase for all of our  citizens who haven't seen that since 1971.\n\nMr. Speaker,…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688584/congress-has-not-enhanced-social-security-in-more-than-50-years"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…that they bought nearly 22 years ago.  Linda served her community for 30 years as a registered nurse, working  primarily with new moms and babies, before she was forced to retire due  to chronic health issues. Since then, she and her husband have relied  on Medicaid and he on Medicare for their healthcare because they cannot  afford other types of insurance.…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689545/h-con-res-14"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…in our national  debt to serve billionaire oligarchs instead, billionaire oligarchs and  donors who will never have to wonder whether they can afford to go to  the doctor, retire with dignity, or even put food on the table to feed  their children at night.\n\nIt is outrageous, it is a rip-off, and it is a heartless betrayal of  the American people, the…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688070/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…are slowing down projects, driving  up costs, and ultimately are a major contributor to higher prices for  working families.\n\nThe data is clear: Nearly 10,000 electricians retire each year, while  only about 7,000 new entrants come in each year, according to the  Bureau of Labor Statistics.\n\nGoldman Sachs has estimated the United States will need roughly…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697895/electric-supply-chain-act"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…individuals. The Coast Guard took action on only two of those subjects.\n\nDue to the lack of oversight and the Coast Guard's mishandling of  this, these individuals were allowed to retire, some at the grade of  commander, with full benefits, and they received no punishment. That is  unacceptable.\n\nIn 2023 December, former Commandant Schultz admitted to withholding…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688520/coast-guard-authorization-act-of-2025"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…living for  yourself and for your family, educate your children, purchase a home,  have access to high-quality healthcare, go on vacation every now and  then, and then, one day, retire with grace and dignity. That is the  American Dream. That is the ability to afford and access the good life.\n\nWe believe, as House Democrats, that no single force in the United…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…to retired law enforcement officers.\n\nBecause the bill now has no background check requirement, it could  create a situation in which it would be possible for an officer to  retire and commit a crime, such as domestic violence or assault, that  would ordinarily render him or her ineligible to purchase and possess  firearms but then still be able to buy…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691349/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…honored to represent the great city of  Chicago. Oh, it is controversial. There are some people in downstate  Illinois that say they ought to go off and be their own State, retire  them. I am not one of those people. I am proud of the fact that Chicago  is part of our State.\n\nBut my roots are in downstate Illinois, born in St. Louis, raising my  family…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689510/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…protect  veterans or Gold Star families from these exploitative practices.  Servicemembers and  their families should not lose important consumer protections simply  because they retire, separate from honorable service, or lose their  loved ones. Frankly, all Americans deserve to be shielded from these  kinds of predatory loans, and that is just what our bill…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699792/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…missions.\n\nTo that end, this bill ensures that the morale, well-being, and  safety of our Coast Guard personnel are prioritized from the day they  enter boot camp to the day they retire.\n\nIn line with President Trump's efforts to rebuild America's maritime  capacity, this bill strengthens America's maritime base, including  provisions that streamline the merchant…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697805/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…that. We have been able to maintain a quality of life for  the folks that we represent so that our region remains a great place to  live, to work, to raise a family, and to retire. The Cap-to-Cap program  has been a very big part of allowing that to continue, of giving our  region a cohesive identity, and I look forward to the 54th annual trip  next…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Mike Simpson", "party": "Republican", "sentence": "Mr. SIMPSON. Mr. Speaker. I rise today to recognize my long-time  employee, Linda Culver, as she prepares to retire at the end of June.\n\nI've often said that a really good staff makes a decent Member of  Congress--and throughout my time in office, I've been fortunate to have  outstanding…", "date": "2025-06-20", "source_url": "https://justfacts.votesmart.org/public-statement/1692691/recognizing-linda-culvers-retirement"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "Mr. EZELL. Mr. Speaker, I rise today to recognize a distinguished  public servant from Hancock County, Mississippi, Brian ``Hooty'' Adam,  who will retire on December 21, 2025, after more than four decades of  serving his community.\n\nHooty began his career in 1985 as a firefighter, answering the call  when his neighbors needed…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696876/recognizing-brian-hooty-adam"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…thanks to Jim's leadership. Jim is a steadfast pillar of the  northwestern Pennsylvania region, and his legacy will be felt for  generations.\n\nWhile it is bittersweet to see Jim retire, I know that we will still  see him around Warren, probably on his mountain bike, enjoying the  outdoors. I wish him the best as he starts this new chapter of life.", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697068/recognizing-jim-decker"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…only a few living individuals to  earn this distinction.\n\nMr. Speaker, Elliot has dedicated his life in service to the Centre  region both on and off air, and he will formally retire from the Patton  Township Board of Supervisors at the end of this year.\n\nMr. Speaker, I wish him all the best.", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697750/recognizing-elliot-abrams"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…retirement investing is supposed to be about: maximizing  returns and minimizing risk for workers and retirees.\n\nAmericans set aside money in their 401(k)'s and pension plans to  retire with dignity. They do it so that they can pay their bills, cover  medical costs, and support their families. They do not invest their  hard-earned savings so that Federal bureaucrats…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699160/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…Demand is climbing fast and driven by manufacturing, by  technology, and the needs for a modern economy while large amounts of  dependable thermal generation are scheduled to retire.\n\nMr. Chair, when you put those two trends together, you get a grid  that must work harder than ever and cannot afford any weak links. That  is exactly why the Electric Supply…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697893/electric-supply-chain-act"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…infamous Hanoi Hilton,  enduring brutal torture, unimaginable conditions, and profound  isolation. He never broke. He returned with honor.\n\nAfter his release in 1973, Allen didn't retire quietly. He returned  to Active Duty, ultimately commanding a major Navy training wing. Upon  retiring in 1979, after 32 years of service, he set sail, literally,  cruising…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691271/congratulating-northwest-florida-state-womens-basketball-team"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…Retirement of Fire Chief Tim Williams\n\nMr. CLINE. Mr. Speaker, I rise to recognize and commend an  extraordinary public servant, Shenandoah County Fire Chief Tim  Williams, who will retire on October 1 after an astounding 50 years of  dedicated service in fire and rescue.\n\nChief Williams began his journey as a volunteer with the Strasburg  Volunteer Fire Department…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692312/recognizing-new-freedom-farm-and-lois-mcgill"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…Some of Mark's former students are now his doctor, dentist, and even  his mechanic. That is the kind of legacy every teacher hopes for.\n\nMr. Otten says he is not ready to retire, and I hope he doesn't  because Utah needs more educators like him: humble, committed, with  passion for and belief in the next generation.", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694043/recognizing-mark-otten"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "Mrs. McCLAIN. Mr. Speaker, I rise today to recognize and commend  Karry Hepting, the dedicated County Administrator of St. Clair County,  Michigan, who will retire at the end of this year after more than 26  years of distinguished public service.\n\nKarry Hepting has played a central role in the effective governance  of St. Clair County…", "date": "2025-10-31", "source_url": "https://justfacts.votesmart.org/public-statement/1696497/commending-karry-hepting-for-her-exemplary-leadership-and-dedication-to-st-clair-county-michigan"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…the baby boomers.\n\nWe actually have an unusual thing happening. If you take a look at  the Social Security actuary report, a lot of our brothers and sisters  are choosing to retire at 62, which actually is hurting productivity  because many of these folks are very productive workers, but they are  fearful, saying: Well, in 2032, I get a 24 percent cut,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695567/we-are-borrowing-a-second"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…company in Dallas. Andy's grandparents founded the company in 1950,  operating the business out of a back room in their house. Eventually,  when the time came for them to retire, they sold the business to their  daughter and her husband, who in turn sold it to their children. Now  more than seven decades later, Andy and his siblings are the third-…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690294/texas"}, {"senator": "Jim Baird", "party": "Republican", "sentence": "…Karen Plaut\n\nMr. BAIRD. Mr. Speaker, I rise today to honor Dr. Karen Plaut, the  executive vice president for research at Purdue University who recently  announced she will retire on June 30 of this year.\n\nDr. Plaut has a truly impressive career. Dr. Plaut attended the  University of Vermont, received her master's from Pennsylvania State  University,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690518/congratulating-mccutcheon-high-schools-mavericks-robotics-team"}]