[{"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…Dream.\n\nHedge funds, speculators buying up houses, jacking up the cost of  that housing are becoming lousy landlords, pricing people out of what  could be a nest egg for their retirement, their home.\n\nMonopolies are jacking up prices and killing small businesses every  chance they can get. Pharmacy benefit managers, or PBMs, are raising  the cost of medicine…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689080/economic-populism"}, {"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "…with Kansas City to adopt an ordinance to prohibit  discrimination against women and to stop employers from penalizing  women with less experience.\n\nWhen it was time for retirement, Alice saw it as an opportunity to do  her evening tasks full-time. At age 69, she traveled to the Mosquito  Coast of Honduras on a human rights observation mission. She…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698825/recognizing-the-life-and-memory-of-alice-kitchen"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…Hutchins is the fact  that he has wonderful sense of humor and the fact that you can almost  count on him to tell a ``good joke.''\n\nAs Councilman Hutchins begins his well-earned retirement, Vivian and  I join his family, friends, and the people of Blakely in thanking him  for his tireless service and leadership. His steady stewardship and  commitment to the…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698107/recognizing-the-honorable-al-hutchins"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…that have relied on Social  Security, Medicare, Medicaid, and SNAP, seniors that have worked all  their lives to build America, and all they want to do is have a  peaceful retirement.\n\nI rise today because my colleagues across the aisle are looking to  cut Medicaid and SNAP, programs that hundreds of millions of Americans  rely on to keep food on their…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690388/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…collaboration with city  agencies, elected officials, and local stakeholders has left a lasting  impact on the Ridgewood community.\n\nAs Mr. Renz embarks on a well-earned retirement after 37 years of  dedicated public  service, I extend my deepest gratitude for his leadership, and  unwavering commitment to strengthening the economic fabric of New York…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693397/recognizing-theodore-m-renz"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "…we are incredibly grateful for his hard work.\n\nOn behalf of the people of Colorado's Seventh Congressional District,  I am honored to congratulate Chief Bob Baker on his retirement.", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692015/recognizing-chief-bob-baker"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…servants--dedicated, attentive, and unwaveringly committed to the  service of others. On behalf of a grateful district, I want to  congratulate Dave on a well-deserved and replenishing retirement.", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691563/recognizing-the-retirement-of-david-caron"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…colleagues and the Fairfax  County Sheriff Stacey Kincaid. Sheriff Kincaid ended up offering  Shabazz the position to serve as her Chief Deputy in 2022, despite his  nearing retirement. Knowing he had more service to give, he accepted  and obtained the rank of Lieutenant Colonel.\n\nWhen taking over the position of Chief Deputy of Operations, Shabazz  was…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696033/recognizing-lieutenant-colonel-jabar-shabazz-on-his-retirement-from-the-fairfax-county-sheriffs-office"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…unnecessarily restricts the free  market. It dictates what private sector fiduciaries can and cannot  consider when making investment decisions that directly affect the  savings and retirement savings of hardworking Americans.\n\nFor this reason and at the appropriate time, I will offer a motion to  recommit this bill back to committee.\n\nIf House rules permitted,…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699158/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Katherine Clark", "party": "Democrat", "sentence": "…get. Then they are pushing the costs even higher. Today, they are  voting to raise overdraft fees.\n\nAfter crashing the economy, eliminating jobs, and destroying people's  retirement savings, they are making it more expensive to be short on  money by $225 a year per family. Also, the banks can pocket more, which  is their priority.\n\nLater today, Republicans…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689842/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…priorities are tax breaks for his buddies while working  families are told to tighten their belts. We should be expanding care,  not slashing it. We should be protecting retirement security, not  playing games with the futures of people who worked their entire lives.\n\nTexas families are watching and we will not let this administration  destroy the programs…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689782/defending-social-services-and-programs"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…theoretical.\n\nIn Oklahoma, public pension officials estimated that complying with a  similar blacklist policy could cost them nearly $10 million. In  Arkansas, the State retirement system estimated comparable restrictions  could reduce returns by $30 million to $40 million a year. In Indiana,  an analysis found it could cost pension returns as much…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699153/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "Mr. WALKINSHAW. Mr. Speaker, I rise today to commend Mr. Paul Gilbert  on his upcoming retirement after two decades of extraordinary  leadership as Executive Director of NOVA Parks. Mr. Gilbert has  transformed our park system into a vibrant, inclusive network of  outdoor…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697129/recognizing-nova-parks-executive-director-paul-gilbert-on-the-occasion-of-his-retirement"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…of the Year in  2024.\n\nCongratulations to Chief Johnson on his exceptional career. We thank  Chief Johnson for all his service to our community, and we wish him a  happy retirement.      Celebrating Independence High School Varsity Winter Guard's 2025                       Scholastic State Championship\n\nMr. SUBRAMANYAM. Mr. Speaker, I rise today to…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689774/congratulating-chief-keith-johnson-on-his-retirement"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…enforcement career, Detective Gachett is an  ordained minister and a devoted follower of Jesus Christ. He is also a  loving husband, father, and grandfather.\n\nNo one deserves retirement more than Jerry, but I know that he won't  be retiring for real, as he has been sworn into the APD Reserves. I am  sure we will continue to see him serving our community…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687992/congratulating-jerry-gachett-on-his-retirement"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…him with a Congressional Veteran  Commendation. His persistent efforts in fostering beliefs of sacrifice  and respect reflect his value as a leader during service and in  retirement.\n\nAfter completing his early education in Lockhart, Texas public  schools, Danny enrolled at Southwest Texas State College. Within his  first week there, he recognized the…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696328/recognizing-danny-charles-masur-with-a-congressional-veteran-commendation"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "Mr. BERGMAN. Mr. Speaker, it is my honor to congratulate Sergeant  Christine Bettis on her retirement after twenty-seven years of  dedicated service to the Michigan State Police. I thank Sergeant Bettis  for her tireless work to keep the citizens of Northern Michigan safe.…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688435/recognizing-the-retirement-of-sergeant-christine-bettis"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…sacrifice.\n\nI thank him; his wife, Tawny; and his children, Dallas, Ashlynn, and  Teagan, for making sacrifices so our Nation can prosper.\n\nChief Jason, Aim High and have a happy retirement.", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694125/recognizing-usaf-chief-master-sergeant-jason-q-shaffer"}, {"senator": "French Hill", "party": "Republican", "sentence": "Mr. HILL of Arkansas. Madam Speaker, I rise to wish Lorie Tudor, the  former director of the Arkansas Department of Transportation, a very  healthy and happy retirement.\n\nLorie was with the Department of Transportation for over four decades  and served as the director for the last 5 years.\n\nShe began her career at the department as a clerk-typist…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688705/recognizing-lorie-tudor-on-her-retirement"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…fraud around  here. It is the inability to understand the scale of what is going on.\n\nLet's understand that borrowing is a tax. It is a tax paid for in the  future with your retirement, my kids, but it is a tax paid with  interest.\n\nWe have a society who so desperately wants free stuff. They want  money. The 100 times I have come behind this microphone…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694915/facts-and-math"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "Mr. GUTHRIE. Mr. Speaker, I rise today to honor and congratulate Mr.  Stephen D. Austin, Assistant Chief of Army Reserve, on his retirement  from the U.S. Army Reserve as a Department of the Army Civilian, Senior  Executive Service Tier 3.\n\nMr. Austin's career is a testament to unwavering dedication and  distinguished…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696046/recognizing-mr-stephen-d-austin-assistant-chief-of-us-army-reserve"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…Dubinsky, Secretary; Isabel Ditzel; and Eric Monday.\n\nThis anniversary season opened with ``Love and Sacrifice: A tribute  to the Heart of Opera Roanoke,'' which also marked the retirement of  Maestro Steven White, whose more than 20 years of service have  profoundly shaped the company's artistic excellence.\n\nAs Opera Roanoke looks ahead to its 50th anniversary…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696845/recognizing-50th-anniversary-of-opera-roanoke"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…Operations and Director of Systems and Engineering at the  Pennsylvania Biotechnology Center and Baruch S. Blumberg Institute.  Today, I proudly commend him on his well-earned retirement, following  16 years of dedicated work to furthering education and research in our  community.\n\nAs the Director of Operations and Director of Systems and  Engineering, Mr.…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696849/recognizing-mr-konrad-kroszners-16-years-with-the-pennsylvania-biotechnology-center-and-baruch-s-blumberg-institute"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "Mr. HARIDOPOLOS. Mr. Speaker, I rise today to recognize and  congratulate Frank Abbate on his upcoming retirement next Thursday,  marking the end of a 36-year career in public service in Brevard  County.\n\nFrank has spent the last several years, since 2017, serving as our  Brevard County…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690852/congratulating-frank-abbate-on-his-retirement"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…should all admire.\n\nMr. Speaker, I ask my colleagues to join me in thanking Hooty Adam  for his extraordinary dedication and in wishing him the very best in  his well-earned retirement.", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696876/recognizing-brian-hooty-adam"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "Mr. ROGERS of Alabama. Mr. Speaker, I rise today to recognize the  retirement of Gary Fuller, Mayor of the City of Opelika, Alabama.\n\nMayor Fuller has tirelessly served the City of Opelika for over 20  years. He served on the City Council from 2000…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696582/recognizing-the-retirement-of-mayor-gary-fuller"}, {"senator": "Randy Feenstra", "party": "Republican", "sentence": "…disease.                     congratulating dr. wendy wintersteen\n\nMr. FEENSTRA. Mr. Speaker, I rise today to congratulate my friend,  Dr. Wendy Wintersteen, on announcing her retirement as president of  Iowa State University.\n\nUnder her leadership, President Wintersteen prioritized students, led  the State in research, and advanced Iowa State's incredible…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691604/als-awareness-month"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…recognize an exceptional  individual from my district, Lieutenant William Moffett of the  Buckingham Township Police Department. Today, I proudly commend him on  his well-earned retirement, following decades of committed service to  the people of Bucks County.\n\nLieutenant Moffett's distinguished career in public service began in  1981, when he served as an…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694744/recognizing-buckingham-township-police-department-lieutenant-william-moffetts-35-years-of-service"}, {"senator": "Richard Hudson, Jr.", "party": "Republican", "sentence": "…service today.\n\nMr. Speaker, please join me today in honoring Chief Warrant Officer  Garrett Illerbrunn for his dedicated service to our great country. I  wish him the happiest retirement with his family.", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696037/congratulating-garrett-illerbrunns-career-in-the-us-armys-82nd-airborne-division"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…years, if nothing is done, beneficiaries will not receive their  full payments. It is time we begin to have that discussion.\n\nMr. Speaker, for individuals who are reaching retirement age, this  ensures they have the best information available to them as they make  decisions about when to start benefits.\n\nToday, we use terms like ``early eligibility age,''…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697234/claiming-age-clarity-act"}]