[{"senator": "John Larson", "party": "Democrat", "sentence": "…poverty.\n\nMr. Speaker, I know you know this. In Illinois' 12th Congressional  District, there are more than 179,000 Social Security recipients, and  more than 131,000 of them are retirees. Mr. Speaker, 21,000-plus are  disabled. There are 11,000-plus widows; 4,000-plus spouses; and 10,000- plus children who haven't seen an increase in more than 50 years. It…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690830/enhancing-social-security"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…``commonsense,'' all the time in this Chamber, but in this  instance, it seems particularly appropriate. It would right this  longstanding injustice and finally provide these military retirees  their full VA disability and Defense Department retirement benefits.\n\nThis cause is not only common sense, it is rightfully bipartisan. It  has received overwhelming support--those…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696112/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…their clients' best interests. H.R. 2988 would  restrict the fiduciary's ability to consider all relevant factors that  might affect investment decisions to the detriment of retirees.\n\nOf course, it has been pointed out that some ESG funds do better,  some do worse, just like all other categories of funds. The committee  chair's opening statement suggested…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699154/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…a sales tax on everyone in the  country, but it is a sales tax that, as all sales taxes do, fall  hardest on those who can least afford it.\n\nThe new sales tax is affecting retirees particularly. So from NBC  News:\n\nRetirees `stunned' as market turmoil over tariffs shrinks       their 401(k)s.\n\nWe have a Social Security system that is a good foundation…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690547/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…on Medicaid. They  rely on Medicare to stay in business to help families and so many  people in need.\n\nWe still have to talk about Social Security. Over 4 million Texans,  retirees, veterans, widows, and people with disabilities rely on Social  Security to keep the lights on, keep food on the table, and pay their  bills. It is not a luxury; it is a promise…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689782/defending-social-services-and-programs"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…aware, in the Speaker's district  alone, there are 189,000 Social Security recipients who haven't  received an increase in benefits in more than 50 years. There are  147,000 retirees, 20,000 disabled workers, 8,700 widows, 3,700 spouses,  and over 9,000 children who are depending upon Congress to fulfill its  responsibility and job.\n\nFurthermore, a fact…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688396/preeminent-antipoverty-program-for-elderly-and-children"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…My amendment would have been the text  of H.R. 1357, the Susan Muffley Act.\n\nMs. KAPTUR. H.R. 1357 is a bill that addresses a true injustice to  thousands  of workers and retirees across this country, a bill to restore the  Delphi salaried retirees' pensions.\n\nFor decades, the men and women who built Delphi--and they worked  hard--were told that if…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699158/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "Mr. DAVIS of Illinois. Mr. Speaker, the American Postal Workers Union  is a labor  union which represents 200,000 employees and retirees of the United  States Postal Service who belong to the clerk, maintenance, motor  vehicLe, and other services divisions. It was founded July 18, 1971 as  a former clerk in…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697484/congratulating-the-american-postal-workers-union-chicago-chapter-0001"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…administration knew these retirements were coming. It was part of  the DOGE plan, but once again, the administration was not prepared for  what came next. As a result, Federal retirees faced delayed annuity  payments, gaps in benefits, and real financial hardship.\n\nThese are families who are trying to pay mortgages, cover healthcare,  and plan their next…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699549/restoring-retirement-processing-for-federal-workers"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "…its meals because of funding cuts. I am fighting for the seniors across  my district that are watching their life savings evaporate in the stock  market. I am fighting for retirees taking required distributions from  the their IRAs at a loss because Trump's tariff policies that are  tanking the market.\n\nI am fighting for the parents who can't afford…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689682/protecting-the-middle-class"}, {"senator": "Greg Landsman", "party": "Democrat", "sentence": "…Congress.\n\nWe had to force a vote on the bill with a discharge petition, and  within 2 days, we got 218 signatures. We fought very hard to get this  done, and now, our public retirees will finally start to see the  benefits they were owed each month.\n\nWe could not have done this without the advocacy of thousands of  public servants and retirees. I hope…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688318/providing-fairness-in-social-security"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…Social Security. It says: ``The Social Security Administration website  crashed four times in 10 days this month because the servers were  overloaded, blocking millions of retirees and disabled Americans from  logging in to their online accounts. In the field, office managers have  resorted to answering phones in place of receptionists because so many…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689130/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…someone who cares about people and their health and well-being would do  or should do.\n\nIf I were his mother, I would scold him.\n\nOur office is receiving numerous inquiries from retirees, working  people who worked hard and are deeply concerned about the drop in value  of their 401(k) retirement plans that they worked for.\n\nThose just lost enormous value in…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690052/trump-tariffs"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…on and on and on. His mental  faculties are incredible, yea for that, but there is a need for medical  attention as people get older, and the UAW rightfully protects their  retirees. We are proud of what they are able to do for the retirees.\n\nHowever, the country pre-ACA, Affordable Care Act, ran into some  severe challenges. Ford had gotten its loan…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689752/reflecting-on-americas-history"}, {"senator": "Jahana Hayes", "party": "Democrat", "sentence": "…constituents, Republicans and  Democrats, and Americans across the country who talk about healthcare  and the looming crisis. Small business owners, independent contractors,  retirees, farmers, and constituents in my district continue to call my  office or stop me to share how they will be unable to afford healthcare  as they continue to experience rising…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698301/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Small  business owners' employees who rely on the individual market, this will  absolutely be devastating to many of them if they are forced to  shoulder this cost.\n\nEarly retirees who are not yet eligible for Medicare, millions of  them rely on these tax credits.\n\nThat is why I believe that doing nothing is not an option, and I have  made no secret…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697549/congratulating-eco-clean-solutions"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…entrepreneurship for all the people of Iran in a free-market  economy: restoration of the rights of blue-collar workers, farmers,  nurses, white-collar workers, teachers, and retirees.\n\nNine, protection and rehabilitation of the environment, which has  been absolutely massacred under the mullahs.\n\nFinally, 10 of her 10-point plan, a nonnuclear Iran that…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697723/free-iran"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…in the pockets of people who  need it most: people who rely on tips and overtime and people living on  Social Security. It lifts burdens off the backs of working parents,  retirees, and disabled veterans.\n\nThe truth is, Mr. Speaker, whatever name you choose, this bill will,  and is, launching the golden age of America because, as Shakespeare  reminded…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695114/launching-golden-age-of-america"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…passed both the  House and Senate.\n\nHowever, the Biden-Harris administration vetoed the resolution,  choosing to prioritize leftwing environmental and social issues ahead  of retirees' financial security.\n\nAs chairman of the HELP Subcommittee, I remain committed to  protecting the retirement savings of workers, retirees, and their  families. The Protecting…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699156/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…in part A, part A and part B.\n\nFifteen percent is sort of paid by the enrollee. Thirty-eight-some  percent is paid by the FICA tax, so today's workers paying for today's  retirees. The rest is borrowed out of the general fund.\n\nYou have to understand that a huge portion of our debt is actually  paying for the healthcare.\n\nSorry. My 3-year-old is trying…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699988/math-is-such-an-anathema"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…pay a lot more for health insurance. These are independent contractors,  freelancers, gig workers, and Uber drivers. It is small business owners  and their employees, and retirees who are not yet eligible for Medicare  who are going to pay thousands of dollars more in many cases. Some  people won't be able to afford health insurance at all.\n\nWhat are…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698374/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…In this role, Ms. Bearden will assist Labor Secretary Lori Chavez- DeRemer in executing President Donald Trump's mission of prioritizing  American workers, veterans, and retirees.\n\nShe will work to advance the ETA's mission of contributing to the  more efficient functioning of the U.S. labor market by providing high- quality job training, employment,…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690088/recognizing-deputy-assistant-secretary-lori-frazier-bearden"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…been a long debate regarding  some of these issues surrounding what I believe is the core issue. I  believe the core issue, Mr. Speaker, is that it is time for us to put  retirees first, not second, in investment decisions.\n\nThe gentleman was talking about it in ESG funds. I have no problem  with the existence of an ESG fund. If someone, for whatever…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699155/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…sound harmless, but in practice, it shifts the focus away  from what retirement investing is supposed to be about: maximizing  returns and minimizing risk for workers and retirees.\n\nAmericans set aside money in their 401(k)'s and pension plans to  retire with dignity. They do it so that they can pay their bills, cover  medical costs, and support their…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699160/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…against already having more deaths than  births.\n\nUnderstand the way we deliver and finance the earned entitlements,  the earned benefits. Today's worker pays for today's retirees. Last  week, I showed a number of charts that, those numbers in 10, 20 years,  it is you and your partner, you and your spouse and a little bit more,  you have your own retired…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689614/its-the-math"}, {"senator": "Ken Calvert", "party": "Republican", "sentence": "…sophistication and frequency of scams and fraud targeting our  veterans are constantly increasing. According to a report from the  Federal Trade Commission, U.S. veterans and military retirees reported  $350 million in total fraud losses in 2023.\n\nWhile a number of departments and staff work in an uncoordinated  manner to combat fraud within the VA and other agencies,…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699189/veterans-scam-and-fraud-evasion-act-of-2025"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…makes no sense. Social Security recipients have paid into this program  for decades. They deserve the full sum of their Social Security income.  However, nearly 66 percent of retirees are paying taxes on their Social  Security benefits because Bidenflation pushed seniors' benefits into  higher income brackets.\n\nTo address this, I have introduced the RETIREES…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690548/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "…commitment to  enhancing quality of life for its residents.\n\nFruitland Park's natural beauty, small-town charm, and strong civic  infrastructure make it a desirable location for retirees and families  alike. Its development in recent years has been extraordinary, and its  future continues to look bright with anticipated progress over the  coming decade.\n\nIt…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693999/recognizing-the-100th-anniversary-of-the-city-of-fruitland-park-florida"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…evaluation of--\n\n(1) the total impact of esophageal cancer-related health       care spending under the Federal Employee Health Benefits       Program for Federal employees and retirees diagnosed with       esophageal cancer; and\n\n(2) how often individuals covered under the Federal       Employees Health Benefits Program with medical records       indicating…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691831/gerald-e-connolly-esophageal-cancer-awareness-act-of-2025"}]