[{"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…COVID-19 pandemic, when  many other sites were forced to close. Thanks to his dedication, and  that of fellow volunteers, the program has completed over 17,900 tax  returns, returned more than $3.3 million to the community, and saved  taxpayers an estimated $300,000 in fees.\n\nMr. Phillips' selfless service and steadfast leadership have helped  ensure financial…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695269/recognizing-the-work-of-robert-phillips"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…World War II. These soldiers  were promised the opportunity to immigrate to the United States along  with their families. However, after sacrificing for our country, many  returned home from the War only to be denied the benefits promised for  their service. Though many of these veterans became proud U.S.  citizens, our immigrant visa backlog, exacerbated…", "date": "2025-05-23", "source_url": "https://justfacts.votesmart.org/public-statement/1691684/introduction-of-the-filipino-veterans-family-reunification-act-of-2025"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…she finally got her green card. She was so happy, and I  remember feeling relieved because she was safe and could live in this  country without fear.\n\nToday, that fear has returned. Donald Trump is blatantly pushing  aside the Constitution and the rule of law to deport anybody at will. I  am here because I am fighting for my mother and many like her…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690513/trump-immigration-policies"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…emotional and physical scars of those attacks persist today. We  have a duty to care for those who were affected by the devastation.  That includes the servicemembers who returned to work at the Pentagon  the next day and were exposed to asbestos and other toxins, causing  lifelong negative health effects.\n\nThat is why I am introducing the Susan E.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695328/remember"}, {"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…Byrd Camp, without a warrant and arrested three migrants who  were resting inside a trailer. Volunteers told agents they could not  enter without a warrant. Agents left, then returned claiming that they  were in hot pursuit, even though there was no chase, no threat, and no  legal justification that would allow entering a protected structure.\n\nThis camp…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697450/fighting-dhs-immigration-raids"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…reinstated officers fired for serious misconduct. In an 18-      month period, the District paid $5.6 million in back pay to       just ten officers who were fired and then returned to duty       through arbitration. The CPJRAA corrected this. These bills       would take us backward.\n\nThe CPJRAA also protects residents from dangerous and       deadly…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696988/opposition-letter-led-by-the-dc-justice-lab-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…Why do my Republican colleagues need to take up our valuable floor  time here debating a rule that their friends in the administration have  already rescinded? They just returned from a 53-day, taxpayer-funded  vacation, canceled 5 weeks of votes, and still have a long to-do list  before the end of the year. That list, I hope, includes figuring out…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696836/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…Nation's $35 trillion debt. So much for Republicans being the party of  fiscal responsibility.\n\nThey are also gutting the Consumer Financial Protection Bureau, an  agency that returned $21 billion to families cheated by megabanks. They  are cutting housing funds during an affordability crisis and weakening  oversight of Wall Street. Maybe they have forgotten…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693213/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…in Northern Virginia, the very region of the  Commonwealth that he will now represent in Congress. He graduated from  New York University with a degree in politics. He then returned home  and got involved in his local community. He managed our dear friend  Gerry Connolly's 2007 campaign for chairman of the Fairfax County Board  of Supervisors, and a year…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695220/welcoming-the-honorable-james-walkinshaw-to-the-house-of-representatives"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…example of Alison's longstanding commitment to helping support women  and families through policy.\n\nAfter working as a policy analyst for the Louisiana Budget Project,  Alison returned to the D.C. area and began working as a Legislative  Assistant for Congresswoman Elaine Luria (D-VA). In 2023, I was lucky  to have her join my Washington, D.C. Office as…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695684/recognizing-alison-cohen-and-her-service-to-the-us-house-of-representatives"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…so nonpartisan, something that we should all be able to agree  on--that a group of men who went and put their lives on the line for a  world, for a country, that, when they returned home, they were still  called the N-word.\n\nThey were still forced to sit in the back of the bus. They were still  told to take off their uniforms. They were still told that…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687900/black-history-month"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…ones, and  friends.\n\nCorey Lee Sidney was born in Pittsburgh, Pennsylvania, to Melanie  Sidney and Norman Gladden. After spending his early childhood in  Philadelphia, he returned to Pittsburgh around age eight, where he  lived until moving to Buffalo, New York, where he made his home for the  past decade.\n\nCorey was a devoted man of faith, a lifelong…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697070/recognizing-the-life-of-corey-lee-sidney"}, {"senator": "Mike Quigley", "party": "Democrat", "sentence": "…It has always been our  greatest strength.\n\nWithout the calculations of Katherine Johnson, a Black mathematician  at NASA, American astronauts may never have successfully returned from  space.\n\nWithout the code talkers, Native Americans who turned their  indigenous language into an unbreakable code, American soldiers may not  have been victorious in…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693640/the-story-of-brad-and-donald-lang-sr"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…over 58,280 conscripted U.S. troops died near the Chinese  border in an undeclared war by another gutless Congress. More than  60,000 more Vietnam veterans died when they returned home by their own  hand.\n\nMr. Speaker, they were and are America's patriots, drafted and sent  to that horrible war  by Democratic President Lyndon Johnson from the oil rich…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698837/reflecting-on-impact-of-illegal-action-in-venezuela"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…SNAP  program that provides safe nutrition to families that might otherwise  go hungry.\n\nWe also noticed that the DOGE effort of Elon Musk, who apparently  fortunately has returned most of his attention to his private  businesses, not only illegally cut millions of dollars from U.S.  Department of Agriculture activities but would deprive the Department…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692798/agricultural-risk-review-act-of-2025"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…diverse array of crops.\n\nJeff's story is one of dedication not only to the land but to the  family. After serving our Nation in the Air Force during the Vietnam  war, Jeff returned home to carry on the farm. He followed in the  footsteps of his father, who took over the farm at the age of 13. Now,  four generations later, Jeff farms alongside his sons,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695599/recognizing-jeff-wilson"}, {"senator": "John McGuire III", "party": "Republican", "sentence": "…Corps as an infantry platoon commander. He deployed for three combat  tours in Iraq and earned the Bronze Star and the Purple Heart.\n\nHe continued his life of service after he returned home. In 2010, he  became headmaster of Benedictine College Preparatory, and in 2020 he  was announced as president of Benedictine Schools of Richmond.\n\nThe Benedictine Schools…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689794/recognizing-jesse-grapes"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…Service Medal, the Sea Service Deployment Ribbon with one  Bronze Service Star, and the Presidential Unit Citation.\n\nFollowing his honorable discharge in 2023, Mr. Moceri returned to  Michigan and continues to serve his community as a Construction Project  Manager with Moceri Companies, supporting development projects across  Lake Orion, Auburn Hills,…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699292/recognizing-united-states-marine-corps-veteran-domenico-s-moceri"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…deploying  to Vietnam with the 377th Combat Defense Unit.\n\nHe was stationed at Tan Son Nhut during the Tet Offensive, one of the  most dangerous moments of that war. When he returned home, Dale was  stationed at Grand Forks Air Force Base in North Dakota.\n\nDale told me his most cherished memory of service was returning from  Vietnam to meet his newborn…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695704/recognizing-the-funky-buffalo-coffee-house-and-trading-company"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…of assignments, including time with Governor Rick  Snyder's Detail in 2011, Houghton Lake Post 72, West Branch Post 32,  and Tri-City Post 31. Eventually, Sergeant Bettis returned to West  Branch Post 32, where she served her final assignment.\n\nThroughout her career, Sgt. Bettis was often recognized for her  professionalism, excellence, kindness, and…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688435/recognizing-the-retirement-of-sergeant-christine-bettis"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…years of dedicated service.\n\nKendra began her career at Evangelical Community Hospital in the  early 1990s. Kendra left the hospital for a position at Capital Blue  Cross, but returned in 1999, and stayed there ever since. She was  appointed president and CEO of the hospital in 2015.\n\nThroughout her career, Kendra has worked to grow Evangelical  Community…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698973/congratulating-kendra-aucker"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…my home State who won their  respective collegiate championships this month. In the NCAA Division  III wrestling national championship, the Knights from Wartburg College  returned from Rhode Island as cochampions and with their 16th national  title--the most in Division III history. The women's basketball team at  Dordt University in Sioux Center returned…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689740/iowa"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…what happens is the building is sold to a syndicate of a variety  of wealthy people who get the tax benefits of depreciation for about 15  years, and then eventually it is returned to the original developer.\n\nSo there are many people making money here. Certainly the banks are  making money. Above all, the developers are making money. The lawyers  are…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690921/big-beautiful-bill"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…Sergeant with the 381st Battery. He worked  as a powder man and also served in supply operations, roles vital to  our mission's success in Europe.\n\nAfter the war, Mr. Holland returned to his home State of West  Virginia before settling in the Hollins area of Roanoke County in 1950  to be near family. He went on to enjoy a long and honorable career with…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696845/recognizing-50th-anniversary-of-opera-roanoke"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…safe.\n\nBilly's impact, Mr. Speaker, stretched far beyond the badge. He  played football for the Fernandina Beach Pirates and went on to play  for Newberry College. When he returned home, he constantly coached for  Babe Ruth baseball and Pop Warner football, and he poured his heart  into Pirate Athletics. He was the voice of the Pirates. At every  football…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691576/recognizing-alhambra-theater-dining"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…Derek was known for prioritizing  first-in-class constituent services, a focus he has maintained  throughout his career in the House.\n\nAfter a short time off the Hill, Derek returned to the House as the  Republican Staff Director of the Select Committee on the Modernization  of Congress. In this position, he saw an opportunity to strengthen  Congress's…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696851/thanking-derek-harley-for-his-service-to-the-house"}, {"senator": "David Rouzer", "party": "Republican", "sentence": "…numerous Indian agents sent by  the U.S. Government go to the homelands, study them, collect data, and  determine if they are, in fact, Indian. Each time the Indian agents  returned to the District of Columbia, they reported back that these  were indeed Indian people. They were Indian people who had survived  disease, warfare, and colonization.\n\nI know…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695245/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…drought that stretched back to 1984. With Montana  programs reaching the championship stage in four of the last five  seasons, it was only fitting that the trophy finally returned to the  home of the Treasure State.\n\nThe young men in blue and gold made Montana proud. Their victory  belongs not only to this university but to an entire State.\n\nMr. President,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698834/congratulating-montana-state-university-bobcats"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "Mrs. FISCHER. Mr. President, I recently returned from an official  trip to the Indo-Pacific, where I visited U.S. military installations  in Hawaii and Guam and met with leaders in Palau, the Philippines, and  Taiwan. That…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694962/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…marked insufficient funds, then under Virginia law,  you have created a presumption that the individual is attempting to  defraud the merchant. That entitles, when the check is returned, the  merchant to charge up to $50 for a returned check fee and to seek  criminal penalties. If the check is not made good then they can seek  criminal penalties which carry…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689405/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}]