[{"senator": "Bobby Scott", "party": "Democrat", "sentence": "…investment decisions and exercise shareholder rights.\n\nThe appropriate course of action is to permit fiduciaries to consider  ESG factors so long as they don't diminish investment returns. As we  know, such factors, whether it be sea level rise or poor corporate  governance, are relevant to a company's performance. Considering  whether a real estate investment…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699154/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…that complying with a  similar blacklist policy could cost them nearly $10 million. In  Arkansas, the State retirement system estimated comparable restrictions  could reduce returns by $30 million to $40 million a year. In Indiana,  an analysis found it could cost pension returns as much as $6.4 billion  over 10 years.\n\nThis legislation is not about protecting…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699153/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…legislation affirms a simple truth: Foreign assistance is not a  charity. It is a strategic investment. At just a small fraction of our  Federal budget, it delivers outsized returns for our national security,  our economy, and our global influence because we know that hunger,  poverty, ignorance, repression, and hopelessness create the conditions  where…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699057/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…management fees, expenses, and AFFE of the BDC itself.\n\nThis has the effect of double-counting BDC expenses, because BDC  costs are already factored into their share price and returns. By  adding them again as acquired fund fees, the SEC rule artificially  inflates the expense ratios of funds holding BDCs.\n\nThe result is misleading: investors see a fund's…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697831/increasing-investor-opportunities-act"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…Safety and Wellness  Through Data Act isn't just about gathering data and reporting  statistics. It is about lives, and it is about public safety. It is  about the officer who returns home safely to their family at night. It  is about the rookie who gets lifesaving training, or the veteran who  receives mental health care instead of suffering in silence.…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691321/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…deal to exploit Ukraine's natural resources. Much remains  to be seen about the shape of this agreement, but we do know it will  take years, if not decades, to see substantial returns.\n\nA large number of Ukraine's rare earth deposits are actually located  in Ukrainian territory that is currently contested or occupied by  Russia. I am not sure how one is…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688332/ukraine"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…hope to see the chairman of the Committee on Veterans' Affairs move  bills other than the ones sponsored by his members expected to be in  tight reelection races. I hope he returns to the traditional practice  of the Committee on Veterans' Affairs moving both Republican and  Democratic bills in great numbers. I see the smile across his nice  countenance,…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699487/veterans-readiness-and-employment-improvement-act-of-2025"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…tax software  companies. D.C. would have to suspend the current tax filing season for  several months to update tax forms and guidance, and taxpayers who have  already filed returns would have to file amended returns.\n\nThe D.C. law is not unique. Like D.C., approximately half of the  States, both red and blue, automatically adopt Federal tax changes in…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699680/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…means that if we are going to have a  growing and innovative economy, then we have to have a healthy venture  capital sector.\n\nHistorically, venture capital earns investor returns and frees up  more capital to recycle in other companies by selling their mature  portfolio companies to strategic investors or taking them public on  public markets.\n\nFor…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697192/developing-and-empowering-our-aspiring-leaders-act-of-2025"}, {"senator": "Sara Jacobs", "party": "Democrat", "sentence": "…applicants  after the collapse of the Afghan Government.\n\nCompared to the rest of the defense budget, OHDACA's budget is  modest, but its impact is huge. It yields massive returns in lives  saved, crises stabilized, and partnerships strengthened.\n\nMr. Chair, I urge my colleagues to reject this amendment.\n\nMs. JACOBS. Mr. Chairman, these AUMFs were literally…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695241/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Richard Neal", "party": "Democrat", "sentence": "…and  Tony Dunne of NEPM/WGBY have been with the show since its transition in  2006, as has Director Eric Jones, who began working on the program as a  freshman at WSU and now returns each year despite his national-level  career. Host Beth Ward, an award-winning journalist, has brought her  talent and warmth to the program since 2009. Production Manager…", "date": "2026-01-23", "source_url": "https://justfacts.votesmart.org/public-statement/1699382/recognizing-the-65th-anniversary-season-of-as-schools-match-wits"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…the efforts to  cure diseases, to find solutions to conditions from obesity, to  Alzheimer's, to cancers. One of the best taxpayer dollars we can invest  is in NIH because it returns more than 5 taxpayer dollars back in the  breakthroughs that they make.\n\nWe have put the future of scientific research in the United States at  grave threat with what the…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…Northwest Ohio, and especially our vibrant  Greek Orthodox community, I am proud to extend our heartfelt welcome to  His All-Holiness Ecumenical Patriarch Bartholomew as he returns to  Washington. We rejoice in his recognition with the Templeton Prize, and  we pray that his ministry of peace, love, and reconciliation will  continue to inspire our Nation…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695409/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew-archbishop-of-constantinople-new-rome-and-ecumenical-patriarch"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…the party and has investments in Russia, is trying to bring them closer  to Russia and Putin.\n\nLastly, the bill envisions a stronger U.S.-Georgia relationship once  Georgia returns to its traditional Euro-Atlantic path mandated in its  own constitution and demanded by its people.\n\nMadam Speaker, I thank Congressman   Joe Wilson and the other co- leads…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690701/mobilizing-and-enhancing-georgias-options-for-building-accountability-resilience-and-independence-act"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…Internal Revenue Service (IRS)       Statement announcing that it would be altering the timing of       certain compliance checks it conducted on individual income       tax returns. IRS's previous policy was to assess compliance       with certain statutory requirements after the tax return had       been filed, IRS had processed the return, and the…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699835/government-accountability-office-opinion-letter"}, {"senator": "Cory Mills", "party": "Republican", "sentence": "…training hike and sees that flag  flying over their garrison, it symbolizes home, and I promise you that  last mile may feel like a sprint to get to that cloth.\n\nWhen a platoon returns from a patrol and reenters the wire, she  symbolizes safety.\n\nImagine what our enemies would think of our strength and resiliency  if we ever allow flags flown contrary to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695264/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…financial literacy, teamwork, and long-term investing.\n\nCompeting against students from every congressional district, the  Rock L. Butler team stood out not only for their strong returns but for  their discipline, collaboration, and commitment to learning. Their  performance reflects the dedication of their teachers and the support  of the Wellsboro community.…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692754/recognizing-rock-l-butler-middle-school"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…through  competition and innovation, while strengthening our national security,  protecting taxpayers' dollars, and ensuring NASA remains focused on  results.\n\nThis legislation returns the FBI to its core mission and ensures that  our dedicated FBI agents are back in the field and out of the beltway.  There is no better place to achieve this than the FBI…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698748/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…an application  is pending, the EPA can determine whether or not to veto. It is simple.\n\nIt does not alter the process, nor does it deprive the EPA of its  right to veto. It returns our process to one based on science and facts  rather than politics.\n\nMr. Chair, I thank Congressman Collins for his efforts on this  package of reforms, and I look forward…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698030/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…system, as they provide services at the front       lines of the bankruptcy process, administering thousands of       cases.\n\n(5) Chapter 7 bankruptcy trustees provide valuable returns       of assets to government creditors, including the Internal       Revenue Service, the Department of Agriculture, the Small       Business Administration, and other Federal,…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698845/bankruptcy-administration-improvement-act-of-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…response rate to the surveys  that is down dramatically. Sometimes you get big revisions, and then  the next month you get a little more data, and the next month you get  more returns, and you can finally calculate.\n\nIn the JOLTS data, there is a fascinating number to look at. The  number of jobs was fairly flat, but unemployment looks like, our best  model,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694915/facts-and-math"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…Madam Speaker, this week, President Trump  will join Senator Dave McCormick in Pittsburgh for the inaugural  Pennsylvania Energy and Innovation Summit.\n\nAs President Trump returns our Nation to energy dominance and forges  ahead in the race to dominate artificial intelligence, Pennsylvania  stands ready to meet the energy needs that AI creates. This…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693458/golden-age-of-america-has-arrived"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…accountability, and  rebuilding an America where people aren't just getting by. They are  getting ahead.\n\nThis bill puts working families first. It reins in bureaucracy. It  returns power to the people where it belongs.\n\nMost importantly, this bill is just the beginning.\n\nWhat an exciting time. I couldn't be happier to be here working with  these great…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691959/supporting-the-big-beautiful-bill"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…energy costs for Americans. Commonsense reforms like these are simple  and long overdue.\n\nWe are also here to move an appropriations package that provides  critical funding and returns us to more responsible spending levels  while delivering for the American people.\n\nOne thing we have noted is that there is fraud in government  programs, including in Medicaid…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698637/providing-for-consideration-of-hr-saving-homeowners-from-overregulation-with-exceptional-rinsing-act-providing-for-consideration-of-hr-affordable-housing-over-mandating-efficiency-standards-act-and-providing-for-consideration-of-hr-commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…when making investment decisions.  That might sound harmless, but in practice, it shifts the focus away  from what retirement investing is supposed to be about: maximizing  returns and minimizing risk for workers and retirees.\n\nAmericans set aside money in their 401(k)'s and pension plans to  retire with dignity. They do it so that they can pay their…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699160/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…her purse,  which is good for her pocketbook.\n\nLet's have faith in her to make the wise decision for her family as  opposed to having to go to the insurance company, which returns roughly  80 percent of it back but takes 20 percent for profit and overhead.  Give power to the patient.\n\nNow, you can do this because under ObamaCare, you can take a credit…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697554/healthcare"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…meaning that D.C. taxpayers who do not  itemize their tax deductions will not be able to claim the full amount  of the federally expanded standard deduction in their local tax  returns. In addition, individuals who take the standard deduction will  not be afforded an additional charitable deduction like they will have  in the Federal Tax Code.\n\nStripping…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699678/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…information they provided to  the BLM in this process was ignored by the Federal agency.\n\nOverturning the RMP amendment takes power from bureaucrats in  Washington, D.C., and returns it to the people of Wyoming.\n\nThe BLM also ignored Tribal input in developing this RMP amendment.  The Navajo Transitional Energy Company, which is wholly owned by the  Navajo…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696879/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…regarding the environment or  social issues are somehow material.\n\nMr. Speaker, it simply isn't true. We have to put the investor--that  retiree, that person who is desperate for returns so that they can  retire--first, not second, behind social issues that bureaucrats have  decided is the primary goal.\n\nThis amendment requires the Government Accountability…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699155/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…population.\n\nExpanding the City's water supply will support the growing number of  businesses and families that call The Dalles home. This legislation is  straightforward, timely, returns power to local government, and saves  taxpayer money. I thank Representative Bentz for sponsoring this  critical measure.\n\nMr. Speaker, I urge my colleagues to support H.R.…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697754/dalles-watershed-development-act"}]