[{"senator": "Ed Markey", "party": "Democrat", "sentence": "…Taiwan. It is just a  small business.\n\nAnd, meanwhile, big businesses have CEOs meeting directly with the  President and receiving generous exemptions.\n\nIt is Robin Hood in reverse. Trump is taking from hard-working,  regular people, and he is transferring the wealth to the millionaires  and billionaires in our country. It is absolutely economic craziness…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696444/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…some people here still working on the floor remember that dramatic  moment.\n\nBut now, with the passage of this budget reconciliation act in July,  Republicans are trying to reverse the progress of the Affordable Care  Act. Congratulations, you are having an effect. You are taking that act  and healthcare out of the system. You may be trying to do it…", "date": "2025-10-01", "source_url": "https://justfacts.votesmart.org/public-statement/1695964/en-bloc-nominations"}, {"senator": "Katherine Clark", "party": "Democrat", "sentence": "…over the  greed of billionaires and start bringing the Republican healthcare  crisis to an end.\n\nThis vote won't solve every problem the GOP has created. We still  have to reverse their cuts to Medicaid and Medicare. We still have to  stop the closure of rural hospitals and deal with the maternity health  crisis and work together--yes, work together--to…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698792/breaking-the-gridlock-act"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…Mr. Speaker, is support partisan spending  legislation put forth by Republicans that continues to gut the  healthcare of the American people.\n\nEnough is enough. We need to reverse the damage that has been done,  not do more.\n\nThe big, ugly bill steals food from the mouths of hungry children,  seniors, and veterans. Why? Once again, it is to pay for…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695292/9999"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…vaccines through their ideological, pseudoscience agenda.\n\nMr. Speaker, one day, I hope that my Republican colleagues will join  us in calling on the Trump administration to reverse these terrible  policies that are only harming the public health.", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697277/mikaela-naylon-give-kids-a-chance-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Republican  leadership on our committee and in the House should say: What you are  proposing, what you are doing, President Trump, is not acceptable  because it is going to reverse this. It is going to reverse the trend  where opioid use and overdose goes down. It is going to reverse it if  we don't have these programs. That is why they are successful.…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691876/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…dismissal of [a] complaint,'' and       thereby affected the rights and duties of recipients,       complainants, and the affected population.\n\nCourts have also considered the reverse situation--namely       when an agency revokes procedures providing non-agency       parties with notice and an opportunity to submit information       in an agency proceeding--and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694840/government-accountability-office-legal-opinion"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…the people who need it the most. Right now it looks like we  are taking from the most vulnerable to give to the most wealthy, like  Elon Musk and his allies. We have got to reverse that process.\n\nI want to commend the gentlewoman for pulling this together, my  colleagues with the Congressional Black Caucus, my colleagues in the  Democratic Caucus, and,…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691087/big-backstabbing-bill"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…followed this rule--it's likely  that BDCs would have been carved out of the AFFE framework from the  start similar to REITs and banks. That is why Congress must act now to  reverse this unintended consequence.\n\nSection 302, the Access to Small Business Investor Capital Act fixes  this by allowing funds to omit a BDC's ``acquired fund fees and  expenses''…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697831/increasing-investor-opportunities-act"}, {"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…tailings dams and ponds in the world.\n\nDoes that sound like an industry ready to responsibly regulate  itself?\n\nThrough the Save Oak Flat from Foreign Mining Act, I seek to reverse  the giveaway of publicly owned land and the natural resources beneath  it to this foreign mining conglomerate. It is clear that we have to  reaffirm that decisions about…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699693/critical-mineral-dominance-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…bipartisan way  to pass legislation to end Donald Trump's bogus emergency declaration  in Brazil, under the leadership of Senator Kaine. Today, we can take  the next step to reverse Trump's trade war on one of America's most  important allies, under the leadership of Senator Klobuchar. I urge--I  urge--my Republican colleagues to join Democrats once again…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696451/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…concurrently.\n\nChanges to software of tax processing vendors. Vendors will       need to reconfigure software to allow taxpayers to properly       file. If the District must reverse the changes pursuant to       implementing the Act, it could be at risk of losing vendors       who normally participate in DC tax filing, as the current       products that…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699680/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…when it really matters, beholden to their MAGA isolationist base.\n\nThis partnership is too important to be sacrificed by Trump's ego and  Republican complicity. Trump must reverse course, make a deal, and fix  the damage that he has caused. He needs to get his act together on  behalf of this country and our relationship with India.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695025/trump-must-reverse-course"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…other country occupies the  dominant positions in not only these organizations but the UN  Secretariat itself. By then, Donald Trump will be gone, but it will be  too late to reverse course, and future generations of Americans will  pay the price.", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699129/us-withdrawal-from-united-nations-organizations-and-programs"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…and nearly all credit unions are exempt from the  rule. We are only debating whether the biggest banks in America should  be able to raise these fees.\n\nRepublicans will try reverse psychology to convince Americans that it  is in their best interests to fork over even more money to the big  banks.\n\nMr. Speaker, let me help Republicans out. Making Americans…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689845/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…Cuts and Jobs  Act signed into law by President Trump in 2017, which fueled historic  economic growth and raised real wages. This resolution also provides  instructions to reverse Biden's assault on domestic energy, rein in  reckless spending, and deliver critical resources to the Trump  administration so we can secure our border and strengthen our…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688042/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…ground by this  misguided resource management plan that the previous administration put  in place. It is an honor to be here today to be able to use the CRA to,  hopefully, reverse that plan and prevent other administrations in the  future, from either party, from putting such ridiculous management  plans in place.\n\nMr. Speaker, this idea that Alaska…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694898/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…all of these student-athletes of the  opportunity to play their sport as well as subjecting them to onerous  new travel arrangements.\n\nI am urging the State of California to reverse this outrageous  action.", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698014/state-of-california-decision-affects-student-athletes"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…Speaker, I rise in support of this rule and in support of the  underlying legislation.\n\nThe rule before us presents an important opportunity for Congress to  continue its work to reverse the last-minute attempts at regulatory  overreach by the former Biden-Harris administration.\n\nThe rule includes consideration of S.J. 13, to provide for  congressional disapproval…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691514/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…Today, we have been taken by the idea that our social status is not  what we build or create but what we can afford to buy or consume. It is  going to take generations to reverse this thinking. The post-war order  has given birth to a shallow morality of materialism that measures  values strictly in terms of consumption. This is a poisonous new idea,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690533/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…security. However, for decades,  America's policies have shipped good-paying manufacturing jobs overseas  and opened the door for foreign adversaries to fill the void. We must  reverse this trend which would require more than just luck.\n\nThat is why the Trump administration has been championing progrowth  and pro-American policies that are fueling a domestic…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697220/made-in-america-manufacturing-finance-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "Mr. KILEY of California. Madam Speaker, today, I am presenting a  resolution I have sponsored under the Congressional Review Act to  reverse California's ban on gas-powered vehicles, to stop a single  individual, Gavin Newsom, from dictating what tens of millions of  Californians and other Americans are allowed…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690484/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "Mr. STAUBER. Mr. Speaker, I rise today in strong support of H.J. Res.  140, to reverse Public Land Order 7917, which enacted the Biden  administration's dangerous mining ban in northern Minnesota.\n\nThe district I am proud to represent, Minnesota's Eighth  Congressional…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699271/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…resources, it is important the BLM       continues to provide access to prospects with the highest       potential. That is why this SJR 80 and HJR 124 are so       critical to reverse the overreach of BLM's 2022 NPR-A IAP       record of decision.\n\nRDC is concerned with the alarming trend from the last       administration of ``locking up'' oil-rich lands…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…As California strangles production, we must  increasingly rely on foreign imports from our enemies.\n\nH.R. 3109 requires the National Petroleum Council to report on ways  to reverse such foolish and self-destructive policies. What has  happened to California is the predictable result of bad policy made by  fools.\n\nI hope the REFINER Act will shine a light…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697033/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…weakened. Foreign  governments gained leverage over materials our economy and national  defense rely on every single day. That is the damage this Congress is  now working to reverse.\n\nEnergy security has been a core national security concern before.  After the oil crises of the 1970s, Americans learned the hard way what  happens when adversaries control…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699905/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…because you don't like the recipients, not because you don't want to  help people, but because you don't want to destroy our country.\n\nFor just six pennies on the dollar, we can reverse this dismal  trajectory. In just 5 years, we can restore trust in the U.S. dollar,  the U.S. economy, and steer the U.S. Government away from this fiscal  cliff. History will…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695544/setting-forth-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2026-and-setting-forth-the-appropriate-budgetary-levels"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…are ``a model for the Nation.''\n\nI will go through the 10 areas, the 10 radical failed policies of  Governor Newsom, which have prevailed in California that we set out to  reverse, to fight to overturn or to, at least where we can, mitigate  the harm.\n\nI will give a progress report on where we are with respect to each of  those 10 items.\n\nVery quickly,…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…contracts from  foreign entities of concern.\n\nI applaud  Michael Baumgartner, a new freshman out of Washington, for  his work on this important bill.\n\nWe are also seeking to reverse harmful Biden-era energy regulations  on essential home appliances, including refrigerators and freezers.  Americans deserve the ability to purchase the appliances that best…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689152/advancing-america-first-policies"}, {"senator": "Richard McCormick", "party": "Republican", "sentence": "…after they actually did it.\n\nThanks to the efforts of myself, Congressman Clyde, and our amazing  local officials, State legislators, and county commissioners, we were  able to reverse most of these closures and keep almost all of our parks  open under the control of our local governments.\n\nCongressman Clyde and I also introduced the Lanier Parks Local Access…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694870/energy-and-water-development-and-related-agencies-appropriations-act-2026"}]