[{"senator": "Gary Peters", "party": "Democrat", "sentence": "…tax code.\n\nThis was the first legitimate effort to reduce the deficit since the  Budget Control Act passed 11 years earlier. But, unfortunately, my  Republican colleagues reversed course again by passing the ``Big  Beautiful Mess'' earlier this summer.\n\nNot only did this bill that was passed here this past summer kick  millions of people off their healthcare…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695675/cloture-motion"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…Republicans.\n\nWe saw the reach of his power today as Republicans unanimously voted  for water projects for poor people in Colorado and for a Native  American Tribe in Florida, reversed themselves and sustained his veto.  They voted for these two measures before. That is how immense his  influence is. The question is: Will he get seven Republicans to do…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698663/protecting-healthcare-for-millions-of-americans"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…social  media markets. None of this helps consumers. None of this helps small  businesses. None of this lowers prices or spurs innovation. Until these  illegal firings are reversed, I cannot support Mr. Meador's nomination  to the FTC.", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1689985/confirmation-of-mark-meador"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…simply too unique and important to sacrifice,  and together they kept these lands closed to industrial development.\n\nIn fact, it was not until 2017 that a Republican majority reversed  that longstanding commitment and opened this refuge to exploitation.  They turned their backs on the American people who own this refuge and  embraced the development-anywhere-and-at-any-cost…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697413/9999"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…been ICE raids. The other workers are afraid to come to work.\n\nThey are begging the President to do something. The President then  said we would stop doing that. Then they reversed it when Stephen  Miller got involved. I think now the agriculture interests are getting  involved. They should get the policy together.\n\nIt speaks to an underlying problem…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693146/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…Harvest do yeoman's  work to provide food for families and kids in need at the best value.  If fresh food is no longer available, our community will suffer.\n\nThese cuts must be reversed and quickly. Time is of the essence when  it comes to our children having enough to eat.", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689059/feeding-our-children"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…colleagues, I would hope--if they reflected on it  outside the pressure of having their arms twisted--would engage in.\n\nAnd I know they would be highly critical if the parties were  reversed.\n\nIn addition, once that waiver is struck down, it is suggested under  the rules of the CRA that a similar waiver might not be able to be  granted in the future.\n\nSo now you…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691625/congressional-review-act"}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "…and bosses took advantage of everyday people.  The powerful thought they could decide for the rest of us.\n\nBut we made progress. We took steps forward. So much of it was  reversed with one swoop of Citizens United. Now we are awash in money  and influence, living through politics where the new bosses hide behind  a Supreme Court decision that allows…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699106/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Robin Kelly", "party": "Democrat", "sentence": "…weapons ban.\n\nWe know the solution is to end gun violence, and yet the Trump  administration and this legislative body refuses to act. Instead,  President Trump and Republicans reversed the progress we have made  these past few years.\n\nOn day one in the Oval Office, President Trump shut the doors of the  White House Office of Gun Violence Prevention. Since…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691753/national-gun-violence-awareness-month"}, {"senator": "Cleo Fields", "party": "Democrat", "sentence": "…wrote letters and he restored the program that gave  young scholars scholarships to go to college, 1890 universities. He  said that it was a DEI program, and then later he reversed it. It was a  program where these kids had to score high scores on the ACT in order  to qualify. They had to have high GPAs.\n\nNot to mention the impact it has had on businesses.…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690322/ending-of-dei-programs-through-executive-order"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…and sources of  drinking water. The Clean Water Act, in many cases, has been the sole  reason why decades of pollution threatening the health of our  communities has been reversed and why countless bodies of water  throughout the country are now being preserved for future generations.  The PERMIT Act will reverse progress and give polluters the ability…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698148/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Jared Moskowitz", "party": "Democrat", "sentence": "…debt, and that is in the best case, the most rosy  scenario. Then he said: That is a lie.\n\nThis clock that we have that has the debt, it is still going up. DOGE  has not yet reversed it. I say that as a member of the DOGE Caucus who  wants to shrink the size of government and cut spending. This 36,  instead of your budget making it a 35, it is going to…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688029/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…fact, I  supported him the first time he was nominated. He was not pushed  through the Senate, not the usual path for somebody to be nominated,  and then their nomination reversed, but then supported again by the  President. But I do believe Mr. Isaacman is capable of successfully  navigating the challenges facing the Agency.\n\nI want to take a minute…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698254/nominations"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…young men--who are alive  today because of the bill that we passed.\n\nBut this progress is in threat of being interrupted, and the reason  is that the Trump administration has reversed course. I want to talk  specifically about how they are undoing the progress of this bill, but  their attempt to try to reverse the broader progress that we have made  on…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690948/gun-violence"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…searches, and violence--violence--in their  communities.\n\nDemocrats have been clear. We need legislation to truly halt ICE's  abuses. Otherwise, what Tom Homan says today could be reversed by  Donald Trump, on a whim, tomorrow. Without legislation, Donald Trump  could choose to put a rogue force in any city he wants and have them  operate without guardrails…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700064/9999"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…which would unlock millions of acres of  land from restrictive, de facto wilderness management and return it to  multiple use.\n\nUnfortunately, the previous administration reversed this decision  against the wishes of Alaskans and finalized a new RMP that enshrined  Public Land Order 5150.\n\nOn his first day in office in 2025, President Trump issued Executive…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694898/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…to make all 1.56 million acres of the Coastal Plain available to  oil and gas leasing.\n\nLamentably, in 2024, the Biden administration disregarded local  Tribal voices and reversed course, implementing a new Record of  Decision that chose the most restrictive alternative, making available  the minimal amount of acreage for energy leasing.\n\nThe Biden…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696830/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…Americans--of having access to healthcare, reducing  the quality of outcomes over the years. That was a policy of the  Democrats, and there are many others that need to be reversed.\n\nMr. ARRINGTON. Mr. Speaker, the inflation tax that my colleague put  on her constituents with unbridled spending and failed economic  policies actually took $1,100 out of…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689910/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…changed the math  in our country. When I was a kid in the 1970s, for every dollar that  was spent on people 65 and up, there was $7 spent on young people.  Today, that is reversed. Today, we spend $1 on young people and $7 on  those over 65. It is the deal. It is part of our societal commitment.\n\nFine. Keep our promises. The way you keep your promises…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691811/actual-solutions"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…conditions of the  program, to give it a sound opportunity to succeed, and DOI followed  its statutory directive.\n\nHowever, following the election of President Biden, DOI reversed  direction in 2021. On June 1, 2021, DOI issued a Secretarial Order  temporarily halting all activities in the Coastal Plain Oil and Gas  Leasing Program. In August 2023,…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697739/9999"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…Medicare. This is about rooting out waste,  fraud, and abuse and very firmly putting America first, which they are  not doing.\n\nIf we don't codify these cuts, they will be reversed quietly over  time with no vote from this Chamber.\n\nThis rescissions package is the lockbox. It makes the DOGE cuts  permanent. It ensures the victories that we don't want…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692389/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…the main reasons that 77 million Americans elected him as  President--promises made, promises kept.\n\nIt is hard to believe that, in just 6 short months, President Trump  has reversed 4 years of disastrous open-border failures from the  previous administration. For 4 years, President Biden and Vice  President Harris told the country over and over again…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694111/americas-borders-are-safer"}, {"senator": "Steve Daines", "party": "Republican", "sentence": "…Governor was rebuffed.\n\nThis lack of respect for Montana's local and statewide elected  officials cannot be ignored and will not be ignored, and it is going to  get changed and reversed today with the passage of this CRA.\n\nLet's be clear as to what this resource management plan amendment is  and what we are doing today with this Congressional Review Act.…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696095/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…rewarded  emissions improvements and reduced unnecessary regulatory burdens on  American manufacturers and energy producers.\n\nTo no one's surprise, the Biden administration reversed course by  reimposing the outdated and rigid ``once in, always in'' policy. This  framework permanently locks facilities into strict major-source status,  even if they make…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691514/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…in 2015 I worked with both the wind and solar industries to phase out  their credits over a period of years. Unfortunately, the Democrats so- called Inflation Reduction Act reversed course and supercharged these  credits once more.\n\nAs part of the One Big Beautiful Bill, much like I did in 2015, I  worked with my colleagues to provide wind and solar an…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694089/one-big-beautiful-bill-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…now, President Trump will sign my resolution into law and  Gavin Newsom's unworkable gas car ban, where he wanted to dictate what  millions of Californians drive, will be reversed and Californians will  be able to drive the car of their choice.\n\nNot only that, we are reversing Newsom's EV mandate when it comes to  trucks, and we have already seen the…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Troy Balderson", "party": "Republican", "sentence": "…``once in, always in'' policy hurts America's  manufacturing and energy sectors while doing nothing to actually  improve air pollution.\n\nIn 2020, the Trump administration first reversed this policy, which  encouraged businesses to lower their emissions and reduce pollution.\n\nMy home State of Ohio ranks third in the Nation with almost 700,000  manufacturing…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691594/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act"}, {"senator": "David Rouzer", "party": "Republican", "sentence": "…afforded to other federally recognized  Tribes.\n\nBeginning in 1978, the Federal Government began rectifying the damage  done during this era. Since then, Congress has stepped in, reversed its  previous actions, and recognized 23 Tribes through legislation  reestablishing their relationship with the Federal Government.\n\nLegislation to rectify this for the Lumbee…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695245/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…Mr. Speaker, on  December 8, mere weeks before the transition to the Trump  administration.\n\nLast Congress I was proud to introduce the Alaska's Right to Produce  Act which reversed many of these same anti-American energy policies of  the Biden administration and passed the House with bipartisan support.\n\nAlaska is blessed with a tremendous wealth of…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696829/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…twice, Mr. Speaker--as part of their partisan  spending bills. The reason they did so was to shower the rich with  Green New Deal subsidies, which they made permanent. We reversed those  in the big, beautiful bill.\n\nMr. Speaker, here is a word you won't hear from Democrats: ``fraud.''  They forced taxpayers to pay up to $27 billion for as many as 6.4…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698800/breaking-the-gridlock-act"}]