[{"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…when it really matters, beholden to their MAGA isolationist base.\n\nThis partnership is too important to be sacrificed by Trump's ego and  Republican complicity. Trump must reverse course, make a deal, and fix  the damage that he has caused. He needs to get his act together on  behalf of this country and our relationship with India.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695025/trump-must-reverse-course"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…followed this rule--it's likely  that BDCs would have been carved out of the AFFE framework from the  start similar to REITs and banks. That is why Congress must act now to  reverse this unintended consequence.\n\nSection 302, the Access to Small Business Investor Capital Act fixes  this by allowing funds to omit a BDC's ``acquired fund fees and  expenses''…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697831/increasing-investor-opportunities-act"}, {"senator": "André Carson", "party": "Democrat", "sentence": "…This is not  theory. It is science.\n\nInvesting in greener, healthier neighborhoods benefits Hoosiers and  Americans. These cuts undermine that very goal.\n\nI urge the USDA to reverse its course, and I call on our colleagues  to join us in demanding the restoration of these critical investments  in our communities.", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689809/cuts-to-forest-service-endanger-millions"}, {"senator": "Mike Levin", "party": "Democrat", "sentence": "…would rescind the tax hike on low-cost, clean energy,  and it would restore tax credits for clean energy such as those in the  Inflation Reduction Act.\n\nNumber two: It would reverse roadblocks to clean energy permitting  and restrict the abuse of Department of Energy emergency orders.\n\nNumber three: It would ensure that data centers pay their fair share.…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700230/winners-of-the-global-energy-race-are-being-decided"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "…list. We can't afford  the largest cuts to Medicaid and to the Affordable Care Act in this  Nation's history.\n\nLet's be clear about what is happening. We are living through a  reverse Robin Hood story in America.\n\nIt hasn't always been this way. Because of the work of President  Obama, President Biden, and Democrats in Congress, the Black uninsured  rate…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696766/stories-from-home-the-human-cost-of-expiring-healthcare-tax-credits"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…now.\n\nBalint).\n\nMs. SCHRIER. Mr. Speaker, I thank Representative Balint for that  clarity. I appreciate drawing that distinction that Speaker Emerita  Pelosi referred to as reverse Robin Hood. That is exactly what is going  on here.\n\nWho are you standing up for? We saw with the Republican 2017 tax cut  that the vast majority of that benefit went to the…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691419/gop-tax-scam-hurts-everyone"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…did to help the poor, the sick, and the starving has  stopped.\n\nI am sickened by what this administration has done to USAID and to  the world. I will do everything I can to reverse this awful decision.\n\nMr. Speaker, I thank Dr. Foster for convening us together and for his  leadership.", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699033/expiration-of-new-start"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…wide range of cases and is almost certainly       unconstitutional under the requirements set out by the       Supreme Court in United States v. Salerno. This bill would       reverse more than 30 years of successful, data-driven       pretrial policy reforms in D.C. and replace it with a wealth       based system that fuels mass incarceration, racial…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696949/opposition-letter-led-by-the-american-civil-liberties-union-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…dismissal of [a] complaint,'' and       thereby affected the rights and duties of recipients,       complainants, and the affected population.\n\nCourts have also considered the reverse situation--namely       when an agency revokes procedures providing non-agency       parties with notice and an opportunity to submit information       in an agency proceeding--and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694840/government-accountability-office-legal-opinion"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…I think it is unlikely that they would have adopted this  rule, which contradicts the rule that they have for investments in  banks and rates. That is why Congress needs to reverse this.\n\nThe Access to Small Business Investor Capital Act fixes this by  allowing BDCs' acquired fund fees and expenses from disclosures, while  maintaining transparency around…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692711/access-to-small-business-investor-capital-act"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…the people who need it the most. Right now it looks like we  are taking from the most vulnerable to give to the most wealthy, like  Elon Musk and his allies. We have got to reverse that process.\n\nI want to commend the gentlewoman for pulling this together, my  colleagues with the Congressional Black Caucus, my colleagues in the  Democratic Caucus, and,…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691087/big-backstabbing-bill"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…that impact       our families, friends, and neighbors in every comer of our       nation. Please ensure that any changes to SAMHSA programs do       not disrupt, delay, or reverse our nation's great progress       and commitment to addressing our mental health, suicide, and       substance use crises.            Sincerely,\n\nAmerican Association for…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692341/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…justice, towards fairness,  and towards a more perfect Union.\n\nAnd yet from the moment he inflicted himself on our public life,  Donald Trump has done everything possible to reverse that progress. By  design, it appears, by virtue of the product of some defect of  character perhaps, but in every way he can and every moment he can, he  has sought to divide…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700183/state-of-the-union-address"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…and nearly all credit unions are exempt from the  rule. We are only debating whether the biggest banks in America should  be able to raise these fees.\n\nRepublicans will try reverse psychology to convince Americans that it  is in their best interests to fork over even more money to the big  banks.\n\nMr. Speaker, let me help Republicans out. Making Americans…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689845/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…tools we have to lower energy prices and hold Big Oil and Gas  accountable.\n\nThe Republicans, once again, in obeisance to the oil and gas  industry, are pushing a resolution to reverse the methane emissions  charge, which Democrats passed in the Inflation Reduction Act.\n\nIt makes big oil companies pay when they leak excessive and harmful  levels of methane.…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688145/methane"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…Cuts and Jobs  Act signed into law by President Trump in 2017, which fueled historic  economic growth and raised real wages. This resolution also provides  instructions to reverse Biden's assault on domestic energy, rein in  reckless spending, and deliver critical resources to the Trump  administration so we can secure our border and strengthen our…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688042/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Speaker, I believe my friends across the aisle are concerned  about a piece of legislation that is going to make a huge difference.\n\nIt is a piece of legislation that is going to reverse the destructive  policies that their party has put in place over many years. It is a  piece of legislation that is going to focus on getting our fiscal house  in order and…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690939/gulf-of-america-act"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…done.\n\nI would also recommend that my colleagues across the aisle speak with  the fellow Democrats in their Caucus about how harmful these  regulations are and why CRAs to reverse Biden's anti-energy and  economically harmful regulations are so important.\n\nLast Congress, Democrats voted with Republicans to pass at least five  measures to halt Biden…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688464/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing-and-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…education funding.\n\nThe good news is that we don't have to. The State can prevent any  loss of funding simply by complying with the Department's very  reasonable conditions: reverse this unfair policy; provide titles,  honors, and awards to female athletes who are unjustly deprived; and  issue those athletes an apology.\n\nThis will simply restore fairness,…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692907/warning-californias-political-leadership"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…Today, we have been taken by the idea that our social status is not  what we build or create but what we can afford to buy or consume. It is  going to take generations to reverse this thinking. The post-war order  has given birth to a shallow morality of materialism that measures  values strictly in terms of consumption. This is a poisonous new idea,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690533/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…security. However, for decades,  America's policies have shipped good-paying manufacturing jobs overseas  and opened the door for foreign adversaries to fill the void. We must  reverse this trend which would require more than just luck.\n\nThat is why the Trump administration has been championing progrowth  and pro-American policies that are fueling a domestic…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697220/made-in-america-manufacturing-finance-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…are ``a model for the Nation.''\n\nI will go through the 10 areas, the 10 radical failed policies of  Governor Newsom, which have prevailed in California that we set out to  reverse, to fight to overturn or to, at least where we can, mitigate  the harm.\n\nI will give a progress report on where we are with respect to each of  those 10 items.\n\nVery quickly,…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "Mr. STAUBER. Mr. Speaker, I rise today in strong support of H.J. Res.  140, to reverse Public Land Order 7917, which enacted the Biden  administration's dangerous mining ban in northern Minnesota.\n\nThe district I am proud to represent, Minnesota's Eighth  Congressional…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699271/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…resources, it is important the BLM       continues to provide access to prospects with the highest       potential. That is why this SJR 80 and HJR 124 are so       critical to reverse the overreach of BLM's 2022 NPR-A IAP       record of decision.\n\nRDC is concerned with the alarming trend from the last       administration of ``locking up'' oil-rich lands…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…some of  that money back. I thank President Trump.\n\nMr. Speaker, moving on to the resolution, this resolution offered by  my good friend from Pennsylvania (Mr. Joyce) would reverse a waiver  granted by the Biden EPA that allows States to ban the sale of gas- powered vehicles. This EPA rule has legitimate constitutional questions  and would increase costs…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690491/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…all of these student-athletes of the  opportunity to play their sport as well as subjecting them to onerous  new travel arrangements.\n\nI am urging the State of California to reverse this outrageous  action.", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698014/state-of-california-decision-affects-student-athletes"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…American lives. Instead, they try to turn whatever  American city they are hiding out in into Somalia 2.0.\n\nThankfully, the Trump administration is working around the clock to  reverse the evil open borders agenda that was allowed to thrive under  Joe Biden's administration.\n\nLook, despite what the woke media will tell you, President Trump is  not anti-immigration.…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697927/immigration"}, {"senator": "French Hill", "party": "Republican", "sentence": "…subsection, bear the image of allegorical liberty       wielding the Declaration of Independence featured on the gold       $2.50 Sesquicentennial Coin issued in 1926.\n\n``(B) Reverse.--The reverse design of any coin minted and       issued under this subsection shall, during the 2-year period       beginning on the date the Secretary issues any coin under…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699867/for-americas-250th-act"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…contracts from  foreign entities of concern.\n\nI applaud  Michael Baumgartner, a new freshman out of Washington, for  his work on this important bill.\n\nWe are also seeking to reverse harmful Biden-era energy regulations  on essential home appliances, including refrigerators and freezers.  Americans deserve the ability to purchase the appliances that best…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689152/advancing-america-first-policies"}, {"senator": "Richard McCormick", "party": "Republican", "sentence": "…after they actually did it.\n\nThanks to the efforts of myself, Congressman Clyde, and our amazing  local officials, State legislators, and county commissioners, we were  able to reverse most of these closures and keep almost all of our parks  open under the control of our local governments.\n\nCongressman Clyde and I also introduced the Lanier Parks Local Access…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694870/energy-and-water-development-and-related-agencies-appropriations-act-2026"}]