[{"senator": "Emily Randall", "party": "Democrat", "sentence": "…Service's current  practice of automatic implementation, while a plan is in review, to  ensure that States don't lose access to these critical conservation  funds while the service reviews their plans.\n\nAt the same time, this bill would maintain the standards by which  these plans are reviewed, ensuring that these Federal dollars are used  responsibly and as…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697623/make-state-wildlife-action-plans-efficient-act-of-2025"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…has stayed relatively flat over a decade, Social Security was       already struggling to serve the public amid an explosion of       retiring baby boomers. The staff that reviews claims for two       disability programs was on life support following massive       pandemic turnover--and still takes 233 days on average to       review an initial claim.…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689130/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…would gut the Federal  Government's ability to review the environmental impact of oil and gas  pipelines that cross into Canada and Mexico.\n\nCurrently, the Federal Government reviews the entirety of a cross- border oil pipeline, but under this bill, the review would be limited  to only 1,000 feet crossing the border. There would be virtually no  Federal…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695693/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…about the consequence of mounting job pressures. We  have seen qualified airline pilots grounded for months, in some cases  even years, due to delays with FAA medical clearance reviews.\n\nWith the 2024 FAA reauthorization as a blueprint, the Mental Health  in Aviation Act will do several things.\n\nIt will direct the FAA to annually review and update its mental…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695006/mental-health-in-aviation-act-of-2025"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…been a steadfast defender of  Congress' power of the purse. His work has been especially important to  the Budget Committee, including oversight of Impoundment Control Act  reviews. He also directed the first-ever audit of the consolidated  financial statements of the federal government, an annual effort that  has significantly improved transparency…", "date": "2025-12-19", "source_url": "https://justfacts.votesmart.org/public-statement/1698464/commending-the-honorable-gene-dodaro"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…these  firings because behind every statistic is a real American.\n\nJason, a former National Park Service employee from Grants, New  Mexico, told me: I received outstanding reviews on my last evaluation  just a week before I was laid off. The local economy here in Grants  will be devastated. I moved here to serve my community. I joined the  local library…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687984/dire-consequences-of-funding-freeze-and-mass-firings"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…NTSB Chairwoman Homendy and her predecessors have been recommending  this for over 15 years. So we want to thank her for her leadership.\n\nIt also mandates comprehensive safety reviews for all airports across  the United States, military and civilian aircraft where they share the  same skies. So not just here, but places like San Diego, Tampa, and  Norfolk,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698319/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…rubberstamped mergers, former President Biden issued an  executive order to encourage the Department of Justice and the banking  agencies, including the OCC, to strengthen their merger reviews--get  more information and find out what they intended to do and how they  were going to provide more services.\n\nThat is what President Biden tried to get done with the OCC,…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691499/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…agencies, plans like these are the  foundation for responsible, sustainable management of our public lands.  RMPs are the product of extensive public input, rigorous scientific  reviews, and meaningful Tribal consultation. Balancing the activities  on our public lands from energy development to recreation is what these  plans do.\n\nThey reflect the needs of…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696881/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…safeguards could cause thousands more  asthma attacks per day in frontline communities.\n\nThis bill also greenlights unchecked offshore oil and gas leasing. It  guts environmental reviews and public comment requirements. It  threatens fisheries, tourism economies, and coastal communities that  will see pollution, spills, storms, and sea level rise long after…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693169/one-big-beautiful-bill-act"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…and other provisions that will help ease  the financial pressures of military families.\n\nIt also extends the Child Care in Your Home pilot through 2029 and  requires annual reviews of childcare fee assistance.\n\nWe also include protections I championed for our Department of  Defense civilian workforce, barring arbitrary layoffs for DODEA  teachers and…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697807/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…rounds of firings have  hollowed out the Agency.\n\nBut despite working for years to improve food security in countries  of need around the world and despite exemplary performance reviews, he  was fired. Further, he was posted overseas with a fellow public servant  spouse. Now, he is essentially stranded abroad, fearing for his  livelihood and future of his…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688591/recognizing-federal-employees"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…main research arm of Congress,  managing the Congressional Research Service. The Comptroller General  leads the Government Accountability Office, which conducts audits and  reviews government programs to provide nonpartisan oversight for  Congress. The GPO prints and distributes official Congressional and  federal publications.\n\nTo ensure their independence…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697708/supporting-the-legislative-branch-independence-act"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…rules of agency organization,       procedure, or practice--such as those that affect the way       regulated entities submit information to an agency, how the       agency reviews that information, or the type or timing of       actions the agency will take based on that submission--rules       that are directed at and primarily concerned with the…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693338/us-government-accountability-office-legal-opinion"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…accordingly: YEA on Roll Call No. 333, Motion to Recommit on H.R.  3668, and YEA on Roll Call No. 334, Passage of H.R. 3668, Improving  Interagency Coordination for Pipeline Reviews Act.                             Personal Explanation", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698072/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…Chairman Graves, Chairman Collins, and the Water Resources  and Environment Subcommittee staff for their work putting together a  bill that cuts red tape, reduces duplicative reviews, and gives  farmers, ranchers, utilities, and communities in Colorado and across  the country the regulatory certainty that they need to build.\n\nI look forward to advancing…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698019/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…legislation will streamline regulatory approvals of LNG export  facilities to meet the movement of global energy demands.\n\nThis legislation removes unnecessary and burdensome reviews at the  Department of Energy for exporting U.S. LNG while maintaining the  required site and environmental reviews at FERC. Increasing  opportunities for exports increases…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697081/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…loopholes that have been described by my  colleagues and strengthens ADS-B requirements for commercial and  military aircraft, among many other things.\n\nIt requires safety reviews of DCA, and it requires better  coordination between the FAA and DOD. I commend the FAA Administrator  for his commitment, and particularly Secretary Duffy, for their  combined…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698321/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…those  who have stood up in the past against Federal overreach by previous  administrations?\n\nExecutive branch Agencies and regulators of independent agencies post  that their reviews and approvals will depend on companies' conduct and  whether they align with the administration's agenda. This undermines  the very foundations of rule of law that undermine…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699917/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Little Rock Corps decisionmakers  make good, low-risk decisions for the benefit of this trout fishery.\n\nIt also prevents the need for new and required equipment,  environmental reviews, such as those required under the National  Environmental Protection Act, and changes to the current water control  plan.\n\nMr. HILL of Arkansas. Mr. Chair, additionally, this…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694859/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…complementary efforts and direct the Director of National       Intelligence and the Under Secretary of Defense for       Intelligence and Security to closely coordinate their reviews       to ensure consistency, share findings as appropriate, and       avoid duplication.", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698262/explanatory-statement-for-the-intelligence-authorization-act-for-fiscal-year-2026"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…housing  costs.\n\nI will take a moment to highlight a few provisions that I think will  make a difference. Section 104 and 105 of the bill works to rightsize  the environmental reviews on both HUD and USDA housing projects to  properly reflect their impact on the environment. This legislation  ensures that these environmental reviews are properly tailored…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699798/housing-for-the-21st-century-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…achieve this, however, we aren't going to lower our standards.  This extension maintains the most stringent eligibility criteria of any  trade preference program, with annual reviews to defend IP rights,  human rights, market access, and the rule of law against corruption. To  be eligible, countries must also ensure they are not undermining  America's…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698908/agoa-extension-act"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…national security.\n\nYet, even after clearing one of the most stringent State  environmental review processes in the country, the project is subjected  to duplicative Federal reviews that reached the same exact conclusions  again and again. Those delays were not about environmental risks. They  were bureaucratic duplication, years of lost time before construction…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699905/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…be required to  obtain an additional permit for the same activity.\n\nLet me be clear. This bill does not weaken environmental protections.  All existing environmental laws, reviews, and interagency coordination  requirements remain fully intact. This is about eliminating redundancy,  not eliminating oversight.\n\nThis matters for States like Georgia. Georgia's…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699956/undersea-cable-protection-act-of-2025"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…Increase by at     Would increase                                   Accountable IRS                         least $500K.       revenues by $117                                   Reviews Act, as                                            million over 2026-                                   amended.                                                   2036.…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697267/expanding-wksi-eligibility-act"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…At Fort Huachuca in Arizona, for example, the Sonoran tiger  salamanders' designated critical wetland habitat requires strict  protection measures. That means environmental reviews and limits on  land use, construction, and water management. All those delay vital  infrastructure projects and constrain training exercises during  breeding seasons.\n\nOn…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695254/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…proud to partner with President Trump  during his first administration to update CFIUS, the Committee on  Foreign Investment in the United States. This interagency committee  reviews foreign investments and real estate transactions to determine  whether they pose any security risks for the United States.\n\nThrough the Foreign Investment Risk Review Modernization…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688807/cormick-and-mmcr-fettermanhagerty-kim-cormick-schumer-sullivan-fetterman-and-others-for"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…proud to partner with President Trump  during his first administration to update CFIUS, the Committee on  Foreign Investment in the United States. This interagency committee  reviews foreign investments and real estate transactions to determine  whether they pose any security risks for the United States.\n\nThrough the Foreign Investment Risk Review Modernization…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688824/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "Mr. MAST. Mr. Speaker, I move to suspend the rules and pass the bill  (H.R. 1512) to amend the Taiwan Assurance Act of 2020 to require  periodic reviews and updated reports relating to the Department of  State's Taiwan Guidelines, as amended.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690686/taiwan-assurance-implementation-act"}]