[{"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…shifted toward making large transfers to allied       super PACs--in amounts that far exceeded any previous direct       ad spending. These totals can only be tabulated by reviewing       each super PAC's campaign finance reports. Dark money groups       also increasingly run ads, including many online ads, that       are worded and timed such that they…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699084/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…this Congress. She won't be the last. In every instance, we must  carefully examine the nominee's record as we consider them for a  lifetime appointment. After carefully reviewing her record, I have  serious concerns. I think my colleagues, if they look at her honestly,  will as well. I urge them to join me in opposing her nomination.\n\n(Mrs. Britt…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693415/nomination-of-whitney-d-hermandorfer"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "…allows people to be charged  with a DUI if they are intoxicated and have ``physical control'' of  their vehicle. This issue came to a head in the Ninth Circuit, which,  in reviewing an appeal of a removal case for a noncitizen who was  charged under this law, found that the physical control language meant  that under this statute: ``One may be convicted…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693080/jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-2025"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…the agency's       decision, which do not. For example, in B-329916, May 17,       2018, we examined an IRS announcement that the agency was       changing its process for reviewing tax returns for compliance       with certain statutory reporting requirements. Previously,       IRS assessed compliance after the taxpayer filed a return,       IRS processed…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694840/government-accountability-office-legal-opinion"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…15 days after the closing of the public  comment period.\n\nThis resolution would reinstitute automatic approval just as Elon  Musk's, his DOGE, guts the very staff that are reviewing these bank  merger applications. It is a dangerous combination to actually say: We  are going to do these automatic approvals, give them a really short  period of time, and…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690769/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…come to the United States.\n\nIn this situation, those who have successfully made that journey are  once again in jeopardy with the new Trump policy.\n\nThe administration is reviewing again all legal immigration cases  already approved for individuals from the banned nations. To be clear,  this expansion is not limited to nationals of countries on the…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699112/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…mergers.\n\nThird, the rule provided guidance, something industry often asks for.  Specifically, the OCC provided guidance on how they would consider  statutory factors when reviewing an application, making the process  more transparent.\n\nRolling back these reforms is dangerous, especially at a time when  DOGE is firing staff at the OCC and the other bank…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691499/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…self-govern and,  importantly, to address serious flooding concerns facing the village.  This bipartisan bill is narrow, targeted, and respects Tribal  sovereignty.\n\nAfter reviewing the President's statement regarding his veto, it is  very clear that this decision was not limited to the merits of the bill  or to any particular policy. Instead, his statement…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698657/miccosukee-reserved-area-amendments-act-veto-message-from-the-president-of-the-united-states"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…an internal  review of these notice letters and had already redrafted many of them  to be more direct and easier to understand, but VA could also use some  outside help in reviewing the literally thousands of different possible  letters they might send to a veteran.\n\nH.R. 1039 seeks to provide that assistance. Specifically, it mandates  that VA make…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689677/clear-communication-for-veterans-claims-act"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…identification.\n\nThe men thought they were being kidnapped. Some of them had their  feet, hands, and wrists shackled, and another man even had a gun  pointed at him.\n\nThe court who was reviewing these cases questioned what it was about  the bus stop that caused these ICE agents to believe they had  reasonable suspicion to detain these men. Reasonable suspicion means…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693662/weaponization-of-ice"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…few weeks ago, on the evening of June 30, the Department of  Education sent out the following message to States:\n\n``Given the change in administrations, the Department is reviewing  [the funding for these programs], and decisions have not yet been made  concerning submissions and awards for this upcoming academic year.  Accordingly, the Department will…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693588/americans-have-a-right-to-a-quality-public-education"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…3427.\n\nMr. Speaker, my bill, H.R. 3427, the Water Resources Technical  Assistance Review Act, would instruct the Government Accountability  Office, or GAO, to conduct a study reviewing the EPA's technical  assistance programs.\n\nAccess to clean and safe water should not be determined by where you  live, Mr. Speaker. During my time in Congress, I have heard…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695402/water-resources-technical-assistance-review-act"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "…the current       threat environment to elementary and secondary schools; and\n\n``(4) build upon existing or ongoing evaluations and avoid       unnecessary duplication by reviewing the findings,       conclusions, and recommendations of other appropriate working       groups, committees, commissions, or entities established by       the Department related…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696997/national-strategy-for-school-security-act-of-2025"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…agriculture: foreign investment  in American farmland.\n\nThe Committee on Foreign Investment in the United States, or CFIUS,  plays a vital role in safeguarding our country by reviewing foreign  acquisitions that could pose risks to our national security. Ensuring  that CFIUS has the right expertise and authority to evaluate these  transactions is more important…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692799/agricultural-risk-review-act-of-2025"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…determination       was based on classified information (as defined in section       1(a) of the Classified Information Procedures Act) such       information may be submitted to the reviewing court ex parte       and in camera. This subsection may not be construed to confer       or imply any right to judicial review.\n\n(e) Implementation; Penalties.--\n\n(1) Implementation.--The…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692720/sanction-sea-pirates-act-of-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…weekly to support veterans. She also volunteers with  the Salvation Army of Pasco County's Domestic Violence Program each  week, helping survivors navigate the legal process by reviewing and  drafting petitions for Injunctions for Protection at the West Pasco  Judicial Center. Kathy acts as a link between these clients in need and  Bay Area Legal Services.…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691195/recognizing-kathy-logue"}, {"senator": "French Hill", "party": "Republican", "sentence": "…October 19, 1984 (PL 98-508).\n\nI'll conclude with this photo taken on May 7, 1984, of       Senator Tower sitting in his office in the Russell Senate       Office Building reviewing Bill Coleman and Susan Morrison's       beautifully illustrated volume, Arkansas Wilderness. I       dedicate these remarks to the memory of my friend and mentor,       John…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691095/flatside-wilderness-additions-act"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…advances a goal shared by both House Republicans and the  Trump administration to promote government efficiency by holding the  U.S. Fish and Wildlife Service accountable when reviewing State  Wildlife Action Plans, or SWAPs.\n\nSWAPs serve as blueprints for identifying each State's and  territory's unique conservation needs. By law, States must have an  updated…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697624/make-state-wildlife-action-plans-efficient-act-of-2025"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…purposes.\n\nNothing in this legislation limits the authority of the President to  impose sanctions on foreign governments and does not affect the  existing FERC authorities for reviewing facilities for environmental or  safety purposes.\n\nH.R. 1949 brings commonsense reforms to treat LNG just like other  commodities such as crude oil. In the 114th Congress,…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697081/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…recusal of commanding       officers and the flag officer described in subsection (c)(2)       from making initial or subsequent decisions on proposed       separations or from reviewing proposed separations.\n\n(2) Criteria.--The recusal process established under       paragraph (1) shall specify criteria for recusal, including       mandatory recusal from…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…reconciliation bill in       U.S. history with $1.7 trillion in savings, which garnered       the support of the full House Republican conference.\n\nThe Senate is currently reviewing the bill, and I'm urging       Senate leadership to make sure that any changes to the bill:       Do not increase the deficit relative to current law.\n\nProvide real savings--no…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692878/newsletter-from-congressman-chuck-edwards"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "Mr. LATTA. Mr. Speaker, pursuant to House Resolution 936, I call up  the bill (H.R. 3668) to promote interagency coordination for reviewing  certain authorizations under section 3 of the Natural Gas Act, and for  other purposes, and ask for its immediate consideration in the House.\n\nThe Clerk read the title of…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698073/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…transfer of relevant environmental review and authorization       data among Federal agencies.\n\n(B) Automated project screening to assist frontline staff       with reviewing project sponsor provided information for       completeness and accuracy and determining if a categorical       exclusion or other general authorization applies to an…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697679/epermit-act"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…signed into law and will soon begin making  a real difference on the ground.\n\nThis didn't happen overnight. It came after months of meetings with  local leaders, carefully reviewing community priorities, submitting  formal requests, and tirelessly advocating for these projects in  Washington.\n\nThanks to that work, we are delivering $6 million to replace…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699896/delivering-for-iowa"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…Coordination.\n\nMac continued his career in South Carolina serving as the in-house  Counsel for the Georgetown County government. In this role, Mac was  responsible for drafting, reviewing, and approving legal documents,  including deeds, contracts, leases, dedication instruments, financing  documents, resolutions and ordinances. These wide-ranging  responsibilities…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695496/thanking-john-mcintyre-mac-tolar-for-his-dedicated-service-to-our-nation"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…person with a 45-day period beginning on       the date of receipt of such noncompliance letter to respond       in writing as set forth in such paragraph; and\n\n``(C) after reviewing such written response, determine       whether the person demonstrated a lack of due diligence in       satisfying such requirement.''.\n\n(c) Conforming Amendments.--Section…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697276/mikaela-naylon-give-kids-a-chance-act"}]