[{"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…living  out the values of America as teachers, first responders, public  servants, and leaders.\n\nThe Marine Corps has fought in every American conflict from the  Revolutionary War to the War on Terror. On the beaches of Iwo Jima, in  the frozen mountains of Korea, in the jungles of Vietnam, and in the  sands of Fallujah, marines have stood their ground.…", "date": "2025-11-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696623/recognizing-the-250th-anniversary-of-the-united-states-marine-corps"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…Trumbull. It depicts George Washington  in the Maryland State Senate Chamber as he resigns his commission as  Commander in Chief of the Continental Army at the end of the  Revolutionary War.\n\nThat painting, Mr. Speaker, is a testament to a man who so eagerly  relinquished his power and who only reluctantly reclaimed it when the  American people called him…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698552/january-6-attack"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…a long and proud history of commitment to the       United States, dating back to the Chasseurs--Haitian soldiers       who fought alongside U.S. forces during the Revolutionary       War. Since then, more than one million Haitians have made       this country their home. Today, over 80,000 Haitians live in       Massachusetts alone, where they play…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699703/community-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…preserves more than 600  years of our history, documenting the development of international  maritime trade and the journey to American economic independence  following the Revolutionary War.\n\nDue to the importance of preserving the maritime history of New  England, Congress chose to designate a piece of the Salem waterfront as  the country's first national…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691014/salem-maritime-national-historical-park-redesignation-and-boundary-study-act"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…that we have in South  Carolina.\n\nNow, this picture here is a picture that tells you a little bit about  education and DEI. As you can tell, this picture is about the  Revolutionary War. Now, a lot of people talk about Massachusetts and  Virginia and what they did for the Revolutionary War.\n\nLet me tell you something, if you were really educated properly,…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689638/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…kick it off in February and continue it for the rest of the  year.\n\nTonight, we are reminded that Black military history is not a  footnote. It is foundational. From the Revolutionary War to today's  All-Volunteer Force, Black servicemembers have defended this Nation  with courage, discipline, and sacrifice, even when this Nation did not  fully defend…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699864/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Federal taxes, serve on  Federal juries, and register with Selective Service in the same manner  as residents of the States. They have served in the military since the  Revolutionary War, which was fought to end taxation without  representation and to give consent to the governed. Yet, Congress has  denied them voting representation in Congress and full…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692373/district-of-columbia-federal-immigration-compliance-act-of-2025"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…Bacon  House stands as a powerful symbol of our Nation's commitment to  diplomacy and the rule of law.\n\nThe House was built on land previously owned by David Burnes, a  Revolutionary War veteran whose other real estate holdings were used  for key national landmarks, including the White House and National  Mall.\n\nThe House's site was acquired in 1815 by…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692065/recognizing-the-dacor-bacon-house-bicentennial-day"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…the Saratoga National Battlefield Park.\n\nThe site in Stillwater, New York, marks the location of a critical  pair of battles known as the turning point of the American  Revolutionary War.\n\nAmerican forces defeated the British in the Battle of Saratoga in  October 1777, which the National Park Service notes renewed the  patriots' hope for independence…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691017/strengthening-americas-turning-point-act"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "Ms. SCHOLTEN. Mr. Speaker, the United States won its independence 250  years ago in the Revolutionary War, and our journey as the United  States of America began. Yet, 250 years ago, I could not be standing  where I am today. Women did not have the right to vote, to hold…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689165/womens-history-month"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…the Colonies from British  rule.\n\nHe helped draft both the Declaration of Independence and the United  States Constitution, and he negotiated the treaty that ended the  Revolutionary War. His genius has shaped our Nation in innumerable  ways, and he deserves to be prominently displayed and honored in the  United States Capitol.\n\nMadam Speaker, I look…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688219/procurement-and-placement-of-statue-of-benjamin-franklin-in-the-united-states-capitol"}, {"senator": "Richard Neal", "party": "Democrat", "sentence": "…rise today to honor a remarkable milestone  in our Nation's history, the 50th anniversary of the Springfield Armory  National Historic Site (NHS).\n\nEstablished during the Revolutionary War in 1777 as the ``Arsenal at  Springfield,'' the site was recommended to George Washington by General  Henry Knox for its strategic location along the Connecticut River…", "date": "2025-08-12", "source_url": "https://justfacts.votesmart.org/public-statement/1694730/recognizing-the-50th-anniversary-of-the-springfield-armory"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…the Pentagon,  the largest military office in the world. We have been the site of more  battles on U.S. soil than any State in this country, in Virginia: the  Revolutionary War, the Civil War, the attack on 9/11 at the Pentagon.\n\nWe are as pro-military a State as there is, but I can tell you this:  Virginians do not believe the United States should…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692637/war-powers-resolution"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Act, the District of Columbia Local  Funds Act has been sitting in this House for 3 months.\n\nMadam Speaker, I close by discussing democracy, or lack thereof, in  D.C. The Revolutionary War was fought to give consent to the governed  and to end taxation without representation. Yet, D.C. residents cannot  consent to any action taken by Congress, whether on…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692302/protecting-our-nations-capital-emergency-act"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…forward.\n\nSince our Nation's founding, our military has relied on Black  Americans to answer the call to serve. Quite frankly, it occurred prior  to our founding. From the Revolutionary War and Crispus Attucks to  Harriet Tubman, spy, scout, nurse, and cook for the Union Army during  the Civil War. From the Tuskegee Airmen, the valiant and courageous Red…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699863/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…without the common counsel of the realm.\n\nEven at that time they were chafing at one man, the King, determining  the taxes for the land.\n\nOne hundred years before our Revolutionary War, in the English Civil  War, there was a debate over parliamentary supremacy versus supremacy  of the King. They did not want to pay taxes that weren't approved by  the…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689478/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…urge my colleagues to join me in supporting H.R.\n\nMr. Speaker, as we get ready to celebrate our 250th anniversary--and,  actually, we are already in it with some of the Revolutionary War  battles being fought already over 250 years ago--we look forward to  Americans being able to have a very affordable day when they can go to  our parks and Federal lands…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697765/semiquincentennial-tourism-and-access-to-recreation-sites-act"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…Samuel  Nicholas. Since its founding 250 years ago, the Marine Corps has stood  as a symbol of excellence and steadfast commitment to defending our  homeland. From the Revolutionary War to the present, our marines have  demonstrated outstanding courage wherever and whenever they are called  to serve.\n\nI encourage my colleagues to join me as we honor…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698198/recognizing-veterans-day"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…into the future.\n\nOne of my favorite quotes hangs just above the Speaker's rostrum on  the House Floor. Two hundred years ago, Daniel Webster addressed a few  hundred Revolutionary War veterans and spectators at the Battle of  Bunker Hill was memorial groundbreaking. In his oration, he said, ``Let  us develop the resources of our land, call forth its…", "date": "2025-10-28", "source_url": "https://justfacts.votesmart.org/public-statement/1696430/recognizing-high-impact-movement"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…until after they shall have deliberated  upon the subject, and authorized such a measure.'' No offensive  expedition without congressional approval.\n\nSt. George Tucker, a Revolutionary War-era law professor, wrote in  1803 of how our Constitution diverged from the English tradition.\n\nHe wrote:\n\nIn England the right of making war is in the King. . . .…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693121/motion-to-discharge-sj-res-59"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Continental Army troops  against the British empire in present-day Saratoga County. In the  ensuing Battles of Saratoga, American colonists forged a turning point  in the Revolutionary War by routing the British invasion force.\n\nToday, this 3,400-acre site is considered a unit of the National Park  System. There, visitors can explore trails and experience…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691018/strengthening-americas-turning-point-act"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "Ms. COLLINS. Mr. President, the Town of Whiting, ME, observes its  bicentennial this July with a 3-day celebration that includes a  Revolutionary  War reenactment, displays of antique farm and lumbering tools,  historical presentations, quilts and other local crafts, great food,  and good friendship. This long-planned…", "date": "2025-07-08", "source_url": "https://justfacts.votesmart.org/public-statement/1693257/town-of-whiting-200th-anniversary"}, {"senator": "Elise Stefanik", "party": "Republican", "sentence": "…Saratoga, where he surrendered to General Horatio Gates.\n\nThe American victory against British forces at the Battles of  Saratoga marked a changing of the tide in the Revolutionary War, hence,  the turning point, securing foreign support from France and bolstering  domestic support for the American patriots and their righteous cause.\n\nThis bipartisan…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691016/strengthening-americas-turning-point-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…1776 to 1778, helping guide our young nation through the turbulent  revolutionary years.\n\nEstablished in 1752, the Midway Congregational Church was destroyed  during the Revolutionary War, highlighting the immense sacrifice made  by the citizens of Midway in advancing the cause of liberty.\n\nThe town is now home to Georgia's only colonial museum and serves…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694770/recognizing-the-city-of-midway-georgia-on-its-centennial-celebration"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…gentlewoman from New York, Congresswoman Stefanik.\n\nThe Saint Regis Mohawk Tribe is located on the border of New York and  Canada along the St. Lawrence River. Following the Revolutionary War,  the Seven Nations of Canada and the State of New York signed the 1796  Treaty, which gave the Tribe its reservation.\n\nIn 1824 and 1825, New York acquired land from…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697675/resolving-the-akwesasne-mohawk-land-claim-in-the-state-of-new-york"}]