[{"senator": "Sean Casten", "party": "Democrat", "sentence": "…yesterday ICE murdered an American citizen.  Renee Good was a wife and a mother who has now become ICE's latest  victim. To those at DHS and in this Chamber who have created and  rewarded a culture of murder, I ask the same question that God asked  Cain:\n\nWhat have you done? You have slain your sister who gave you no  offense. The voice of her innocent blood…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698687/holding-ice-accountable"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…committed that day for  his personal political benefit.\n\nHe chose to send the chilling message that political violence in his  name would not only be condoned, it would be rewarded. Trump and his  rightwing MAGA supporters hailed those who carried Confederate flags  and symbols of White supremacy as patriots. That is gaslighting on  steroids. The true…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698517/anniversary-of-january-6"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…They give good service. Shouldn't they be entitled to the  reward for the labor that they have done; whereas, what we are seeing  now is that if you are connected, you can be rewarded regardless of how  good your product is or how lousy your service is. That is offensive-- and should be--to every single one of us here, and that is absolutely  what is happening…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690522/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…and children with disabilities just to hand more  money to the top 0.1 percent. The top 0.1 percent--they are the  wealthiest people in America. They are the ones who were rewarded with  the taking of this money.\n\nMeanwhile, Democrats have been listening to our constituents and  hosting townhalls--even in Republican-led States--and fighting back  against…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694383/9999"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…to continue to support our ally. History  teaches that aggressors never stop of their own accord. And they are  never satisfied with appeasement. If Vladimir Putin's war is rewarded  with Ukrainian land, he will try again for more.\n\nI will continue to advocate for our ally Ukraine--for their defense,  for the civilian and military resources they need,…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690563/supporting-ukraine"}, {"senator": "Greg Stanton", "party": "Democrat", "sentence": "…housing, and early childhood education. She brings that same  fight to Congress.\n\nThe people of Arizona's Seventh District placed their trust in her,  and today that trust is rewarded.\n\nHer first act of Congress will be a powerful one. She will be the  218th and final signature on the discharge petition to force the Trump  administration to release the…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696709/welcoming-the-honorable-adelita-s-grijalva-to-the-house-of-representatives"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…United States. My colleagues need to square the circle for me.  Please do it.\n\nDeficit: Republicans who call themselves fiscal hawks stayed true to  President Trump and got rewarded with $2 trillion added to the national  debt, bringing us to a whopping $38 trillion. How many zeroes are in  that number? Far too many for Americans to afford.\n\nThen, there…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697771/intervening-in-gops-relationship-with-president-trump"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…the country, and it rejects Russ Vought's scheme to have NIH  reward all its multiyear grants in one lump sum, something that would  mean thousands of fewer grants that were rewarded and thousands of  fewer chances to discover medical breakthroughs.\n\nProtecting NIH funding is a huge deal for researchers across the  country, including in my home State of…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699453/appropriations"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…knew exactly how Cantor  Fitzgerald and U.S. bond markets were directly tied to the Middle East  kingdoms' stability, and U.S. markets.\n\nHistory demonstrates our nation has rewarded tens of thousands of  American lives for dirty crude oil interests. We should not be sending  our sons and daughters to die in Venezuelan jungles so oil companies  can squeeze…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698837/reflecting-on-impact-of-illegal-action-in-venezuela"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…that. There is an affordability crisis in our country, and the  corporations and billionaires driving up these costs don't care. They  not only don't care, they were also rewarded with a big tax break in  the betrayal bill.\n\nThis is why it is important to understand that this is a policy  choice, that many of our families feel like they are intentionally…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697023/economic-dignity-for-all"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…out  of $1 million, the government can sue that entity for up to $3 million.  If the government wins, $1 million is returned to the defrauded agency,  up to 30 percent is rewarded to any relevant whistleblower, when  necessary, and the remaining leftover funds are unobligated.\n\nThe Crime Victims Fund Stabilization Act only redirects these  leftover,…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698841/crime-victims-fund-stabilization-act-of-2025"}, {"senator": "Scott Fitzgerald", "party": "Republican", "sentence": "…equipping our law enforcement  and public safety officers with the best tools to keep our communities  safe and our first responders out of harm's way.\n\nInnovation should be rewarded, not stifled, and this bill does just  that. I thank my colleagues--Congressman Correa, Congressman  Schweikert, Congressman Stanton, and all the others who have been  supportive…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700039/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…Trump, the EPA adopted a more rational  approach allowing facilities that significantly reduced their emissions  to be reclassified as area sources. This commonsense change rewarded  emissions improvements and reduced unnecessary regulatory burdens on  American manufacturers and energy producers.\n\nTo no one's surprise, the Biden administration reversed…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691514/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…solution that  actually lowers costs, doesn't increase premiums. Let's find a solution  that squeezes out waste, eliminates and prosecutes fraud, not a system  in which they are rewarded.\n\nAs a doctor, as a conservative, as an American, as a steward of the  Federal taxpayer--when I say Federal taxpayer, I mean you and me and  everybody watching and everyone…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698998/disrupt-explicit-forged-images-and-non-consensual-edits-act-of-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Rise of the Rest.'' We want America to thrive no  matter what side of the tracks you grow up on or what your education  level is. We want hard work, savings, and investment rewarded.\n\nMrs. Wagner, Mr. Gottheimer, and Mr. Meeks have delivered that in the  INVEST Act, and I urge a ``yes'' vote.", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697828/increasing-investor-opportunities-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…services actually make money because they help our  brothers and sisters who are in their retirement years earning their  healthcare benefits, helping them be healthier? They get rewarded by  having their population be healthier, not by running around scoring  with sicker. Yay, everyone wins.\n\nWhat would happen with that several hundred billion dollars over…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689381/us-borrows-billion-a-day"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…innovators willing to take the  extraordinary risk of developing a first-in-class treatment for a  complex condition affecting a small patient population are  appropriately rewarded.\n\nFor many rare diseases, the first FDA-approved treatment is a  lifeline. These therapies often require years of research, billions in  investment, and considerable perseverance…", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691696/support-for-the-orphan-drug-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…and sisters get healthier.\n\nThat means taking on farm bills, nutrition policy, how we deliver  healthcare. Maybe things like Medicare Advantage and these things  should be rewarded for making their populations healthier instead of  running around scoring them as sicker. There are solutions here.\n\nWe have known this chart for decades, that this is coming.…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688651/a-real-math-problem"}, {"senator": "Scott Fitzgerald", "party": "Republican", "sentence": "…equipping our law enforcement  and public safety officers with the best tools to keep our communities  safe and our first responders out of harm's way.\n\nInnovation should be rewarded, not stifled, and this bill does just  that.\n\nMr. Speaker, I thank my colleagues, Congressman Correa, Congressman  Schweikert, and Congressman Stanton, for their leadership…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699904/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…It simply  returns us to the commonsense, pro-growth, pro-clean-air policy of the  Trump administration. If a business steps up and reduces its emissions,  it ought to be rewarded, not handcuffed.\n\nMr. Speaker, I urge my colleagues to stand with the American worker,  stand with American innovation, and vote ``yes'' on S.J. Res. 31. I  reserve the balance…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691596/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…country illegally pays zero in healthcare because they get Medicaid  services where there is not even a copay.\n\nThat is the ironic part about this. They break the law and are  rewarded for it. That undercuts the American Dream.\n\nPeople start thinking logically: Why do I play by the rules? Maybe I  will manipulate a form so that I qualify for Medicaid, and…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690712/outrageous-government-funded-incentives"}, {"senator": "Carlos Gimenez", "party": "Republican", "sentence": "…basketball title.\n\nThese young men have demonstrated relentless dedication and  perseverance throughout the season. I am proud to see that their hard  work and commitment was rewarded. I extend my congratulations to Coach  Andrew Moran, his staff, and the entire team on this remarkable  accomplishment.\n\nThrough unity, tradition, and excellence they have…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689833/congratulating-christopher-columbus-high-school-explorers"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…related services, all while hosting the SBA regional office and  laughing at the American taxpayers while doing it.\n\nThis is unacceptable. Sanctuary cities should not be rewarded with  Federal offices and resources. That is why I wrote to SBA Administrator  Kelly Loeffler urging her to move the regional office to Colorado  Springs, where we cooperate…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692103/save-sba-from-sanctuary-cities-act-of-2025"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…tipped workers. Even  worse, such convoluted timekeeping requirements directly impact how  much pay Americans take home.\n\nLike many of my colleagues, I want to see Americans rewarded for  their hard work and ensure they are paid what they earn. That is why I  am proud to rise in support of H.R. 2312, the Tipped Employee  Protection Act, which creates stability…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698965/tipped-employee-protection-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…incentivized.\n\nWe had one of the lead medical officers from a healthcare system in  Arizona called Banner talking about how they are trying to align a  system that actually they get rewarded for helping populations be  healthier and the technology they are using to do it.\n\nThe fact of the matter is that we are finally trying to drag the  conversation around this…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698412/fun-with-math"}]