[{"senator": "Luz Rivas", "party": "Democrat", "sentence": "…witnessed today were actions of an authoritative government.  The Trump administration quickly resorted to violent actions to silence  Senator Padilla, erase our democracy, and rewrite our Nation's values.\n\nEvery American should be outraged at how the Trump administration is  treating anyone who dares to stand in their way. Whether you are a U.S.  Senator,…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692509/standing-with-senator-alex-padilla"}, {"senator": "Ilhan Omar", "party": "Democrat", "sentence": "…sweeping set of  proposals from Trump's Department of Labor that threatens worker  safety, fair pay, and basic protections for millions of Americans.\n\nThe Department is moving to rewrite or repeal more than 60 workplace  regulations. Let me say that again: 60 workplace regulations. It will  affect conditions in farms, factories, construction sites, and mines.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695573/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…on the  people of our country.\n\nSo let's not trigger this nuclear option. Let's not unleash a  mushroom cloud of pollution on our communities. Let's not allow  polluters to rewrite Senate precedent. Let's not steal the right of  States to set high standards that result in children breathing cleaner  air, not having their vulnerable lungs be sucking in…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691549/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…Pilots.\n\nA training program that honored these heroes was halted. Their  history was nearly erased in the name of a stupid and mean-spirited  political agenda that sought to rewrite America's past  to fit a narrow, exclusionary narrative. This was more than an insult  to the African-American community. It was an insult to America itself.  It was an affront…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687895/black-history-month"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…President  has issued more executive orders than the last approximately 10  Presidents combined already, and we are only 3\\1/2\\ months into his  Presidency. Executive orders do not rewrite laws that we pass.\n\nI remind my colleagues of something that my kids learned in third  grade: Article I of the Constitution gives Congress and only Congress  the authority…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690818/gross-violations-of-law-by-trump-administration"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…Greenland; put Cuba, Mexico, and Colombia on notice that they  could be next; had the administration and many of my  colleagues, who know better because they were here, try and rewrite the  history of what happened on January 6; and an ICE agent shot and killed  a woman in Minnesota, and DHS immediately blamed the victim with no  pretense of wanting to find…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698665/protecting-healthcare-for-millions-of-americans"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…bipartisan bill,  every single one.\n\nAs if that is not bad enough, every single Republican on the Rules  Committee also voted to create, out of thin air, a brand-new committee  to rewrite the history of what happened here on January 6, 2021.\n\nThey are so desperate to paper over what happened that day, to  whitewash it and to pretend it was a normal tourist…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694886/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…bill is counter to House  rules and undermines the jurisdiction of our authorizing committees.  Appropriations bills are intended to fund the operations of government,  not to rewrite permanent law.\n\nThe Agriculture Committee is the proper venue to hear from  stakeholders and debate this change. This provision should never have  been added to an appropriations…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696722/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…transferred them to other agencies, declassified  educators from getting student loans, threatened schools and  universities, and given their friends contracts to not only rewrite  educational curricula but to even rewrite American history itself.\n\nLet me remind my colleagues: This is the agency that was born out of  the civil rights movement, the agency…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697300/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Derek Tran", "party": "Democrat", "sentence": "…Florida.\n\nI am reminded every day of our strength, our determination, and our  unyielding commitment to preserving our history and to ensuring that no  Communist regime can rewrite our history.\n\nMr. Speaker, I urge my colleagues to join me in not only remembering  the hardships we face, but also in celebrating the incredible  resilience of the Vietnamese…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690347/recognizing-black-april"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…day, the plaque is here in  the Capitol but the Speaker has not allowed it to be placed.\n\nMr. Speaker, I rise to urge Speaker Johnson to not allow his worship  of one man to rewrite the history of that horrible day. Congress must  show respect for those who defended democracy, liberty, and Article I  of the Constitution of the United States right here…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698548/january-6-attack"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…those forward-looking changes. But that is not  what is happening right here. Instead, without any thoughtful  consideration, this body approved a provision to retroactively rewrite  the law and set up the opportunity for special financial payments to a  select group of Senators.\n\nWhen our House colleagues learned of this, they were as surprised as  most…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699110/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…with trauma. In Brian's honor, I  introduced a resolution condemning those blanket pardons.\n\nWe must never forget their sacrifice. We cannot let Donald Trump and  his allies rewrite the history of one of the darkest moments in the  250-year history of this Nation.\n\nMr. CLYBURN. Mr. Speaker, I thank the gentlewoman for her remarks.\n\nNow I yield to the…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698554/january-6-attack"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…sinister  than the heinous violence that occurred that day. Today, we face the  systemic attempt by supposed leaders, by Trump and rightwing MAGA  Republicans, to erase and rewrite the truth of January 6, whitewashing  the violence of the riot and calling it a ``day of love.''\n\nI invite everyone in this Chamber and across the country to watch the  footage…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698517/anniversary-of-january-6"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…law and the facts wherever they lead them. In case after case, the law  and the facts are squarely against Donald Trump and his administration.\n\nWhether it be his efforts to rewrite the 14th Amendment to eliminate  birthright citizenship or his scheme to deport immigrants without even  the barest hint of due process, the courts have properly acted as…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689714/no-rogue-rulings-act-of-2025"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…Hill police for an  interview. They never wanted to talk to him. He was in charge of the  Capitol Hill police--because he knew the truth.\n\nStill today, Democrats are trying to rewrite the true events of that  history. They keep mentioning all of these Capitol Police who  supposedly died on January 6. Now, don't get me wrong. We have brave  people that work…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698541/9999"}, {"senator": "French Hill", "party": "Republican", "sentence": "…regulatory decisionmaking.\n\nIf we allow this rule to stand, we are setting a dangerous precedent,  one where Federal agencies can bypass Congress, ignore public input,  and rewrite rules largely behind closed doors. This is a precedent that  we cannot afford to set, regardless of who is in the White House or who  is in the crosshairs.\n\nMr. Speaker, the…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689950/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…advocate for our Constitution.\n\nShe will show respect for the rule of law. She will show respect for  the Constitution as it is written. She will not  be a judge who will try to rewrite it. She is eminently qualified to  serve, and I urge all my colleagues to vote to confirm her nomination.", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693465/nomination-of-whitney-d-hermandorfer"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…in our society  over the last 10, 20 years because of the discharge of a firearm in law  enforcement. It does not need to be that way.\n\nThis is actually the second or third rewrite of this bill as we try  to make the anti-firearm groups happy. It turns out we would meet their  requests, and then they would change their standard. The problem or the  disagreement…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700037/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…couldn't afford health insurance. That was exposed as  a lie. Many Americans proved simply to be forgoing insurance in many  instances. Democrats used this as an excuse to rewrite the entire  framework of the individual healthcare insurance marketplace, forcing  people onto plans that had their premiums rise by 129 percent since  2014. Indeed, the very…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698305/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…building on CNN saying, this is a mostly peaceful protest. They  spent the whole summer trying to defund the police, so don't give us  the lecture.\n\nMr. Speaker, you can try to rewrite history, but it just doesn't  work. Let me just read off the Democratic-run cities that did defund  the police.\n\nHere is the game the Democrats want. All during the summer…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691031/expressing-support-for-local-law-enforcement-officers"}, {"senator": "John Moolenaar", "party": "Republican", "sentence": "…United States.\n\nLet's be clear. The Chinese Government isn't investing in these  programs to teach language. They are trying to shape how young  Americans see the world and to rewrite the story of the Chinese  Communist Party one classroom at a time.\n\nThis is part of a broader effort by Beijing to manipulate the next  generation, whether through TikTok…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690829/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…Congress wasn't needed because the strike was ``limited.''\n\nNow that there is a Republican in the White House, what we are seeing  is that Democrats are suddenly trying to rewrite the rules. National  security moves fast. That is why our Constitution gives the Commander  in Chief real authority. President Trump seized the moment. He did it  responsibly;…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693090/iran"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…of the aisle would agree  with me on that. Cultural exchange is valuable, but it should never  mean sitting through lessons created by the CCP propagandists  attempting to rewrite history and change our minds.\n\nOur classrooms are becoming front lines in a battle of ideas, and the  CLASS Act provides the transparency needed to protect our students and…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697409/combating-the-lies-of-authoritarians-in-school-systems-act"}]