[{"senator": "Mark Kelly", "party": "Democrat", "sentence": "…a commitment to put people back  at the center of our democracy.\n\nThank you, Mr. President.\n\nWith that, I want to welcome my good friend and colleague the Senator  from Rhode Island, Sheldon Whitehouse.", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699113/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…loss. It  is in Alaska, where scientists at NOAA's Fisheries Science Center work  to maintain healthy fish populations to support local fishermen.\n\nIt is in my home State of Rhode Island, the Ocean State, where NOAA  is building Atlantic Marine Operations Center, which will centralize  its operations and take advantage of the expertise found in Rhode  Island…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688171/national-oceanic-and-atmospheric-administration"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…have an important conversation about how we  restore the mantle of fighting for working people.\n\nI was born and raised in the most patriotic town in the country,  Bristol, Rhode Island. We have the oldest and longest running Fourth of  July celebration in the country. I learned from a young age to be  patriotic, but I also learned that patriotism is not…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689081/economic-populism"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…paid for,  had already been produced, and was just waiting to be shipped to  starving people who needed it to survive. Instead, it is being  incinerated.\n\nIn my district in Rhode Island, 87,000 boxes of lifesaving nutrition  are sitting in Edesia Nutrition's warehouse. It is already paid for,  already produced, and waiting to be shipped. This is food aid…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694042/incinerating-500-tons-of-emergency-food-aid"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "Mr. PADILLA. Mr. President, I, first of all, thank my colleague from  the State of Rhode Island and echo his sentiment and his message that  Senate Republicans have crossed the line this evening. They have chosen  to overrule the Parliamentarian, thrown out some rules,…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691583/hj-res-88"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…vulnerable populations in the country. It covers nearly 80 million  people, if you combine those covered by the Children's Health Insurance  Plan, CHIP.\n\nIn my home State of Rhode Island, over 300,000 people--and that is  about one-third of my State--depend on Medicaid. And the Republicans  are talking about cutting this program by at least $880 billion,…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689546/h-con-res-14"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…supporting more than 2,500 U.S. jobs across  construction, operations, shipbuilding, manufacturing. The project was  just steps away from powering more than 350,000 homes in Rhode Island  and Connecticut, but now that is at risk, so they are facing much  higher bills.\n\nJust last week, the Interior Department asked a judge to cancel  approval of the Maryland…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695692/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "Mr. MAGAZINER. Mr. Speaker, I rise today for the seventh time to call  on the Trump administration to restore funding for lifesaving food aid  for malnourished children.\n\nRhode Island's Edesia Nutrition has helped save 25 million lives with  this ready-to-use therapeutic food manufactured in North Kingstown,  Rhode Island, supported by USAID. Yet, that…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690893/impact-of-volatility-and-policy-reversals"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "…this week, I want them  to know we have their backs, and we are all thinking of them. If anyone  is struggling, they should reach out for help.\n\nAs Brown, Providence, and Rhode Island continue to heal, I join  countless others in making sure our community, our city, and our State  have all the support we need to recover. We are on a long journey, but…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699251/brown-students-return-to-campus"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…like Pat  Murray of North Kingstown, RI. Pat is a Marine Corps veteran and a  staunch veterans advocate. He recently welcomed a baby boy, and he was  forced to move back to Rhode Island to be closer to his family because  the injuries he sustained from an IED blast in Iraq made it difficult  to care for the newborn.\n\nWe need to be very clear. This act won't…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696112/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "Mr. WHITEHOUSE. Might the Senator be willing to retain the floor for  a moment to yield for a question?\n\nMr. WHITEHOUSE. In Rhode Island, we have a grid. ISO New England it  is called. It is through that grid that electrons get from powerplant  to the grid and from the grid to people's homes, and it is run…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699019/energy-costs"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…last week. I challenge my Republican colleagues in this body to do the  same.\n\nMr. McGOVERN. Mr. Speaker, to discuss our proposal, I yield 3 minutes  to the gentleman from Rhode Island (Mr. Amo), the sponsor of this  amendment.\n\nMr. Speaker, I am confused. I mean, the gentleman wants to say that  the Republicans are not in control, even though they control…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699593/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…Last week this  parish, with Father Andrew George, Father Nicholas Lanzourakis, Charlie  Samaras, Denise Panichas, and other proud parishioners, celebrated a  touchstone of Rhode Island summers, the Church's 39th annual Cranston  Greek Festival. Thank you for all that you have done for the Cranston  community and the State of Rhode Island.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695489/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…Speaker, I am glad to welcome His All-Holiness  Ecumenical Patriarch Bartholomew to the United States to accept the  distinguished Templeton Prize. As the Representative for Rhode Island's  2nd Congressional District, I welcome Ecumenical Patriarch Bartholomew  on behalf of the vibrant Greek Orthodox constituency in my district,  including at the Church…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695494/welcoming-his-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "…workers.  His latest target is Revolution Wind. His stop work order is abusing  the definition of national security and hurting hundreds of union  workers in my home State of Rhode Island ready to finish this project  that is 80 percent complete.\n\nWe already have a permitting process that works. This amendment  perpetuates a false narrative that leaves thousands…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695136/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…lie awake when they lie down to sleep at night and can't.\n\nI went on too long. I apologize to Senator Reed.\n\nI yield to my friend Senator Reed from the wonderful State of Rhode  Island.", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697423/the-economy"}, {"senator": "Roger Marshall", "party": "Republican", "sentence": "The PRESIDING OFFICER (Mr. Marshall). The Senator from Rhode Island.", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689541/h-con-res-14"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…history of Confucius Institutes switching names but  remaining the same for the purpose of malign influence.\n\nMr. Speaker, I thank the ranking member and the gentleman from Rhode  Island (Mr. Magaziner) for his work on this bill. This is a process  that has taken a couple of years, and I believe that we have a good,  bipartisan bill that addresses the issue…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690828/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Roger Marshall", "party": "Republican", "sentence": "…about how we get there.\n\nAnd, again, I am just committed to leaving this world cleaner,  healthier, and safer. I don't believe that we can go along with my  colleague from Rhode Island's resolution here, and for that reason I  object.", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698992/unanimous-consent-request-s-res-550"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "The PRESIDING OFFICER (Mr. Schmitt). The Senator from Rhode Island.", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699083/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…ascension to the Office of President.\n\nIt is amazing to me to listen to my Democratic colleagues talking  like Chicken Little: ``The sky is falling.'' I heard the Senator from  Rhode Island suggest that we are trying to privatize Social Security.  There is no one--absolutely no one--suggesting that. This is what is  called a straw man. You erect a phony argument,…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690662/department-of-government-efficiency"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…about  his legislation, especially in New England, the States up there, look  at what has happened here. Look at California, Hawaii, Maine,  Massachusetts, Connecticut, and Rhode Island in the top six. We can see  these prices going up. Round up the top 12, and Vermont, New Hampshire,  New York, and New Jersey are also in there. What is happening is why…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698073/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Bernie Moreno", "party": "Republican", "sentence": "The PRESIDING OFFICER (Mr. Moreno). The Senator from Rhode Island.", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696125/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Shelley Capito", "party": "Republican", "sentence": "…Indiana for really framing the debate for his home State of  Indiana.\n\nI rise today in opposition as well to S.J. Res. 60, a CRA that is  introduced by my colleague from Rhode Island Senator Whitehouse to  overturn this technical correction to the State of Indiana's emissions.  The interim technical correction is necessary due to the Supreme  Court's…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695512/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-emissions-budget-and-allowance-allocations-for-indiana-under-the-revised-cross-state-air-pollution"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…who won their  respective collegiate championships this month. In the NCAA Division  III wrestling national championship, the Knights from Wartburg College  returned from Rhode Island as cochampions and with their 16th national  title--the most in Division III history. The women's basketball team at  Dordt University in Sioux Center returned to the NAIA…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689740/iowa"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…Pappano, of Pennsylvania,       to be Principal Deputy Administrator, National Nuclear       Security Administration\n\nExecutive Calendar No. 135, Michael Cadenazzi, of Rhode       Island, to be an Assistant Secretary of Defense\n\nExecutive Calendar No. 136, Sean O'Keefe, of Virginia, to       be a Deputy Under Secretary of Defense\n\nExecutive Calendar No.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695696/authorizing-the-en-bloc-consideration-in-executive-session-of-certain-nominations-on-the-executive-calendar"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "Mr. ALFORD. Mr. Speaker, I thank the gentleman from Rhode Island, and  I am honored to follow my friend from Kansas City, Reverend Emanuel  Cleaver.\n\nMr. Speaker, I agree with him. This is a bipartisan issue. Today, I  rise to introduce…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691221/stock-trading-ban-for-members-of-congress"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…management plan, or RMP, amendment locked up 11.7  million acres of land and mineral estate. To put that in perspective,  that is an area roughly the size of the States of Rhode Island,  Delaware, Connecticut, and New Jersey combined.\n\nRMPs are meant to be collaborative approaches to land management that  balance multiple uses, including energy and mineral…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694888/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Jim Justice, Jr.", "party": "Republican", "sentence": "The PRESIDING OFFICER (Mr. Justice). The Senator from Rhode Island.", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697422/the-economy"}]