[{"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…dollars that are  poured into this building from fossil fuel industry coffers through all  these phony-baloney front groups. I make fun of their names. I made up  one: Rhode Islanders for Peace and Puppies and Prosperity--with nothing  but a mail drop behind it. But behind the mail drop, creepy  billionaires are shoveling in the money so people will…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697077/climate-change"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…from Canada as well. And when the tariffs get reciprocated by  our Canadian friends after this ridiculous behavior from President  Trump, then that is going to affect all Rhode Islanders.\n\nWe buy a lot of energy, for instance, from Canada, and that is going  to raise costs for Rhode Island families. It is a direct hit to  people's pocketbooks. And as has…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689472/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "…Assembly created the  ``Rhode Island Department of State Police.'' It was the first such  organization in our state dedicated to ensuring safety, order, and  security for Rhode Islanders. What began with just 21 officers  patrolling on Indian-brand motorcycles has grown into a modern,  technologically advanced law enforcement agency committed to the  highest…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692219/rhode-island-state-police-centenary"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…judge, he sent the Fortune round       to Boston, a step of doubtful legality that only made matters       worse. Unwittingly, the Gaspee had antagonized a family of       Rhode Islanders who embodied all the values for which the       colony stood.\n\nThe rum [on board] belonged to the Greenes, Quakers with a       farm or two, a saw-mill, and a forge for…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691707/253rd-anniversary-of-the-gaspee-raid"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…landmarks, small businesses, and stunning coastlines.\n\nTo him, this work wasn't just a job. It was his way of life. He  helped people across the country and the world see what Rhode Islanders  have always known, that there is no place like the Ocean State.\n\nUnder his leadership, tourism became a major economic driver,  creating thousands of jobs and boosting…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688521/9999"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…Speaker, while Donald Trump and congressional  Republicans spend time building a billion-dollar ballroom, bailing out  Argentina, and lavishing tax cuts on billionaires, Rhode Islanders and  Americans continue to struggle with the high cost of healthcare.\n\nI wish that our colleagues would spend as much time worrying about  how they are going to lower…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697432/recognizing-sarah-dully-rhode-island-teacher-of-the-year"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "…communicate, paid for by Medicaid.\n\nYet, Republicans are trying to ram through their disastrous budget  poised to gut Medicaid and threaten healthcare for one in four Rhode  Islanders.\n\nI recently met with Pranoy. He said simply: ``I am only getting  started.'' That sentence sums it up. It is what keeps his family and  myself up at night. These Republican…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691367/i-stand-with-the-disability-community"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "…the table is about to get  exponentially harder thanks to the $187 billion Republicans cut from  SNAP in their big, ugly law.\n\nThese harmful cuts impact roughly 35,000 Rhode Islanders.\n\nWe saw the devastating consequences of SNAP uncertainty when  Republicans let funding for the program lapse during the government  shutdown. Demand at food pantries…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697956/snap-cuts-in-rhode-island"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…but that is what you did.\n\nNow we have these cuts to people receiving help paying for their  healthcare under the Affordable Care Act. It is going to be about  40,000 Rhode Islanders. These aren't people who have loads of money.  Their premiums are going to, on average, double or better. I mentioned  a retired mental health counselor yesterday. She…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695927/government-funding"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…officials to become engaged. He  devoted his life to improving our community, to strengthening public  health and public safety, and to creating new opportunities for all  Rhode Islanders to thrive. He made significant strides toward improving  the lives of working Rhode Islanders, and he is credited with  spearheading efforts to preserve pensions and raise…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691451/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…Rhode Island State Police  have answered the call through hurricanes and blizzards, working on the  highways, in cyberspace, and undercover, always committed to keeping  Rhode Islanders safe.\n\nEstablished in 1925, the Rhode Island State Police was a new type of  police force. They were tasked with reaching and serving the areas that  were often underserved…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689770/hands-off-social-security"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…kilowatt hour into a market where the prevailing  rate is 18 cents. So if President Trump and his minions at Interior and  EPW and Energy can stop that plant, they are making Rhode Islanders,  New Englanders, buy 18-cent power instead of 9-cent power. So that  raises the price for everybody.\n\nBy the way, for those of you who are listening, the ISO grid, like…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699019/energy-costs"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…wage and for specific projects that would  create union, family-supporting jobs. He also led the charge to  eliminate lead pipes, making our tap water safer to drink for Rhode  Islanders.\n\nAmong his many accomplishments was his work to address the State's  opioid crisis. He created a fund to support statewide opioid treatment,  recovery, prevention, and…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691447/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…opposed to our own; and while he is doing that,  China is launching into a new age of relatively cheap energy that will  power their data centers and their infrastructure.\n\nRhode Islanders deserve infrastructure that creates good jobs;  provides affordable, clean power; increases our energy independence;  and reduces climate-destroying greenhouse gases in…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696129/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…$2 trillion  for people making more than $500,000 a year.\n\nHow are they going to pay for it?\n\nBy cutting Medicaid.\n\nThat is healthcare for 77 million Americans, 80,000 Rhode Islanders,  including seniors, children, and people with disabilities.\n\nNursing homes and community health centers all across this country  will shut down.\n\nIt is not just healthcare.…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688097/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions-and-providing-for-consideration-of-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}]