[{"senator": "Eric Swalwell", "party": "Democrat", "sentence": "…she was named  Senate District 10 Woman of the Year by Senator Bob Wieckowski and also  contributed her expertise as a member of Assemblymember Anthony  Rendon's State Blue Ribbon Commission on Early Childhood.\n\nIt is my honor to recognize Parvin Ahmadi for her decades of service,  leadership, and enduring impact on public education. Her legacy is one…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691728/recognizing-parvin-ahmadi"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "Mrs. BEATTY. Mr. Speaker, I rise today proudly to enter into the  Congressional Record that the Ohio State University Wexner Medical  Center cut the ribbon and opened the University Hospital today with 820  large private rooms sitting 26 stories high.\n\nMr. Speaker, I thank the Ohio State University's president, Ted  Carter, and…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698915/congratulating-dr-john-j-warner"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…Rickwood Field. The game will pay tribute to the Negro  leagues and honor Birmingham's important contributions to baseball  history.\n\nThis year, we will also celebrate the ribbon cutting of the newly  refurbished Willie Mays Park in Fairfield, Alabama. Thanks to the  generosity of Major League Baseball and the extraordinary efforts of  State Senator…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692430/2025-juneteenth-major-league-baseball-events-in-birmingham"}, {"senator": "Marc Veasey", "party": "Democrat", "sentence": "Mr. VEASEY. Mr. Speaker, I rise to recognize the Leadership and Staff  of JPS Health Network.\n\nOn the occasion of the ribbon-cutting ceremony for the new  Psychiatric Emergency Center, I extend my deepest congratulations and  recognition on behalf of the people of the 33rd Congressional District.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695126/recognizing-jps-health-network-for-the-opening-of-a-new-psychiatric-emergency-center"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…Vietnam war,  serving as an infantry rifle platoon commander and a regimental sniper  platoon commander, as well. His service earned him both a Bronze Star  and a Combat Action Ribbon, as well as the respect of the marines he  served with.\n\nOver his 30 years of service, General Lopez served in a number of  critical leadership roles, including as a company…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697745/brigadier-general-frederick-r-lopez-post-office-building"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…Center, and to commend the district's leadership for their unwavering  commitment to supporting students and families in need.\n\nLast week, I had the honor of attending the ribbon-cutting ceremony  for this Center, which will serve as a vital resource for students and  their families who are experiencing homelessness, financial hardship,  or foster care.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695914/congratulating-the-moreno-valley-unified-school-district-health-and-wellness-center"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…26 years in the U.S. Army, earning  numerous military decorations including, but not limited to, the Army  Commendation Medal, Iraq Campaign Medal, NATO Medal, Army Service  Ribbon, and Overseas Service Ribbon. These honors stand as a testament  to Mr. Tarr's unwavering dedication to his fellow Servicemembers and  our great Nation.\n\nAfter retiring from…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696875/recognizing-mr-michael-tarr-on-being-named-marquette-county-veteran-of-the-year"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…distinguished  service, Ralph has received the Meritorious Service Medal, the Southern  Philippine Islands Campaign with one Bronze Star, the Philippine  Liberation Medal and Ribbon with one bronze Star, and many more  commendations.\n\nIn addition to his military service, Ralph has continued to be a  fierce advocate for American values and a dedicated community…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690225/recognizing-congressional-patriot-award-recipient-ralph-odell"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…nurse's calm demeanor, holding the line not with  a rifle but with a lifesaving skill and unwavering resolve.\n\nShe earned the World War II Victory Medal and the American Theater  Ribbon, continuing her service to our Nation until her medical  discharge in 1953.\n\nAt 106 years young, Hazel is not a page in our history book. She is a  living chapter of American…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699733/happy-106th-birthday-to-hazel-womble"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…Maine,'' with handsome homes, churches, and  schools. Education remains a center of community life, with the high- performing Strong Elementary School being named a National Blue Ribbon  School.\n\nFrom the American Revolution to our time, Strong has always been a  town of patriots, with a veterans memorial paying tribute to those who  defend freedom. Among…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699397/225th-anniversary-of-the-town-of-strong"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…steadfast advocate for  small businesses, providing valuable resources and opportunities in the  areas of advocacy, visibility, networking, and growth. Signature events  such as ribbon cuttings, community festivals, and live music nights not  only highlight the exceptional talent and variety of local enterprises  but also strengthen the bonds among neighbors,…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692437/recognizing-the-75th-anniversary-of-the-orion-area-chamber-of-commerce"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…and widows of the fallen. The       reverse of the medal is sandblasted and bears an engraving of       the names of the fallen heroes. The medal is suspended from a       ribbon, either Azure or Gules depending on the fallen hero       being honored. The ribbon bail is prepared and attached by       hand soldering to the back of the medal. The medal…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699505/medal-of-sacrifice-act-of-2025"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…Medals, the National Defense Service Medal, the  Afghanistan Campaign Medal with one Bronze Service Star, the Global War  on Terrorism Service Medal, the Sea Service Deployment Ribbon with one  Bronze Service Star, and the Presidential Unit Citation.\n\nFollowing his honorable discharge in 2023, Mr. Moceri returned to  Michigan and continues to serve his community…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699292/recognizing-united-states-marine-corps-veteran-domenico-s-moceri"}, {"senator": "Barry Moore", "party": "Republican", "sentence": "…the Navy has shown his bravery, dedication, and  deep love for his country. Throughout Mr. Hudson's military service, he  has had the honor of receiving the Asiatic-Pacific Ribbon, a  Commendation by Captain Strauss of the U.S. Navy, an American Campaign  Ribbon, and a Victory Medal.\n\nI would like to wish Mr. Milton Hudson a Happy 98th Birthday and…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690789/recognizing-the-accomplishments-of-milton-hudson"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…Biden administration ``exported their  environmental guilt.''\n\nIn my hometown, the Duluth Transit Authority bought electric buses in  2018. It was a big event. There was a ribbon cutting and all the  leaders were there. What they didn't tell you was that in short order,  Madam Speaker, they had to add diesel-generated heaters to those  electric buses…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690472/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…for  generations or Americans who came here seeking refugee from, for  example, Ukraine.\n\nHow many of my colleagues come to the floor of the House wearing a  blue and yellow ribbon or a blue and yellow pin? They wear it for show,  and they wear it to pat themselves on the back. They wear it to seem  like they are the ones with a heart when other people…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695203/people-are-sick-and-tired"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…enforcement. His actions not only protected a life that day  but also set a standard of excellence for his department and  colleagues.\n\nHe was rightfully honored with the lifesaving ribbon commendation bar  by Sheriff Carl James. We are beyond grateful for his bravery and  service to the Ware County community.", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688323/recognizing-hunter-thomas"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…numerous personal decorations,  including the Meritorious Service Medal, Joint Service Commendation  Medal, Navy and Marine Corps Commendation Medal, and the Combat Action  Ribbon, among other service and campaign awards. He is also authorized  to wear the Navy and Marine Corps Parachutist Insignia.\n\nAfter 30 years of faithful and honorable service,…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693985/recognizing-united-states-marine-sergeant-major-timothy-babcock-as-august-2025-veteran-of-the-month"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…electricity that was there for plants that were opened  which have not met their full expectation or life cycle.\n\nFor example, there is a facility in my district that I went to the  ribbon cutting on in 2012 that Democrats in the Commonwealth of  Virginia, including some of my esteemed colleagues on the other side  from that great Commonwealth, thought it was…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694880/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…where he led Gilbert Elementary to national recognition by establishing  Georgia's first public school forest kindergarten and earning U.S.  Department of Education Green Ribbon status. Beyond his work in public  education, Mr. Harris has private-sector experience as a businessowner  and operator.\n\nIn his new position, Mr. Harris is charged with advancing…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697167/recognizing-matt-harris"}, {"senator": "Carlos Gimenez", "party": "Republican", "sentence": "…Nation with a  total of 51 National Academy Foundation distinguished career academies  and 3 model career academies, and numerous schools have been designated  as National Blue Ribbon Schools of Excellence.\n\nFor the 41st consecutive year, the district was awarded the  certificate of excellence in financial reporting by the Association of  School Business…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696910/congratulating-st-theresa-catholic-school"}]