[{"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…job getting that for your community--but it was also       illegally and arbitrarily canceled last month.\n\nNow Republicans like that congressman from Oregon want to       get rid of the program entirely. To me, the conclusion is       clear. Republicans are willing to withhold nearly $40 million       from one congressional district alone, from his own…", "date": "2025-07-09", "source_url": "https://justfacts.votesmart.org/public-statement/1693322/greenhouse-gas-reduction-fund"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…the Office for Civil  Rights and closing more than half of its regional offices.\n\nDonald Trump also says he wants to shut down the Department but keep  its  core functions. Get rid of the people with expertise and give the core  functions to other agencies without the expertise or the staff to  handle them? That is not government efficiency. It is absurdity.…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689037/majority-of-americans-support-department-of-education"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…Do my colleagues want a situation where the  Democratic majority can look at rules we don't like in red States and  say with a simple vote--majority vote--we are going to get rid of them?  we don't like your rule on mifepristone? we don't like your license for  natural gas? we don't like something your State likes, and therefore we  are going to legislate…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691582/hj-res-88"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…the Education Department's staff, as part of  an all-out assault on the Federal support for public education in our  country. If President Trump had his way, he would just get rid of the  Federal Department of Education altogether, but since only Congress can  do that, they did things like firing half of the staff.\n\nNow they are coming after programs…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696175/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…last minute, Republicans added a  provision that says any project that doesn't break ground within 60  days of this passage will lose the entire tax credit.\n\nThat is getting rid of the tax credit. No project can start in 60  days. That is  not how it works. They know that. They know that the clean energy tax  credits are popular. They know that the…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691671/budget-reconciliation"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…ideas were to extend the tax credits, which is  the quickest and easiest way to make sure that Americans don't see  those skyrocketing plans.\n\nInstead, they want to maybe get rid of the Affordable Care Act. They  want people to be forced into junk plans, which could force Americans  into bankruptcy. By the way, Trump made sure that if you don't pay your…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697852/providing-for-consideration-of-hr-promoting-efficient-review-for-modern-infrastructure-today-act-providing-for-consideration-of-hr-increasing-investor-opportunities-act-providing-for-consideration-of-hr-electric-supply-chain-act-providing-for-consideration-of-hr-state-planning-for-reliability-and-affordability-act-providing-for-consideration-of-hr-improving-interagency-coordination-for-pipeline-reviews-act-providing-for-consideration-of-s-disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-and-for-other-purposes"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…means that if a business needs to  replace these units anytime in the next couple of years, the products  on the market now will be available to them. They don't have to get rid  of the refrigerators they want. It is when they buy a new one.\n\nWhenever a business does need to replace the units, the products on  the market will save them money. Specifically,…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689263/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…and blackmail. It is impossible not to be ashamed by what is being done  in the name of America.\n\nPutin would like nothing more than to cause internal chaos in Ukraine  and rid Kyiv of Zelenskyy. Trump is following suit. Zelenskyy is  absolutely right when he stated that Trump is living inside a  disinformation bubble.\n\nAt the root, Trump's policies…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688107/marking-third-anniversary-of-unprovoked-russian-invasion-of-ukraine"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…immigrants--immigrant crackdowns in  Virginia and elsewhere. And the claim of the administration and many  who support it is that this is because of a desire to protect Americans  and rid American streets of criminals.\n\nI maintain that President Trump has, instead, demeaned and  dehumanized immigrants and their countries of origin since day one of  his political…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699611/9999"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "…speech on affordability with lots of good ideas on how  to make stuff cheaper. It says it right there: Lots of good ideas on  how to make stuff cheaper.\n\nGood idea number one: Get rid of tariffs, which are a tax on bananas,  coffee, vegetables, pasta sauce, pasta, televisions, automobiles, and  burgundy, a fine French claret for my Republican friends over…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697156/denouncing-the-horrors-of-socialism"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…merit.\n\nSome of these rollbacks, Mr. Speaker, are terribly awful, but some of  them seem like they are just torn from a law textbook. Seriously, the  administration wants to get rid of the minimum lighting standards for  construction sites. Let me say that again for the public who may be  watching. This Trump administration wants to get rid of the minimum…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695577/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…go to construction sites and we're going to  just like tackle people at construction sites, I don't think anybody  would have signed up for that.\n\n``They said, we're gonna get rid of the criminals and the gang  members first.''\n\nRight? That is crazy.\n\nIt is crazy because the reality of the situation is that ICE is not  going after violent criminals. They…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692896/condemning-violence-by-ice"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…rates,  short-term interest rates.\n\nWe cannot allow the President of the United States to own, dictate,  and tell the Federal Reserve what they can and cannot do. If he gets  rid of Lisa Cook, he will have control of the central bank.\n\nWhat he will do is insist on interest rates going down, but what  people do not understand is this will cause inflation…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694804/in-defense-of-lisa-cook"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…actually a  good thing and are in our public interest: For our economy, for our  national security, and for the communities that we here represent.\n\nAll this bill does is get rid of all of that and say we don't care  and we should export whatever we want to China or whoever else. The  American people are tired of these antics. They don't have time for…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697094/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…insufficient.\n\nWe have had one current Member of the United States Senate, a  Republican, who has declared that what we need to do, he insists, is to  ``pull it up by the roots and get rid of it'' with reference to Social  Security.\n\nProviding modest retirement, disability, and retirement benefits to  69 million Americans, Social Security is what puts food in…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698920/ending-improper-payments-to-deceased-people-act"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…who came  here illegally.\n\nI think it is important that we educate the American public on that  because we are soon going to have to start the next phase where we not  only get rid of the criminal element that came in here, but we have to  get rid of the 10 million people who may not have broken a horrible law  but broke the law just by coming here.\n\nIt…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690195/wisconsin-in-the-news"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…the work of that today. We are taking price  concerns off of the back of industries. We are preserving jobs. We are  creating a brighter future for our communities by getting rid of this  eleventh hour rulemaking that was put forward by the Biden  administration.\n\nThey had all the power to make this country move in the right  direction when Democrats…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688464/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing-and-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…started out in my office as an intern. He liked it so much he  decided to come back as an intern four more times. No matter what we  did or how hard we tried, we just could not get rid of him. I am  incredibly thankful that he stuck it out because this entire body has  benefited from his public service and his expertise.\n\nJack has come a long way from his…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692224/designating-the-house-press-gallery-in-the-united-states-capitol-as-the-frederick-douglass-press-gallery"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…can't give you an honest answer. We know that, for  years, I have been trying to fix technology at the IRS, and the IRS  union loses its mind thinking: You are trying to get rid of us.\n\nWhen we have been doing the audit at the Pentagon, the unionized  auditors come and want to have meetings with me. They are concerned  that we are trying to get rid…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698698/congress-is-a-math-free-zone"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…limits by overly  enhancing the concentration of THC in their products. The hemp  industry, myself, and others have come together, and we have been  willing to negotiate to get rid of the bad actors. Yet, instead, we are  met with legislation that would be prohibition.\n\nMembers of the industry, myself, and others who are advocates of this  have been willing…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696661/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Darrell Issa", "party": "Republican", "sentence": "…President has the right to  dismiss probationary employees, even though an activist judge stayed  that and said that he didn't have that right, that somehow everyone  else can get rid of probationary employees, including the last  administration that summarily dismissed immigration judges on the last  days of the probationary period, and did so without seeing…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689711/no-rogue-rulings-act-of-2025"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…get out of the  business of discriminating against people who are married with  children. I sure hope that this body, when we finally deal with the  reconciliation bill, gets rid of these perverse antimarriage  incentives.", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689925/perverse-incentives-of-our-welfare-state"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…The Trump administration is also prioritizing the deportation of  Afghans who are already here illegally. You know, I am 100 percent  behind President Trump's effort to get rid of all Islamists who hate  our country, as I just previously said, take advantage of the system  when they come here. Don't defraud our government. Don't come here to  try to…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697927/immigration"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…coming weeks for saying, allegedly, I want to have taxes go up, I am  emphatically for cutting taxes. I would like to zero out the tax code,  eliminate the income tax, and get rid of the IRS. I would like to do  all of those things, and I have legislation to do it.\n\nI will vote for tax cuts, but I refuse to ignore math. If you are  going to do a certain…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690594/fiscal-responsibility"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…dictators.\n\nIt is interesting because, for years, Democrats were for holding  Maduro accountable. Senator Chris Murphy, a Democrat from Connecticut,  tweeted in 2019 that ``getting rid of Maduro is good for the United  States.'' That is one of the Democrats who are opposing what the  President of the United States has done. He called for it in the past.\n\nSenator…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698571/venezuela"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…million an hour.\n\nMr. SCHWEIKERT. The borrow is $250 million every hour. Watch out for  the scam artists who play the game. They give you something that is  outrageous. Okay. Get rid of it. Yet, sometimes the things that we will  debate for hours here are minutes or sometimes seconds of borrowing.\n\nMr. SCHWEIKERT. Yet, the big stuff, since there are so many…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690586/economic-anxiety"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…you have got to stop protecting incumbent business models  that are terrified of having cures, solutions, better and faster ways  to do it, and the use of technology. If we get rid of that fear and  start doing what is moral and economically rational around here, we are  in the time of miracles.\n\nMr. Speaker, I am going to let you go back to your lives.…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698412/fun-with-math"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…building.\n\nDonald Trump has done a great job of trying to remove the diversity,  equity, and inclusion from our government, including our military. We  have, to a degree, gotten rid of some of the bureaucrats who pushed  this odious ideology in our businesses and our schools.\n\nNevertheless, these bureaucrats everywhere are waiting to gain a  foothold in…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689133/educating-young-people"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…There are  multiple criminal investigations going on at the Department of Justice.\n\nI keep approaching the Medicare Advantage companies, saying to work  with us. Could we get rid of the way we do risk scoring, the way we do  these star ratings, where you use those things to pump up your  compensation, and actually do it from enrolling? Let's get the…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699988/math-is-such-an-anathema"}, {"senator": "John Rutherford", "party": "Republican", "sentence": "…enforcement officers that are  deporting dangerous criminal aliens out of our communities.\n\nMr. Speaker, this bill gives TSA the resources to keep the flying  public safe while getting rid of wasteful programs like VIPR.\n\nIt supports CISA, the Cybersecurity and Infrastructure Security  Agency, which is securing vital infrastructure from adversaries like  China.…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699353/department-of-homeland-security-appropriations-act-2026"}]