[{"senator": "Al Green", "party": "Democrat", "sentence": "…someday in this near future, in my lifetime, this dastard will  be impeached. I guarantee you this, the Record will show that at least  one Member, one Member, stood right here in this House and read  Articles of Impeachment to remove this dastard from office for the  racism that he perpetrates and perpetuates.\n\nFor edification purposes, those who tolerate…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700075/black-history-stolen-legacies"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…the entire game.  Now, tell me,  how does a player so dominant in the lane never draw contact? Because  she was erased from the whistle.\n\nLet me just say it out loud right here from the House Chamber: The  WNBA wanted the Liberty to win--a big market team, superstar faces, a  tidy storyline for the league office and the league commissioner, who  literally…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693881/taking-on-wnba"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…learned of this, they were as surprised as  most all of us that were here in this Chamber. Our House colleagues did  the right thing. They quickly and unanimously--that is right, the House  unanimously--that doesn't happen a lot--the House unanimously, 426 to  0, passed a bipartisan bill to repeal this provision because they knew  it was wrong.\n\nWe should…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699110/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…discovered that the  husband of a member of leadership on the opposite side of the aisle had  been trading in stocks, while we are considering a stock trading ban  right now in this House. This is corruption in action.\n\nWe have a judiciary across the street who is considering undermining  the fundamental voting rights of the American people.\n\nAfter…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699236/restoring-election-integrity"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…against the bill had he known it was in the bill. I  can't make this stuff up.\n\nAnother conservative Republican colleague from Pennsylvania tweeted:  ``Elon Musk is right to call out House leadership. I wish I had a  nickel for every time the House Freedom Caucus sounded the alarm and  nobody listened, only to find out the hard way that we were right…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691944/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…rewrite the history of that horrible day. Congress must  show respect for those who defended democracy, liberty, and Article I  of the Constitution of the United States right here in the House of  Representatives, defending the vote that occurred in 50 States across  this union. We owe them that memorial.", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698548/january-6-attack"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "…with  the Protecting Families From Inflation Act. It is my very first bill.  It makes progress on my top priority, lowering costs for my  constituents.\n\nI am calling right now for the House to show they are serious about  lowering costs and taking up and passing this legislation.\n\nMs. BYNUM. Mr. Speaker, what decorum did I break? I apologize.\n\nMs. BYNUM.…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689333/lowering-costs-for-struggling-americans"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…concerns, Republicans voted to  block this reasonable inquiry from a regime that seems to thrive on  secrecy.\n\nThis vote follows a troubling pattern that occurred right here in the  House when rules were adopted to block a resolution of inquiry that I  and other Members had to ask for this data from the administration.\n\nTwice now, Republicans have adopted…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698920/ending-improper-payments-to-deceased-people-act"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…would be discussed and fleshed out  if you took the time to have a hearing and have a little bit of  deliberation instead of jamming a CRA like this, a blunt instrument,  right on the House floor.\n\nIf the intent is truly about preserving access, there are better ways  to do it. There are certainly much better ways for Congress to uplift  and support our…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690404/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…opposition to H.R. 2483, legislation that  reauthorizes the SUPPORT for Patients and Communities Act.\n\nLast Congress, this bill passed with strong bipartisan support right  here on the House floor under suspension of the rules. Today it is  coming up under a rule because a lot has changed since last year. There  is a new administration, and the Trump administration…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691876/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…of the American people.\n\nIn the spirit of John Lewis: ``Show up, stand up, and speak up for  what we know is right.'' It is an immoral document that we are debating  right now in the House of Representatives.\n\nThis budget also represents an attack on the Affordable Care Act. For  some reason, Republicans have been obsessed, Mr. Speaker, with  attacking…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…``no'' vote, but she pointed out the choice  that Members have.\n\nI agree with her. Members have a choice here. Those who didn't like  this bill have a choice to stop it right here in this House.\n\nSo to all of the Republicans who said they regret voting ``yes'' for  this reconciliation bill, especially those who complained about how  much this will add trillions…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692385/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Byron Donalds", "party": "Republican", "sentence": "…action, keeping the African-American community informed during  Reconstruction after the 13th, 14th, and 15th Amendments. He spent  countless hours writing and studying right here in the House Press  Gallery. Even after his tenure in the gallery, he often would return to  the Capitol.\n\nCongress has honored Douglass with a portrait and plaque in the  gallery…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692222/designating-the-house-press-gallery-in-the-united-states-capitol-as-the-frederick-douglass-press-gallery"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…by the end of this budget window. That  is it. If we fail, then debt will go up a little higher.\n\nWe have an obligation to do better. Everything we are fighting for  right now in the House is for crumbs. I haven't decided whether I will  vote for it or not vote for it. Why? Because I am one vote. Out of 220  Republicans, I am one vote, and I have to figure…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690594/fiscal-responsibility"}]