[{"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…water pump, our adversaries are buying influence, forging  military alliances, and rewriting the rules of global engagement.\n\nThis is not theoretical. This is happening right now. Let's take  Africa, for example, a region poised to become one-quarter of the  world's population. U.S. assistance has helped build stability there  through nutrition programs,…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692541/rescissions-act-of-2025"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…land, water, and air for all, Elon  Musk and EPA are giving Donald Trump's big polluters a carte blanche to  trash the planet--no exaggeration, really. I mean, come right down to  it. Let's call it for what it is. The administration is running  roughshod over our Federal environmental protection laws, writ large.\n\nI am going to focus today, as I mentioned…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689118/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…beauty of America that Alex Padilla could end up here, by  dint of his brilliance and his integrity and his compassion. And all of  that is at risk. All of that is at risk right now if we let the abusive  handling of this good man and so many other good men and women around  the country--if we let this go without our firmest opposition, without  our strongest…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692501/alex-padilla"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…arrange  care for her son and make sure that he keeps receiving the medical  treatment that he desperately needs.\n\nYet, Trump's police said: No. They denied this basic right. They  would not let her call her family, nor her lawyer. As a result, her son  no longer has access to his lifesaving cancer treatment.\n\nIt is a confounding degree of evil that we are…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690506/trump-immigration-policies"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…another polling number out there. Mr. Speaker, 90 percent of Americans  support universal background checks. If that is the standard, let's  pass a universal background check right now. Let's save lives from  senseless gun violence.\n\nRepublicans say that this bill will stop noncitizens from voting, but  as the ranking member from the Rules Committee pointed…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699937/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…sincere hope is that this is not the final product. This  bill needs more work across Chambers and is not ready for the  President's desk. We need to work together to get this right.''\n\nLet me get this straight. I think the number was 16 House  Republicans, Mr. Speaker, vote for a bill that they know will hurt  their communities, Mr. Speaker, that they represent.…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…amendments that said let's make it illegal, let's make a ban on  deporting American citizens. Every Republican on both committees voted  against that ban. That is where we are right now.\n\nLet me talk a little bit about tariffs. The President promised to  make our lives more affordable. He said America was too expensive. Yet,  his tariffs have sent the Nation…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690639/trumps-first-100-days"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…America.\n\nThis is not a partisan issue, my friends. There are a lot of things  that we can be partisan about. This isn't one. We only have a few days  left to get this right. Let's not let the American people be the  sacrificial lamb over some undisputed political battle among parties.  Let's not let a person in the White House who seems to care about…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698226/healthcare-affordability-crisis"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…truth: Every child, no  matter their disability or ability, has the right to a  free and appropriate public education; not as charity, not as an  afterthought, but as a civil right.\n\nLet's be honest. That promise has never been self-executing. Making  IDEA real has required vigorous Federal oversight, strong civil rights  enforcement, litigation when necessary,…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698942/protecting-education-for-children-with-disabilities"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…essentially breaking the law.\n\nGive them the other option. Mr. Employer, fire those undocumented,  and guess what? They will go out of business. That is the scenario we  have right now.\n\nLet me conclude by telling a story about my district, as well. Mr.  Barranco, 25 years in this country, not a traffic ticket to his name,  was at the Home Depot doing what…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695362/stop-illegal-entry-act-of-2025"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…more than 200 rural hospitals have closed their doors since  2005. Over 450 more are currently at risk of shutting their doors.\n\nThis isn't hypothetical. It is happening right now. Let's be clear:  When these providers and hospitals close their doors, everyone in those  communities, including, by the way, some Members of Congress and their  families,…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691418/gop-tax-scam-hurts-everyone"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…background checks, closing  loopholes, and a ban on assault weapons because our lives and our  children's lives depend on it.\n\nThe time for reform is now. Let's do what is right. Let's do what is  just. Let's do what is necessary before another name is added to  another list.", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691751/national-gun-violence-awareness-month"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…concerns. However, the focus of our hearing is  going to be on the upside. It will be on the tremendous potential, the  boundless opportunities that AI--even as it exists right now, let alone  what its capabilities are going to be in a matter of weeks, months, and  years, the unbelievable opportunities to close achievement gaps and  advance student achievement.…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689211/protecting-medicaid-for-californians"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…There are no  tanks on the ground in Caracas. There are no snipers in the tree line.  It doesn't exist. Again, we are not at war.\n\nMaybe they are conferring about that right now. Let me confer with my  colleagues a minute.\n\nAre we at war?\n\nI confirmed with my staff we are not at war.\n\nAre there any troops on the ground?\n\nI confirmed with my staff also…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699364/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…making fun of us. I understand it is good  politics. You get to go home, get in front of the audience that is not  reading the Economic Press and say, they didn't get the it right. Let's  treat our voters like they are adults. They understand what is going  on.\n\nThese are the scores from Yale Budget Lab, from Penn Wharton, from  Congressional Budget Office,…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693062/stop-bathing-in-folklore-and-start-bathing-in-math"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…the math for you and everybody in  this room. One illegal vote is one too many. Let's pass the SAVE  America Act now, and let's save voter integrity and voter elections  right now.\n\nLet's do it, Mr. Speaker.", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699999/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "James Risch", "party": "Republican", "sentence": "…would do, and that is to keep them safe.\n\nNow, Democrats are reversing their position on Maduro's removal to  criticize the President.\n\nThe President's decision was the right call. Let's acknowledge that  fact. Let's celebrate that fact. Let's resolve that the President of  the United States is to be commended for what he did.\n\nMy fellow Senators, vote…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698707/venezuela"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…system that no  longer imports people into our country who want to undermine it.\n\nWe can provide healthcare freedom, and we can balance the budget if  we act and we lead. Right now, let's secure our country. We can do it  this year. That is our calling.\n\nWe are not here to get re-elected. We are here to deliver for the  American people.\n\nMadam Speaker,…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…and processing here in the United States of America. I am  going to go directly to my good friend and colleague from New Mexico to  help sponsor that with me because she is right. Let's do it here. Let's  mine here, Mr. Speaker. I am going to give her and my friends across  the aisle that opportunity very shortly.\n\nThe fact of the matter is, we have the…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699694/critical-mineral-dominance-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…start thinking about those policies  that get the economy working, a tax code that actually gets investment  in the next generation. But are we going to adopt policies?\n\nAll right. Let me go jump on a landmine.\n\nDoes it make sense to have a government that goes out and owns 10  percent of Intel? So your government is the largest shareholder of  Intel.…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697051/facing-fiscal-reality"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…priorities, and  that is to secure our elections and to make sure only citizens vote.  That is not controversial. That is the standard voters are demanding.\n\nLet's do what is right. Let's pass this rule and move the bill  forward.\n\nMr. ROY. Mr. Speaker, I would note that when the gentleman from  Massachusetts tries to dismiss the supposed trivial or anecdotal…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699943/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…up every day and going to work  to protect our country and protect travelers. We have to figure this  out.\n\nSo we have two issues. One is, let's solve the immediate one right  now. Let's actually get the government back open, and let's actually  get people paid.\n\nMy Democratic colleagues have demanded that we have body-worn cameras  on ICE agents. We…", "date": "2026-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1700299/government-funding"}]