[{"senator": "Al Green", "party": "Democrat", "sentence": "…to be where he was and to speak on the  issues of importance to him in ways that I might not agree with, but he  had a right to do this.\n\nHe had a right to life. He had a right to say these things in venues  across the length and breadth of this country and, I would say, across  the globe. These were his rights.\n\nHe had the right to be where he was and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695338/dark-days"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…what the Constitution represents. It means,  defend your Fifth Amendment rights, right to due process, 14th  Amendment also, defend your right to free speech, defend your right to  say that members of the military don't have to follow illegal orders.  In fact, they must not follow illegal orders. That is what he is  talking about. That is the Constitution.…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698076/liberty-and-justice-for-all"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…that prior  to the election of Donald Trump in 2016, neither of us thought that our  paths involved eventually getting to Congress or certainly being in  this moment here right now.\n\nI say that because both of us spent our careers, before getting into  Congress, building and deploying clean energy, building and deploying  low-cost, affordable energy. If…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700229/winners-of-the-global-energy-race-are-being-decided"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…Constitution. He took an oath to preserve, protect, and defend the  Constitution. He disrespects the Constitution.\n\nHe disrespects the notion that a person should have the right to say:  You have the wrong person; and to say to the authorities by way of The  Great Writ: You have the wrong person; to say to the authorities by way  of the Fifth Amendment…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690862/and-still-i-rise-impeaching-president-trump"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…it  in the Executive, proceeding to spend money wherever he wants.\n\nThat $20 billion, I would love to see--I am not being coy. I would  rather have all of the Senators right here and say: Let's pass a bill  right now and say ``hell no.'' You know, a lot of that $20 billion is  going to the debt that has been built up in Argentina, and friends of  President…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…like NPR should be  defunded. Remember, this is an outlet that believes writing articles  about fat phobia and queer animals constitutes serious journalism. They  have the right to say whatever they want to, but they do not have the  right to our tax dollars.\n\nTo my colleagues who say that this is only a small part of our  budget, I would ask them what,…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692538/rescissions-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…started talking about Christmas.\n\nThe question for Republicans is: If not now, then when?\n\nWhen are we going to stand up and deliver for the American people?\n\nThat basic right--I will say it--right to access healthcare of our  choice without government interfering, without government regulating,  and without government stealing our ability to care for…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698106/bringing-america-back-to-its-roots"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…be ridiculed  and shamed.\n\nBusinesses have every right to protect their reputation, and schools  have every right to protect their children, but we should defend their  right to say what they will and trust that the vast majority of  Americans will see it for what it is.\n\nThere are only two ways to resolve our differences: There is reason,  and there…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695787/beating-heart-of-democracy-is-freedom-of-speech"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…these stories are actually someone  was giving a speech, and so the AI wrote a story. It is not actually  what was said.\n\nMy frustration with this is, I have Members here right now who say:  David, we are going to take in $300 billion in tariff receipts--customs  duties if you want to be accurate--next year. We are fine.\n\nOkay. Next year, we are borrowing…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695567/we-are-borrowing-a-second"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…Congresswoman let it slip. She said: If  you really want to negotiate the end of this shutdown, come see me.  Come see me.\n\nAnd I think any fairminded person has to look right now and say that  the two leading Members--the quarterback--the two leading Members of  the socialist wing of the Democratic Party--the quarterback is  Congresswoman Ocasio-Cortez,…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695979/government-funding"}]