[{"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…billionaires and large companies, but refused to extend the  ACA enhanced premium tax credits to help lower healthcare costs for  everyday people. Today, we have a chance to right that wrong and help  out our hardworking Americans.\n\nMr. Speaker, Republicans may not want to admit it publicly, but they  know that the ACA has resulted in historically low…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698589/providing-for-consideration-of-hr-breaking-the-gridlock-act"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…the Older Americans Act nutrition programs.\n\nProviding nutrition assistance to seniors is one of the most fiscally  responsible actions Congress can take, and it is also the right thing  to do. An entire year of meals costs about the same as a single day in  the hospital.\n\nUnfortunately, one in four Meals on Wheels programs around the  country have wait…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699732/nutrition-programs-for-seniors"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…accused and caused to be indicted a  United States Congresswoman for having the temerity to do her job by  being at an ICE facility to conduct oversight.\n\nHe has also violated the right to due process by dispatching armed,  masked, unidentifiable people, wearing plain clothes and tactical gear,  onto the streets of select American cities. They pull up on people,…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692929/holding-power-accountable"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…is  nowhere left to hide. Republicans ran on helping working people. They  ran on lowering costs. They ran on grocery prices and rent. What did  they do? They delivered all right--for billionaires and big donors.\n\nIf Wall Street wanted a tax break, it would get done in a nanosecond.  If Amazon wanted another loophole, it would materialize out of thin…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699220/providing-for-consideration-of-hr-supporting-pregnant-and-parenting-women-and-families-act-providing-for-consideration-of-hr-pregnant-students-rights-act-and-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "…of local residents and their elected  officials, while ignoring the real issues the rest of the country  faces.\n\nNearly 700,000 taxpaying Americans in D.C. deserve the same right to  self-governance as every other community including control over  criminal laws.\n\nDemocrats on the Committee on Oversight and Government Reform  strongly oppose this bill,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695593/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…economic  catastrophe warnings that are out there:\n\n[C]limate change could reduce the level of global GDP per       capita by 10-20%.\n\nThis is Fed Chair Powell. He is on my sheet right here: In 10 or 15  years, there  are going to be regions of the country where you can't get a mortgage.\n\nWhy is that? Because in those regions of the country you won't be…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697077/climate-change"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "Ms. BALINT. Mr. Speaker, I am a history teacher so I know that we  have to do everything we can to document what is happening right now  because we are at a very dangerous moment, and it requires courage from  every single one of us.\n\nHere is the truth of it: This national nightmare started with a  series…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691062/it-all-started-with-a-series-of-lies"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…college, the people who are  students who get pregnant, who have a tough decision to make, would  have all of the resources and support they need to make the decision  that is right for them.\n\nIt is not our job to tell a student what decision is right for them.  It is not our job to tell any high school graduate that they need to go  to college, right?…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699315/pregnant-students-rights-act"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…what decisions they make for  themselves. We talk about God. God gives us choice. God gives us choice  to make the decisions that we believe are best for ourselves. We have  no right to take those choices away from them.\n\nMr. Speaker, I ask every colleague on the other side of the aisle--I  have been there. I have had to make choices. Let's do the right…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699312/pregnant-students-rights-act"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…Keep SNAP and WIC Funded Act of 2025, which has the backing of the  entire Democratic caucus--the Democratic Members of this Senate.\n\nNow, we all know access to food is a human right. It is that simple.  And we are all fortunate enough to live in the United States of  America, a nation that is rich; it is abundant. A nation that is rich  in agricultural…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696457/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-record-of-decision-for-the-barred-owl"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "…only in the United States of America do we  now have college students who have survived not one but two school  shootings.\n\nThat is the reality for students at Brown University right now,  students like Zoe Weissman, who was a middle schooler at the school  next to Marjory Stoneman Douglas High School during the Parkland  massacre. Years later, she found…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698338/school-shootings-are-not-inevitable"}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "…minutes ago, finished a telephone townhall with over 5,000  people back home in New Jersey that joined up to try to figure out what  in the world is happening to our government right now, when they see  just this abdication of leadership from the White House to leadership  here in Congress, and to step up right now at a time of need. Thousands  of people…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695926/government-funding"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…again, the deep-seated racism at home,  paving the way for the desegregation of the Armed Forces with the  leadership from Ohio, setting a precedent for generations to come.\n\nRight in my district of Toledo, the legacy of the Tuskegee Airmen  lives on. The area around us in northern Ohio--Ohio is known as the  State of flight, and 58 of these brave aviators…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687895/black-history-month"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…and more than 200 rural hospitals have closed their doors since  2005. Over 450 more are currently at risk of shutting their doors.\n\nThis isn't hypothetical. It is happening right now. Let's be clear:  When these providers and hospitals close their doors, everyone in those  communities, including, by the way, some Members of Congress and their  families,…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691418/gop-tax-scam-hurts-everyone"}, {"senator": "Jared Moskowitz", "party": "Democrat", "sentence": "Mr. MOSKOWITZ. Mr. Speaker, I reserve the right to object.\n\nMr. MOSKOWITZ.  I am just curious, do you know when the Speaker of the House  will be putting forward a plan to keep Members safe?\n\nMr. MOSKOWITZ. Mr. Speaker,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695622/warning-about-suppressing-rights-on-constitution-day"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "…societal expectations, standing alone in the fields of  science and politics, to advocate for her convictions.\n\nHer unwavering commitment to change helped establish women's right to  vote and hold office in Utah, putting the State decades ahead of the  national curve, and then helped reestablish the right to vote when the  Nation caught up.\n\nHer statue…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689363/womens-history-month"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…should be very proud. We should celebrate  it and be proud of the men and women in uniform who made sure this was  successful. This administration had the courage to do what was right,  what needed to be done; and America, Venezuela, and the world are much  safer as a result of it.\n\nOperation Absolute Resolve was conducted for one reason: to bring to  justice…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698571/venezuela"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…authority, compliance with its laws,  acquiescence in its measures, are duties enjoined by the fundamental  maxims of true liberty. The basis of our political systems is the right  of the people to make and to alter their constitutions of government.  But the Constitution which at any time exists, until changed by an  explicit and authentic act of the…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700270/president-washingtons-farewell-address"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…I was down in Florida. I had an aunt and uncle-- the same thing. I called him up--the same thing. He can be a gracious  person.\n\nThe President, though, got it wrong. He was right in saying that I am  not running anymore. But the reason that I made the decision not to run  again--and I decided it was just easier to do it here versus answer the  callous…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699082/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Mike Johnson", "party": "Republican", "sentence": "…to Federal employees, and again to stall  flights and cancel airlines and do all the rest that they have done. We  are not going to let them succeed in that gambit. That is right.\n\nWhile the Democrats keep voting to shut the government down,  Republicans are going to vote to open it back up. We are going to get  the American Government running again…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696723/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…fentanyl into our country is by changing one part of fentanyl's  chemical structure to create fentanyl analogues. The cartels did this  in an attempt to evade our criminal laws.\n\nRight now, fentanyl analogues are considered schedule I substances,  but only because of a series of temporary scheduling orders, and that  order is now set to expire on September…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692345/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…narrative that  supporting illegal activity somehow gives them a moral high ground.  This, of course, is false.\n\nMr. Speaker, I am here to tell the American people that they are  right to expect secure borders. They are right to demand law and order.  They are right to be outraged that hundreds of billions of their  dollars have gone to illegal aliens and…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690711/outrageous-government-funded-incentives"}, {"senator": "Mike Crapo", "party": "Republican", "sentence": "…information that patients  need to make important choices about their own health but not to pull a  bill out of our committee when we are already working in committee to  get the right and most effective solution put into place.", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694206/military-construction-veterans-affairs-and-related-agencies"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…Baird), my friend.\n\nMr. GUTHRIE. Mr. Speaker, the Federal Register lists this class of  equipment, and the simple payback period in years is 93.9 for all  purchasers. I have it right here.\n\nMr. Speaker, as we have heard today, the Biden-Harris administration  DOE's final rule for commercial refrigeration equipment will have a  detrimental impact on small…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689129/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…Veterans Act.\n\nThis important legislation is a bipartisan effort to finally bring  the VA into the 21st century by changing the way veterans are notified  about their benefits.\n\nRight now, under current statute, veterans across America are left  digging through the mail, often intermixed with junk mail and other  notices that they may receive, just to find…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695436/delivering-digitally-to-our-veterans-act-of-2025"}, {"senator": "Michael Rulli", "party": "Republican", "sentence": "…They shut down coal plants. They put regulations on gas- powered generated plants, but then they say there is an electricity  problem.\n\nLet's talk about prices. In my district right now, eggs are $1.29. We  have chicken breast at 99 cents. In Trumbull County, we have gas at  $1.99. I have 45,000 jobs that I cannot fill.\n\nWe are on the ground. We are listening…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698567/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…this time, we do not waive any jurisdiction       over any subject matter contained in this or similar       legislation. The Committee on Agriculture also reserves the       right to seek appointment of an appropriate number of       conferees should it become necessary and ask that you support       such a request.\n\nWe would appreciate a response to…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691068/fire-safe-electrical-corridors-act-of-2025"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…allowed deadly fentanyl to flood into our communities,  killing over 100,000 Americans. Even worse, known gang members and  violent criminals from across the globe have walked right into our  country.\n\nBecause of the Biden administration's abject failure, innocent  Americans have been raped, assaulted, and murdered by illegal  immigrants who never should…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689862/providing-for-consideration-of-senate-amendment-to-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…overwhelming: over a million people detained,  families torn apart, entire communities forced into labor in factories  that feed global supply chains. Some of those goods end up right here  in the United States on our shelves and in our homes.\n\nThe No Dollars to Uyghur Forced Labor Act makes one principle clear:  Not a single American taxpayer dollar should…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690654/no-dollars-to-uyghur-forced-labor-act"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…much better that those five people might still be alive. I can  certainly say that justice would have been done.\n\nThis bill is a good first step. We need to do it. It is the right  thing.\n\nMadam Speaker, I encourage all of my colleagues to support it. Let me  just say, I hope we don't stop here. Let's put this on the President's  desk. Let's keep going…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695358/stop-illegal-entry-act-of-2025"}]