[{"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…clock on American history, to  redefine whose histories count, whose languages count, whose cultures  count, whose identities count, whose personhood counts, whose very  civil rights count, and who belongs in this great country.\n\nWe see it in this Chamber this week with a GOP that is trying to roll  back the voting rights of Americans across the country,…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689636/impact-of-trump-administration-anti-dei-actions"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…stand up for  the Constitution.\n\nPutin arrested Navalny's lawyers right on the eve of Navalny's trial.\n\nIn Venezuela, Maduro routinely harasses and detains lawyers--human  rights lawyers--because he knows those are the ones who will hold him  accountable.\n\nIn Tunisia, the regime stormed the offices of the bar administration  to intimidate the legal…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690111/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…holidays will erase American history because the people  of this country will not be silenced.\n\nWe will not allow this President to turn back the clock to take away  American rights. We will keep speaking, we will keep marching, and we  will keep fighting to protect our democracy because this is our  country, and we are not going back.", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690193/american-history"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…884--To prohibit individuals who are not citizens of the       United States from voting in elections in the District of       Columbia and to repeal the Local Resident Voting Rights       Amendment Act of 2022; H.R. 2056--District of Columbia       Federal Immigration Compliance Act of 2025; and S. 331--HALT       Fentanyl Act; YEA on Roll Call No. 162,…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692229/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…shamelessly use DHS as his own terror force,  Trump is only making visible what so many communities have already  known to be true: Terrorizing is the point. Violating our rights is the  point. Fear is the point.\n\nCreating a public enemy is meant to convince Americans to sacrifice  our freedoms for the promise of security. Let me be very clear. Nothing…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697453/fighting-dhs-immigration-raids"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…get  through this. Why are they doing it? Do you know what? They care about  the right of assembly. They care about the First Amendment. They care  about their constitutional rights. But the reason they are doing this  is they care about each other. That is who they care about.\n\nIn this U.S. Senate, our job is to care about every single American.  We have…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699407/9999"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…medical appointments and services, physical therapy,       and occupational therapy services, which keep me healthy       enough to [continuously]       contribute to disability rights advocacy across the state and       [the] Nation. In no uncertain terms, Medicaid's home- and       community-based services has repeatedly opened the door of       opportunity…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689543/h-con-res-14"}, {"senator": "Donald Norcross", "party": "Democrat", "sentence": "Mr. NORCROSS. Mr. Speaker, I rise today in support of H.R. 2550, a  bill that would restore collective bargaining rights for all Federal  employees.\n\nEarlier this year, President Trump launched one of the largest  attacks on labor in the history of the United States, on the working  people who…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697992/protect-americas-workforce-act"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…figure who has focused on organizing international and interfaith peace  conferences, challenging racism and religious fundamentalism, and  promoting religious freedom and human rights. He is also seen as a  global leader in championing environmental stewardship and has  organized several international summits to address ecological issues.  His accolades…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695391/welcoming-the-ecumenical-patriarch-bartholomew-to-washington-dc"}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "…fierce defender of democracy. I am sure he would want everyone here to  continue fighting like hell to stand up for those who cannot stand up  for themselves, to defend the rights of every American, and bring  accountability and transparency to power.\n\nEsophageal cancer is the fastest increasing cancer among American  men. It is also one of the deadliest.…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691833/gerald-e-connolly-esophageal-cancer-awareness-act-of-2025"}, {"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "Mrs. GRIJALVA. Mr. Speaker, I thank Congresswoman Hayes for her  leadership and advocacy.\n\nMr. Speaker, I rise today to speak in defense of one of the most  important civil rights laws Congress has ever passed, the Individuals  with Disabilities Education Act and to oppose the dangerous and  unlawful efforts to dismantle the Department of Education.…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698937/protecting-education-for-children-with-disabilities"}, {"senator": "Ilhan Omar", "party": "Democrat", "sentence": "…dignity of protection  that ensures that they can return home from work alive and uninjured.\n\nCongress must reject efforts that roll back the clock on worker  safety and labor rights.\n\nMr. Speaker, I thank Representative LaMonica McIver for hosting  tonight and for her leadership on this issue.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695573/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…were the northern border. What my community  and our community kept telling us back then during its creation,  literally, is they told us they are violating people's civil rights. We  do not feel safe with them in our community. People were jogging around  our parks and getting stopped to be asked what their legal status was.  They were militarizing…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699666/horrific-ice-abuses"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…applicability; (2) rules relating to agency       management or personnel; and (3) rules of agency       organization, procedure, or practice that do not       substantially affect the rights or obligations of non-      agency parties.\n\nFWS did not submit a CRA report to Congress or the       Comptroller General on the Barred Owl ROD. In its response to       us,…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693338/us-government-accountability-office-legal-opinion"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…the  enterprises of faction, to confine each member of the society within  the limits prescribed by the laws, and to maintain all in the secure  and tranquil enjoyment of the rights of person and property.\n\nI have already intimated to you the danger of parties in the state,  with particular reference to the founding of them on geographical  discriminations.…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700163/reading-of-washingtons-farewell-address"}, {"senator": "Anna Luna", "party": "Republican", "sentence": "…information and you will be under  surveillance, might I remind them that they actually all authorized the  reauthorization of FISA, unreformed, that violated our constitutional  rights.\n\nThis is pretty simple. If you are not an American, Mr. Speaker, then  you do not get to vote in our elections. This not a free-for-all  country. A majority of Americans support…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700010/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…charitable donations, or even cut off  access to our own money if it disapproves of our beliefs.\n\nAny digital dollar must reflect our values of privacy and our First  Amendment rights. This bill ensures our digital assets policy is in the  hands of the American people, not the administrative state. It protects  our values of privacy, individual freedom,…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693725/anti-cbdc-surveillance-state-act"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "Mr. GILL of Texas. Mr. Speaker, I rise in opposition to Democrats  trying to give voting rights to illegal aliens.\n\nMr. Speaker, once again, Democrats are taking the 20 percent side on  another 80-20 issue. The American people do not want illegal aliens  voting. They…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692317/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "Mr. KILEY of California. Mr. Speaker, for months, I have been warning  California's political leadership that our State is in violation of  Federal civil rights laws, with a policy that even Governor Newsom has  admitted is fundamentally unfair. That policy is one that allows for  biological males to compete in women's sports.\n\nToday,…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692907/warning-californias-political-leadership"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…their  survivors information throughout the VA claims process. It is important  for these notice letters to be understandable so that the veterans and  survivors know their rights and how to navigate the claims process.\n\nI am pleased to see that the VA has recently improved some of their  notice letters. However, hundreds of other VA letters are still…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689678/clear-communication-for-veterans-claims-act"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…prohibit individuals who are not citizens of the United       States from voting in elections in the District of Columbia       and to repeal the Local Resident Voting Rights Amendment Act       of 2022. All points of order against consideration of the       bill are waived. The amendment in the nature of a substitute       recommended by the Committee…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692263/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Oversight To Eliminate Communist  Teachings for Our Kids Act, in order to protect our kids and to protect  our country.\n\nThe Chinese Communist Party is responsible for severe human rights  abuses and the suppression of fundamental freedoms, with a long and  well-documented history of censorship, oppression, and disregard for  human rights.\n\nHowever, it is equally…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697530/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…democracies and semi- democracies like the United States, made of up of free people, of  capitalism, of free markets, of entrepreneurs, and of people who very  much value human rights and value the individual way, ahead of the  state. On the other hand, you have countries like China that are  communist. They are socialists. They are not free market or capitalist…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690343/9999"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…every member of law enforcement always get it right? No. They  are human beings. Do we have ways to go through and punish, rectify,  review, and ensure due process and that rights are protected? Yes.  Should we? Yes.\n\nI want to remind people these are not American citizens. These are  guests in our home who are abusing that invitation--or noninvitation…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…shall       convey the lands to buyer upon payment of the appraised       value.\n\n(c) Requirements.--Any conveyance under this section--\n\n(1) shall be subject to valid existing rights; and\n\n(2) shall be for not less than fair market value.\n\n(d) Payment of Fair Market Value.--The Secretary shall       determine the fair market value of the applicable…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691119/reversionary-interest-conveyance-act"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…determined by a survey satisfactory to the       Secretary.\n\n(c) Terms and Conditions.--The conveyance under subsection       (a) shall be--\n\n(1) subject to valid existing rights;\n\n(2) made without consideration;\n\n(3) made by quitclaim deed; and\n\n(4) subject to such additional terms and conditions as the       Secretary determines to be appropriate…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697754/dalles-watershed-development-act"}, {"senator": "Pat Ryan", "party": "Republican", "sentence": "…religions. Throughout his tenure, he has remained on the  forefront of meeting the rising challenges our global community is  facing. Be it climate change, wars, violations of human rights, His  All-Holiness is undaunted and unwavering in his commitment to  alleviating suffering and championing justice.\n\nDuring this chaotic time in our world, and especially our…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695565/welcoming-ecumenical-patriarch-bartholomew-to-washington-dc"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…Investigative Service;\n\n(3) external resources for--\n\n(A) wellness support;\n\n(B) work-life;\n\n(C) medical services; and\n\n(D) support relating to behavioral health, civil rights,       sexual assault, and sexual harassment; and\n\n(4) cadet and officer candidate rights with respect to       reporting incidents to the Coast Guard Investigative Service,…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…America's veterans and separating servicemembers by preparing them for  meaningful careers, providing employment resources and expertise, and  protecting their employment rights.\n\nA ``yes'' vote on House Resolution 1032 enables us to consider  legislation that funds the Department of the Treasury's Office of  Terrorism and Financial Intelligence, a…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699590/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…(1) is transferred to the       Secretary.\n\n(b) Trust Transfer.--Not later than 180 days after the date       of the enactment of this Act, subject to valid existing       rights, the Secretary shall place the following land into       trust for the benefit of the Tribe:\n\n(1) The approximately 80 acres of land generally depicted       as ``BLM Land-Proposed…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697670/shingle-springs-band-of-miwok-indians-land-transfer-act-of-2025"}]