[{"senator": "Chuck Schumer", "party": "Democrat", "sentence": "We asserted our rights very simply to continue the legislative  process to allow time to reach agreement.", "title": "Stablecoins", "date": "2025-05-12"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "Today, I will vote to  defend the rights of the residents of D.C.--as I would my own  constituents--to ensure Republicans do not override these important  budgetary decisions enacted by the D.C.", "title": "Disapproving the Action of the District of Columbia Council in Approving the D.C. Income and Franchise Tax Conformity and Revision Temporary Amendment Act of 2025", "date": "2026-02-09"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "It protects students from racial and gender discrimination and  enforces critical civil rights laws.", "title": "President Trump's Proposed Department of Education Shutdown", "date": "2025-04-17"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "Instead, he was shielded by a nonprosecution       agreement that blatantly violated the rights of children, and       he was set free to continue abusing women in this country for       another 9 years before his death.", "title": "A Letter From Survivors of Jeffrey Epstein and Ghislaine Maxwell", "date": null}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "Trump's deregulatory agenda weakens workers' civil rights,  undermines worker protections and hard-earned wages, and downgrades the  U.S.", "title": "Trump's Labor Agenda: Unsafe and Underpaid", "date": null}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "The Office of Civil Rights was put in there  through the Civil Rights Act of 1964.", "title": "Protecting Education for Children with Disabilities", "date": "2026-01-13"}, {"senator": "Andrea Salinas", "party": "Democrat", "sentence": "For roughly 48 hours after his arrest, the  Trump administration violated my constituent's constitutional rights.", "title": "Arrest of Wildland Firefighter", "date": null}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "He has resisted the orders of Federal courts--including the Supreme  Court--after they ruled against him and the State of Alabama in voting  rights cases.", "title": "Executive Calendar", "date": "2025-10-29"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "I know Ranking Member Scott talked  about the civil rights obligations of the Department of Education, and  we know that a lot of the education laws that came about were signed by  President Johnson in the civil rights era to expand opportunities and  to close opportunity gaps.", "title": "Dismantling the Department of Education", "date": "2025-12-15"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "Since then, we have seen Secretary McMahon fire staff from the  building who investigate and protect the civil rights of students.", "title": "Dismantling the Department of Education", "date": "2025-12-15"}, {"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "We need to stand up for  LGBTQ+ rights because that is what the American people expect us to do,  fight for them.", "title": "Welcoming the Honorable Adelita S. Grijalva to the House of Representatives", "date": "2025-11-12"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "Congress must do  whatever is possible to protect human rights, stand for democratic  values, and object to the atrocities committed against the Burmese  people.", "title": "Bringing Real Accountability Via Enforcement in Burma Act", "date": "2026-02-09"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "He ensured the Social Security Act worked for people and took his  calling seriously by serving and advocating for the rights of  beneficiaries.", "title": "Recognizing Clarendon Hills Little League Team", "date": null}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "The 700,000       people who live in DC deserve the same rights and dignity as       the people in your home district.", "title": "Opposition Letter Led By Free DC on the Common-Sense Law Enforcement and Accountability Now in DC Act of 2025 (H.R. and the District of Columbia Cash Bail Reform Act of 2025 (H.R.", "date": "2025-11-19"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "The Trump administration believes that the rights and opportunities  available to students like RJ can and should be limited.", "title": "Protecting Education for Children with Disabilities", "date": "2026-01-13"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "colleges, the CCP established Confucius Institutes to  push false narratives, whitewash history, and endear American students  to the CCP while obscuring its brutal human rights abuses.", "title": "Promoting Responsible Oversight to Eliminate Communist Teachings for Our Kids Act", "date": "2025-12-04"}, {"senator": "Anna Luna", "party": "Republican", "sentence": "And  for the same people who are advocating saying that Kristi Noem and ICE  will demand your personal information and you will be under  surveillance, might I remind them that they actually all authorized the  reauthorization of FISA, unreformed, that violated our constitutional  rights.", "title": "Veterans Accessibility Advisory Committee Act of 2025", "date": "2026-02-11"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "Nothing in this Act, or the amendments made by this Act,       may be construed to conflict with any of the crime victims'       rights described in section 3771 of title 18, United States       Code.", "title": "Trafficking Survivors Relief Act", "date": "2025-12-01"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "Speaker, I rise in opposition to Democrats  trying to give voting rights to illegal aliens.", "title": "Prohibiting Voting By Noncitizens in District of Columbia Elections", "date": "2025-06-10"}, {"senator": "Robert Bresnahan, Jr.", "party": "Republican", "sentence": "When their collective bargaining rights are stripped, they are left  without the stability, fairness, and respect they deserve.", "title": "Protect America's Workforce Act", "date": "2025-12-11"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "Currently, utility companies are allowed to fell hazard trees in  their rights-of-way but are not permitted to remove them without going  through the timber sale process.", "title": "Fire Safe Electrical Corridors Act of 2025", "date": "2025-05-13"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "They risked everything so that future generations might  inherit a nation grounded in rights, not repression, but grounded in  freedom.", "title": "Free Iran", "date": "2025-12-09"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "It is important  for these notice letters to be understandable so that the veterans and  survivors know their rights and how to navigate the claims process.", "title": "Clear Communication for Veterans Claims Act", "date": "2025-04-07"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "It is a commitment to the founding ideals of our country,  however differently we might conceive of them at any given moment, that  all men and women are created equal and are endowed by their creator  with inalienable rights.", "title": "Tragic Loss of Charlie Kirk", "date": null}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "It also addresses how  fiduciaries use shareholder rights, like proxy voting.", "title": "Protecting Prudent Investment of Retirement Savings Act", "date": "2026-01-15"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "A ``yes'' vote on House Resolution 1032 enables us to consider  legislation that funds the Department of Labor's Veterans' Employment  and Training Service, otherwise known as VETS, a program that serves  America's veterans and separating servicemembers by preparing them for  meaningful careers, providing employment resources and expertise, and  protecting their employment rights.", "title": "Providing for Consideration of Senate Amendments to H.R. Consolidated Appropriations Act, Providing for Consideration of H.J. Res. Disapproving the Action of the District of Columbia Council in Approving the D.C. Income and Franchise Tax Conformity and Revision Temporary Amendment Act of and Providing for Consideration of H.R. Critical Mineral Dominance Act", "date": "2026-02-03"}, {"senator": "James Risch", "party": "Republican", "sentence": "The world, I think, is very quickly developing into a bipolar  position, where, on the one hand, you have democracies and semi- democracies like the United States, made of up of free people, of  capitalism, of free markets, of entrepreneurs, and of people who very  much value human rights and value the individual way, ahead of the  state.", "title": "-9999", "date": "2025-04-29"}, {"senator": "Pat Ryan", "party": "Republican", "sentence": "Be it climate change, wars, violations of human rights, His  All-Holiness is undaunted and unwavering in his commitment to  alleviating suffering and championing justice.", "title": "Welcoming Ecumenical Patriarch Bartholomew to Washington, D.C.", "date": null}]