[{"senator": "Adam Smith", "party": "Democrat", "sentence": "…in this bill that Republicans wanted in the bill.  We got those out because we wanted a bipartisan product. This is a  bipartisan product.\n\nThis starts moving us in the right direction. Does it stop all those  bad things that President Trump and Pete Hegseth are doing right now?  No. But it really couldn't. It is a step in the right direction toward…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697790/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…the bill language requires the USDA to  notify Congress before canceling grants over $1 million.\n\nThe agriculture portion of this bill does make positive steps in the  right direction. The bill discards many of the harmful policy riders in  the House bill, yet it does not go far enough to negate House language  falsely questioning the safety of Mifepristone…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696744/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…pointless tariffs. We did that when we passed Senator Kaine's bill to  end the tariffs on Canada. Today, the Senate can take another powerful  step--a powerful step in the right direction--by voting to repeal the  global tariffs on a bipartisan basis.\n\nI would just close by saying: Listen to your constituents. Listen to  what you are hearing from home,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690532/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…expressed support to fund that effort.\n\nUnfortunately, progress has been slow despite strong interest from  Senators of both parties. So today's resolution is a step in the right  direction.  And the majority leader's statements about the further progress we need  to make soon were very important--because, on its own, today's action  is not nearly enough.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695686/authorizing-the-use-of-funds-from-the-senators-official-personnel-and-office-expense-account-for-security-enhancements-and-services-provided-to-senators"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…and  conscience today and last evening as you stand here and point out the  grave situation this country faces. You have clearly indicated--and I  believe you are right--that the direction of this administration is  toward authoritarian rule. Step by step, unfortunately, we seem to get  closer.\n\nOne of the great ironies of the administration is that…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696343/trump-administration"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…who are worried, who are angry.\n\nI think about John Lewis, who taught me that fear is not something to  be shunned. It is almost a signpost that you are headed in the right  direction. It is something that is a necessary precondition. You cannot  have great fear without great courage. John Lewis would tell us that  this is a time for great courage.…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…continue to fight for military  aviators and countless others who have been exposed to a litany of  toxins and hazards during their service.\n\nThe ACES Act is a step in the right direction. It is not the fix-all.  It is not the end of the journey. It is a start of one, just like the  Honoring our PACT Act was.\n\nI will say that I am heartened by the consensus…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693895/aces-act-of-2025"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…are located and no matter who owns them, small  businesses are the backbone of our economy. They should be and are a  bipartisan priority, and this bill is a step in the right direction.\n\nWith the understanding that we will be able to deal with the other  bills that are scheduled to come before us even after a short recess, I  urge a ``yes'' vote on H.R.…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692757/expanding-access-to-capital-for-rural-job-creators-act"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…before.\n\nNow, is there more work to be done? Absolutely. We should do that. We  cannot allow subjective ideas of perfection to override what are  objectively steps in the right direction.\n\nThe CLARITY Act is one act that I support, and this is an important  first step. As we move forward, however, we must continue to make the  necessary investments so…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693778/digital-asset-market-clarity-act-of-2025"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…which provided $2.5 billion of investment in port infrastructure.\n\nWe all now understand the importance of a strong resilient supply  chain, and this bill is a step in the right direction.\n\nI look forward to working with my colleagues to ensure robust funding  for the maritime industry. For this reason, I will vote ``yes'' on H.R.  252.\n\nMr. CARBAJAL. Mr.…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692208/secure-our-ports-act-of-2025"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…slashes clean energy incentives and  raises prices, I am grateful to find consensus around safeguarding  water for our communities.\n\nThis amendment is one small step in the right direction. I will not  stop fighting to protect water, to protect our children's future, and  to protect our planet.\n\nMr. Chair, I urge the adoption of this amendment en bloc.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694860/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…trading crypto assets, transacting in goods and services, insulating  against local currency instability, and sending payments across  borders. While S. 1582 is a step in the right direction, it fails to  establish an effective federal framework to regulate stablecoins. The  bill also opens up a path for Big Tech and other commercial businesses  like Meta,…", "date": "2025-07-25", "source_url": "https://justfacts.votesmart.org/public-statement/1694254/9999"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…services to wildfire survivors.\n\nI am grateful to the Department of Labor for awarding Hawaii $2.5  million in dislocated worker grant funding. While this is a step in the  right direction, the livelihoods of displaced workers, the health of  our local economy, and the long-term trajectory of Maui's recovery  remain in the balance.\n\nWe must continue working…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689959/maui-dislocated-workers-program"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…nationals who want to contribute to U.S. elections.  This way, we can all have faith that only Americans are contributing to  our campaigns.\n\nFor now, this is a step in the right direction as we all work toward  the larger goal of overturning Citizens United.\n\nI hear from a lot of constituents about what is the disconnect  between Washington's policies and…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699239/restoring-election-integrity"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…definition to protect those who don't possess the proper  knowledge or information about the risks of private unregistered  securities. Mr. Hill's bill moves us in the right direction by  indicating that certain credentials, such as someone with a master's in  business administration, an MBA, or a FINRA certification, for example,  should be deemed…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692775/fair-investment-opportunities-for-professional-experts-act"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "…Department of Homeland Security to develop a national strategy to help  secure our elementary and secondary schools from acts of terrorism.\n\nThis bill moves us in the right direction. It acknowledges a painful  truth, that the safety of our students and teachers cannot be taken for  granted. It recognizes that schools need Federal support, coordination,…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696997/national-strategy-for-school-security-act-of-2025"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…solutions to boost  productivity and improve project outcomes, the Federal Government must  do the same or risk being left behind.\n\nThe ePermit Act takes a strong step in the right direction by  modernizing Federal permitting technology in a project-agnostic manner.\n\nAgain, I thank my colleagues, Representatives Johnson and Peters, for  this commonsense bipartisan…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697679/epermit-act"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "…waters through drug interdiction, stops  human trafficking, and promotes maritime safety.\n\nIt also establishes a Secretary of the Coast Guard, an important step  in the right direction to ensure that the Coast Guard men and women  remain a priority for many administrations to come.\n\nThe other armed services have this position, and they also do much…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694193/coast-guard-authorization-act-of-2025"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…like what the  President is doing, but the American people do.\n\nPoll after poll is showing that an increasing number of people now  believe this country is heading in the right direction. A Rasmussen  Reports survey shows that this is the first time in 20 years that the  majority of respondents have felt that way.\n\nGo ahead and vote against these things…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691940/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…we have seen a warping of government and  the regulations surrounding it to try to pound these investments into a  social circle that some, not all of us, believe is the right direction  to go.\n\nHere is what I want to do, Mr. Speaker. I want to maximize return for  that firefighter, that teacher, that police officer. I want to make  sure that those who…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699155/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Roger Marshall", "party": "Republican", "sentence": "…here, the science is never settled. I  don't absolutely agree with everything on this pyramid as a physician,  but these are incredible guidelines and huge steps in the right  direction. And, again, use a little common sense as you go forward.\n\nFor too long, we overcomplicated nutrition. We buried families in  confusing charts, changing rules, and special-interest…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698680/9999"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…our country. I  know many of my colleagues across the aisle want to change that through  permitting reform. My legislation begins to address that and is a step  in the right direction.\n\nThis bill is about strengthening American energy security, protecting  good-paying jobs, and restoring common sense to a process bogged down  by bureaucratic delays…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695691/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…mineral projects, and remove unnecessary barriers to opening       a mine in the United States. The Critical Mineral Dominance       Act represents a step in the right direction and EMA urges       Congress to pass it as soon as possible.\n\nH.R. 4090 will direct the Department of the Interior (DOI)       to revise or rescind agency actions that…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699694/critical-mineral-dominance-act"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…incentivize the  building of more workforce housing. While increasing housing supply has  no silver bullets, expanding the low-income housing tax credit is a  major step in the right direction.\n\nAccording to the National Association of Realtors, there is a 5- million-unit gap between housing demand and housing supply in this  country. Once the bill is law, the…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1692993/boosting-americas-housing-supply"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…infants abroad.  Most of the developed world has already banned international commercial  surrogacy due to the trafficking risks, and this bill is a strong step  in the right direction to prevent bad-faith actors from taking  advantage of U.S. surrogate mothers and the children they bear.\n\nI am proud to champion legislation that directly benefits Utahns…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699280/highlighting-republican-successes-in-2025"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…to improve  VR&E by modernizing the program, increasing transparency, and  introducing accountability to both the VA and the veterans. While this  bill is a step in the right direction, I hope my colleagues recognize  that there is much more work to be done to get VA to work for the  veterans first.\n\nMadam Speaker, I urge all my colleagues to support…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695412/focused-assistance-and-skills-training-for-veterans-employment-and-transition-success-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…understandable terms. We need to make it easier and not harder for  individuals to plan for retirement in this country.\n\nThe Claiming Age Clarity Act is a positive step in the right  direction. Representatives Smucker and Beyer are to be commended for  forging this bipartisan consensus on a policy that will improve  retirement security and ensure the bureaucracy…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697232/claiming-age-clarity-act"}, {"senator": "John James", "party": "Republican", "sentence": "…are tired of Democrats and Republicans  bickering. I imagine both Democrats and Republicans agree on fentanyl  and any direction on fixing this scourge is a step in the right  direction.\n\nMr. Chair, with this bipartisan legislation and action that we are  taking to save lives, I encourage all of my colleagues to support this  crucial legislation.", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691886/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…into the data. What would happen  if fixing these misalignments, the waste and fraud--actually, it  doesn't get us where we need to be, but it starts moving us in the  right direction.\n\nMr. SCHWEIKERT. Mr. Roy, I think I am actually against my time, so I  am going to do that moment.\n\nI am going to first apologize to the folks who had to try to take…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690586/economic-anxiety"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…sure that everybody in America  can get access to healthcare and to make sure we don't bankrupt the  country in the meantime.\n\nSo all these ideas are a solid step in the right direction toward  righting the wrongs of ObamaCare and ensuring we put dollars in the  hands of the consumer or American families rather than in the coffers  of insurance companies…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697200/senate-agenda"}]