[{"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…rise today to congratulate the  graduates of Rock Ridge High School's class of 2025.\n\nThis class has been really amazing. They have become intuitive  problem-solvers through rigorous academic programs and electives. They  excelled across a wide range of fields, including English literature,  calculus, and physics. The student body has managed over 122…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692320/congratulating-john-champe-high-school-class-of-2025"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…and Hinduphobia, and ensuring  their equal protection under civil rights laws. It has contributed  significantly to intellectual diversity in the United States by  fostering rigorous academic inquiry, research, and dialogue on Indian  philosophy, dharmic traditions, and Hindu contributions to world  civilization, thereby enriching America's multicultural…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689467/recognizing-the-contributions-of-rajiv-malhotra-and-the-infinity-foundation"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…first let me thank our great Senator from  Virginia Senator Kaine. He has been the most vigilant watchdog against  over-encroachment of the military. He has been the most rigorous  watchdog in making sure Congress's power to make war and engage in acts  of war are upheld.\n\nThere are many Presidents, as Senator Kaine pointed out, who try to  push the…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696558/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…abstract. It is  personal. We see every single day what honor, discipline, and sacrifice  looks like regardless of someone's gender identity.\n\nThese individuals met the same rigorous standards as their peers, the  same physical exams, screenings, and background checks; and in many  cases, under intense scrutiny, they didn't just meet those standards,…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693974/transgender-americans-serve-with-honor"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…has played a vital role in the development  of Northwest Ohio and beyond, shaping generations of students into  leaders in their professions and communities, and providing a rigorous  education rooted in the liberal arts and experiential learning; and\n\nWhereas, during the presidency of Kevin McCann, Defiance College  experienced significant growth, expanding…", "date": "2025-03-18", "source_url": "https://justfacts.votesmart.org/public-statement/1688913/proclamation-for-defiance-colleges-demisemiseptcentennial"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…courts, and to select the       chief judges of the D.C. Court of Appeals and the Superior       Court of the District of Columbia. For more than five       decades, through rigorous evaluation of legal experience,       integrity, intellectual capacity, and community standing, the       Commission has consistently provided the President with a       carefully…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695614/district-of-columbia-judicial-nominations-reform-act"}, {"senator": "Donald Norcross", "party": "Democrat", "sentence": "…Lieutenant Jack C. O'Neill having earned       his commission through Officer Candidates School, has       distinguished himself through the successful completion of       this rigorous and demanding course of instruction,       demonstrating outstanding physical endurance, tactical       proficiency, and unwavering dedication to the values of the       Marine…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694090/congratulating-second-lieutenant-jack-c-oneill-on-his-graduation-from-the-basic-school"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…competitive process  and nominates the most number of people  to military academies of any district in the country.\n\nThese young men and women were able to get through our rigorous  progress by demonstrating leadership, patriotism, and a commitment to  service.\n\nWe thank the students for their dedication, their courage, and their  willingness to answer…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693568/congratulating-military-academy-appointees"}, {"senator": "Lizzie Fletcher", "party": "Democrat", "sentence": "…from around the world at the United Nations headquarters in  New York to participate in the Commission on the Status of Women (CSW).  Delegates representing GSUSA undergo a rigorous application process and  training to prepare them for their participation in the CSW. As  delegates, girls have the opportunity to engage with GSUSA's work  around global…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688693/recognizing-girl-scouts-of-san-jacinto-county-texas-at-the-united-nations-69th-commission-on-the-status-of-women"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…demand reform. There need to be real  changes at DHS, and those kinds of changes have to include body cameras  and identification on every officer, masks off at all times, rigorous  use-of-force training and policy, independent investigations into acts  of violence and ongoing monitoring of the agency's conduct, and, most  important, accountability and…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699650/9999"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…land management agencies, plans like these are the  foundation for responsible, sustainable management of our public lands.  RMPs are the product of extensive public input, rigorous scientific  reviews, and meaningful Tribal consultation. Balancing the activities  on our public lands from energy development to recreation is what these  plans do.\n\nThey…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696881/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…already broken the law by redirecting funds  without congressional approval. I worry that the trend will continue  over the next few years. I hope my colleagues will join me in rigorous  oversight of the Trump administration's approach to VA's budget.\n\nThere are two other provisions in this bill I would like to discuss  very briefly. This legislation would…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693968/protecting-regular-order-for-veterans-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…United States should be the world leader in energy and mineral  production. We are blessed with abundant resources. We have the  brightest minds, and we maintain the most rigorous and clean production  standards in the world. Yet, the anti-American energy policies pursued  by radical environmentalists in the previous administration crippled  communities…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694908/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…be a lot of scare tactics on what this mine, which  hasn't even been permitted or approved yet, is going to do, but we know  one thing. It will have to stand up to all the rigorous permitting  requirements that the U.S. has to offer. It will also have to stand up  to the labor, health, and safety requirements that we have here in the  U.S., unlike many…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699275/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…Catholic Academy was established to       restore the tradition of classical Catholic education by       offering the area's first diocesan classical school, uniting       rigorous academics with vibrant Catholic faith formation;\n\nWhereas, the school's mission is to ``educate children to       become scholars and form them to become saints,'' reflecting…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699458/recognizing-holy-family-catholic-academy"}, {"senator": "French Hill", "party": "Republican", "sentence": "Mr. HILL of Arkansas. Mr. Speaker, I move to suspend the rules and  pass the bill (H.R. 3190) to amend the Burma Unified through Rigorous  Military Accountability Act of 2022 to extend the sunset, to require a  determination with respect to the imposition of sanctions on certain  persons of Burma, and for other…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699831/bringing-real-accountability-via-enforcement-in-burma-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Class U.S. Bartender of the Year.\n\nMr. Wallace, the bars and spirits manager at the Sea Island Resort,  received the highest honor in American mixology, awarded through a  rigorous competition that tests the Nation's top bartenders on skill,  storytelling, and hospitality.\n\nAmong 30 national finalists, Mr. Wallace emerged as the champion  after a series…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692753/recognizing-uga-2025-boren-award-winners"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…Presidents  during their Presidency and Ronald Reagan post-Presidency.\n\nAfter retiring from the Secret Service, he then joined the Los  Angeles Police Academy, completing rigorous police academy work and  then serving in local law enforcement.\n\nMr. Speaker, I wish Richard a very happy birthday. I am so proud that  he is my brother.", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692297/recognizing-davenport-assumption-girls-soccer-team"}, {"senator": "Richard Hudson, Jr.", "party": "Republican", "sentence": "…This program has helped generations of young people set goals, serve  others, and push themselves to achieve more. Specifically, young  Americans have to set and complete rigorous personal goals focused on  volunteer service, personal development, exploration, and physical  fitness.\n\nOne of my constituents, Caroline Harris, from Greensboro, North  Carolina,…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698221/congressional-award-program-reauthorization-act"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…Commander in Chief. Our military is targeting known drug  smuggling boats loaded with drugs and moving along well-established  trafficking routes. Every strike is based on rigorous intelligence  linking these boats with well-known narcoterrorists.\n\nEvery strike undergoes a comprehensive legal review and complies with  defined rules of engagement to ensure…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698238/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…dedication to  supporting the mission and security of our Nation.\n\nLater in 2003, he attended the U.S. Army Airborne School at Fort  Benning, Georgia, where he completed the rigorous training required to  earn his Airborne qualification. In 2005, he reported to the Marine  Aviation Detachment at Naval Air Weapons Station China Lake,  California. There,…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693985/recognizing-united-states-marine-sergeant-major-timothy-babcock-as-august-2025-veteran-of-the-month"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…drug interactions become more common,  influenced by slower metabolism, reduced kidney function, and  heightened drug sensitivity.\n\nPharmacists, after six to eight years of rigorous training, including  a Doctor of Pharmacy degree, serve as trusted experts in how  medications work, interact, and affect aging bodies.\n\nThrough services like medication therapy…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699709/retirement-of-judge-ronnie-fender"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…carry firearms where it  may normally be restricted.\n\nOur law enforcement officers are committed to protecting their  communities and their fellow citizens, and they receive rigorous  training throughout their careers. By allowing these brave men and  women the opportunity to conceal carry where it is normally restricted,  these local heroes will have…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1690998/delivering-on-president-trumps-agenda"}, {"senator": "Rob Wittman", "party": "Republican", "sentence": "…demonstrates not only mastery  across English, Mathematics, Reading, and Science, but also the  persistence, focus, and determination required to perform at the  highest level under rigorous testing conditions.\n\nMadeline's dedication to learning and pursuing the highest standards  of performance speaks to both her exceptional aptitude and her strong  character.…", "date": "2026-02-20", "source_url": "https://justfacts.votesmart.org/public-statement/1700087/recognizing-madeline-brobst-receiving-a-perfect-score-on-the-act"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…laws are applied fairly, objectively, and consistently.\n\nFor over 40 years, the Department of the Interior through the Office  of Federal Acknowledgement has carried out a rigorous merit-based  process for determining Federal Tribal recognition. This process was  created by Congress to prevent political favoritism or arbitrary  decisionmaking as it requires…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697785/ensuring-fairness-and-integrity-in-federal-tribal-recognition"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…State officers for the Pennsylvania  FFA: State President Sarah Firestone, State Vice President Sally  Bollinger, and State Secretary Leah Flinchbaugh.\n\nHaving emerged from a rigorous nomination and election process, a  total of seven State officers were chosen to lead the Pennsylvania FFA  this year. Three of the seven individuals belong to chapters in…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698569/recognizing-and-thanking-joanne-horn"}, {"senator": "French Hill", "party": "Republican", "sentence": "…now. We risk history  repeating itself, and that is why we gather today on the House floor.\n\nAfter years of bipartisan work and numerous iterations, this bill  would apply rigorous rules to digital asset firms, prohibiting  commingling of customer funds, and requiring capital recordkeeping and  conflict of interest mitigation standards.\n\nImportantly,…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693775/digital-asset-market-clarity-act-of-2025"}]