[{"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "ICE has already been handed $75 billion through the Republican's big,  ugly bill, money that was ripped away from SNAP, Medicaid, and working  families.", "title": "Horrific Ice Abuses", "date": "2026-02-04"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "I implore every one of my colleagues: Do not be complicit in  destabilizing the lives of millions of people, including Rachael's son  who will have their healthcare ripped away.", "title": "Gop Tax Scam Hurts Women and Families", "date": "2025-05-20"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "Now, that lifeline is being ripped  away from families like Elizabeth's.", "title": "Thanking Officer Robert Scisco", "date": "2025-07-15"}, {"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "Babies are being ripped away from  their parents by masked agents.", "title": "Welcoming the Honorable Adelita S. Grijalva to the House of Representatives", "date": "2025-11-12"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "If they were delivering for everyday Americans, they would not vote  for healthcare to be ripped away, like they just did last week.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the Bureau of Ocean Energy Management Relating to ``Protection of Marine Archaeological Resources''", "date": "2025-03-06"}, {"senator": "Derek Tran", "party": "Democrat", "sentence": "My own parents escaped brutal oppression at the hands of the  Vietnamese Communist Government and came to this country seeking the  freedom and democracy that had been ripped away from them in the  country of their birth.", "title": "Reaffirm Commitment to Freedom During Black April", "date": "2025-04-01"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "Republican billionaires  and Big Oil companies are the real winners when resolutions like this  are passed and savings are ripped away from American consumers.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the Department of Energy Relating to ``Energy Conservation Program: Energy Conservation Standards for Walk-In Coolers and Walk-In Freezers''", "date": "2025-03-27"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "Yet despite all of this, she was taken into custody and ripped away  from her family for weeks.", "title": "Ice Raids in North Carolina", "date": "2026-01-14"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "Wisconsin stands to have $235 million in title I  funding ripped away.", "title": "Nomination of Linda McMahon", "date": "2025-02-27"}, {"senator": "Sheila Cherfilus-McCormick", "party": "Democrat", "sentence": "For those Haitians who fled instability and gang violence, why were  TPS and humanitarian parole ripped away from them?", "title": "Make Refugee Policy Same for All", "date": "2025-05-15"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "citizens are  having their spouses ripped away.", "title": "Terminating the National Emergency Declared to Impose Global Tariffs", "date": "2025-04-30"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "I say the American Dream hasn't slipped away;  it has been ripped away.", "title": "Economic Populism", "date": "2025-03-25"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "They  ripped away rebates to help consumers save money on their electric  bills.", "title": "State Planning for Reliability and Affordability Act", "date": "2025-12-10"}, {"senator": "Thomas Suozzi", "party": "Democrat", "sentence": "We set up these different State and city governments throughout our  country to be laboratories of democracy, to run their States and their  cities the way they see fit, to tax them as they see fit, and the one  way that they used the Federal income tax code to move forward was to  have a State and local tax deduction that was ripped away from them in  2017.", "title": "Republican Tax Cuts", "date": "2025-05-05"}, {"senator": "Derek Tran", "party": "Democrat", "sentence": "My parents came to this country from  Communist Vietnam in search of the very freedoms that had been ripped  away from them in the country of their birth.", "title": "A Republic If We Can Keep It", "date": "2025-03-26"}]