[{"senator": "Sheila Cherfilus-McCormick", "party": "Democrat", "sentence": "…CHERFILUS-McCORMICK. Mr. Speaker, this administration's  deportation process has been sloppy and reckless since day one. No due  process and no transparency, just families being illegally ripped apart  and left to fend for themselves.\n\nIn severe instances, innocent people have actually died, like Marie  Blaise. She was a 44-year-old Haitian woman who was in ICE custody…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690462/immigrants-are-being-treated-without-basic-dignity-and-being-denied-medical-care"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…that  Republicans passed in July to provide tax breaks to the wealthy and  well-connected took away tax credits to keep cleaner, cheaper energy  producing across America. They ripped away rebates for households to  help them afford the cost of upgrading their homes, making their lives  more energy efficient.\n\nAlso, these arbitrary Trump tariffs are at the…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698279/reliable-power-act"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…from what is  going on behind the scenes here in Washington, D.C. I have to say I  think my Republican friends are out of touch with working people.\n\nPeople are tired of being ripped off by special interests and  politicians in Washington. This resolution is another example of that.  This makes it harder for small business owners to save money through…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689130/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Thomas Suozzi", "party": "Democrat", "sentence": "…they see fit, to tax them as they see fit, and the one  way that they used the Federal income tax code to move forward was to  have a State and local tax deduction that was ripped away from them in  2017.\n\nSome of my colleagues on the Republican side have said they will not  support this new tax bill unless we restore the State and local tax  deduction.…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690627/republican-tax-cuts"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…Canada Trade Agreement--negotiated, by the way, by President Trump, an  agreement he bragged about as being really effective and the best trade  agreement--that is getting ripped up in many ways. And then when you  add to it the insults that were hurled at Canada--the ``51st State,''  the ``Governor of Canada''--it has had a catastrophic impact on the…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696453/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Sylvia Garcia", "party": "Democrat", "sentence": "…ranking member for  yielding me time.\n\nMr. Speaker, the Consumer Financial Protection Bureau, known as CFPB,  was created for one reason: to protect everyday people from getting  ripped off, especially when tech companies start acting like banks.\n\nIf a tech company wants to be trusted with your money, it should play  by the same rules as any bank. That is…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689951/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…had their lives disrupted, who have had  their families separated, who have had their humanity erased and their  dignity denied, the men, women, and children who have been ripped from  our communities, thrown into cold cells, and shipped off to countries  many have never known.\n\nThe Trump administration would have you believe that they are  pursuing…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697461/fighting-dhs-immigration-raids"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…immigrant communities.\n\nIn these 2 months, we have seen people thrown to the ground and  beaten. This is not speculation; it is videotaped. We have it.\n\nWe have seen children ripped from their beds in the middle of the  night and zip-tied outside of an apartment complex on the South Shore  Avenue of Chicago. And we have seen tear gas canisters deployed…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696536/government-funding"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "…authorization, no criminal record, and is  allowed to legally remain in this country while her asylum case is  pending.\n\nYet despite all of this, she was taken into custody and ripped away  from her family for weeks. Thankfully, after an outpouring of public  anger and criticism, the Trump administration finally released Fatima a  few days before Christmas.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699039/ice-raids-in-north-carolina"}, {"senator": "Angie Craig", "party": "Democrat", "sentence": "…and Minnesotans have paid the  price.\n\nThrough President Trump and Kristi Noem's reckless and lawless ICE  operations, the administration has targeted communities of color,  ripped families apart, detained U.S. citizens, and made it harder for  law enforcement to do their jobs. As a result, it has endangered every  single Minnesotan.\n\nEarlier this month,…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699323/consolidated-appropriations-act-2026"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…as too  expensive.\n\nPeople are right. The American people understand our economy has been  rigged against so many. I say the American Dream hasn't slipped away;  it has been ripped away.\n\nI am 40 years old. My generation and those younger than me, the first  generation in a long time, since World War II, have grown up and don't  expect to be better off…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689080/economic-populism"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…want lower costs. They don't want bills like this that  say you will pay more and our Big Oil friends are going to make more on  their bottom line.\n\nPeople are tired of being ripped off by the special interests and  politicians who all have too much power here in Washington, D.C. This  bill is another example of that. Republicans want to make it harder…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689260/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "…money. They basically terrorized them and left. If  we let them tear up due process for some, it is a danger to all.\n\nMr. Speaker, I will not stand silent while families are ripped apart  and while the Constitution is trampled on. My colleagues shouldn't  either.", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690420/put-hardworking-american-families-first"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…have seen from this  administration--from its tariff policy raising prices on cars to coffee  to the passage of the One Big Beautiful Bill--or betrayal, as I call  it--that ripped Medicaid away from millions of Americans to finance tax  breaks for billionaires--all of those actions has made the  affordability crisis for average Americans worse. For far…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695663/cloture-motion"}, {"senator": "Jared Golden", "party": "Democrat", "sentence": "…order from March that ended collective bargaining rights for  roughly 1 million Americans who work for the Federal Government.\n\nSince the order was made, the administration has ripped up more than  700,000 union contracts. The order was the largest act of union busting  in American history, and it left our Federal workforce more vulnerable  to unfair treatment…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697864/providing-for-consideration-of-hr-2550-to-nullify-the-executive-order-relating-to-exclusions-from-federal-labor-management-relations-programs-and-for-other-purposes"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…100 percent since that law  was passed. Part of this--part of this--is waste, fraud, and abuse of  taxpayer dollars. So we pay higher premiums, and the taxpayer is  getting ripped off as well.\n\nHere are just some recent examples. In November, a Federal jury in  West Palm Beach convicted two individuals in a $233 million ObamaCare  fraudulent enrollment…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698998/disrupt-explicit-forged-images-and-non-consensual-edits-act-of-2025"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…everything right, did  what they were supposed to--they are not going to flood--and yet, after  Risk Rating 2.0, this is what happened. I don't know if people still  say ``ripped off,'' but they feel ripped off. They feel as if they did  what was right and they have been punished and penalized because the  premiums almost or in some cases more than…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691629/risk-rating"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…capitalism. Trade never occurs unless you want a  product more than you want your money. Has anyone ever made a trade, a  voluntary trade, where you thought you were being ripped off? No. You  buy stuff only because you think you are making a good deal.\n\nThose who say that, oh, no, we are being ripped off--it is a fallacy.  It asserts that one of the…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690543/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…way of life that their  forefathers fought, bled, and died for, and that their brothers,  sisters, moms, and dads worked to build for them and to pass down to  their kids, ripped to shreds by people who don't give a rip about the  rule of law, the Constitution, or our way of life as God-fearing  Americans who say that we put our trust in God right above…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695203/people-are-sick-and-tired"}, {"senator": "Hal Rogers", "party": "Republican", "sentence": "…Speaker, I rise today to recognize the  heroic efforts of first responders in London and Laurel County who  swiftly responded to rescue individuals after a deadly EF-4 tornado  ripped through our region, leaving behind a 55-mile trail of  destruction through three counties.\n\nThe violent storm took the lives of 19 individuals, 17 of whom were  in Laurel County.…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692791/recognizing-first-responders-in-laurel-county-kentucky"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…highbrow discussion here. Should a State  like Arizona be rewarded for how efficiently we deliver and the quality  of our services compared to so many other States that are just ripped  with fraud?\n\nYou start to see cumulative improper Medicaid. This is not Medicare.  This is Medicaid. It is supposed to be healthcare for indigents. That  is the law. Payments…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691811/actual-solutions"}, {"senator": "Troy Nehls", "party": "Republican", "sentence": "…interstate. They  immediately turned around and rushed to the scene.\n\nUpon arrival, Mr. Van Orden found a young boy with severe injuries.  The young boy's calf was completely ripped apart, and he had an  arterial bleed on his right wrist.\n\nWithout hesitation, Mr. Van Orden pulled from his suitcase two pairs  of socks, which he fashioned into makeshift…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695712/recognizing-derrick-van-orden"}]