[{"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "Speaker, I rise today with great honor to welcome to  our Nation's Capital His All-Holiness Ecumenical Patriarch Bartholomew,  Archbishop of Constantinople-New Rome and Ecumenical Patriarch.", "title": "Welcoming His All-Holiness Ecumenical Patriarch Bartholomew, Archbishop of Constantinople-New Rome and Ecumenical Patriarch", "date": null}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Speaker, I rise today to recognize Aden Cordova  Rubio for earning the Arvada Wheat Ridge Service Ambassadors for Youth  Award.", "title": "Recognizing Aden Cordova Rubio", "date": "2025-04-29"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "Speaker, I rise today to call attention to a crisis  in the American West and across the country.", "title": "Wildfires in Oregon", "date": "2025-06-12"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Speaker, I rise today to recognize Isaac Dewolf  for earning the Arvada Wheat Ridge Service Ambassadors for Youth Award.", "title": "Recognizing Isaac Dewolf", "date": "2025-04-07"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "President, I rise on behalf of the thousands of  Wisconsinites I have heard from in the last few days.", "title": "-9999", "date": "2026-01-28"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Speaker, I rise today to recognize Alfonze Romero  for earning the Arvada Wheat Ridge Service Ambassadors for Youth Award.", "title": "Recognizing Alfonze Romero", "date": "2025-05-13"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "Speaker, I rise in opposition to this big, ugly  bill.", "title": "Providing for Consideration of Senate Amendment to H.R. One Big Beautiful Bill Act", "date": "2025-07-02"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "Speaker, I rise in strong support of H.R.", "title": "Assessment of Trans-Atlantic Submarine Fiber Optic Cable", "date": "2025-06-23"}, {"senator": "Alma Adams", "party": "Democrat", "sentence": "Speaker, I rise this evening to recognize the eighth  anniversary of Black Maternal Health Week, founded by Black Mamas  Matter Alliance.", "title": "Recognizing Black Maternal Health Week", "date": "2025-04-09"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "Speaker, I rise as a former small business owner having over  three decades owning and managing restaurants in strong opposition to  this sad healthcare plan.", "title": "Lower Health Care Premiums for All Americans Act", "date": "2025-12-17"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "Speaker, I rise in support of H.R.", "title": "Adams Memorial-Great American Heroes Act", "date": "2025-12-09"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "Speaker, I rise to oppose this bill that allows  health insurance premiums for 22 million American families to skyrocket  and raises healthcare costs for everyone.", "title": "Providing for Consideration of Senate Amendment to H.R. Continuing Appropriations and Extensions Act, 2026", "date": "2025-11-12"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "Speaker, with March Madness coming to a close last  night, it is with joy that I rise to celebrate two exceptional young,  local basketball stars from northwest Ohio: Makhi Leach from Whitmer  High School and Elise Bender from Anthony Wayne High School, who were  named the 2025 All-Blade Basketball Players of the Year.", "title": "Congratulating All-Blade Basketball Players of the Year", "date": "2025-04-08"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "Speaker, I rise today to sound the alarm on the  military buildup in the Caribbean, edging us closer to a regime-change  war in Venezuela.", "title": "We Don't Need Another Regime-Change War", "date": "2025-12-12"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "President, I rise to join my colleague Senator  Whitehouse, the ranking member on the Environment and Public Works  Committee and the foremost voice for sensible climate policies, someone  who for years has warned us of the approaching dangers of climate  change and today once again has demonstrated his great insights-- particularly with respect to the cost to homeowners--of climate change.", "title": "Providing for Congressional Disapproval Under Chapter 8 of Title United States Code, of the Rule Submitted By the Internal Revenue Service Relating to ``Gross Proceeds Reporting By Brokers That Regularly Provide Services Effectuating Digital Asset Sales''", "date": "2025-03-26"}, {"senator": "French Hill", "party": "Republican", "sentence": "I rise in support of my bill, H.R.", "title": "Conveyance of Specified Forest Service Property to Perry County, Arkansas", "date": "2025-12-15"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "Speaker, I rise today to honor James Wood High School  in Frederick County, Virginia, as it celebrates its 75th anniversary, a  proud milestone for an institution dedicated to cultivating excellence  through student engagement.", "title": "Recognizing the 75th Anniversary of James Wood High School", "date": "2025-05-21"}, {"senator": "Kevin Hern", "party": "Republican", "sentence": "Speaker, I rise in support of this  legislation that will unlock the critical work the American people  elected us to do.", "title": "Concurrent Resolution on the Budget for Fiscal Year 2025", "date": "2025-04-09"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "Speaker, I rise today to recognize the exceptional  courage and service of Lieutenant Brandon Hall of Buchanan County,  Virginia.", "title": "Recognizing the Bravery and Life-Saving Response of Lieutenant Brandon Hall of Buchanan County, Virginia", "date": "2025-06-17"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Speaker, I rise today to recognize the outstanding  contributions that Robert Ross has made through his volunteerism with  Paul R.", "title": "Recognizing Robert Ross", "date": "2025-06-04"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "Speaker, I rise today in support of my legislation,  H.J.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the Bureau of Land Management Relating to ``Buffalo Field Office Record of Decision and Approved Resource Management Plan Amendment''", "date": "2025-11-18"}, {"senator": "Frank Lucas", "party": "Republican", "sentence": "Today, I rise in support of H.R.", "title": "Commercial Remote Sensing Amendment Act of 2025", "date": "2025-03-24"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "I rise in support of this rule and the underlying legislation.", "title": "Providing for Consideration of Senate Amendment to H.R. Continuing Appropriations and Extensions Act, 2026", "date": "2025-11-12"}, {"senator": "Keith Self", "party": "Republican", "sentence": "Speaker, I rise in strong opposition to this resolution, which is  not necessary, as it removes our Armed Forces from hostilities against  a country where there have been no hostilities.", "title": "Removal of the Use of United States Forces for Hostilities Within or Against Venezuela", "date": "2025-12-17"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "Speaker, I rise today in support of my bill, H.R.", "title": "Medal of Sacrifice Act of 2025", "date": "2026-02-02"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "Speaker, I rise in support of H.R.", "title": "Cormorant Relief Act of 2025", "date": "2025-12-09"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "Speaker, I rise today in support of my bill, H.R.", "title": "Rural Veterans' Improved Access to Benefits Act of 2025", "date": null}, {"senator": "John Rose", "party": "Republican", "sentence": "Speaker, I rise today to honor the many families still  grieving from the heinous assault that claimed 1,200 innocent lives on  October 7, 2023.", "title": "500 Days Since October 7 Attack", "date": "2025-02-25"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "Speaker, I rise in support of H.R.", "title": "Taiwan Non-Discrimination Act of 2025", "date": "2025-06-23"}, {"senator": "John Joyce", "party": "Republican", "sentence": "Speaker, I rise to recognize the  public service and community leadership of C.", "title": "Recognizing the Public Service and Community Leadership of C. Stewart Cleaf", "date": "2026-01-07"}]