[{"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…natural gas abroad, it is going to raise the price  here because there will be less here. It is just Economics 101, in my  opinion.\n\nAmericans are already being crushed by the rising cost of living. Now  Republicans are making matters worse by pushing legislation that will  only drive up monthly power bills even further. It is quite the  departure from President…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697094/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Robin Kelly", "party": "Democrat", "sentence": "…extend the ACA tax credits.\n\nAs you know, they are set to expire at the end of the year and will  cause monthly health bills to skyrocket for millions of Americans. The  rising cost of healthcare goes beyond the individual. It affects Black  small business owners.\n\nA small business owner in my district owns several coffee shops and  worries about her…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697214/medical-bills-are-too-high"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…rise today,  amazed that with the healthcare crisis unfolding, the Republican  priority before us is plumbing.\n\nAt a time when families are already being squeezed by the rising cost  of living, from groceries to rent to utilities, President Trump is  focused on renaming the Kennedy Center, building a ballroom, running a  foreign country, and the water…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698564/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…people produce real products for market, and we know what pink  slips are. Too many families are fearing for their financial futures,  with senior citizens unable to meet the rising cost of living,  including for food and medicine.\n\nMr. Speaker, Congress must pass legislation to support sustained  growth, not destroy wealth. The Trump extreme taxes must…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689621/quelling-us-financial-markets"}, {"senator": "Andrea Salinas", "party": "Democrat", "sentence": "…business? We need to get back to work to address the  issues impacting the American people. We should be united in addressing  the Republicans' looming healthcare crisis and the rising cost of  living.\n\nThis debate does nothing to lower costs for people in Oregon or  across this country. This is a debate that should be held by  Congressman Garcia's constituents,…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696781/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…American  people cannot rely on a concept that exists only in your imagination.\n\nHouse Democrats stood firm for more than 40 days to support a budget  that addressed the rising cost of healthcare. Now we stand on the  precipice of a crisis caused by President  Trump and Republicans who seem determined to make the livelihoods of  the American people…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696975/stories-from-home-the-human-cost-of-expiring-healthcare-tax-credits"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "Ms. CASTOR of Florida. Mr. Speaker, I rise in opposition to H.R.  1949. It is a harmful bill that demonstrates how Republicans in  Congress continue to ignore the rising cost of living and inflation  that is crushing American families and that they are willing to sell  out American energy to our adversaries like the Chinese Community  Party.…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697080/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Nelida Pou", "party": "Democrat", "sentence": "…not stop the congressional Republicans from repealing the  Energy Efficient Home Improvement Credit, a major mistake that could  not have come at a worse time.\n\nAmidst the rising cost of living, Americans are now being denied an  important tool to lower their energy costs solely so billionaires could  get another unneeded tax giveaway. That is why I introduced…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694884/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…them of these  cost savings.\n\nThis is especially concerning at a time when we are hearing more and  more stories about the damaging impacts of Trump's extreme tariffs, the  rising cost of groceries, and the chaos and uncertainty that Trump is  bringing every day to our economy.\n\nPeople are concerned about a Trump recession. That is what they are  worried…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689263/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…depending on those tax  credits in  order to make insurance affordable for them. People like Vivian in my  district, who I had a phone conversation with recently about the rising  cost of her healthcare premiums due to the Republicans' cruel refusal  to extend ObamaCare tax subsidies, are depending on those tax credits.\n\nShe told me: That is just an amount…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697217/medical-bills-are-too-high"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…to buy a home on their own--and not a Justice Department  bailout--all while November 1 is fast approaching and tens of millions  of Americans face this healthcare crisis: rising cost or a total  elimination of their healthcare or medical debt. Costs are already  high--and now this. It is time to do the right thing and to take a  stand.\n\nAnd with the…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…high cost of living or fix the economic mess created by the  President's trade war. In fact, it adds more burden for Minnesota  families who are looking for help with the rising cost of living.\n\nNearly 1.3 million Minnesotans--about one quarter of our state--are  covered by Medicaid. A cut of this magnitude would have severe  consequences for health…", "date": "2025-04-14", "source_url": "https://justfacts.votesmart.org/public-statement/1690119/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "…than $1.5 billion from his crypto ventures like World  Liberty Financial. Trump is profiting off the Presidency while American  families are worried about their jobs, the rising cost of groceries,  and how they will pay their bills. Trump is profiting from decisions  that make it easier for countries like China to get their hands on some  of our most…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699791/9999"}, {"senator": "Emanuel Cleaver II", "party": "Democrat", "sentence": "…priced millions out of homeownership, strained household  budgets, and constrained employers' abilities to attract workers.\n\nAmericans want their Representatives to act on the rising cost of  living. For most American families, the monthly housing payment is  their single largest expense. Representing about one-third of the  Consumer Price Index, housing…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699796/housing-for-the-21st-century-act"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "Ms. McCOLLUM. Mr. Speaker, House Republicans just wasted another week  in Washington with no legislation to show for it that would address our  shrinking economy or rising cost of living.\n\nInstead, they launched a series of attacks on a national park, an  endangered species, and the ability of states to set strong standards  to protect the air…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690603/house-republicans-senseless-attacks-on-public-health-and-our-environment"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…about costs  over a 10-year time horizon, so let's consider what that cost will be  here.\n\nThe cost is surely going to grow in terms of the year-over-year cost  given, A, the rising cost of healthcare; and, B, increased enrollment.  When you are the only State that is offering this most generous  benefit, it entices people to come to your State. Indeed,…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688154/protect-medicaid-benefits-for-american-citizens"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…eight of the top ten States with the highest energy costs are  blue States that are run by Democrat State legislators and Democrat  governors. They want to talk about the rising cost of energy. It  disproportionately affects blue States. Why? Because they have terrible  policies.\n\nThis bill is quite simple: It restores the definition that Congress  originally…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698562/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…life more  affordable, which we must do.\n\nAnother area my colleagues and I have been discussing on both sides  of the aisle, which is a real issue for most Texans, is the rising cost  of healthcare.\n\nNow, if you have only been listening to our Democratic colleagues,  you would be forgiven for thinking Republicans have done nothing to  address the cost…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698258/nominations"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…looking forward to the results of this and then  being able to act to use whatever leverage we have here at the Federal  level to try to spare Californians from the continually rising cost of  gasoline and to restore a little dose of common sense to our State's  energy policy.                        State of California's Economy\n\nMr. KILEY of California. Mr.…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697101/highlighting-the-state-of-california"}]