[{"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…for working Americans.  These rollbacks are a direct assault on workers' safety, wages, and  dignity.\n\nFrom healthcare workers, many of them women and women of color, at  risk of losing minimum wage and overtime protections; to construction  workers who could now be forced to operate in unsafe conditions with no  guarantee of adequate lighting or visibility…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695577/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…eight nursing home residents, three out of every 10 working-age  adults with disabilities, and one out of every six adults ages 19  through 64. These individuals are at risk of losing their healthcare  under the Republicans' budget plans.\n\nMy Republican colleagues have been directed to cut $880 billion from  the Energy and Commerce Committee, which oversees…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690244/health-disparities-in-minority-communities"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…million--to ensure the program continues through  September 2025. We can and must give our local workers this certainty  during an uncertain time. Without these funds, we risk losing momentum  in the recovery and leaving workers without crucial support.\n\nMaui's recovery is not just a priority. It is a promise to those who  have lost so much. I will keep…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689959/maui-dislocated-workers-program"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…a physician, I know that access to healthcare is literally a  matter of life and death. I am terrified about what it means for my  district, where 200,000 people are at risk of losing their healthcare.  Many of them are children, disabled members of our community, and our  seniors. They will have to go without Medicaid services.\n\nNow, don't get me wrong,…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688236/democratic-proposals"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…that impact  marginalized groups, such as Black and brown students. Further, the  Republicans Budget plans seek to dramatically cut education funding,  with Illinois at risk of losing approximately $793 million and 12,000  teachers. Further, Trump's cuts threaten the Individuals with  Disabilities Act (IDEA) that provides protection and funding for…", "date": "2025-04-21", "source_url": "https://justfacts.votesmart.org/public-statement/1690128/alarm-at-the-trump-administrations-dangerous-attack-on-education"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…doctors when they are unwell, they can stay healthy for longer  periods of time. When people can stay healthy, they don't miss work.  When people don't miss work, they don't risk losing their jobs.\n\n``The way things work now only encourages the constant classist act  of keeping the sick and poor sick and poor. This should never ever be  the situation in…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…less every single  day.\n\nThe Senate must take up the 3-year ACA tax credit extension to  address healthcare costs. We must make sure that we restore Medicaid  funding, or we risk losing hospitals like Fauquier Hospital.\n\nWorking in healthcare is often a thankless job, and I hope the House  will join me in thanking the nurses, doctors, and staff that keep…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698917/korean-american-day"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…strong opposition to this Republican  rip-off. This budget slashes $880 billion from Medicaid, putting  286,000 people in my district, including nearly 100,000 children, at  risk of losing healthcare.\n\nMadam Chair, cruelty is the point.\n\nIt also targets food assistance, leaving over 147,000 New Yorkers in  my district struggling to afford meals.\n\nCruelty…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688073/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…Medicare and Social  Security that are going to be devastated because of these cuts.\n\nIn California, there are 470,000 people on Medicaid, and they are  going to be at risk of losing their care because of what the Republican  budget plans to do. This is 140,000 children under the age of 19 and  40,000 seniors over the age of 65 just in my district.…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691088/big-backstabbing-bill"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…need to reconfigure software to allow taxpayers to properly       file. If the District must reverse the changes pursuant to       implementing the Act, it could be at risk of losing vendors       who normally participate in DC tax filing, as the current       products that are already approved and in use would no longer       be valid.\n\nFor the current…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699680/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…policies have assumed that veterans have been financially  irresponsible for assuming mortgages they can't afford, today's  financial and housing market puts veterans at risk of losing their  homes in a much more vulnerable situation.\n\n``Even a straightforward solution, such as forcing veterans to sell  their homes to cover their arrears, would not leave…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689686/prioritizing-veterans-survivors-act"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "…Billionaires win.\n\nMr. Speaker, 17 million Americans will lose their health insurance.  This is the largest healthcare cut ever.\n\nMr. Speaker, 42 million Americans are at risk of losing food  assistance. Children will go hungry.\n\nRepublicans claim to be the party of faith, patriotism, and families.  A ``yes'' vote supports none of these virtues.\n\nThis…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693181/one-big-beautiful-bill-act"}, {"senator": "Jahana Hayes", "party": "Democrat", "sentence": "Mrs. HAYES. Mr. Speaker, I rise today against the Republican  reconciliation bill, which would put 42 million Americans at risk of  losing their SNAP benefits.\n\nThese policies are untested, dangerous, and arbitrary. Congress did  not engage in a thoughtful process to make these changes to SNAP. The  majority…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693232/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…receive only partial funding to  provide healthcare services for low-income patients.\n\nFor Head Start, if funding lapses, thousands of low-income children  would be at risk to losing access to Head Start programs.\n\nSenior nutrition grants are at risk, Meals on Wheels as well as  congregate meals.\n\nWorker protection agencies would likely furlough Federal…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699573/consolidated-appropriations-act-2026"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…rise  today to do my duty and uphold my oath to protect the Constitution.\n\nThe effort is not about partisanship. It is about principles. If we  don't draw the line now, we risk losing the rule of law entirely. If we  don't act today, we are complicit in letting democracy erode on our  watch.\n\nThat is why I introduced H. Res. 353 to impeach Donald J. Trump,…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1690991/the-truth-still-matters"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…eight State agencies have a  high risk of waste, fraud, and abuse. Yet they have taken  zero corrective action--no corrective action. Across the board, the  State is at risk of losing billions to fraud in food assistance,  unemployment benefits, and in the State's Medicaid Program.\n\nIn New York, Republican lawmakers are calling for an independent  audit…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698560/fraud-accountability-act"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…Now we find out that the data, there  is a lot of concern about mRNA, in particular.\n\nI talked to nurses who were crying in our office, but they felt like  they couldn't risk losing their job. They chose to get shots that they  were concerned about. The coercive power of the access to earning a  living is a massive amount of power. People can't afford…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693006/central-bank-digital-currency"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…Research Protection Act updates and clarifies the  definition of malign foreign talent recruitment programs to protect our  national investments.\n\nIf we do not act now, we risk losing the technological edge that has  kept our country secure, prosperous, and at the forefront of global  innovation.\n\nWe have a responsibility to protect American research,…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688932/united-states-research-protection-act"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…in southern New Mexico supports Patriot missile live-fire  exercises, aerial gunnery, and large-scale mobilization training.  Without these vital training areas, we would risk losing our military's  strategic advantage over hostile foreign nations.\n\nI commend Representative Begich for his leadership on this effort.  His bill provides long-term certainty…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697636/public-lands-military-readiness-act-of-2025"}, {"senator": "Nathaniel Moran", "party": "Republican", "sentence": "…incorrect information, the court often has no ability to offer relief  to that taxpayer. Cases can be dismissed before the merits are even  heard, putting taxpayers at risk for losing their claim when they are  not at fault for missing the deadline. That is not a just result. This  bill ensures the court can make determinations based on the substance…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697270/tax-court-improvement-act"}]