[{"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…veterans groups--they backed off. But make no mistake about it, a cut  of 30,000 will decimate the ability of the VA to provide good  healthcare to our veterans, who have risked their lives for us.\n\nSecretary Collins is making the VA so toxic that workers are leaving  on their own. The workers--I have talked  to so many of them--are dedicated to helping…", "date": "2025-07-08", "source_url": "https://justfacts.votesmart.org/public-statement/1693277/veterans-administration"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…many of his followers as well. But we  paid a price as well.\n\nThe men and women of the United States stood behind Congress's  decision and enlisted in our services and risked their lives in combat  in Afghanistan. It was a terrible assignment. They did it honorably.  They did it effectively.\n\nOne of the keys to their success in eliminating Osama bin Laden…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693450/temporary-protected-status"}, {"senator": "Josh Harder", "party": "Democrat", "sentence": "…rise during Wildfire  Awareness Month to recognize the 1st anniversary of the Corral Fire in  San Joaquin County, California, and to honor the brave men and women  who risked their lives to contain this dangerous wildfire.\n\nMy home district of San Joaquin County is no stranger to wildfires-- we are in the midst of a growing megafire crisis, and in 2024…", "date": "2025-05-23", "source_url": "https://justfacts.votesmart.org/public-statement/1691677/recognizing-the-1st-anniversary-of-corral-fire-in-san-joaquin-county-california"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…pray for the families of  the 132 people now confirmed dead in Central Texas. We continue to pray  for everyone still missing. We thank our heroic first responders who  risked their lives to save those trapped in the storm.\n\nNow, in the aftermath of the tragedy in Texas, some of us asked very  necessary questions about how to prevent something like this…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693517/central-texas-floods"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…gallery that day as an insurrectionist mob converged on the Capitol.  Officers from the Capitol Police, Metropolitan Police Department, and  numerous other departments risked their lives to protect us and our  democracy.\n\nAs seen here, these officers were brutally assaulted with flag poles,  bear spray, stun guns, knives, and bats. Over 140 officers were…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691167/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…of Homeland Security's termination of temporary protected status for  Afghans. TPS has provided a lifeline to Afghans who supported U.S.  national security efforts and risked their lives to support our  missions.\n\nWe offered them protection here because when allies stand with us, we  have a responsibility to stand with them. This principle is a national…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691559/protect-the-afghans-who-served-us"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…agencies, at every level of government, have come together to help save  lives. At Camp Mystic, the counselors, many of whom had just graduated  from high school, risked their own lives to save younger campers. We  will never forget that bravery.\n\nThis disaster has impacted people of both political faiths-- Republicans and Democrats--and Independents…", "date": "2025-07-08", "source_url": "https://justfacts.votesmart.org/public-statement/1693273/central-texas-floods"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…actions of a single person and distorting this horrific, isolated  incident to justify suppression and cruelty against many more who have  done nothing wrong, many who have risked their lives, families, and  communities to support U.S. servicemembers during the long war in  Afghanistan.\n\nAnother example: Look at the President's commentary related to  members…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698866/commerce-justice-science-energy-and-water-development-and-interior"}, {"senator": "Sheila Cherfilus-McCormick", "party": "Democrat", "sentence": "…the deadliest conflict in  the world? There is no temporary protected status for them.\n\nWhy wasn't any grace extended to Afghans, who helped our soldiers at  war and risked their lives for the American people? This administration  ended their deportation protections on the same day they welcomed  Afrikaners.\n\nFor those Haitians who fled instability…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691340/make-refugee-policy-same-for-all"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "Ms. KAMLAGER-DOVE. Mr. Speaker, with the NDAA before us, we had an  opportunity to do right by the Afghan allies who risked their lives to  protect American servicemembers throughout our 20-year involvement in  Afghanistan.\n\nAfter months of bipartisan work and real progress, a key provision of  my Enduring…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697852/providing-for-consideration-of-hr-promoting-efficient-review-for-modern-infrastructure-today-act-providing-for-consideration-of-hr-increasing-investor-opportunities-act-providing-for-consideration-of-hr-electric-supply-chain-act-providing-for-consideration-of-hr-state-planning-for-reliability-and-affordability-act-providing-for-consideration-of-hr-improving-interagency-coordination-for-pipeline-reviews-act-providing-for-consideration-of-s-disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-and-for-other-purposes"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…Cabinet meetings at the White House.\n\nDid you speak up when he gutted public education, slashed funds for  pediatric cancer research, fired thousands of veterans who risked their  lives for their country; when he abandoned our allies and our  international commitments at a time when floods, fires, hurricanes, and  droughts are devastating communities…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…importance to the Congressional Black Caucus,  the constituents we represent, and all Americans.\n\nMr. Speaker, I rise to pay homage to the men and women who 5 years  ago risked their lives protecting the lives of those elected officials  who met in this Hall in fulfillment of their constitutional duties to  peacefully transfer Presidential power after the…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698554/january-6-attack"}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "…shot my helicopter out of the Iraqi sky; the day that I  could have died; the day that I probably should have died but didn't,  thanks to the courage of my buddies who risked their lives to save my  own.\n\nSo I come here this afternoon, battle wounds and all, not because I  am scared of war--I am not; been there, done that; got the t-shirt.  Titanium legs…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696554/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…survived, and  now they are asking us to protect them from the Taliban's excesses. The  President has decided: No, thanks.\n\nHe slammed the door on Afghan nationals who risked their lives to  save the lives of American soldiers, and he didn't stop there. In  addition to suspending these applications for Afghan nationals, the  Trump administration paused…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699112/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Maggie Hassan", "party": "Democrat", "sentence": "…to be  checks on the Presidency, but this President seems to think that the  clear rules set out in the Constitution are merely a suggestion box.\n\nSurely, as patriots risked their lives, treasure, and sacred honor to  establish a breathtaking experiment in self-government, they didn't  intend to allow a President to use the long and hallowed arm of justice…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698503/9999"}, {"senator": "Mike Simpson", "party": "Republican", "sentence": "…to empower military families in Idaho  and nationwide, an effort that shows pride and support for our Nation.\n\nAmerica would not be what it is today without those who risked their  lives for the greater good. Our service members and their families have  sacrificed so much for our Nation.\n\nMr. Speaker, as we take time this month to recognize those who…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690811/recognizing-chobanis-military-appreciation-efforts"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…2006.\n\nThese are the individuals in Minnesota that ICE--who is being  attacked, criticized, and demonized by my colleagues on the other side  of the aisle--went out, risked their lives, and put their lives on the  line to remove these people from our streets so that our children and  our families might be safe.\n\nNo, I am not going to apologize for ICE.…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}]