[{"senator": "Jason Crow", "party": "Democrat", "sentence": "…House  gallery that day as an insurrectionist mob converged on the Capitol.  Officers from the Capitol Police, Metropolitan Police Department, and  numerous other departments risked their lives to protect us and our  democracy.\n\nAs seen here, these officers were brutally assaulted with flag poles,  bear spray, stun guns, knives, and bats. Over 140 officers…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691167/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "Ms. KAMLAGER-DOVE. Mr. Speaker, with the NDAA before us, we had an  opportunity to do right by the Afghan allies who risked their lives to  protect American servicemembers throughout our 20-year involvement in  Afghanistan.\n\nAfter months of bipartisan work and real progress, a key provision of…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697852/providing-for-consideration-of-hr-promoting-efficient-review-for-modern-infrastructure-today-act-providing-for-consideration-of-hr-increasing-investor-opportunities-act-providing-for-consideration-of-hr-electric-supply-chain-act-providing-for-consideration-of-hr-state-planning-for-reliability-and-affordability-act-providing-for-consideration-of-hr-improving-interagency-coordination-for-pipeline-reviews-act-providing-for-consideration-of-s-disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-and-for-other-purposes"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…police, and everybody wants to say that  we honor them. Let's really honor them.\n\nLet's put up a permanent plaque for future generations of Americans  to see that these officers risked their lives for the people in this  Chamber, for the Members of the House and the Senate, for the  leadership of the House and the Senate, for the staff who work here,  and…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691242/leosa-reform-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…have suggested this $400  million boondoggle. He never would have thought that the American  people should pay billions of dollars to retrofit the plane. He never  would have risked the American security in the threat that is posed by  foreign powers bugging or hacking the security devices or disabling the  mechanisms of this plane.\n\nAnd if this President…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691071/9999"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…veterans groups--they backed off. But make no mistake about it, a cut  of 30,000 will decimate the ability of the VA to provide good  healthcare to our veterans, who have risked their lives for us.\n\nSecretary Collins is making the VA so toxic that workers are leaving  on their own. The workers--I have talked  to so many of them--are dedicated to helping…", "date": "2025-07-08", "source_url": "https://justfacts.votesmart.org/public-statement/1693277/veterans-administration"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…great importance to the Congressional Black Caucus,  the constituents we represent, and all Americans.\n\nMr. Speaker, I rise to pay homage to the men and women who 5 years  ago risked their lives protecting the lives of those elected officials  who met in this Hall in fulfillment of their constitutional duties to  peacefully transfer Presidential power after…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698554/january-6-attack"}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "…options for pain management, more delays in  processing benefits.\n\nIs this really where Elon Musk and Donald Trump want to save a buck?  Off the backs of veterans who have risked everything for us?\n\nThis is not how the United States should treat our veterans. That is  why I stand here today as a veteran myself, with Senator Blumenthal and  our colleagues,…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688446/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…carriers when a carrier filed a petition for       emergency temporary authority to provide services to a       particular area. The court determined that the ICC's decision       risked the agency not obtaining relevant information, that       this risk could result in serious economic consequences to       those affected, and that the decision had a substantial…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694840/government-accountability-office-legal-opinion"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…deployed to Korea for what he thought was a police action  but soon realized it was a full-scale war. With a fighting spirit, he  found himself in combat during the Korean war and risked his life to  rescue 40 soldiers from behind enemy lines.\n\nReturning home to Harlem, New York, Rangel was first elected to  Congress in 1970 and would go on to serve  23 terms…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699863/paying-homage-to-the-black-men-and-women-of-the-armed-forces"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…Honorable Congressman Tim Burchett and all his  great bipartisan advocates. I encourage my colleagues to join me in  supporting  this measure.\n\nMr. Speaker, our Afghan allies risked their lives for America. The  United States must continue to do everything it can to support our  partners on the ground providing assistance to Afghan civilians,  including…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692739/no-tax-dollars-for-terrorists-act"}, {"senator": "Maggie Hassan", "party": "Democrat", "sentence": "…branches to be  checks on the Presidency, but this President seems to think that the  clear rules set out in the Constitution are merely a suggestion box.\n\nSurely, as patriots risked their lives, treasure, and sacred honor to  establish a breathtaking experiment in self-government, they didn't  intend to allow a President to use the long and hallowed arm…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698503/9999"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…to pray for the families of  the 132 people now confirmed dead in Central Texas. We continue to pray  for everyone still missing. We thank our heroic first responders who  risked their lives to save those trapped in the storm.\n\nNow, in the aftermath of the tragedy in Texas, some of us asked very  necessary questions about how to prevent something like…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693517/central-texas-floods"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…They survived, and  now they are asking us to protect them from the Taliban's excesses. The  President has decided: No, thanks.\n\nHe slammed the door on Afghan nationals who risked their lives to  save the lives of American soldiers, and he didn't stop there. In  addition to suspending these applications for Afghan nationals, the  Trump administration…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699112/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…and many of his followers as well. But we  paid a price as well.\n\nThe men and women of the United States stood behind Congress's  decision and enlisted in our services and risked their lives in combat  in Afghanistan. It was a terrible assignment. They did it honorably.  They did it effectively.\n\nOne of the keys to their success in eliminating Osama…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693450/temporary-protected-status"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…in his  Cabinet meetings at the White House.\n\nDid you speak up when he gutted public education, slashed funds for  pediatric cancer research, fired thousands of veterans who risked their  lives for their country; when he abandoned our allies and our  international commitments at a time when floods, fires, hurricanes, and  droughts are devastating communities…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "…amount has gradually increased from $10 to  $100, to what stands today at approximately $1,400 per month.\n\nBut let's pause and think about that: $1,400 a month for those who  risked everything--their safety, their future, their very lives for  freedom, for the opportunity for all of us to be here today.\n\nToday, there are 61 living Medal of Honor recipients,…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696586/medal-of-honor-act"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…so that my  children and those I do not know can live free lives. Knowing the  burdens of tyranny, knowing what it meant to live under the heel of a  King, our forefathers risked everything.\n\nIn nations around the world that I have visited on your behalf as a  Senator, people yearning for freedom and people recently free have come  and spoken about…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692447/alex-padilla"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…terrorist sympathizers. That is the  nonnegotiable bottom line.\n\nThey deserve to know--we all deserve to know what actions the Biden  administration took or did not take that risked their safety. At this  afternoon's hearing, we will give the American people the answers or at  least begin to give them the answers that they and we deserve.", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699092/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…since 2006.\n\nThese are the individuals in Minnesota that ICE--who is being  attacked, criticized, and demonized by my colleagues on the other side  of the aisle--went out, risked their lives, and put their lives on the  line to remove these people from our streets so that our children and  our families might be safe.\n\nNo, I am not going to apologize…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…meant to challenge an  authority that refused to listen. They understood what it meant to  stand up, too often alone, and declare that sovereignty belongs to the  people.\n\nThey risked their livelihoods, Mr. Speaker, their reputation, their  families. They risked everything so that future generations might  inherit a nation grounded in rights, not repression,…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697723/free-iran"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…combat zones required  extraordinary courage and was vital to saving countless lives. His  service reflects the bravery and sacrifice of the many Medevac crew  members who risked everything to bring others to safety.\n\nIn his military service, MSgt Timmins was recognized with two  citations for his courage and devotion to duty under hazardous  conditions--an…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692874/recognizing-master-sergeant-gerald-timmins-for-his-service-with-the-us-marine-corps-as-a-member-of-the-medevac-crews-during-the-vietnam-war"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…history, socialism has led to  disaster, starvation, imprisonment, and the death of over 100 million  people worldwide.\n\nMy own family lived those horrors. My mother-in-law risked her life  crossing the DMZ lines multiple times to rescue loved ones from the  North Korean regime. To this day, tens of thousands of Korean families  remain separated by a…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697152/denouncing-the-horrors-of-socialism"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…Allen's service didn't stop there. In 1980, he made a  daring, unauthorized voyage to Communist Cuba to rescue refugees during  the Mariel boatlift, an act of moral courage that risked his freedom  once again.\n\nIn later years, Allen became a speaker, mentor, and educator. He  published a book of POW stories for schools, and he made personal  classroom appearances.…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691271/congratulating-northwest-florida-state-womens-basketball-team"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…combat zones demonstrated  extraordinary courage and was vital to saving countless lives. His  service reflects the bravely and sacrifice of so many Dustoff crew  members who risked everything to bring others to safety.\n\nFollowing his military service, Mr. Sarrault has remained a steadfast  advocate for veterans and his community. He is an active member…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692726/thanking-roger-sarrault-for-his-service-with-the-us-army-as-a-member-of-the-dustoff-crews-during-the-vietnam-war"}, {"senator": "Mike Simpson", "party": "Republican", "sentence": "…initiative to empower military families in Idaho  and nationwide, an effort that shows pride and support for our Nation.\n\nAmerica would not be what it is today without those who risked their  lives for the greater good. Our service members and their families have  sacrificed so much for our Nation.\n\nMr. Speaker, as we take time this month to recognize those…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690811/recognizing-chobanis-military-appreciation-efforts"}]