[{"senator": "Jared Huffman", "party": "Democrat", "sentence": "…all of this, frankly, is just political  theater.\n\nMr. Speaker, to the point about the so-called viability of coal,  let's just zoom in on the coal industry in the Powder River Basin, the  very place that would be impacted by this CRA. On October 6, the Bureau  of Land Management held a lease sale for 167 million tons of coal on  public lands on the…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696881/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…going to strip local land managers of the  ability to respond to future challenges, changes,  and needs in the Arctic National Wildlife Refuge, the NPR-A, and the  Powder River Basin. If these reckless resolutions pass, these places  will be locked into outdated plans that fail to account for changes in  community needs, industry needs, and, yes, climate-driven…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696836/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…to  evaluate the potential impacts of the 2024 supplement to the 2016 Glen  Canyon Dam Long-Term Experimental and Management Plan Record of  Decision on the Upper Colorado River Basin Fund.\n\nThe Colorado River is an essential water resource, supplying water  for municipal and agricultural uses, energy production, and fish and  wildlife habitat. However,…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691058/memorandum-of-understanding-to-address-potential-impacts-of-a-certain-record-of-decision-on-the-upper-colorado-river-basin-fund"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…opposition to this  resolution.\n\nWho is this conference made up of, you might ask, Mr. Speaker? It is  made up of 37 federally recognized Tribes and villages across the Yukon  River Basin. These Tribes served as cooperating agencies in the RMP  development process working to ensure protection for critical salmon  habitat and other interests, and they endorsed…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694899/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "Mr. Speaker, I rise in support of H.R. 3428, a bill to direct the GAO  to review the three Mid-Atlantic River Basin Commissions and report on  the practices and Federal responsibilities of each commission.\n\nThe Mid-Atlantic River Basin Commissions serve an important role in  the region…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695002/mid-atlantic-river-basin-commissions-review-act"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…and non- Tribal leaders alike all across this Nation.\n\nAs chairman, he helped establish Bears Ears and Camp Hale National  Monuments, elevated Tribal voices in the Colorado River Basin, and  advocated for the protection of the Dolores River.\n\nAfter generations of the unjust loss of their ancestral homelands,  Chairman Heart led the efforts to secure full…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696559/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…agenda, which was anywhere but America, any worker but American  energy agenda.\n\nLast year, I had the opportunity to join Representative Hageman on a  tour across the Powder River Basin, where we visited the coal mines and  met the proud men and women who have been working there for  generations.\n\nWhile I visited one of these mines, I met a union electrician,…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696882/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Steve Daines", "party": "Republican", "sentence": "…Now, why is this important to Montana? The Biden amendment prohibits  all new coal leasing across all of Eastern Montana.\n\nEastern Montana and Wyoming are home to the Powder River Basin. These  are the largest coal reserves in the United States.\n\nMany who are watching, when you think about Montana, you think about  our amazing fly-fishing streams, our national…", "date": "2025-10-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696070/9999"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…management  plan, or RMP, amendment for the Buffalo Field Office in Wyoming, which  was finalized in the twilight hours of the Biden-Harris administration.\n\nWyoming's Powder River Basin currently supplies 40 percent of the  Nation's coal. The RMP amendment in question effectively halted future  Federal coal leasing across a region in Wyoming larger than…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696879/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Steve Daines", "party": "Republican", "sentence": "…Resource Management Plan that  prohibited all new coal development in Eastern Montana. It shuts it  down. This means that the BLM prohibited all new coal leasing in the  Powder River Basin. By the way, that is the home of the largest coal  reserves in the United States.\n\nThey did this despite strong opposition from local counties in  Montana and local elected…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696095/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…Area  Power Administration, or WAPA, to enter into a memorandum of  understanding to address the impacts that bypass flows at Glen Canyon  Dam have had on the Upper Colorado River Basin Fund.\n\nIt is worth taking a moment to highlight why we are here today. Under  the Biden administration, the Bureau of Reclamation wanted to rush to  implement bypass flows…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691059/memorandum-of-understanding-to-address-potential-impacts-of-a-certain-record-of-decision-on-the-upper-colorado-river-basin-fund"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…friend Senator Cynthia Lummis of Wyoming led the  repeal of the harmful Buffalo Resource Management Plan. That is really  good news for Wyoming's energy producers. The Powder River Basin in  Wyoming supplies about 45 percent of all the coal in the country.\n\nSenate Republicans also cut wasteful Washington spending. We cut over  $1 trillion in waste, fraud,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698252/nominations"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…That is what makes  the Miles City Resource Management Plan amendment so egregious.\n\nThis RMP amendment virtually ended future coal leasing across  Montana's entire Powder River Basin, dealing a severe blow to America's  energy security and threatening Montana jobs and economic growth.\n\nThe national security and economic importance of this region cannot…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694888/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…suspend the rules and pass the  bill (H.R. 1001) to provide for a memorandum of understanding to  address the impacts of a certain record of decision on the Upper  Colorado River Basin Fund.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:                                 H.R. 1001\n\nBe it enacted by the Senate and House of Representatives…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691060/memorandum-of-understanding-to-address-potential-impacts-of-a-certain-record-of-decision-on-the-upper-colorado-river-basin-fund"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…BARRETT. Mr. Speaker, I move to suspend the rules and pass the  bill (H.R. 3428) to require the Comptroller General of the United  States to conduct a review of the Mid-Atlantic River Basin Commissions,  and for other purposes.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:                                 H.R. 3428\n\nBe it enacted…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695003/mid-atlantic-river-basin-commissions-review-act"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…legislation,  H.J. Res. 130, which utilizes the congressional disapproval procedure  under the Congressional Review Act, or CRA, to restore coal leasing in  Wyoming's Powder River Basin.\n\nMany on the East Coast of America might be surprised to learn that  the Federal Government owns massive amounts of the western States.\n\nIn Wyoming, the Federal Government…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696878/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…is one of our most affordable, reliable, and abundant sources  of energy on the planet. And in America, we can use that coal cleaner  than ever before.\n\nWyoming's Powder River Basin produces the cleanest burning coal in  the world. Nearly half of all coal produced in America comes from the  Powder River Basin in Wyoming and our neighboring State of…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689762/coal"}, {"senator": "Robert Bresnahan, Jr.", "party": "Republican", "sentence": "Mr. BRESNAHAN. Mr. Speaker, I am proud to introduce H.R. 3428, the  Mid-Atlantic River Basin Commissions Review Act.\n\nThis legislation will bring much-needed oversight and clarity to the  activities and funding streams for the Delaware River Basin Commission,  Susquehanna…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695001/mid-atlantic-river-basin-commissions-review-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Mr. HILL of Arkansas. Mr. Chair, additionally, this program would  build upon the previous success that the Arkansas delegation achieved  in the last Congress for the White River Basin Comprehensive Study.\n\nMr. Chair, I thank the leadership of the committee, I thank the Rules  Committee, and Chair Foxx for adding this amendment under consideration  for…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694859/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…administration's disastrous and radical resource management  plans, beginning with H.J. Res. 104 to repeal the Miles City RMP in  Montana to ensure continued access to the Powder River Basin.\n\nThese Biden-era plans lack balanced resource management and, in fact,  are mineral withdrawals in disguise, which runs contrary to Federal  law. They lock up America's…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694893/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}]