[{"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…impound and steal funds, and there never has been. I don't care if the  President is Republican or Democrat. The late Justices Scalia and  Rehnquist said so. Chief Justice Roberts and Justice Kavanaugh have  said so. By the way, they are no liberal torchbearers.\n\nThe Department of Justice and the Government Accountability Office  have said so. Over…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692541/rescissions-act-of-2025"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…to me--not Al Green, the President--that is my Justice  Department. Let me see you get my Justice Department to enforce your  order, Mr. Judge.\n\nMore specifically, Mr. John Roberts, get my Justice Department to  enforce your order. Let me see you get my marshals to enforce your  order.\n\nThis President, whether wittingly or unwittingly, has put himself…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688663/incivility-in-chamber"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…inspiring individuals.\n\nThis morning, I will join with over half a dozen women who endured  unimaginable horrors because of Jeffrey Epstein. I will also join with  Sky and Amanda Roberts, the brother and sister of Virginia Giuffre, the  late Epstein survivor who spoke out on behalf of so many.\n\nI am wearing this blue butterfly to show solidarity with them.…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699879/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…the Constitution and combatting       the left-wing assault on American values.\n\nWe agree that the time for race-based decisions in       government is over. As Chief Justice Roberts wrote in SFFA v.       Harvard, ``Eliminating racial discrimination means       eliminating all of it.'' 600 U.S. 181, 206 (2023). We also       agree that Justice Kavanaugh…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694943/bloody-sunday-and-voting-rights-act"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…Plessy v. Ferguson, the same kind of laws that are being  signaled now in the Supreme Court in the Shelby v. Holder decision.  Just read it and you will see that what Justice Roberts wrote in that  decision could have been lifted from those decisions of the 1870s. Jim  Crow 2.0 is upon us.\n\nMr. Speaker, that bill is coming to this floor. If that bill is…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689339/fighting-voter-suppression"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…Federal judiciary by calling for the impeachment of Federal judges  who rule against him rather than appealing the decisions, as was  explained to all by Chief Justice John Roberts on March 18, 2025.\n\nI am among the throngs who know that the President violates the Fifth  Amendment constitutional right to due process when he condones the  deportation…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691346/proud-to-be-an-unbought-unbossed-liberated-democrat"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…happening with the  judiciary. In fact, this President actually said he didn't know if he  even had to uphold the Constitution. Then, this administration is going  to sue Justice Roberts. We have moved from three branches of government  to one branch of government.\n\nRepublicans are silent tonight, just like they have been silent at  all the markups and all…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690637/trumps-first-100-days"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize Arianna Roberts  Garcia for earning the Arvada Wheat Ridge Service Ambassadors for Youth  Award.\n\nArianna has overcome many challenges along her journey to success,  demonstrating perseverance…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689672/recognizing-arianna-roberts-garcia"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize Lilith Roberts- Ruiz for earning the Arvada Wheat Ridge Service Ambassadors for Youth  Award.\n\nLilith has overcome many challenges along her journey to success,  demonstrating perseverance…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691136/recognizing-lilith-roberts-ruiz"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…journey with God. As an adult, she  shared her vision of becoming a Minister with her mother, Mrs. Sallie  Mae Sanders Baker, and other Pastors at Ebenezer, Reverend Lloyd  Roberts, Reverend Duane Kay, Reverend James Buck, and Reverend W.  Pierce Smith.\n\nFor over 60 years, Reverend Carr has been a devoted member of  Ebenezer Baptist Church, a church…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688586/recognizing-reverend-sarah-yvonne-williams-carr"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…Yifan Zhou\n\nOH: Vidya Akella, Samantha Fleming, Joelle Frederiksen,       Arjun Jain, Paul Moody, Prithika Padmanabhan, Shiven Parikh,       Prisha Reddy Rajulapalli, Kaitlyn Roberts, Soorya Shanmugam,       Aswat Sivakumar, Sahana Srikanth, Sakshum Vij, Riley       Wilkerson, Danielle Wolford\n\nOK: Peyton Mahan\n\nOR: Grace Choi, Maylie Eby, Soohyon Kim,…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692400/congratulating-the-2025-congressional-award-gold-medalists"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Ratner, Moriah: Freelance; Reynolds,       Stefani: Bloomberg News Photo; Riecken, Astrid: Freelance;       Rivas, Ivan: Agence France-Presse; Robbert, Allison:       Freelance; Roberts, Joshua: Freelance; Rourke, Matthew:       Associated Press Photos.\n\nRyan, Patrick: Freelance; Sachs, Ronald: Consolidated News       Pictures; Samperio, Aurora: Freelance;…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698154/members-entitled-to-admission-to-the-119th-congress-press-photographers-gallery"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…wouldn't necessarily be a problem, except he has  repeatedly displayed bias and partisanship.\n\nFor instance, without substance or evidence, he complained to Chief  Justice Roberts that he didn't think President Trump would comply with  judicial orders. That displayed his bias, Mr. Chairman. That displayed  his partisanship.\n\nWithout legal authority…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699047/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "Mr. FALLON. Mr. Speaker, I rise today to recognize Ms. Carmen Roberts  of Celina, Texas, and present her with the Congressional Patriot Award.  Carmen has dedicated herself to faithfully serving our community.\n\nCarmen was born in Chihuahua,…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690747/recognizing-congressional-patriot-award-recipient-carmen-roberts"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…the  amount of evidence that has mounted over people who are voting and  should not be. The record is replete. In one example, ICE arrested  criminal illegal alien Ian Andre Roberts, who was serving as the Des  Moines, Iowa, school district superintendent at the time of his arrest.  After his arrest, it was found that Roberts was a registered voter in…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699943/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…clerk at Peterson Boat  Works in Sturgeon Bay, Wisconsin, Mr. Moddie answered the call to serve  his country by enlisting in the U.S. Army. Following basic training at  Camp Roberts, California, he was assigned to B Battery of the 590th  Field Artillery Battalion, 106th Infantry Division at Camp Atterbury,  Indiana. Excelling in his training on the 105…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695299/recognizing-mr-john-moddie-on-his-100th-birthday-and-for-his-service-with-the-590th-field-artillery"}, {"senator": "Hal Rogers", "party": "Republican", "sentence": "…teams earned three  impressive national tournament trips, bringing great pride to the  Kentucky Appalachian Mountains. He also served as assistant basketball  coach at Oral Roberts University in Tulsa, Oklahoma, and head  basketball coach and business teacher at Pikeville Hjgh School.\n\nAfter investing 20 years in education and coaching student athletes,…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696267/tribute-in-honor-of-wayne-martin"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…TELEVISION       NEWS (ITN); Roark, Amanda: BLOOMBERG RADIO & TV; Roaseu,       Peter: NBC NEWS; Robbins, Michael: FOX NEWS; Robbins, Sarah:       NATIONAL PUBLIC RADIO (NPR); Roberts, Bryan: WTTG-FOX       TELEVISION; Roberts, Makena: NBC NEWS; Robertson, Dominique       Genevieve: CNN; Robertson, John: FOX NEWS; Robertson,       Marcella: WUSA-TV.\n\nRobinson,…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698150/members-entitled-to-admission-to-the-119th-congress-radio-and-television-correspondents-gallery"}]