[{"senator": "Maxine Waters", "party": "Democrat", "sentence": "…financial technologies  to evade sanctions, fund war and terrorism, and destabilize  democracies. Ignoring these threats is not an option.\n\nThis working group is an initial robust approach to gain an  understanding of how to address these terrorism threats and prepare to  meet and predict them.\n\nI thank Representatives Nunn and Himes for introducing…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693962/financial-technology-protection-act-of-2025"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…households enjoying lower prices for cocoa, coffee, and other goods  that the United States cannot produce at home.\n\nAmerican businesses understand the value of supporting robust U.S.- Africa trade, which supports more than 450,000 jobs across the United  States.\n\nFor this reason, the U.S. Chamber of Commerce, the American Apparel &  Footwear Association,…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698904/agoa-extension-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…first time as a  judge. But, unfortunately, this kind of inexperience is common with  President Trump's judicial nominees.\n\nMake no mistake, experience is still important. Robust litigation  experience ensures judicial nominees will be equipped to fulfill their  duties. As an appellate judge, she is going to be standing in judgment  of many trial courts.…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693415/nomination-of-whitney-d-hermandorfer"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Congress should not substitute its authority for that of       local elected leaders and MPD Chiefs who have examined these       issues closely.\n\nWe support having a robust and strong police force and work       closely with MPD leadership to provide them with the tools       they need to make the city safe. Part of that effort includes…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692302/protecting-our-nations-capital-emergency-act"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "…has been  instrumental in strengthening the special relationship between the  United Kingdom and the United States. His work ensured that the ties  between our nations remain robust and responsive to the challenges of a  changing world, fostering collaboration on issues of shared importance  and reinforcing the values that unite us.\n\nNick's efforts extended…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698086/recognizing-nick-alton"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…agriculture exporter, with soybeans and  corn leading the way as the top export.\n\nI want to return to trade agreements. I want to open up more markets.  I want us to have a robust export opportunity for the excellent U.S.  manufactured and grown products.\n\nOur trade agreements have ensured that the U.S. remained the second  largest exporter of manufactured…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689522/klobuchar-ms-murkowski-mr-warner-mr-mcconnell-and-mr2024"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…all now understand the importance of a strong resilient supply  chain, and this bill is a step in the right direction.\n\nI look forward to working with my colleagues to ensure robust funding  for the maritime industry. For this reason, I will vote ``yes'' on H.R.  252.\n\nMr. CARBAJAL. Mr. Speaker, to close, I support H.R. 252 and urge my  colleagues to do…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692208/secure-our-ports-act-of-2025"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…attack on  the Endangered Species Act that the Department of Defense has never  asked for. It is a solution in search of a problem.\n\nThe Department of Defense already has a robust collaboration with the  Department of the Interior's Fish and Wildlife Service. They do  management plans everywhere.\n\nMilitary lands are already excluded from designation…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695233/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Sharice Davids", "party": "Democrat", "sentence": "…while that's  something to celebrate, we have a long way to go.\n\nThe 33 regional HIDTAs across the country are comprised of federal,  state, and local partners, resulting in robust interagency coordination  to respond to the most serious drug threats to the region. However,  recent proposals to cut HIDTA funding by more than 30 percent, and even  to remove…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693340/recognizing-the-crucial-work-of-the-high-intensity-drug-trafficking-area-program"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…entrance day every now and then.\n\nIt is our responsibility to care for our public lands, to support the  people who care for them, and to ensure they reflect the full and  robust history of everyone who shaped this country. That is how we can  honor the past and ensure our public lands remain places that future  generations of Americans can learn from…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697763/semiquincentennial-tourism-and-access-to-recreation-sites-act"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…for energy development, as well. That also  includes grazing, logging, and other commercial activities. They have  to balance all of it in these RMPs.\n\nIt is also based on robust input from communities, stakeholders, the  public, and government-to-government consultation with the impacted  Tribes, as well.\n\nThe Republican majority has proven time and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694887/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…the agency to implement recommendations from the aviation  workforce mental health task group established under the 2024 FAA  reauthorization law.\n\nIt will make significant, robust investments in the FAA's recruitment  and training of aviation medical examiners, particularly those with  mental health expertise.\n\nFinally, this legislation will establish…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695006/mental-health-in-aviation-act-of-2025"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…to sell them these  products.\n\nLast year, committee Democrats worked with Former Chairman McHenry  and my colleague Mr. Flood to ensure that this test contained specific,  robust elements, elements that the Republican witnesses at previous  Financial Services hearings talked about when discussing how they teach  and mentor their budding investors.…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693889/equal-opportunity-for-all-investors-act-of-2025"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…American  economy. Is that what he bragged about? Is that what he campaigned on?  Is that what people voted for?\n\nThis shrinking of the economy, by the way, follows 3 years of robust  growth of our economy under President Biden. I don't think our  Republican colleagues will recognize that, but it is true. The numbers  do not lie.\n\nSo 100 days of chaos,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690535/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…premium tax  credits have protected millions of Americans from higher healthcare  costs, they have reduced the number without healthcare insurance, and  they have provided robust choices for consumers and provided stability  for healthcare providers, particularly in rural areas, and there are  rural areas affected in Connecticut.\n\nIn addition to the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695920/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…Bank, having joined both organizations on June 29, 2009.\n\n(14) On October 26, 2021, Secretary of State Antony Blinken       issued a statement in support of Taiwan's ``robust,       meaningful participation'' in the United Nations system,       which includes the IMF, the World Bank, and other specialized       United Nations agencies. Secretary…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692796/taiwan-non-discrimination-act-of-2025"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…monitoring, missile defense, and reconnaissance  missions.\n\nUnlike other launch sites in the lower 48, Alaska's spaceport  benefits from minimal air traffic congestion and robust launch windows,  enabling greater efficiency and mission success.\n\nThis spaceport is designed to be highly adaptable and can accommodate  a wide range of launch vehicles, from…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687923/space-dominance"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…geek out  on this, but this is important.\n\nRemember, 55 percent of Americans are on Medicare Advantage. I  represent an area with terrific penetration because we have very robust  networks and those things in the Phoenix area, but it was supposed to  come in at 95 percent of the cost of fee-for-service.\n\nToday, according to MedPAC, because I know we…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692327/math-always-wins"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…requirements, reduce  costs, and expedite permit approval times exactly as Congress intended.\n\nThroughout the State-administered review process, Federal agencies  maintained robust oversight to ensure Florida's 404 permitting program  complied with all Federal requirements, while the EPA maintained strict  control over Florida's decisions.\n\nHowever, Florida's…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698026/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…the outstanding  contributions that Shae Burgess has made to our community as a  volunteer with Pasco County Schools. Shae's has been an integral part  of organizing a more robust support system for the school's athletic  teams. With a passion for sports and a heart for service, Shae took on  the challenge of revitalizing the athletic booster program.…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691987/recognizing-shae-burgess"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…season.\n\nFor example, we provide funding so that Agencies like the Bureau of  Land Management, BLM, have greater capacity to issue permits for energy  projects. We have included robust funding from mapping and minerals- related work at the USGS.\n\nWe have also provided funds to bolster development and staffing out  in our U.S. Territories. They are a long…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699014/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…What we saw was people increasing their confidence in our elections.  That  is a good thing. That is a good thing. In the University of Georgia,  Georgia State put forward a robust survey of how elections were  conducted in the State of Georgia. What I saw was high voter  participation and people actually having a positive view of how  election results…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692319/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…establishment       in the Holocaust's consuming shadow are promising. However,       its internal conflicting core issues demand resolution and       reconciliation to guarantee a robust democracy in a       pluralistic Jewish context, eschewing both secular       authoritarianism and oppressive theocracy. Otherwise, the       gates of Gaza (the book's title)…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690665/israel-at-77"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…overstretched Bureau of Indian Affairs and Indian  Health Service resources.\n\nAs a member of the House Appropriations Committee, I am proud of the  work that we have done to provide robust funding for the Indian Health  Service and other critical priorities for federally recognized Tribes  in the fiscal year 2026 Interior appropriations bill.\n\nIf the Tribal population…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697785/ensuring-fairness-and-integrity-in-federal-tribal-recognition"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…offer our condolences to his  family.\n\nBy adopting my colleague's resolution, this Chamber has an  opportunity to honor the legacy that Charlie is leaving. He believed in  robust, respectful, bipartisan debate. He encouraged you to challenge  your own thoughts and actions; he encouraged you to enter into that  debate, to commit to leaving this country…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695706/expressing-support-for-the-designation-of-october-as-the-national-day-of-remembrance-for-charlie-kirk"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…requested in a letter that I am  sending today that the Appropriations Committee and its Subcommittee on  Labor, Health and Human Services, Education, and Related Agencies  provide robust funding for AmeriCorps in the coming fiscal year.\n\nMr. Speaker, I am urging my colleagues on both sides of the aisle to  come together in support of TFA and these other critical…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "James Risch", "party": "Republican", "sentence": "…will improve Ukraine's ability to meet       current and future threats by further equipping it to conduct       self-defense and regional security missions with a more       robust air defense capability. Ukraine will have no       difficulty absorbing these articles and services into its       armed forces.\n\nThe proposed sale of this equipment and support…", "date": "2025-07-28", "source_url": "https://justfacts.votesmart.org/public-statement/1694285/arms-sales-notification"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Historical Park  located in her district as the Saratoga National Battlefield Park.\n\nSaratoga County, New York, is the fastest growing county in New York  State and features a robust economy and world-class tourist  destinations for families and history buffs alike. However, this  prosperous community in upstate New York would not exist if not for a  series…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691018/strengthening-americas-turning-point-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "…by the  natural beauty of the breathtaking Glacial Lakes Region. Home to more  than 300 people and multiple businesses, Veblen is known for its rich  historical heritage and robust rural spirit. Since its beginning 125  years ago, the community of Veblen continues to serve as a strong  example of South Dakota values and traditions.\n\nI offer my congratulations…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692899/recognizing-the-125th-anniversary-veblen-south-dakota"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…immediate consideration in the House.\n\nThe Clerk read the title of the bill.\n\nMr. GUTHRIE.  3062.\n\nMr. Speaker, North America has grown to be an energy superpower due  to the robust trade of oil, gas, and electricity. As energy demand is  projected to increase in staggering numbers over the coming years, the  expansion of cross-border energy infrastructure…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695688/promoting-cross-border-energy-infrastructure-act"}]