[{"senator": "Kevin Kiley", "party": "Republican", "sentence": "…spearheading  this Servant Leadership Award, which will be awarded this weekend, and  the inaugural recipients will be Mark and Marcus Haney. Mark Haney runs  the Growth Factory in Rocklin, which helps early-stage entrepreneurs  build startup businesses. They work with them to build the funding case  and leadership capacity to attract the capital and team needed…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690562/gas-prices-are-lower-for-everyone-except-californians"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Recognizing Robin Trimble on Her Retirement\n\nMr. KILEY of California. Mr. Speaker, I would like to recognize Robin  Trimble, who is retiring as the chief executive officer of the Rocklin  Area Chamber of Commerce, for her 20 years of dedicated service to the  Rocklin community.\n\nFor two decades, Robin has led the chamber with enthusiasm, strength,  and resilience.…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699473/illegal-bio-lab-in-las-vegas"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Speaker, as part of the California  Third Congressional District Police Honor Roll and in honor of National  Police Week 2025, I wish to recognize Detective Sterling Wolfe of the  Rocklin Police Department for his unwavering commitment to serving and  protecting the Rocklin community.\n\nDetective Wolfe has served as a police officer for over a decade. He  has…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…that to continue, of giving our  region a cohesive identity, and I look forward to the 54th annual trip  next year.             Honoring 2025 Graduating Class of Leadership Rocklin\n\nMr. KILEY of California. Mr. Speaker, I rise today to honor and  recognize the 2025 graduating class of Leadership Rocklin. This  prestigious program is run by the Rocklin…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}]