[{"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…Mr. Speaker, I rise today with a heart full of joy to  celebrate a story that reminds us why sports, family, and community  matter.\n\nAt the University of Toledo, sophomore Rocket Miriam Diala was  greeted after a hard-fought win by her mother, Francisca. Her mom had  traveled 4,300 miles from Germany to see her daughter play women's  college basketball…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699647/family-sacrifice-and-the-rocket-spirit"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…same thing.\n\nIn Presidency after Presidency, when the middle class is strong,  demand is strong, and manufacturing is strong. Manufacturing employment  follows.\n\nThis is not rocket science. This is simple, basic economics. A strong  middle class yields strong manufacturing growth and strong  manufacturing employment. It is a lesson that we have had to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695605/devastating-harm-caused-by-trump-administration"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…will be spent replacing the  Minuteman III missile. Why? Why are we doing that? Why are we putting  more money into plutonium pit production? Why do we have a new useless  rocket that we want to put on a submarine? Why are we doing that?\n\nOn the water side of this, the Army Corps of Engineers, money was  removed for flood protection, levies, and infrastructure…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694925/energy-and-water-cuts"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…They don't  want to add trillions of dollars to the debt, and they sure as hell do  not want the wealthy to continue to get rich off the backs of the rest  of us.\n\nThis is not rocket science. They want a tax code that doesn't screw  us over. They want affordable rent and mortgages. They want lower  healthcare costs. They want to see us fighting for a better…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693089/what-americans-want"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…Senators suspected of helping Trump try to steal an election will get a  whole lot richer, and life will get more expensive for everyone else.\n\nThat is because this bill adds rocket fuel to Republicans' larger  assault on Americans' access to quality, affordable healthcare.\n\nRemember, Mr. Speaker, Republicans already slashed $1 trillion from  Medicaid,…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696741/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…these  particulates, sucking in this unhealthy air that vehicles emit.\n\nWe have another direction in which we can head. We have a better  vision for us. By the way, this is not rocket science. We are not  asking anyone to go to Mars. We are just asking people to improve  automotive technology. This is car mechanics. It is not a mission to  the Moon.\n\nSo…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691549/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…properly decided that we should not put more machine  guns into the stream of commerce.\n\nWhat is still swept within it? Any explosive, incendiary, poison gas,  bomb, grenade, rocket, missile having explosive or incendiary charge of  more than \\1/4\\ ounce, mine, device, and so on.\n\nWhy would we open this up if that is not the intention of my  colleague?…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691349/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…other things. Republicans consistently say that losing the  AI race to China would be like losing the Cold War to Russia. The bill  they are proposing today is like selling rocket fuel to the Soviets  during the space race. It defies all logic.\n\nFinally, I want to point out a basic fact. We have already approved  enough permits to triple our LNG exports…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697094/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…sanctions against any person or entity that provides  material support for Russia's military and industrial defense base.\n\nWe know that Russia uses missiles, drones, planes, and rocket  launchers to wreak havoc on Ukrainian cities and citizens. They do this  to overthrow the government, to end democracy in Ukraine, and to seize  Ukrainian territory to reconstitute…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690677/economic-espionage-prevention-act"}, {"senator": "Adrian Smith", "party": "Republican", "sentence": "…month.\n\nSelected from over 1,000 entries from across the Nation, the students  qualified as national finalists after designing, building, flight  testing, and launching their rocket under highly specified requirements  to target an impressive 790 feet and land while keeping the rocket's  payload intact.\n\nOn May 16, I was delighted to welcome members of…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692513/recognizing-the-accomplishments-of-4-h-students-from-fillmore-county-nebraska"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…legacy continues today, where  work is being done to prepare the Artemis II mission.\n\nDuring my visit, I saw firsthand the progress on the SLS, the Space  Launch System, the rocket that will carry astronauts on a 10-day  journey to the Moon, further than we have been from the Earth for over  50 years.\n\nI saw up close the SLS core stage, a 212-foot fuel…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689663/recognizing-extraordinary-work-of-kennedy-space-center"}, {"senator": "James Risch", "party": "Republican", "sentence": "…Weapon System-II       (APKWS-II) All-Up-Round (AUR) (Rotary Wing) and WGU-59A/B       APKWS-II AUR (Single Variant) are a design conversion of an       unguided Hydra 2.75-inch rocket with a laser guidance kit to       provide precision capability. As a low-cost weapon, it is       intended as an inexpensive means to destroy targets while       limiting…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688927/arms-sales-notification"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…innovation, from the rockets that carried our astronauts to the Moon,  to the systems that now protect our homeland and our warfighters. We  have earned the nickname ``The Rocket City'' because innovation and  national defense are in our DNA.\n\nSpace Command is charged with ensuring America's superiority in the  most demanding, contested domain of the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695727/congratulating-lieutenant-general-robert-a-rasch-jr"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…putting capital to work, the very engine that former Fed  Chair Alan Greenspan wrote about in ``Capitalism in America.''\n\nOur capital markets are the fuel and, ultimately, the rocket boosters  for innovation, and this bill, the INVEST Act, launches economic  growth.\n\nI am also proud that my bill, the Greenlighting Growth Act, is a part  of this package,…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697833/increasing-investor-opportunities-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…Description and Quantity or Quantities of Articles or       Services under Consideration for Purchase:\n\nMajor Defense Equipment (MDE):\n\nForty-eight (48) M142 High Mobility Artillery Rocket       Systems (HIMARS)\n\nNon-Major Defense Equipment:\n\nThe following non-MDE items will also be included: M1084A2       HIMARS resupply vehicles; M1095 trailers; Low Cost Reduced…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695912/arms-sales-notification"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…Chair, I rise in opposition to this America last  amendment and reject the premise of the arguments that are being made.\n\nThere are 600,000 Americans who live in Israel, and one rocket has  been fired against every 23 of them, 26,000 rockets since October 7.  Forty-three Americans were killed on October 7, and 12 were taken  hostage.\n\nMore importantly, the…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693692/department-of-defense-appropriations-act-2026"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…America wins, but not China.\n\nWhat do Americans want? They want affordable, reliable, available  power. We need the energy, and clean coal will deliver it. American  energy is rocket fuel for a stronger economy--also, for a more secure  Nation.\n\nWhat does more energy mean? It means lower prices for consumers and  manufacturers and producers. Electricity…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689762/coal"}, {"senator": "Greg Steube", "party": "Republican", "sentence": "…firing rockets,       drones, and anti-tank missiles at northern Israeli       communities, carrying out attacks on a near-daily basis in       solidarity with Hamas.\n\nThe rocket fire displaced some 60,000 residents of northern       Israel. In a bid to ensure their safe return, Israel stepped       up operations in Lebanon in September, leading to…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693678/department-of-defense-appropriations-act-2026"}, {"senator": "James Risch", "party": "Republican", "sentence": "…Radar Altimeters Common Core       (RACC); AN/ARN-153 Tactical Air Navigation Set (TACAN); AN/      PYQ-10(C) Simple Key Loader; M230E1 + M139 AWS Automatic Gun;       M261 Rocket Launchers; M299 missile launchers; 2.75 inch       rockets; 30mm rounds; High Explosive Warhead for airborne       2.75 rockets, inert; MK66-4 2.75 inch rocket High Explosive…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695536/arms-sales-notification"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…and defense  leader has become a cornerstone of America's space ambitions.\n\nNorthrop Grumman's state-of-the-art facilities in Utah are central to  the development of solid rocket boosters for some of the most ambitious  missions we have ever embarked upon. These boosters are key to  propelling spacecraft, like NASA's Space Launch System, which is set…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687925/space-dominance"}, {"senator": "John James", "party": "Republican", "sentence": "…no matter what industry, there is not  a single American who isn't impacted by supply chains. In Michigan's  10th Congressional District, supply chains are the equivalent of rocket  fuel, providing the firepower for the number one manufacturing district  in the entire country to power Michigan's local and State economy.\n\nHaving strong, reliable supply…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690187/promoting-resilient-supply-chains-act-of-2025"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…and Israel, in turn, backfill  our own stocks with brand new capabilities--not just 155-mm rounds but  air defenses and long-range fires, with specific investment in solid  rocket motors.\n\nThese investments help us prepare for conflict in the Indo-Pacific,  and production would be slower in the absence of our partnership with  Ukraine. Not doing more…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692870/9999"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…security-focused companies in Utah, such as Northrop Grumman  and Vector, which I had the opportunity to tour during the August work  period.\n\nNorthrop manufactures the five-segment solid rocket boosters for  NASA's Space Launch System in Utah. They are currently developing next- generation rocket boosters, which will power us to the Moon and Mars.  Thanks to the passage…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694796/promises-made-promises-kept"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…will feature Scouts demonstrating outdoor and  leadership skills right here on the Capitol grounds in the Rayburn  foyer. Displays will include camping equipment, a canoe, a rocket,  robotics, knot tying, and Pinewood Derby car racing, alongside  educational tables sharing the story and scope of modern Scouting.\n\nThere will also be a dynamic panel discussion…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694209/recognizing-the-congressional-scouting-caucus"}]