[{"senator": "Danny Davis", "party": "Democrat", "sentence": "Given her independent role, the National Taxpayer Advocate often  takes positions contrary to the positions of the IRS and the Office of  Chief Counsel.", "title": "National Taxpayer Advocate Enhancement Act of 2025", "date": "2025-03-31"}, {"senator": "Joaquin Castro", "party": "Democrat", "sentence": "The AUKUS Agreement  established by the Biden administration was a historic accomplishment,  and Congress has played an important and constructive role in laying  the legislative foundation for closer cooperation between the United  States, the United Kingdom, and Australia.", "title": "Aukus Reform for Military Optimization and Review Act", "date": null}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "Faced with her own nightmare in the loss of her son,  Fitz, Bishop Thomas went on to inspire countless others, serving as an  active role model and advocate for her son's friends and community.", "title": "Recognizing Bishop Michelle C. Thomas", "date": "2025-12-01"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "Verification will be at the heart of any future arms control effort,  and this is where America's scientific enterprise plays a critical  role.", "title": "Expiration of New Start", "date": "2026-01-14"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "That being said, and perhaps not giving them full halo status, let me  say that these angel investors do play an important role in our  economy, even if they have named themselves after the angels of Heaven.", "title": "Helping Angels Lead Our Startups Act of 2025", "date": "2025-06-23"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "It is a do-nothing  resolution that targets a leader who has been holding the line in  defense of democracy, someone who is not beholden to super-PACs, like  foreign lobbies or Big Oil, like the American Petroleum Institute.", "title": "Raising A Question of the Privileges of the House", "date": "2025-11-17"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "ITS has played a significant role in furthering  telecommunication advancements for our country's benefit.", "title": "Institute for Telecommunication Sciences Codification Act", "date": "2025-07-14"}, {"senator": "Raja Krishnamoorthi", "party": "Democrat", "sentence": "I  commend NRCA and the vital role the organization and its members play  in every community, and I ask my colleagues to join me in acknowledging  their contributions during National Roofing Week.", "title": "Recognizing National Roofing Contractors Association and National Roofing Week", "date": "2025-05-20"}, {"senator": "Seth Moulton", "party": "Democrat", "sentence": "Since 1991, he has served as the  Archbishop of Constantinople--New Rome and Ecumenical Patriarch, a role  that traces its lineage to the earliest days of Christianity.", "title": "Welcoming His All-Holiness Bartholomew to Washington, D.C.", "date": null}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "Yet,  once again, the master of distraction seeks to avoid any accountability  for his role in this tragedy.", "title": "Attack on Two National Guard Members", "date": "2025-12-02"}, {"senator": "Sharice Davids", "party": "Democrat", "sentence": "I proudly represent Kansas, often called the Wheat State, where  agriculture plays a critical role in our State's economy.", "title": "United States Grain Standards Reauthorization Act of 2025", "date": null}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "It  is the role of Congress to provide oversight.", "title": "Holding Power Accountable", "date": "2025-06-25"}, {"senator": "Susie Lee", "party": "Democrat", "sentence": "Ecumenical Patriarch Bartholomew is also an international  environmental leader and has earned the title ``Green Patriarch.'' He  consistently used his role to bring people of different faiths together  to discuss how they could be good stewards of the Earth, and he made  caring for the environment a central commitment in his role as  spiritual leader.", "title": "Recognizing and Welcoming His All-Holiness Ecumenical Patriarch Bartholomew to Washington, D.C.", "date": null}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "``A yearlong CR means we are not serious about building a military that  will deter China, Russia, and Iran.''\n\nThe White House may be out of touch with reality when it comes to  Ukraine and supporting our allies abroad, but their fealty to Vladimir  Putin doesn't mean the United States can resign its role in standing  for Ukraine and democracies around the world.", "title": "Disastrous Implications of A Yearlong Cr", "date": "2025-03-04"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "Over the years, Susan has made  contributions as the Outlook publication coordinator, bookkeeper, and  Assistant to the President--bringing unwavering dedication and  professionalism to each role.", "title": "Recognizing Susan Harkins for 45 Years of Service with the Lower Bucks County Chamber of Commerce", "date": "2025-08-15"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "This renaming symbolizes  Republicans' commitment to putting America first, and honors the Gulf  of America's important role in unleashing American energy and our  Nation's return to greatness.", "title": "Gulf of America Act", "date": "2025-05-08"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "In this role, which he held for an additional 22  years, he became a cornerstone of public safety and emergency  preparedness in North Texas.", "title": "Recognizing Mr. Ray Fletcher", "date": "2025-07-02"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "Bresnahan for ensuring that we fulfill that role.", "title": "Mid-Atlantic River Basin Commissions Review Act", "date": null}, {"senator": "Ryan Mackenzie", "party": "Republican", "sentence": "She has  used her role as USOA Ms.", "title": "Recognizing Heather Davenport", "date": "2025-05-13"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "In this role, he also secured future convention dates in Sault Sainte  Marie, ensuring the continued success of these important gatherings.", "title": "Recognizing Raymond E. Carlson As the 2025 Upper Peninsula Veteran of the Year", "date": "2025-07-23"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "Charles  built strong partnerships with local, state, and federal leaders,  ensuring UWPC played a key role in disaster response and community  resilience efforts, including managing FEMA allocations and emergency  shelter coordination.", "title": "Recognizing Chuck Anderson", "date": "2025-04-28"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "Mason played an important role  propelling the Bison to their tenth FCS National Championship.", "title": "Congratulating Kadyn Kulzer", "date": "2025-05-20"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "It is something I hear about regularly from the men and women of the  Fourth District of Arkansas who share my understanding that our schools  must be supported in a way that allows them to play a role as a  community hub while also supporting our timber industry that is the  lifeblood for many of our communities.", "title": "Secure Rural Schools Reauthorization Act of 2025", "date": "2025-12-09"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "Mac showed tremendous initiative in  this role by developing and implementing a successful DUI curriculum  for local law enforcement personnel.", "title": "Thanking John McIntyre (Mac) Tolar for His Dedicated Service to Our Nation", "date": null}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "I urge my colleagues to  support this legislation and defend the role of families in  safeguarding our children's education.", "title": "Transparency in Reporting of Adversarial Contributions to Education Act", "date": "2025-12-03"}, {"senator": "Randy Feenstra", "party": "Republican", "sentence": "She played a pivotal  role in supporting our veterinary diagnostic lab and the world-renowned  Ames Laboratory.", "title": "Als Awareness Month", "date": "2025-05-21"}, {"senator": "Shelley Capito", "party": "Republican", "sentence": "They perform and she performs a vital role in this  institution, and her wise counsel is critical to making this Senate  function.", "title": "H.J. Res. 88", "date": "2025-05-21"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "Jim also played a key role in introducing innovation and excellence  in Montana health services, helping to bring new cancer, cardiac,  pediatric, psychiatric, and trauma care to eastern Montana.", "title": "Congratulating Jim Duncan", "date": "2025-06-26"}]