[{"senator": "Sheila Cherfilus-McCormick", "party": "Democrat", "sentence": "…culture and       celebrating heritage. Few bands have embodied this mission       more profoundly than CaRiMi, a pioneering group that has       played an instrumental role in shaping and elevating Haitian       music and culture. Through their infectious rhythms, they       have inspired generations and brought people together through       the universal…", "date": "2025-08-12", "source_url": "https://justfacts.votesmart.org/public-statement/1694734/9999"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…public service, representing Hawaii  in the House of Representatives from 1902 until his death in 1922.  Despite his nonvoting status, Prince Kuhio played a significant role in  shaping Hawaii's future and was a tireless advocate for the  Native Hawaiian community. He secured Federal dollars for the dredging  and construction of Pearl Harbor, helped establish…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695588/hawaiian-history-month"}, {"senator": "André Carson", "party": "Democrat", "sentence": "…of this important month.\n\nIt is essential that Congress continues to acknowledge the invaluable  contributions of Caribbean Americans to our nation's history and their  role in shaping our future.\n\nMr. Speaker, I urge my colleagues to join me in honoring National  Caribbean American Heritage Month.", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693058/introduction-of-resolution-recognizing-the-significance-of-national-caribbean-american-heritage-month"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…Heritage Month to recognize an outstanding business and community  leader from Rochester, New York, Orlando Ortiz.\n\nServing as President, Orlando Ortiz has played a pivotal role in  shaping and leading the Puerto Rican Festival for over 15 years. He has  worked tirelessly to honor Puerto Rican heritage and create a welcoming  space where thousands of residents…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695838/recognizing-orlando-ortiz"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…consequences, how could we make them bigger, and how could we make  them cleaner. All of these things were part of that testing.\n\nThe test site became a real player and had a major role in shaping  our policies, both nationally and internationally, regarding testing  and nonproliferation.\n\nThe radiation given off by more than 100 atmospheric tests had  devastating…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699032/expiration-of-new-start"}, {"senator": "Brittany Pettersen", "party": "Democrat", "sentence": "Ms. PETTERSEN. Mr. Speaker, I rise today to recognize Red Rocks  Elementary School on its 70th anniversary.\n\nPublic schools play a critical role in shaping our communities. For  over 70 years, the teachers, administrators, and support staff at Red  Rocks Elementary School have helped their students achieve academic  excellence…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692016/recognizing-red-rocks-elementary-school"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…Northwest Airlines. Founded  in 1926, Northwest Airlines grew from humble beginnings into a global  carrier headquartered in the Twin Cities. Northwest played a central  role in shaping Minnesota's economy, creating tens of thousands of  good-paying jobs, and connecting our communities to the Nation and the  world. Its story is inextricably linked to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695050/recognizing-delta-air-lines-100th-anniversary"}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "…our 250th anniversary there is  still no memorial in our Nation's Capital honoring John Adams, John  Quincy Adams, both Presidents, and their family, and their leading role  in shaping our country. This recognition is long overdue.\n\nIn closing, I urge my colleagues on both sides of the aisle to  support this act, and I thank you for the time and courtesy.", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697631/adams-memorial-great-american-heroes-act"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…people enjoyed all that  Las Vegas had to offer. These tests were conducted to better understand  the power and effects of nuclear weapons, and the site played a major  role in shaping national and international policies regarding nuclear  testing and non-proliferation.\n\nThe radiation given off by the more than 100 atmospheric tests,  however, had devastating…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696948/opposition-to-explosive-nuclear-testing"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…Telecommunications and Information  Administration, or NTIA, by codifying, renaming, and enhancing the work  of its Office of Policy Analysis and Development, which plays a  critical role in shaping our Nation's telecommunications and  information objectives.\n\nNTIA is already central to advancing market-driven strategies that  foster innovation, expand broadband deployment,…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693498/ntia-policy-and-cybersecurity-coordination-act"}, {"senator": "Richard Neal", "party": "Democrat", "sentence": "…it as a warning  for the need for a stronger federal government.\n\nThe Springfield Armory was officially established by George  Washington in 1794 and played an essential role in shaping America's  military and industrial strength. For nearly two centuries, the Armory  provided the tools necessary to defend our Nation and served as a hub  of innovation…", "date": "2025-08-12", "source_url": "https://justfacts.votesmart.org/public-statement/1694730/recognizing-the-50th-anniversary-of-the-springfield-armory"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…people who came to enjoy all Las Vegas had to offer.\n\nThese tests were conducted to better understand the powers and  effects of nuclear weapons, and the site played a major role in shaping  national and international policies involving nuclear testing and  nonproliferation.\n\nThe radiation, however, given off by the more than 100 atmospheric  tests had devastating…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696970/nuclear-testing-opposition"}, {"senator": "Grace Meng", "party": "Democrat", "sentence": "…and Pacific  Islanders in the U.S., representing the fastest growing racial group in  the country. We have made invaluable contributions to our country and  play a vital role in shaping America for the better.\n\nHowever, at a time when we should be celebrating, our communities are  anxious and afraid. This celebration of our heritage, culture, and  stories…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691503/gop-tax-scam-hurts-women-and-families"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…collaboration, and creativity.\n\nMr. Speaker, as James Woods celebrates 75 years of service to our  community, we reflect with pride on its past and look forward to its  continued role in shaping future generations. Congratulations to James  Wood High School and all who have contributed to its remarkable  journey.       Celebrating Lord Botetourt High School's…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691575/recognizing-the-75th-anniversary-of-james-wood-high-school"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…officiate the  1996 Summer Olympics in Atlanta, Georgia. His dedication to improving  the lives of young people is admirable.\n\nMr. Speaker, coaches and officials play a key role in shaping the  attitudes and beliefs of our Nation's youth, and my district is lucky  to have many people like Ken to look out for our athletes.\n\nMadam Speaker, after a long and…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697115/recognizing-ken-stewart"}, {"senator": "Mike Kelly, Jr.", "party": "Republican", "sentence": "…industry, and opportunity. Over  the centuries, this county has been home to hardworking farmers,  entrepreneurs, educators, and service members--all of whom have played  a role in shaping its legacy.\n\nWe remember the early settlers who shaped life in this land, facing  hardships with unwavering determination. We honor the industries that  have driven our…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689795/recognizing-mercer-county-pennsylvanias-225th-anniversary"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…community leaders since its inception in 1992.  The Chamber's enduring commitment to economic development,  collaboration, and community enrichment has played an essential role in  shaping Hernando County into the thriving place it is today.\n\nMr. Speaker, I ask my colleagues to join me in congratulating the  Greater Hernando County Chamber of Commerce on…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695644/recognizing-the-greater-hernando-county-chamber-of-commerce"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…Recognizing Military Recruiters\n\nMr. BAUMGARTNER. Madam Speaker, I rise today to recognize the  dedicated work of our military recruiters and their critical role in  shaping the future of our Armed Forces.\n\nI recently met with recruiters from across eastern Washington to  discuss the state of military recruiting and the challenges that they…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700140/recognizing-joshua-elliott"}, {"senator": "John Boozman", "party": "Republican", "sentence": "…philanthropy, and character development-- setting a powerful example of what it means to lead with integrity and  purpose.\n\nCollegiate organizations like Gamma Nu play a vital role in shaping  the next generation of leaders, offering young women opportunities to  build confidence, develop skills, and form lifelong bonds rooted in  shared values and experiences.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695796/recognizing-100-years-of-the-gamma-nu-chapter-of-kappa-kappa-gamma"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…moving into a starring role.\n\nWe stand at the crossroads of an exciting new era in space  exploration. Utah, known for our pioneering spirit, is poised to play a  critical role in shaping the future of space. From producing cutting- edge technology to visionary companies, Utah is helping propel humanity  into the next frontier.\n\nUtah is also the proud home…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687925/space-dominance"}]