[{"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…the floodgates to unlimited corporate and billionaire  spending in our elections, drowning out the voices of working people.  The decision overturned longstanding precedent rooted on independent  political spending by corporations and billionaires.\n\nThe conservative majority embraced the idea that spending money on  elections equals speech and that corporations…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699240/restoring-election-integrity"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…language they speak, our grief over losing a loved one is the same.\n\nWe are bound together by that shared humanity, so we must be  relentless in our commitment to peace: peace rooted in diplomacy, peace  that is sustained with dialogue, and peace that insists, without  exception, that every single life matters.\n\nFrom Boston to the Middle East, our destinies…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1692987/our-destinies-are-tied"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…children. And they stood up for equality and dignity by  fighting against the discriminatory  Proposition 8. Indeed, they lent their voices and resources to  countless causes rooted in fairness and opportunity for all.\n\nCivically, Rob and Michele were fierce champions of the First  Amendment and the creative rights of artists, never wavering in their…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698360/rob-and-michele-reiner-tribute"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…Padron-Morales.\n\nAs co-founder of Hipocampo Children's Bookstore, Henry Padron-Morales  has created a space that celebrates culture, diversity, and the power  of literacy. Rooted in his Puerto Rican heritage, his vision and  leadership have fostered a love of reading while amplifying voices that  too often go unheard. Through this work, Henry has become…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695845/recognizing-henry-padron-morales"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…current executive director  of Palenque LSNA.\n\nJuliet's love for Black, Brown, indigenous, and immigrant communities  and her bold vision of collective liberation is deeply rooted in  healing, joy, and solidarity, especially among young Latinos and  ``madres immigrantes''; ``immigrant mothers.''\n\nTo fight erasure, she connects young leaders to their…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698984/recognizing-frank-chapman"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…public-private collaboration  and a clear focus on inclusive growth.\n\nMilford's motto: Art Town, River Town, Home Town, is more than a  slogan. It is a reflection of a community that is rooted in creativity  and care for one another.\n\nI am proud to represent Milford in Congress, and I will keep fighting  for the investments, partnerships, and policies that empower…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692377/recognizing-milford-delaware"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…all in return.\n\nTwo such examples have resonated with me, and I hope they       can do the same for you.\n\nIn Les Miserables, a musical adored by her daughter Linda       and rooted in sacrifice, selflessness, and dignity (all       traits that my grandmother embodied to a ``T''), the closing       lines of the show encapsulate the simple, but pure divinity…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688362/eulogy-by-sam-iacobellis-for-dorothy-christiana"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…lack independence and routinely  fall short in providing the fundamental protections of due process and  a fair trial that exist in the civilian justice system and which are  rooted in international law.\n\nIsrael, however, automatically and systematically prosecutes  Palestinian civilians in the West Bank in Israeli military courts under  Israeli military…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697313/palestine"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…Puerto  Rican and immigrant community.\n\nA proud product of Chicago Public Schools, Billy graduated from Von  Humboldt Elementary School and Roberto Clemente Community Academy.\n\nRooted in the community that raised him, Billy served as the 26th  Ward alderman for 16 years, from 1993 to 2009, where he championed  major infrastructure and community development…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692932/holding-power-accountable"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "Ms. KAPTUR. Mr. Speaker, I have the honor of representing Ohio's 9th  Congressional District, a region that embodies the industrious spirit,  deep-rooted history, and resilient communities of Northwest Ohio.  Today, I am privileged to join in commemorating an extraordinary  milestone in our shared story--the 175th anniversary…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693801/proclamation-for-fulton-countys-demisemiseptcentennial"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…large corporations, who often pay no taxes at  all. In all of this, the majority will add trillions to our national  debt.\n\nDemocrats have a different vision. It is a vision rooted in fairness  and rooted in the words of Franklin Roosevelt. We believe that every  American deserves a good quality of life, a shot at success, a vision  of a level playing…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688233/democratic-proposals"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…today to honor the life of  John Howard Eisenhour, a devoted public servant, veteran, and proud  Virginian who, unfortunately, passed away on November 10.\n\nJohn lived a life rooted in service and civic responsibility. He  served our Nation as a tank commander in the United States Army at Fort  Hood and went on to a distinguished career in Federal service.…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697218/recognizing-bishop-michelle-c-thomas"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…TFA network in Hawaii now has 631 corps members  and alumni, collectively improving the lives of over 18,000 students.\n\nI especially commend the program's focus on locally-rooted  leadership. TFA Hawaii has recruited 259 corps members and alumni who  are kama`aina, born and raised in our islands, including 89 Kanaka  Maoli. They embody the sense of…", "date": "2025-10-14", "source_url": "https://justfacts.votesmart.org/public-statement/1696215/congratulating-hawaii-teach-for-america-teachers"}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "…would be  essential that Congress assert its authority to speak for the American  people. But this administration does not have a sound foreign policy;  it has one that is rooted in bluster, built on extortion and  extraction, for the President's own benefit and without the best  interests of the American people at heart.\n\nIt is for them that we must…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698621/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Sam Liccardo", "party": "Democrat", "sentence": "…proudly boasts the largest population  of ethnically Vietnamese people of any city in the world outside of  Vietnam.\n\nHelen's journey was filled with horror and hardship, but rooted in  hope, hope for a life with freedom and opportunity. We must honor her  hope by living up to the promise of America, by fulfilling our  democratic values, and by embracing…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690516/living-up-to-the-promise-of-america"}, {"senator": "Nathaniel Moran", "party": "Republican", "sentence": "…extends to every corner of  this Earth.\n\nOrganized by local citizen leaders, churches, nonprofits, and  volunteers of all ages, Love Thy City is a day of service to others,  rooted in the great command to love our neighbors. That is a principle  that transcends politics and parties, race and gender, and every other  perceived difference between us.\n\nIt…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693760/love-thy-city-initiative"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…Turkish Americans in Michigan  and across the United States, and to the people of Turkiye. May the  friendship between our nations continue to grow stronger in the years  ahead, rooted in mutual respect, shared prosperity, and a steadfast  commitment to peace and security.", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696871/recognizing-the-102nd-anniversary-of-the-founding-of-the-republic-of-turkiye"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "…The Freedom 250 Grand Prix will bring IndyCar to our Nation's Capital  as we mark 250 years of American ingenuity.\n\nIndyCar was born in my hometown of Indianapolis. It is rooted in a  tradition that goes back more than a century, built by American  workers, American engineers, and American manufacturers.\n\nIndyCar reflects who we Hoosiers are: competitive,…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699865/freedom-250-grand-prix"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…was strengthened in  meaningful ways, including the reopening of dozens of Catholic schools,  ensuring that families across our State continue to have access to  education rooted in faith, values, and community.\n\nBeyond New York, Cardinal Dolan has become a respected national voice  for the church, guiding conversations with clarity, humor, and grace,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699731/recognizing-extraordinary-service-of-cardinal-timothy-dolan"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "…spiritual growth has made a lasting impact.\n\nThis milestone is not just about looking back--it's a powerful  reminder of the faithfulness of God and the strength of a community  rooted in Him.\n\nI thank Pastor Gibson, the leadership team, and every member of this  congregation for their dedication, their prayers, and their service.  May God continue to bless…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691555/special-recognition-of-150-years-of-first-baptist-church-of-biloxi"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…civic engagement and public  service. His remarkable career spans more than four decades, beginning  in 1978, and is defined not only by professional success but by a  deeply rooted commitment to his community, his faith, and the  betterment of this country.\n\nOutside of his accomplished professional life, Marshall has devoted  himself to civic and philanthropic…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693060/recognizing-the-75th-birthday-of-marshall-brachman"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…profit.\n\nKelly has also been a steadfast advocate for the credit union  movement on both state and national levels. Her thoughtful engagement  with policymakers like myself rooted in collaboration, expertise, and  genuine care for people, has advanced the cause of financial inclusion  in the First Congressional District of Pennsylvania and across the…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696273/recognizing-chief-executive-officer-of-trumark-credit-union-ms-kelly-botti"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…binds us together as a Nation,  actual spirit, in God we trust. We cannot be bound together as a Nation  if we do not adhere to a commonsense set of principles and values,  rooted in a collective faith, a collective faith in God Almighty.\n\nIt does not mean that every individual has to believe anything  specific. It doesn't mean that anybody has to go…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695719/highlighting-flawed-policies"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…Pennsylvania. Walt's leadership extended beyond his post as he also  served as District Commander of VFW Pennsylvania District 16. His  contributions to these organizations were rooted in his desire to  support and uplift fellow Veterans and their families, constantly  working to grow membership and expand community outreach.\n\nIn addition to his work in the…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692464/recognizing-the-life-and-service-of-united-states-army-veteran-walt-hartnett"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…where he supported the J&J Consumer Family of  Companies, Enterprise Supply Chain, Information Technology, and the Law  Department. His commitment to purpose-driven leadership, rooted in his  commitment to J&J's Credo, has greatly enriched Johnson & Johnson.\n\nHis commitment to improving healthcare goes beyond his day-to-day  work. Calvin serves on the Foundation…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697247/congratulating-calvin-w-schmidt-on-his-service-to-johnson-johnson"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…would remain for the  rest of his career, steadfastly delivering mail and upholding the  principles of dedication, diligence, and service.\n\nComing from a family with a deep-rooted tradition in the Postal  Service, Joseph was honored to follow in the footsteps of his father,  Joseph, and his two brothers, Paul and Jeff. His career was defined by  an unwavering…", "date": "2025-03-21", "source_url": "https://justfacts.votesmart.org/public-statement/1688925/recognizing-joseph-bongarzones-retirement-with-the-united-states-postal-service-after-37-years"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…challenging them to think       critically in pursuit of truth;\n\nWhereas, Holy Family Catholic Academy maintains an       unwavering commitment to excellence in academics, rooted in       the Catholic tradition and built upon a timeless liberal arts       curriculum, thereby uniting faith with reason and providing       students a strong foundation…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699458/recognizing-holy-family-catholic-academy"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…intent for the NPR-A, and uphold the economic,       cultural, and subsistence well-being of the North Slope       Inupiat.\n\nOur identity, resilience, and survival are deeply rooted in       our traditional lands that the NPR-A boundaries encompass. We       take great pride in our ongoing efforts toward self-      determination, focused on securing a…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696449/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…roots and ownership of the adjacent  country store, joined forces with longtime friend Brad Wyland to  revitalize both the hotel and the restaurant.\n\nTheir vision has been rooted in pride and preservation, honoring  family ties and restoring beloved menu items including a throwback menu  featuring The Original Mountain Burger, a culinary emblem of community…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693585/congratulating-the-waterville-hotel"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…Manila is standing its ground with  remarkable courage despite relentless Chinese pressure, and that  deserves our deepest commendation.\n\nOur alliance with the Philippines is rooted in shared sacrifice.  During World War II, U.S. and Filipino prisoners of war endured the  horrors of the Bataan Death March, and, together, we fought to liberate  the islands…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694962/national-defense-authorization-act-for-fiscal-year-2026"}]