[{"senator": "George Latimer", "party": "Democrat", "sentence": "Mr. LATIMER. Mr. Speaker, I recognize the community service provided  by the men and women of the Yonkers-East Yonkers Rotary Club. Every  day, they live out their voluntary efforts of the Rotary Four-Plus-One  Test, ensuring truth, fairness, good will, benefit, and fun in their  activities under the…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699979/recognizing-yonkers-east-yonkers-rotary-club"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…Vocational High School College and  Career Academy Advisory Board, RiverCenter for the Performing Arts,  Columbus State University Military Affiliated Student Support Fund, the  Rotary Club of Columbus, and the Miracle Riders.\n\nOn a personal note, I have had the privilege of knowing Judy for many  years. I am incredibly grateful for her support and the fidelity…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690837/in-memory-of-the-honorable-judy-thomas"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…Family Services, the LivingWell Cancer Resource Center, the Community  Foundation of the Fox River Valley, and the Batavia Community Chest.  Notably, his tenure with the Rotary Club of Batavia has spanned nearly  four decades and includes service as club president, recognition as  Rotarian of the Year, and multiple Paul Harris Fellow honors.\n\nBeyond…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690141/recognizing-robert-bob-p-hubbard-as-batavias-2024-citizen-of-the-year"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…me tell you the stories of two DACA recipients in Connecticut.\n\nAgnes was brought to Connecticut when she was 9 years old. She worked  hard in school and qualified for a Rotary Club scholarship to attend  Western Connecticut State University. Because of DACA, she was able to  obtain work authorization and get a job upon graduating college.\n\nShe says…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692242/daca"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "Mr. KILEY of California. Mr. Speaker, I would like to take this  opportunity to congratulate and recognize the Rotary Club of Lincoln on  their centennial anniversary.\n\nThe Rotary Club of Lincoln began meeting one hundred years ago in  1925 and, since then, have become a pillar of the Lincoln…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696716/recognizing-the-100th-anniversary-of-the-rotary-club-of-lincoln"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…also Managing General Partner for Fuller Properties, LTD and former  host of the Lee County Report.\n\nHe's served as past President of The United Way of Lee County,  Opelika Rotary Club and The Opelika Chamber of Commerce. He has served  as past director of Opelika Dixie Youth Baseball, Opelika Main Street,  Opelika Utilities Board, Opelika Arts Association,…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696582/recognizing-the-retirement-of-mayor-gary-fuller"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…law we are operating under is  the Affordable Care Act.\n\nWhy is the Affordable Care Act not saving people money?\n\nI remember when this first came out. I was speaking to a Rotary Club,  and a person said to me at the end that I was talking so negatively on  the Affordable Care Act.\n\nI said to him: You know, I really hope that people will keep the  doctor…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698566/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…ten years. He also served on the Board of the Upper  Trinity Regional Water District and the McKinney Urban Transit  District. He is the past President of the Preston Trail Rotary Club and  the current Chairman of Government Affairs for the Celina Chamber of  Commerce. Corbett currently serves as the Market President of Lamar  National Bank and is a board…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690167/recognizing-congressional-patriot-award-recipient-corbett-howard"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "Mr. THOMPSON of Pennsylvania. Mr. Speaker, I rise today to recognize  and congratulate the Leechburg Rotary Club on an incredible milestone,  100 years of dedicated service to their community.\n\nSince receiving their charter in 1925, the Leechburg Rotary has been  a pillar of civic…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692828/leechburg-rotary-club-celebrates-100-years-of-service"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…incredible learning opportunities to every child in America.\n\nSo you can tune into our hearing next Tuesday at 10:15 a.m. eastern  time.\n\nCelebrating the 100th Anniversary of the Rotary Club of Grass Valley\n\nMr. KILEY of California. Mr. Speaker, I wish to mark and to celebrate  the centennial anniversary of the Rotary Club of Grass Valley based in  California's…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689211/protecting-medicaid-for-californians"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "Mr. BACON. Mr. Speaker, I rise to recognize the Bellevue-Papillion  Rotary Club of Nebraska on the celebration of their 50th Anniversary.\n\nSince its founding on January 15, 1975, the Bellevue-Papillion Rotary  Club has exemplified the values of Rotary…", "date": "2025-06-20", "source_url": "https://justfacts.votesmart.org/public-statement/1692687/recognizing-the-50th-anniversary-of-the-bellevue-papillion-rotary-club"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "Mr. WEBSTER of Florida. Mr. Speaker, it is my pleasure to recognize  and celebrate the 100th Anniversary of the Rotary Club of Winter  Garden.\n\nFor the past 100 years, the Rotary Club of Winter Garden has stood as  a pillar of leadership and service. Its business and professional  members have…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699377/recognizing-the-100th-anniversary-of-the-rotary-club-of-winter-garden"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "…civic and community organizations. He has served as a founding  member of the Board of Directors for the Cullman Parks & Recreation  Foundation, contributed to the Cullman Rotary Club, and supported  Wallace State Community College through the Future Foundation and  Alumni Association. He also served on the Cullman Area Chamber of  Commerce Board of Directors…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699608/recognizing-mr-dale-greer"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "Mr. THOMPSON of Pennsylvania. Mr. Speaker, I rise today to recognize  the 75th anniversary of St. Mary's Rotary Club, a cornerstone of  service in our community since 1950.\n\nFor 75 years, the St. Mary's Rotary Club has exemplified the Rotary  motto  of Service Above Self through countless…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690205/recognizing-st-marys-rotary-clubs-75th-anniversary"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "Mr. THOMPSON of Pennsylvania. Mr. Speaker, I rise to recognize the  Wellsboro Rotary Club's centennial anniversary.\n\nFor a century, the Wellsboro Rotary Club provided unwavering,  dedicated service to the community.\n\nThe men and women of the Wellsboro Rotary…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687905/recognizing-wellsboro-rotary-clubs-centennial-anniversary"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…young people he has supported and  inspired.\n\nBeyond coaching and mentorship, Jim has worked tirelessly to  strengthen his community. He has been a dedicated member of the Rotary  Club, an advocate for educational initiatives, and a key organizer in  numerous fundraising efforts that have uplifted Cass City. Even in the  face of personal health challenges,…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689609/recognizing-james-e-baker-ii-as-cass-citys-2025-citizen-of-the-year"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…Jennifer and Greg Walker. Archie is an accomplished young  woman, striving to make a difference in her country.\n\nWalker is currently serving as the vice president of the Rotary Club.  She is a 3-year varsity athlete in soccer, a dual-enrollment student at  Commonwealth University, and a member of the National Honor Society.\n\nWalker has proven herself…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691782/congratulating-lucas-gaston"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…there are many great volunteers.\n\nFrom Penn State THON raising a record-breaking $17 million this year  alone to aid families affected by childhood cancer to the Wellsboro  Rotary Club, which just celebrated its centennial year of service, our  communities are filled with neighbors helping neighbors.\n\nThese few examples remind us that acts of service have…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689399/national-volunteer-month"}]