[{"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…get the treatments that she needs. Without Medicaid, the cost  of Chloe's treatment would force Shelley and parents like her to make  an impossible choice between financial ruin or not getting the care  that they need for their children.\n\nI have also heard from dozens of Wisconsin families whose children  live with disabilities. They are terrified of…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689511/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…little more attention.\n\nExisting modeling practices understate economic impacts, and further,  as one study pointed out, at the extreme, they ``do not recognize the  risk of ruin.'' They presume that this damage will fall into a  predictable center-case scenario. But there are outer-case scenarios-- nontrivial ones, real ones--that create the risk of…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699613/9999"}, {"senator": "Donald Norcross", "party": "Democrat", "sentence": "…shared responsibility for  managing this risk.\n\nI am, however, disappointed that some in the majority would kill this  bipartisan work. We have seen the amendments, and they will ruin what  we have done collectively on our committee. Our servicemembers and  their families deserve better.\n\nMadam Chair, this authorizes funding levels for key defense programs…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695154/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…while Donald Trump gives billions of  dollars to Argentina and gets rich selling cryptocurrency to criminals  and foreign agents, millions of Americans are facing financial ruin  from rising health insurance costs.\n\nAll across the country, Americans are getting letters like this from  their insurance companies telling them how much their premiums are…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696996/extend-the-tax-credits"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…does not matter to the President and his  administration. Unemployment has been rising.\n\nLet's be honest. DRP does not mean Deferred Resignation Program. It  means destroy, ruin, and punish.\n\nMadam Speaker, stop this madness. Protect MARAD. Protect our ports.  Protect our workers. Protect and grow jobs in America.", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698300/in-support-of-marad"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…Speaker, the choice is clear. Congress can either act to restore  affordable healthcare or we can continue to let premiums sore, coverage  vanish, and families face financial ruin.\n\nI know one thing is for certain, Mr. Speaker. I was brought to  Congress to work on behalf of the people of Ohio's 13th Congressional  District to lower costs, to keep them…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698555/rising-healthcare-costs"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…critical       supports such as housing and employment on a case by case       basis. In contrast, H.R. 5214 would implement a cash bail       system that would financially ruin many of D.C.'s lower       income families, force many parents, disproportionately women       and Black women, out of the workforce, and expose children to       the well-documented…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696949/opposition-letter-led-by-the-american-civil-liberties-union-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…problem with your engine, you have to change your oil, your  brakes are not working properly, you quickly pull that expensive  machine over. You do this because you don't want to ruin it, you don't  want to blow a gasket, you don't want to damage your precious BMW,  Mercedes, or SUV.\n\nMr. Speaker, I say to my brothers and sisters, my family, my friends:…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692206/raising-awareness-about-mens-health"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…losing coverage  altogether.\n\nHouse Democrats stood united for more than 40 days to prevent this  outcome. We fought to shield families from exactly this kind of  financial ruin and healthcare shock. Once again, our Republican  colleagues across the aisle chose politics over people, and Brooklyn,  New York, like other districts across the Nation, will…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696767/stories-from-home-the-human-cost-of-expiring-healthcare-tax-credits"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…it what you  will, but it is essentially a purposeful and intentional reduction in  the workers necessary to provide medical care and benefits to veterans.  It is shameful to ruin a great institution. And veterans' healthcare  has provided world-class, gold-standard care to countless heroes across  the country. This administration is decimating that institution.…", "date": "2025-07-09", "source_url": "https://justfacts.votesmart.org/public-statement/1693321/9999"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…thousands of Americans like me, the ACA is not a       political talking point, it is the wall between a bearable,       if difficult, life and complete financial and medical ruin. I       relied on the ACA's Marketplace for my health coverage, the       only way I could secure a policy that didn't deny me for my       age, that capped my out-of-pocket…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696975/stories-from-home-the-human-cost-of-expiring-healthcare-tax-credits"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…When the President imposes tariffs on our allies, depending on which  way the wind is blowing on any given day, he forces hardworking people  in this country into financial ruin.\n\nThe result is only the largest corporations and the rich get richer,  driving the prices up, driving small farmers out, consolidating our  food system, and pushing the American…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695608/devastating-harm-caused-by-trump-administration"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…their love and affection for freedom and democracy.\n\nTheir will is clear: They will not allow the illegal regime of  corrupt Bidzina Ivanishvili to drive their country into ruin and be  dependent on the failed Soviet Union.\n\nGeorgia is a Black Sea nation that has always prized its hard-won  freedom. Sadly, the will of the people is being subverted by…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690702/mobilizing-and-enhancing-georgias-options-for-building-accountability-resilience-and-independence-act"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…and economies would meld into one global economic zone.\n\nThirty years on, what do we have to show for it? At home, our  factories and the towns that once sustained them lie in ruin, razed by  the ruthless logic of the new global economy and cost-efficiency. The  Americans who once worked there were replaced by foreign labor  overseas. The Americans who…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690533/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…mass  hysteria, as a ``Ghostbusters'' character once put it.\n\nWhat is the actual number of layoffs at Yosemite National Park that  will bring the beautiful valley to rack and ruin?\n\nMr. Speaker, 10, the number is 10 probationary employees, 10 out of  nearly 500 full-time winter employees, 25 if you include early  retirements and no firefighters.\n\nThis…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688585/yosemite-belongs-to-the-people"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…our fiscal framework with our budget targets  guide the final reconciliation bill.\n\nMr. Speaker, again, this may be the last best opportunity to save our  country from fiscal ruin. The formula is all there in the House budget  resolution.\n\nMr. Speaker, I urge my colleagues to demand that that is what drives  the bill at the end of the day. God bless America,…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689910/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…people that despair is never destiny. Let me repeat that.  Despair is never destiny. He told them that courage, unity, and faith  could rebuild an entire nation from the brink of ruin.\n\nMr. Speaker, today the Iranian people are living through their own  era of hardship--economic collapse, political oppression, and constant  fear. Yet, they continue to stand,…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697723/free-iran"}, {"senator": "John Rose", "party": "Republican", "sentence": "…because, unfortunately,  across the Nation, progressive Democrats are increasingly cozy with the  failed, discredited ideology.\n\nSocialism has time and again led to economic ruin, human deprivation,  and mass suffering. From the breadlines of Eastern Europe to the failed  Communist regimes of Cuba and Venezuela, socialism promises equality  but delivers…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697149/denouncing-the-horrors-of-socialism"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…is clear: The American people gave  Republicans a mandate to restore fiscal sanity. This rescissions  package is part of achieving that end.\n\nRepublicans are cleaning up the ruin that the Biden-Harris  administration left this country in. We are taking a fiscal scalpel to  waste, fraud, and abuse within the Federal Government. It is the right  thing…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692391/providing-for-consideration-of-hr-rescissions-act-of-2025"}]