[{"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…L.B.J. Room  making those arguments to the Parliamentarian. There was robust debate.  We filed briefs. Questions were asked. The whole thing was a very  vigorous contest, and she ruled--and she ruled.\n\nAnd GAO was not even in the room. That stage was long since passed.\n\nThe reason we are here is to overrule the Parliamentarian. The reason  for overruling…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691447/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…Libya's Fracture\n\nThe roots of Libya's schism can be traced back to a 2011       rebellion against longtime leader Muammar al-Qaddafi.       Qaddafi, who had ruled the nation since seizing power in a       1969 coup against the monarchy and later adopted the titles       of ``brotherly leader'' and ``King of Kings'' of Africa, had…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697384/recognizing-the-importance-of-libyas-return-to-stability"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "…and reliable  partner who will assist others in need and stand up for our allies, is  now a crumbling illusion.\n\nOur country was created on the principle that it would not be ruled  by an all-powerful king but instead maintained by a system of checks  and balances to prevent tyrannical rule and provide power to the  people.\n\nBut now, Donald Trump is ceding…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687989/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…custody simply because they were Latino.\n\nClearly, these tactics are unconstitutional. The use of race as the  basis for grabbing people on the street the courts have long ago ruled  are across the line and illegal.\n\nThese tactics threaten some of the most basic and important  principles that serve as the backbone for our Nation: the rule of law.  Like…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693662/weaponization-of-ice"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "…citizenship. In  a lawsuit brought in my home State of Washington, a Reagan-appointed  Federal judge--not a Democratic-appointed Federal judge, a Reagan- appointed Federal judge--ruled that the order was blatantly  unconstitutional because the 14th Amendment plainly states that all  persons born in the United States are U.S. citizens.\n\nWhat is next, stripping…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689715/no-rogue-rulings-act-of-2025"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…think  that it was something that Trump had said to Elon Musk: Go get it done,  an executive order. Maybe they felt that this was one of those  executive orders that would get ruled out by the courts when we  absolutely oppose him.\n\nThis resolution is only moving because Republicans needed to waste  time while they hammer out how best to give $5 trillion…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691499/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…Protection and       Affordable Care Act in 2010. It required states to cover       adults with incomes up to 138 percent of the [federal]       poverty line. After the Supreme Court ruled in 2012 that       expansion for states should be optional, 40 states and       Washington, D.C., have expanded Medicaid.\n\nForty of our 50 States accepted ``federal funds at…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "…Those are real patients getting turned away and real communities,  especially rural and low-income communities, being left behind.\n\nThis morning, the Senate Parliamentarian ruled that these provider  tax restrictions cannot be included as drafted, but this fight is still  very real.\n\nWe have seen Republicans rework the text of these radical cuts to…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693032/opposing-provider-tax-restrictions-in-the-gop-reconciliation-bill"}, {"senator": "Maggie Hassan", "party": "Democrat", "sentence": "…who has sought to use the  heavy hand of government to banish critics from the airwaves.\n\nWe declared independence, in the words of Jefferson, because we  didn't wish to be ruled by a King who ``cut off our trade'' and imposed  ``taxes on us without our consent.''\n\nBut today we have a President unilaterally declaring costly trade  wars on our allies…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698503/9999"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…said that he didn't think the Senate has jurisdiction to try to convict  a former President, despite the fact that that contradicted two  centuries of precedent, and the Senate ruled on the very first day  against that motion to dismiss the charges. He said there was nothing  that could be done, even though Donald Trump was actually, factually,  ethically,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691349/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…current Office of  Management and Budget and our Director of Management and Budget doesn't  like and is contesting and told me he wants the Supreme Court to  overrule what it ruled back then.\n\nThe second idea was to do a balanced budget amendment. But the  Republican chair of Appropriations stood up and said: Do you know what,  sometimes you need to spend…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693102/one-big-beautiful-bill"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…the  Constitution is a mindless conclusion. And it is no surprise. If I am  not mistaken--I will double-check--if I am not mistaken, not a single  Supreme Court Justice who ruled in that case had ever stood for office,  ever had a fundraiser, ever had to go through it and understand what it  does to you.\n\nI think ethical reform that is meaningful requires…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699112/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…that have never been considered rules in the past. In an entirely  unprecedented move, they are moving forward, even though the Government  Accountability Office hasn't yet ruled on whether they believe this  public land order constitutes a rule that would be subject to the CRA.\n\nThis administration and its allies in Congress have just unilaterally…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699273/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…DCHRA, which protects employees of the D.C. government  and private employers from discrimination, is inapplicable to employees  of the local D.C. courts. The court has not ruled on the applicability  of the DCHRA to PDS employees.\n\nThe local D.C. courts and PDS are unique entities, and they sometimes  fall through the regulatory cracks. They are neither…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698864/introduction-of-the-district-of-columbia-courts-and-public-defender-service-employment-non-discrimination-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…Russia by one of our Presidents. They have said: We see the  system to our north where there is no freedom, where people are not in  charge of their own destiny because they are ruled by a dictator, and  we reject that and will fight with our lives--and so many have, in  fact, perished on the battlefield--to defend our freedom.\n\nThat inspires me every time…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…citizenship when a person registers for a State ballot. We have to  do that in Arizona, and we have had no suppression. We are the only  State that does it because the Supreme Court ruled that way. Somehow,  we can't do it for Federal ballots?\n\nMr. Speaker, think about that. For an alderman or legislator in  Arizona, we have to show proof of citizenship to register…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699942/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…determine there is good cause for       noncompliance with the 48 hours requirement.\n\n8.6. Objections and Rulings.--Any objection raised by a       witness or counsel shall be ruled upon by the Chairman or       other presiding member, and such ruling shall be the ruling       of the Committee unless a majority of the Committee present       overrules…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688225/us-senate-select-committee-on-intelligence-rules-of-procedure"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…and said they will try to do even more. The problem isn't in  Canada.\n\nEven if the problem is valid, even if that is something that we all  agree on,  you can't have a country ruled by emergency. You can't have a country  without a separation of powers, without checks and balances.\n\nMadison put it this way. Madison said that we would pit ambition  against…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689478/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…merely present in the  video, not touched, actively involved, or engaged.\n\nIn that case, the defendant filmed himself in sexual conduct near his  9-year-old niece. The court ruled that he did not use her under  existing statute because she was passive. That interpretation is  utterly unacceptable.\n\nPredators should not evade justice simply because the…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698897/child-predators-accountability-act"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…Chagos Islands.\n\nHuh? They actually said: Give us back the Chagos Islands.\n\nMauritius never owned the Chagos Islands.\n\nBut anyway, predictably, the International Court of Justice ruled in  favor of Mauritius. I don't think anybody was particularly surprised,  nor did anybody pay particular attention until, in recent years, United  Kingdom Prime Minister Starmer--the…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699482/9999"}, {"senator": "Darrell Issa", "party": "Republican", "sentence": "…disagreements and the Court has  interpreted, but those interpretations, including Brown v. Board of  Education, historically became nationwide when the High Court by a  majority ruled one direction or the other. That is the way our Founding  Fathers intended it to be.\n\nThe ranking member of the full committee is a scholar and a teacher,  a professor of this,…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689711/no-rogue-rulings-act-of-2025"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…a clerk of the court in Kentucky who was  a very religious woman. She did not want to recognize a gay marriage in  Kentucky. She issued marriage licenses. The Supreme Court ruled that  gay marriage was the law of the land. She refused. I said she needed to  do her job. She went to jail for 5 days, and she should have because  you can't let your personal…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700070/9999"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…process. President Trump's  ``Unleashing American Energy'' executive order directs Federal agencies  to confine NEPA analysis to applicable law, and in May, the Supreme  Court ruled unanimously on narrowing the scope of NEPA.\n\nIt is time for Congress to take bipartisan, bicameral action to fix  the broken permitting and regulatory laws so that America…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693796/fix-broken-permitting-and-regulatory-laws"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…Confederacy. States are not permitted to obstruct the  enforcement of Federal law. In a humiliating slap-down of Mr. Newsom,  even the notoriously liberal Ninth Circuit Court ruled that the  President has the clear authority to federalize the National Guard to  restore order whenever State or local officials are derelict in their  duty to protect the…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693141/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Rick Crawford", "party": "Republican", "sentence": "…with a  resounding: ``It is clear Maduro must go, the sooner the better.''\n\nMadam Speaker, you should congratulate President Trump. Instead, what  did she say: ``Venezuela is ruled by an illegitimate regime, but the  administration has not made the case  that an urgent threat to America's national security existed to justify  the use of U.S. military…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698882/successful-operation-to-arrest-nicolas-maduro"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…physical discomfort, that       during testimony, television, motion picture, and other       cameras and lights, shall not be directed at the witness.       Such requests shall be ruled on by the Subcommittee Members       present at the hearing.\n\n12. An accurate stenographic record shall be kept of the       testimony of all witnesses in executive and public…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687952/us-senate-permanent-subcommittee-on-investigations-rules-of-procedure"}, {"senator": "Brad Finstad", "party": "Republican", "sentence": "…the net. Warroad came away with the puck,  but junior forward Zoe Heimer, who made the shot, knew the puck had  crossed the goal line, prompting a video review that ultimately ruled  in favor of the Wildcats.\n\nThe top-seeded Dodge County team has been nothing but impressive all  season, finishing strong with a record of 24-3-2. Their championship  win…", "date": "2025-04-17", "source_url": "https://justfacts.votesmart.org/public-statement/1690120/recognizing-the-2025-class-1a-minnesota-state-girls-hockey-champions-the-dodge-county-wildcats"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "…outdoors and creation. He was an avid hunter of       deer and pheasant. Antelope, other game birds, various animal       pelts, and fish also adorned his man cave walls. He ruled the       remote when his favorite basketball, baseball, and football       games were on TV. Another pastime he enjoyed was hobby       ranching and always had horses.\n\nJim…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696152/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…colleagues to stop saying that.\n\nIn fact, Republicans sued over ads that were being run in certain  districts last week, and the Democrats had to pull those ads because  the court ruled that they were not factual. They were the same kinds of  things that are being said on this floor day after day.\n\nNonetheless, let's get back to the bill at hand: the rule…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689054/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers-providing-for-consideration-of-hr-defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…contracts and agreements with partners and allies around the  world and across many different areas.\n\nIn fact, just yesterday, a Federal district court judge in California  ruled that the reductions in force--the layoffs, the RIFs--announced by  the administration during this current shutdown were illegal because  they were targeted and partisan.\n\nSo…", "date": "2025-10-16", "source_url": "https://justfacts.votesmart.org/public-statement/1696237/9999"}]