[{"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…Salvador without a trial, without a hearing, and without a  shred of justice.\n\nThis isn't just cruelty, but it is lawlessness. It is a direct  assault on our values and the rule of law. He was abducted from his  home and sent to a foreign prison infamously known for human rights  violations. When the President defies the courts, he crosses the line  into…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690835/recognizing-jessica-suarez-nieto-during-teacher-appreciation-week"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…confidence in our courts.\n\nCourt Reporting and Captioning Week highlights both the technical  skills required in this profession and its importance to public  protection and the rule of law. Court reporters and captioners serve  throughout our justice system, ensuring that proceedings at all levels  are accurately recorded and accessible for future use.\n\nBeyond…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699559/recognizing-court-reporting-and-captioning-week-2026"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…Guard when the police in  Los Angeles and the elected officials are doing their jobs.\n\nThis is an authoritarian attack on constitutional democracy. We must  get back to the rule of law.\n\nIf nothing else, the Republicans should put up the plaque they  committed to put up, honoring the police officers who defended American  democracy, the Vice President…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693146/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Norma Torres", "party": "Democrat", "sentence": "…their dreams, serve their  communities, and have a voice in their government without reprisals.\n\nToday, we are witnessing something deeply troubling: the erosion of  the rule of law, the abandonment of democracy norms, and a betrayal of  the very values Americans of all backgrounds have long fought to  uphold.\n\nOn this 100th day of the 119th Congress,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690202/standing-for-america"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…Speaker. Two American citizens have lost their  lives, and we have just moved on.\n\nMadam Speaker, our democracy is at risk because we have a President  who disrespects the rule of law. He believes that if the ends can  justify the means, then any means are available to him to utilize to do  whatever he chooses. If we allow this to continue, Madam Speaker,…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700176/state-of-our-union-is-fragile"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…adverse to each other in court or       other professional settings. Despite our differences, we all       share a commitment to the United States Constitution, the       rule of law, and the role of the legal system in protecting       the rights of all people and ensuring all of us can have our       day in court. This commitment to the Constitution…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689713/no-rogue-rulings-act-of-2025"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…resolution affirms what should be nonpartisan truths: that the  separation of powers is vital for a functioning republic, that Congress  controls the public purse, and that the rule of law and the protection  it affords are for everyone. In the face of escalating threats to our  constitutional order, Congress must not remain silent. This resolution  is a declaration…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694144/introduction-of-a-resolution-reaffirming-the-principles-of-the-constitution-of-the-united-states"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…that he did not lose the election when he, in fact, did. Democracy only  survives when leaders put the will of the people ahead of their own  selfish ambition and when the rule of law is enforced. We thank the  hundreds of brave police officers who put their lives in harm's way to  defend the Capitol and our democracy.\n\nThey know what it means to be patriotic…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698553/january-6-attack"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…her life to serving our country, and she has done so  at every level of the Federal Judiciary. At every turn, she has upheld  the Constitution and faithfully followed the rule of law. She is  impartial, thoughtful, and even-handed, evaluating every case from, in  her words, a ``neutral posture.''\n\nSince her confirmation, Justice Jackson made her mark…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689666/justice-ketanji-brown-jackson"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…assault on the public servants who do it.\n\nIt is incumbent on all of us to fight for the Justice       Department before it's too late.\n\nDOJ's mission is to ``to uphold the rule of law, to keep       our country safe, and to protect civil rights.'' It's failing       on all three fronts:\n\nThe Justice Department cannot uphold the rule of law when…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…administration. That is not true. He didn't even--he wasn't even  concerned enough to go back and look at the history.\n\nThis is legislation, and it is a law--it is not a rule--it is a law  that we passed in 2017 during the first Trump administration. I know  because I sponsored it. The House sponsor was our current Secretary of  Homeland Security Kristi…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690349/9999"}, {"senator": "Valerie Foushee", "party": "Democrat", "sentence": "…officers were injured, and several lost their lives  defending this institution. Their courage deserves not just remembrance  but that we remain vigilant in upholding the rule of law.\n\nThe attack on January 6 was the result of a President who chose  division over truth, grievance over governance, and chaos over  accountability. That choice continues…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698551/january-6-attack"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…This is not the America that we learned about in civics class. This  is the behavior of a dictatorship. We live in a democracy, where even  the President must follow the rule of law and the Constitution.\n\nMy vote against the funding today for DHS was to stand in solidarity  with Minnesotans to demand changes that will protect our democracy. We  are…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699551/no-funding-for-dhs"}, {"senator": "Norma Torres", "party": "Democrat", "sentence": "…self-reflection of our country's  leaders who promised to protect Americans and enforce the law, yet  whose actions have violated basic human rights, the Constitution, the  rule of law, and are now costing our country economically.\n\nUnder these policies, DHS is targeting people because of the color of  their skin, the language they speak, and where they…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697448/fighting-dhs-immigration-raids"}, {"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…location to their  families and legal counsel, in violation of the Constitution and the  rulings of the Supreme Court, as well as the foundational principles of  due process and rule of law.\n\nC. Directed and permitted the deliberate and systematic violation of  laws duly enacted by Congress.\n\nSpecifically, he has terminated inspectors general, the officers…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691079/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…same police officer  is the police officer who you call in the middle of the night when you  hear a noise in the backyard and something at the door.\n\nWe have to protect the rule of law, and we only do that through  protecting our men and women of law enforcement.\n\nA few weeks ago in Colorado Springs, we had a raid by the DEA of a  nightclub where over…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691164/events-this-week"}, {"senator": "Carlos Gimenez", "party": "Republican", "sentence": "…Agreement,  which expanded cooperation on security and counter-narcotics efforts.\n\nPresident Uribe's courage in confronting narco-terrorist groups and  his dedication to the rule of law set a model for democratic  governance. For his leadership, integrity, and tireless defense of  liberty, many regard President  Uribe as the Abraham Lincoln of Colombia,…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696701/recognizing-president-alvaro-uribe-velez"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…articulated in its Articles of       Agreement; and\n\n(2) the experience of Taiwan in developing a vibrant and       advanced economy under democratic governance and the rule of       law should inform the work of the international financial       institutions, including through increased participation by       Taiwan in the institutions.       SEC. 4.…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692796/taiwan-non-discrimination-act-of-2025"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…uniform who serve with  courage, integrity, and selflessness.\n\nEvery day, law enforcement officers put themselves in harm's way to  protect our communities and uphold the rule of law. They respond  without hesitation, often under dangerous and unpredictable  circumstances.\n\nA recent incident in my district highlights what that commitment  looks like.…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691166/events-this-week"}, {"senator": "Michael Cloud", "party": "Republican", "sentence": "…into law so  that no future administration can turn Federal relief into a global  giveaway.\n\nThis is about ensuring we have the validation mechanisms in place to  ensure the rule of law. It is about prioritizing Americans. It is about  making sure that when a small business owner like those in Texas, or  anywhere else, fills out an application, they know…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692127/american-entrepreneurs-first-act-of-2025"}, {"senator": "Keith Self", "party": "Republican", "sentence": "…Salman Rushdie, who was stabbed under a fatwa just  for writing about Muhammad.\n\nAmerica was founded on a basic concept of freedom of the individual,  self-governing under the rule of law. John Adams said: ``Our  Constitution was made only for a moral and religious people. It is  wholly inadequate to the government of any other.''\n\nWe are witnessing the reality…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1697017/sharia-is-dangerous"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…people killed.\n\nThis resolution condemns the violence, but there is something far  more sinister afoot that strikes at the very foundation of a  constitutional Republic: the rule of law. As Abraham Lincoln told the  Democrats long ago: ``There is no grievance that is a fit object of  redress by mob law,'' and this generation of Americans is taking note.", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693141/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Ashley Moody", "party": "Republican", "sentence": "…heroes.\n\nAn attack on those who enforce our Nation's laws is an attack on what  this country was built on. It is an attack on the people's law. Indeed,  it is an attack on the rule of law.\n\nOver the last 10 months, our Federal officers and agents have faced a  dangerously escalating pattern of violence, ranging from hitting,  spitting, kicking, and biting…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697550/halo-act"}, {"senator": "Tony Wied", "party": "Republican", "sentence": "…Waupaca County.\n\nI had the privilege of getting to know Sheriff Wilz personally over  the last year, and I know that he is a man of integrity who is  committed to upholding the rule of law and protecting the people of  Waupaca County.\n\nOn behalf of the people of Waupaca County and Wisconsin's Eighth  Congressional District, I thank Sheriff Wilz for his decades…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691410/recognizing-sheriff-timothy-wilz"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…on a massive scale. They are crimes against  humanity.\n\nThe bill is a necessary tool to fight that evil. It aligns our  foreign policy with our core values: human rights, rule of law, and the  sanctity of life. As chairman of the House Foreign Affairs Committee, I  am proud to support it.\n\nI thank my colleagues, Mr. Smith of New Jersey and Mr. Keating…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690630/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "Claudia Tenney", "party": "Republican", "sentence": "…TENNEY. Mr. Speaker, I rise today to commend President Donald J.  Trump for his decisive leadership that restored American strength, put  our security first, and reasserted the rule of law on behalf of the  American people in our hemisphere.\n\nFor years, Venezuela, under Nicolas Maduro, was not a legitimate  government. It functioned as a criminal enterprise,…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698881/successful-operation-to-arrest-nicolas-maduro"}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "Mr. CRUZ. Madam President, I rise today to speak about a grave matter  and a clear violation of religious freedom, human dignity, and the rule  of law.\n\nIn China, Christians are fighting daily for their religious freedom  against the Chinese Communist Party. And on October 10, 2025, the  Chinese Communist Party launched…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696588/expressing-condemnation-of-the-chinese-communist-partys-persecution-of-religious-minority-groups"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…BACON. Mr. Chair, I 100 percent support the Baltic Security  Initiative. All three countries are our best friends. They embrace  freedom, democracy, free markets, and the rule of law, and no one has  embraced our values like these Baltic States.\n\nThese countries are on the front lines with Russia. They see the  treachery of Russia's invasion of Ukraine…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695259/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…they don't. Thank you, President Trump.\n\nWe have restored law and order and brought accountability by securing  the border, supporting law enforcement, strengthening the rule of law,  shrinking the Federal bureaucracy, cutting wasteful spending, and  demanding accountability for every taxpayer dollar. We are seeing it in  real time. Finally, things…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699278/highlighting-republican-successes-in-2025"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…of this Congress, and, of course, this President stand behind  them, appreciate them, and honor their work. We depend upon them not  only for our safety but for the very rule of law itself.\n\nAfter all, without law enforcement, there is no law. Without law,  there is no civilization, as people in sanctuary cities like Los  Angeles, Portland, Seattle,…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693930/law-enforcement-officer-and-firefighter-recreation-pass-act"}]