[{"senator": "Shri Thanedar", "party": "Democrat", "sentence": "…States to El Salvador, despite a  binding withholding of removal order prohibiting the government from  removing him to El Salvador; defied court orders, upheld by a unanimous  ruling of the Supreme Court, to facilitate the release of Mr. Abrego  Garcia and related orders to provide information to the court and  opposing counsel, while publicly flaunting…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691079/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Rob Menendez", "party": "Democrat", "sentence": "…should be vigorously opposed.'\n\n``We may disagree with interpretation of case law, but it is  unacceptable to personally target judges just because we disagree with  their ruling. We cannot have a judicial system where the government  seeks to remove judges simply because they do not rule as the  government desires. Considering the increasing physical…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689390/president-trumps-immigration-enforcement-policies"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…admits was deported by mistake--and there are many others similarly  situated--is defying an order of the Supreme Court. The U.S. Supreme  Court ruled in a nine-to-nothing ruling that the administration should  facilitate the return of Mr. Kilmar Abrego Garcia. Thus far, nearly a  month later, that has not occurred.\n\nThis is about fighting lawlessness.…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691406/motion-to-discharge-s-res-195"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…hearing to detain a defendant for  the period before trial.\n\nIn 1987, the Supreme Court upheld the constitutionality of the  Federal pretrial release and detention law. In its ruling, the Court  stressed the law's procedural protections for defendants.\n\nChief Justice Rehnquist said:\n\nIn our society liberty is the norm, and detention prior to       trial…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696979/district-of-columbia-cash-bail-reform-act-of-2025"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…believe to be an urgent message: The time to confront political  corruption and clean up government is now.\n\nSixteen years ago to this very day, the Supreme Court issued its  ruling in Citizens United v. Federal Election Commission. As you know,  Mr. Speaker, that decision overturned longstanding precedent and limits  on political spending by special interests.…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699238/restoring-election-integrity"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…predatory lenders.\n\nA district court judge blocked the Trump administration from  dismantling the Consumer Financial Protection Bureau before the  administration appealed the ruling, and even this terrible resolution  before us received bipartisan opposition in the Senate.\n\nMr. Speaker, as we stand here and discuss these anticonsumer CRAs  today, our constituents…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689953/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…delayed. It would be so delayed that it would  be denied. It would be inefficient, cost prohibitive, and unfair.\n\nThat is what Republicans want because Federal courts keep ruling  against Trump's unlawful and unconstitutional executive actions.  Therefore, they are trying to hamstring the courts so that Trump can't  be stopped.\n\nWe need our courts to…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689713/no-rogue-rulings-act-of-2025"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…the State of Hawaii  officially designated September 2025 as Hawaiian History Month.  Designated on September 2, 2025, the 187th anniversary of the birthday  of Hawaii's last ruling monarch Queen Liliuokalani, Hawaiian History  Month aims to recognize, reflect, and share Hawaii's true history. I  had the honor of recognizing the accomplishments of two…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695588/hawaiian-history-month"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…accorded people before he  can take this extreme action, and when this President is told not only  must there be due process, but if you believe that the court has made a  ruling that is inappropriate, that the court has made a mistake, you  must still honor that court order and appeal; that the appellate courts  will then take charge of what you believe…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692116/authoritarianism"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…anniversary of the Supreme  Court's Citizens United decision, which paved the way for corporations  and billionaires to spend unlimited money in our elections. Because of  this ruling, anyone, for the right price, can buy their preferred  outcomes in our elections and in Congress. One need look no further  than Elon Musk and the crypto bills that we are…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693551/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…tire  manufacturers will address this, but it is cost-effective, protects  public health, and ensures the industry stays competitive. It is long  overdue.\n\nIn fact, the Court ruling required the EPA to finalize this rule to  close the loophole that allowed rubber processing facilities to spew  unlimited hazardous air pollution. When fully implemented,…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688531/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…your own opinion, but you can't own the  facts. Far from defying Federal law, courts have actually upheld  sanctuary laws and policies. I will reference just one. In a 1997  ruling in Printz v. United States, Justice Scalia wrote:\n\nThe Federal Government may neither issue directives       requiring the States to address particular problems, nor…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700066/9999"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "…happening again  and one that considers the criminality involved.\n\nYet another Trump lackey, our Attorney General, who is officially  supposed to be the people's lawyer, is ruling out a criminal  investigation into this scheme altogether.\n\nMr. Speaker, these are the same people that spent the better part of  a decade looking into Hillary's emails. They…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689418/reckless-incompetence-of-signal-chat-put-servicemembers-at-risk"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…will not tolerate, and you should not tolerate, a full-blown dictator.  I say a de facto dictator because, in fact, he is a dictator; not  announced but that is what he is, ruling by executive order.\n\nThis country was not designed by the Framers of the Constitution to  be ruled by executive order such that the President would just ignore  those orders,…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690862/and-still-i-rise-impeaching-president-trump"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…second criteria has been met.\n\nWe had a similar resolution on the floor a few years ago following  the U.S strike that killed the Iranian military leader Soleimani, and  the ruling of the Parliamentarian and really the acknowledgement of the  body was that there was no current congressional authorization  authorizing war against Iran.\n\nSo the question…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692637/war-powers-resolution"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…forget about the war and the genocide in those  countries in the 1990s in which many Bosnian Iowans lost family.\n\nWell, I am glad that he has since complied with the court ruling by  stepping down from his position as leader of the RS entity and walked  back some of his destabilizing actions. In return, the United States  has dropped sanctions against…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696528/bosnia"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…America'' while they were  swearing in their President. We don't do that here. Why? Because we are  not crazy. These people are crazy. The Iranian people are not, but the  people ruling the place are fanatical religious Nazis. If you don't  think it is our concern, you really have missed a lot. You need to  study before you talk.\n\nIf that is not enough, the…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692780/iran"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…communities, I would like to voice       my support for the Maintaining Cooperative Permitting Act of       2025 (H.R. 2030/S. 1014).\n\nThe Act is necessary to set right last year's ruling from a       federal district court in Washington, D.C., which vacated the       Environmental Protection Agency (EPA)'s approval of Florida's       Clean Water Act Section…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698026/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "Mr. McCLINTOCK. Mr. Speaker, in order for the Supreme Court to issue  a ruling that affects the entire Nation, at least five Justices of the  Supreme Court must concur. Yet today, individual district court judges  are asserting this authority by themselves.…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689722/no-rogue-rulings-act-of-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…STATES MARKET ACCESS, OR EARTH                     STATION AUTHORIZATIONS.\n\n``(a) In General.--The Commission may not grant a license       for, or a petition for a declaratory ruling to access the       United States market using, a geostationary orbit satellite       system or a nongeostationary orbit satellite system, or an       authorization to use…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690259/secure-space-act-of-2025"}, {"senator": "Darrell Issa", "party": "Republican", "sentence": "…speaks for all, he or she should rule on behalf of all  the plaintiffs represented in front of them.\n\nLet it be clear: The work of the Supreme Court is not just to  overturn one ruling by a judge. The Court most often in the 62 to 66  cases it takes per session, per year, rules primarily on when there is  a difference between the ruling in one and the ruling…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689711/no-rogue-rulings-act-of-2025"}, {"senator": "John Rose", "party": "Republican", "sentence": "Mr. ROSE. Mr. Speaker, today, I rise in support of this morning's  ruling from the Supreme Court that will greatly reform the ability of  rogue district court judges to issue nationwide injunctions.\n\nAccording to a Politico article this morning,…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693094/supporting-supreme-court-ruling-on-nationwide-injunctions"}, {"senator": "Ashley Moody", "party": "Republican", "sentence": "…further, that the bill  be considered read a third time and passed, and that the motion to  reconsider be considered made and laid upon the table. And prior to any  further ruling by the chair, if I might make a comment--I withdraw so I  might be able to make a comment, and then I will resubmit it.", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698318/executive-calendar"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…requirement.\n\n8.6. Objections and Rulings.--Any objection raised by a       witness or counsel shall be ruled upon by the Chairman or       other presiding member, and such ruling shall be the ruling       of the Committee unless a majority of the Committee present       overrules the ruling of the chair.\n\n8.7. Inspection and Correction.--All witnesses…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688225/us-senate-select-committee-on-intelligence-rules-of-procedure"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…made that only 24 out of 388 miles have  been restricted to off-road vehicle use, but as we all know, roads are  networks. For instance, there is a half-mile section in this ruling  under the Biden administration that blocks off access to over a million  acres. You block off a half-mile of road, and you restrict the use to a  million acres. I don't think…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690405/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…of jet fuel have powered an expansive bombing campaign  by the junta that has struck more than 1,000 civilian locations,  including Christian churches.\n\nWhile the military ruling class pledged open and fair elections, the  sham process that took place last month should be viewed as a rigged  farce and nothing more. Make no mistake, these mass atrocities…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699832/bringing-real-accountability-via-enforcement-in-burma-act"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…States the exclusive right to acquire Indian  lands and prohibits conveyance without Federal approval.\n\nAfter decades of court proceedings, a 2022 Northern District of New  York ruling determined that the State of New York's 1825 purchase of  land violated the Non-Intercourse Act. Mediation between the parties  resumed and culminated in a settlement signed…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697675/resolving-the-akwesasne-mohawk-land-claim-in-the-state-of-new-york"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "…Rulings Act  says that enough is enough. It is a simple, commonsense fix. No single  district judge should have the power to grind the entire Nation to a  halt with one rogue ruling.\n\nWhy should a single unelected judge override the votes of 80 million  Americans? This is not how our Constitution was designed. The Founding  Fathers gave Congress the power…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689710/no-rogue-rulings-act-of-2025"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…monthly average was over 150,000. It is  astonishing.\n\nThis is something that has been delivered. I would appreciate any  opportunity to codify this into law. I do not like ruling by executive  order all the time. This is stuff we need to codify.\n\nI hope that we can learn from the good experience with the Laken  Riley Act and how our functioning Republic…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690427/the-first-100-days"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…intelligence cooperation, and the Georgian people are well known for  their pro-American sentiment.\n\nUnfortunately, our bilateral relationship with Georgia has been  eroded by the ruling Georgian Dream party's moves that mimic Russia's  authoritarian tactics, as well as their rapprochement with China and  Iran.\n\nThe opportunities provided by a pro-Western,…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690702/mobilizing-and-enhancing-georgias-options-for-building-accountability-resilience-and-independence-act"}]