[{"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…restore the mantle of fighting for working people.\n\nI was born and raised in the most patriotic town in the country,  Bristol, Rhode Island. We have the oldest and longest running Fourth of  July celebration in the country. I learned from a young age to be  patriotic, but I also learned that patriotism is not just about parades  and parties and barbecues,…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689081/economic-populism"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "…they are. That does not  make us safer. It makes us weaker.\n\nIt destabilizes our schools, our neighborhoods, and our workplaces.  It harms industries that keep our economy running--construction,  agriculture, hospitality--all while wasting taxpayer dollars on cruelty  instead of real public safety. I dissent.\n\nFamilies across this country now live in…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695282/scotus-immigration-raids-action"}, {"senator": "Robin Kelly", "party": "Democrat", "sentence": "…Noem recruiting January 6  insurrectionists?\n\nI was one of the last Members of Congress to escape the House gallery  on January 6. I remember hiding on my hands and knees and running  through the hallways to a safe room. Insurrectionists are not fit to  serve as law enforcement.\n\nI realize that the impeachment of Secretary Noem does not bring Renee  back.…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698951/impeach-secretary-noem"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…want us to tackle the high cost of living, housing, and  health care, to confront climate change, to honor the public servants,  our Federal employees, who keep our government running.\n\nMr. Speaker, I am humbled by the trust my constituents have placed in  me. I will carry their hopes and their voices into this Chamber every  day. I will never forget where…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695221/welcoming-the-honorable-james-walkinshaw-to-the-house-of-representatives"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…than this. We can focus on finding bipartisan  solutions. We can focus on working together as members of the Finance  Committee and actually get something done, but time is running out. I  know that we want to get something done, but this Finance Committee-- has the full committee met in open mark-up for 7 days of debating and  amending legislation,…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697783/healthcare"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…workers, including those at the Departments of  Defense, State, and Veterans Affairs.\n\nWe count on these public servants to be on the front lines, keeping  our communities running and our constituents safe. In return, they  deserve to have their rights protected. That is why I am a strong  supporter of this legislation that will overturn the President's…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697980/protect-americas-workforce-act"}, {"senator": "Tina Smith", "party": "Democrat", "sentence": "…in the Twin Cities now. They are  called ghost cars. What is this? This is a car that is left in the  street, the middle of the street sometimes, the door open, the engine  running, the keys still in the car, and nobody is there. People know  what happened. ICE came and got whoever was driving the car and took  them away.\n\nYou know, if you are going…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699416/9999"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "Mr. JOHNSON of Georgia. Mr. Speaker, I thank Representative McClellan  for running point on this Special Order hour for the CBC. She is a  legislative champion both in the State house and in the Federal House.  It is good to be with her tonight, and I thank…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697217/medical-bills-are-too-high"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…``had numerous congressional debates,'' but D.C. didn't get a  vote on the One Big Beautiful Bill Act.\n\nThey bring up that they have put this resolution forward. They are  running from their offices over here to the House floor to debate on  this resolution to overturn a local law passed by members of the D.C.  Council who were elected by the people…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699681/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…have to come online. As those new and more expensive units have  to come online, the price goes up and up and up because in almost every  grid, it is the most expensive unit running at any minute that sets the  price for the entire grid in that minute.\n\nSo if you can drive up demand, you drive up these huge, inefficient,  polluting, expensive, powerplants…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696122/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…job, worked  really hard to become a U.S. Senator. Those of us who worked on these  bipartisan pieces of legislation worked really hard to pass them. What  is the point of running for the U.S. Senate, what is the point of  working to forge this compromise if the President can just ignore it?\n\nBy the way, if Donald Trump gets away with it, mark my words,…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690948/gun-violence"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…still going to be  adding to the deficit. The deficit hawks in the Republican Party are  adding to the deficit with this measure on top of the deficits that we  are already running today.\n\nThis bill is fiscally irresponsible and outrageously unfair in terms  of who benefits from it. It is extremely harmful to middle-class and  working families of this…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687944/republican-budget-betrays-middle-class"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…high. It is  108 degrees, and everybody is pumping their air-conditioners. That also  happens to be the point in time and the point of the day when all of  the solar farms are running at full capacity, and they can power the  grid.\n\nSo solar energy isn't something from 17 years ago when you said, you  know, sometimes the Sun is shining and sometimes it…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693485/one-big-beautiful-bill-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…Emirates. That is corruption laid out as black  and white as you could ever see it. This is incredible. This is what we  expect of very poor, impoverished countries with dictators running the  place, taking a cut of everything, but instead it is the President of  the United States doing it.\n\nOur Founders said this should never be allowed. Hamilton noted the…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692355/motion-to-discharge-sj-res-54"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…at  a press conference.\n\nThe idea that ICE is making our communities safer is ludicrous. I  quote the podcaster Joe Rogan: ``. . . if the Trump administration, if  they're running and they said . . . we're gonna arrest all the people  at Home Depot. We're gonna go to construction sites and we're going to  just like tackle people at construction sites,…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692896/condemning-violence-by-ice"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Speaker, if it is true that law  enforcement is somehow never allowed to be in something other than  their uniform, I think there are a lot of people who have gotten  tickets for running a stop sign, when there was an unmarked car there,  who would be happy to hear that. They now have a new basis to challenge  that.\n\nI think we are all aware that there are…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693143/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…high-speed pursuit. Having to drive 100 miles an hour to catch up  with somebody that you are pulling over is not a high-speed pursuit.\n\nA high-speed pursuit is when they are running. This is something  where the officer has to make very fast decisions, Mr. Speaker. Yes, we  consider the totality of circumstances of where we are: Is that a  suspect vehicle?…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695643/district-of-columbia-policing-protection-act"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…convince you of that because, of course, as law-abiding  American citizens, it is the right thing to do.\n\nRepresentative Roy, when I was growing up, if there was a criminal  running down the street and an officer was chasing him, somebody would  be a Good Samaritan and stick their leg out or say: He went that way  and help out. But we are literally living…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698925/ice-under-attack"}, {"senator": "John Thune", "party": "Republican", "sentence": "…heading toward an energy  crisis where we simply don't have the supply to meet the demand.\n\nThe Washington Post noted last March:\n\nVast swaths of the United States are at risk of running       short of power as electricity-hungry data centers and clean-      technology factories proliferate around the country, leaving       utilities and regulators grasping…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688403/joint-session-of-congress"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "…legislative process--not the bureaucratic process.  That is something different. That doesn't exist here. Nor is this  simply a delay for the sake of delay. I pride myself in running the  Energy and Natural Resources Committee and bringing forth these  hearings as expeditiously as possible, and I have offered to put it on  the next appropriate subcommittee…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698296/9999"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…significant economic benefits to the region       that would have otherwise been absent. Our North Slope       residents are keenly aware that advances in our communities--      running water, local schools, health care, public safety,       electricity, and more--have come because of the coordination       and cooperation of Alaska Native leaders and entities…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696449/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…trying to  constantly estimate what the gross national product, GDP, will actually  be.\n\nA little while ago, they actually updated it saying the U.S. economy  looks like it is running at 3.4 percent.\n\nThat is remarkable. If you stop and think about it, this is  absolutely--think about all the headwinds and all the things over  tariffs and all these  other,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695567/we-are-borrowing-a-second"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…and passion quickly rallied a  team of dedicated volunteers around her dream. From that vision, the  RAP River Run was born. Today, it stands as one of Tampa Bay's premier  running events, drawing thousands of participants and volunteers each  year. Thanks to the continued enthusiasm and support behind this event,  the team is excitedly preparing for…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692476/recognizing-victoria-barley"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…them, right in their own  communities every single day, again, being willing when they put on  that uniform, when they sign up, to say, ``I will give all for my  community,'' running to the sound of the gun, running to the danger,  unlike most other people whose senses, whose sensibilities, tell  them to go the other way.\n\nThis is the smallest thing we…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689661/authorizing-the-use-of-the-capitol-grounds-for-the-national-peace-officers-memorial-service-and-the-national-honor-guard-and-pipe-band-exhibition"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…also have goals that are perhaps intentional  and perhaps unintentional. These are the goals that I am going to  address today.\n\nBy the way, this is relevant whether we are running a $1 trillion or  over a $1 trillion increase in debt every year, or whether we were, in  fact, in a surplus situation.\n\nI am going to look at some programs, which, again,…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688328/destruction-of-the-nuclear-family"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…the 1970s--I remember gas lines and having to push my father's car to  get gasoline. At the time, everybody said we were going to run out of  crude oil. That was the thing, running out of crude oil.\n\nI appreciate the gentleman bringing up the crude oil issue. It is  actually because of the ingenuity of the American people that we have  an abundance of…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697031/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…people who  would say: You can't have that power. It is our power.\n\nThat pitting of ambition back and forth was to constrain government.  It was to constrain government from running away and power from being  run away with one person.\n\nThe Founding Fathers empowered Congress with tools to ensure that the  liberties of the people would not be threatened…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690543/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…percent of the entire economy this fiscal year, the  fiscal year that we are in right now.\n\nWhen you hear the economists both on the Democratic side and the  Republican side running around saying: We should only be borrowing 3  percent, that would mean almost $1.8 trillion of cuts this fiscal year  to get to a 3 percent borrow. Most of the borrow, or…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694954/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…member. As  anybody who has listened to this debate can just tell, he is a very  bright, very thoughtful, articulate fellow, and I am very fortunate  that he is my partner in running the Armed Services Committee.\n\nI also thank Chairman Roger Wicker of the Senate Armed Services  Committee, and Ranking Member Jack Reed. They also are very passionate,  thoughtful…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697810/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…our  country strong.\n\nAs a former small business owner myself, I know the early mornings,  the long nights, the lack of vacations, and the risks it takes to keep  a business running. These men and women are the heart of Main Street  America, and they deserve leaders who will fight for them.\n\nIn Iowa, small businesses represent 99 percent of all businesses…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690743/myths-of-medicaid-reform"}]