[{"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…were eager to frame Boston as the driver of the       revolution and Bostonians as the inheritors of the legacy of       the revolution,'' said Nat Sheidley, a historian who runs       Revolutionary Spaces, a Boston-based organization that runs       public programs about colonial America--including this week's       anniversary of the tea party. He…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691707/253rd-anniversary-of-the-gaspee-raid"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…made them feel better.\n\nIn fact, the former Surgeon General, Vivek Murthy, said that music is  medicine, and research continues to show the healing power of the arts.\n\nThe VA runs a successful arts therapy program for veterans with PTSD.  World-renowned soprano, Renee Fleming, recently released ``Music and  Mind'', a new book about harnessing the arts…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695492/national-arts-in-education-week-2025"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…of Congress--but the people  in this country deserve transparency also. It is this transparency that  helps people to have the confidence in the system necessary to prevent  runs on banks.\n\nAgain, I would want people to understand that institutional knowledge  is a supreme exemplar of what can occur when we have these  circumstances that require bold…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697285/systemic-risk-authority-transparency-act"}, {"senator": "Mike Levin", "party": "Democrat", "sentence": "…system  built on data and durability. They deserve leadership that understands  that affordability is engineered, not declared.\n\nThey deserve lower bills. The path to lower bills runs directly  through the clean energy deployment that markets are already telling us  is the cheapest way forward. That is why we are here today, and that is  what the Energy Bills…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700230/winners-of-the-global-energy-race-are-being-decided"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…like Baltimore.\n\nDonald Trump cut their grant. So in the middle of the grant, they are  losing $1.2 million, and they are going to have to lay off 7 employees.\n\nCenter for Hope runs 6 of the city's 10 Safe Streets sites. These  operate in the pockets of Baltimore where you see the most shootings.  Because of these Center for Hope sites--these Safe Streets…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690948/gun-violence"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…Republican agenda would dramatically increase premiums for more  than 198,000 Oregonians, including my constituent Teresa from Clatsop  County. Teresa, a small business owner, runs a small flower and produce  farm. Like many small business owners, she purchases her coverage on  the Oregon health care exchange. Because of Republicans' refusal to  protect…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696722/continuing-appropriations-and-extensions-act-2026"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…especially as Congress mulls  hundreds of billions in Medicaid cuts.''\n\nThe New York Post continues: ``That not only looks bad; it creates  all kinds of conflicts of interest and runs smack into the  Constitution's Emoluments Clause, which prohibits foreign gifts.''\n\nThe Post Editorial closes: `` . . . but given all the foreign  investments and conflicts…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691089/new-york-post-editorial-on-qatari-jet"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…creative ways because they know it is  politically unpopular to tell you to your face.\n\nWe are coming up on a big deadline here. We all know that. On  September  30, the government runs out of money. I don't know a single person who  wants a government shutdown. After almost 16 years in the Federal  Government, where I was on the receiving end of those shutdowns,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695610/healthcare"}, {"senator": "Tina Smith", "party": "Democrat", "sentence": "…his  place of work to get lunch, and he sees an ICE agent. He is concerned.  He is afraid that he might get targeted so he turns around and walks  the other way. The ICE agent runs after him and tackles the guy. He is  a U.S. citizen, throws him to the ground, injures him, and detains him  for hours, all the while this young man has documents to prove…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699416/9999"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Mr. Speaker? This is why people  don't trust  government. If we want to be serious about budgeting, fine. Let's be  serious. Let's look at where the waste, fraud, and abuse runs rampant.\n\nLet's audit the Pentagon. Let's go after corporate welfare and Big  Oil handouts. Let's close the loopholes that let billionaires pay zero  in taxes. But let's not…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692385/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…Dating Abuse Helpline, which provides 24/7/365 chat, text and  phone support to help teens and young adults experiencing abuse or  unhealthy dating situations. The Hotline also runs love is respect, a  program dedicated to engaging, educating and empowering young people  facing abusive or unhealthy relationships.\n\nI also wish to recognize the dedicated…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700099/recognizing-the-30th-anniversary-of-the-national-domestic-violence-hotline"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…relieved that  that worry about his health insurance would be take care of. She then  found out that the Medicare Advantage Program that she would be having  him sign up for runs $200 a month. Her original premium that she is  paying for health insurance for him and for her is $279 a month.\n\nSo right off the bat, she faced an increase over her base premium…", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697576/department-of-defense"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…companies that sell poor products and give bad service. It is why we  are diving headfirst into a global climate crisis and doing nothing  about it.\n\nIt is why every time someone runs for office on a platform of putting  people over profits, they have to endure attacks from super-PACs  supported by billionaires or business interests. Our democracy will  remain…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693551/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…just some things that  look and smell and feel wrong, given our history and given our values.\n\nI think what is most abhorrent about what is going on in Minneapolis  is that it runs against the fundamental freedoms of who we are as  Americans.\n\nNow, the President, who ran, in many ways, on the issue of  immigration, has managed to piss off everybody--left,…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699401/9999"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…trafficking or  immigrants in need of a rescue. These technologies can also help Border  Patrol agents communicate reliably in remote areas. When an agent gets  ill or injured or runs across an injured individual, the ability to  communicate quickly and effectively can mean the difference between  life and death.\n\nAdvanced technologies will also help prevent…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688687/emerging-innovative-border-technologies-act"}, {"senator": "Andy Harris", "party": "Republican", "sentence": "…Mr. Speaker, this week, the Energy and  Commerce Committee finally attacked fraud, waste, and abuse in the  Medicaid system.\n\nI think every American knows that when government runs a program,  there is fraud, waste, and abuse, and that is exactly what the  Committee dealt with.\n\nFor instance, 1 million people have committed fraud against the  Medicaid…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691335/eliminating-fraud-waste-and-abuse-in-medicaid"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…and enriched adversarial nations that were able to cash in as we took a  back seat in the global energy market.\n\nThe road to energy dominance and meeting this growing demand runs  through North Dakota. Advancing this CRA is the first step in helping  to unleash American energy and reinvigorate America's beautiful coal  industry, as President Trump has…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694908/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Dean Forman, and he is spearheading  this Servant Leadership Award, which will be awarded this weekend, and  the inaugural recipients will be Mark and Marcus Haney. Mark Haney runs  the Growth Factory in Rocklin, which helps early-stage entrepreneurs  build startup businesses. They work with them to build the funding case  and leadership capacity to attract…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690562/gas-prices-are-lower-for-everyone-except-californians"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…to work at Talladega Insurance after  leaving Atlanta, where he worked for the Great American Insurance  Company. In 2004, Bill's son, Boyd, joined the agency.\n\nToday, Boyd runs the agency. He is an alumnus of The University of  Alabama and The National Alliance's Producer School. In 2008, he was  named Alabama's Young Agent of the Year by the Alabama…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700098/recognizing-the-170th-anniversary-of-talladega-insurance-company"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…Army Corps of Engineers classified the project as an  operation and management project to be maintained at 9-feet deep and  100-feet wide for a 17-mile stretch of a river that runs through a  density of population and has never been maintained. The river has been  dredged one time in that period of time. In 1997, they dredged 1 mile.\n\nWhen I came into…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694867/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…Fox (who supported the initiative), to the Jefferey  Fox Track Meet. Starting with just five events the track meet has grown  to now include myriad events including dozens of runs, javelin throws,  high jump, long jump, tug of war, softball and foxtail throws and  others--that sometimes feature entire classrooms on the field.\n\nThe incredible day of sportsmanship…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690717/recognizing-brian-wisler"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…planes, making  him the first ace pilot of World War II.\n\nBy April of the following year, Buzz was credited with eight air-to- air kills, as well as numerous successful bombing runs on Japanese  airfields, one of which earned him the Distinguished Service Cross  citation.\n\nThough he tragically passed away in November of 1942 during a  training flight in…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689611/supporting-reversal-of-california-ev-mandate"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…time and time again has passed laws to encourage and even require oil  and gas leasing and development in the 10-02 area of ANWR. The Biden  administration's Record of Decision runs completely counter to the laws  that Congress has enacted, and they played games to discourage  development like only offering unfavorable acreage in their lease sale.\n\nThese…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696829/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…Social Security       numbers. The center let brokers submit the       fraudulent applications anyway. This suggests the Centers for       Medicare and Medicaid Services, which runs the federal       ObamaCare exchange, was ignoring fraud.\n\nGAO also analyzed enrollment data in 2023 and 2024 for data       anomalies. It found more than 29,000 Social Security…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697906/affordable-care-act"}, {"senator": "Tom Kean, Jr.", "party": "Republican", "sentence": "…and was selected for the Branchburg Recreation Spring 2025 All- Star Team. Sadie led her travel team to the Parkway League Spring  Division Championship and was team leader in runs scored and RBI's,  carrying an impressive .521 batting average and .662 on-base percentage  this past spring.\n\nOff the field, Sadie is a two-time Hunterdon Art Museum Young…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695064/recognizing-sadie-pirez-chevrolet-play-ball-player-of-the-month"}, {"senator": "Pete Ricketts", "party": "Republican", "sentence": "…the White House and Senate Republicans to come up with a reasonable  compromise based on common ground and to make sure that we are funding  Homeland Security.\n\nThat funding runs out Friday at midnight, and if Democrats allow this  to happen, it won't impact ICE operations, but what it will do is  interrupt FEMA. We just had a major winter storm on the…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699924/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…they say to us  now we are not going back in, so we don't have to vote on whether or  not we are going to war with Venezuela.\n\nThis, to me, is an absurdity; it is logic that runs in circles, and  it doesn't get us any closer to where we need to be. The reason the  Founding Fathers gave this power to the legislature is because they  wanted to make war…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699091/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Jim Baird", "party": "Republican", "sentence": "…his degree in veterinary medicine from Purdue  University in 1972 and has spent his career supporting veterinarians at  the local, State, and national levels.\n\nDr. Scamahorn runs the Animal Medical Clinic in Greencastle, Indiana.  He also helped found the Indiana Animal Health Foundation, which helps  fund scholarships and service animals. He also has…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690518/congratulating-mccutcheon-high-schools-mavericks-robotics-team"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…public health benefits  and actually goes so far as to have a negative environmental impact.\n\nThe Biden-Harris EPA finalized a rule targeting American tire  manufacturers that runs the risk of destroying domestic tire production  and eliminating thousands of good-paying American jobs.\n\nWhen finalizing the rule, the EPA stated the goal was to reduce  emissions…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688524/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "Richard McCormick", "party": "Republican", "sentence": "…Lake Lanier is the most visited lake of 464 federally operated lakes  in the United States, with well over 10 million annual visitors from  all over the country. The Army Corps runs the lake and the campgrounds  and parks surrounding it.\n\nThis summer, the Corps closed many of the campgrounds around the  lake, citing a lack of manpower and resources. Congress…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694870/energy-and-water-development-and-related-agencies-appropriations-act-2026"}]