[{"senator": "Chris Coons", "party": "Republican", "sentence": "…that rejects severe cuts; that restores  funding for programs like the NIH and the CDC, which is done in the  bipartisan Labor-H bill; and that rejects cuts to WIC and rural  housing, which is done in the Ag bill. We need to move these bills  forward.\n\nThe way we move these bills forward is by linking arms and making it  clear: We reject rescissions.…", "date": "2025-10-16", "source_url": "https://justfacts.votesmart.org/public-statement/1696237/9999"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Agency Application of Environmental Reviews. Sec. 106. Multifamily loan limits. Sec. 107. GAO study on workforce housing.     TITLE II--MODERNIZING LOCAL DEVELOPMENT AND RURAL HOUSING PROGRAMS  Sec. 201. HOME Reform. Sec. 202. Community Development Fund Amendments. Sec. 203. Grants for planning and implementation associated with                affordable…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…thank Chairman Hill and the team  here for a bipartisan bill that helps rural America have a successful  pathway to housing in the 21st century.\n\nMy legislation includes the Rural Housing Service Reform Act, the  most meaningful update to rural housing in decades.\n\nWhether you are in Des Moines or Ottumwa, the number one expense  Iowans are facing is housing.…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699801/housing-for-the-21st-century-act"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…A key reason for  this is outdated and obstructive government regulations that prevent  and delay new construction. That is why I introduced the bipartisan  Streamlining Rural Housing Act.\n\nThis bill would require HUD and USDA to develop a joint environmental  review process for rural housing projects, cutting red tape and making  rural housing easier…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697479/making-homes-affordable"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…control  and gives communities tools and flexibility to expand housing supply,  rather than forcing one-size-fits-all mandates from Washington.\n\nIt expands opportunities for rural housing developments by ensuring  rural communities aren't left behind and directing real attention and  resources to rural housing needs. It strengthens accountability at HUD…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699811/lowering-housing-costs-and-advancing-main-street-community-banks"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…restoring housing affordability by getting government  out of the way.\n\nIncluded in this package are many commonsense, bipartisan reforms.  Among them is my Streamlining Rural Housing Act. I thank Chairman Hill  for including it in this package.\n\nToday, rural housing projects in Indiana and across the country that  rely on both HUD and USDA programs…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699812/lowering-housing-costs-and-advancing-main-street-community-banks"}]