[{"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…Administration Subcommittee, I rise to  oppose this bill. Though it does represent, for the most part, solid  bipartisan work to provide investments in agriculture and rural  America, I am disappointed that the rest of it falls far short of the  needs of most Americans.\n\nHealthcare providers and patients are frustrated and frightened by  the imminent…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696744/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Zoe Lofgren", "party": "Democrat", "sentence": "…communities that he  represented in California's First District. As has been said, he is a  fourth-generation rice farmer. He was one of the strongest voices in  this body for rural America because he knew firsthand the struggles  that our agricultural sectors were facing.\n\nHe and I worked very closely together on the bipartisan Farm  Workforce Modernization…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698723/9999"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…Trump  doesn't seem to like it--how much it helps our rural communities? It is  the only place they can rely on for local news, for weather reports.  And farmers across rural America depend on public broadcast to get  weather reports because there is no other way. Did they know that it  guts international aid that ensures America's national security?…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693459/rescissions"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…are setting  in motion the largest Medicaid cut in American history. That is going  to hurt people all across this country. In small-town America, in urban  America, in rural America, in the heartland of America, in Appalachia,  all across this country, people will be hurt.\n\nHealthcare will be taken away from children, pregnant women, everyday  Americans…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689902/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…grow rather than have a tariff that prohibits them from selling to  markets they have had?\n\nThen the second thing I noticed--and I really am interested in this  because rural America is the heart of America, you know, with the  wonderful community values folks have--family values--  hard work, service. We have got a billionaire who is the Secretary…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696342/trump-administration"}, {"senator": "Marc Veasey", "party": "Democrat", "sentence": "…bill would also disenfranchise  millions of Americans who don't even have a passport. Millions of  Americans do not have a passport.\n\nIt also hurts people who were born in rural America, people who were  born during a time when births were recorded in family Bibles.\n\nThis would just really be devastating. It would also hurt women whose  legal names do…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689430/disenfranchising-voters"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…forced to cut  services, including behavioral health and maternity care. They will  have to lay off doctors and nurses, which is exactly the opposite of  what we need in rural America.\n\nMy Republican colleagues know exactly how devastating these Medicaid  cuts will be. That is why they attempted to remedy the situation by  including a $50 billion rural…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698601/healthcare"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…involved violent  crime. Yet, today, Federal gang data remains fragmented, inconsistent,  and incomplete.\n\nThat gap puts officers at risk and leaves communities, especially in  rural America, without the tools needed to respond effectively. Our  bill would require the Attorney General to submit an annual report to  Congress on gang activity investigations and…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698650/reporting-gang-activity"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…a deadline to get it done.\n\nSmall businesses are the heart of our economy. That is especially  true in our rural communities. However, we know that small businesses  in rural America often face unique challenges that are often  overlooked, especially when it comes to disaster relief programs.\n\nIt is simple. We need to make sure that small rural businesses…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687928/rural-small-business-resilience-act"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…research areas like biomass energy  development, sustainable aviation fuels, and various methods for  improving clean energy development and deploying that development in  rural America.\n\nH.R. 1326 is going to codify and strengthen these cross-cutting and  collaborative research and development activities between these two  departments, the Department…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688982/doe-and-usda-interagency-research-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…it is good  news programs--things deeply appreciated throughout the State but often  harder to access in rural Oregon. So I am concerned about this  concerted attack on rural America.\n\nFirst, my colleagues across the aisle say: We are going to make it  very, very hard for people in rural America to get healthcare if they  are on Medicaid. And then,…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693589/rescissions-act-of-2025"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…got to fight to make sure we extend Affordable Care Act  tax credits so that tens of millions of people--working-class folks,  middle-class folks, people in rural America, working-class America,  small-town America, the heartland of America, Black and Brown  communities all throughout America--don't experience premium increases  that in some cases will…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696738/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…be  allowed to go extinct or be protected under the Endangered Species Act.  All the while, the significant damage that their policies are causing  continue to pile up in rural America, including President Trump's  tariffs.\n\nTrump is treating not just our adversaries, but some of our neighbors  and our best friends in the world, like they are enemies.…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690601/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…history, ripping healthcare away from 14 million Americans.\n\nHospitals, nursing homes, and community-based health centers are  closing all across the country, including in rural America because of  the Republican healthcare crisis.\n\nRepublicans, Mr. Speaker, continue to attack the National Institutes  of Health, the Centers for Disease Control, the FDA,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698365/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…With up to $2.5 trillion in Medicaid cuts and $230 billion slashed  from SNAP, this budget plan would leave millions of families and  seniors without essential support. Rural America would suffer the most.\n\nNationwide, more than 12 million rural Americans rely on Medicaid,  and SNAP participation is higher in rural areas than urban ones. In my  home…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688093/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions-and-providing-for-consideration-of-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…mind of its own, so I will leave it  down so it doesn't scare us all again.\n\nMr. Speaker, I thank my colleagues in the Western Caucus for leading  the charge to strengthen rural America's future.\n\nAs a fourth-generation North Dakotan, I have seen how the hard work  of our energy and agriculture producers fuels our economy, strengthens  our communities,…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689195/work-highlights-of-western-caucus"}, {"senator": "Steve Womack", "party": "Republican", "sentence": "…urban communities, letting this waiver expire  means longer wait times, fewer appointment slots, and even more strain  on an already overburdened VA system.\n\nFor veterans in rural America, the consequences are even more  serious. Many of these men and women live hours away from the nearest  VA provider. For them, the exemption has meant timely care without…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695454/protecting-veteran-access-to-telemedicine-services-act-of-2025"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…industry from flourishing. It will add  $25.3 billion to the U.S. GDP and support more than 128,000 full-time  jobs. President Trump and Secretary Rollins support this effort. Rural  America is counting on us to deliver.\n\nMr. Speaker, please join me, and let's get this done.", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699351/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…saved  American taxpayers more than $295 billion and made long overdue  investments to support the farmers, ranchers, and agricultural  producers of the Big First and all of rural America. I am very proud of  all that we were able to accomplish.\n\nHowever, Mr. Speaker, I have been gravely disappointed in how some of  my Democrat colleagues have continued…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691361/dignity-of-the-american-dream"}, {"senator": "John Rose", "party": "Republican", "sentence": "…for arranging this Special Order.\n\nIt is with a heavy heart that I rise today to honor my friend and  colleague, Representative Doug LaMalfa. He was a true champion for  rural America and a staunch supporter of our Nation's farmers.\n\nI often describe Doug as a gentle giant. You will hear others say  that. He was tall and broad enough for me to assume…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698713/9999"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…are fulfilling the mandate  given by the American people to restore economic prosperity, support  small businesses, secure our border, unleash American energy, invest in  rural America, and the list goes on.\n\nThis legislation cuts taxes on hardworking Americans, lowers energy  costs, brings jobs home, cuts wasteful spending, and puts Main Street  first.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694793/promises-made-promises-kept"}, {"senator": "French Hill", "party": "Republican", "sentence": "…reduced the administrative cost of providing such       assistance;\n\n(B) describes how the implementation of this section       affects the affordable housing sector in rural America; and\n\n(C) includes any legislative recommendations from the       Secretary of Agriculture.\n\n(2) Definitions.--In this section:\n\n(A) Greenfield.--The term ``greenfield''…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "…we all have little silos  where people come to us for advice. I always could count on Doug to  give me the straight scoop on anything related to water, agriculture,  or rural America. That is why we elected him as the chairman of the  Western Caucus 2 years ago, and he did a phenomenal job in that role. I  will miss his service there.\n\nI will also miss…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698729/9999"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…administration.\n\nI commend our current Secretary of the Interior, Doug Burgum, who is  spearheading the administration's efforts to restore energy dominance  and listen to rural America. Secretary Burgum was the Governor when  this RMP was finalized, and he led the charge in opposing this Biden- era preservationist plan.\n\nI have full confidence that under…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694908/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "John Thune", "party": "Republican", "sentence": "…for their tireless work to get this program up and  running on an expedited timeline. I look forward to seeing all the ways  this program will help transform healthcare in rural America.", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698574/rural-health-transformation-program"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…isn't  meeting this 10 percent requirement, so I have made my concerns known  to the Agency, and I want that Agency to know that I will be watching  closely to ensure that rural America gets a fair shot--nothing more  than the law requires. When medical students have a chance to train in  rural America, we know that they are more likely to stay in rural…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690631/medical-student-match-day-achievement"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…students have access to quality education that can  compete with urban communities.\n\nHowever, this is not just an education issue. This is about investing  in the future of rural America and supporting communities surrounded by  Federal forests.\n\nIt is something I hear about regularly from the men and women of the  Fourth District of Arkansas who share…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697657/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "Mr. GRASSLEY. Mr. President, there is real concern in rural America,  particularly among family farmers. Farmers know that margins matter.  Farmers don't want to see their revenue continue being eaten up by  input suppliers.\n\nSo we need…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697521/farmers"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…great State of  Wisconsin, and Representative Golden from the great State of Maine.\n\nMr. Speaker, 46 million Americans live in rural communities. The  small businesses of rural America face distinct and persistent  challenges, such as a shortage of business assistance resources and  limited access to capital. These challenges often hinder their growth…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697283/office-of-rural-affairs-enhancement-act"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…responsible governance looks like.\n\nThere are three appropriations bills included in the CR, put here to  jump-start our appropriations process.\n\nH.R. 5371 delivers for rural America. It provides funding for the  Farm Service Agency to support our Nation's farmers and ranchers. It  invests in rural development programs, including funding affordable…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696682/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}]