[{"senator": "Mark Warner", "party": "Democrat", "sentence": "…going to be  enormous, which, frankly, were not scheduled to kick in until after the  2026 elections, interestingly enough--although I can tell you we have  already seen rural healthcare clinics close in Virginia because of that  expectation--and my colleagues' refusal to extend the enhanced premium  tax credits are all weighing down on our healthcare…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698976/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…have       a potential to destabilize State Medicaid programs and       community health centers, impact local economies and job       creation, and further exacerbate rural healthcare access       challenges.\n\nFamilies USA. Their executive director--his name is Anthony Wright:\n\nAmericans are storming townhalls, calling their       Representatives in…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…is: a budget that raises  costs for working families, adds red tape for patients and providers,  and gives handouts to billionaires, all while risking the collapse of  rural healthcare systems.\n\nIf you believe in the dignity of rural communities and if you believe  that no one should die because their local hospital couldn't keep its  doors open, then…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692901/keep-rural-hospitals-open-as-lifeline"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…who should be able to go see a doctor who are not because  they refuse to expand Medicaid.\n\nWe also have to invest in our healthcare infrastructure, particularly  in our rural healthcare infrastructure, bringing back those hospitals  and clinics and bringing in telehealth hubs, leveraging every resource  we have to improve healthcare outcomes. We have…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690245/health-disparities-in-minority-communities"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…millions of dollars in water supply infrastructure  projects suddenly in limbo because of DOGE, while our colleagues across  the aisle say nothing.\n\nWe see the entire rural healthcare safety net, including nursing home  care, including services that anyone who has a person with disabilities  in their family, depend on. All of that is in limbo as we…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690601/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…Representative of a district full of  forests, mountains, and rugged coastlines that are beautiful but often  mean a long drive to the hospital, I know that preserving rural  healthcare access is literally life and death in our communities.\n\nTribal health clinics, federally qualified health centers, rural  hospitals, and independent providers are facing…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696873/preserving-rural-healthcare-access-is-literally-life-and-death"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…healthcare  but jobs, restaurants, banks, and hope. When Southwest Georgia Regional  Hospital closed, the nearest ER became 40 miles away, a life or death  distance.\n\nRural healthcare is not just about hospitals and doctors. Clean  drinking water, wastewater upgrades, and broadband are necessary for  health and survival. Rural areas simply don't have…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696850/national-rural-healthcare-week"}, {"senator": "John Mannion", "party": "Democrat", "sentence": "…They are feeling  the largest healthcare cuts in the history of the country that were  passed in the big, ugly bill, and they know firsthand that the deeply  inadequate rural healthcare fund comes nowhere near making up for the  lost revenue that happened in that bill.\n\nYou cannot cut nearly $1 trillion from Medicaid and decimate the  foundation of our…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699587/stop-the-republican-affordability-crisis"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…Aaron Lehman, a fifth-generation farmer, told us: I grow corn,  soybean, oats, and hay with my family. The Affordable Care Act has been  one of the best investments in rural healthcare in decades.\n\nWe cannot afford, as a nation, to go back to the days when  preexisting conditions were a pretext for denying healthcare. If  someone had a history of cancer,…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696612/9999"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…hoping nothing goes wrong because they are  one ER visit away from being homeless. This is the reality for rural  America today.\n\nThe big, ugly bill took a sledgehammer to rural healthcare, and  letting the ACA enhanced premium tax credits expire will accelerate the  damage and hasten the harm.\n\nIn rural America, places like Hawaii, insurance coverage is…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698588/providing-for-consideration-of-hr-breaking-the-gridlock-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…They  know the impact of Medicaid cuts on hospitals in all areas and people  in every part of their States.\n\nBut those efforts are doomed to failure. They fall short. The rural  healthcare fund doesn't come close to offsetting the losses rural  providers will face from the cuts of Medicaid, just to give you one  example. That is why I have joined Senator…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694385/9999"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…$1.5 trillion mad  spending spree that included things like $200 billion of taxpayer  funding for illegals to get taxpayer benefits, while they gutted the  $50 billion rural healthcare fund that we put in place in the working  families tax cut.\n\nMr. Speaker, anybody who comes up here and says they care about  healthcare is also advocating to gut the…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696745/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…telehealth services, homelessness programs, caregiver  programs, opioid misuse prevention and treatment, medical research,  healthcare tailored to our female veterans, rural healthcare  initiatives, and construction for new VA hospitals and veteran  cemeteries.\n\nWe are also funding veteran disability programs, education benefits,  and employment training.…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696682/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…law change, there were rules preventing consumers from  contributing to and using health savings accounts for direct primary  care. Direct primary care will also improve rural healthcare by  expanding access to physicians and other healthcare providers and also  expanding access to telehealth to reach patients in a more timely  fashion.\n\nWe also allow…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693915/health-savings-accounts"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "Mr. BAUMGARTNER. Mr. Speaker, I rise today to celebrate $181 million  in rural healthcare funding for the State of Washington.\n\nNot long ago, right here in this Chamber, I joined my House  Republican colleagues to pass the Working Families Tax Cut Act, the…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698645/tax-relief-for-working-families"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…taxpayer-funded classes on ``environmental racism.''\n\nAdditionally, Republicans created a $50 billion rural hospital fund.  It is the single largest Federal investment in rural healthcare in  American history.\n\nDo you want to help patients with rare diseases find treatments? We  were able to do that. We passed a bill that I introduced called the  ORPHAN…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698252/nominations"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…to lead  with distinction.\n\nIn 2019, he was also honored with the Pennsylvania Office of Rural  Health Community Star Award, recognizing his contributions to improving  rural healthcare.\n\nChief Ferguson holds a bachelor's of science in microbiology from  Penn State University and multiple degrees in emergency medicine,  underscoring his deep commitment…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691586/recognizing-national-ems-week"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…rural emergency hospital remains a viable tool for rural hospitals  and their communities.\n\nI recently sent letters to existing rural emergency hospital CEOs and  other rural healthcare leaders to get this information. I look forward  to their feedback and continuing to strengthen rural healthcare, and I  will keep my constituents in Iowa and my Senate…", "date": "2025-10-16", "source_url": "https://justfacts.votesmart.org/public-statement/1696257/rural-emergency-hospital-program"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…well-earned retirement as president of the  Billings Clinic Foundation.\n\nFor three decades, Jim served the great folks of the Treasure State,  advocating tirelessly for rural healthcare access and the expansion of  community wellness programs. Jim grew the foundation's endowments from  $3 million to an astounding $150 million, funds that will benefit…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693079/congratulating-jim-duncan"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…were grateful for our stewardship of their  hard-earned tax dollars as we cut $1.5 trillion in woke and wasteful  spending.\n\nIn Lynn County, we talked about strengthening rural healthcare  through the $50 billion rural healthcare fund; cracking down on waste,  fraud, and abuse that has plagued Medicaid; and restoring the dignity  of work through long overdue…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694789/promises-made-promises-kept"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…restoring the safety net that Lee County deserves. The CEO of Insight  said that it was pivotal in establishing these services. This is about  saving lives, strengthening rural healthcare, and giving families peace  of mind.\n\nI am proud to have secured this investment and will continue working  to ensure that rural Iowans receive the same quality care as…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696794/highlighting-critical-investments"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "…matters. Through the new  Rural Health Transformation Program, Indiana is receiving $207 million  in first-year funding, the first of 5 years of support, to strengthen  rural healthcare statewide.\n\nThis funding will support hospitals and strengthen emergency care for  Hoosiers who can get that care close to home. For communities from  Connersville to…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698777/rural-health-transformation-program"}, {"senator": "John Thune", "party": "Republican", "sentence": "…working families tax cut legislation, however, help  is on the way. Republicans' legislation created a $50 billion Rural  Health Transformation Program to address the rural healthcare crisis.  Instead of a top-down, Washington-dictated approach, we are giving  States the resources and the freedom to find solutions for the  particular challenges in their…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698574/rural-health-transformation-program"}]