[{"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…together.\n\nThis bill also reauthorizes the Teaching Health Center GME program,  the National Health Services Corps, extends telehealth, and increases  funding for critical rural health programs. Taken together, these  investments will grow the workforce, expand access to care, and improve  health outcomes.\n\nProviders and patients need certainty now. Rural…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699329/consolidated-appropriations-act-2026"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…to our veterans and makes crucial investments to support  our servicemembers and our national security.\n\nThe bill includes essential funds for VA care, including rural  health, women's health, medical research, and the caregivers program I  have long championed, and for the first time, it puts funding levels  for those important programs in statute.…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694203/military-construction-veterans-affairs-and-related-agencies"}, {"senator": "Andrea Salinas", "party": "Democrat", "sentence": "…cuts,  Oregonians will lose out on lifesaving mental and behavioral health  care, and the mental health crisis will only get worse.\n\nAs a founding member of the Bipartisan Rural Health Caucus, I know  that our rural neighbors often travel long distances to access care.\n\nI have a bill, the Home-Based Telemental Health Care Act, that would  expand access…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695302/mental-health-of-farmers"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…have the tax base to  modernize these systems alone, so Congress must invest funding in rural  development, energy, and healthcare to ensure they can thrive.\n\nMr. Speaker, rural health is not partisan. We must work together to  make access to care a reality for rural Americans everywhere.", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696850/national-rural-healthcare-week"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…colleague Senator Cassidy from  Louisiana to support graduate medical education programs.\n\nBut here is the deal: If Medicaid funding in Nevada is cut, not only  will those rural health clinics close that I talked about, but here is  the thing people forget: We would have fewer providers because they  would not be incentivized to come to my State and treat…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689544/h-con-res-14"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…disaster, I found a  friend in Doug. Doug and I didn't agree on a lot of things, but we  always showed up for each other. We cosponsored bills, worked on  disaster funding and rural health, and traded a lot of jabs and took  funny pictures of each other in our Agriculture Committee hearings. I  gave him Spam musubis, and he brought me my favorite lemon almonds…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698745/9999"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…and Republican--and they write:\n\nWithout consultation and proper planning, Congressionally       proposed reductions to Medicaid would impact state budgets,       rural hospitals and health care service providers. It is       necessary for Governors to have a seat at the table when       discussing any reforms and cuts to Medicaid funding. States…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…States that had the most uninsured people per  capita and became one of the most insured. Because of that expansion,  people were able to get care and help.\n\nAs for those rural health clinics that also provide care to so many  of our Medicaid beneficiaries in New Mexico, all of a sudden, when  Federal Medicaid dollars go away, they might close.\n\nSo I…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696347/trump-administration"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…Early Detection Act.\n\nMr. Speaker, let's get this bill across the finish line and pave the  way for the world without pancreatic cancer.                          National Rural Health Day\n\nMs. SEWELL. Mr. Speaker, I rise to recognize today as National Rural  Health Day.\n\nAs the daughter of Alabama's rural Black Belt, I know firsthand the  challenges that…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697076/observing-world-pancreatic-cancer-day"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "Ms. NORTON. Mr. Speaker, today, I introduce the Equal Treatment of  the District of Columbia Under the Rural Health Transformation Program  Act of 2025, which would make the District of Columbia eligible for  funding under the Rural Health Transformation Program (Program). The  $50 billion…", "date": "2025-08-19", "source_url": "https://justfacts.votesmart.org/public-statement/1694752/introduction-of-the-equal-treatment-of-the-district-of-columbia-under-the-rural-health-transformation-program-act-of-2025"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "Ms. McCLELLAN. Mr. Speaker, I rise today to commemorate National  Rural Health Day and National Rural Health Month.\n\nDue to a lack of infrastructure and support, rural communities suffer  from the worst health outcomes nationwide. Pharmacy deserts,…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697097/national-rural-health-month"}, {"senator": "Jon Ossoff", "party": "Democrat", "sentence": "…to long wait times for  care in Georgia and across the country.\n\nAsserting our constitutional power of the purse, this bill mandates  specific funding levels for rural health, women's health, caregivers,  research, and veteran homelessness prevention programs, in some cases,  including required spending levels for those programs for the first  time in…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694129/9999"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…America.\n\nMy Republican colleagues know exactly how devastating these Medicaid  cuts will be. That is why they attempted to remedy the situation by  including a $50 billion rural health transformation grant in their Big  Beautiful Bill. Let's do some math here. They are cutting $1 trillion  out of Medicaid, and they are trying to fill that gap with $50…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698601/healthcare"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…the Trump administration. Add to that the Medicaid cuts in the big,  ugly bill and the end of the ACA tax credits, the strain and  uncertainty is challenging.\n\nOn National Rural Health Day, we should be working together to expand  care, not making it more difficult for rural communities.", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696873/preserving-rural-healthcare-access-is-literally-life-and-death"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…$181 million of this rural healthcare fund will go to  transforming Washington State. This is just the first round of funding,  part of a 5-year, $50 billion commitment to rural health  transformation.\n\nThis is $181 million to keep our rural hospitals' doors open, upgrade  critical infrastructure, expand access to emergency care, protect  maternal health,…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698645/tax-relief-for-working-families"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…benefits, and we are making good on our promises to them. That includes  fully funding our commitment to the PACT Act.\n\nThe bill continues robust investments in women's health, rural  health, veterans' homelessness issues, and mental health. The  legislation maintains all the funding for medical and prosthetic  research. It increases funding for VA infrastructure…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692959/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…Pennsylvania. Mr. Speaker, I rise today to  congratulate the Cameron Elk Suicide Prevention Task Force for  receiving the Program of the Year award from the Pennsylvania Office of  Rural Health.\n\nThe award recognizes an outstanding health program in a rural  community that uses unique, creative, and innovative approaches to  increase access to healthcare services…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697845/congratulating-cameron-elk-suicide-prevention-task-force"}, {"senator": "John Thune", "party": "Republican", "sentence": "…With the One Big Beautiful Bill,  Republicans have taken action to support rural hospitals. All 50 States  have now applied for funding from the One Big Beautiful Bill's Rural  Health Transformation Program, including South Dakota.\n\nSouth Dakota intends to address key priorities with this funding. The  State is looking to recruit healthcare professionals…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698212/senate-accomplishments"}, {"senator": "John Boozman", "party": "Republican", "sentence": "…year 2026.\n\nOur bill funds priority accounts to prevent veteran suicide as well  as increase rural access to healthcare through significant investments  for the Office of Rural Health.\n\nAdditionally, we allocated approximately $23 billion to support  critical mental health issues and programs to prevent veterans'  homelessness and provide funding for…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694207/military-construction-veterans-affairs-and-related-agencies"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "Mr. THOMPSON of Pennsylvania. Mr. Speaker, Thursday marks National  Rural Health Day.\n\nNearly 60 million Americans live in rural areas, and they too often  encounter limited access to primary care specialists and health  services. These gaps are worsened…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696840/national-rural-health-day"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…He was recently  appointed EMS Chief at Moshannon Valley EMS, where he continues to lead  with distinction.\n\nIn 2019, he was also honored with the Pennsylvania Office of Rural  Health Community Star Award, recognizing his contributions to improving  rural healthcare.\n\nChief Ferguson holds a bachelor's of science in microbiology from  Penn State University…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691586/recognizing-national-ems-week"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "Mr. GRIFFITH. Mr. Speaker, I rise today to commemorate a landmark  moment in both American aviation history and rural health care  innovation: the 10th anniversary of the first Federal Aviation  Administration (FAA)-approved drone delivery, which took place in Wise  County, Virginia, on July 17,…", "date": "2026-01-16", "source_url": "https://justfacts.votesmart.org/public-statement/1699162/recognizing-the-10th-anniversary-of-the-first-faa-approved-drone-delivery-in-the-united-states-commending-lets-fly-wisely"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "…can get,  but for too many Hoosiers, especially in our rural communities, this  isn't the reality.\n\nThat is why the Working Families Tax Cut Act matters. Through the new  Rural Health Transformation Program, Indiana is receiving $207 million  in first-year funding, the first of 5 years of support, to strengthen  rural healthcare statewide.\n\nThis funding…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698777/rural-health-transformation-program"}, {"senator": "John Thune", "party": "Republican", "sentence": "…few  and far between in rural areas.\n\nBut thanks to the working families tax cut legislation, however, help  is on the way. Republicans' legislation created a $50 billion Rural  Health Transformation Program to address the rural healthcare crisis.  Instead of a top-down, Washington-dictated approach, we are giving  States the resources and the freedom…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698574/rural-health-transformation-program"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…including no tax on tips  and overtime and Social Security, a provision I have worked to achieve  for years; historic funding to finish the border wall; $50 billion to  support rural health; permitting reforms to make it easier to build in  America again; a generational investment in our military; and I could  go on and on.\n\nAnd in the last year, this administration,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698427/unanimous-consent-requests-the-calendar"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…emergency situations, expectant mothers lose access to obstetric care,  and seniors suffering from a heart attack or a stroke may arrive too  late.\n\nAs we mark National Rural Health Day this week, we must renew and  strengthen our commitment to rural hospitals by ensuring fair  reimbursement, strengthening telehealth and infrastructure, and  preserving…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696877/national-rural-health-day"}, {"senator": "John Carter", "party": "Republican", "sentence": "…funding for VA medical care.\n\nIt includes critical funding for mental health services, telehealth  services, veteran homelessness programs, medical research programs, and  rural health initiatives.\n\nIt invests in information technology, including robust investment in  VA's electronic health record modernization.\n\nIt fully funds all mandatory veteran benefits,…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696733/continuing-appropriations-and-extensions-act-2026"}]