[{"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…reserve  the balance of my time.\n\nMr. Speaker, in closing, this bill aims to address the ongoing  humanitarian crisis in Burma by cutting off revenue sources for the  country's ruthless and illegitimate leadership. Congress must do  whatever is possible to protect human rights, stand for democratic  values, and object to the atrocities committed against the…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699833/bringing-real-accountability-via-enforcement-in-burma-act"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…20,000 children from Ukraine who have been  forcibly deported by Russia and remain missing.\n\nI remind our President and our Vice President that it was Putin who  started this ruthless and illegal war more than 3 years ago and, we  must not forget, 11 years ago in Crimea.\n\nTo endorse a so-called peace deal that fulfills Russia's every wish  and forces our…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690214/supporting-ukraines-independence"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…of power, and we can't let him have that kind of  power.\n\nMr. Speaker, it is important for us to move to impeachment because  impeachment is the means by which a reckless, ruthless President can be  brought into check. This is the balance that we have. When all else  fails, when the Congress majority refuses to act, and when he  disregards the orders…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690093/protecting-the-american-dream"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…is what  we are voting on today.\n\nThe Republicans are stealing the hard-earned tax dollars of  Oregonians and Americans to line the pockets of people like Elon Musk.\n\nThis ruthless Republican budget will rip away healthcare from low- income and working families and children and take us back to the days  when if you got sick, you either went without treatment…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688036/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…and taken off to some distant place without  any indication as to where they are, such that family members can  understand that they are at least okay.\n\nHe is a reckless, ruthless President, and what he is doing at the top  has influenced things all the way down the line to the very bottom.\n\nWe now have officers who have taken the lives of two people,…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700176/state-of-our-union-is-fragile"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…Venezuela, spending taxpayer  money and putting American troops in harm's way to replace Maduro with  his own Vice President, someone who is an illegitimate ruler who is  just as ruthless and evil as Maduro?\n\nI don't know why we did that. What was the point? Not a single one of  my colleagues can answer that question because they have no answer.  They know…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699359/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…concluded that he had to  have five more seats for the Republican side in Congress, five more  seats to hold on to power, five more seats to continue to be the  reckless, ruthless, lawless President that he is, five more seats.  Because if he loses the House, he loses his ability to do many of the  things that the House can constrain him and prevent…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700075/black-history-stolen-legacies"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…will be here for that vote. I will also  speak on Friday for about 1 hour after about 11 o'clock. I will explain  more about it at that time.\n\nThis President is a reckless, ruthless, lawless person who doesn't  deserve the title of President of the United States of America.", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697933/i-shall-march-on"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…their right to free speech--is an assault  on our civil liberties and our Constitution.\n\nAn attack on these individuals is an attack on all of us. Who is to  say what this ruthless administration will do next or who they will do  it to? Will it be your family member, your friend, or a coworker who is  taken without cause?\n\nI am reminded of a quote from…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690503/trump-immigration-policies"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…courageous vote: a vote  that is going to be marked as a seminal moment in time, a vote that  will have an impact on the rest of time because it sent a message to a  reckless, ruthless, lawless President indicating that your time in  office as a reckless, ruthless, lawless President, your days are  numbered.\n\nNo one wants to see you harmed physically, that…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698076/liberty-and-justice-for-all"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…benefits; abandoning environmental  protections for clean air and clean water; destabilizing families,  hospitals, and nursing homes with pending Medicaid cuts; and siding  with a ruthless aggressor, Russia, rather than the victim, Ukraine.\n\nMr. Speaker, 100 days: exonerated violent criminal behavior from the  January 6 insurrection; unethical efforts to end…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690483/trumps-100-days"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "Mr. DOGGETT. Mr. Speaker, oil over democracy. Trump has made clear  his priorities, accepting ruthless suppression by Maduro's comrades so  long as the oil profits flow to him as the self-described acting  President of Venezuela.\n\nWith one major oil company describing the country…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699361/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…removed simply because the truth didn't fit  a politically convenient story.\n\nAnd again, to be clear, there is no question that Maduro's regime in  Venezuela and the TDA are ruthless actors who pose real threats, but  punishing officials--punishing intelligence officials in particular-- for telling the truth only weakens our ability to confront them.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695695/authorizing-the-en-bloc-consideration-in-executive-session-of-certain-nominations-on-the-executive-calendar"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…ultimate measure is not where the person stands in times of  comfort and convenience, but, rather, where do you stand in times of  challenge--challenge, when you have a reckless, ruthless, lawless  President who is breaching the Constitution, who is doing things that  we never expected to see in our lifetimes. Where do you stand when you  have a President who…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699134/where-do-you-stand"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…and through his family, billions of dollars.\n\nWe fight among ourselves such that we cannot coordinate and unify and  acquire the unity necessary to deal with this reckless, ruthless  President. We have to find a way to put a stop on his behavior. His  behavior is totally unacceptable.\n\nI am here to tell you that what I did last night, I would do again.…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700250/peaceful-silent-protest"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…criminals in prison. Mr. Speaker, this is insane. They know it. The  American people know it.\n\nIf we want to live in a law-abiding society, we have to get these  violent and ruthless offenders off of our streets. That is what  Republicans are doing, and that is what Democrats on the other side of  the aisle are fighting right now.\n\nMr. Speaker, this legislation…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695592/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Hal Rogers", "party": "Republican", "sentence": "…safe place to shelter and recover. In the days  following the storm, law enforcement officers from every department  provided extra security for tornado survivors, holding ruthless looters  accountable, setting up posts at disaster recovery centers and securing  temporary housing locations with extra patrols.\n\nThe local first responders have gone above…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692791/recognizing-first-responders-in-laurel-county-kentucky"}, {"senator": "Addison McDowell", "party": "Republican", "sentence": "Mr. McDOWELL. Mr. Speaker, today is Fentanyl Awareness Day, a day  meant to spread awareness of a ruthless poison that has stolen the  lives of too many of our sons, daughters, sisters, and brothers.\n\nMy family and I know this pain personally. My brother Luke was taken  from us…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690382/fentanyl-awareness-day"}, {"senator": "Rick Crawford", "party": "Republican", "sentence": "…women took on that day to do  what no other political administration in the world had ever  contemplated as remotely possible: to remove and exfiltrate for  prosecution a ruthless dictator whose direct involvement in  narcoterrorism has led to the death of scores of Americans and other  allies' citizens.\n\nPlease don't take my word for the nature of…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698882/successful-operation-to-arrest-nicolas-maduro"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…about MS-13 or Tren de Aragua and every other cartel. That  is giving aid and comfort to narcoterrorists. That is ignoring an  imminent threat.\n\nThe cartels are relentless and ruthless. They have military  capabilities and use them every day against the American homeland. When  a threat poses immediate danger to Americans, the Constitution gives  the President…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698249/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…into one global economic zone.\n\nThirty years on, what do we have to show for it? At home, our  factories and the towns that once sustained them lie in ruin, razed by  the ruthless logic of the new global economy and cost-efficiency. The  Americans who once worked there were replaced by foreign labor  overseas. The Americans who once held on were now…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690533/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…are universal  aspirations, and they deserve the support of the international  community. And the people of Iran deserve liberty.\n\nThe regime's response has been swift and ruthless. In an attempt to  silence dissent and conceal its abuses, Iranian authorities have shut  down the internet and the phone service. They have cut citizens off  from one another…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699103/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…with blood oozing from his  ears, nose, and mouth, firing his machine gun cradled in his bandaged  left arm with his right hand, he continued to lead his men against  another ruthless German assault throughout the entire afternoon.''\n\nWhat an amazing, amazing hero. He was wounded at Hurtgen and again  several weeks later at the Battle of the Bulge. In addition…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693923/leonard-g-bud-lomell-va-clinic"}]