[{"senator": "Henry Cuellar", "party": "Democrat", "sentence": "…proud  legacy and to honor those who have selflessly given back to our country  and community.\n\nI commend American Legion Post 667 for fifty years of leadership,  service, and sacrifice, and I wish them continued success in the  decades ahead.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695761/recognizing-the-50th-anniversary-of-american-legion-post-667"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…Liberty Aviation Museum in Port Clinton, Ohio, where this photo was  taken, have preserved their stories, ensuring that future generations  will remember their courage and their sacrifice.\n\nThese men were not just warriors in the sky. They were pioneers who  shattered social and racial barriers, proving their excellence time and  again, despite the discrimination…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687895/black-history-month"}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "…their side. There is real struggle.  I heard that on this townhall.\n\nWe had people like Leticia from Camden, who said that with prices so  high ``every choice feels like a sacrifice, and the stress is  constant.'' It is affecting how they are able to hold up and how they  feel when they wake up every morning, what keeps them up at night.  Still, she…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695926/government-funding"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…Petroleum Reserve- Alaska, more commonly referred to as ``NPR-A.''\n\nNow the name National Petroleum Reserve is more than a little  misleading. This is not some industrial sacrifice zone. It is not some  untapped oil field just waiting to be developed. On the contrary, the  NPR-A is the largest contiguous unit of public lands in the United  States. It…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696836/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…Republican  colleagues want to throw that progress away. At the President's  urgings, they appear to believe that it is OK to turn their backs on  the work, the advocacy, and the sacrifice of women like Susan B.  Anthony who worked so zealously for the right of women to vote, and men  like Martin Luther King, Jr., and thousands of Americans who dedicated  themselves…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690531/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…leader of the free world. We didn't seek it, but we did our  job.\n\nAmerica is the global beacon of liberty and justice for all. Our  reputation has been earned by tremendous sacrifice and vision. Our  commitment to liberty has been built on the sacred graves of over  500,000 Americans who sacrificed their lives for the first time in  history and fought…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691084/liberty-versus-dictatorship"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…revered military  decorations. It is awarded to those who have been wounded or killed in  action while serving in the U.S. Armed Forces. It represents not just  injury, but sacrifice--the physical cost of defending our freedoms.\n\nCorporal Donald served honorably for over six years, including  deployments to both Afghanistan and Iraq. His time in uniform…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691113/recognizing-the-incredible-service-of-united-states-marine-corporal-joseph-donald"}, {"senator": "Cleo Fields", "party": "Democrat", "sentence": "…competitive. They gained access to broader markets  and built the strongest economy in the world.\n\nWhen our universities created more inclusive learning environments,  they didn't sacrifice excellence. Instead, they became global leaders  in research and education.\n\nThe world is always watching us to see what we will accomplish, but  now more than ever before,…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690322/ending-of-dei-programs-through-executive-order"}, {"senator": "Chuy Garcia", "party": "Democrat", "sentence": "…dedication reflects the resilience we  honor this month.\n\nMr. Speaker, Joann's unwavering service has left a lasting impact and  touched countless families. I thank her for her sacrifice to our  country and her service to community.", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688288/recognizing-joann-williams"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…poster, but it is the smallest token of  recognition and honor that we should be able to extend to the Capitol  officers, many of whom are still with us on the force, for their  sacrifice and the sacrifice that their families made based on their  work that day defending us.\n\nI wonder if the chairman of the Judiciary Committee would follow  through on his very…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691030/expressing-support-for-local-law-enforcement-officers"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…II were put to rest on foreign soil without the full  picture of who they were as people. In life, these servicemen and - women showed courage, honor, respect, dignity, and sacrifice. In death,  some have been unfortunately misrepresented.\n\nNot because of malice, but more often circumstances of time, space,  and uncertainty, roughly 900 American-Jewish…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695467/fallen-servicemembers-religious-heritage-restoration-act"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…he sustained that  day. Many more are still dealing with trauma. In Brian's honor, I  introduced a resolution condemning those blanket pardons.\n\nWe must never forget their sacrifice. We cannot let Donald Trump and  his allies rewrite the history of one of the darkest moments in the  250-year history of this Nation.\n\nMr. CLYBURN. Mr. Speaker, I thank…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698554/january-6-attack"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…international student in a sense of belonging, friendship, and a second  family. That is the spirit of Toledo. That is the promise of America.\n\nMr. Speaker, I thank Francisca for her sacrifice to Miriam and for  inspiring us. To the Rocket family, keep lifting one another higher.", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699647/family-sacrifice-and-the-rocket-spirit"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…but for the  richness of his legacy. He is a war hero, a public servant, a family  man, and a treasured friend to so many. It is an honor to celebrate his  century of life, sacrifice, and service.\n\nHappy 100th birthday to Paul. I thank him for everything he has  given--to his Nation, to his community, and to all of us.", "date": "2025-06-20", "source_url": "https://justfacts.votesmart.org/public-statement/1692689/recognizing-the-100th-birthday-of-paul-david-lopez"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…Indiana and Kentucky.\n\nWhy would they do that? Because the obligation here is not to their  State or constituency. The obligation here is to the oil industry. They  would sacrifice the jobs and the clean energy industry all over the  country. To their own constituents, they would put those people out of  work. And why? Because of fealty to the oil industry.…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691621/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "Richard Hudson, Jr.", "party": "Republican", "sentence": "…Incorporated since 1989, and team  member since 1975, Mr. Oldham has had a lasting impact on the company  and the wider construction industry through his many years of  leadership, sacrifice, and commitment to safety.\n\nMr. Oldham has contributed immensely to support North Carolinians  through his volunteer work and career. Mr. Oldham was awarded the Man  of the…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694151/congratulating-donnie-oldham-on-being-inducted-into-the-carolinas-agc-hall-of-fame"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…of  Pennsylvania.\n\nOne of those remarkable Pennsylvanians was Army Specialist Ross  McGinnis, a young man from Clarion County who, at just 19 years old,  made the ultimate sacrifice to save the lives of his fellow soldiers.\n\nOn December 4, 2006, while on patrol in eastern Baghdad, Specialist  McGinnis and his unit came under attack. An enemy insurgent…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689171/national-medal-of-honor-day"}, {"senator": "Robert Bresnahan, Jr.", "party": "Republican", "sentence": "…families, often referred to as the Gold Shield families, carry  an unthinkable burden of loss. It is our duty not just as lawmakers but  as fellow citizens to ensure that their sacrifice is never forgotten  and see that their families are taken care of after they are gone.\n\nAn astounding example of this mission and inspiration for the  resolution is right…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691022/calling-upon-local-communities-to-support-organizations-that-provide-resources-and-aid-gold-shield-families-in-their-time-of-need"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…to represent when multiple police officers were shot while in  the line of duty. One, Officer Andrew Duarte of the West York Borough  Police Department, made the ultimate sacrifice. Mr. Speaker, he was  only 30 years old.\n\nPolice officers across the country put their lives on the line every  single day to keep us safe. Every day that they go out, they…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689661/authorizing-the-use-of-the-capitol-grounds-for-the-national-peace-officers-memorial-service-and-the-national-honor-guard-and-pipe-band-exhibition"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…men on Omaha Beach. Known to many as the  Bedford Boys, they were amongst the first soldiers to land at Normandy  as part of Operation Overlord. Their stories of heroism and sacrifice  will be passed along from generation to generation.\n\nOne of the men who sought to memorialize their heroic actions was  Staff Sergeant Bob Slaughter. A native of Roanoke,…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692106/national-d-day-memorial-in-bedford-county-virginia"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…enforcement officers during our 64th annual National  Police Week.\n\nNational Police Week presents an opportunity to show appreciation  toward the men and women in blue for their sacrifice and selfless  service and honor, at the same time, the fallen officers.\n\nEvery day, men and women selflessly and courageously dedicate their  lives to keeping America safe…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690982/national-police-week"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…and that he gets the best healthcare possible  through the VA system.\n\nMr. Speaker, please join me in thanking Mr. Dale Karst, a true  American hero, for his courage, his sacrifice, and his enduring love  for the United States of America. I want Dale to know we love him.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695704/recognizing-the-funky-buffalo-coffee-house-and-trading-company"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…as a member of the U.S. AbilityOne Commission.\n\nMr. Mittman served 22 years in the U.S. Army until an IED ended his  service and caused him to lose his vision. Despite this sacrifice, Mr.  Mittman made it a mission to move forward and overcome the challenges  his life presented.\n\nAs one of many accomplishments, in 2019, Mr. Mittman became the first  legally…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695725/highlighting-the-work-of-jeff-mittman"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…men and women from small towns  and big cities who raise their hands, lace up their boots, and swear an  oath to protect this Nation and its values.\n\nI have seen what that sacrifice looks like. I have worn the uniform.  I have served beside heroes, and I know what it means to be part of  something bigger than yourself.\n\nThe Army isn't just celebrating…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692297/recognizing-davenport-assumption-girls-soccer-team"}, {"senator": "Steve Womack", "party": "Republican", "sentence": "…matter  of necessity. It is about ensuring that every  veteran, regardless of where they live, has equal access to the care  that they have earned through their service and sacrifice to this  Nation. Our veterans have given this Nation their best. It is our duty  to give them our best in return.\n\nMr. Speaker, I urge my colleagues to join me in supporting…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695454/protecting-veteran-access-to-telemedicine-services-act-of-2025"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…nation through the turbulent  revolutionary years.\n\nEstablished in 1752, the Midway Congregational Church was destroyed  during the Revolutionary War, highlighting the immense sacrifice made  by the citizens of Midway in advancing the cause of liberty.\n\nThe town is now home to Georgia's only colonial museum and serves as  one of the First District's most…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694770/recognizing-the-city-of-midway-georgia-on-its-centennial-celebration"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…role  in rescuing wounded soldiers from active combat zones required  extraordinary courage and was vital to saving countless lives. His  service reflects the bravery and sacrifice of the many Medevac crew  members who risked everything to bring others to safety.\n\nIn his military service, MSgt Timmins was recognized with two  citations for his courage…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692874/recognizing-master-sergeant-gerald-timmins-for-his-service-with-the-us-marine-corps-as-a-member-of-the-medevac-crews-during-the-vietnam-war"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…improve  military quality of life, including robust funding for servicemember  pay increases, housing improvements, and family support programs,  believing that those who sacrifice to defend this country should never  have to sacrifice dignity or stability at home.\n\nH.R. 4016 reflects a deep commitment to national security, strategic  deterrence, and…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693544/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…willing to give their lives defending her.'' Allen  Brady was not just such a person, he embodied that call.\n\nGod bless Captain Brady and his incredible life of service and  sacrifice. Katie and I, all Floridians, and this Nation offer our  thoughts and prayers to  the Brady family as they celebrate his life. May he rest in peace.", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691271/congratulating-northwest-florida-state-womens-basketball-team"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…them in  action while on duty.\n\nI also thank the families, spouses, and loved ones back home who  carry the weight while their Guard members serve here in D.C. The  families' sacrifice and strength are a vital part of a successful  mission. Their dedication reflects the values we hold dear in South  Carolina. I am grateful to Governor McMaster for standing…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}]