[{"senator": "Robert Garcia", "party": "Democrat", "sentence": "Mr. Speaker, I thank first the entire Minnesota delegation, in  particular Congresswoman Morrison for introducing this important  resolution. This is obviously a very sad time across our country, and  of course our hearts and our prayers go to the family, and everyone  impacted across the State.\n\nI know that the events of June 14 were shocking…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692858/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…eight-story skyscrapers where--I won't even  talk about the sanitary conditions, but they are not good. I have been  into wards with people who are mentally ill, and I have seen the sad  situation in which they live. I couldn't even imagine someone from my  family having to exist in those conditions.\n\nI have walked across the country in different places and…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690215/supporting-ukraines-independence"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…Though the President does not like wind  power, in some remote and coastal locations they do make sense.\n\nThe administration's Venezuela obsession is going to prove to be, I  am sad to say, very expensive. Whatever happens will also take time.  Forces of sabotage may lurk in an impoverished nation of over 30  million people, and its institutions are run…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698837/reflecting-on-impact-of-illegal-action-in-venezuela"}, {"senator": "Rick Larsen", "party": "Democrat", "sentence": "…get the bill done. I appreciated Jack's help in making that happen.\n\nEven when we disagreed, Jack was never disagreeable, and he worked to  find common ground. We are actually sad to see Jack go. I know Jack  will do well and we wish him great luck in his future endeavors.\n\nMr. Speaker, I support the resolution and encourage my colleagues to  do the same.", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692223/designating-the-house-press-gallery-in-the-united-states-capitol-as-the-frederick-douglass-press-gallery"}, {"senator": "Raul Ruiz", "party": "Democrat", "sentence": "…their service to the  Imperial Valley.\n\nThis week, the Riverside County Sheriff's Office held its own  memorial, recommitting to their mission to protect and serve. This is a  sad reminder that each day police and first responders make the  ultimate sacrifice for their communities.\n\nThat is why Congress needs to do more to support officers and their…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691331/9999"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…parents. These are people.\n\nThese are people. These are real people. These are real lives that we  are impacting, and yet we sit in here and we cheer. We cheer the  downfall.\n\nThe sad part about it is that regardless of how you feel about the  Federal Government, regardless if you feel that these jobs were  unnecessary or unneeded, even if you feel that way,…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688514/people-not-statistics"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…paid for by a  foreign government. It is disgusting. It is wildly corrupt. And just  because they are doing the corruption in plain sight not does make it  any less damning or sad or gross.\n\nThis week, several of my colleagues and I will be asking the Senate  to vote to condemn this action. There should be 100 of us that agree on  this fundamental principle:…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690968/qatar"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…healthcare costs.\n\nMr. RILEY of New York. Mr. Speaker, my kids are little. The other day  they asked why daddy has to go back to D.C. I said that it is for work.  They seemed sad about that. My wife chimed in, and she said that it is  really important work. It is work that is going to help make people's  lives better.\n\nNow here we are, back at work.…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698564/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…up in these  cruel and chaotic raids.\n\nTo think that this man is a robber, a rapist, a terrorist, a  murderer, criminally insane is just almost laughable if it wasn't such  a sad situation exploiting this poor gentleman.\n\nIn the face of such ugliness, Chicago and the people who live there  have shown up to stand up for one another. We saw it in Mr. Cisneros'…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696536/government-funding"}, {"senator": "Brad Schneider", "party": "Democrat", "sentence": "…As she departs, Emma leaves behind a strong New Dem brand and  media presence that will continue to grow atop the foundations she  worked so hard to establish. Though we are sad to see her go, the  Coalition, our leadership team, and I, wish Emma all the best. We look  forward to working with her in her new capacity to move our country  forward and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695553/recognizing-emma-weir"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…you now with this final reminder: God, this       world needs to become a lot kinder.\n\nSo, when angry, when joyful, when weary or mad.\n\nWhen soaring with hope, or aching and sad.\n\nWhen lost, when certain, or when unsure of your way--\n\nWhen life makes no sense at the end of the day--\n\nChoose again. Decide again.\n\nMake it your very spine:\n\nResolve, in…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699130/senate-pages"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…the ranking member for yielding.\n\nMr. Speaker, I rise as a former small business owner having over  three decades owning and managing restaurants in strong opposition to  this sad healthcare plan.\n\nAfter kicking 10 million Americans off Medicaid in the big, ugly  bill, Republicans are following up with this proposal that the  Congressional Budget Office…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698403/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…same day, just blocks away at JCTC, two  people were shot, and Chea'von Moore was killed at just 24 years old.\n\nMr. Speaker, I stand here today as a lifelong Louisvillian, still sad  my community joined the long list of cities devastated by mass  shootings. On behalf of all of our communities, we can and must do more  to stop senseless gun violence.", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690063/stopping-senseless-gun-violence"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…encountered.                             indian burial mound\n\nThese mutually beneficial interactions sadly appear to be at odds  with this administration's worldview.\n\nIt is a sad irony, I have observed over the years, that those with  the outlook held by this administration are those who would benefit the  most from learning from, and interacting with,…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689638/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…coal pollution and  fossil fuel pollution, we are here in this alternate reality of the  Republican majority, where my colleague from Wyoming calls it climate  lunacy.\n\nIt is a sad, sad testament to, frankly, the disgraceful leadership of  this Republican majority that propping up the coal industry with  discounted royalties, massive subsidies, millions…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696881/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…civility and  decorum.\n\nAccordingly, our rules insist on that. I believe that all of those  who breach  these rules need to be held accountable, lest this event become just  another sad milestone in the denigration of this institution.", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688497/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…California Air Resources Board.\n\nThese are just a few suggestions, but our State has absolutely  enormous potential that currently is being dramatically underutilized.  It is truly a sad thing as we see it in every community in this State.  You see your favorite restaurant or another cherished small business  that suddenly closes its doors for good, and you…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689211/protecting-medicaid-for-californians"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…(Mr. Fry).\n\nOver the last several years, Americans have seen firsthand what  happens when a radical regulatory agenda takes over Washington. The  previous administration, it is sad to say, inserted itself into nearly  every aspect of American life, raising costs and imposing rules that  made no sense for American families.\n\nOne of the clearest examples…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698565/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…have no desire to change sanctuary  policy. We think it is OK. Then we have got me and all of us on this  side saying that you need to end this; that this will continue.\n\nI am sad and disappointed we didn't have a bunch of votes today. Why  aren't we voting? Because they blocked it. Why aren't we defunding DHS?  Because they don't want to talk and fix…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700070/9999"}, {"senator": "David Kustoff", "party": "Republican", "sentence": "…only for his strong leadership but for his support on this  important legislation.\n\nMr. Speaker, every year, more and more Americans are having their  identity stolen. It is a sad fact. However, actors are becoming more  sophisticated. They are using new technology to gain access to  sensitive information. Just last year, there were over 3,000 separate…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697188/improving-social-securitys-service-to-victims-of-identity-theft-act"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…This is insane.\n\nSo to my Republican colleagues, let's put all of those issues in  front of the American people. I am not afraid of this debate at all.  Bring it on.\n\nWhat is sad is that the Democrats continue to play the Ole game here.  They negotiate a deal, and then they hold it up. We saw this with the  longest government shutdown in American history…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700065/9999"}, {"senator": "William Timmons", "party": "Republican", "sentence": "…is correct, but with us granting power, there comes  responsibility.\n\nMy colleague from Washington, D.C., is talking about the home rule  and this and that. This city makes me sad. I mean, I have hope now that  President Trump is here that the D.C. Government is starting to do  things that they should have been doing all along.\n\nWhat about Representative…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692372/district-of-columbia-federal-immigration-compliance-act-of-2025"}, {"senator": "Rudy Yakym III", "party": "Republican", "sentence": "…colleague but as a friend. Her work ethic, professionalism,  and commitment to service to Indiana's Second District have left a  lasting impression and mark on our team. While I am sad to see her go,  I am incredibly excited for what lies ahead for her in her next  chapter.\n\nI thank Mariah for everything. Her contributions have meant so much  to me and my…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693053/commending-michael-kraan"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…Epstein during a hearing where Michael Cohen  was their witness in another effort to go after the President.\n\nAmericans see through it all and, frankly, it is actually kind of  sad. This obsession, this syndrome, this mindset that says, we have to  go after President Trump no matter what that they have.\n\nActually, when I think about it, I think it is because…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696818/epstein-files-transparency-act"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…resiliency built into this community before this flood.\n\nThe purpose of the BRIC grants is to build that resiliency so that we  don't have stories to tell which are tragic or sad but rather stories  where people continue on with their life as if--well, as if the flood  never occurred.\n\nLocal leaders advocating implementing using these dollars are  advocating…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690105/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…ranking  member. I don't let people put their arms around me, especially not  people like that.\n\nIn this photo of Nicolas Maduro, you probably also recognize John  Kerry. It is sad to see that. I think it says a lot about the  origination of this bill, the heart of this bill. This is not a  handshake. It is an embrace of somebody with a relationship. That…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698249/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…the outburst from the gentleman from Texas (Mr.  Green). There were the pathetic little protests of a handful of people  walking out in the middle of the speech. There were the sad, little  cards with statements like ``Lies'' on them.\n\nBeyond all of that, there was a premeditated refusal from one side of  the aisle, acting in unison, to stand and applaud…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688626/finding-common-ground"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…heard. I am going to start to go through some of that.\n\nNumber one, who will pay the price? That was a question begged by my  colleague. Who will pay the price? It is a very sad thing to have been  asked this by my colleague.\n\nIt is important to remember what this resolution is. This resolution  ends an emergency related to fentanyl. I would say to…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699965/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "Mr. ARRINGTON. Mr. Speaker, the era of woke and wasteful spending in  the people's government is over, and it is sad to watch this last-ditch  effort by my Democratic colleagues to fight for status quo. The status  quo is a cesspool of these leftist ideological programs that they would  say…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693716/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "James Risch", "party": "Republican", "sentence": "…we have seen is an attempt in every way to denigrate the  action, downplay it, and berate this great and glorious victory. This  resolution we have before us today is another sad attempt in that  regard.\n\nI understand that the hate and vitriol against our President  precipitates this kind of thinking. It is wrong. This is ill-conceived  and will telegraph…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693132/motion-to-discharge-sj-res-59"}]