[{"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…children and seniors, vulnerable people who rely upon  Medicaid for their health and for their very lives.\n\nNegotiations are always part of the process, yet our duty remains to  safeguard our children, our seniors, the working poor, people with  disabilities, and people struggling with addiction. That is not  negotiable.\n\nOur budget reflects our values. Protecting…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688326/funding-medicaid-is-not-negotiable"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…supposed qualifications. Once in a  while, I get called a privacy hawk, and I never consider that an  insult. I have worked for decades, often with my Republican colleagues,  to safeguard the privacy of Oregonians and all Americans. I have come  to believe there are few places where privacy is more important than in  the healthcare system. That is why this…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697900/9999"}, {"senator": "Kim Schrier", "party": "Democrat", "sentence": "…rezoning, permitting for land to use for housing, and then  you can build houses quickly, starter houses, houses to just help young  people get their piece of America, their safeguard for their  retirement.\n\nHowever, this is doing the opposite. If we are not bringing the wood  out of our forests, like the Forest Service employee I just told you  about…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689811/cuts-to-forest-service-endanger-millions"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…democracy. It is a freedom that generations of Americans have fought,  bled, and marched for, many in my hometown of Selma, Alabama.\n\nWe know that it is so important that we safeguard these important  truths. Our freedom is under assault. Make no mistake, Republicans know  that their policies are failing, that prices are going up, that jobs  are going…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700009/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…efficient, the most affordable, and that is  made in America, and that is what these appliance standards do. They  help you save money over the long run.\n\nThey also want us to safeguard their healthcare. They want us to have  an eye on Elon Musk as he takes his chain saw to all sorts of agencies.\n\nSocial Security was a topic of conversation in my townhall.…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689130/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…there is a genuine interest in Congress on  both sides of the aisle to advance durable, bipartisan solutions to  meet our Nation's energy demands, to create good jobs, and to safeguard  our communities and environment.\n\nMr. Chair, I encourage my Republican colleagues to focus on real  solutions instead of giveaways to polluters. This special interest  crowd…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698044/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…States. That is to say: when the Council speaks as one, we know the  issue reflects consensus and is in service to its mission to promote  New England's economic growth and safeguard a high quality of life for  all New Englanders.\n\nThe council's mission becomes even greater in times of turbulence.  Whether during shared national struggles, like World…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696048/100th-anniversary-of-the-new-england-council"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "Mr. GARAMENDI. Mr. Speaker, today I am honored to introduce the  ``Transportation Emergency Relief Extension Act'' to safeguard federal  funding for disaster-recovery projects. I thank U.S. Senator Alex  Padilla (D-CA) and U.S. Senator John Cornyn (R-TX) for sponsoring the  companion legislation and…", "date": "2025-08-01", "source_url": "https://justfacts.votesmart.org/public-statement/1694581/introduction-of-the-transportation-emergency-relief-extension-act"}, {"senator": "Doris Matsui", "party": "Democrat", "sentence": "…independent departments,  culminating in the final merger of the American River Fire Department  and Sacramento County Fire Protection District.\n\nToday, Metro Fire is a vital safeguard for the lives of over 720,000  Sacramentans across a 359-square-mile area. From humble beginnings, it  has evolved into one of the largest and most responsive fire agencies…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698078/recognizing-sacramento-metropolitan-fire-districts-25th-anniversary"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…of our country, I implore my colleagues to not only vote in  support of this resolution but to commit together to live by these  words every day. Stand up, speak out, and safeguard our democracy.", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692862/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…Passport Agency have connected  the people of the Commonwealth of Massachusetts--and travelers from  across New England--to the wider world. Today, the agency continues to  safeguard the integrity of the U.S. passport and ensure families,  students, servicemembers, business leaders, and humanitarian workers  can safely travel across the globe.\n\nI celebrate…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695617/recognizing-the-boston-passport-agency"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…programs on which nearly  a third of our country rely, all to pay for those tax cuts to  billionaires and corporations. They are also dismantling the very  institutions meant to safeguard our Nation's health and well-being. And  this is not the first time.\n\nThey tried this before during Trump's first administration when he  unsuccessfully tried to repeal the…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…the  aquarium trade evolves in a way that protects our oceans and promotes  long-term ecological balance.\n\nI urge my colleagues to support this critical legislation to help  safeguard our coral reefs and the diverse marine life they support. By  restricting the importation of ornamental reef species collected  through harmful practices, we can protect…", "date": "2025-03-18", "source_url": "https://justfacts.votesmart.org/public-statement/1688918/saving-nemo-act"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…colleague from South Dakota indicated, it ensures that we have the  resources necessary to level the playing field.\n\nThe past several years have shown how essential it is to safeguard  our shipping. Disruptions in global shipping, port congestion, and  fluctuating freight rates have created serious challenges for American  businesses and consumers alike.…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698123/federal-maritime-commission-reauthorization-act-of-2025"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…help the Consumer Financial Protection  Bureau oversee these great Big Tech apps to protect the millions of  consumers who use them and their digital wallets from fraud, to  safeguard their sensitive personal data, and to prevent unfair,  deceptive, or abusive practices.\n\nLet's be clear. The Consumer Financial Protection Bureau's rule that  Republicans…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689953/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…chosen to do to keep us safe.\n\nMr. Speaker, these officers answer the call, day or night. They don't  have a choice as to what they respond to. They run toward danger to  safeguard our neighborhoods, and far too often, they pay a heavy price.  We owe them more than our gratitude. We owe them action.\n\nMr. Speaker, I say this: There were a couple of comments…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691319/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…mandates.\n\nThat is why I have partnered with Representative Fulcher to introduce  the Choice in Automobile Retail Sales, or CARS, Act, which will prevent  similar EV mandates and safeguard Americans' freedom to choose the  vehicle that is best for them. We must put consumers back in the  driver's seat and ensure the future of the auto industry is forged  through…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689285/put-consumers-back-in-the-drivers-seat"}, {"senator": "Andy Harris", "party": "Republican", "sentence": "…including  community project funding.\n\nThis bill provides critical funding support to America's farmers,  ranchers, and rural communities. It ensures both USDA and FDA can  safeguard our Nation's food and drug supply and fully fund nutrition  programs, including SNAP and WIC.\n\nAdditionally, the bill closes the hemp loophole that has resulted in  the spread…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696739/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…the expense of our laws, our  national security, and our people.\n\nDuring their time in office, President Biden and Vice President  Harris dismantled nearly every meaningful safeguard at the southern  border. Their administration presided over a record surge in illegal  immigration, over 700,000 illegal aliens were apprehended at the border  from October…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690710/outrageous-government-funded-incentives"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…people must also respect the rights of those who serve within it.\n\nFederal employees work tirelessly every day, often behind the scenes.  They process Social Security benefits, safeguard our food and water,  care for our veterans, and respond whenever a disaster strikes. Their  work is essential, and its impact reaches every community across this  Nation.…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697991/protect-americas-workforce-act"}, {"senator": "Tom Tiffany", "party": "Republican", "sentence": "…reserve the balance of  my time.\n\nMr. TIFFANY. Mr. Speaker, the Great Lakes are both an ecological and  economic engine for our Nation. It is our duty as Members of Congress  to safeguard them for future generations, and H.R. 1917 is a step  forward in that process.\n\nI thank Representatives Dingell, Walberg, and Huizenga for their  efforts on this legislation.…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693992/great-lakes-mass-marking-program-act-of-2025"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…protect our homeland cannot be understated. It is no secret  that Federal R&D projects are a target for foreign theft, espionage,  and influence.\n\nIt is our responsibility to safeguard them from malicious actors and  prevent the unauthorized access to, or disclosure of, sensitive  information.\n\nThis is why I reintroduced H.R. 901, the Research Security…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688737/research-security-and-accountability-in-dhs-act"}, {"senator": "Carlos Gimenez", "party": "Republican", "sentence": "…companies that have deep ties to the CCP  and engage in human rights abuses.\n\nH.R. 1166 helps our Nation take a step forward in advancing our  efforts to decouple from the PRC and safeguard critical supply chains  from exploitation.\n\nI am proud that this bill passed out of the Committee on Homeland  Security in a bipartisan manner last Congress and was passed…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688683/decoupling-from-foreign-adversarial-battery-dependence-act"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…dissent to have any role in American  education. Our classrooms must remain places of learning; not foreign  influence.\n\nThe PROTECT Our Kids Act sets a simple but necessary safeguard: If a  school chooses to host a CCP-funded Confucius program, then it should  not receive Federal taxpayer dollars. It is as simple as that. This  bill upholds academic integrity,…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697527/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…a perfectly reasonable  requirement, when someone is receiving a government benefit, to prove  that you actually are eligible according to the law.\n\nThis will also help us safeguard our safety net for those who are  truly among the most vulnerable and to root out waste, fraud, and  abuse.\n\nThere is no evidence that anything that the bill did or will…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693491/one-big-beautiful-bill-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "…farmers, ranchers, and small businesses and helping them grow. We are  making  America safer and stronger, investing in law and order here at home and  a strong military to safeguard our national security. We are creating a  brighter future with new opportunities for Americans wherever they live  and whatever their American dream may be.\n\nI want to take…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698212/senate-accomplishments"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…elections for Federal office, and for other purposes, and  ask for its immediate consideration.\n\nThe Clerk read the title of the bill.\n\nMr. Speaker, I rise in support of the Safeguard American Voter  Eligibility Act, known as the SAVE Act, introduced by my colleague,  Chip Roy of Texas.\n\nAs chairman of the Committee on House Administration, I have been…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690007/safeguard-american-voter-eligibility-act"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…and pass  the bill (H.R. 2635) to support the human rights of Uyghurs and members  of other minority groups residing primarily in the Xinjiang Uyghur  Autonomous Region and safeguard their distinct identity, and for other  purposes.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:                                 H.R. 2635\n\nBe…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694799/uyghur-policy-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Speaker, as the House of Representatives works to deliver on the  critical issues our Nation faces, we urge our colleagues today to  prioritize the passage of S. 1383, the Safeguard American Voter  Eligibility Act, or the SAVE America Act, which builds upon the SAVE  Act introduced in previous Congresses that requires States to obtain  proof of citizenship…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699943/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Laurel Lee", "party": "Republican", "sentence": "Ms. LEE of Florida. Mr. Speaker, I rise today in support of the  Safeguard American Voter Eligibility Act, or the SAVE Act.\n\nThe SAVE Act is an important step forward that will ensure elections  are more secure and accurate across the United States.…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1689997/safeguard-american-voter-eligibility-act"}]