[{"senator": "Val Hoyle", "party": "Democrat", "sentence": "Mr. Speaker, I rise in support of H.R. 2492, the Fire Safe Electrical  Corridors Act of 2025, introduced by the gentleman from California (Mr.  Carbajal).\n\nThis bill would authorize the Secretaries of Agriculture and the  Interior to…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691067/fire-safe-electrical-corridors-act-of-2025"}, {"senator": "Danny Davis", "party": "Democrat", "sentence": "…reserve the balance of my  time.\n\nMr. DAVIS of Illinois. Mr. Speaker, I urge all of my colleagues to  support this good bill to help ensure that children in foster care are  in safe, appropriate homes.\n\nI further urge my colleagues to work with us to stop these  indiscriminate, illegal layoffs and funding cuts which threaten to  undermine the good bipartisan…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688406/recruiting-families-using-data-act-of-2025"}, {"senator": "Ilhan Omar", "party": "Democrat", "sentence": "…the law to everyone in this country, not just citizens. If the  government can silence you, detain you, or deport you while defying  court orders, then none of our rights are safe. If we let this slide,  we are saying the Constitution is optional. It is not.\n\nWhat we are seeing is authoritarianism creeping in through the  backdoor, one ignored ruling…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690505/trump-immigration-policies"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…home country to come to the United States because  he feared for his life because he is gay.\n\nWe are being lied to. These kinds of cruel tactics are not necessary  to keep us safe. This is about taking away due process and intimidating  us into silence and submission. If this administration will do this to  Andry, then they will do it to anyone. We are…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689646/protect-due-process"}, {"senator": "Robin Kelly", "party": "Democrat", "sentence": "…Americans need real action by Congress to end gun violence. That  means universal background checks, funding and support for community  violence intervention organizations, safe storage laws to prevent  unintentional shootings, and an assault weapons ban.\n\nWe know the solution is to end gun violence, and yet the Trump  administration and this legislative…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691753/national-gun-violence-awareness-month"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…taking multiple jobs to make ends meet. It was not until the  late 1980s when she finally got her green card. She was so happy, and I  remember feeling relieved because she was safe and could live in this  country without fear.\n\nToday, that fear has returned. Donald Trump is blatantly pushing  aside the Constitution and the rule of law to deport anybody…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690513/trump-immigration-policies"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…for reducing waste and making sure  that we are spending taxpayer dollars efficiently, but gutting funding  for local stations that communities rely on to keep their families safe  is to cut corners that is absolutely detrimental to public safety.\n\nSo when President Trump--and his cronies like Russ Vought--say that  this bill targets government fraud,…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693590/rescissions-act-of-2025"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…our  families travel every day.\n\nFor more than 20 years, SRS helped close that gap. It ensured that  public schools could keep teachers in the classroom, that buses could  run safe routes on rural roads, and that county governments could plan  long-term budgets with certainty.\n\nIt ensures that children growing up in frontier communities receive  the same…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697655/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…country, and that aviation  safety and the ability to get from your point of departure to your  point of destination, flying in airplanes in order to see your loved  ones, is safe.\n\nOf course, our hardworking Federal employees are working hard to make  sure that veterans receive their earned benefits. Instead of being  targeted by Donald Trump and Republicans,…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697994/protect-americas-workforce-act"}, {"senator": "Ilhan Omar", "party": "Democrat", "sentence": "…protections for the most vulnerable workers are stripped away,  the consequences will be severe and immediate.\n\nAmerican workers are not disposable. They deserve workplaces that are  safe, fair, and accountable. They deserve the dignity of protection  that ensures that they can return home from work alive and uninjured.\n\nCongress must reject efforts that roll…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695573/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…dedicated scientists like my grandfather have  discovered breakthroughs that revolutionize the world of medicine and,  more importantly, revolutionize how we keep our loved ones safe and  well.\n\nSo when President Trump and Elon Musk come after this funding and  come after these public servants, they aren't just coming after  scientists in classrooms and…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688264/national-institutes-of-health"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…colleague and I disagree on domestic immigration  policies. One thing he and I don't agree on--because I was the mayor of  a city that basically said: In order to keep my city safe, we are going  to cooperate with the police department. It was an overbroad  generalization that was made on the Senate floor that we are not  supporting ICE and immigration…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696004/unanimous-consent-requests"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…through their  commitment to providing exceptional, cost-effective outpatient surgical  services, including colonoscopies and endoscopies.\n\nThe founders' vision of delivering safe and effective surgical care  through innovation and technology culminated in the opening of this  critical facility in September 2005. Moreover, patients and employees  have…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695923/recognizing-the-physicians-at-dallas-endoscopy-center"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…was being  criminalized in some of our States in the aftermath.\n\nThese immigrant refugee Catholics decided that they wanted a place  where they could feel welcomed, loved, and safe as they worshipped in  accord with the American value of freedom of worship. So they set up  this little parish in the Highland Park neighborhood of Northside  Richmond, VA,…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693592/rescissions-act-of-2025"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…community.\n\nAs the owner of the 1776 Restaurant in Crystal Lake, Ms. McClain has  established a fine dining experience that prioritizes high-quality,  gluten-free, and allergy-safe cuisine. Through her leadership, she has  strengthened the local economy by fostering partnerships with local  businesses and sourcing ingredients from Illinois farms. Her restaurant…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690883/recognizing-rhienna-mcclain-for-receiving-the-athena-international-leadership-award"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "Mr. THOMPSON of Pennsylvania. Mr. Speaker, I rise today to recognize  Centre Safe which celebrates 50 years of providing confidential and  professional services for victims and survivors of domestic, dating,  and sexual violence.\n\nCentre Safe began as a grassroots…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693919/recognizing-centre-safe"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…mid-19th century, Cutler Harbor fostered substantial  growth in the town's fishing industry, lumber shipping, and small boat  operations. Known as the Harbor of Refuge, it became a safe place for  fisherman to ride out the vicious storms of the coast.\n\nAs the town grew, Cutler played an important role in the promotion of  maritime safety and American national…", "date": "2026-01-29", "source_url": "https://justfacts.votesmart.org/public-statement/1699424/200th-anniversary-of-the-town-of-cutler"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…stop subsidizing insurance companies, stop  enriching insurance bureaucrats, and empower the American people?\n\nMr. ROY. I thank the gentleman for his time.\n\nMr. ROY. I wish him safe travel back to Missouri, and hopefully, next  week, we can get busy saving the American people from a broken  healthcare system.                       America Under Attack From…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698106/bringing-america-back-to-its-roots"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "…juvenile crime data via a public website, and a safer D.C.  for all.\n\nMr. Speaker, I urge my colleagues to join us and pass H.R. 4922 now  to make America and this District safe again.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695562/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…holidays.\n\nAnd I go every year, wherever I can find Wyoming troops, to thank  them for their service, to thank them for their commitment, to thank  them for what they do to keep us safe and to keep us free, and for the  sacrifices that they are making. And I also want them to know that the  people at home are thinking about them and know that they are a long…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697356/wyoming-servicemembers"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…the biggest study ever done, found that 1 in 10  women experienced serious adverse events.\n\nMr. Speaker, that is not what you hear from the abortion lobby. You  hear about how safe it is. It ain't safe. They suffer things like  sepsis, infection, and hemorrhaging, all within about 45 days.\n\nLet me also say to my colleagues, another method of aborting a…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698800/breaking-the-gridlock-act"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…forward. I thank Representative Roy for giving me the opportunity to  speak. We were told we should stand up for our citizens in this  process. When we stand up to keep them safe, that is exactly what we  are doing.\n\nMs. LEGER FERNANDEZ.\n\nMr. Speaker, I am really wondering what kind of people they want to  defend over there. Let's talk about those pardons.…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691168/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…by then-President Biden.\n\nThe CLEAN DC Act would largely repeal D.C.'s antipolice law and  ensure that law enforcement officers have the tools to keep visitors  and residents safe. D.C. law enforcement officers, who put their lives  on the line every day for our community, must have the capabilities to  do their jobs as they are trained to do.\n\nBy addressing…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696934/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…laws to enter this  country or could potentially be employed by a foreign adversary.\n\nAs the capital of our democracy, Washington, D.C., should be at the  forefront of ensuring safe and secure elections, not encouraging  illegal immigrants and others to vote for policies that we don't want.\n\nMadam Speaker, I urge my colleagues on the other side of the aisle…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692315/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…interject a little bit  of common sense in the deportation debate we have had going on here.\n\nNo one knows exactly how many people are in this country illegally. I  think it is safe to say that under President Biden that number went up  by about 8 million, which means almost certainly it is over 15 million.\n\nThere are some muddled up people here who claim…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698323/nations-arent-nations-without-borders"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…the United States as an aggravated felon due to a DUI or DWI who  attempts to reenter illegally is subject to a penalty of up to 20 years  in prison.\n\nAmericans deserve to be safe while driving on our roads. Parents  should not have to worry, when they give their 16-year-old the keys to  the car--who has learned how to drive or is just getting their first…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698979/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Tony Wied", "party": "Republican", "sentence": "Mr. WIED. Mr. Speaker, I rise today in strong support of H.R. 3423,  the Facility for Runway Operations and Safe Transportation Act, or the  FROST Act.\n\nThis bipartisan legislation makes a simple but critical update to  title 49 of the United States Code by including aircraft deicing…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695009/facility-for-runway-operations-and-safe-transportation-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Georgians.\n\nThe Support Officer of the Year Award is given to individuals whose  actions have gone above and beyond their normal responsibilities to  help keep the community safe.\n\nBy stepping forward in challenging circumstances and offering  assistance without hesitation, Special Agent Cephus embodies what it  means to serve with professionalism and…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698926/recognizing-riverview-hotels-110th-anniversary"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…bill is the most proworker, profamily legislation Congress has seen in  a generation.\n\nThe one big, beautiful bill will secure the border once and for all  and make America safe again. The border was the number one issue on the  campaign trail, and President Trump and his administration have made  historic efforts to remove bad actors here illegally…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691527/one-big-beautiful-bill"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…delays,  confusion, and broad regulations to return to work. This often means  that relatively minor mental health concerns result in long wait times  and derailed careers for safe and well-trained pilots and air traffic  controllers.\n\nIf we don't change how we handle mental health in aviation, then we  will exacerbate a culture of silence.\n\nWhen I was…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695005/mental-health-in-aviation-act-of-2025"}]