[{"senator": "Alex Padilla", "party": "Democrat", "sentence": "…we owe it to our constituents to fight every Executive  order that undermines our democracy and to keep demanding answers on  the firing of Federal workers entrusted with safeguarding our  elections.\n\nSo over the course of the next hour, Senate Democrats will lay down a  marker. We will stand strong against the rising tide of attacks on our  democracy.…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690535/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "Ms. DEAN of Pennsylvania. Mr. Speaker, commanding our Armed Forces  and safeguarding our national security requires exemplary honor,  experience, and loyalty to the Constitution.\n\nYet time and time again, the President and his Defense Secretary have  proven…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697535/venezuela-boat-strikes"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…I offered a bill, and it  passed, to codify Roe v. Wade in our State laws in Connecticut.\n\nConnecticut has led the Nation proudly in protecting reproductive  rights, in safeguarding access to clinics where abortion services are  provided, in fighting for Planned Parenthood funding, in protecting  doctors who provide these critical services to women…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692840/9999"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…Inupiat peoples since time immemorial.\n\nFor the last century, bipartisan lawmakers, including both Republican  and Democratic Presidents, have agreed to protect this place,  safeguarding it from destructive development with a firm resolve and a  desire to leave something behind for the next generation.\n\nThat same commitment to conservation has been carried…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696905/defending-the-arctic-refuge"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…independence of the Federal  Reserve Board.\n\nFor more than a century, the Federal Reserve has served as a  cornerstone of the economic system of our country, tasked with  safeguarding price stability, maximizing employment, and preserving the  health of our economy, independent from political pressure, insulated  from partisanship, and rooted in data…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694017/federal-reserve-independence"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…Senate's Homeland  Security and Governmental Affairs Committee, and I hope it will be  signed into law this Congress.\n\nPassing this legislation is a proactive step toward safeguarding our  citizens from the unimaginable. By enhancing our detection and response  capabilities, we deter adversaries from contemplating radiological or  nuclear attacks and…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688698/securing-the-cities-improvement-act"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…billionaires and  special interests.\n\nMr. Pallone is absolutely right. They are out of touch. Let's send a  message and vote ``no'' on this bill and get back to work on  safeguarding the pocketbooks of our neighbors back home.\n\nMr. Speaker, I urge a ``no'' vote.", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689130/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…nutrition to the  hungry. It protects international basic education so children in  poverty and crisis have a chance at opportunity.\n\nThe bill empowers women and girls by safeguarding funding for family  planning, women's economic empowerment, and Women, Peace, and Security.\n\nIt supports access to objective information through outlets like  Voice of America,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699057/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…over the southern border and growing       jihadi infiltration of nations such as Mali, Burkina Faso and       Niger meant U.S. support was necessary not only for       safeguarding Libya, but far beyond as well.\n\n``It's not only for the sake of Libya,'' Alftise said,       ``it's the sake of Africa and the sake of southern Europe.''…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697384/recognizing-the-importance-of-libyas-return-to-stability"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…clean  air, water, carbon sequestration, and critical wildlife habitat.\n\nProtecting the wilderness is not just about preserving pristine  environments. It is also about safeguarding our national heritage and  ensuring a healthy planet for future generations.\n\nI thank Representative Hill for his work on expanding the wilderness  area in his State. I…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691097/flatside-wilderness-additions-act"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…private, personal information of  certain faculty and staff on databases, this bill would make the  problem worse, making them much easier targets for xenophobic attacks.\n\nSafeguarding national security can be done through commonsense  reforms Democrats have offered that don't come at the expense of U.S.  scientific innovation, global collaboration, and…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689033/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…election he lost gives him absolutely no  credibility when he is speaking about his commitment to free and fair  elections.\n\nLike my colleagues--all of us--I am committed to safeguarding the  security of our elections and working with anyone and everyone in the  Chamber to advance that objective. All of us revere the right of  citizens to make the decision…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690522/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "…week, I received a call from a constituent whose son is deployed  abroad in the region. His son's mission was personally put at risk by  the very same people charged with safeguarding our Armed Forces who put  their lives on the line for us.\n\nThis Arizona father and his son sacrifice for our country, and we  should all be ashamed that this is how their…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689418/reckless-incompetence-of-signal-chat-put-servicemembers-at-risk"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…to assess DHS' adherence to the National Science and Technology  Council's 2022 implementation guidance and a 2021 National Security  Presidential Memorandum focused on safeguarding U.S. research from  foreign interference.\n\nThis bill also requires the Secretary of Homeland Security to provide  Congress with a briefing on its implementation.\n\nTime and…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688735/research-security-and-accountability-in-dhs-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…they believe that  those officials have not adequately safeguarded their computer systems  from harm, despite gutting CISA--the very Agency tasked with assisting  them in safeguarding their computers and software.\n\nTo instill fear in election workers, the administration is doing  everything it can to signal that it will punish anyone who doesn't bow…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696440/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…Treasury shall implement       policies and procedures that ensure counterintelligence       support to all entities of the Department of the Treasury       responsible for safeguarding networks and systems and for       coordinating between counterintelligence threat mitigation       activities and cyber network and system defense efforts. The       Committees…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698262/explanatory-statement-for-the-intelligence-authorization-act-for-fiscal-year-2026"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…representative of his community.\n\nHis passion for championing the rural and ranching communities of  Sierra County sets him apart as a leader,  and his steadfast commitment to safeguarding life, liberty, property,  and Sierra County's community values is unparalleled.\n\nSheriff Fisher is known for being a trusted leader and has earned the  respect of those…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…always in'' rule.\n\nSupporting this resolution means supporting American energy jobs,  lower prices, and fostering a regulatory environment where businesses  can thrive while safeguarding the environment.\n\nI want to underscore that this resolution is not about allowing  facilities to maintain high pollutant levels. It is about incentivizing  them to reduce…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691597/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…compassion, common sense, and a commitment to our most vulnerable. That  is why I rise today in strong support of the pro-life bills included in  this rule, including  safeguarding funding for pregnancy resource centers act and the  Pregnant Students' Rights Act.\n\nThese bills are about something very simple: Protecting the dignity  of the unborn and…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699218/providing-for-consideration-of-hr-supporting-pregnant-and-parenting-women-and-families-act-providing-for-consideration-of-hr-pregnant-students-rights-act-and-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…barriers to making critical products here at home. Otherwise,  we risk becoming reliant on countries like China.\n\nThis legislation will advance domestic manufacturing while  safeguarding our economy and national security. I urge my colleagues to  join me in voting for this particular bill, a very important bill, very  critical, H.R.\n\nMr. BILIRAKIS. Mr. Speaker,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690290/critical-infrastructure-manufacturing-feasibility-act"}, {"senator": "Jeff Hurd", "party": "Republican", "sentence": "…America. That funding is leveraged by  nonprofit and State partners, often doubling or tripling the Federal  investment, delivering high-impact results.\n\nThis bill is about safeguarding that model. It is about making sure  that the dollars contributed by sportsmen and sportswomen continue to  be put to work by conserving the wetlands that sustain wildlife,…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693492/wetlands-conservation-and-access-improvement-act-of-2025"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…VSAFE Act should strengthen the accountability, improve  prevention, and give veterans the support and protection they deserve.\n\nThis bill takes an important step toward safeguarding veterans and  strengthening trust in the VA system, and I am proud to support it.\n\nMr. Speaker, I urge all of my colleagues to support H.R.\n\nSomeday, I would like to carry…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699191/veterans-scam-and-fraud-evasion-act-of-2025"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…warning signs.\n\nOne of their most important initiatives is the Florida Familial Brain  Aneurysm Research Project, a program dedicated to understanding the  genetic links and safeguarding future generations.\n\nMr. Speaker, this month, let us all honor Trinity's legacy by raising  awareness and championing early detection because lives truly depend on  it.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695612/recognizing-trinity-love-hoblit-foundation"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…activity, and Coast Guard investments to counter Communist China's  aggression in the maritime sphere.\n\nWe enhance resources to combat fentanyl and other deadly drugs, while  safeguarding children through expanded investigation into human  trafficking and forced labor.\n\nFrom our borders and ports to aviation and cyberspace, this  legislation delivers the…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699354/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Kat Cammack", "party": "Republican", "sentence": "…sacred rights that we have  as Americans, and I am so proud to stand here as a woman, as a married  woman, and, again, as the chair of the Republican Women's Caucus in  safeguarding and ensuring the integrity of our elections.\n\nMrs. CAMMACK. The point is, is that Americans around this country are  sick and tired of the fear-mongering tactics that they…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690009/safeguard-american-voter-eligibility-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…boundaries of representation so  that free and fair elections, not political manipulation, are the  motive force in our democracy.\n\nThis principle is so important and so vital to safeguarding democracy  that the citizens commission is enshrined in our State constitution  along with a number of principles to guide redistricting:\n\nRedistricting occurs once per…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694777/protecting-representative-form-of-government"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…and vibrant wildlife. And Big Bend is a national  treasure.\n\nThis legislation expands and preserves the park's heritage, natural  resources, and jaw-dropping scenery while safeguarding private property  rights. It authorizes the National Park Service to acquire  approximately 6,100 additional acres adjacent to Terlingua Creek along  the western boundary…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691670/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Mario Diaz-Balart", "party": "Republican", "sentence": "…Susan Adams, and the  entire majority team, as well as the minority staff.\n\nWe have no greater duty to the American people than to protect the  security of our country while safeguarding tax dollars.\n\nMr. DIAZ-BALART. This bill does that. It protects our national  security. It protects the hard-earned tax dollars of every American who  pays taxes. This bill…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699051/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Andy Ogles", "party": "Republican", "sentence": "…accountability and reporting so that we know who is doing  what and where.\n\nIt is that simple. It will require universities to pick their  partners carefully and make sure they are safeguarding the very  technologies that they are being entrusted to house on behalf of the  U.S. Government and the U.S. people.\n\nWe don't need to enable the Chinese military through…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689026/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "…country needs now and will need even more in the future.\n\nThese three bills are not all of my bills, but I wanted to highlight  those three today because they are about safeguarding public lands,  fostering economic growth, and empowering our communities. They are  about letting ranchers, families, small businesses, and entrepreneurs  benefit from thoughtful…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689196/work-highlights-of-western-caucus"}]