[{"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…work.\n\nThank you for your consideration and your attention to       these important matters. We look forward to working with you       on our shared goals to advance the safety, security, and       prosperity of the District.            Sincerely,      Phil Mendelson,\n\nChairman, At-Large.      Anita Bonds,\n\nCouncilmember,\n\nAt-Large.      Robert C. White,…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692314/prohibiting-voting-by-noncitizens-in-district-of-columbia-elections"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…neighbors as we would want to be treated? Do we leave them to wander  the desert or return to horror? Do we offer a hand out and up to ensure  that they can live in safety and security? I think this is a weekend  for examining our own conscience.\n\nMy office has heard an influx of others fleeing horror, seeking  shelter, scared that they will be sent…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690052/trump-tariffs"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…time.\n\nMr. Speaker, I stand in strong support of the 2026 NDAA. It is an  essential piece of legislation that underscores our commitment to  ensuring that we uphold the safety and security of the American people.\n\nThe 2026 NDAA is a reflection of many of our priorities. When we talk  about about priorities, especially in eastern North Carolina, I visited…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697790/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…not one of the thousands who attended, asked me to support a  budget that cuts Medicaid, gives tax breaks to the wealthiest, raises  the cost of living, or undermines safety and security, but that is what  we are voting on today.\n\nThe Republicans are stealing the hard-earned tax dollars of  Oregonians and Americans to line the pockets of people like…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688036/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…are continuing to  connect more devices to these networks every day.\n\nWe, therefore, must build safeguards into our country's communication  networks to increase their safety and security while also promoting  innovation and competition.\n\nH.R. 1766 will help us achieve these goals. The bill authorizes the  existing  Office of Policy Analysis and Development…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693495/ntia-policy-and-cybersecurity-coordination-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…work.\n\nThank you for your consideration and your attention to       these important matters. We look forward to working with you       on our shared goals to advance the safety, security, and       prosperity of the District.            Sincerely,      Phil Mendelson,\n\nChairman, At-Large.      Kenyan R. McDuffie,\n\nChair Pro-Tempore, At-Large.      Anita…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692302/protecting-our-nations-capital-emergency-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…distinguished Member from  Kansas, for his powerful endorsement of this idea.\n\nThe resolution also goes on to urge the House to take ``all possible  steps to ensure the safety, security, and dignity of American Jews in  all aspects of their lives.'' We are called upon to condemn anti- Semitism and to ensure the safety of the Jewish community, along with…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691194/calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism-and-educate-the-public-on-the-contributions-of-the-jewish-american-community"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…pepper-sprayed or tear-gassed, beaten, unlawfully detained, or even  shot in broad daylight like Renee Good and Alex Pretti. What is  endangering the American people's safety and security is an out-of- control administration that has empowered a mass paramilitary force of  ICE and CBP agents to act with impunity, without accountability,  without oversight,…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700066/9999"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…has just  described. By improving FPS data collection and analysis and  implementing the findings on these security tests, the agency will be  able to better ensure the safety and security of Federal buildings,  employees, the public, and the FPS officers themselves.\n\nMr. Speaker, I support this legislation and urge all Members to do  the same to make…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695059/personnel-oversight-and-shift-tracking-act-of-2025"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…agents, about  disrespect at detention facilities, and about the poor quality of those  facilities means that our work is vitally important to the well-being  and the safety and security of those who are in our country and those  who are being detained here for whatever reason.\n\nI thank the gentlewoman for this opportunity to speak to this issue.\n\nMrs.…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692932/holding-power-accountable"}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "…there are 100 of us who do and who represent all of the other  Americans in this Nation.\n\nThere are things that this administration can do today to restore  that sense of safety and security. For instance, they can pull ICE and  CBP agents out of their operations in Minnesota and in Maine and  deescalate the fear that American communities are facing. The…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699399/9999"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…disregard State laws prohibiting high- capacity magazines.\n\nThis legislation not only supersedes the considered policy judgments  of the States, but it threatens the safety and security of Federal  agencies by forcing them to allow concealed carry in many Federal  buildings. Forcing Federal offices and buildings to allow concealed  carry is a completely…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691242/leosa-reform-act"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…nuclear threats.\n\nWithout initiatives like this legislation, the STC, efforts to combat  these dangers could be significantly hindered or even discontinued,  putting the safety and security of our communities, taxpayers, and  citizens at risk.\n\nPassage of this legislation is very essential to preserving our  national readiness and to strengthen security…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688696/securing-the-cities-improvement-act"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…excuses for him and lie for him and  cover for him?\n\nThese are the questions that are haunting me today. We need so much  better than this in this moment. This is about the safety and security  of our Nation and our allies around the world. This is about our  collective protection of our ideals.\n\nAmericans of conscience, we must stand together and confront…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688349/collective-protection-of-our-ideals"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…country, and we had much  better instrumentation, knowing exactly what happened in those  explosions.\n\nThe knowledge that we gained has allowed our Nation to maintain the  safety, security, and effectiveness of our nuclear stockpile without  any further testing. If we were to resume testing, the rest of the  world would resume testing. I am sure they all…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694113/risk-of-conflict-with-nuclear-weapons"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…in Venezuela. We should take great  pride in the brave men and women who carried out the successful  mission. Republicans are going to continue to stand on the side of  safety, security, and America peace through strength.", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698571/venezuela"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…would force the  premature retirement of power generation that is absolutely essential  to keeping our grid reliable.\n\nThe Reliable Power Act, Mr. Speaker, is about safety. It is about  security. It is also, quite frankly, about affordability. There is  nothing more expensive, Mr. Speaker, than a blackout, a rolling  blackout. I know.\n\nThere is nothing…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698274/reliable-power-act"}, {"senator": "Barry Loudermilk", "party": "Republican", "sentence": "…liaison  and the security director for several years. He was an excellent choice  for this role, reaching out to help fellow veterans as well as helping  to ensure the safety and security of myself and our staff.\n\nBart continued his legacy of community service by taking on the role  of an associate magistrate judge for Bartow County, Georgia.\n\nThroughout…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698432/republicans-have-delivered-in-2025"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…before us not only reopens the entire government, but it ensures that  the House and its supporting agencies remain working for the American  people.\n\nThe bill invests in safety and security. It increases funding for the  Capitol Police and provides support for security programs through the  House Sergeant at Arms. It is tough on foreign adversaries, including…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696725/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…Both positions are equally  delusional.\n\nIt is time to put partisanship aside and come together as a country.  This is not just another political issue. It is about the safety and  security of the American people and the future of civilization itself.", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692744/iranian-regime-is-worlds-foremost-sponsor-of-terror"}, {"senator": "John Rose", "party": "Republican", "sentence": "…to prosecute those who illegally seek       personal gain at the expense of their fellow citizens.''\n\n``Corruption and fraud in U.S. Army programs jeopardize the       safety and security of our Soldiers and their families. When       discovered, fraudulent activities by Army employees will not       be tolerated, and those involved will be brought to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695237/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…face the full force of  the law.\n\nGod bless the men and women in Federal law enforcement and in our  armed services who are really working around the clock to restore  safety and security here in our country.\n\nUnder President Trump, we have seen that national security has become  a  priority. In fact, when we look back over the last year, one theme  sticks…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698427/unanimous-consent-requests-the-calendar"}, {"senator": "Brad Finstad", "party": "Republican", "sentence": "…Federal jurisdictions working together around the clock to bring the  shooter to justice.\n\nI thank the officers who conducted this successful manhunt and  ensured the safety and security of Minnesota lawmakers in the ensuing  hours.\n\nI also express my personal gratitude to members of the New Ulm Police  Department, the Brown County Sheriff's Office,…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692856/condemning-the-attacks-on-minnesota-lawmakers-in-brooklyn-park-and-champlin-minnesota-and-calling-for-unity-and-the-rejection-of-political-violence-in-minnesota-and-across-the-united-states"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…I  am not surprised that D.C.'s local government continues to protect the  criminals and ignore victims. The D.C. CRIMES Act puts an end to this  madness and ensures safety and security across D.C.\n\nAt 18 years old, you are given adult responsibilities, like being  able to vote or sign up for the military. At 18 years, you become  responsible for your…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695556/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…educate the public on the contributions of the       Jewish-American community and uplift Jewish stories and       voices; and\n\n(3) takes all possible steps to ensure the safety,       security, and dignity of American Jews in all aspects of       their lives, including the workplace, college and university       campuses, synagogues, and at home.\n\nMr. SCHMIDT.…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691192/calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism-and-educate-the-public-on-the-contributions-of-the-jewish-american-community"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…arrest again the very people that  President Biden put back out.\n\nMr. Speaker, I would note that as we are considering this Police Week  and we are talking about the safety and security of our streets, I  would just note that two of our most dangerous States as measured by  violent crime and property crime rates are the States of New Mexico and  Colorado,…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691169/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…great place to live, to learn, to work, and to recreate. Her  dedicated efforts contributed to the overall academic success of  students of the region, as well as the safety and security of the  people of Mono County.\n\nTherefore, on behalf of the United States House of Representatives,  it is an honor and a privilege to acknowledge Kathryn Mandichak…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688154/protect-medicaid-benefits-for-american-citizens"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…countless more heartbreaking stories  from across the country.\n\nIt is clear that the current penalties are not enough to deter this  dangerous cycle of illegal reentry. The safety and security of our  citizens must never be compromised by those who abuse our system and  exploit our borders.\n\nH.R. 3486 protects American families, upholds the rule of law, and…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695360/stop-illegal-entry-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…who were killed, abused, assaulted, or harmed because a radical  group of leftists decided that open borders for their political  purposes was more important than your safety and security as Americans.\n\nYes, I think we should have a select committee or an organized effort  among the Judiciary Committee and the Oversight Committee to expose  this network,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695719/highlighting-flawed-policies"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…billions upon billions of dollars of wasteful  spending that is destroying our country through inflation and  increasing the size and scope of government, undermining the safety and  security of the American people.\n\nHow about the $160 million we can save by not giving more money to  UNRWA, the organization whose own employees participated in Hamas'  slaughter…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692388/providing-for-consideration-of-hr-rescissions-act-of-2025"}]