[{"senator": "Al Green", "party": "Democrat", "sentence": "…his  restaurant.\n\nI know who he is. I saw his cousin, Milton Friedman, Nobel laureate,  who, after the Brown v. Board of Education decision was rendered, he  went public and said let's use vouchers to maintain segregation. That  is another way of saying let's use vouchers to maintain racism, because  that is what segregation was. It was racism.\n\nI know…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698076/liberty-and-justice-for-all"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…friends who got on me  about it. Guess what? The House Committee on the Judiciary and the  Committee on Homeland Security had votes. The Democrats proposed  amendments that said let's make it illegal, let's make a ban on  deporting American citizens. Every Republican on both committees voted  against that ban. That is where we are right now.\n\nLet me talk…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690639/trumps-first-100-days"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…rescissions package, which was essentially giving the President back  money that Congress had already voted to appropriate to go to the  American people.\n\nSome Republicans said let's do this once a month. That is not an  exercise. It is like going on a diet once a month. Let's cut more money  out of the hands of the American people. It is not funny.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695040/better-is-possible"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "…Speaker, I rise today to demand that  Donald Trump and our Attorney General come clean to the American people  and release the Epstein files.\n\nNow, this weekend, Donald Trump said: ``Let's . . . not waste time  and energy on Jeffrey Epstein, somebody that nobody cares about.''\n\nWell, Mr. President, a lot of people actually care. We know that MAGA  was all…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693624/release-the-epstein-files"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…that is why there is great sympathy for us  working together to resolve this.\n\nI put forward a somewhat different version of the world from my  colleague from Oklahoma and said: Let's do a block of time where  multiple people can be debated simultaneously. That alone speeds things  up by six to eight times because it is not 2 hours or 120 minutes per…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695308/cloture-motion"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…there had  been a lot of smoke and mirrors. There had been a lot of gimmicks. And  people on both sides said: No, no, we don't want to do that.\n\nDemocrats and Republicans said: Let's use honest numbers. Let's  create a Congressional Budget Office to give us impartial numbers so we  can be honest among ourselves, have a real debate about any given  policy…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689508/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…have a rebellion,  or you need to have an invasion, and it is very clear you don't have  either of those. Even then, two judges on the three-judge panel on this  court said: Well, let's kind of give a little more flexible definition  of ``rebellion,'' and by the way, maybe you can give more deference to  the President's evaluation. After all, they run…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…people who might be at risk of gun  violence or to stop that cycle of violence once the first shooting  happens.\n\nSo we passed this legislation, and we crossed our fingers. We said:  Let's hope that we are right and that these changes in gun laws and  these investments we are making in our communities will make a  difference.\n\nWell, what happened after we…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690948/gun-violence"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…to the Senate.\n\nOnce we saw that instruction--do not deal with Democrats--Senate  Democrats, under the leadership of Senator Murray, the lead Democratic  appropriator, said: Well, let's prepare an alternative, not a  nonnegotiable demand but an alternative.\n\nWe put that alternative on the table on September 18. We didn't wait  until the 29th of September…", "date": "2025-10-01", "source_url": "https://justfacts.votesmart.org/public-statement/1695967/en-bloc-nominations"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…who might disagree with Donald Trump.\n\nDonald Trump doesn't want to be President of a democratic republic.  He has said he wants to be a King or some kind of dictator. He said:  Let me be a dictator for one day. But his actions show he wants to be  one for much longer.\n\nMeanwhile--meanwhile--billionaires like Elon Musk have been handed  the keys to the…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690262/trump-administration-first-100-days"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…12 different sections of spending. And, I will say, that problem  of the debt growing, that is very significant.\n\nBack in 1974, Democrats and Republicans came together and said: Let's  have an architecture to ensure that we are very responsible and don't  run up massive debt. We will have a filibuster-free pathway for one  purpose, and that is to reduce…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693589/rescissions-act-of-2025"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…doesn't  really cost that--it only costs $10 billion--by using my baseline as  opposed to the honest baseline that we have used ever since 1974  passed, when 100 Senators said: Let's stop using smoke and mirrors and  let's use honest numbers.\n\nOr how about the exemptions being expanded for the alternative  minimum tax? The cost of that, from the Joint…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693102/one-big-beautiful-bill"}, {"senator": "Raphael Warnock", "party": "Democrat", "sentence": "…this,  and I am struck and inspired by his words. Having lost his precious  wife on a Sunday morning, having witnessed his son struck down, Martin  Luther King, Sr., said:\n\nI will never let any man pull me down so low as to hate       him.\n\nHe said:\n\nHate is too heavy a burden to bear.\n\nHe is right, and that is why in this moment, we must condemn  political…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695312/cloture-motion"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…try to settle the tone of debate, it is in our rules because of  Benjamin ``Pitchfork'' Tillman.\n\nAnyway, Roosevelt--a Republican--and Tillman--a Democrat--got  together and said: Let's ban corporations from being able to influence  our elections. That is the Tillman Act that was the law of the land in  practice until the Citizens United decision. For…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699117/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…They want 100 percent of the tax dollars that paid for the Affordable  Care Act, or the ObamaCare exchanges, to continue going to insurance  companies.\n\nPresident Trump has said: Let's get the money to the consumers so  they can choose what they want.\n\nI think that is a better idea.\n\nPlus, insurance companies skim about 20 percent off of those  taxpayer-provided…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697929/healthcare"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…It is just beyond  pale that that happened.\n\nOn the Epstein files, the Speaker tried to come and unanimous consent  the Epstein files. Remember, last week he came down and said let's pass  the Epstein files, and the other side of the aisle objected to it. I  don't know why they would object to passing the files.\n\nThey held it up for several days. I know…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697031/researching-efficient-federal-improvements-for-necessary-energy-refining-act"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "…Senate and our friends in the  House for coming together in the spirit of patriotism and comity to get  this very important quantum leap in our defense accomplished.\n\nWith that said, let's begin the vote and take the next step to  rebuild America's national defense.                                3961.", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698257/nominations"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…Chamber, but some of your colleagues, using  arcane Senate rules, did manage to do it but finally came to their  senses. You ought to pay attention to those people. They said enough is  enough. Let's reopen the government.\n\nI urge my colleagues to do that today. I hope it is done in a  bipartisan way.\n\nMr. COLE.  He is my very good friend and a person I admire…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696725/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…here, and it is up  above you up close to the ceiling. We are getting close to celebrating  the 200-year anniversary of those words that Daniel Webster spoke in  1825 when he said: ``Let us develop the resources of our land, call  forth our powers, build up its institutions, promote all its great  interests, and see whether we also, in our day and generation,…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689889/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…years ago, Daniel Webster addressed a few  hundred Revolutionary War veterans and spectators at the Battle of  Bunker Hill was memorial groundbreaking. In his oration, he said, ``Let  us develop the resources of our land, call forth its powers, build up  its institutions, promote all its great interests, and see whether we  also in our day and generation…", "date": "2025-10-28", "source_url": "https://justfacts.votesmart.org/public-statement/1696430/recognizing-high-impact-movement"}, {"senator": "John Thune", "party": "Republican", "sentence": "…failing program that is driving up costs and increasing  dramatically the cost to the Federal taxpayer.\n\nThen in 2022, they said--oh, they still had the majority--they said:  Well, let's extend this thing. And they extended it.\n\nI should say that 2021 was the American Rescue Plan, and 2022 was the  Inflation Reduction Act.\n\nThey decided to extend this…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697879/healthcare"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…around us. We are  terrified to step up and do the math and then tell you the truth.\n\nWe can start to actually walk through actual solutions. If I came to  you right now and said--let's see if I can find the right charts here.\n\nI did a whole presentation over and over the last 3 weeks on Medicare  Advantage. In 2005, the Republican idea was to buy capitated…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692327/math-always-wins"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…know, is a bill we have to pass every year. And housing is not  directly relevant to the NDAA. But under the rules, my colleagues liked  Elizabeth's and my bill so much they said: Let's put it on the NDAA.  And we did; flew out of here.\n\nThen it went over to the House, and we started negotiating the NDAA  because the House passed its version of the NDAA,…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699012/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…he said: Hey, I am going to block it because we kind of  don't think it is fair if we just get one Republican bill over the goal  line.\n\nSo he and I talked on the floor and said: Let us work with you, Dan,  because we know this is important to you. We know this is important to  your heroic constituents. Let us work with you. If you pair this with a  Democrat…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696959/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-extension-of-deadlines-in-standards-of-performance-for-new-reconstructed-and-modified-sources-and-emissions-guidelines-for-existing-sources-oil-and-natural-gas-sector-climate"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…cease-fire, but  I will stop bombing infrastructure in Ukraine. He lied like he  breathed. He continued to destroy civilian infrastructure in Ukraine.\n\nThen President Trump said: OK. Let's try for a cease-fire in the  Black Sea.\n\nThat would benefit both Ukraine and Russia, both of which use the  Black Sea for maritime commerce. And, indeed, the world depends…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689486/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}]