[{"senator": "Jeff Merkley", "party": "Democrat", "sentence": "\"Single-use plastic waste is suffocating our oceans, rivers, streams, and communities, and creating alarming mountains of debris on our coastal shores,\" said Merkley."}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "\"As we continue to battle the coronavirus pandemic, countless Oregonians are still relying on public transportation to report to their essential jobs, buy groceries, and get to their pharmacies,\" said Merkley."}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "\"This FDA announcement marks a good step, but more work remains to solve this shortage to be done so all healthy gay and bisexual men can donate.\"\n\n\"This is an important step forward in our fight to end a decades-old policy that discriminates against gay and bisexual men in our blood banks,\" said Merkley."}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "\"Nurses and midwives provide invaluable support and advocacy for patients at some of the most difficult and joyous moments of their lives,\" said Merkley."}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "Congress is duty-bound to step in and invest in these essential businesses.\"\n\n\"Child care services, and the workers who deliver them, are absolutely essential to countless families across Oregon,\" said Merkley."}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "\"As the western monarch butterfly comes closer and closer to extinction, we don't just risk losing these beautiful creatures--we also face an increasing threat to American agriculture and our food supply,\" said Merkley."}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "\"We have a responsibility to make sure that the Oregonians working on the front lines of this public health crisis have the resources they need to do their jobs safely and effectively,\" said Merkley."}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "\"We are facing a public health battle the likes of which we haven't seen in a century,\" said Merkley."}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "\"Health care workers and first responders on the frontlines of the coronavirus pandemic work around the clock to keep us safe,\" said Merkley."}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "\"The last thing anyone in Oregon needs as we grapple with the economic consequences of this public health crisis is the loss of essential utilities like electricity and gas,\" said Merkley."}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "\"Whether to hear out the truth should never be a partisan question,\" said Merkley."}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "\"The American people do not want another endless war in the Middle East--yet what we've seen in recent days is a president willing to make significant military decisions bringing us closer to war without consulting Congress or recognizing that our Constitution gives war making power to Congress, not the President,\" said Merkley."}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "\"As the coronavirus continues to rock every aspect of our society and economy, now is the time to make the critical investments we need to build a strong foundation for a safe future,\" said Merkley."}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "Fallon Smart and the other victims of these crimes deserve nothing less than the full support of every agency with the tools to respond to this monstrous behavior.\"\n\n\"When someone commits a serious crime on our soil, they must be held responsible in our courts,\" said Merkley."}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "\"In the face of this public health crisis, we need good information, good science, and the right tools in the right hands to limit the virus's spread and keep people safe,\" said Merkley."}]