[{"senator": "Steny Hoyer", "party": "Democrat", "sentence": "The gentlewoman, my friend from North Carolina, said, and I believe  she is accurate, that we are all concerned about the lives of people,  be they government employees or not.", "title": "Providing for Consideration of H.R. Financial Services and General Government and National Security, Department of State, and Related Programs Appropriations Act, 2026", "date": "2026-01-14"}, {"senator": "Herb Conaway, Jr.", "party": "Democrat", "sentence": "Speaker, having said that, I urge all of my colleagues to support  this very important legislation.", "title": "Sba Fraud Enforcement Extension Act", "date": "2025-12-01"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "I put forward a somewhat different version of the world from my  colleague from Oklahoma and said: Let's do a block of time where  multiple people can be debated simultaneously.", "title": "Cloture Motion", "date": null}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "Due to the funding freeze, Kris said essential programs at Common  Ground, like the youth workforce development and community food relief,  which also partners with CitySeed to help people afford food stamp  purchases from the farm, have been shut down.", "title": "Raising A Question of the Privileges of the House", "date": "2025-03-05"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "Despite years of false starts and half apologies, the FDA has still  not actually said sorry for failing to warn the public in time.", "title": "No Apology From Food and Drug Administration", "date": "2025-07-15"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "Let them show us how blowing up boats in the Caribbean solves what  the President has repeatedly said--the fentanyl crisis in each and  every one of our States.", "title": "Directing the Removal of United States Armed Forces From Hostilities Within or Against Venezuela That Have Not Been Authorized By Congress--", "date": "2025-11-06"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "It was John Lewis who said that ours is not the struggle of 1 day, 1  week, 1 year.", "title": "Fighting Voter Suppression", "date": "2025-03-31"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "As I have said many times, these kinds of violent threats have  absolutely no place--no place--in our political system.", "title": "Political Violence", "date": "2025-12-01"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "That is what he said.", "title": "Horrific Ice Abuses", "date": "2026-02-04"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "The same Medicare that we saw that huge  demonstration from Republicans about during President Biden's State of  the Union speech when he said Republicans want to cut Medicare, and  they rose in ire and anger to say: No, that is not possibly true.", "title": "Authorizing the En Bloc Consideration in Executive Session of Certain Nominations on the Executive Calendar", "date": null}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "In fact, on January 9, he said, ``We are not afraid of boots  on the ground.''\n\nLet me, for a moment, point out another great hypocrisy that has  arisen in this situation.", "title": "Commerce, Justice, Science; Energy and Water Development; and Interior and Environment Appropriations Act, 2026", "date": "2026-01-14"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "As Sergeant Gonell said recently, it seems like he believes that the  rioters and the insurrectionists were the ones defending the Capitol on  that day.", "title": "Leosa Reform Act", "date": "2025-05-14"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "Just this past week, we heard from Minnesota's Small Business Person  of the Year, given the award by the Trump administration, who said she  has 6 weeks until she goes out of business.", "title": "Capping Excessive Awarding of Sblc Entrants Act of 2025", "date": "2025-06-05"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "I looked at my TV screen, and I said: No, you don't get  to do that.", "title": "Healthcare", "date": null}, {"senator": "Alexandria Ocasio-Cortez", "party": "Democrat", "sentence": "In fact, Senator  Graham went before the press earlier today, and he said he was going to  seek well over $1 million from the American people from this.", "title": "Providing for Consideration of Senate Amendment to H.R. Continuing Appropriations and Extensions Act, 2026", "date": "2025-11-12"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "As I said in my opening  statement, this is a process, and we are a long way into the process  now, thanks, in large part, to her efforts and certainly the efforts of  the ranking members and chairs of the two committees whose legislative  work we are considering today.", "title": "Financial Services and General Government and National Security, Department of State, and Related Programs Appropriations Act, 2026", "date": "2026-01-14"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "As he himself said: ``No matter how much you want something,  no matter how long it takes, you can get it.''\n\nNic will now represent the United States in the global finals in  Toronto later this year.", "title": "Recognizing Uga 2025 Boren Award Winners", "date": "2025-06-23"}, {"senator": "Markwayne Mullin", "party": "Republican", "sentence": "As I said, they are very important in rural communities, very important  in my hometown of Westville.", "title": "-9999", "date": "2025-12-17"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "That is why I said the bill wasn't perfect.", "title": "Tax Cuts and Spending", "date": "2025-06-27"}, {"senator": "Rudy Yakym III", "party": "Republican", "sentence": "I have often said that a good Member can become  a great Member with a great team, and Michael proved that every single  day in my office.", "title": "Commending Michael Kraan", "date": "2025-06-26"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "This would prohibit access to approximately 24 miles of road as the  chairman said, including popular trails near the Orange Cliffs and  segments of the Poison Springs Loop.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the National Park Service Relating to ``Glen Canyon National Recreation Area: Motor Vehicles''", "date": "2025-04-29"}, {"senator": "Roger Marshall", "party": "Republican", "sentence": "In 2013, Peter Wadhams said we  would be ice free by 2015.", "title": "Unanimous Consent Request--S. Res. 550", "date": "2026-01-13"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "As Chairman Cole said more than once in the Rules Committee, these  appropriators knew their subject matter better than anyone else and  presented to the rest of us their best effort.", "title": "Providing for Consideration of Senate Amendments to H.R. Consolidated Appropriations Act, Providing for Consideration of H.J. Res. Disapproving the Action of the District of Columbia Council in Approving the D.C. Income and Franchise Tax Conformity and Revision Temporary Amendment Act of and Providing for Consideration of H.R. Critical Mineral Dominance Act", "date": "2026-02-03"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "Should I vote for a reconciliation package  that will almost certainly guarantee $1.5 trillion to $2 trillion of  deficit spending because I am getting certain crumbs in cuts in certain  committees, and the only reason that I have gotten said crumbs was  because we threatened to stop the extension of the tax cuts in order to  force the question on spending?", "title": "Fiscal Responsibility", "date": "2025-05-01"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "I have often said that coal is the energy of the future, and under  the leadership of President Trump and this Congress, coal is rightfully  back in favor in Washington, D.C.", "title": "National Coal Council Reestablishment Act", "date": null}, {"senator": "Adrian Smith", "party": "Republican", "sentence": "As  was said before, I think it will last for generations.", "title": "Offering Thanks and Gratitude to James Min", "date": "2025-03-10"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "As Ronald Reagan said so beautifully, so aptly, in this moment, I  can't think of any better words: ``Government is not the solution .", "title": "Lower Health Care Premiums for All Americans Act", "date": "2025-12-17"}, {"senator": "Nathaniel Moran", "party": "Republican", "sentence": "Speaker, I want to point out before I get to my  prepared remarks that Leader Jeffries just said  that we need to fix our broken healthcare system.", "title": "Breaking the Gridlock Act", "date": "2026-01-08"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "These descriptions are  all fitting for a woman whose name said it all.", "title": "Moment of Silence in Remembrance of the Honorable Mia Love", "date": "2025-03-27"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "From day one, we said this was a generational opportunity to deliver  the most comprehensive and consequential set of conservative reforms in  modern history, and that is exactly what we are doing.", "title": "One Big Beautiful Bill Act", "date": "2025-07-02"}]