[{"senator": "Al Green", "party": "Democrat", "sentence": "…939. It reads:  ``Impeaching Donald John Trump, President of the United States, for  high crimes and misdemeanors.''\n\nI have to pause a minute and say this. The President said just  recently that ``they will find a reason to impeach me.'' Mr. President,  we don't have to find a reason. You are giving reasons. You are  providing reasons on a daily basis…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699134/where-do-you-stand"}, {"senator": "Chellie Pingree", "party": "Democrat", "sentence": "…that budget documents describe needed  maintenance, yes, but nothing that required shutting down the entire  institution. In fact, the very official overseeing facilities said that  just 2 months ago, there were no serious discussions about closing the  Center.\n\nWhat changed? What changed is that the Center could no longer sustain  programming. Artists…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699704/changes-at-the-kennedy-center"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…to ask a question.\n\nBut I want you to know how much I and all of your colleagues  appreciate your standing up for democracy because we are in a pivotal  moment, as you said, not just in this country but globally.\n\nI know that you care about not just what is happening domestically in  the United States, but you also care about what is happening in the…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696340/trump-administration"}, {"senator": "Diana DeGette", "party": "Democrat", "sentence": "…nothing but snake oil alternatives  like high-deductible plans and health savings accounts that would leave  families high and dry.\n\nWhen we passed the ACA on this floor, I said this is just a start to  affordable universal healthcare. Democrats have worked to improve the  ACA. That is why we passed the tax credits in the first place. Millions  of people…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698646/extend-enhanced-premium-tax-credit"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…defund police departments in blue States.\n\nMr. BOOKER. Yeah, I just--again, I have so much respect for my  colleague that I want to respond to some of the things he said,  because, again, I just want to affirm that he is right on the urgency  to help our police officers. He is right that States should abide by  Federal law that passes from this body. But…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696004/unanimous-consent-requests"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…requirement that it consult with the committee before modifying or  repealing construction safety regulations. Trump's OSHA doesn't have to  consult the experts because it said so. It is just because they said  so. It is truly unbelievable.\n\nLet's make something clear, Mr. Speaker: The administration's actions  at the Department of Labor aren't just tinkering,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695577/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…use regulatory process. All those rules were available, and yet this  was the shortcut that was chosen.\n\nNow, we have repeatedly heard it said--in fact, it was recently said  just now on the floor--that President Biden claimed that what was being  done with the California waiver was not a rule, claimed that it was not  a rule. Do you know why the Biden…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691581/hj-res-88"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…to all these people who are opening up  their healthcare notices this week and are finding out that their costs  are skyrocketing. Why? Because what the Republicans have said--and just  said again--is that they want to talk about it. Talking about it is  going to do absolutely nothing for those people who are getting those  bills and those payments today.…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696460/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-record-of-decision-for-the-barred-owl"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…question.\n\nOf course, anyone living in reality knows the answer to this--Donald  Trump lost Minnesota three times--but not Donald Trump. He continues  denying election results. He said just last Friday that because of  voter fraud, he feels he won Minnesota.\n\nThe Republican chairman of the House Administration Committee, the  congressional committee which regulates…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699941/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…with western New York's Ukrainian  community in Niagara Square, designated Ukraine Freedom Square, just  outside Buffalo City Hall days after Russia's invasion.\n\nWhat I said then is just as true today: The United States of America  must always stand with Ukraine against Russian aggression.\n\nBuffalo is known as the City of Good Neighbors, and that spirit…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687988/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…so you know the prices have gone up--that entire bill was  $15,000.\n\nI had employer-provided insurance, so I paid $1,000. Imagine if I was  one of these families that said that I am just going to wrap myself in  bubble wrap or  roll the dice and see what happens. $15,000 is a lot of money.\n\nThese are just a few of the stories of people who right now…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697649/restoring-enhanced-premium-tax-credits"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…alarming to hear that instead of solving the problem there are  some rightwing media commentators who want to execute mentally ill  homeless people. I think the words they said were to just kill them.  This was followed by a lackluster apology. It makes me think that maybe  they meant it.\n\nI don't think this is the position of the rightwing or the Republican…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695728/making-homelessness-a-national-priority"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…it is not going to solve our budget problems. Their budget  proposal, as was said by the one lone Republican who voted against it  because he is such a fiscal hawk--he said: If you just read their own  numbers, this is a lie, a sham. It increases the deficit by trillions.\n\nLet me go to some Republicans.\n\nJoe Lombardo, the Governor of Nevada:\n\nAn abrupt…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…Assist, a nonprofit that helps disabled people apply for       benefits. Many of them are homeless.\n\n``The attrition rates in Portland are off the charts,''       Stowell said. ``They just don't pick up the phone. They were       already short-staffed. They've told us they just don't trust       that there's a reliable system to get ahold of them by…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689130/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Ilhan Omar", "party": "Democrat", "sentence": "…couple of weeks ago, after an ICE raid at a pizzeria in Honesdale,  Pennsylvania, two people gave quotes to local news that have been  making the rounds. One of them said: ``It is just made to instill fear,  and I am not sure why we need fear in our communities instead of love  and caring and community.''\n\nThat is what we are about in this country,…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692431/ice-surveillance-and-trump"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…stoves? It is because of the regulations.\n\nWhy are they paying more for showerheads? As we said, if people can  have the choice, they can also turn down their water. As I said, it is  just that simple.\n\nMr. GUTHRIE. Mr. Speaker, when we talk about affordability, we did  pass and sign into law no tax on Social Security. It is a deduction for  people who…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698566/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…from  Massachusetts is prepared to close.\n\nMr. ROY. Mr. Speaker, may I inquire as to how much time I have  remaining.\n\nMr. Speaker, the gentleman from Massachusetts said that we are just  doing this legislation because we are afraid of losing this election.\n\nThe fact of the matter is we are not. We want to ensure that we win  this election by getting…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699943/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…don't  give any benefits for that. It will only cover 38 percent of the  shortfall.\n\nI think we were modeling it for 2034, the first full year, the  shortage--they even said we will just pay for it out of the general  fund. I think it was $608 billion, so almost two-thirds of our entire  military budget.\n\nIf you are someone that comes to me and says:…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692327/math-always-wins"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…and nondiscriminatory process. That is what  H.R. 2988 requires.\n\nMr. WALBERG. Mr. Speaker, we are getting to a point, I think, that  the old adage that everything has been said, just not everyone has said  it yet. But with fear of offending that specific adage, I must  respectfully, again, address the fact of the misconception that is  being put forward…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699160/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…vehicle. This provision can really help small-town car dealers like  M.J. McGuire.\n\nFor a family buying a $50,000 vehicle, Dan explained to me what this  would mean. He said the interest in just the first year might run about  $3,500. Under this new law, that interest is now deductible, a huge  savings for hardworking American families.\n\nThis isn't just relief…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694792/promises-made-promises-kept"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…This is an issue that liberal thinkers and conservative thinkers have  both said is a problem that we ought to address.\n\nJustice Kagan has been quoted widely as having said that it just  cannot be the case that a single district court judge can hold up  Federal policy for the lengthy period of time nationwide that it takes  for the ordinary appeals process…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689716/no-rogue-rulings-act-of-2025"}, {"senator": "Michael Rulli", "party": "Republican", "sentence": "…game with healthcare. They  created ObamaCare. They never had a solution. It was never a permanent  fix.\n\nMr. Speaker, the Democrats kicked it down the road, and then they  said to just extend it without even dealing with it. What my Democrat  colleagues are doing to the American people is wrong.\n\nWhen a person goes on vacation, they go to a motel and take…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698567/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Dan Newhouse", "party": "Republican", "sentence": "…the House floor. This is about how we treat each other.  This is a reflection on every single one of us in this Chamber. As my  colleague from the State of Washington said, it is not just us this  affects. This affects the kids of our country, as well, who are  learning, one way or the other, from our examples.\n\nYou can go on and on about how much you…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688496/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…smarter and more virtuous than the American people or you  don't, and I think we ought to be treated the same.\n\nNow, having said that, I said I agreed with what Senator Paul said. I  am just worried his name on the bill is going to get knocked out of the  park, so I am going to put it in my name. It is not Senator Paul's  bill; it is Senator Ron Johnson's…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696561/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…working to build it.\n\nThen, we traveled to Basel, Switzerland, which is the base of  operations for the Bank for International Settlements. We met with  them. They, too, said that they are just studying this, not really  proposing that everyone do it.\n\nThe reality is that when you talk to everyone who is developing it,  who is helping coordinate it? The Bank…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693006/central-bank-digital-currency"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…shown we could revolutionize the cost of  healthcare. We have actually looked at one dataset. We have been  studying this now for months. If I came to you, Mr. Speaker, and said,  just in Medicare, duplicative MRI scans, PET scans, X-rays, and  ultrasounds could be as much as $25 billion a year, duplicative scans.  Mr. Speaker, what if you have your knee…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690586/economic-anxiety"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Means Committee, so I am blessed. I have a freaky smart  staff.\n\nIn 2032, the trust funds are empty. In 2033, the first year where  they are completely empty, if you said that we are just going to pay  for everything out of the general fund, okay, we can do that.\n\nMy estimates come in at about $638 billion in 2033 just to make up  the shortfall of the…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699988/math-is-such-an-anathema"}, {"senator": "Mary Miller", "party": "Republican", "sentence": "…any explanation for shutting down resolutions  of inquiry at this time. Mr. Speaker, can you tell me why? Last night,  we had an amendment to actually remove this, and we said: Why? Just  explain to us why. They could not answer.\n\nI don't think it is a coincidence that the House Armed Services  Committee and the Foreign Affairs Committee were set to take…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690386/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}]