[{"senator": "Patty Murray", "party": "Democrat", "sentence": "\"I'm glad to partner with Senators Murray and Smith and Representatives Scott and DeLauro to introduce legislation for a $50 billion child care bailout that is critical for families and to our country's recovery.\" \n\n\"The workers and small business owners that care for our children while we work desperately need the federal government's help,\" said Congresswoman DeLauro."}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "As Co-Chair of the National Service Caucus, I am proud to introduce the Pandemic Response and Opportunity Through National Service Act to strengthen the response in our communities and our country.\"\n\n\"The COVID-19 pandemic has opened up fractures, but also new emergency and public health opportunities in our workforce that will live well into the future,\" said Congresswoman Doris Matsui, Co-Chair of the National Service Caucus."}, {"senator": "Edward J. Markey", "party": "Democrat", "sentence": "\"As we celebrate these critical funds to support local organizations protecting their communities, we must do more as so many in our Commonwealth lose food security and shelter.\"\n\n\"Many Massachusetts families are facing a second month without a paycheck and they're turning to our emergency shelters and food banks for a lifeline,\" said Congresswoman Clark."}, {"senator": "Edward J. Markey", "party": "Democrat", "sentence": "\"As we celebrate these critical funds to support local organizations protecting their communities, we must do more as so many in our Commonwealth lose food security and shelter.\"\n\n\"Many Massachusetts families are facing a second month without a paycheck and they're turning to our emergency shelters and food banks for a lifeline,\" said Congresswoman Clark."}, {"senator": "Cory A. Booker", "party": "Democrat", "sentence": "This bill does that, and acknowledges that Black lives can't wait until the next election,\" said Congresswoman Adams."}, {"senator": "Mark R. Warner", "party": "Democrat", "sentence": "Bringing increased testing resources and manual contact tracing along with the newest and best innovation to our most vulnerable communities is the American way,\" said Congresswoman Clarke."}, {"senator": "Cory A. Booker", "party": "Democrat", "sentence": "This legislation will finally offer that to the millions of the older Americans, individuals with disabilities, and dedicated workers who rely on nursing homes for their lives and livelihoods,\" said Congresswoman Schakowsky."}, {"senator": "Edward J. Markey", "party": "Democrat", "sentence": "\"With this funding, we can maintain regional transportation options and help localities like Taunton and Mansfield as they confront this unprecedented pandemic.\"\n\n\"From our pilots to our baggage handlers, the airline industry and our airports have been hit particularly hard by the COVID-19 pandemic,\" said Congresswoman Clark."}, {"senator": "Christopher A. Coons", "party": "Democrat", "sentence": "That is why we are fighting back with the one thing Donald Trump's policy lacks most: evidence,\" said Congresswoman Chu."}, {"senator": "Mark R. Warner", "party": "Democrat", "sentence": "This historic place deserves to be recognized and celebrated,\" said Congresswoman Wexton and Senators Kaine and Warner."}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "We owe them more than applause at 7pm,\" said Congresswoman Maloney."}, {"senator": "Margaret Wood Hassan", "party": "Democrat", "sentence": "I will keep working with our Congressional Delegation to support Granite Staters who are hardest hit as this unprecedented pandemic continues.\"\n\n\"In addition to the tremendous health consequences, the coronavirus pandemic has also had a far-reaching impact on the economic security of Granite Staters, particularly vulnerable individuals like those living in public housing,\" said Congresswoman Kuster."}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "I'll continue to work with the New Hampshire Congressional Delegation to get our state the resources and support it needs to combat this pandemic.\"\n\n\"Hospitals across New Hampshire are doing a remarkable job responding to this unprecedented health crisis, but revenue shortfalls as a result of this pandemic have put immense financial strain on these facilities, forcing many to furlough workers,\" said Congresswoman Kuster."}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "It's especially reckless to be refusing to do so during a national pandemic emergency, when more and more parents are at home with their infant children,\" said Congresswoman Schakowsky."}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "Economic aid should go to those who have the most need, not the most greed.\"\n\n\"Across our country, we are seeing inspiring stories as we deal with the biggest economic and health crisis our nation has ever seen,\" said Congresswoman DeLauro."}, {"senator": "Lamar Alexander", "party": "Republican", "sentence": "Medical Security Act to ensure Americans have access to the medication, devices, and medical supplies they need at all times--especially during a global health crisis,\" said Congresswoman Underwood."}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "This legislation, along with our efforts to stop the global price war, are part of our work to support our domestic energy producers and provide stability to global energy markets.\"\n\n\"Domestic production of oil and natural gas is essential to our national security, our economy, and our energy future, including our ability to drive innovation and production of cleaner energy,\" said Congresswoman Fletcher (TX-07)."}, {"senator": "John Hoeven", "party": "Republican", "sentence": "\"Domestic production of oil and natural gas is essential to our national security, our economy, and our energy future, including our ability to drive innovation and production of cleaner energy,\" said Congresswoman Lizzie Fletcher."}, {"senator": "Cory Gardner", "party": "Republican", "sentence": "The changes we are proposing will ensure that the Trump administration's new guidelines for this budding industry will allow it to continue to grow, not only here in Colorado, but elsewhere around the country as well,\" said Congresswoman DeGette."}, {"senator": "Michael B. Enzi", "party": "Republican", "sentence": "Currently, Medicare beneficiaries who suffer from hemophilia or other bleeding disorders are often denied care from skilled nursing facilities,\" said Congresswoman Dingell."}, {"senator": "David Perdue", "party": "Republican", "sentence": "The strong bipartisan, bicameral support for this bill shows it is a commonsense response to the COVID-19 pandemic, and I urge all my colleagues to join us in this effort.\"\n\n\"We need all hands on deck to address this generational crisis,\" said Congresswoman Finkenauer."}, {"senator": "James Lankford", "party": "Republican", "sentence": "This move by the President will provide some relief and ensure that our rural communities will continue to receive the care they need.\"\n\nCongresswoman Kendra Horn (OK-05): \"America's rural hospitals have faced extreme financial hardship made worse by the COVID-19 crisis,\" said Congresswoman Kendra Horn (OK-5)."}, {"senator": "Josh Hawley", "party": "Republican", "sentence": "The CCP must be held to account for what the world is now suffering.\"\n\nSenator Josh Hawley\"The Communist government of China knowingly withheld critical information needed to combat the spread of the Chinese-born COVID-19 and to this day continues to spread lies and disinformation on the origin of the deadly virus,\" said Congresswoman Stefanik."}]