[{"senator": "Jacky Rosen", "party": "Democrat", "sentence": "…even gotten more expensive. But if you ask Donald  Trump, he says affordability--and I am going to quote here--is a  ``hoax.'' It is a ``con job by the Democrats.'' He even said--and I am  going to quote again--``prices are coming down tremendously . . .  inflation is stopped.''\n\nI am going to ask everybody here at home today: Do you think  affordability…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698816/9999"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…legislation that will  only drive up monthly power bills even further. It is quite the  departure from President Trump's campaign promise to cut American power  bills in half. He said that during the course of the campaign that in  the first year he would cut power bills in half. Instead, they keep  climbing.\n\nRight now, thanks to the congressional Republicans'…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697094/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…Twenty years ago, we probably had other alternatives.\n\nNow, we absolutely must put a price on carbon. And so I, when I met  with the Europeans and the Brits and the Australians, said to them: You  have our last lifeboat. Don't let Trump sink it for his fossil fuel  donors. What is the last lifeboat? It is called the carbon border  adjustment mechanism. It…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697077/climate-change"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…democracy. While I believe  many of Donald Trump's actions merit impeachment, I believe that the  critical first step needs to be taken by this body as soon as possible.\n\nAs I said before, I don't expect it to happen because MAGA  Republicans have completely abdicated their constitutional  responsibility to exercise any shred of oversight on this out-of-…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692929/holding-power-accountable"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…entirely of locally raised  revenue. While Congress has the authority to legislate on local D.C.  matters, it does not have a duty to do so.\n\nIn Federalist No. 43, James Madison said of D.C. residents: ``A  municipal legislature for local purposes, derived from their own  suffrages, will of course be allowed them.''\n\nIn 1953, the Supreme Court held that:…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692373/district-of-columbia-federal-immigration-compliance-act-of-2025"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…had tears in my eyes as I listened to Luke and Brett Ganger telling  us for the first time in public in such a setting what it was like to  lose their sister Renee Good.\n\nThey said:\n\nIn the last few weeks, our family took some consolation in       thinking that perhaps Renee's death would bring change in our       country. It has not.\n\nYesterday's hearing,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699650/9999"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…Commission (SEC)       stated that meme coins have ``no use.'' Other cryptocurrency       observers deride memes generally as without value. Former       aide Anthony Scaramucci said Trump's effort demeans broader       cryptocurrency efforts, calling it ``ldi Amin level       corruption.'' Another commenter said that the Trump meme ``is       effectively…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693839/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…agree that this isn't how we  should be spending our time.\n\nMr. Speaker, I was trying to keep track, and I lost track at some  point, but my colleague from Minnesota I think said the word ``Biden''  eight times, if I am not mistaken.\n\nMr. Speaker, if you couple that with references to the prior  administration, then that jumps up to 12 or 13.\n\nIt is…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694889/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…hardworking people, firemen, nurses, you name it, pay on their wages is  wrong.\n\nWe need to have a tax system that collects from people who can afford  it, as well. Pope Leo said in an interview recently: ``CEOs that 60  years ago might have been making four to six times more than what the  workers are receiving,'' now, it is ``600 times more than what…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695620/billionaires-dont-pay-their-fair-share-of-taxes"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…the election rules.\n\nHow many times have we heard the President openly question our  election system and why the Federal Government shouldn't run elections?\n\nAt one point, he said:\n\n[I]f you think about it, the state is an agent for the       federal government in elections. I don't know why the federal       government doesn't do `em anyway.\n\nWell, let…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700066/9999"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…It doesn't have to be this way, and both Vladimir  Putin and Donald Trump seem to agree. Both Presidents have spoken  favorably of extending New START.\n\nIn September, Putin said: ``Russia is ready to continue to adhere to  the central quantitative restrictions under the START treaty for 1 year  after February 5, 2026,'' if the United States reciprocates.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699036/expiration-of-new-start"}, {"senator": "Richard Neal", "party": "Democrat", "sentence": "…8.5 percent  of their income for coverage.\n\nNow, Republicans think that people can afford increased premiums by  37 percent, and that is what they are proposing today. They said 2  weeks ago that they had a healthcare plan that they wrote on Friday  night. As I noted at the time, it was held together by bubble gum and  Elmer's Glue. By the way, Democrats…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698788/breaking-the-gridlock-act"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "…bathroom in  Mar-a-Lago. The way that the administration has handled this entire  calamity has been equally as dangerous.\n\nSecretary of Defense Hegseth straight-up lied. He said there was no  classified information on the chat, that he didn't share attack plans,  and that no troops were put in harm's way.\n\nThen, there is our Director of National Intelligence,…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689418/reckless-incompetence-of-signal-chat-put-servicemembers-at-risk"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…his friends and himself at the expense of  American families.\n\nHe has used trade to prop up Argentina's President before a key  election because that country's President has said nice things about  President Trump, hardly the basis for a fundamental economic decision  affecting the life of every American.\n\nAnd he has used trade to punish the entire country…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696448/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…childhoods apart with absolutely no response from this place.\n\nSo that is the starting point. And I think I heard my colleague from  Georgia talking about how Martin Luther King had said that inequality  in healthcare is the most shocking and inhumane of all. And I wonder if  one of the things he was thinking is that it is shocking and inhumane,  in the richest…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689543/h-con-res-14"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…insolvency.\n\nNow, you would think that this would compel Newsom and the  legislature to immediately roll back this disastrous experiment, yet  when Governor Newsom was asked, he said that rolling back this policy  was ``not on my docket.'' Let's be very clear: Saving Medicaid in  California is not on Governor Newsom's docket.\n\nFortunately, we are fighting…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…won't do it.\n\nLook at how they have superglued themselves to their temporary COVID  subsidies that they themselves concocted and stamped an end date on, as  my colleague has said.\n\nI suppose all they know how to do is prop up a failed program that is  littered with waste, fraud, and abuse, like cancerous lesions.\n\nDon't take my word for it. Just look…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698305/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…could not solve that problem unless we passed legislation. We needed  to--this Chamber was delinquent. There was nothing that could be done  until we took action. As it has been said, we didn't need to take  action. We needed a different President.\n\nMr. PERRY. Tens of thousands.\n\nMr. PERRY. None of mine.\n\nMr. PERRY. I don't want to speculate either. I will…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698925/ice-under-attack"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…served together in the State legislature, and one year, on my  birthday, he stopped by my office, not with a card but with a bag of  rice and just a little Post-it Note that said: Happy birthday.\n\nI brought that bag home, gave it to my mom, and she made Portuguese  rice pudding for him, and I brought it back. The next week, he brought  me another bag…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698738/9999"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…there, but  wait until you see the cumulative price. I hope my colleagues can heed  the warning, but if the past is prologue, I won't be holding my breath.\n\nMr. Speaker, I have said it before. They are cutting and pasting and  saying the same things over and over again. Fear-mongering is beneath  the dignity of this body. That is not what we are here to…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689054/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers-providing-for-consideration-of-hr-defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "David Rouzer", "party": "Republican", "sentence": "Mr. ROUZER. Mr. Chairman, listening to our friends on the other side  of the aisle reminds me of what one of my favorite Presidents of the  United States said, Mr. Reagan. He said: You know, our friends on the  other side of the aisle, they know so much that just isn't so.\n\nMr. Chair, I am proud to support this much-needed effort…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698028/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…has had to deal with a Congress or Members of  Congress who really wanted to be the Commander in Chief of the Armed  Forces of the United States. The Founding Fathers wisely said that that  power should lie in the hands of the Commander in Chief, the President  of the United States.\n\nOver many, many years, Presidents have used military force to protect…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697780/9999"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…opposing Central Bank Digital Currency, but we should deal with that  fully here.\n\nOn March 8, 2023, in a dialogue with Chairman Hill, Federal Reserve  Chairman Jerome Powell said that they would need congressional approval  for a retail CBDC, but he went on to explain that you could have a  layered CBDC. They are building just that at the Federal Reserve.…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693835/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Mario Diaz-Balart", "party": "Republican", "sentence": "…the  United States.\n\nMadam Speaker, we would not be here debating this if it wasn't for  the brilliant, persistent leadership of the full committee chairman. A  lot of folks said that we would never get here and that we would end up  with another long-term CR, which would have been so detrimental to our  country, but I will tell you that it was   Tom…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699572/consolidated-appropriations-act-2026"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…increase on the American people.\n\nNow, there have been a lot of crazy allegations made about what the  budget actually did or did not do, while some of our colleagues have  said that the American people don't want to see their tax cuts  extended, which is false, and I don't know who they are talking to. And  then they claim that the extension would…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689668/government-funding"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…Everybody ought to do like I do and have  my buddy, Tommy Seiler, manage my portfolio of $11,000. I do not trade  any individual stocks. It is all a mutual fund.\n\nPresident Trump said if Congress passed a bill banning stock trading  for Members of this body, he would sign it. I say let's give him that  opportunity. Let's first see if Congress has the guts…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690429/the-first-100-days"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…having a checks-and- balances system. You are putting one single judge above the American  public's popular vote, let alone the electoral college.\n\nI am so glad that this House said that we are going to move forward  in a thoughtful way and not allow, again, one single judge, who is not  elected by the people, to decide the policies of this government.…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690709/constitutional-crisis"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…Speaker, I rise today in strong support of my bill, the Promoting  Cross-Border Energy Infrastructure Act and in strong opposition to what  my colleague from New Jersey just said about this bill, much of which  is just simply not true.\n\nEnergy is the foundation of everything we do. It powers our homes,  fuels our farms, and drives our economy. If we…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695691/promoting-cross-border-energy-infrastructure-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…ICE of ``terrorizing people.''\n\nPennsylvania Governor Josh Shapiro claimed ICE officers ``make our  neighborhoods less safe.''\n\nMinnesota Lieutenant Governor Peggy Flanagan said ICE officers caused  ``chaos and terror.''\n\nSenator Chuck Schumer declared that ICE does not belong in our  neighborhoods.\n\nSenator Tina Smith called ICE ``a clear and present…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698924/ice-under-attack"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…power to coin money and  regulate the value thereof, implicitly denying to the executive branch  or to the Fed the ability to do this without congressional authority.\n\nThat said, I think it is prudent to explicitly deprive the Fed of the  authority to do this for a variety of reasons.\n\nAs has been said, Americans' financial privacy is at stake here,…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693730/anti-cbdc-surveillance-state-act"}]