[{"senator": "John Hoeven", "party": "Republican", "sentence": "\"We worked hard to provide USDA with additional resources to help our farmers and ranchers through this tough stretch, including $9.5 billion in emergency funding specifically for our ranchers and other specialty producers,\" said Hoeven."}, {"senator": "John Hoeven", "party": "Republican", "sentence": "\"Today, and always, we remember the incredible sacrifices our servicemembers and country endured during World War II to preserve our freedom and liberties,\" said Hoeven."}, {"senator": "John Hoeven", "party": "Republican", "sentence": "\"Today's funds will support our state's efforts in protecting our water supply and help landowners reduce or prevent pollution from nonpoint sources,\" said Hoeven."}, {"senator": "John Hoeven", "party": "Republican", "sentence": "Energy Secretary Brouillette on managing global oil supply given that demand is so low due to the coronavirus pandemic,\" said Hoeven."}, {"senator": "John Hoeven", "party": "Republican", "sentence": "\"This appeals process is an important step toward protecting landowners' property rights,\" said Hoeven."}, {"senator": "John Hoeven", "party": "Republican", "sentence": "-Minot International Airport -- $2,753,046-Mott Municipal Airport -- $20,000-Pembina Municipal Airport -- $20,000\n\n\"This federal funding to the airports is designed to provide relief as they continue facing disruptions resulting from the COVID-19 pandemic,\" said Hoeven."}, {"senator": "John Hoeven", "party": "Republican", "sentence": "\"As North Dakota continues to grow as a hub of technology entrepreneurship, it's vital our students are educated and prepared to fill the jobs of the future, and cybersecurity plays a major role in this,\" said Hoeven."}, {"senator": "John Hoeven", "party": "Republican", "sentence": "We continue to work with HHS to urge them to ensure the remaining funds provided under the CARES Act, as well as the additional $75 billion for providers and hospitals Congress passed last week, are distributed in a timely manner and will assist providers in rural areas as well as providers that serve a high number of Medicaid patients,\" said Hoeven."}, {"senator": "John Hoeven", "party": "Republican", "sentence": "\"Our students and educators have been severely impacted by the pandemic and have had to work to overcome unexpected challenges,\" said Hoeven."}, {"senator": "John Hoeven", "party": "Republican", "sentence": "\"These funds will offer support to public transportation across the state as preventative measures are carried out to protect drivers and passengers during the COVID-19 pandemic,\" said Hoeven."}, {"senator": "John Hoeven", "party": "Republican", "sentence": "\"The Obama-era WOTUS rule was duplicative of state and local efforts, violated private property rights and would've imposed significant costs on a wide range of industries, like agriculture, energy production and construction,\" said Hoeven."}, {"senator": "John Hoeven", "party": "Republican", "sentence": "\"I join the President and my colleagues in the Senate in working to raise awareness about the crisis of missing and murdered Native American women and children,\" said Hoeven."}, {"senator": "John Hoeven", "party": "Republican", "sentence": "\"Our nation's cattle ranchers are facing real challenges,\" said Hoeven."}, {"senator": "John Hoeven", "party": "Republican", "sentence": "\"Today's funds will assist rural hospitals in North Dakota as they continue to provide quality care during the COVID-19 pandemic, and are important resources that will help support our rural health care providers as well as the patients and communities they serve,\" said Hoeven."}]