[{"senator": "Christopher Murphy", "party": "Democrat", "sentence": "Now, with this decision, our ability to fight coronavirus and other pandemics has been castrated,\" said Murphy."}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "I'm proud to be co-leading this resolution urging our participation in global efforts to address COVID-19,\" said Murphy\n\n\"I was dismayed when amid the devastating global coronavirus pandemic, the United States sat out a recent virtual conference to collaborate and raise funds to research, manufacture, and distribute possible coronavirus treatments and a vaccine."}, {"senator": "Christopher Murphy", "party": "Democrat", "sentence": "If reports are true that Linick was fired because he was investigating Secretary Pompeo, the Senate Foreign Relations Committee must get to the bottom of this immediately,\" said Murphy."}, {"senator": "Christopher Murphy", "party": "Democrat", "sentence": "I'll continue to monitor the situation, and do all I can in Washington to help Puerto Rico rebuild,\" said Murphy."}, {"senator": "Christopher Murphy", "party": "Democrat", "sentence": "I hope the Senate performs better today,\" said Murphy."}, {"senator": "Christopher Murphy", "party": "Democrat", "sentence": "I've been pressing the Trump administration to ban the federal government from using Chinese-made drones for two years, and finally, they are taking action,\" said Murphy."}, {"senator": "Christopher Murphy", "party": "Democrat", "sentence": "\"I will continue to work to solve the housing affordability crisis for all Hoosiers.\" \n\n\"The servicemen and women who put their lives on the line for our safety should not have to worry about becoming homeless,\" said Murphy."}, {"senator": "Christopher Murphy", "party": "Democrat", "sentence": "national security interests is enormous and potentially irreparable,\" said Murphy."}, {"senator": "Christopher Murphy", "party": "Democrat", "sentence": "\"We should be in Congress right now passing an emergency bill to make sure that the families here in Hartford who are going to have to take time off work, either because their businesses are curtailing their hours or because their kids are coming home from school, don't face economic ruin,\" said Murphy."}, {"senator": "Christopher Murphy", "party": "Democrat", "sentence": "The least we can do is honor our promise to provide a safety net for our most vulnerable,\" said Murphy."}, {"senator": "Christopher Murphy", "party": "Democrat", "sentence": "It's unconscionable that Houthi authorities would impose unacceptable restrictions on the ability of the United Nations and other aid organizations to deliver assistance to millions of people in need,\" said Murphy and Young."}, {"senator": "Christopher Murphy", "party": "Democrat", "sentence": "I'm grateful the NCAA has been at the table with Congress to help make reform a reality, and I hope to see serious, real proposals to compensate college athletes coming out of the NCAA,\" said Murphy."}, {"senator": "Christopher Murphy", "party": "Democrat", "sentence": "If recent events have shown us anything, it's that we desperately need independent watchdogs to safeguard our system of government from political abuse,\" said Murphy."}, {"senator": "Christopher Murphy", "party": "Democrat", "sentence": "\"This is a minute by minute crisis for families in Connecticut, and Congress needs to get real help down to families, hospitals, businesses, and feeding centers right now,\" said Murphy."}, {"senator": "Christopher Murphy", "party": "Democrat", "sentence": "\"It's absurd that incomplete background check records are literally destroyed if they're not finished within 88 days,\" said Murphy."}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "Instead, this is a moment where Congress needs to provide additional guidance and resources to schools to make sure that they comply with federal disability education laws despite the circumstances,\" said Murphy."}]