[{"senator": "Mike Thompson", "party": "Democrat", "sentence": "…who are a danger to themselves and others to have access to devices  that none of us believe that they should have access to.\n\nIf it was all about what Mr. Schweikert said, then why didn't the  majority take my amendment that I filed that would have taken the ghost  gun loophole issue off the table?\n\nIf it is about the tax code, then let's deal with…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700033/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…forcing Republicans to ignore  their own moral conscience when he blocks the Massie-Khanna bill.\n\nWhat is he hiding? Well, just in the last 24 hours, the card that  Trump said didn't exist was released. It is a disgusting, degrading  birthday card that Trump sent to Epstein calling him a pal and stating  that they shared a wonderful secret.\n\nMr. Speaker,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695109/providing-for-consideration-of-hr-streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-and-providing-for-consideration-of-hr-stop-illegal-entry-act-of-2025"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…because it addressed that shameful, sinful history such as to prevent  Texas from doing what the Justice Department alleges Texas did and what  the Texas Attorney General said: No, we didn't do that. We don't draw  lines like that.\n\nTexas proceeded to honor the request of the United States Justice  Department and proceeded to honor the request that it said…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694943/bloody-sunday-and-voting-rights-act"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…different rivers  converging, and she lived in the outskirts. She was a middle school  student. On the day that the bomb dropped, she was still ill, so much  so that her mother said she didn't need to go into the city center to  do her public service work. The middle schoolchildren were needed to  clean up the debris of the area around the downtown of Hiroshima.…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694115/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…point that we discuss immigration in such  crude and vulgar terms?\n\nAfter I left the White House, it leaked out what the President said,  and the White House denied it. They said it didn't happen. I said it  did. They said I am lying--to the point where two of my Republican  Senate colleagues went on television several days later and said that I  lied when…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697820/donald-trump"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…opinion shapers. They want to define people and define what you  say notwithstanding your having said something contrary to what they  would like to hear.\n\nThey said that I said he didn't have a mandate. I never said he  didn't have a mandate. I said he didn't have a mandate to cut Medicaid,  and I still stand by it.\n\nBy the way, it became something that…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697060/no-mandate-to-cut-medicaid"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…been censured by this House for the things that I  have done. I was in here, and I called to the attention of the  President that he had no right--I didn't say right. I said that he  didn't have a mandate, but I was, in essence, saying he had no right to  eliminate or to cut Medicaid. Then I went on to talk about Social  Security and Medicare.\n\nI was among…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692296/and-still-i-rise-denouncing-the-presidents-authoritar-ianism-and-recognizing-the-impeachment-warriors"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…on the head with a stick  that is held by this administration.\n\nRepresentative Ivey talked about what is happening with the  judiciary. In fact, this President actually said he didn't know if he  even had to uphold the Constitution. Then, this administration is going  to sue Justice Roberts. We have moved from three branches of government  to one branch…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690637/trumps-first-100-days"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…would not believe  the results. He ignored my advice, which was no surprise. He went ahead  with the election and had a disputed result. He claimed victory, which  others said didn't happen, and he did it again a few years  later. So he discredited himself in the eyes of the world community,  and his country continued to suffer.\n\nHundreds of thousands,…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698599/venezuela"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…was  historic. Seven Republican Senators voted to convict after seeing  overwhelming evidence.\n\nMitch McConnell also found the evidence completely convincing, but he  said that he didn't think the Senate has jurisdiction to try to convict  a former President, despite the fact that that contradicted two  centuries of precedent, and the Senate ruled on…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691349/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…building a better life for his wife  and two children.\n\nMaynor had dreams of one day owning a small business. He would say:  You had to triple your efforts to get ahead.\n\nHe said: It didn't matter what time or where the job was; you had to  be where the work was.\n\nMaynor's outlook reminds me of my own father, who worked as a  newspaper deliveryman and a…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689022/9999"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…that's lying. And that's       wrong for you to put lie(s) out there,'' Khalif said.\n\nReichert told the Union-Tribune she had not contacted any       of the providers; she said she ``didn't want to give any       appearance of harassment.''\n\nThe child care subsidy system has several procedures in       place to protect against fraud, McDougal said. Her…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699222/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…called the raid at Mar-a-Lago, where the FBI  reportedly searched the rooms of the First Lady and Barron Trump, a  miscarriage of justice. Of course, when the Times said that, they  didn't include my full tweet. They left out the beginning of the  sentence where I said: ``Based on the records'' those records showed  that the FBI agents had many concerns…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699769/whistleblowers"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…withdrawal that the Biden administration put  forth for purely political reasons. They stated in their reasoning that  it was to prevent mining. The Secretary, again, when asked said: I  didn't think there were critical minerals there.\n\nIn the biggest copper-nickel find in the world, she signs the PLO  that removes mining in the Superior National Forest, where…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699271/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…felony larceny,  breaking and entering; more than 5 years in prison; and 14 criminal  cases.\n\nHis own family had warned of his history of schizophrenia. His own  sister said that ``he didn't seem like himself,'' when he was released  from prison. He assaulted his sister, and now that guy is roaming the  public.\n\nHis release from this incident was conditioned…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695203/people-are-sick-and-tired"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…$1.9 million Federal grant to ``improve objectivity and diverse  viewpoints'' last year. This is despite the fact that NPR's CEO  recently testified, as our colleague said, that she didn't witness any  bias at the organization. Then why the need for the Federal grant?\n\nThe problem with the Public Broadcasting Act is that it lacks an  enforcement mechanism,…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693717/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Darrell Issa", "party": "Republican", "sentence": "…the Court ruled, to no  surprise to this Congressman, that the President has the right to  dismiss probationary employees, even though an activist judge stayed  that and said that he didn't have that right, that somehow everyone  else can get rid of probationary employees, including the last  administration that summarily dismissed immigration judges on…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689711/no-rogue-rulings-act-of-2025"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…than  ever before.\n\nYou can look at the southern border. In a matter of months, President  Trump completely fixed the Biden border crisis. The President was right  when he said we didn't need more laws. We just needed a new President,  one who would enforce the laws.\n\nIn October, there were just over 11,000 apprehensions at the southern  border. The same…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698427/unanimous-consent-requests-the-calendar"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "…the  window; then the responsibility of scrutiny goes out the window because  it is one team versus the other team, with nobody looking out for the  American people.\n\nAs I said, I didn't intend to get up and talk today. I don't know  that I feel any better for it. But we have an opportunity today-- today--to knock out this obstruction by the leader of…", "date": "2025-08-02", "source_url": "https://justfacts.votesmart.org/public-statement/1694711/9999"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…not solve that problem unless we passed legislation. We needed  to--this Chamber was delinquent. There was nothing that could be done  until we took action. As it has been said, we didn't need to take  action. We needed a different President.\n\nMr. PERRY. Tens of thousands.\n\nMr. PERRY. None of mine.\n\nMr. PERRY. I don't want to speculate either. I will leave…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698925/ice-under-attack"}]