[{"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…And over this fake  excuse that there is a huge fentanyl problem, 0.2 percent, they are  going to dump enormous new expenses on American families.\n\nPeople have called this a sales tax, and it kind of is because what  it does is it raises prices. It raises prices because the money that  the Federal Government takes in has to be recovered, and it gets  recovered…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689472/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…you cannot abuse your emergency powers to hurt one of the finest  relationships in the world; and you cannot drive up prices, eliminate  jobs, and put in place a national sales tax that experts now predict  will altogether--the tariff tax--cost the average family nearly $2,000  per year.\n\nAnd they are seeing it every day in their grocery bills. They…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696446/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Greg Landsman", "party": "Democrat", "sentence": "…sell.  Americans have watched their hard-earned savings vanish as the markets  have tanked every day since the announcement.\n\nTrump has now unilaterally placed the highest sales tax on Americans  in the history of this country.\n\nThe impact? Higher prices across the board. The average family is  expected to pay an extra $4,000 this year alone. They cannot…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689748/tariffs-lead-to-highest-sales-tax-on-americans-in-history"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…Treasury.\n\nNow, that person who imports and has this additional tax now to deal  with will do what you will see when you buy something and you are in a  State that has a sales tax. You will see that the item costs X amount  of dollars. If it is something that costs $40,000 and there is a 10  percent sales tax, then you will see that there is a tax…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690093/protecting-the-american-dream"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…Congress, not the Executive. But  President Trump finds Congress an inconvenience, and he has decided to  take both of these powers onto his own shoulders by imposing a national  sales tax--that is what his global tariff regime is--without any vote  in Congress, purely on his own say-so, and to engage every nation in  the world in a trade war on his own say-so…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690547/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…and who have held that status continuously for       the past 15 years, forging deep roots in our community. These       Haitian neighbors work legally, pay income, sales and other       tax, and pay into our Social Security system;\n\nMore newly-arrived Haitian families escaping recent and       ongoing waves of intolerable unrest in Haiti, seeking…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699703/community-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…Codes creates obstacles for these 1,200  businesses, including confusion for customers and suppliers about their  location and challenges in daily transactions like assigning sales tax  due to a ZIP Code with a name designated to a separate county--not even  a separate city, a separate county.\n\nIn fact, Green identified $614,000 in unpaid taxes alone in…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693900/single-unique-zip-codes-for-certain-communities"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…than America's and Canada's. And after a year and a half of  failed trade war, Americans have not gotten liberation. Instead,  Americans have been saddled with a national sales tax. That is what  Trump's tariffs are, a national sales tax on Americans.\n\nThe average family--America, listen to this--the average family,  American family, is paying $2,000…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696451/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Sam Liccardo", "party": "Democrat", "sentence": "…of living that is choking millions of  American families.\n\nInstead, in this administration's first 100 days, I have seen this  Republican majority capitulate to the largest sales tax in U.S. history  in the form of Trump tariffs, costing the average American family  perhaps $4,900 annually at the checkout counter. I have seen this  Republican Congress…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690476/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…wind up with a product to encourage more work, encourage families, or  whether we wind up with a bill designed to encourage State governments  to raise the income tax or sales tax, or encourage local governments to  raise their property tax.\n\nI am going to be very disappointed. It would certainly be a defeat  for, I guess what I will call, traditional…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690921/big-beautiful-bill"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…status as an unincorporated area  has caused confusion for the Postal Service and for tax purposes.\n\nFor example, North Tustin residents are subject to the city of Santa  Ana's sales tax, despite not being represented or eligible for services  or a vote in the local elections.\n\nProviding North Tustin with a unique ZIP Code will create certainty  for residents…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693903/single-unique-zip-codes-for-certain-communities"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…tomorrow the consequences  of indiscriminately slapping tariffs on every one of our major trading  partners.\n\nThis is not ``Liberation Day'' but ``Tax Day''--a new national sales  tax that will harm the imports we buy from virtually every country and,  because of the countervailing tariffs, harm our exports.\n\nA tariff is a tax, and tonight we will take…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689488/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "…insurance because their ZIP Code  inaccurately places them in a higher risk area.\n\nThink of the local government already stretched thin that loses  millions of dollars in vital sales tax revenue because transactions are  mistakenly attributed to neighboring jurisdictions.\n\nThese challenges are not unique to Colorado. Across the Nation, over  65 communities,…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693904/single-unique-zip-codes-for-certain-communities"}]