[{"senator": "Mike Thompson", "party": "Democrat", "sentence": "…article on procurement\n\nGuadalupe County Sheriff's Office\n\nCity of Dallas Police Department\n\nDFW Airport Department of Public Safety                                     UTAH\n\nSalt Lake City Police Department\n\nKanab City Police Department\n\nCedar City Police Department                                   VERMONT\n\nSt. Albans…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700033/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…McGovern, no relation, but a leader on arms  control issues. I was able to accompany him to a debate with William F.  Buckley at Yale University titled ``Resolved: That the SALT Talks Are  in the Interests of U.S. National Security.'' Of course, the SALT talks  were the Strategic Arms Limitation Talks.\n\nGeorge McGovern closed the debate--and I remember…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694117/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…Congress recognized, rightfully  so, that air quality in West Virginia or Wyoming is different than it  is in Southern California, that there are fewer cars on the road in  Salt Lake City than there are in Los Angeles, and because California  was, and still is, the center of innovation in the United States.\n\nYet in 2025, it appears that Republicans…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691454/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…is equally empowered to help safeguard that digital future,  particularly as the cybersecurity threats we face grow more complex and  more dangerous by the day.\n\nLast year's Salt Typhoon cyberattack was one of the most  sophisticated and malicious efforts to infiltrate our  telecommunications networks. It was a sobering reminder of how  vulnerable our…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693498/ntia-policy-and-cybersecurity-coordination-act"}, {"senator": "Robin Kelly", "party": "Democrat", "sentence": "…these past few years.\n\nOn day one in the Oval Office, President Trump shut the doors of the  White House Office of Gun Violence Prevention. Since then, he continues  to pour salt into injury after injury.\n\nThe Department of Justice terminated over $66 million in grants that  were already designated by Congress to community violence intervention  programs.…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691753/national-gun-violence-awareness-month"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…mass-produced, could help reduce its       dependence on lithium.\n\nSodium-ion batteries are made from a sodium compound called       soda ash, which can be produced using table salt. Unlike       lithium, sodium is easily accessible everywhere. The U.S. has       also been working on developing this technology.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694959/highlighting-advances-in-chinese-electric-vehicle-technology-and-the-need-for-american-investment-in-battery-technology"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…wisely recognized back then that West Virginia and Wyoming are  different than California; and their air quality is different; there  are significantly fewer cars on the road in Salt Lake City than there  are in Los Angeles; and because California was and still is seen as the  innovation center of the United States.\n\nSo we earned the right to set California…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691583/hj-res-88"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…there?\n\nUnneeded tariffs will cause prices to rise more on everything. Just  wait. Cars will go up $9,000 to $12,000 a vehicle. Costs of grain will  go up. The cost of road salt, potash, oil, gasoline will skyrocket  dangerously. Let me state plainly that 25 percent tariffs on Canada are  foolish.\n\nThe people and businesses of our region and the industrial…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688376/tariffs-on-canada-are-foolish"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…and adopters of technology define the marketplace, drive  innovation, and reap the economic benefits. That is why America must  lead here.\n\nMoreover, as we have seen with the Salt Typhoon cyberattack, foreign  adversaries often see our communications networks and devices as the  entry points to disrupt our daily lives and conduct espionage  campaigns.…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693507/promoting-united-states-wireless-leadership-act-of-2025"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…exchanges,  notifications, and onsite inspections that give us direct insight into  Russia's nuclear forces.\n\nNew START followed a long line of arms control agreements, from SALT  to START I to SORT, that helped reduce the global nuclear arsenal from  the Cold War highs of more than 70,000 weapons to fewer than 13,000  today. These agreements were supported…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699037/expiration-of-new-start"}, {"senator": "Laura Gillen", "party": "Democrat", "sentence": "…States, even as the  cost of living continues to rise. These families deserve real relief.  It is what the President promised when he came to my district and said  he would get SALT back.\n\nWell, it is time to deliver, Mr. President.\n\nAt this very moment, the majority is advancing a reconciliation bill  that fails to meaningfully lower our taxes for Long…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691111/bring-back-full-salt-deductibility"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…been made public when it was first written in 2022,  Congress would have had ample time to demand mandatory cybersecurity  standards for phone companies in time to prevent the Salt Typhoon  hacks.\n\nCISA and the Federal Bureau of Investigation have confirmed that the  Chinese Government hacked multiple phone companies and accessed vast  troves of sensitive…", "date": "2025-07-28", "source_url": "https://justfacts.votesmart.org/public-statement/1694259/telecom-cybersecurity-transparency-act"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…happens in a laboratory. It can happen in a  congressional office. You don't need a big space for this.\n\nThe conversion of the uranium hexafluoride to what is called green  salt, and the green salt to metal, is something that happens in a small  industrial building. It can happen anywhere in any city in Iran, and it  will be really hard to tell. We…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694113/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "Mr. Speaker, I rise in support of H.R. 906, the Foreign Adversary  Communications Transparency Act. At the end of last year, we learned  that Salt Typhoon, a cyber espionage operation backed by the Chinese  Communist Party, infiltrated several American telecommunications  networks to gain access to detailed information…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690266/foreign-adversary-communications-transparency-act"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…NSA has another job, that of Commander of U.S. Cyber  Command. The demands of this job are mind-boggling. The cyber threat to  the United States cannot be overstated. And, as SALT TYPHOON  demonstrated, our adversaries have succeeded in inflicting serious  damage to U.S. national security. The Commander of CYBERCOM needs to  have a sophisticated understanding…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700213/nomination-of-ltg-joshua-m-rudd"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…refinancing. In 10  years, 45 percent of all U.S. tax collections, all of it, is interest.\n\nYet, Mr. Speaker, you have Members here running around here saying: I  need more money for SALT. I want actually more money for this program.  I want more money for this.\n\nOkay. Bring us ideas on how we modernize spending, how we can reduce  costs by technology, by better…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690586/economic-anxiety"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…roots in North Carolina's Fifth District, and  I am confident that many of our area's future, as well as the current  leaders, will look up to him as a shining example of a salt-of-the- earth public servant who acts upon principle.\n\nI consider myself immensely fortunate to know Dan. I can attest to  this simple fact: His previous service to the Nation…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688244/recognizing-dan-driscoll"}, {"senator": "David Rouzer", "party": "Republican", "sentence": "…individuals, the Lumbee people are a core part of my  district and the great State of North Carolina. I am honored to be  their advocate in Washington.\n\nI know firsthand that they are salt-of-the-earth, hardworking  patriots who deserve access to Federal services like their Tribal  counterparts.\n\nWe must take legislative action to fix this problem and amend the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695245/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…Missouri  River.\n\nWhy do I bring up these sad memories from long ago?\n\nUtah still celebrates the day when they finally arrived at a place of  safety, the valley of the Great Salt Lake, on July 24, 1847. July 24 is  a State holiday for Utahns. Those hardy, resilient pioneers, carrying  with them the sick and desperately poor from burning Nauvoo, found…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694022/july-24th-utahs-state-holiday"}, {"senator": "Andy Ogles", "party": "Republican", "sentence": "…today.\n\nReports from Federal agencies and private-sector partners over the  past several years have shown that Chinese state-sponsored cyber  actors, including Volt Typhoon, Salt Typhoon, and other PRC-affiliated  groups, have been targeting the systems and services that Americans  rely on every single day.\n\nIn committee, there has been testimony that…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696757/strengthening-cyber-resilience-against-state-sponsored-threats-act"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…encourage  more children, there are people who want to change the tax code to  encourage local governments and State governments to raise taxes.\n\nThere is a provision called the SALT provision in which they want to  make tax deductible State and local taxes. They are already, to a  degree, tax deductible, but there are people who want to help the  wealthier…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690921/big-beautiful-bill"}, {"senator": "Laurel Lee", "party": "Republican", "sentence": "…significant resources and a deep understanding of  the essential systems that keep our country functioning.\n\nGroups associated with the PRC, including those known as Volt  Typhoon, Salt Typhoon, and others, have directed their attention toward  the networks that deliver power, water, communications, transportation  services, and other foundational systems relied…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696758/strengthening-cyber-resilience-against-state-sponsored-threats-act"}, {"senator": "Nathaniel Moran", "party": "Republican", "sentence": "…that, he has been a strong and effective leader for Green Acres since  he arrived in 2019.\n\nI am proud to call him my friend and proud that he dedicated his life  to being salt and light in this lost and dark world.\n\nTo God be the glory for the great things He is doing through the  Gossetts and Green Acres Baptist Church in Tyler, Texas. We welcome…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690047/welcoming-guest-chaplain-dr-michael-gossett"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…Here is something they  ought to be run down for, so I hope they pay a little more attention.\n\nThe next thing I would like to point out is what the Republicans do  with the SALT deduction. There are a variety of changes in the tax code  that we could make that would affect people's behavior. Because tax  rates are so high, any change in the tax code…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692064/monitoring-big-beautiful-bill-provisions"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…$5,000 exemption. Nevertheless,  there is no time in life when people are more financially strapped than  when they have young children.\n\nI am strongly opposed to the so-called SALT Caucus of people who  desperately want to have a greater deduction for State and local taxes.  These people are, as a practical matter, looking to encourage their  Governors,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691328/the-big-beautiful-bill"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…Now, I can't think of anything more unusual, and I can't think of a  bigger threat than a chemical warfare waged against the United States  of America. Any President worth his salt, any commander-in-chief, would  be derelict in their duty if they didn't use every tool at their  disposal to stop it.\n\nFor my President to expect our neighbor from the north…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699974/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…119th Congress, and this is going to be a key piece.\n\nDemocrats will say over and over again that this is just a tax break  for the billionaires. Mr. Speaker, when you cap SALT like the  Republicans did, that only hurts wealthier folks. I hate to bring them  that news. I believe it was Bernie Sanders who was criticized by The  Washington Post--again,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690427/the-first-100-days"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…facilitates information sharing and the advancement of  important issues.\n\nLast fall, we saw one of the most significant attacks on our Nation's  communications networks in the Salt Typhoon, which is publicly reported  to have been carried out by Communist China.\n\nAgainst that backdrop, it is critical that we continue efforts to  strengthen existing government…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693435/communications-security-act"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…great-grandfather taught  in a one-room schoolhouse in West Virginia, and her mom is a retired  kindergarten teacher.\n\nNow, teaching eighth grade U.S. history at Northwest Middle School in  Salt Lake City, Ms. Posey brings history to life through project-based  learning. Her students have earned honors at regional and State  national history day competitions.\n\nShe is…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692425/sayre-posey-utahs-state-teacher-of-the-year"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…District and the gentleman from Ohio's First District.\n\nIn recent years, we have seen a rise in large-scale cybersecurity  attacks that put Americans at risk. Attacks like the Salt Typhoon have  directly impacted the communications of public officials, including  President Trump and Vice President Vance.\n\nWhile mobile service providers take numerous steps…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693423/understanding-cybersecurity-of-mobile-networks-act"}]