[{"senator": "Alex Padilla", "party": "Democrat", "sentence": "…Congress recognized, rightfully  so, that air quality in West Virginia or Wyoming is different than it  is in Southern California, that there are fewer cars on the road in  Salt Lake City than there are in Los Angeles, and because California  was, and still is, the center of innovation in the United States.\n\nYet in 2025, it appears that Republicans want…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691454/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…recognized back then that West Virginia and Wyoming are  different than California; and their air quality is different; there  are significantly fewer cars on the road in Salt Lake City than there  are in Los Angeles; and because California was and still is seen as the  innovation center of the United States.\n\nSo we earned the right to set California…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691583/hj-res-88"}, {"senator": "Mike Thompson", "party": "Democrat", "sentence": "…article on procurement\n\nGuadalupe County Sheriff's Office\n\nCity of Dallas Police Department\n\nDFW Airport Department of Public Safety                                     UTAH\n\nSalt Lake City Police Department\n\nKanab City Police Department\n\nCedar City Police Department                                   VERMONT\n\nSt. Albans…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700033/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "Mr. OWENS. Mr. Speaker, I rise today to recognize the outstanding  achievements of the Salt Lake Community College Cross Country Program-- a testament to the determination, resilience, and spirit of Utah's  student-athletes.\n\nIn Richmond, Virginia, at the National Junior…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690034/recognizing-the-slcc-cross-country-team"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…privilege of meeting with my constituents in  Utah's Third District. At the end of this district work period, I  participated in a business-focused event with members of the Salt Lake  Chamber to discuss the One Big Beautiful Bill Act and other industry- related issues.\n\nDuring this event, I was able to hear directly from local  businessowners and stakeholders…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694796/promises-made-promises-kept"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…taught  in a one-room schoolhouse in West Virginia, and her mom is a retired  kindergarten teacher.\n\nNow, teaching eighth grade U.S. history at Northwest Middle School in  Salt Lake City, Ms. Posey brings history to life through project-based  learning. Her students have earned honors at regional and State  national history day competitions.\n\nShe is…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692425/sayre-posey-utahs-state-teacher-of-the-year"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "Mr. STAUBER. Mr. Speaker, I move to suspend the rules and pass the  bill (H.R. 2876) to confirm the use of certain non-Federal land in Salt  Lake City, Utah, for public purposes, and for other purposes.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:                                 H.R.…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698135/university-of-utah-research-park-act"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…million;\n\nNew York City, $1 billion cut that summer;\n\nNorman, Oklahoma, $865,000;\n\nOklahoma City, $5.5 million;\n\nPhiladelphia, $33 million;\n\nPortland, Oregon, $16 million;\n\nSalt Lake City, $5.3 million;\n\nSan Francisco, $120 million;\n\nSeattle, Washington, $69 million;\n\nWashington, D.C., $15 million--we know about the crime that has  happened in this city;…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691031/expressing-support-for-local-law-enforcement-officers"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "Mr. KENNEDY of Utah. Mr. Speaker, in 2027, beginning in April and  ending in October, the Salt Lake Temple, which is to my left, will be  open for public tours.\n\nAll are welcome, with 3 million to 5 million visitors expected during  this historic event that will be important…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698141/visiting-salt-lake-temple"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…Biden administration, the vast majority of those  charged with illegal reentry already had criminal records. In Utah, we  have seen the consequences firsthand.\n\nThis July in Salt Lake County, a 43-year-old Mexican national was  sentenced for drug trafficking and illegal reentry. He had been  deported three times before. When he was arrested, he carried…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695360/stop-illegal-entry-act-of-2025"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…Missouri  River.\n\nWhy do I bring up these sad memories from long ago?\n\nUtah still celebrates the day when they finally arrived at a place of  safety, the valley of the Great Salt Lake, on July 24, 1847. July 24 is  a State holiday for Utahns. Those hardy, resilient pioneers, carrying  with them the sick and desperately poor from burning Nauvoo, found…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694022/july-24th-utahs-state-holiday"}]