[{"senator": "George Latimer", "party": "Democrat", "sentence": "Mr. LATIMER. Mr. Speaker, I rise to recognize and salute the dynamic  faith community of Bethesda Baptist Church in New Rochelle as they  welcome their new pastor, Reverend Horace Sanders, Jr., and his wife,  Lady Katrina Sanders,…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698604/recognizing-bethesda-baptist-church-and-pastor-horace-sanders-jr"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…pastors who played a role in social justice efforts in  the city of White Plains and in Westchester County.\n\nNinety years young and still growing in membership and in love, we  salute Calvary Baptist Church for its important role in the life of our  community.", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697280/calvary-baptist-church"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "Mr. LATIMER. Mr. Speaker, today I rise to salute the work of Barry  Hoffman, founder and artistic director of the Symphony of Westchester,  which began in 1984.\n\nBarry has blended together 50 outstanding music professionals…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696750/saluting-the-work-of-barry-hoffman"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…requiring that the AG and  other Federal officials issue regular reports on attacks on police  officers, aggression against police officers, and on officer mental  health.\n\nI salute Mr. Fry, a freshman to this body, for his stewardship of  this bill. The collection of this information is important and useful,  but the mere passive gathering of data does…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691320/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…public safety.\n\nIn honor of Pretrial, Probation and Parole Supervision Week 2025,  whose theme is ``Heroes Behind the Mission: Transforming Lives,  Enhancing Public Safety,'' we salute all those who have chosen this  important career. In the District of Columbia, we especially thank the  employees of the Court Services and Offender Supervision Agency for…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693630/recognizing-the-nations-community-supervision-professionals"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…Council, leads the school as executive director with exceptional  experience and vigor.\n\nJennifer Ciavirella is school principal, leading a talented team of  professionals. We salute Amani Charter Public School on its 15th  anniversary. May there be many more years to come.                   Saluting the Life of Mayo Peter Bartlett\n\nMr. LATIMER. Mr. Speaker,…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696952/amani-public-charter-school"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…aisle, amazing  things can happen because the American people are kind and good and  decent.\n\nMr. Speaker, it is an honor to have worked with Congressman Massie. I  particularly salute the courage of Representatives Marjorie Taylor  Greene, Lauren Boebert, and Nancy Mace. None of this would have been  possible without their courage in standing up on the petition…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696898/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision-providing-for-consideration-of-h-con-res-denouncing-the-horrors-of-socialism-providing-for-consideration-of-hr-unlocking-our-domestic-lng-potential-act-of-providing-for-consideration-of-hr-researching-efficient-federal-improvements-for-necessary-energy-refining-act-providing-for-consideration-of-hr-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-providing-for-consideration-of-hr-district-of-columbia-cash-bail-reform-act-of-and-for-other-purposes"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…American Jewish community.\n\nThe resolution calls on elected officials, faith leaders, and civil  society leaders to condemn and counter all acts of anti-Semitism.\n\nI also want to salute Mr. Schmidt, the distinguished Member from  Kansas, for his powerful endorsement of this idea.\n\nThe resolution also goes on to urge the House to take ``all possible  steps…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691194/calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism-and-educate-the-public-on-the-contributions-of-the-jewish-american-community"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…service is unwelcome and that one identity matters more than  what they have done, what they have sacrificed, and what they fight  for.\n\nMr. Speaker, I reject that message. I salute every transgender  servicemember. I thank them. I see them. I honor them. I will not stop  fighting for a country that is truly worthy of their service.", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693974/transgender-americans-serve-with-honor"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…the blood that  keeps them alive. This month and always, I thank them.             Saluting the Work of Port Chester Historical Society\n\nMr. LATIMER. Mr. Speaker, I rise to salute the work of those who are  leaders and members of the Port Chester Historical Society. Their  volunteer efforts have kept alive the memories and stories of the years  past…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698776/recognizing-national-blood-donor-month"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…EPA's misguided plan and will continue to  join Senator Whitehouse and my other colleagues in pushing back against  this administration's harmful agenda.\n\nOnce again, let me salute Senator Whitehouse for his leadership on  this critical--indeed, this existential--issue.", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689115/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-gross-proceeds-reporting-by-brokers-that-regularly-provide-services-effectuating-digital-asset-sales"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…is a breakfast to be held this Sunday,  December 14, in Castle Royale in Yonkers, where State Senator Nick  Spano is chairman with Tom Meier and Gail Burns as co-chairs.\n\nWe salute their good work and the individuals and groups honored at  this year's breakfast, including Dr. Iyad Annabi, who is receiving a  Lifetime Achievement Award.\n\nMr. Speaker, I…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697681/operation-santa-claus"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…New Rochelle Business Improvement District.\n\nMr. Speaker, in future speeches, I will recognize leaders in the  Bronx and along the Hudson River communities of Westchester. We salute  them all.", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693116/recognizing-local-chambers-of-commerce"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…the only IV maternity care hospital in central  Ohio. It includes 16 labor and delivery rooms and 51 NICU rooms. It is  in partnership with Nationwide Children's Hospital. We salute Columbus  because it is stronger and healthier because of this investment.", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698915/congratulating-dr-john-j-warner"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…own.\n\nI want to say to every single public employee who works in a Social  Security office across this country that they are patriots. We thank  them for the work they do. We salute them. We salute them for their  patriotism.\n\nMeanwhile, the Social Security Administration says they are not  closing any offices; but the so-called Department of Government…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699878/protecting-social-security"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…securing  the benefits they have earned.\n\nI proudly commend retired USAF Technical Sergeant Martha Socorro  Ybarra, of Waco, Texas to her friends, family, and colleagues, and  salute her service to the Air Force, her country and community of Waco  by awarding her with a Congressional Veteran Commendation.", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696274/recognizing-technical-sergeant-martha-socorro-ybarra-usaf-retired-with-a-congressional-veteran-commendation"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…his heartfelt tribute to his hometown of Bessemer,  Michigan, in his book: ``Bring One Home: A Memoir of Boyhood,  Basketball, and Hometown Spirit.''\n\nThis book is not only a salute to Bessemer, but the tough, resilient  communities across Michigan's Upper Peninsula and middle America.\n\nMr. Speaker, 60 years ago this week, the Bessemer Speedboys  basketball…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699192/recognizing-thomas-pelissero"}, {"senator": "Maria Salazar", "party": "Republican", "sentence": "…an educational program.\n\nVoices Against Brain Cancer has turned tragedy into purpose. As we  close out Brain Cancer Awareness Month, let us remember Gary  Lichtenstein and salute his family that has worked so hard to find more  effective treatments and a cure for this terrible disease.", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691692/recognizing-brain-cancer-awareness-month"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…VFW Post 5896 and when he was able,  frequently attended veterans' events. In his later years, he would rise  from his seat, hold onto his walker to stand at attention and salute  when the colors were presented or when Taps was played. In 2015, he  joined a group of local veterans on an Honor Flight to Washington, D.C.  to visit veterans' memorials.…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699480/recognizing-oscar-leroy-wade"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…Throughout it all, the men and women of the 55th  Wing have never wavered in their mission to fly, fight, and win. It is  my great honor to recognize their achievements and salute their history  today. Once again I say, happy birthday to the men and women of the  Fightin' Fifty-Fifth.", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689070/recognizing-the-55th-wing-85th-birthday"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…these men and women have represented  America's best.\n\nMr. Speaker, today we honor the men and women who have worn the  uniform of the National Guard, past and present. We salute their  sacrifice, their courage, and unwavering dedication to serving the  American people through war and peace, disaster and recovery, and every  moment in between.\n\nHappy…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698094/9999"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…love for God, country and community that I proudly commend  retired USAF Lieutenant Colonel Charles H. Wagamon of Huntsville, Texas  to his friends, family, and community and salute his service by  awarding him the 2025 Congressional Veteran Commendation.", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696278/recognizing-lieutenant-colonel-charles-h-wagamon-usaf-retired-with-a-congressional-veteran-commendation"}, {"senator": "Maria Salazar", "party": "Republican", "sentence": "…look at North Korea, and look at Iran.\n\nWhat a coincidence that, today, President Trump is receiving in the  White House the mayor-elect, Mr. Mamdani, from New York City. I salute  the President for receiving Mr. Mamdani because he won fair and square,  and that is the way democracy works.\n\nLet me just tell you something. Knowing very well how Fidel…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697160/denouncing-the-horrors-of-socialism"}, {"senator": "Hal Rogers", "party": "Republican", "sentence": "…essential resources are available for  families, including educational programs, healthcare initiatives, and  recreational opportunities for patients who need them the most.\n\nI salute the Brother's Keepers Motorcycle Club of Kentucky for  providing a beacon of hope for families across the Commonwealth, going  far beyond the call of duty to help those in…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694746/tribute-in-honor-of-brothers-keepers-motorcycle-club"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…but we  can continue to do our duty to remember.\n\nMr. Speaker, on National Vietnam War Veterans Day and every day, we,  the people of the United States, with a grateful heart salute those who  endured great dangers at the hands of the enemy and lost in service to  our Nation.", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689202/saluting-vietnam-veterans"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…people worldwide  to complete the I-10 End to End Ride alone.\n\n``Fearless'' isn't just her nickname. It is a legacy she is building  with every mile.\n\nMr. Speaker, today we salute Andrea Smith Brown for her service not  only in uniform but also her continued devotion to others by showing  what it means to serve, heal, and keep moving forward.…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692753/recognizing-uga-2025-boren-award-winners"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…his heartfelt tribute to his hometown of Bessemer,  Michigan in his new book: Bring One Home: A Memoir of Boyhood,  Basketball, and Hometown Spirit. His memoir serves as a salute to the  town of Bessemer and speaks to the character of communities across  Michigan's Upper Peninsula when facing profound economic hardship from  the decline of iron and…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699253/recognizing-mr-thomas-l-pelissero-for-authoring-bring-one-home"}, {"senator": "Cory Mills", "party": "Republican", "sentence": "…made  to keep Old Glory flying.\n\nOn military bases, it is truly sacred. It is the symbolic altar of  the Nation.\n\nDuring morning and evening colors, all work ceases as troops salute  her raising and lowering. In battle, our forces carry her, wearing them  proudly on their sleeves. She serves as the final blanket for soldiers  who come home, having given…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695264/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Hal Rogers", "party": "Republican", "sentence": "…His coaching  success and business expertise have been of great value to Kentuckians,  building an endearing and longlasting fan base that I am honored to be  a part of. I salute Wayne for investing in the lives of countless  student athletes and giving Eastern Kentucky so much to be proud of.", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696267/tribute-in-honor-of-wayne-martin"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…servicemembers who served in  Vietnam.\n\nMr. Speaker, we all know someone who served in Vietnam. They are our  friends, our family, our neighbors. It is long overdue that we salute  them, but it is never too late to show our gratitude. May God bless our  Vietnam war veterans today and always, and welcome home.", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689330/national-vietnam-war-veterans-day"}]