[{"senator": "Jim McGovern", "party": "Democrat", "sentence": "…liberals and conservatives we do have a mutual interest  in survival. If nuclear weapons are ever used in this current day, then  nobody wins.\n\nWhat we are talking about is the salvation or the destruction of our  civilization from nuclear death. The stakes could not be higher, and  yet what is shocking to many of us is the lack of urgency and the lack  of…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694117/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "Mr. KAINE. Mr. President, I rise today to recognize May 12 to May 18,  2025, as National Salvation Army Week.\n\nFounded in 1865, the Salvation Army has been unfailingly committed to  serving those in need without discrimination. For more than 150 years,  the Salvation Army…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690965/national-salvation-army-week"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…periods in Ukrainian history.\n\nAs the 270th successor to the Apostle Andrew, His All-Holiness has  been a voice for those without a voice and a champion of peace, love,  and salvation. Deeply connected to the Sacred Theological School of  Halki through his studies and teachings, he continues to provide  guidance to the faithful.\n\nOn a per capita basis,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695442/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…congregation through  blessings, baptisms, weddings, and offered comfort to grieving  families. Under their dynamic leadership, First Monumental became a  beacon of hope and salvation.\n\nAs the great Agriculture Chemist George Washington Carver once said,  ``How far you go in life depends on your being tender with the young,  compassionate with the aged,…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692741/in-memory-of-overseer-roosevelt-carter-i"}, {"senator": "Cindy Hyde-Smith", "party": "Republican", "sentence": "…want to also recognize the extraordinary contributions of volunteer  organizations--we certainly feel better when we see them pull up-- including national groups like the Salvation Army, the American Red  Cross, Samaritan's Purse, and Christ In Action, as well as countless  local organizations whose help has been invaluable to our State.\n\nThese accolades…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699701/9999"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "…destiny, that that would somehow impact how you lived your life on  Earth.\n\nAnd for somebody who taught the Pauline epistle so beautifully,  emphasized every single Sunday God's salvation by His grace through  faith alone, not by anything we do, it was a good reminder that if you  live with one eye on your eternal destiny that you have not earned but  rather…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696152/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "Mr. CLINE. Mr. Speaker, please join me in recognizing the Salvation  Army of Harrisonburg and Rockingham County. For over 100 years, they  have remained dedicated to sharing the Gospel of Jesus Christ while  providing care and support to…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689009/recognizing-salvation-army-of-harrisonburg-and-rockingham-countys-100th-anniversary"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…Rotary International, the Texas Silver- Haired Legislature, the Reserve Officers Association, Veterans of  Foreign Wars, and the American Legion. Ralph also assisted with  Salvation Army and Red Cross drives to support those in need. As a  result of his outstanding work, he was recognized as Celina's Citizen  of the Year several times and received the…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690225/recognizing-congressional-patriot-award-recipient-ralph-odell"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…emergency response capabilities and supporting those  around him. As a driver and Emergency Medical Responder with the  Roanoke ambulance service and as a staff member with the Salvation  Army, he has extended his commitment far beyond EMA. His dedication and  leadership were further recognized in 2017 when he received the  Volunteer of the Year Award from…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697208/congratulating-mike-oltman-on-his-retirement-with-the-woodford-county-emergency-management-agency"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…local schools. Additionally,  Kathy has been actively involved with the New Port Richey VA Center,  offering her time weekly to support veterans. She also volunteers with  the Salvation Army of Pasco County's Domestic Violence Program each  week, helping survivors navigate the legal process by reviewing and  drafting petitions for Injunctions for Protection…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691195/recognizing-kathy-logue"}, {"senator": "David Valadao", "party": "Republican", "sentence": "…experiences.\n\nThe students, faculty, and families at Hanford Christian are  dedicated to serving their community. Every year, they contribute to  food drives and volunteer with the Salvation Army and Gleanings for the  Hungry. Their community service impacts the community all year long,  including during the holiday season when families donate blankets to  the…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698331/recognizing-hanford-christian-school"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…Opelika Chamber of Commerce. He has served  as past director of Opelika Dixie Youth Baseball, Opelika Main Street,  Opelika Utilities Board, Opelika Arts Association, Lee County Salvation  Army, Achievement Center Easter Seals, Chattahoochee Council Boy Scouts  of America, Chattahoochee Historical Commission and Boys & Girls Clubs  of Greater Lee County.…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696582/recognizing-the-retirement-of-mayor-gary-fuller"}]