[{"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…bird flu and plant diseases, and the increase in global       mortality from cuts to vaccines, HIV prevention, malaria,       maternal care, newborn care and water and sanitation       programs.                    top line impact of global health cuts\n\nOur 50-country network for stronger surveillance to deadly       diseases from bird flu to swine…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691139/us-global-health-programs"}, {"senator": "Brad Schneider", "party": "Democrat", "sentence": "…children to Auschwitz, 1,000 miles       east, a horrific journey of several days and nights. They       were packed into freight cars like animals. No water. No       food. No sanitation. No windows. No place to sit let alone       room to lie down. All this was in the heat of August. Upon       arrival, all who survived the journey were murdered in gas…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690804/rose-helene-spreiregen"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…here at Union  Station in Washington, D.C. The taxpayers are footing a million dollars  a day for these National Guard members to pick up trash. They are doing  the job that sanitation workers would be doing in the District of  Columbia.\n\nWe are talking about $770 billion for Medicare. I talk to young  people in my district, Mr. Speaker. They say: ``I am…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695040/better-is-possible"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…headgate  and ditch under the John Dingell, Jr. Conservation, Management, and  Recreation Act.\n\nThe Bolts Ditch Act would expand this authority to the Eagle River  Water and Sanitation District and the Upper Eagle Regional Water  Authority as eligible entities.\n\nUnder this new authority, they would be eligible to receive a permit  from the Secretary of…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693455/bolts-ditch-act"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…day-to- day management of a large county.\n\nLet's stop the ideological foolishness. Place this proposal to  downgrade careers where it belongs: in the department of garbage and  sanitation. Let's get back to grownup, serious government that  understands the problems in America and addresses those problems.", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697491/bringing-attention-to-anti-education-agenda"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…and strengthens  maternal and child health programs.\n\nThe bill includes close to $7 billion for development programs  focused on economic resilience, education, water and sanitation, and  disaster mitigation. And there is a reason why we have funded these  programs for decades. Yes, our partners want them. Yes, they employ  tens of thousands of Americans.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699751/9999"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…to combat HIV, tuberculosis, and malaria.\n\nIt restores funding Trump canceled for economic and development  assistance projects tackling issues like education, water and  sanitation, food security, including through university partnerships in  red States and blue States that Trump had eliminated, and more.\n\nIt rejects his efforts to eliminate all funding…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699453/appropriations"}, {"senator": "Grace Meng", "party": "Democrat", "sentence": "…further protect American taxpayers from  waste, fraud, and abuse perpetrated by this administration.\n\nIt maintains important directives on education, conservation, water,  sanitation, and hygiene programs. It reins in the Trump administration  and reasserts congressional oversight on the uses of funds by  increasing transparency requirements. It includes…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699050/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…local entrepreneurs. Under  his leadership, the BID supports more than 300 businesses along a mile- long stretch of Myrtle Avenue, providing essential services including  sanitation, public safety, beautification, and marketing that fosters a  robust and welcoming commercial corridor.\n\nMr. Renz's tenure is marked by numerous accomplishments. He  spearheaded…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693397/recognizing-theodore-m-renz"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…Tuckahoe, a village of over 6,000 people in one  compact square mile.\n\nTuckahoe local government has all of the responsibilities of any  municipal entity: police protection, sanitation, parks and recreation,  planning and land use functions, and more. Her leadership as mayor,  chairing the village and the board, and providing policy direction and  oversight…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697468/recognizing-omayra-andino"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…described  well by the chairman and the ranking member that, in effect, would  ensure that a number of different water authorities--specifically, the  Eagle River Water and Sanitation District and the Upper Eagle Regional  Water Authority--would have access, as the town of Minturn already  does, to the Bolts Ditch structure.\n\nIt builds on legislation that…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693453/bolts-ditch-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…Conservation,       Management, and Recreation Act (Public Law 116-9) is amended       by inserting before the period at the end the following: ``,       the Eagle River Water and Sanitation District, a Colorado       Special District, or the Upper Eagle Regional Water       Authority, an authority organized under the laws of the State       of Colorado''.\n\nMr.…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693454/bolts-ditch-act"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…of Christ.\n\nBefore moving to Knoxville, Reverend Middlebrook played a crucial  role in the civil rights movement. He was a close friend of Dr. King.  He joined the Memphis sanitation workers strike, and that was a labor  and civil rights movement where sanitation workers protested unsafe  working conditions and low wages. He was at the Lorraine Motel…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697620/reverend-harold-middlebrook-post-office-building"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…would rename a  post office in Knoxville, Tennessee, for Reverend Harold Middlebrook.\n\nReverend Middlebrook played a crucial role in the civil rights  movement during the sanitation workers strike in Memphis and later  founded the Dr. Martin Luther King, Jr. Commemorative Commission in  Knoxville.\n\nReverend Middlebrook was president of the Bolivar Human…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697619/reverend-harold-middlebrook-post-office-building"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "…services,  including public safety through police and fire departments, essential  infrastructure support via a robust public works department, access to  clean water and sanitation utilities, and vibrant recreational and  library services. These offerings reflect the city's deep commitment to  enhancing quality of life for its residents.\n\nFruitland…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693999/recognizing-the-100th-anniversary-of-the-city-of-fruitland-park-florida"}]