[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…would it set  them back? And, most important, what was the risk that such a bombing  campaign could escalate into all-out war?\n\nDays passed, no briefings. Even after last Saturday's strikes, still  no briefing. Not until yesterday did the administration come to  Congress to answer the most basic of questions, and only after  suggesting, it was reported,…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693120/motion-to-discharge-sj-res-59"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "Mr. SCHUMER. Mr. President, we convene after a weekend of both horror  and grief. Saturday afternoon, as students were studying for finals, a  masked gunman opened fire inside a classroom at Brown University. Nine  students were injured, and two were killed. The…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698130/shooting-at-brown-university-and-shooting-in-sydney-australia"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…country of engaged, informed Americans. He prefers those who  salute on command, like for his North Korean-style, taxpayer-funded,  wasteful $45 million birthday bash this Saturday.\n\nReject these dangerous DOGE cuts and defend the right of the American  people to know.", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692535/rescissions-act-of-2025"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…milestone in the life  of Derrick Thompson, city council president of the city of Mount Vernon  on his 50th birthday celebrated this week. He will be doing the  celebrating on Saturday night of his journey so far. He is a graduate  of the Mount Vernon Public School System and now a professional in  education in that very same school system. Twice-elected…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699911/recognizing-derrick-thompson"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…Dutyfirst, Columbia Mental Health, Embark Behavioral  Health, Bechtel, and the County of Fairfax joined AFSP in providing  resources and encouragement to those walking this past Saturday.\n\nMr. Speaker, on behalf of Virginia's 11th Congressional District, I  ask you to join me in extending my gratitude to the American Foundation  for Suicide Prevention National…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696049/recognizing-the-18th-annual-out-of-darkness-walk"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…lived in humble service and bold leadership, and  his memory will continue to inspire generations to come. A funeral  service to celebrate his remarkable life will be held on Saturday,  January 31, 2026, at The Gethsemane Worship Center International in  Albany, Georgia.\n\nBishop Williams was born in Dougherty County, Albany, Georgia, to the  late Roosevelt…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699461/in-memory-of-bishop-dr-frederick-williams-sr"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…to       fruition.\n\nIn 2008 the society moved again, to leased space on the       llth floor of an old building at 75 Varick Street. Over eight       hours one late-spring Saturday, its entire collection,       cocooned in bubble wrap and packed in more than 400 plastic       crates, was transported to the new location as quietly as can       be done…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697235/priceless-coin-collection-heads-to-the-toledo-museum-of-art"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…accident  happened. Accidents happen.\n\nI remember one such accident when my son, just before his third  birthday, grabbed my curling iron and burned his hand. This was a  Saturday. After a trip to the emergency room--we were in a rural county  that didn't have a burn unit--they said: Well, you can either go home  to Richmond, a 3-hour drive, and on…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697649/restoring-enhanced-premium-tax-credits"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…two topics, one after  the other, healthcare and then tariffs.                                  Healthcare\n\nMr. President, open enrollment will begin across the country on  Saturday. Many have already received notice of new sky-high premiums,  including, by the way, notices that went out to my fellow Vermonters.  Many across the country will log on to…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696453/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "Mr. PETERS. Mr. President, on Saturday, America witnessed another  horrific tragedy in Minneapolis when Alex Pretti was shot and killed by  Department of Homeland Security law enforcement agents.\n\nBy all accounts--all…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699402/9999"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…Nation.\n\nMy district, Alabama's Seventh Congressional District, will honor  Juneteenth with a host of activities. The NAACP in Tuscaloosa will kick  it off with a parade on Saturday and a luncheon on Thursday. In  Birmingham, we will have a variety of events including a unity  breakfast on Friday hosted by DA Danny Carr and the League of  Gentlemen.…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692430/2025-juneteenth-major-league-baseball-events-in-birmingham"}, {"senator": "Brad Schneider", "party": "Democrat", "sentence": "…President afraid of?  What are you hiding? You and the administration are shirking your duty  to provide Members of Congress a timely and complete classified  briefing about Saturday's U.S. strike on Iran, on the intelligence that  justified it, on the legal justification, on the objectives, and on the  consequences.\n\nMr. Speaker, we should not have to…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692935/cancellation-of-iran-classified-briefing"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "Mr. DOGGETT. Mr. Speaker, Saturday was a great day for progress in  Texas, from Houston to Fort Worth. For almost a year after the tragic  death of our late colleague, Sylvester Turner, the citizens of the…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699521/welcoming-the-honorable-christian-d-menefee-to-the-house-of-representatives"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…shocking increases, whose stories are attached to my written  statement.\n\nI also want to alert Members of the House that this new continuing  resolution (CR) released this past Saturday November 8, 2025, which  funds the government to January 30, 2026, has a serious gap in funding  for the Columbia-class submarine program. This program, which has been  referred…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696732/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…so terrible that he was found guilty and sentenced to 45 years in  prison.\n\nThen what happened? Well, you won't believe it. Donald Trump pulls  out his pardon pen.\n\n[O]n Saturday, Mr. Trump said in a statement to the New       York Times that ``many friends'' had asked him to pardon Mr.       Hernandez. ``They gave him 45 years because he was the…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697242/the-economy"}, {"senator": "John Thune", "party": "Republican", "sentence": "…reelection, President Trump made clear that a peaceful  resolution was possible if Iran agreed to give up its nuclear weapons  ambitions. Iran's leaders refused.\n\nAs a result, on Saturday, the President ordered precise and limited  strikes to go after Iran's nuclear program, consistent with this long- held national security imperative. I am grateful for the…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692769/iran"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…responsibility and  heavy burden a President has is the determination of when to engage the  Armed Forces of our Nation. Such decisions can both cost and save  lives.\n\nThis past Saturday, President Trump directed our military to respond  to a growing threat that Iran could weaponize nuclear material and  deliver a nuclear weapon. With escalating tensions between…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693123/motion-to-discharge-sj-res-59"}, {"senator": "David Kustoff", "party": "Republican", "sentence": "Mr. KUSTOFF. Mr. Speaker, I rise today to honor the life and legacy  of Frederick W. Smith, who left us this past Saturday, June 21, 2025,  at the age of 80.\n\nMr. Speaker, if I were to stand and speak at this podium all day, I  would barely be able to scratch the surface of Fred Smith's  extraordinary…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692825/remarkable-life-and-legacy-of-frederick-w-smith"}, {"senator": "Morgan Luttrell", "party": "Republican", "sentence": "…going from a starting gate to go-to-the-bathroom-on- your-pants, fast hitting 20-foot jumps with no seatbelts, airbags, or  bumpers; just man on machine.\n\nLast weekend on Saturday, Anaheim I, the first race of the series  went off. In the 250 class, Max Anstie got first; Chance Hymas got  second; Ryder DiFrancesco got third; and last year's champion,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699070/recognizing-2026-monster-energy-supercross-series"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…what our adversaries dictate.\n\nMr. WALBERG.  I say that as a gentleman from  Michigan.\n\nMr. WALBERG.  As a Member coming from the  Wolverine State, I congratulate him on Saturday's victory.\n\nMr. Speaker, H.R. 1005, the CLASS Act, is a critical step in limiting  foreign influence in our classrooms. Too often, foreign funding comes  with strings attached--maybe…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697409/combating-the-lies-of-authoritarians-in-school-systems-act"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…the local sports teams closely.\n\nHe loved spending time with his children and taking his grandchildren  on tractor rides around the farm. He loved his wife, Bev, and their  Saturday night dates.\n\nI send my deepest condolences to the Welu family as they navigate  through this difficult time. I will be keeping Melvin, his family, and  the community of Milroy…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694029/paying-respects-to-senator-bruce-anderson"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…U.S. agriculture has been built through the ingenuity,  hard work, and the strategic application of science and technology.\n\nI was proud to help open the 110th Farm Show on Saturday. It is  always an honor to meet farmers from across the Commonwealth and learn  about how they continue to ensure agriculture remains Pennsylvania's  number one industry.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699123/pennsylvania-farm-show-recap"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "Mr. HARIDOPOLOS. Mr. Speaker, on Saturday, December 20, 2025,  families from across Brevard County will come together at Fred Poppe  Regional Park in Palm Bay, Florida, to celebrate the Seventeenth Annual  Family…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698220/recognizing-the-seventeenth-annual-family-christmas-extravaganza"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "Mr. BAUMGARTNER. Mr. Speaker, today I rise to recognize an inspiring  moment in our community, the Spokane Impact's first home match this  past Saturday at the HUB Sports Center in Liberty Lake.\n\nThe Spokane Impact is one of the founding teams of the Inspire Soccer  League, the first-ever national soccer league created specifically…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695809/recognizing-spokane-impact"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "Mr. CORNYN. Madam President, as the Presiding Officer will recall, it  was 2:30 in the morning on Saturday--just a few short hours ago, it  seems like--that the Senate voted to pass a budget resolution amending  the House budget resolution, the next important step to passing  President…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689668/government-funding"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…of Representatives. He was known for being a fair-minded,  commonsense legislator who worked with Members on both sides of the  aisle.\n\nFuneral services will take place on Saturday in Malvern,  Pennsylvania. Our thoughts are with his wife of 33 years, Nancy, his  four children, and all of his family.\n\nMay God bless Congressman Dick Schulze.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698746/moment-of-silence-for-congressman-richard-t-dick-schulze"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…Maduro's drug  trafficking.\n\nAnd what are the numbers? Was it 80,000 American lives lost since  2020 as a result of the poison that Maduro has forced into this  country? On Saturday, President Trump took bold action, and he took  action to protect the citizens of this great country.\n\nWe should celebrate the success in Venezuela. We should take great…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698571/venezuela"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…House floor to pay our  respects to Virginia Beach Police Department Officers Cameron Girvin  and Christopher Reese, who were killed in the line of duty in the early  hours of Saturday, February 22.\n\nTragically, our community lost two of our local heroes when a  cowardly criminal gunned down two of Virginia Beach's finest during a  routine traffic stop.…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687949/moment-of-silence-in-honor-of-cameron-girvin-and-christopher-reese"}, {"senator": "Roger Marshall", "party": "Republican", "sentence": "…maybe some potatoes, some new potatoes. And, yes, we put  bacon in the new potatoes, but all my grandparents lived a long healthy  life on those diets as well.\n\nYou know, on a Saturday night--I don't want to forget. Once or twice  a month, on a Saturday night, we would finish work early, at 7 or 8  p.m., and we would make homemade ice cream with that cream…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698680/9999"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "Mr. THOMPSON of Pennsylvania. Mr. Speaker, I rise to recognize  National Vietnam War Veterans Day, a time to honor the brave men and  women who served. This past Saturday, we marked the National Vietnam  War Veterans Day.\n\nMr. Speaker, 52 years ago, on March 29, 1973, the last U.S. combat  troops departed Vietnam, marking the end of direct…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689330/national-vietnam-war-veterans-day"}]