[{"senator": "Jim McGovern", "party": "Democrat", "sentence": "…that is 1 percent of our budget. So, please, do  not come down here and pretend as if this is a serious attempt to cut  funding.\n\nMr. Speaker, if you want to go after waste and save taxpayer money,  then count me in. Count me in. I wish my Republican friends would  express some concern about the fact that their President is spending  maybe up to $40 million…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692385/providing-for-consideration-of-hr-rescissions-act-of-2025"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…challenges. Our Graduate Medical Education bill will add  thousands of residency slots, creating a pipeline of qualified health  professionals to serve patients in rural America.\n\nOur Save America's Rural Hospitals Act takes important steps to  ensure that rural hospitals are fairly reimbursed for their services.  The Home Health Stabilization Act will allow more…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697076/observing-world-pancreatic-cancer-day"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…those polluting, expensive, fossil fuel plants have to come on at 80- plus megawatts of load to even begin to match the prices from 6 years  earlier.\n\nClean wind and solar power save consumers money. So when the Trump  administration says it is going to inhibit, hinder, injure clean energy  development, that is backing this back out of the grid. Now it starts…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696122/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…while  the Secretary of Defense is trying to cover up the most incompetent  national security leak I have ever heard of in my life, the Republicans  in the House are trying to save the American people from the scourge of  walk-in cooler and refrigeration efficiency standards.\n\nThat is right. We are here wasting precious debate time on the floor  of the…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689053/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers-providing-for-consideration-of-hr-defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…pretend the gallows outside this building were just  some kind of art installation.\n\nIt is insulting. It is a slap in the face to every officer who put  their body on the line to save ours. Here is the kicker: This majority  still hasn't even hung the plaque honoring those officers, a plaque  required by law--required by law. Instead of a sham committee,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694886/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…cruel, reckless, and careless. They  play fast and loose with America's credibility around the world.\n\nI urge my colleagues to vote yes on S.J. Res. 37 and join us in  trying to save the American economy and our credibility around the  world.", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689487/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…Nutrition.\n\nThis is a missed opportunity for America to be building goodwill in a  very unstable part of the world, one of many missed opportunities  because when we act to save the lives of starving children around the  world, we are not just doing the right thing morally, we are helping  make America stronger by building goodwill around the world.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695636/government-funding-and-healthcare"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…fact that with these big  bank mergers, they close down branch banking. They close down the banks  in the communities. Why do they do that? They do that because they want  to save money. Yet, what happens when they close down the bank?\n\nMr. Speaker, in many communities and in my own community, when banks  were closed down, all you had was the ATM. You…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691499/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…legislation such as the Black Maternal Health  Momnibus Act, which aims to expand access to healthcare, invest in  community-driven solutions, and promote policies that will save lives.\n\nBlack Maternal Health Week is not just a time for awareness but a  call to action. We must listen to the voices of Black mothers, amplify  their experiences, and enact…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688983/recognizing-black-maternal-health-week-in-santa-clara-county-california"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…thank Chairman Bilirakis for his partnership in this  endeavor, as well.\n\nMr. Speaker, I rise in strong support of H.R. 1479, the Hotel Fees  Transparency Act, to help families save money and to ensure that their  hard-earned vacations go as planned. I thank Representatives Kim,  Mullin, and Fry for partnering with me on this bipartisan legislation  that…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690197/hotel-fees-transparency-act-of-2025"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…inauguration, right here in this building.\n\nNo. 2, withdrew the United States from the World Health Organization.\n\nNo. 3, pulled the United States out of the Paris climate agreement to  save our planet.\n\nNo. 4, created DOGE.\n\nNo. 5, called to end birthright citizenship through an Executive  order, which is unlawful because it cannot override the Constitution of…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690442/trump-administration-first-100-days"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…OK, where  NOAA's Storm Prediction Center tracks severe weather and tornado  warnings. It is in Florida, where NOAA's National Hurricane Center  monitors incoming storms to save lives and mitigate property loss. It  is in Alaska, where scientists at NOAA's Fisheries Science Center work  to maintain healthy fish populations to support local fishermen.…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688171/national-oceanic-and-atmospheric-administration"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…number out there. Mr. Speaker, 90 percent of Americans  support universal background checks. If that is the standard, let's  pass a universal background check right now. Let's save lives from  senseless gun violence.\n\nRepublicans say that this bill will stop noncitizens from voting, but  as the ranking member from the Rules Committee pointed out, nonpartisan…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699937/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Jacky Rosen", "party": "Democrat", "sentence": "…That is why I introduced a resolution opposing these extreme  policies, reaffirming something the overwhelming majority of Americans  already know, and this is this: Vaccines save lives. Vaccines protect  kids. Vaccines protect every American, and every American deserves the  freedom to access them.\n\nThis is about the safety of our children. It is about…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695532/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "Ms. JOHNSON of Texas. Mr. Speaker, the SAVE America Act makes it  harder for Americans to vote. As a member of the Subcommittee on  Elections, my responsibility is to protect access at the ballot box,  not to restrict…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699934/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Anna Luna", "party": "Republican", "sentence": "…they are dying, or get married, then you have to show your  papers. In fact, in New York  City, Mr. Speaker, they were literally asking you for your COVID  passport.\n\nYet the SAVE America Act, a commonsense piece of legislation that  requires two things, voter ID, plus proof of citizenship, is being  labeled by people in the Senate and people in this…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700010/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…understand migratory patterns and  population changes. By expanding the program to all Great Lakes  hatcheries, we can improve fishing practices, increase efficiencies,  and save resources wherever possible.\n\nMr. Speaker, I urge my colleagues to support the Great Lakes Mass  Marking Program Act so that we can preserve our fisheries and be better  stewards…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693993/great-lakes-mass-marking-program-act-of-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…here is what  it will cost us over the 10-year window.\n\nThe whole point of this chart is to start to demonstrate so many of  the things we talked about here. We are going to save $1 billion. That  is a lot of money. We believe, annualized, we are going to borrow over  $6 billion a day. In the first quarter of the fiscal year, we are  borrowing over $8…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699257/debt-deficits-and-demographics"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…because we are not going to be spending taxpayer  dollars to have an LGBTQI program in the Western Balkans. I think our  relations with the Western Balkans will be just fine if we save that  taxpayer money and try to get spending under control in Washington.  They don't want to do it. At least we do.\n\n$5.1 million was to strengthen the resilience of lesbian,…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693719/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…While President Trump is hard at work securing our border, it is now  time for Congress to secure our elections from noncitizen voters. This  week, the House will vote on the SAVE Act, legislation that strengthens  our election laws by requiring proof of citizenship to vote in Federal  elections.\n\nThe SAVE Act also requires States to create a program…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689357/securing-our-elections"}, {"senator": "John James", "party": "Republican", "sentence": "…agree on fentanyl  and any direction on fixing this scourge is a step in the right  direction.\n\nMr. Chair, with this bipartisan legislation and action that we are  taking to save lives, I encourage all of my colleagues to support this  crucial legislation.", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691886/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…most impactful bills the Committee on Energy and Commerce  has worked on during my time in Congress. Simply put, we came together  to implement bipartisan policies that would save lives.\n\nGone are the days that substance abuse and addiction are a far off  problem that doesn't impact each one of our districts. Instead of  hearing the words: ``I know someone…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691887/support-for-patients-and-communities-reauthorization-act-of-2025"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…is a vital way to support mental well-being  and reduce the risk of suicide. National Suicide Prevention Month  reminds us that silence can cost lives, and conversation can save them.  Start a conversation today.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695065/promoting-hope-during-national-suicide-prevention-week"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Back to the math problem. If I am making someone unhappy, be mad at  the math, not me. Be mad at all the people who have never told you the  truth with a calculator.\n\nHow do I save my future? Remember, my little boy turned 3 years old  yesterday. I have a 9-year-old. Yes, they are adopted. It is a miracle.  My wife is my age. Yes, we have screwed up my…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693062/stop-bathing-in-folklore-and-start-bathing-in-math"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…and not stand  in the way of the American Dream.\n\nBack home in Missouri, I have seen exactly what these mandates do. A  Kansas builder showed that so-called green energy codes save homeowners  only about $125 a year but add more than $1,200 a year to families'  mortgages.\n\nIt is simple, folks. If a policy costs families more than it saves  them, it is…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698635/providing-for-consideration-of-hr-saving-homeowners-from-overregulation-with-exceptional-rinsing-act-providing-for-consideration-of-hr-affordable-housing-over-mandating-efficiency-standards-act-and-providing-for-consideration-of-hr-commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "…for the Committee on Armed Services I  report favorably the following nomination lists which were printed in  the RECORDS on the dates indicated, and ask unanimous consent, to save  the expense of reprinting on the Executive Calendar that these  nominations lie at the Secretary's desk for the information of Senators  .", "date": "2025-10-28", "source_url": "https://justfacts.votesmart.org/public-statement/1696426/executive-reports-of-committee"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…balance of my time.\n\nMr. STAUBER. Mr. Speaker, in closing, I would again commend my  colleague from Alaska (Mr. Begich) for working to pass meaningful  legislation that can save lives.\n\nI urge my colleagues to join me in supporting H.R. 3176, and I yield  back the balance of my time.", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698113/southcentral-foundation-land-transfer-act-of-2025"}, {"senator": "Maria Salazar", "party": "Republican", "sentence": "…Gary's  family started Voices Against Brain Cancer Foundation to raise money  and awareness for the fight against the illness. As its founder so  bravely states, ``I couldn't save the life of my son, but perhaps I can  save the life of others''.\n\nThe mission of Voices Against Brain Cancer is to find a cure for  brain cancer by financing scientific research…", "date": "2025-05-29", "source_url": "https://justfacts.votesmart.org/public-statement/1691692/recognizing-brain-cancer-awareness-month"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…battles, the  propaganda, the things that get said that are true or not true. My  argument for everyone here is that there is a way to pay for lots of  this. It still doesn't save us.\n\nAs a country, we borrow about $6 billion a day right now. Next year,  we are going to borrow about $7 billion. I am going to show you some  charts. In 9 budget years, we…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691811/actual-solutions"}, {"senator": "Richard McCormick", "party": "Republican", "sentence": "…foreign actor released a chemical agent that killed tens of  thousands of Americans, the response would be immediate, unified, and  decisive.\n\nWe can and must act immediately to save American lives.\n\nThis is not unprecedented. Every President in my lifetime, in my  adult lifetime, has used the military to this end, to protect the  people of the United States,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698247/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}]