[{"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…well as a country to lower  costs is telehealth, which allows people to see their providers faster  and more often, and even see specialized providers from out of State.  It saves time and money, and it is great for doctors, nurses, and  seniors.\n\nUnfortunately, we are heading toward a telehealth coverage cliff  because, on January 30, Medicare telehealth…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699204/ongoing-protests-in-iran"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…provides $11 in economic benefit for every dollar we invest. That  is not charity, it is infrastructure. NOAA's ocean observation system,  for example, drives economies and saves lives.\n\nCaptain Dan Jordan, a Columbia River bar pilot, sees this every day.  He said: ``Ships crossing the Columbia River bar face one of the most  dangerous harbor entrances…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691327/noaa-contributes-to-our-economy-and-well-being"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…consumers from footing the bill of Big Oil's  methane waste, paired with Federal funding to help big oil companies  reduce their waste.\n\nReducing methane waste in the atmosphere saves consumers money. It  protects local communities from pollution; and methane, as you know, is  a superpotent greenhouse gas.\n\nScientists agree that reducing methane is one of…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688145/methane"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…Washington, D.C. This  bill is another example of that. Republicans want to make it harder for  businessowners to save money through energy efficient appliances.\n\nEnergy efficiency saves people money. It is pretty straightforward.  It cuts costs. It cuts pollution. It encourages innovation.  Specifically, electric bills for walk-in refrigerators and freezers…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689260/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…treatment. This is a peanut-based paste that treats malnutrition,  doesn't need to be refrigerated, and can be shipped around the world.  You don't need to add water, and it saves the lives of children.\n\nEdesia Nutrition in North Kingstown, Rhode Island, is one of the  factories that produces Plumpy'Nut. From that factory alone, over the  last decade,…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691610/global-report-on-food-crisis"}, {"senator": "Robin Kelly", "party": "Democrat", "sentence": "…House seeking assurances that it will be protected. Do not listen  to the President's empty promises. Nothing in this bill protects  PEPFAR.\n\nIf I were to put it simply, PEPFAR saves lives. It has already saved  26 million lives. That is indisputable, and it should be enough to  continue to fund one of the most successful global health programs in  history.…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692543/rescissions-act-of-2025"}, {"senator": "Doris Matsui", "party": "Democrat", "sentence": "…linked air pollution to higher rates  of cancer, heart disease,  diabetes, cognitive decline, and, of course, respiratory conditions.  The evidence is overwhelming that clean air saves lives.\n\nIf my colleagues are like me and grew up in California, then Members  know the impacts of air pollution. I remember what it felt like to  breathe smog and particulate…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690489/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…actually promotes efficiency as has been stated. It  provides consistency to businesses and protects oil and gas companies  from that liability. Doing these surveys before drilling saves time and  money in the long run.  It is much more damaging to a company's bottom line to stop operations  suddenly when they find a shipwreck or artifacts.\n\nNobody gets everything…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688635/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological-resources"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…They are dumb because we all know that preventing health  emergencies, providing diagnoses, catching illnesses early, and  providing care and treatment early, in the long run, saves money for  all of us.\n\nIt is unforgivable that they decided to turn their backs on millions  of Americans, including their own constituents whose health and well- being is…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694385/9999"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…Their work  requires extraordinary compassion, resilience, and skill, as they  respond to heart-wrenching calls and messages with care and  professionalism. Their commitment saves lives and strengthens families  and communities across our Nation.\n\nFor 30 years, the National Domestic Violence Hotline has stood as a  beacon of hope--answering the call…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700099/recognizing-the-30th-anniversary-of-the-national-domestic-violence-hotline"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…and other goods will  rise significantly.\n\nWe are here today because Republicans now want to overturn a rule  that limits bank overdraft fees to $5, down from $35 or more, and saves  consumers $5 billion a year. Not surprisingly, more than 80 percent of  Americans, including Republicans, want to get these high overdraft fees  under control, yet Republicans…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689845/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…than a quarter of VA staff are veterans themselves. Cuts to the  programs that provide home loan assistance to veterans, even cutting  staff of the suicide crisis line that saves lives--for what? This  message does not say: Thank you for your service. This is a slap in the  face for those who have served.\n\nMy Democratic colleagues do not support these…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690327/cuts-to-va-benefits"}, {"senator": "Maggie Hassan", "party": "Democrat", "sentence": "…the workforce, and, in so  doing, make our economy stronger.\n\nThere is, of course, much more work to do to make healthcare more  affordable for all of our people. But Medicaid saves lives. Over the  course of the program's history, Medicaid has allowed hundreds of  millions of Americans who otherwise would be uninsured to live  healthier lives and to build…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689509/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…constitutional responsibilities.\n\nLet's be clear. This is not a budget fix. It is a dangerous retreat  from our role in the world. Foreign aid is just a sliver of our budget,  but it saves lives. It prevents wars, and it opens markets for American  businesses. It is a smart investment in our national security.\n\nAs we speak, Mr. Speaker, there are millions of…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693718/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…further erosion of our local media, the impoverishment of our  children's educational opportunities, and the dismantling of our  country's critical emergency infrastructure that saves countless lives  every year. I urge my colleagues to support these motions and reject  the legislation before us today.", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693642/hr-4"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…is named after a young nursing student in Georgia.  She was murdered by an illegal immigrant. She was just out for a jog.  We named the bill in her honor. The Laken Riley Act saves American  lives. It requires illegal immigrant criminals to be deported. It was  bipartisan legislation. And 12 Democrats voted with us to pass this  legislation, and it is…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688471/joint-session-of-congress"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…first  and foremost, and that is why reinforcing citizenship verification,  another commonsense step that the American people believe in, not only  protects the program but saves the taxpayers tens of billions of  dollars.\n\nYes, we are, reintroducing Clinton-era work requirements. One of the  most popular things Bill Clinton achieved in his Presidency,…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691514/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…24 goals and 26 assists.\n\nOn defense, Ronnie Frith, Brayden Hall, and Carson Garland combined  for over 120 takeaways and 180 ground balls, while goalie Richard Hof  made 125 saves. Face-off specialist Ryan Warren won nearly 70 percent  of his draws. Remarkably, seven players earned first team all-State  honors.\n\nI commend Coach George Revercomb, his…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693527/congratulating-central-high-school-womens-softball-team"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…our deepest condolences and prayers, we join our  beloved Kansas and Nation in mourning the lives lost. Psalms 34:18  reminds us: ``The Lord is close to the brokenhearted and saves those  who are crushed in spirit.''\n\nWe lift up the loved ones of the 67 lost souls and rest in the  knowledge that no matter the circumstances we are facing, God is always…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688371/expressing-condolences-to-the-families-friends-and-loved-ones-of-the-victims-of-the-crash-of-american-eagle-flight-5342-and-pat-25"}, {"senator": "Mario Diaz-Balart", "party": "Republican", "sentence": "…narcoterrorists are responsible for the deaths of  thousands of Americans every single year because of drugs. Every time  the U.S. eliminates one of these drug boats, it actually saves American  lives.\n\nLet's talk about what is actually going on. While there are no U.S.  troops, the men and women of the Armed Forces, what they are doing is  they have struck…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699368/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Maria Salazar", "party": "Republican", "sentence": "…The Hospital's LifeFlight Critical Care Transport Program, which  includes six ambulances, two helicopters, and fixed-wing jets equipped  for pediatric and neonatal patients, saves nearly 4,000 infants and  children annually across Florida, the Caribbean, and Central and South  America.\n\nFrom Miami to the Panhandle, from the Panhandle to Central and South…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696282/congratulating-nicklaus-childrens-hospital-on-its-75th-anniversary"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…putting our Nation back on a trajectory toward success and prosperity.  Passing this resolution is the first step in that process. This budget  doesn't betray the middle class. It saves the middle class, and it  empowers the middle class for a prosperous future.\n\nMr. Chairman, I support this resolution, and I encourage my  colleagues to do the same. This is…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688066/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…they need it. I can tell you folks in Louisiana do.\n\nLouisiana has benefited the most per capita in the BRIC's latest  round of funding, and I would argue that this actually saves tax  dollars for the rest of the country because the BRIC Program helps  prevent against flooding, flooding that may occur after a big rain  event or after a hurricane. And…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690105/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "…the U.S. Coast Guard is essential to  protecting our Nation's maritime borders from threats like illegal  drugs, illegal immigration, and transnational crime. The Coast Guard  saves American lives and ensures that commerce flows smoothly at our  ports.\n\nThe Coast Guard Authorization Act of 2025 is bipartisan legislation  that Senator Cantwell and I negotiated…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688519/coast-guard-authorization-act-of-2025"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…health factors and life stressors converge to create an  experience of hopelessness and despair.\n\nMr. Speaker, suicide is preventable. Increasing access to crisis  resources saves lives. Mental and behavioral health research saves  lives. Ending the stigma surrounding suicide saves lives.\n\nPrioritizing self-care is a vital way to support mental well-being…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695065/promoting-hope-during-national-suicide-prevention-week"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…America,  as our great President says, where taxpayers, not illegal immigrants,  are put first. It eliminates taxes on tips and overtime and brings tax  relief to seniors. It saves and sustains Medicaid so it is there for  those who truly need it. It secures our southern border, making every  community safe.\n\nAll that is required of us, to unleash this…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693179/one-big-beautiful-bill-act"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…green energy codes save homeowners  only about $125 a year but add more than $1,200 a year to families'  mortgages.\n\nIt is simple, folks. If a policy costs families more than it saves  them, it is not a smart policy. House Republicans are fighting to make  housing affordable again. They are putting families first. The first  step is this bill.\n\nMr. Speaker,…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698635/providing-for-consideration-of-hr-saving-homeowners-from-overregulation-with-exceptional-rinsing-act-providing-for-consideration-of-hr-affordable-housing-over-mandating-efficiency-standards-act-and-providing-for-consideration-of-hr-commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…give  a special thanks to Congressman   John Rose and his extremely important  bill that would remove the requirement that a manufactured home be  built with a chassis. That saves money. That one change is going to  enable a significant growth for manufactured housing, and it will  reduce the cost of manufactured homes.\n\nFinally, title 6 of this bill…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699798/housing-for-the-21st-century-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…doing this a better, faster, and cheaper way?\n\nFor those Members who run around saying: PBM reform. Fine, but  understand that every study we have right now is that PBM reform saves  a fraction of a fraction of money, and it is already happening.\n\nMr. Speaker, you will start to see companies now ditching the  middleman and starting to sell directly. Go…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697873/turning-healthcare-into-financial-engineering"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…We  wrote the bills.\n\nWe had Ph.D. economists help us model them and get our numbers right.  We got a preliminary number from CBO that the Medicare Advantage  modernization saves $1.8 trillion, making it the biggest savings bill  in U.S. history.\n\nMr. Speaker, guess how many cosponsors we have? Zero. Zero because it  is hard, complicated, difficult…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694915/facts-and-math"}]