[{"senator": "Terri Sewell", "party": "Democrat", "sentence": "…Speaker, I rise to join my CBC colleagues in getting  into some good trouble as we voice our very strong opposition to the  Republicans' voter suppression bill, the so-called SAVE Act.\n\nAs a daughter of Selma and the Representative of Alabama's civil  rights district, the fight for voting rights is very personal to me. It  was in Selma 60 years ago where…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689343/fighting-voter-suppression"}, {"senator": "Kevin Mullin", "party": "Democrat", "sentence": "Mr. MULLIN. Mr. Speaker, free and fair elections are the foundation  of any functioning democracy. The SAVE Act is a blatant attempt to  undermine our election system, weaken American democracy, and unfairly  suppress millions of eligible citizens from voting.\n\nIf the SAVE Act becomes…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690013/safeguard-american-voter-eligibility-act"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "Ms. TLAIB. Mr. Speaker, the SAVE Act is not about protecting  elections; it is about silencing voters. It is voter suppression, plain  and simple. The so-called SAVE Act is also attacking, of course, voting…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689318/voter-suppression-plain-and-simple"}, {"senator": "Lori Trahan", "party": "Democrat", "sentence": "…Speaker, we are witnessing yet another shameful  attack on the fundamental rights of millions of Americans.\n\nHouse Republicans are forcing a vote this week on the so-called SAVE  Act, a bill that does nothing to stop inflation from driving up grocery  prices, nothing to end Donald Trump's trade war that is pummeling the  stock market, and nothing to protect…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689394/gop-creating-chaos-in-electoral-system"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…necessary in order to ensure that President Trump does not, in fact,  nationalize--or attempt to nationalize our elections.\n\nAnd this unanimous consent request is not about the SAVE Act. It is  not about voter registration policy. It is not about partisan election  administration debates. It is about something far more fundamental:  whether the President…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700022/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Herb Conaway, Jr.", "party": "Democrat", "sentence": "Mr. CONAWAY. Mr. Speaker, I rise today in strong opposition to the  SAVE Act. While everyday Americans are struggling from the fallout of  Trump's disastrous tariff policies, Republicans are pushing through a  bill that strips Americans' constitutional…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690014/safeguard-american-voter-eligibility-act"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…that Congress can regulate, but there is no role  for the President. I say this because I am very concerned about the  President's proposal, and I am very concerned about the SAVE Act.\n\nGreg Kimsey, who is the Clark County auditor of a part of Washington  where I guarantee you, we have real election issues--basically, the  other day, in trying to fight…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700198/save-america-act"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "Ms. DEXTER. Mr. Speaker, I thank my colleague for yielding and for  his actions today.\n\nMr. Speaker, I rise today to speak on one of my eight amendments to  the SAVE Act, which will be offered as the previous question today.\n\nLet me be clear: The SAVE Act is an antiwoman, voter suppression  bill. Under the guise of election integrity, the…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689408/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…Moreover, now our President issued an executive order I believe last  week, and on the floor of this body this week, we will have Jim Crow  2.0, the poll tax of 2025, the SAVE Act, the requirement  that every American citizen prove their citizenship.\n\nMr. Speaker, why is that a poll tax you might ask?\n\nIt is because the only documents allowed to prove…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689341/fighting-voter-suppression"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…Congress by forgoing their  responsibility to serve as a check and balance on the executive branch.\n\nAny day now here in the Senate, we could see Republicans take up the  SAVE Act--the measure that recently passed the House of  Representatives, a bill that, I should say, scapegoats immigrants  simply to justify new barriers to voter registration. Not…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690535/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…end the  violence. Now, it is the House's turn to do its job, but a band of MAGA  radicals want to highjack government funding to push an outlandishly  toxic bill called the SAVE Act that would disenfranchise millions of  American citizens.\n\nJust a few hours ago, Donald Trump said he wants to nationalize  elections around the country. That is what Trump…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699484/government-funding"}, {"senator": "Laura Friedman", "party": "Democrat", "sentence": "Ms. FRIEDMAN. Mr. Speaker, I thank Ranking Member Morelle for  yielding me time.\n\nMr. Speaker, I rise in strong opposition to this so-called SAVE Act,  a bill that is a modern-day poll tax targeting American women and low- income Americans.\n\nThis bill bans voter ID. It bans using driver's licenses as a voter  ID unless…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690000/safeguard-american-voter-eligibility-act"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "Ms. ROSS. Mr. Speaker, I rise in strong opposition to the SAVE Act,  which is a transparent attempt to disenfranchise millions of voters.\n\nThe SAVE Act would change voter registration guidelines to require  proof of U.S. citizenship in very…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690015/safeguard-american-voter-eligibility-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…seventh under  Speaker Johnson, and the tenth of the reigning Republican majority.  That alone demonstrates Republicans' inability to govern.\n\nThen we have the so-called SAVE America Act. The gentleman from Texas  is going to spend today's debate trying to convince you that this is a  commonsense, simple bill, but I want you to remember a very few  important…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699941/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…color--a  modern-day version of the suppression that followed the collapse of  reconstruction. We stopped it, and blue and red States have adopted  those reforms.\n\nBut the SAVE Act is about going the other direction. What a name--the  SAVE Act--as if it is saving something important as opposed to  destroying the opportunity to vote.\n\nSo we will absolutely…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690536/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "Mr. ROY. Mr. Speaker, I thank the chairman for his strong work and  commitment to election integrity and to working with us on this bill,  in particular, the SAVE Act. He has done an extraordinary job, and I am  proud to work with him and work with the rest of my colleagues on it.\n\nI am also proud to work with my friend, Cleta Mitchell,…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690006/safeguard-american-voter-eligibility-act"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…While President Trump is hard at work securing our border, it is now  time for Congress to secure our elections from noncitizen voters. This  week, the House will vote on the SAVE Act, legislation that strengthens  our election laws by requiring proof of citizenship to vote in Federal  elections.\n\nThe SAVE Act also requires States to create a program to…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689357/securing-our-elections"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…longer will our elections be insecure if we do our jobs.\n\nLast week, I joined with my friend, Senator Mike Lee, in the Senate  Chamber to introduce a bill that we call the SAVE America Act. This  legislation builds upon bills that we introduced last Congress, the  SAVE Act, legislation that was focused on a simple idea of requiring  demonstration of citizenship…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699673/united-states-fiscal-situation"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…apprehensions  since March 2024.\n\nThese efforts have only been strengthened by Governor Braun sending  the Indiana National Guard to the border and the House passage of the  SAVE Act.\n\nGovernor Braun has made Indiana healthier by signing nine health- related executive orders, one of which addresses the same harmful food  dyes and artificial ingredients…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690592/first-100-days-are-just-the-beginning"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…numbers?  Mr. Speaker, they did. The DOGE team just announced millions of  illegals now have Social Security numbers. It is happening, and it ends  today when we vote on the SAVE Act.\n\nI have just heard my colleagues say it is already against the law. We  don't need this act, but let me tell you, Mr. Speaker, it is already  against the law for a minor…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1689995/safeguard-american-voter-eligibility-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…side of the aisle today.\n\nNotably, we are talking about in this situation what we have done so  far. We have passed legislation to secure our elections through H.R.  22, the SAVE Act, to guarantee that only American citizens vote in  American elections; to hold rogue judges accountable for issuing  nationwide injunctions and trying to change the process.…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690387/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "Mr. KILEY of California. Mr. Speaker, I rise today as a cosponsor of  the SAVE Act to advance the radical proposition that only American  citizens should vote in American elections.\n\nOf course, this isn't radical at all. It is common sense. I think the…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1689999/safeguard-american-voter-eligibility-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…entire country is waiting for California to  finish a process that takes everyone else a matter of hours or a few  days.\n\nWe have passed in the House of Representatives the SAVE Act, which  advances a commonsense proposition that you should provide proof of  citizenship in order to register to vote. A recent survey showed that  72 percent of California's…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "Mr. MEUSER. Mr. Speaker, this morning, all 216 of my GOP colleagues,  along with just four out of 212 Democrats, passed the SAVE Act, which  is a bill that mandates proof of citizenship for those registering to  vote.\n\nI think most people think that is already required and mandated.  Guess what. Even though…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690081/protecting-the-rights-of-american-citizens-to-vote"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "Mrs. BICE. Mr. Speaker, I rise today in strong support of the  Safeguard American Voter Eligibility Act, or the SAVE Act.\n\nMr. Speaker, under President Biden, nearly 5 million illegal aliens  were released into the United States. Biden's failure at the southern  border has diluted the voting…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690005/safeguard-american-voter-eligibility-act"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…to vote for Members  of Congress, U.S. Senators, and the President of the United States, you  do not have to show citizenship. You don't have to show identification.\n\nThe SAVE Act is required if we are going to have election integrity.\n\nMr. Speaker, I encourage my colleagues to vote for that. It will make  the Federal law in Arizona correspond to the…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689431/arizona-has-two-kinds-of-ballots"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…ask for its immediate consideration.\n\nThe Clerk read the title of the bill.\n\nMr. Speaker, I rise in support of the Safeguard American Voter  Eligibility Act, known as the SAVE Act, introduced by my colleague,  Chip Roy of Texas.\n\nAs chairman of the Committee on House Administration, I have been  focused on improving election integrity and increasing…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690007/safeguard-american-voter-eligibility-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…ought to be cut, and that is a good  thing.\n\nIn Congress, my colleagues are doing some good things. We have passed  some good bills that are hitting a wall in the Senate: the SAVE Act,  the injunctions bill, a bunch of CRAs to undo the damage of the Biden  administration. We passed five this week to undo the damage of the EV  mandates.\n\nWe have got to stay…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690594/fiscal-responsibility"}, {"senator": "Andy Harris", "party": "Republican", "sentence": "…going to be voting in Federal elections.\n\nAmericans expect it, and they expect Congress to do something about  it. Mr. Speaker, I urge Congress to take action and pass the SAVE Act.", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689429/laws-have-loopholes"}, {"senator": "Kat Cammack", "party": "Republican", "sentence": "…integrity  of our elections. It has been demanded by the American people, and we  are making good on that promise today.\n\nMr. Speaker, I urge my colleagues to support the SAVE Act.", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690009/safeguard-american-voter-eligibility-act"}]