[{"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…about it, let's be serious about it. Let's do what a  majority of the States have done. Let's make this a nationwide program.  A compulsory ignition interlock device is saving lives across the  country. I think it is in 31 States now and in the District of  Columbia.\n\nWhy don't we do that? Why don't we do something real, rather than  talk about cases…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693082/jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-2025"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…malnourished children.\n\nThis is Plumpy'Nut. It is used to treat malnutrition. Until this  Trump administration began, we were shipping Plumpy'Nut around the  world, saving millions of lives a year. Starvation is still the leading  cause of death for children globally.\n\nBefore he became Secretary of State, Trump's own Secretary of State,  Marco Rubio,…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692971/restore-funding-for-malnourished-children"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…violence that came down on us on that day.\n\nThat is the kind of bravery that we should be at least acknowledging,  if not praising. I know at the time we thanked them for saving our  lives, and people did die that day. Again, there were more than 140  officers who were wounded and brutalized and injured, and many  still have the physical injuries and scars…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691242/leosa-reform-act"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…which  requires individual health insurance plans to cover annual ovarian  cancer screenings for women at risk and expand monitoring for  survivors.\n\nThat law is already saving lives because it treats women's medical  needs seriously and acts before it is too late. Here is why this  matters: Ovarian cancer is often caught too late, but when detected…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699001/recognizing-ashellarien-addison"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…when they are trying to  take care of their child? I have met with children who went through  gender dysphoria and who credit the treatment they received for  absolutely saving their lives.\n\nMr. SMITH of Washington. Mr. Chair, I yield myself an additional 1  minute.\n\nMr. Chair, do they sometimes make mistakes?\n\nI always like to say, I have had three hip…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695253/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Laura Gillen", "party": "Democrat", "sentence": "…families  devastated by the senseless scourge of gun violence. Her courage helped  shape the national conversation and inspired a generation of advocates  whose work is saving lives in communities across our country every day.\n\nShe also advocated for America's children as a member of the  Education and Workforce Committee, working to fund school lunch…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693023/moment-of-silence-in-memory-of-the-honorable-carolyn-mccarthy"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…Cancer Center, but every time, I am just  blown away by the work they are doing. And they aren't the only ones.\n\nThis isn't just about advancing science though. It is about saving  lives and finding new treatments and therapies and cures that give hope  to help patients fighting for their lives.\n\nCancer research has a long history of bipartisan support…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695670/cloture-motion"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…safe nutrition to children in hard-to- reach places around the world. Until recently, this was being shipped  by USAID to war-torn and famine-torn areas all over the world, saving  lives under Democratic and Republican administrations, until the Trump  administration dismantled USAID. As a result, children are starving  around the world.\n\nHere in the United…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693021/trump-administration-needs-to-honor-its-word-on-food-aid"}, {"senator": "Laura Friedman", "party": "Democrat", "sentence": "…FRIEDMAN. Yes. Besides being a mom, I am a breast cancer  survivor. After I was diagnosed, I found out that one of the treatments  that has been a revolution in terms of saving the lives of women  suffering from breast cancer was developed, I believe, at UCLA.\n\nSo many of our medical advancements come through the R&D that is done  at our universities.…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688232/democratic-proposals"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…Mr. Speaker, I have no further speakers, and I yield  myself the balance of my time.\n\nMr. Speaker, I am sure my colleagues on both sides of the aisle agree  that neither saving lives nor providing support to victims of crime are  partisan issues. Victimization knows no political party.\n\nThe instability of the Crime Victims Fund threatens red states as…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698840/crime-victims-fund-stabilization-act-of-2025"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "Ms. DEXTER. Mr. Speaker, I rise today in strong opposition to the GOP  higher healthcare costs for worse coverage act.\n\nI did not spend 20 years as an ICU doctor saving lives to come to  Congress and sit back while Republicans strip healthcare coverage from  millions. No. I came to Congress to fight for affordable, accessible  healthcare for…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698396/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Ben Luján, Jr.", "party": "Democrat", "sentence": "…depend on emergency radio systems and public  broadcasts to stay informed and stay safe.\n\nNow, I heard from a broadcaster in New Mexico this week who said:\n\nWe are literally saving lives and finding ways to save       more. Please do everything you can to stop this rescission.\n\nNow, the White House and congressional Republicans are making  decisions that…", "date": "2025-07-09", "source_url": "https://justfacts.votesmart.org/public-statement/1693299/9999"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…CPSC's       directive. By mandating uniform consumer protections, this       legislation will help ensure that only safe, reliable       batteries are brought to market--saving lives and preventing       devastating property damage. It also levels the playing field       for responsible manufacturers and retailers who already       prioritize battery…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690260/setting-consumer-standards-for-lithium-ion-batteries-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…resolution will be a race to the bottom, giving these  facilities the green light to permanently abandon their long-installed  pollution control equipment that are currently saving lives. This  Republican resolution will allow these facilities to spew hazardous air  pollution into the air with reckless abandon, and increase cancer- causing pollutants without…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691591/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…work with them.\n\nPassing the ROTOR Act is the first and strongest step that Congress  must take to immediately give pilots another key tool to prevent  collisions and begin saving lives now.\n\nMr. Speaker, I urge my colleagues to support the ROTOR Act and soon  the ALERT Act of 2026.", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700105/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "Addison McDowell", "party": "Republican", "sentence": "…Guard to respond  effectively to opioid overdose situations.\n\nThe Coast Guard is on the front lines of the fight against fentanyl,  working to stop traffickers at sea and saving lives in the process.  This bill will ensure that they have the tools needed to do just that,  because when an overdose happens, there is no time to wait.\n\nThis bill will give…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692171/controlled-substance-onboard-vessels"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…millions  of Americans' lives are being saved because President Trump has  declared this national emergency and is actively forcing our neighbors,  like Canada, to act. It is saving lives.\n\nMy colleague wants to make sure that that no longer happens because  he doesn't see an emergency, even though 5,000 people from his State  are dying every single year.…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699965/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…affected seek and receive the care they need. I applaud the  Cameron Elk Suicide Prevention Task Force for its innovative approach  to educating high-risk communities and saving lives.", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697845/congratulating-cameron-elk-suicide-prevention-task-force"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…danger is forcing our law enforcement officers into a false choice  between using deadly force or no force at all. If we are serious about  reducing violent encounters and saving lives, we should be focused on  giving officers more options to de-escalate situations when seconds  matter.\n\nMr. Speaker, the rule also provides for consideration of H.R. 261,…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699905/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…demonstrate this every day. It was an  honor to meet Julie and hear about her incredible dedication firsthand.\n\nI congratulate Julie and thank her for her steadfast commitment to  saving lives and protecting Iowans.                          Recognizing Georgia Clark\n\nMrs. MILLER-MEEKS. Mr. Speaker, I rise today to recognize Georgia  Clark, a student from West…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697377/recognizing-pella-marching-dutch"}, {"senator": "Michael McCaul", "party": "Republican", "sentence": "…this bill has the most bipartisan support in  Congress, and that is because there is nothing political about a child  with cancer. There is nothing more important than saving the lives of  the next generation.\n\nMy prayers remain with Mikaela's family, and we are honored to have  them here with us today: her mother, Kassandra; her father, Doug; and  her…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697274/mikaela-naylon-give-kids-a-chance-act"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…Since their first 911 response back in November 1975, well before the  University Medical Center Hospital even opened its doors, UMC EMS has  been on the front lines of saving lives and serving our communities in  west Texas.\n\nWe are fortunate to have the highest level of healthcare and  emergency response professionals protecting our families. In fact,…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692295/stop-defending-lawlessness"}, {"senator": "Max Miller", "party": "Republican", "sentence": "Mr. MILLER of Ohio. Mr. Speaker, I rise today to recognize September  as National Prostate Cancer Awareness Month and the importance of  saving lives from Prostate Cancer through awareness, education, and  effective treatment for men's health in our Nation. Prostate Cancer is  one of the most common cancers among men.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695861/recognizing-september-as-national-prostate-cancer-awareness-month"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…institutions. This ensures the 2023 law can be  implemented properly.\n\nI encourage all Americans to consider being an organ donor and  understand the impact that it can have on saving lives.\n\nOf course, in addition to oversight of the new legislation, I am  keeping my very close eye on how the Federal Government is implementing  these new laws to give more…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690102/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…first  responders, agency administrators, and educators, is truly selfless and  caring. They are drawn to making a tangible difference and have an  incredible passion for saving lives. I applaud each and every one of  them for their hard work and commitment.\n\nIt is an honor to celebrate this significant milestone. This  conference provides tremendous…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694419/50th-anniversary-of-the-wyoming-trauma-and-emergency-medical-services-conference"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…appropriations for the Coast Guard for fiscal years 2026 and  2027.\n\nThis bill will allow the Coast Guard to continue its vital missions  of defending our maritime borders, saving lives at sea, and ensuring  safe and reliable maritime commerce.\n\nThe measure also builds upon the historic $25 billion investment the  Coast  Guard received in reconciliation,…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697805/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…under attack. An enemy insurgent positioned  on a rooftop hurled a grenade into his Humvee.\n\nWithout hesitation, Specialist McGinnis threw his body onto the  grenade, saving the lives of his fellow soldiers. For this incomparable  courage and sacrifice, President George W. Bush posthumously awarded  him the Medal of Honor in 2008.\n\nToday, the post office…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689171/national-medal-of-honor-day"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…responders, as  well as the victims and families affected by this horrific disaster. I  am grateful that this team was able to put their expertise to use and  assist in saving lives.\n\nI am happy to hear the news that they are coming home.", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694073/recognizing-virginia-beach-fire-departments-swiftwater-rescue-team"}, {"senator": "John McGuire III", "party": "Republican", "sentence": "…over 20 veterans a day to suicide, despite  exhaustive and costly efforts to stop it. That is not just a tragedy.  It is a call to action.\n\nHyperbaric oxygen therapy is saving lives and helping veterans rejoin  their families, their communities, and the workforce. With sufficient  funding and support, we can expand this model across Virginia and  across…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700045/hyperbaric-oxygen-therapy-for-veterans"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…in healthcare access and  restoring the safety net that Lee County deserves. The CEO of Insight  said that it was pivotal in establishing these services. This is about  saving lives, strengthening rural healthcare, and giving families peace  of mind.\n\nI am proud to have secured this investment and will continue working  to ensure that rural Iowans receive…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696794/highlighting-critical-investments"}]