[{"senator": "Robin Kelly", "party": "Democrat", "sentence": "…Venezuelan gang. I don't understand this  President's obsession with Venezuela, but they did not arrest a single  member from that gang.\n\nI visited that apartment building and saw firsthand the destruction  those agents left. Doors to people's homes or apartments were kicked  down. Belongings, including little kids' toys, were strewn about in the  hallway.…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698951/impeach-secretary-noem"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…distinguish them from a  kidnapper; whisking people away in unmarked cars and even smashing  windshields.\n\nBack in my home State of Washington, I heard from folks who saw that  firsthand.\n\nLast month, ICE aggressively detained Lelo, a farmworker in my State.  And it appears he may have even been targeted because of his advocacy  for better working conditions…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690540/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…education and  profession, I know personally that there is a very serious need to  improve mathematics education for our K-12 students. Indeed, when I  taught chemistry, I saw firsthand how my students struggled because  they lacked the basic foundations in math that are necessary for the  sciences. Today, I hear from both our generals and our CEOs about…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688979/mathematical-and-statistical-modeling-education-act"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…Juan Orlando Hernandez, a  man an American jury convicted of trafficking tons of cocaine into the  United States and of corrupting his own government in the process.\n\nI saw this firsthand when I brought a bipartisan delegation to  Honduras when he was President. We refused to meet with him because he  is/was a thug.\n\nThis is not a minor case. This is not…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697367/shameful-hernandez-pardon"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…the  only national wildlife refuge that protects a complete Arctic  ecosystem. It is called the crown jewel of our public lands, and it is  called that for a reason. I saw why firsthand when I was there last  summer.\n\nThis special place offers unmatched, truly wild fishing and hunting  opportunities for all Americans. When you catch your first Arctic…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696880/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…communities look like and building power  and coalition to realize those dreams for people in Wheaton.\n\nI had the pleasure of meeting Deborah at one of my townhalls, where I  saw firsthand her passion to fight for herself, her family, her  community, and our district.\n\nMr. Speaker, on behalf of Illinois' Third Congressional District, it  is my honor to recognize…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690325/national-fair-housing-month-amisha-patel"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "…table, why would we take away a lifeline that millions of Americans  rely on?\n\nThis past weekend, I visited Christ the King Lutheran Church in Cary,  North Carolina, where I saw firsthand indispensable work to combat food  insecurity in our own community.\n\nRepublicans have abandoned vulnerable, hungry people to pay for tax  cuts for billionaires. It is shameful…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693584/condemning-republicans-big-ugly-law"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "…absolutely zero oversight  mechanisms in place.\n\nMore than a month later, after formally inquiring to the Department  of Homeland Security and ICE about the conditions that I saw firsthand,  I have yet to receive a response.\n\nPeople are being harassed. They are being dehumanized. They are being  abused.\n\nLast weekend, I tried to return to Eloy to meet with…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694186/pushing-back-against-ices-authoritarian-overreach"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…federally qualified health centers, rural  hospitals, and independent providers are facing challenge upon  challenge upon challenge. At Grays Harbor Community Hospital, I saw  firsthand how tariffs are driving up costs for medical devices and  supplies, adding financial strain to already stretched rural  facilities.\n\nThe hospital recently invested in a…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696873/preserving-rural-healthcare-access-is-literally-life-and-death"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…working families and, instead, threaten our public health.\n\nBefore coming to Congress, I spent over two decades as a pulmonary  and critical care physician. Every day, I saw firsthand how climate  change impacts people and how poor air quality leads to people's  morbidity and, yes, mortality. It is undeniable, the air we breathe is  making us sick, and…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688525/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-national-emission-standards-for-hazardous-air-pollutants-rubber-tire-manufacturing"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…worked  alongside our military and diplomats. Make no mistake, they were  risking their lives to help us and faced the possibility of retribution  in their own country. I saw firsthand during a visit to Afghanistan  some years ago just how these Afghans were making that courageous  sacrifice. And the lives of their families, of course, were also in  danger…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693450/temporary-protected-status"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…State,  which are run by the Department of Education, to ensure that children  like her had the support they needed to go to and graduate college.\n\nMr. Speaker, my parents saw firsthand how important a good education  was to individual opportunity and a thriving and healthy economy,  community, and democracy. They dedicated their lives to ensuring not…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698124/dismantling-the-department-of-education"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…where three decades of the  space shuttle fleet took shape, and that legacy continues today, where  work is being done to prepare the Artemis II mission.\n\nDuring my visit, I saw firsthand the progress on the SLS, the Space  Launch System, the rocket that will carry astronauts on a 10-day  journey to the Moon, further than we have been from the Earth for…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689663/recognizing-extraordinary-work-of-kennedy-space-center"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…their support and  leadership on the Homeland Security Committee from which this bill has  originated.\n\nBefore Congress, I had the privilege to work in law enforcement. I  saw firsthand the horrible effects, the dangerous effects, and the  lasting effects that weak borders have had on our wonderful country. Of  course, there are pressures on housing, healthcare,…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696955/tren-de-aragua-border-security-threat-assessment-act"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…period, I traveled throughout coastal  Virginia and heard directly from the people I represent:  servicemembers, shipyard workers, working families, and aerospace  leaders. I saw firsthand how the One Big Beautiful Bill Act is already  beginning to shape our future here at home.\n\nAt a TRICARE roundtable, I met with hospitals, small clinics, and  providers…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694795/promises-made-promises-kept"}, {"senator": "Andy Ogles", "party": "Republican", "sentence": "…activities rely on State and local systems that are now  squarely in the sights of foreign adversaries and criminal groups.\n\nAs a former county executive in Tennessee, I saw firsthand how  limited budgets, aging systems, and staffing constraints can leave  local governments struggling to keep up with modern cyber threats.\n\nMany smaller jurisdictions…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696789/protecting-information-by-local-leaders-for-agency-resilience-act"}, {"senator": "Russell Fry", "party": "Republican", "sentence": "…governments, they were vilified when they were out doing what  they could to try to help. They were told to stand down and allow mobs  to go in and destroy property.\n\nI saw that firsthand, Mr. Speaker, in Raleigh. I literally watched  folks roaming around and destroying windows, burning vehicles,  shooting, all this kind of mayhem. I won't mention names,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691319/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…and I thank Matt very, very much for a great idea and for  helping us see it through.\n\nMr. Speaker, Matt is a veteran and a passionate advocate for those  who serve. He saw firsthand the need to give proper recognition to the  families of fallen first responders, especially those who had once  served our country in uniform and continued that service…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691021/calling-upon-local-communities-to-support-organizations-that-provide-resources-and-aid-gold-shield-families-in-their-time-of-need"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…employee turnover that is 12 percent lower and a  higher business survival rate.\n\nI know the value that PEOs provide. Before coming to Congress, I  worked for a PEO, and I saw firsthand the positive impact they had on  small businesses in my home state of Indiana.\n\nMr. Speaker, I would like to congratulate the PEO industry for all  they do to help our…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690397/recognizing-national-peo-week"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…maintaining a free and open Indo-Pacific is vital  to the security of both the United States and our partners.\n\nOn the final leg of the trip, I met with Taiwanese officials and saw  firsthand how we can strengthen U.S. posture and deepen collaboration  in the region. I was also struck by the warmth, hospitality, and the  resilience of the Taiwanese people.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694962/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…Department of War to greatness.\n\nMr. PATRONIS. Mr. Chair, the good gentleman may be the only mechanic  in the Chamber, but I am the one who was a State fire marshal who saw  firsthand how our lithium-ion battery-powered vehicles are not ready  for prime time.\n\nIf you look at what happened when Hurricane Ian devastated south  Florida, there were over…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695161/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}]