[{"senator": "Brian Schatz", "party": "Democrat", "sentence": "Mr. SCHATZ. Madam President, I cannot believe I have to say this, but  a President should not take a $400 million gift from a foreign country.  It doesn't matter which President or what party. It doesn't matter  which foreign country. It doesn't…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690968/qatar"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…like--and to say it is a rebellion just because the  President says there is one and there is nothing, like that type of  deference, that is throwing open the gates to say an authoritarian  President can roll out the military under title 10. That is scary as  hell.\n\nThe Insurrection Act, in ways, is even scarier because it does have  an explicit deference to…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…bit from H. Res. 939. It reads:  ``Impeaching Donald John Trump, President of the United States, for  high crimes and misdemeanors.''\n\nI have to pause a minute and say this. The President said just  recently that ``they will find a reason to impeach me.'' Mr. President,  we don't have to find a reason. You are giving reasons. You are  providing reasons…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699134/where-do-you-stand"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…enough. I urge a ``no'' vote.\n\nMr. AUSTIN SCOTT of Georgia. Mr. Speaker, I thank the President of  the United States, Donald J. Trump--I know it pains my colleagues to  say that, ``President of the United States Donald J. Trump''--for his  decisive action. I thank him for calling both sides out on the cease- fire.\n\nI point out to my colleagues on the other…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692813/providing-for-consideration-of-hr-military-construction-veterans-affairs-and-related-agencies-appropriations-act-providing-for-consideration-of-hr-special-interest-alien-reporting-act-of-providing-for-consideration-of-hr-jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-and-providing-for-consideration-of-h-res-condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…past 2 years to  join with Democratic Senators, including myself, to make a dramatic  difference in medical research. It only takes three or four now to step  up to say to the President: We are sorry. This is part of your budget  we cannot go along with. We are not going to walk away from medical  research. We are going to stand together on a bipartisan…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690656/national-institutes-of-health"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…the Constitution, to decide unilaterally to cancel spending that  has been authorized and appropriated by Congress. So maybe the first  and most important thing to say about what the President has done to  cancel mental health grants and anti-violence grants is that it is  illegal. He can't do it, and it is likely that a court will turn these  grants back…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690948/gun-violence"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…Constitution or law on the books--none--that allows a President to  commandeer State election systems--no emergency power, no implied  authority, no ``because I just say so.'' The President's role is to  faithfully execute the laws, not to rewrite the Constitution when the  facts or the voters displease him.\n\nYet here we are. Donald Trump's dangerous…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700022/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…Palestinians, sanctioned ethnic cleansing, collective punishment--the  Nobel Peace Prize.\n\nI know you are waiting for me to say the other word. Yes, I am going  to say it. This President has sanctioned the most heinous of crimes  against humanity, and those are crimes against humanity that are being  committed on the Palestinians. He has sanctioned…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695338/dark-days"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "Ms. STANSBURY. Mr. Speaker, I rise tonight to say to our President  and to his administration: Hands off our education, hands off our  teachers, hands off our students, and hands off our schools. Last week,  the Department of Education…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689604/hands-off-our-education"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…note that they said  facilitate. There is a judge that has explained it in great detail what  facilitate means. It is a beautifully written opinion.\n\nIt goes on to say that the President--and I am paraphrasing--of El  Salvador said he was not authorized to return Mr. Garcia.\n\nNow, they are sitting in the same room, the President of El Salvador,  the…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690560/a-message-to-the-cabinet"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…his  attack on the press, his attack on the universities, his attack on  extorting law firms. We see it in the form of him using the Trump v.  United States lawsuit to say: I, the President, am above the law, and I  could issue pardons to the whole executive branch, who is above the  law.\n\nThat is not the way it works in a republic. At least, it is not…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692551/alex-padilla"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…believe. I plan to bring these Articles of  Impeachment. Removal is a possibility.\n\nThere is always a deterrent effect of Articles of Impeachment. They  can be used to say to a President: If you don't behave, if you don't  cease and desist with what you are doing, then you can be removed from  office.\n\nI trust that this will become the message that the…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690862/and-still-i-rise-impeaching-president-trump"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…knowing that the committee with jurisdiction over  Medicaid had a mandate to cut more than $800 billion, I was  overwhelmed, Mr. Speaker. I did rise to my feet, and I did say to  the President: You have no mandate to cut Medicaid.\n\nMy colleagues across the aisle became very rambunctious and decided  that what I was saying did not merit being heard, so they…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695807/censured-but-not-silenced"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…that, but  they can't just make up grammar. Write the bill right if you want to do  it.\n\nMr. MAST. Mr. Speaker, it is always a laughable argument when  Democrats try to say the President is enriching himself.\n\nJust as one example, in this case you don't see him collecting a $50  million bounty for bringing in Nicolas Maduro, a bounty that the  previous…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699364/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…Democrats are not putting forward an authorized use of military  force, telling the President how to combat any of these issues.  Democrats are putting forward a resolution to say the President cannot  do anything about MS-13 or Tren de Aragua and every other cartel. That  is giving aid and comfort to narcoterrorists. That is ignoring an  imminent threat.\n\nThe…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698249/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "John Thune", "party": "Republican", "sentence": "…Biden's.\n\nIt is an impressive number on its own, but it is particularly  impressive when you consider the obstacles the Democrats have put up. I  am not exaggerating when I say that President Trump's nominees have  faced a historic level of obstruction from Senate Democrats.\n\nWhen you look at this term, President Trump remains the only  President on record…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698260/nominations"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…the Joint Economic Committee. We have a handful of Ph.D. economists,  freaky smart. We have a model to do it.\n\nWhat is my chance, Mr. Speaker, of getting this body to say--the  President talked about doing talent-based immigration 2 nights ago,  talked about modernizing, using technology.\n\nWhen you call the IRS--their own auditor says only 31 percent…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688651/a-real-math-problem"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…more seriously. Remember, if you want to be taken  seriously, you have to act seriously. If you want respect, you have to  act respectfully.\n\nPrime Minister Carney, you say that President Trump is not a fair  trader. I understand your point of view. I don't agree with you, but I  understand your point of view. You have got to stand up for your  people.…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689486/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…bit  of common sense in the deportation debate we have had going on here.\n\nNo one knows exactly how many people are in this country illegally. I  think it is safe to say that under President Biden that number went up  by about 8 million, which means almost certainly it is over 15 million.\n\nThere are some muddled up people here who claim that all we should…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698323/nations-arent-nations-without-borders"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…looking to Washington,  D.C., and finally seeing a Washington, D.C., that cares about the  everyday Americans who make America work every single day.\n\nFinally, I will say this about our President. My entire lifetime, I  have watched the chaos in the Middle East created by one nation, Iran.  They wreaked havoc on the region. They undercut the idea of democracy,…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692814/elections-matter"}]