[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…warships, thousands of troops, and the largest aircraft carrier ever  put to sea, the administration still claimed this was about drug boats.\n\nYou heard the administration say that time and time again to the  public and to Congress until last weekend when the objective became  clear: This was about Venezuela's oil, and if we could have that, we  would leave…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698678/venezuela"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "….  Where is the relief for businesses? Does the government truly not  understand the impact of their actions, or is it their goal to destroy  us?''\n\nShe goes on to say: ``For the first time, I am considering offshoring  our manufacturing. This had never been an option for me, but these  changes imposed on American businesses make it extremely difficult…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691573/earthquaker-devices-sounds-the-alarm"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…Federal spending away from Russ Vought, and  reclaim it for the Congress. If not, the President and Russ Vought will  be in charge of the funds, and we will have no say.\n\nAt the same time, funding for the Department of Homeland Security  will continue at its current level for 10 days. It is important to note  that is about 6 legislative days. If we do…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699573/consolidated-appropriations-act-2026"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…for 75  years as a part of GDP. Somehow, this country seems to be working for  the rich and powerful; but it is not working for ordinary working-class  Americans.\n\nI say enough. It is time to begin with accountability for the Epstein  class. Hold in front of Congress those people who visited the island or  did business with Epstein after he was a convicted…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699892/decoding-epstein-files"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…their friends in powerful places would protect them or they could  simply buy their way out of the justice system.\n\nWell, we are here today to stand up with the survivors and say: Time  is up. We demand accountability.\n\nNow, it is also not lost on me that I am standing in this Chamber, in  this seat of power from which wars have been launched and the fates…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696853/standing-with-truth-and-justice"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…this obscenity? No, I don't think so.\n\nIs there anybody on that side of the aisle who is uttering support  for law enforcement during our law enforcement week who will say it is  time to put up the plaque in honor of the officers who defended us?\n\nMr. Speaker, I hope my colleagues have some good reason for doing  what they are doing. The Framers of…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691349/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…represents,  not ever. It is not going to be easy. We recognize that, but we have  faith in the resilience of the American people.\n\nAs I get ready to close shortly, let me say it one more time. Our  Republican colleagues tried to jam this reckless, extreme bill, Mr.  Speaker, down the throats of the American people. They had the nerve to  start this debate…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…that this institution  should work for the people it represents, this is the moment. Extend  the tax credits. Protect the coverage of our constituents. Stand with  us to say that it is time for Congress to put patients ahead of profits  and working families ahead of billionaires.\n\nMr. Speaker, I urge a ``no'' vote on this rule, and I yield back the  balance…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698312/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…can see. It is a place that is a  mere 50 miles south of the San Juan River where I was born.\n\nI rise today in solidarity with Tribal leaders from across New Mexico  to say that it is time to protect Chaco Canyon and these sacred lands.  Before our very eyes, the Trump administration is trying to open these  sacred lands to oil and gas drilling that would…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697106/chaco-canyon-is-not-for-sale"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…incredibly stressful  situations for their mental health, and even empowering officers to be  able to do their job, which is a job that everyone wants our officers  to do.\n\nI say this all the time: If you polled my city, which is a majority  minority city, a majority African-American city, and asked them ``Hey,  do you want more police, less police, or the same…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696004/unanimous-consent-requests"}, {"senator": "Darrell Issa", "party": "Republican", "sentence": "…perhaps you can just consider that every time  the other side speaks, they will be speaking in violation of our rules  about disparaging the President, and you need not say it each time, I  trust.\n\nMr. ISSA.  Boebert).\n\nMr. ISSA. Mr. Speaker, I note that what the gentlewoman from Colorado  (Ms. Boebert) is referring to is what has now been affirmed as…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689711/no-rogue-rulings-act-of-2025"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…We are working across the  aisle, which we should do. Our friends can't have it both ways. They  can't say we are in control, therefore, everything is our fault, and  say at the same time that these are good bills built upon bipartisan  support.\n\nThere will no doubt be time to debate other matters, but today the  matter at hand is an appropriations package…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699072/providing-for-consideration-of-hr-financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…is leaving today. He is a great  guy. He is the pride of Poway, California. While it is our loss, it is  going to be the gain of the Pacific Legal Foundation.\n\nI will say one more time, I thank John for all the help he has given  me. He is welcome to come back to our office again and again when he is  on the Hill.", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693086/recognizing-john-nagle"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…going to say this twice, once for each of my  colleagues over here managing, Representative Meeks and Representative  McGovern: There are no troops in Venezuela.\n\nLet me say it one more time for you all: There are no troops in  Venezuela.\n\nMr. Speaker, neither of my colleagues bothered to say anything about  what their bill they are bringing forward actually…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699364/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Josh Hawley", "party": "Republican", "sentence": "…campaign contributions.\n\nIt is enough of that. It doesn't say ``We the corporations'' in our  Constitution. It says ``We the People.'' It is time for the people to  have their say. It is time for this body to vindicate their rights. It  is time for us to vote on this bill.\n\nI yield to the Senator.", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697735/9999"}]