[{"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…the Ukrainians I meet speak several  languages. They want to meet the world. They don't want to be put  inside a cage again. That is really what they face.\n\nI wanted to say a few things about my family if the gentlewoman  wanted to add anything now. I wanted to mention a few of the people I  have met who fought during World War II and allowed for some…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690215/supporting-ukraines-independence"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…task force on the weaponization of  government. This was a perfect assignment, perhaps, for a man who  writes vituperative threat letters to Democrats when he hears them say  things that he doesn't like.\n\nMr. Speaker, it makes me wonder why President Trump would put up with  this and would insist upon placing him in a position of such critical  importance…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691194/calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism-and-educate-the-public-on-the-contributions-of-the-jewish-american-community"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…he was and to speak on the  issues of importance to him in ways that I might not agree with, but he  had a right to do this.\n\nHe had a right to life. He had a right to say these things in venues  across the length and breadth of this country and, I would say, across  the globe. These were his rights.\n\nHe had the right to be where he was and to do what…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695338/dark-days"}, {"senator": "Gabe Amo", "party": "Democrat", "sentence": "…cancer research funding eliminated, when 2-year-old  citizens are deported, when the budget resolution calls for the largest  proposed cut to Medicaid ever, surely, we can say these things are  wrong, no?\n\nThe American people are calling for leadership. They are calling for  solutions to help them afford basic necessities. They want to be able  to tell their…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690634/trumps-first-100-days"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…this. If we do, at some  point, what I have in my hand now will occur. I have in my hand an  article from Politico dated November 20, 2025. When we allow the  President to say these things with impunity, this is what we face.  November 20, 2025, 10:42 a.m. Eastern Standard time--it is styled:  ``Trump calls for Democratic lawmakers to face trial for `seditious…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697060/no-mandate-to-cut-medicaid"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…words other than what I will present.\n\nThey talk about this impeachment. They say that he is a threat to  democracy. They say that he disrespects the Constitution. They say  these things, but I am not sure that everybody who says these things is  truly interested in the consequences related to what the President  should suffer for doing these things.…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690560/a-message-to-the-cabinet"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…vote of conscience. People have to vote their conscience. If your  conscience tells you no, then I think you should follow your  conscience. I cannot, in good conscience, say the things that I have  said about this authoritarian President, see it become a reality, and  then take no action.\n\nI cannot in good conscience, but there are people who can do this…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692116/authoritarianism"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…I will provide a fuller statement for the record of the  great life achievements and beautiful, beautiful love of community of  Rob and Michele Reiner.\n\nI just want to say three things.\n\nDo you recognize this? It is the things that have been said in his  movies:\n\n``I'll have what she's having.''\n\n``You can't handle the truth.''\n\n``As you wish.''\n\n``Go…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698360/rob-and-michele-reiner-tribute"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…However, knowing what I know about him, I doubt that he will  receive the message as intended. I think that it will cause him to  become a greater bully and to do more and say more things that are  unacceptable to try to normalize his dictatorial behavior.\n\nIt is dictatorial in that he believes that the law should be followed  when he sees the law on his…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690862/and-still-i-rise-impeaching-president-trump"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…richest man in the world,  who is cutting services to low- and middle-income families. The waste  is the garbage coming out of people's mouths who don't care about  seniors and say things like it is just a complicated Ponzi scheme. It  is abuse by the Federal Government, abuse of people who worked hard  their entire lives to support themselves and paid into…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690424/social-security-administration-is-there-to-help-not-hurt-americans"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…act of political violence, regardless of its source or its  motivation.\n\nI went to war three times for this country to defend the Constitution  and the rights of people to say things I might disagree with. The right  of every American to speak freely, peacefully, organize, and protest is  fundamental to who we are. After all, what is more American than…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695733/why-i-came-to-congress"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…the President's definition,  but we never hear anything about it being unlawful. I am saying  unlawful. They use other language. I say undocumented immigrants, and  they say other things about the persons who are here without  documentation.\n\nPeople who have overstayed their visas from European countries, you  don't see them being pulled out of cars, generally…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697472/president-trump-is-a-threat-to-our-republic"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…bringing these Articles of Impeachment to a vote. I am  pointing my cane at you.\n\nI am pointing at those people who are a part of the news media who  will bring me up and say things about me but won't allow me to respond  to them. You know who you are. But, as I was saying, I want people to  know about this courage and the pushback and the antithetical…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698076/liberty-and-justice-for-all"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…created by the President, I ask what made for more sensational TV  images, the Waymos being set on fire and the Molotov cocktails being  thrown at officers, which is to say that the things that happened  before the National Guard got there, or our dedicated National Guard  members standing outside Federal buildings, making sure that no further  damage…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693143/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…every  sense of the word.\n\nAgain, God bless America, and go west Texas.\n\nMr. Speaker, may I inquire as to the time remaining.\n\nMr. ARRINGTON. Mr. Speaker, I think I can say a few things in 2  minutes, believe it or not, about some of the comments my colleague,  Representative Baumgartner, said about the One Big Beautiful Bill Act  and its positive impact…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692295/stop-defending-lawlessness"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…union benefit, they will tell you who  spent time on that issue, who was the leader on that issue.\n\nLeader McConnell used to go around Kentucky when he was campaigning  and say things like, Kentucky punches above its weight, and we  absolutely did on that. He threw the right punch on that.\n\nOur retired union coal miners have the benefits they have today…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695764/national-coal-council-reestablishment-act"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…mine, which are fighting back against  criminal-coddling politicians, remain eligible locations for SBA  offices.\n\nWe have heard a lot of folks who are opposed to this bill say things  like: It is undermining small business, or: It is creating a culture  war.\n\nThis is about the rule of law. This is about cities thumbing their  noses at taxpayers. You aren't…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692103/save-sba-from-sanctuary-cities-act-of-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…something we just don't hear a lot of here on the  floor of the House. Remember, this is my therapy because I often sit in  the back of the room and stew when I hear people say things when it is  obvious they didn't pull their calculator out.\n\nI am going to try two things tonight, and if you are actually  interested in budgets and economics, have fun with…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699257/debt-deficits-and-demographics"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…this? No one wants to read all of this. Nobody is  going to pay attention to a chart. All of my staff and everybody says,  ``Don't use charts on the floor. Just go down and say things that will  get clipped and sent around.'' Let me try to say something that will  get clipped and sent around.\n\nEven if the House Republicans are successful in working with…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690594/fiscal-responsibility"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…leadership, we increased funding for  local and Federal law enforcement, including the very FBI that solves  crimes in our rural and Tribal communities.\n\nWe don't just say these things. We show up for law enforcement. We  stand with the Capitol Police who defended our democracy and our lives  on January 6. We honor their courage. We mourn those who died,…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691169/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…claim that something  that the majority is doing is like an authoritarian dictatorship  because you would be banned from saying such things. You would not be  allowed to say such things. You would not be allowed to have your time  to debate the rule and then the bills. All of that would go by the  wayside. That has not happened here.\n\nMr. Speaker, we…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697302/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Mr. Speaker, we are scheduled to borrow about 7.3 percent of the  economy this year. Does anyone see a math problem?\n\nWhy is it so hard around here to tell the truth? We say things that  are just not mathematically true. My family used to have a saying: At  some point, the math is going to win, and it always does.\n\nMr. Speaker, thank you for tolerating…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689614/its-the-math"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…time. I just don't  see us doing that because somehow it is not part of our lexicon. I will  do presentations. We have too many people, particularly even on my  side, who say things that aren't mathematically true. We hear  something, and we repeat it. The customs duties, tariffs, are helpful.  It is not as much money as so many people think.\n\nMr. Speaker,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698698/congress-is-a-math-free-zone"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…have bills that actually would save $3 trillion, and I can't get a  single other Member of Congress to sponsor them because they are hard.\n\nI will get lobbyists who will say mean things about me.\n\nSo let's keep just doing the shiny objects. Let's just keep doing the  petty around here. I think yesterday was the 14th time we have tried to  reprimand or…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697051/facing-fiscal-reality"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "Mr. SCHWEIKERT. Mr. Speaker, have you ever had a piece of  legislation--we all go through this--where you have your friends on the  opposite side who say things, and you think, wow, I can't find that in  this piece of legislation. I guess we are all sometimes in the  pandering business.\n\nAbout a year ago, in my community, we had…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700037/law-enforcement-innovate-to-de-escalate-act"}]