[{"senator": "Jake Auchincloss", "party": "Democrat", "sentence": "…calculations,      We piece together what they tear apart      Like a quilt of borrowed time,      With midnight shifts and morning prayers,      Hands that hold when budgets say let go.      Here, in this web of grace we weave,      Because what flows through us is stronger      Than their ledgers and our stubborn refusal      To let spreadsheets tell…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690834/advocating-against-medicaid-cuts"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…the Affordable Care Act part of the  exchange we are talking about are people that were part of this issue.  So literally, our colleagues on the other side,  who tried to say, let's cut the Affordable Care Act 70 times, put in  decimating language in the Big Beautiful Bill are also saying, The only  way I am going to solve this problem for you is if…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697783/healthcare"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…changes  the Department of Defense to the Department of War. The same President  who has promoted what is happening to the Palestinians in Gaza; who has  gone so far as to say: Let's just buy that property or take it and make  it some sort of resort. The same President who went so far as to say to  Mr. Netanyahu: Yes, you can go on, you can do what you…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695338/dark-days"}, {"senator": "Raphael Warnock", "party": "Democrat", "sentence": "…Mark Hortman of  Minnesota, victims of premeditated political violence. This should  shock the conscience of every American, and it should cause all of us  to rise up and say: Enough.\n\nLet me be clear. I disagreed with Charlie Kirk on just about  everything, but I rise tonight not in spite of those differences but,  in a real sense, because of those differences.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695312/cloture-motion"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…have  taken place each year for the preceding 15 years for every listed  offense.\n\nNow, what is the danger of having too many criminal offenses? Some  people might just say, let's let sleeping dogs lie. What is the problem  with having proliferation of offenses that may be opaque, inscrutable,  obscure, and duplicative? One danger is the citizen doesn't…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697205/count-the-crimes-to-cut-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…Executive, proceeding to spend money wherever he wants.\n\nThat $20 billion, I would love to see--I am not being coy. I would  rather have all of the Senators right here and say: Let's pass a bill  right now and say ``hell no.'' You know, a lot of that $20 billion is  going to the debt that has been built up in Argentina, and friends of  President Trump…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…crushed to Earth shall rise again.  This is a great staff.\n\nThey appreciate Carlyle. They appreciate his wisdom when he said that  no lie can live forever. Let them say what they may. Let others do what  they may. We will do what we must and take a stand for liberty and  justice for all.\n\nI have a great team, and I want them to know how much I appreciate…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691346/proud-to-be-an-unbought-unbossed-liberated-democrat"}, {"senator": "Scott Peters", "party": "Democrat", "sentence": "…reason not to accept it. For some reason, current law prevents us from  accepting even a donation from a nonprofit that would want to help us  with the issue.\n\nMr. Chair, I say let's get out of the way. H.R. 1948 passed out of  the House on suspension in June of this year, and I hope to see it  become law on any topical legislative vehicle before us.…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698031/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…vote on it. That was prevented  for over a year.\n\nToday, we will vote on it. I thank some of my colleagues on the other  side who have had the courage to stand up and say: Let's vote. Let's  vote on this, and let the American people know how we stand. Let's vote  on this to see if we believe that tariffs cause an affordability issue.  Let's vote on this…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699971/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…deck--and gets rulings that people never thought the Supreme Court  would render, all that is left is impeachment. That is all that is  left.\n\nThere are those who would say, well, let's just wait. Why don't we  wait. They told Dr. King to wait. One of the things that Dr. King said  in response to this notion that we must wait was: ``The time is always…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698076/liberty-and-justice-for-all"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…by 100 Senators  all voting yes in 1974.\n\nI encourage my colleagues, as they get together in their caucuses on  the blue side of the aisle or the red side of the aisle, to say: Let's  hold on. This is wrong. This is not what the President campaigned on.  He campaigned on being a champion for families--not for billionaires,  to screw over families, to…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693102/one-big-beautiful-bill"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…kill them. It is too much of a burden to make sure a  respirator actually fits. It is too much red tape to make sure a  worker's lungs can survive the shift.\n\nWhat do you say?\n\nLet's be clear: Miners and workers didn't ask for these rollbacks.  The only people calling for these changes are the lobbyists and  executives who have never stepped foot inside…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695577/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…choose red States and  hurt blue States, even though my State has millions of Republicans who  deserve to have their communities safe as well?\n\nI am standing today just to say, let's use common sense and help our  police officers together; get the resources desperately needed out to  our communities now and not let this fall victim to something that…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696004/unanimous-consent-requests"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…this, it is because  they don't give a crap about the cost of your healthcare. They don't  give one single crap about it.\n\nSo I hope my colleagues find it in their hearts to say: Let's fix the  system, fine. But at least for now, give us a 1-year extension so we  can have a real conversation.", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696657/continuing-appropriations-and-extensions-act-2026"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…attempt to be  able to have the Hyde amendment actually included in that. That was  actually put in in the House of Representatives when they sent it over  to the Senate to say: No, let's include the Hyde amendment in this like  we do every other part of our healthcare agreement.\n\nWhen it came to this body, though, my Democratic colleagues stripped  that…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699097/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Keith Self", "party": "Republican", "sentence": "…in the military, this is a serious  matter.\n\nI urge my colleagues to support this amendment and ensure full  transparency. Our constituents demand transparency today, and I say  let's give them transparency. I yield back the balance of my time.", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689034/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…more taxes  to fund DEI musicals in Ireland and no more tax dollars to fund  electric vehicles in Vietnam.\n\nTaxpayers, Mr. Speaker, have said enough is enough. I say enough is  enough. Let's pass this bill, Mr. Speaker, and let's go get them.", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692531/rescissions-act-of-2025"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "…back in 2017,  jobs were created. And until the pandemic was visited upon the whole  world, jobs were created and revenue rose for the United States of  America. I have to say that.\n\nLet me also say this: There have been times, very recently, when the  Democratic party controlled the Presidency, the House of  Representatives, and the U.S. Senate. And even…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696110/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…retirement.\n\nDoes anyone care? Does anyone care? What is wrong with this place?  The immorality that the next generation will be poorer than us--but we  are not allowed to say that because, let's be honest, people want more  stuff. If we keep giving them more stuff, they vote for us. They might  even contribute.\n\nLook, let's just continue to do some of the…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698698/congress-is-a-math-free-zone"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…of discussion, more and more Democrats came on  board. And now we have a supermajority of Members of this body right  now to be able to vote on it today who are willing to say let's vote on  it. We have a supermajority. We have plenty of folks who are willing to  be able to step up and say that is a reasonable thing to be able to do.  The problem is,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695311/cloture-motion"}, {"senator": "Chris Coons", "party": "Republican", "sentence": "…AIDS--decision after decision that moves us in  the wrong direction, that makes us sicker, poorer, and more divided.\n\nI am usually one of the first to walk across the aisle and say: Let's  find a solution. Let's find a way out of this. And I have been doing  that in recent days, talking with colleagues. But I can't see a way  forward if we can't change direction…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695942/government-funding"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…said: Don't give the money to the  money-sucking insurance companies; give it to the patient--or something  like that. President Trump has a way with words. So, however you say  it, let's give the patient the power.\n\nBecause President Trump endorses it, though, I do think that  Republicans will by and large support it, that there will be a vote in  the…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697554/healthcare"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…trade  any individual stocks. It is all a mutual fund.\n\nPresident Trump said if Congress passed a bill banning stock trading  for Members of this body, he would sign it. I say let's give him that  opportunity. Let's first see if Congress has the guts to stand up and  do what is right. I sure as heck know that is what I will do.", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690429/the-first-100-days"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…interest payments, and there is this concept  called a term premium. When we make the bond markets nervous, we pay  higher interest rates. So the clown show will go around and say: Well,  let's just not pay our debts. Hey, we are up against the debt ceiling.  Let's just not raise it.\n\nOkay. Fine. I mean, enjoy your decade of world depression because  when you…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689025/tell-the-truth-about-math"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…exactly  the same as every other organization on any college campus? That should  be basic.\n\nSo I bring a very simple bill to be able to resolve that one big  issue and to say let's make this once and for all just a policy that we  have as Americans.\n\nNow, I bring this up because it needs to be addressed, but I also  bring this up because next week,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695773/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…Democrats are doing. The American people know what this is.  They know Democrats have nothing else to run on because of the success  of this administration.\n\nMr. Speaker, I say let's vote ``yes'' on this resolution, and then  let's get focused on making sure we are doing what the American  families elected us to do.\n\nMr. VAN DREW. Mr. Speaker, today…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696818/epstein-files-transparency-act"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…2012 that Democrats in the Commonwealth of  Virginia, including some of my esteemed colleagues on the other side  from that great Commonwealth, thought it was appropriate to say: Let's  close that down early.\n\nIt opened in 2012 with a 50-to-60 year life expectancy, and they  wanted to close it down somewhere around 2035 or 2040, well before its  life expectancy…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694880/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…us.  He is a former majority leader here. Now, he is on Wall Street. He  said: Do we really think the bond market isn't going to notice if we  just do this pretend thing and say let's call this thing current  policy, so we will keep the current tax regime. Yes, it means financing  another $5.5 trillion, plus another $1.3 trillion of interest on top of…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688651/a-real-math-problem"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…driving up  premiums.\n\nWe are debating the next 24 hours, trying to be able to come to two  sets of solutions here. My Democratic colleagues are bringing a  proposal tomorrow to say: Let's just take the subsidies that we did  during COVID and let's extend those 3 more years, and we will just do  that, no reforms, no changes, no anything else. Let's just do…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697814/9999"}]