[{"senator": "Al Green", "party": "Democrat", "sentence": "…use softer  language because the word ``racism'' is incitive, according to CNN.\n\nWell, CNN is saying to the world, they want to end anti-Semitism, as  I do, but they are saying they want to manage racism. CNN manages  racism by not allowing it to be addressed and confronted to the same  extent as they would allow anti-Semitism to be addressed.\n\nAgain,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695338/dark-days"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…those people who are a part of the news media who  will bring me up and say things about me but won't allow me to respond  to them. You know who you are. But, as I was saying, I want people to  know about this courage and the pushback and the antithetical forces. I  want people to know about it, and I want people to know that I  understand what happened…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698076/liberty-and-justice-for-all"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…Republicans are going along with  that.\n\nMaybe we could put more charging stations across the country to make  it easier for people to drive all-electric vehicles. No. Trump is  saying we want to take away all those tax breaks too. Let's just make  it easy for the Chinese to take over the electric vehicle industry of  the 21st century. Let's just hand it over…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691549/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…new requirements for beneficiaries, for those  who are on Medicaid, work requirements.\n\nSome say: Well, I don't have a problem with people going to work.  They are also saying: We want seniors, we want folks who are disabled,  we want the elderly, we want those folks to be schlepping down the  street trying to find a job in this market, of course, when…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691088/big-backstabbing-bill"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…that this is consistent with  what all of us say and was said in the committee yesterday. Mrs.  Houchin said it particularly well, and others on the committee, when  saying that they want the information necessary to make solid  decisions. If we adopt my amendment, that will accomplish that  objective.\n\nMr. Speaker, I urge my colleagues to vote against…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699075/providing-for-consideration-of-hr-financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…victims were asking for outside this Capitol just a  few minutes ago, the survivors, the survivors of Mr. Epstein and Ms.  Maxwell. Listen to what the survivors have been saying. They want the  Massie-Khanna bill passed. They want something with teeth in it that  will force this administration to comply because they don't trust that  they will.\n\nLeger Fernandez),…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694886/providing-for-consideration-of-hr-energy-and-water-development-and-related-agencies-appropriations-act-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-north-dakota-field-office-record-of-decision-and-approved-resource-management-plan-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan-and-for-other-purposes"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…saying,  which is that this applies only to handguns. Otherwise, you are just  multiplying  the proliferation of regulations which I thought you were opposed to.\n\nNow you are saying we want the GSA to issue a whole bunch of  regulations to do the work that Congress refuses to do. I think you are  moving a little bit closer to what Congresswoman Demings' original…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691349/federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…those who vote to table are indicating that they  don't think it should be an actual vote or that there should be an  actual vote on the articles themselves. They are saying they want to  put this off. If that is their opinion, they can do that. That is not  my opinion.\n\nThere needs to be a vote not only on this motion to table that will  be presented,…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697472/president-trump-is-a-threat-to-our-republic"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…their healthcare.\n\nThey are proposing failed policies, not breakthrough ideas, not a  bold vision that I know is in America's heart.\n\nThis repeal that some folks are saying that they want to do to save  money, the hatred for the previous President--they want to repeal  Biden-era rules that made Medicaid and CHIP enrollment easier, less  redtape, easier…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…big corporations. Every  millionaire, as I stated before, because of Republicans, are getting an  $80,000 tax break, every millionaire in this country.\n\nWhat we are saying here is we want to make sure that health insurance  is affordable for every single person in this country, and Republicans  are replying by: We can't be bothered with that. That is…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698312/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "…things fair and honest in government.  It is a simple rule that protects all of us. We can't let anyone ignore  it. By properly enforcing the Hatch Act, we are not just saying that we  want to protect our democracy. We are actually doing it.\n\nThis protects our government workers, our agencies, and our whole  country. There have been extreme violations of…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690819/gross-violations-of-law-by-trump-administration"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…a month now is $789 a month. So  sometime in the fall--it depends on the State, in October, November,  and some people in December--people are going to get a letter, saying:  If you want to stay on the same healthcare plan, here is your new  price. And those new prices are going to be astronomical.\n\nNow, we do have a disagreement between the parties.…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693485/one-big-beautiful-bill-act"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "…health  outcomes at CBP.\n\nIn 2023, CBP launched the Support Canine Program, which aims to  improve mental health resources for CBP personnel.\n\nHere in Washington we have a saying: If you want a friend, get a dog.  That is exactly what this bill is doing. My bill builds upon this goal  by establishing a pilot program through the Department of Homeland  Security…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696972/providing-emotional-assistance-with-relief-and-love-act"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…wing of the Democratic Party want us to put it  back. They want us to let people cheat.\n\nWhat else are the socialists asking for in this $1.5 trillion? Well,  they are saying: We don't want people who can work to work.\n\nWe put a provision in our bill that the Congresswoman and the  socialist wing of her party want us to take out that says: Look, if you…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695979/government-funding"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…it. I think Jesus emphasized the truth and the fact       that he was always telling it because he understood the       inherent deceitfulness of the world. He was saying, if you       want the pure truth, look to me.\n\nAt the end of Revelation we see the importance of this       issue when it says that everyone who loves and practices       falsehood…", "date": "2025-08-26", "source_url": "https://justfacts.votesmart.org/public-statement/1694761/recognizing-campbell-the-nature-of-truth-odessa-american"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…microphones this last  week, how many of our brothers and sisters here, how many of the  public, how many of the armies of lobbyists that are in the hallways  here lined up saying they want more spending, more money, more  regulation on their competition understand this. Let's go through some  of the basic math facts, and then let's have a brutally honest…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688651/a-real-math-problem"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…running around the building saying: No, the  duplicate scans are part of our profit model.\n\nWhere are my own brothers and sisters, particularly on the  conservative side, saying: We want to unleash technology. We want to  unleash doing this a better, faster, and cheaper way?\n\nFor those Members who run around saying: PBM reform. Fine, but  understand that…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697873/turning-healthcare-into-financial-engineering"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…their  earned benefit in Medicare, saying that we have fee-for-service, but  you have to pay all of these copays. What would happen if you could  align the incentives saying that we want insurers to manage a portfolio  of access to healthcare, but within that, those insurers will actually  make their money by helping you be healthier?\n\nThe model, which…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691518/truth-telling-with-math-and-facts"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…Speaker, everybody who votes ``no,''  make no mistake about it, everybody who votes ``no'' is going to be  asked a question by that waitress making $32,000 a year saying: Why do  you want me to pay more money on my tips so that $10 billion of fraud  goes out in the SNAP program? You are voting against cleaning it up,  and you voted against no tax on…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693191/one-big-beautiful-bill-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…other ways and I keep  struggling to find ways to get folks to take this seriously.\n\nOnce again, Mr. Speaker, the hallways will be full of people knocking  on  our doors, saying: We want more money.\n\nThey don't show up to say: Hey, we have an idea to do something  better, faster, and cheaper. We want a free market. We believe in  creative destruction.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695567/we-are-borrowing-a-second"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…tax paid with  interest.\n\nWe have a society who so desperately wants free stuff. They want  money. The 100 times I have come behind this microphone and show the  charts saying, I want every dime of my Social Security. Of course. Of  course. Most people don't realize the Social Security formula actually  is progressive. If you are a high-income earner,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694915/facts-and-math"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…spending in the United  States, we have to double every single tax. That is the morality of  this place.\n\nFor the lobbyists and the groups that are walking our Halls saying,  ``We want more spending. Don't do this horrible, devastating 2 percent  cut in spending over the next 10 years,'' I say: Thank you for screwing  over my 2-year-old. You are absent…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690586/economic-anxiety"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…people say, current policy baseline, just do it.\n\nWe have been trying to do the math. The Congressional Budget Office,  a couple of months ago, actually did a projection saying that if we  want to maximize economic growth over the next 10 years, what you do is  extend those tax cuts but pay for them. The basic idea is that by  paying for them, you don't have…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689025/tell-the-truth-about-math"}]