[{"senator": "Mike Thompson", "party": "Democrat", "sentence": "…assure the whole House and the American people  that extending the Trump tax cuts is not free. In fact, we have a  recent estimate from the Joint Committee on Taxation that says that  extending the Trump tax cuts costs $4.6 trillion.\n\nThis is $4.6 trillion that will be added to the debt. Not only does  extending the Republican Trump tax cuts cost an…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690628/republican-tax-cuts"}, {"senator": "Scott Peters", "party": "Democrat", "sentence": "…of tax cuts, many of which are for the wealthy.  Some may be for the nonwealthy, but much of it is for the wealthy. It  is the wrong thing to do.\n\nEvery independent analysis says this will not lower the budget  deficit but will increase it. Mr. Speaker, if you don't believe me,  look at when we vote for the debt ceiling increase; $5 trillion to $18…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689899/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "…for the gentleman from Texas that  these are not Federal circuit judges. They have the same jurisdiction  as State and local judges. That is what actually the bill presented  says. These are local judges. They are not circuit judges. They are not  Federal judges.\n\nLet's be clear what this is about. This is about allowing Donald  Trump to select local…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695613/district-of-columbia-judicial-nominations-reform-act"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…fight for it. That is because each time we let  ourselves be cowed and each time we yield to fear, our rights narrow.\n\nI have before me the Preamble of the Constitution. It says, ``We the  People of the United States, in order to form a more perfect Union,  establish justice''--it is right up there at the top. This is why we  wanted to ``form a more…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690393/attacks-and-threats-on-democracy-and-rule-of-law"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…wrong?\n\nThey also stopped our efforts against Ebola. Some of the charities  were barely getting by. They have gone bankrupt. They pulled their  people out of Africa. Then he says: Oopsy-daisy, we are going to start  that again.\n\nWhat a way to run a government. There are people who are going to get  Ebola as a result of this oopsy-daisy mistake, and that…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688265/problems-caused-by-doge-cuts"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…respond. They don't take the images off the internet. They don't come  to the rescue of people who are victims. That is why this legislation  is critical, because this legislation says that if they are guilty of  such reckless misconduct, they can be sued for it and held civilly  liable for the damages.\n\nImagine losing control of your own likeness and identity.…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698999/disrupt-explicit-forged-images-and-non-consensual-edits-act-of-2025"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…the ``Putinization'' of our strategy to Ukraine, and  the Secretary of State has been entirely complicit in it, from all the  signs that I see.\n\nSo when you have somebody who says one thing and, in the case of  Secretary Rubio, who actually lived it--he was actually an ardent  advocate for defending Ukraine. Then you get into Trump zone, and  suddenly…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690667/nomination-of-frank-bisignano"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…getting little, if anything, in return. Who knows  what Trump's tariff policy will be in 90 days?\n\nIf I were a businessperson, I wouldn't count on what he is doing or  what he says today that probably won't be in effect in the next week or  the next 3 weeks.\n\nEven under this ``deal,'' tariffs are still significantly higher than  they were before Trump's…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690986/tariffs"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…Senator Risch asked: Confirm that U.S.  military personnel are no longer involved in hostilities in Venezuela.\n\nSecretary Rubio wouldn't confirm that either. All Secretary Rubio  says is: There are currently no U.S. Armed Forces in Venezuela.\n\nWhat about the boat strikes? What about the naval blockade? What  about the naval seizure of Venezuelan oil? Those…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699109/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Jahana Hayes", "party": "Democrat", "sentence": "…Education keep promising that there is a plan. I haven't seen anything  articulated. We don't know what happens next. We don't know how these  services will be provided. He says that some things will go to HHS, and  a small business will handle student loans.\n\nFor anyone who has actually worked in education, you know that by  April, you are closing…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689644/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Nanette Barragán", "party": "Democrat", "sentence": "…every Medicaid recipient is a person whose life depends on it.\n\nBrian Gutierrez, a constituent from South Gate, California, lives  with spina bifida, a lifelong disability. He says: For many of us,  these cuts are not abstract numbers. They are the difference between  stability and crisis, between life and death. I am healthy today  because Medicaid stood…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690849/keep-your-hands-off-medicaid"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…voting ``yes'' because their  conscience changed. They are voting ``yes'' because Donald Trump tells  most of them how to vote, and he realized he has lost on this one.\n\nHe says that people who support this bill ``betrayed the entire  Republican Party.'' Really, really? How is accountability for a  pedophile, something Donald Trump campaigned on, how…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696904/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision-providing-for-consideration-of-h-con-res-denouncing-the-horrors-of-socialism-providing-for-consideration-of-hr-unlocking-our-domestic-lng-potential-act-of-providing-for-consideration-of-hr-researching-efficient-federal-improvements-for-necessary-energy-refining-act-providing-for-consideration-of-hr-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-providing-for-consideration-of-hr-district-of-columbia-cash-bail-reform-act-of-and-for-other-purposes"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…because they are someone of color or the  videos of two White friends with one Latino friend, and it is the  Latino they would go up to and say, ``Are you legal?'' And the Latino  says, ``Yes, I am,'' and they still throw them in the car, maybe  because they could get a bounty. The number of people that were stopped  multiple times, the Somali police officers…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700059/9999"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…feels a  deep sense of belonging, where every person's humanity is honored, and  where we truly love our neighbors as ourselves.\n\nMay she inspire us to build an empire, as she says, of hope,  solidarity, and compassion.\n\nAs I close, I am reminded of the words of Mother Cabrini. I thank all  of my colleagues who have joined today's Special Order on Holding…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692932/holding-power-accountable"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…this  body is praying that the cease-fire that is in place now, for a couple  of days, works and that it holds.\n\nI know everybody is praying that when the administration now says  they are interested in a diplomatic resolution to this program, that  they will have learned that they shouldn't tear up diplomatic deals  that they did in 2018 but instead…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693124/motion-to-discharge-sj-res-59"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…to use it for insurance, real insurance, that you can go get, a  catastrophic coverage and/or direct primary care, all sorts of plans  out there where you have a doctor who says: Look, for $100 a month, you  can call me. I am at your call. I will do this kind of service.\n\nAnother option is health sharing, whether it is secular or faith- based, where…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698106/bringing-america-back-to-its-roots"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…that this bill does two and only two things. By the  way, these are things that we already do in Florida today, and we don't  have issues with our elections.\n\nNumber one, it says you have to show a photo ID in order to vote.  This is something that people overwhelmingly support because we have to  do it in every aspect of our lives.\n\nSecond, it says…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700011/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…need here.\n\nWe took in 850,000 last year on a rolling 3-year average. I still  believe we are at the all-time high of even more than that. We should  be reminding anybody who says we are mean or not doing our share of  taking in people who would rather live here that, in fact, we took in  850,000 naturalized citizens; those are new citizens.\n\nThat is…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689133/educating-young-people"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…year and said that such  monsters as these must never be admitted into our country, never given  safe haven on our soil, and never tolerated where they are found.\n\nH.R. 176 says that anyone associated with Hamas or Palestinian  Islamic jihad, in any capacity, or anyone who assisted these terrorist  activities in any form, will not be allowed in this…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697237/no-immigration-benefits-for-hamas-terrorists-act-of-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…demographic.\n\nI am not going to explain all of this chart, but I am basically going  to tell you, if you look at the financial lines on this chart, Mr.  Speaker, it basically says, in 3 years, over half the money this  Federal Government spends will go to those 65 and up. In 3 years, half  the money we spend will go to those 65 and up.\n\nNow, I need you…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698698/congress-is-a-math-free-zone"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…ready munitions enterprise. The prohibitions on new program starts  under a CR effectively put high-priority service modernization efforts  literally on ice.\n\nThe administration says it wants ``flexible and efficient''  investments. Well, there is nothing flexible, efficient, resilient, or  lethal about running the national defense enterprise on a full-year…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695989/9999"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…It was read last night in Anchorage; it was read  last night in DC; and for the Marine Corps balls today and tomorrow on  November 10, it will be read there. Here is what it says--remember,  this is from 1921, but it kind of gives you a sense of how we feel  about our illustrious Corps. It is a message from the Commandant of the  Marine Corps, republished…", "date": "2025-11-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696624/recognizing-the-250th-anniversary-of-the-united-states-marine-corps"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…drove him to  join this elite regiment.\n\nFrank was very proud of both of his sons, Frank E. Cook IV (Frankie)  of Jersey City, NJ and Anthony Guidi of Aloha. OR. As Frankie says,  ``My dad wouldn't want anyone to cry over him.'' So today Mr. Speaker,  we won't cry over him but rather honor this man as a veteran, a father,  a brother, a son, and an American.", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696142/recognizing-frank-esten-cook-iii-and-his-service-to-his-country"}, {"senator": "Barry Moore", "party": "Republican", "sentence": "…its immediate consideration in  the House.\n\nThe Clerk read the title of the bill.\n\nMr. MOORE of Alabama.  875.\n\nMr. Speaker, today we consider a simple, commonsense bill that says  if you are a guest in our country and you drive drunk, you should, in  fact, be deported.\n\nTo the average American, passing this bill is a no-brainer. Even in a  polarized…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693084/jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-2025"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…Chair, I thank my good friend, Judge Carter, for  yielding me time.\n\nMr. Chair, I rise today in support of this important piece of  legislation. Prioritizing veterans and troops says everything about our  values, and that is exactly what this first fiscal year 2026  appropriations bill does.\n\nThe Military Construction, Veterans Affairs, and Related Agencies…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692942/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…There are a bunch of groups out there--all conservative--that have  had their phone records looked at, too, but we are not going to give  up. No matter what Senator Peters says, we are going to look at it.  There is Turning Point USA. There are a lot of shenanigans going on out  there with Jack Smith, and we are going to look at it, whether you want…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699105/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Thom Tillis", "party": "Republican", "sentence": "…not have taken the position on.\n\nNo. 1, he doesn't speak for the U.S. Government. He speaks for the  President of the United States, and on that basis, he can. But when he  says that the U.S. Government thinks that Greenland should be a part of  NATO, he should talk to people like me who have an election certificate  and a vote in the U.S. Senate, because…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698624/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…kicking disabled people off of Medicaid,  it is an absolute lie.\n\nLook at pages 16 and 17 of the legislation. It will take about 60  seconds to read it. That is exactly what it says.\n\nMs. FOXX.\n\nMs. FOXX. Mr. Speaker, I would say nice try to the gentleman from  Massachusetts (Mr. McGovern).\n\nMr. WILSON of South Carolina. Mr. Speaker, I thank Chairwoman…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693234/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…them, let alone how Congress is supposed to figure out  how the laws that we have passed are ultimately being enforced and  administered?\n\nThis is a commonsense measure that says that all of these guidance  documents, which have real teeth when it comes to the enforcement of  regulations, need to be compiled in one place that is searchable and  accessible…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688392/guidance-out-of-darkness-act"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…remarks, but as I have talked about this and looked at it even more,  this is probably one of the most commonsense bills that will come  before this Congress.\n\nThis bill simply says if someone reenters or if someone commits a  felony, that this law applies. These comments from the other side to  try to confuse this issue, to misrepresent the issue, make…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695365/stop-illegal-entry-act-of-2025"}]