[{"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…service-disabled, and reserve-owned small  businesses.\n\nI commend Representatives Davids, Alford, and Conaway for their  bipartisan work on this bill that will identify barriers and improve  SBA's outreach to veterans.\n\nMs. VELAZQUEZ.  Davids), the main sponsor of the bill.\n\nMs. VELAZQUEZ. Mr. Speaker, I applaud Ms. Davids, Mr. Alford, and Mr.  Conaway for their commitment…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687886/successful-entrepreneurship-for-reservists-and-veterans-act"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…in strong opposition to H.R. 2966, the American  Entrepreneurs First Act.\n\nIf we really wanted to put American entrepreneurs first, we would be  debating a bill to strengthen SBA lending and make it easier to access  capital, or we could stop playing political games and finally vote to  exempt small businesses from these painful on-again, off-again tariffs.…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692125/american-entrepreneurs-first-act-of-2025"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…Development Financial Institutions, if that lapses, the  money will be withheld in funding for almost 1,500 credit unions,  banks, and community financial institutions.\n\nThe SBA would be unable to approve $170 million per day in loan  assistance.\n\nFor the Social Security Administration, thousands of Social Security  Administration employees would likely…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699573/consolidated-appropriations-act-2026"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…dealing with supply chain disruption as they  adjust to the President's tariff regime, and adopting new technologies  in order to stay competitive. These economic headwinds make SBA  services more important than ever.\n\nThe bills before us today reflect the monthslong, bipartisan effort  to strengthen the services offered by the SBA and bolster the support…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697219/made-in-america-manufacturing-finance-act"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…to gut the infrastructure that  helps small businesses survive.\n\nThey have attacked the Small Business Administration. They have a  bill on the floor this week that would take SBA out of our communities.  They slashed the New Mexico Minority Business Development Agency. We  are talking about millions of dollars in lost revenue. They paused Job  Corps…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691939/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…their operations, many still do not  know how to access it responsibly. If used incorrectly, AI could have  disastrous consequences.\n\nThat is why it is incredibly important for SBA and its  entrepreneurial ecosystem to help small businesses understand the  potential pitfalls and learn how to avoid them.\n\nMadam Speaker, I am pleased to support this bipartisan…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699178/ai-for-main-street-act"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…businesses can operate on a level playing field.\n\nThis bill requires the Small Business Administration to ensure that  small businesses located in rural areas have full access to SBA  disaster assistance in the wake of a natural disaster.\n\nThe SBA's disaster loan program serves as a lifeline for small  business owners in need of capital to repair, rebuild,…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687930/rural-small-business-resilience-act"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…ongoing evolution. This is why AI literacy is  crucial for small businesses to keep up with their larger competitors  considering and adopting AI.\n\nThe AI-WISE Act will direct SBA to create online AI literacy  resources for entrepreneurs, so they have the tools to make sound  choices on AI adoption and use. It will also direct the SBA to keep  their resources…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699205/artificial-intelligence-wisdom-for-innovative-small-enterprises-act"}, {"senator": "Derek Tran", "party": "Democrat", "sentence": "…accessible language in their  contracting opportunities.\n\nI am proud to co-lead this bill, and I thank the gentleman from Long  Island (Mr. LaLota) for working with me to improve the SBA and simplify  the Federal contracting process. Let's continue to empower local  businesses and ensure that every entrepreneur has the opportunity to  succeed.\n\nMr. Speaker,…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691852/plain-language-in-contracting-act"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "Mr. Speaker, I rise in support of H.R. 1804, the 7(a) Loan Agent  Oversight Act.\n\nThe 7(a) loan program is the SBA's largest traditional lending  program, providing access to capital for small businesses that cannot  find it elsewhere. In fiscal year 2024, SBA approved more than 70,000…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691856/9999"}, {"senator": "Herb Conaway, Jr.", "party": "Democrat", "sentence": "Mr. CONAWAY. Mr. Speaker, I rise today in support of H.R. 4495, the  SBA Fraud Enforcement Extension Act. I am the co-lead on this  legislation, along with my friend, colleague, and fellow Air Force  veteran, Representative Downing.\n\nDuring the COVID-19…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697228/sba-fraud-enforcement-extension-act"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…Transparency and Predictability in Small Business Opportunities Act,  would improve accountability in the Federal contracting process for  small businesses.\n\nThe bill would require SBA to issue rules requiring that when an  agency cancels a solicitation, they must share a justification for why  they are canceling the solicitation and provide information about…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691761/transparency-and-predictability-in-small-business-opportunities-act"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…Business Administration. Most  people in my district are interested in their hustle, their small  business that they are trying to get off the ground. I thought that was  why the SBA was developed, designed, and created: to help start  businesses. Now, we have a President who wants to cut that, maybe  because he wants all the money.\n\nWe have a President,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695040/better-is-possible"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…States.\n\nEarthQuaker Devices employs 34 workers and offers premium health  insurance, paid sick leave, a 401(k) match, and competitive wages.\n\nIn 2019, they were recognized as the SBA Exporter of the Year. In  2022, after decades of success, they invested in a state-of-the-art  automated production line.\n\nThis is what American manufacturing should look like,…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691573/earthquaker-devices-sounds-the-alarm"}, {"senator": "Sharice Davids", "party": "Democrat", "sentence": "…At a time when harmful  Federal worker layoffs at the VA are making it harder for veterans to  access support, this legislation is more important than ever. By  strengthening SBA programs, we are investing in our veterans, creating  jobs, and boosting our local economies.\n\nMr. Speaker, I urge my colleagues to support this bill and show our  veterans…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687887/successful-entrepreneurship-for-reservists-and-veterans-act"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…debate only.                                General Leave\n\nMr. Speaker, my colleagues and I are here today to debate the rule  providing for consideration of H.R. 2931, the Save SBA from Sanctuary  Cities Act; H.R. 2966, the American Entrepreneurs First Act; H.R. 2987,  the CEASE Act, which will be considered under a closed rule; and H.R.  2483, the SUPPORT…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691940/providing-for-consideration-of-hr-support-for-patients-and-communities-reauthorization-act-of-providing-for-consideration-of-hr-save-sba-from-sanctuary-cities-act-of-providing-for-consideration-of-hr-american-entrepreneurs-first-act-of-and-providing-for-consideration-of-hr-capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…manufacturers access to capital at a level they need to  start or grow their operations.\n\nThis legislation increases the loan limit for small American  manufacturers under the SBA's 7(a) and 504 lending programs from $5  million to $10 million.\n\nThis will provide American manufacturing the capital they need to  invest in new technology, hire, grow, and…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697220/made-in-america-manufacturing-finance-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…solicitations are often canceled by agencies  with no explanation provided to the businesses that have already  submitted proposals.\n\nH.R. 789 will require agencies to share with the SBA information as  to why the solicitation was canceled. Moreover, this bill requires  agencies to assist small businesses impacted by the canceled  solicitation by identifying…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691760/transparency-and-predictability-in-small-business-opportunities-act"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…companies. That is why I am proud to co-lead H.R. 5784, the  AI-WISE Act, with my colleague, Representative Scholten.\n\nThe AI-WISE Act directs the Small Business Administration, the SBA,  to establish educational resources on AI for small businesses through  its online learning platform. In doing so, this legislation seeks to  provide small businesses with…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699207/artificial-intelligence-wisdom-for-innovative-small-enterprises-act"}, {"senator": "Robert Bresnahan, Jr.", "party": "Republican", "sentence": "Mr. BRESNAHAN. Mr. Speaker, my bill, the Capping Excessive Awarding  of SBLC Entrants Act, or the CEASE Act, restores a vital piece of  integrity to the flagship SBA 7(a) loan program.\n\nThe Small Business Administration is authorized to issue government- backed 7(a) loans through certified depository institutions, like banks  and credit…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692066/capping-excessive-awarding-of-sblc-entrants-act-of-2025"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…Allocation for                                   Newcomers Act of                                   2025, as amended. H.R. 4491......................  SBA IT              None..............  None.............  ....................                                   Modernization                                   Reporting Act.…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697267/expanding-wksi-eligibility-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…storms  of last season, even as we prepare for the next.\n\nToo often, small businesses and disaster survivors in rural  communities are unaware of the critical assistance the SBA provides  after disasters. That assistance can be the difference between staying  open or shutting down for good.\n\nRural small businesses face unique challenges. Disaster recovery…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687929/rural-small-business-resilience-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…in  other programs, such as service-disabled veteran-owned small business  contractors. Now, it is time to do the same with the WOSB program to  help ensure integrity across SBA programs.\n\nWhile we continue to have conversations on how to better align small  businesses' contracting goals with merit-based principles, this bill  would reduce the ability…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691798/wosb-accountability-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…Government prior to the date of       the enactment of this Act.\n\nMr. Speaker, I rise today in support of H.R. 825, the Assisting Small  Businesses Not Fraudsters Act.\n\nMr. Speaker, SBA financial assistance programs are critical to  entrepreneurs. Unfortunately, fraudsters infiltrated pandemic-era loans  at an alarming rate. An estimated $200 billion was stolen…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687935/assisting-small-businesses-not-fraudsters-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…remains out of reach because they lack the staff, the expertise, or the  capital to do so.\n\nMadam Speaker, the AI for Main Street Act helps address this  challenge by directing the SBA's Small Business Development Centers, or  SBDCs, to assist small businesses in developing AI technologies into  their operations.\n\nThese centers operate in partnership with…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699179/ai-for-main-street-act"}, {"senator": "Michael Cloud", "party": "Republican", "sentence": "…advances another pillar of  President Trump's America First agenda with the passage of the American  Entrepreneurs First Act of 2025.\n\nThis bill ensures that taxpayer-funded SBA loans are reserved for  American small businesses, not illegal aliens, certainly not children  or people who are dead.\n\nAmericans are grateful to finally have a President in…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692127/american-entrepreneurs-first-act-of-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…getting loans at the Small Business Administration.\n\nForgive my math. I am doing this from memory from last week. There  were like 3,300 people who were over 114 years old who got SBA loans.  Mr. Speaker, $300 million in loans. Can you believe not a dollar has  been paid back?\n\nWhat would happen if there was a way to eliminate waste and fraud  without an…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689025/tell-the-truth-about-math"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…the American  Entrepreneurs First Act of 2025, introduced by Representative Van Duyne  from the great State of Texas.\n\nFor 4 years under the Biden-Harris administration, the SBA approved  loans for illegal immigrants despite their ineligibility. This bill  requires citizenship verification of SBA loan assistance applications  to ensure that taxpayer-backed…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692123/american-entrepreneurs-first-act-of-2025"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…thank the lead of this bill, the  gentleman from California (Mr. Tran), for his work on this bill.\n\nI appreciate the opportunity to serve as co-lead on this legislation.  The SBA's 504 program helps small businesses to grow, create jobs, and  invest in their communities. Since this program uses taxpayer-backed  loans, it is important that we properly…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699185/504-program-risk-oversight-act"}, {"senator": "Dave Joyce", "party": "Republican", "sentence": "…funding for D.C. to  support events in the capital, like America's 250 celebrations,  Memorial Day, and Labor Day.\n\nFinally, $2.8 billion is provided for the SEC, FTC, FCC, GSA, SBA,  and more than 20 independent agencies.\n\nThis bill will enable the GSA to reduce the number of Federal  properties on the Federal Government's deferred maintenance list. It…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699055/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}]