[{"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…talking points by admonishing Ukraine and falsely suggesting  that she started the war.\n\nThat is false.\n\nRussia initiated its invasion of Crimea in 2014 and the larger full  scale of invasion of Ukraine in 2022. It is just amazing what the  Ukrainians are doing. In trying to negotiate a cease-fire between  Ukraine and Russia, President Trump and Vice…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691084/liberty-versus-dictatorship"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…engine of  growth.\n\nSo I have heard from small businesses all across Massachusetts, all  across our country, about how they are forcing those businesses to lay  off employees, scale back benefits, or even shut their doors in some  cases.\n\nI spoke with Brandale Randolph, founder of the 1854 Cycling Company,  an electric bike manufacturer based in Massachusetts,…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691549/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…and make clear what data grantees are responsible for  collecting.\n\nThis bill would also compound this issue by requiring grantees to use  the Columbia-Suicide Severity Rating Scale to screen participants for  their baseline mental health when entering the program. While this  scale is a widely accepted, clinically validated behavioral health  screening…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691508/no-wrong-door-for-veterans-act"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…States has a moral obligation  to use its power to end this tragedy. A critical step is demanding the  U.N. Relief and Works Agency is immediately reinstated in Gaza for  large-scale aid delivery.", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694108/ongoing-massacre-in-gaza"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…economy in  the world.\n\nWe have proven that is what is good for clean air and is good for  business and the economy. And that is something that you all ought to  replicate and scale up, not fear and stifle. We have to be able to do  both--protect our planet, strengthen our economy.\n\nCalifornia has shown us the way. We can have reliable cars. Our kids…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691620/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…nearly one-half century.\n\nIn that moment, the Court did not just revoke a legal precedent, they  set in motion a wave of chaos, cruelty, and control. What followed was  a full-scale assault on reproductive healthcare: abortion,  contraception, IVF, and even access to emergency care.\n\nIn Ohio, we felt the effects immediately. Just hours after the Dobbs…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692969/dobbs-decision-anniversary"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…narrowly tailored bipartisan bill to support the completion of this  project.\n\nThe administration has no problem subsidizing water for certain  stakeholders, including large-scale agricultural projects, yet when it  comes to a tailored bill to ensure access to safe drinking water for  rural communities, unfortunately, the President has taken a different…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698699/finish-the-arkansas-valley-conduit-act-veto-message-from-the-president-of-the-united-states"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…Human Rights Day, which marks the adoption of the Universal Declaration  of Human Rights in 1948.\n\nAfter the atrocities of World War II, world leaders understood that  large-scale abuses do not begin with mass violence. They begin when  governments cut off basic rights, freedoms, and silence their own  people. The declaration was an effort to build a…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697939/international-human-rights-day"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…the Protection of Pupil  Rights Amendment, or PPRA.\n\nIt is worth noting that there is no evidence that foreign entities of  concern are contributing to public schools at any scale. We have  already noted that there are five Confucius Institutes throughout the  United States, throughout 15,000 school systems.\n\nH.R. 1049 would impose new layers of reporting,…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697440/transparency-in-reporting-of-adversarial-contributions-to-education-act"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…wireless network can  compromise critical services in transportation, healthcare, finance,  and public safety. As our reliance on digital technologies increases,  so too does the scale and sophistication of these threats, especially  with the rise of artificial intelligence.\n\nWhile AI holds tremendous potential to improve efficiency, optimize  networks, and…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693498/ntia-policy-and-cybersecurity-coordination-act"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…carrying food and lifesaving aid sit blocked at the  border while Palestinian families starve.\n\nInstead of agreeing to a cease-fire, war criminal Netanyahu is now  preparing a full-scale assault to ethnically cleanse and forcibly expel  the entire Palestinian population from Gaza and to flatten and  permanently occupy the land. This was always their plan. He…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691384/the-nakba-never-ended"}, {"senator": "Katherine Clark", "party": "Democrat", "sentence": "…table, raise  the cost of getting healthcare, and use that money, deserving  taxpayers' money, to cut billionaires' taxes. That is it. That is the  agenda.\n\nLet's look at the scale of what Republicans are sacrificing: funding  that feeds 15 million children, a program that pays for half of all the  births in America, and a service that keeps nursing homes…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688082/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…our technology, in our science  community is proof that we need to continue forward in that vein.\n\nSince January, Donald Trump and his political allies have launched a  full-scale assault on America's scientific enterprise. Federal  investments in science power nearly every aspect of our modern life,  medical breakthroughs, clean air and water, accurate…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691396/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…is not a reliable way to counter nuclear threats.  In 80 years of the nuclear era, the only proven, demonstrated way to  reduce the risk of nuclear conflict and to lessen the scale of its  destruction is through diplomacy and negotiations.\n\nIf not for past arms control agreements, Mr. Speaker, today's  arsenals would be larger and more dangerous. If not…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694117/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…Secretary Collins are manufacturing a cynical staffing crisis at the  Veterans' Administration.\n\nEarlier this year, we learned that Secretary Collins announced plans  for a wide-scale, 80,000-plus employee reduction of the workforce at  the VA, putting the well-being of our veterans at immediate risk. There  was never any transparency for these plans, and…", "date": "2025-07-08", "source_url": "https://justfacts.votesmart.org/public-statement/1693277/veterans-administration"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…founded in  New York City, manages 57 schools, serving 22,000 inner-city children.  They are 93 percent non-White, 72 percent low-income, with phenomenal  results at an impressive scale.\n\nFor 8 years in a row, Success has a 100 percent 4-year college  acceptance rate. Its students routinely outperform more affluent school  districts, and 14 of New York City's…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "Mr. SULLIVAN.  350, a bill to direct the Secretary of Agriculture  to select and implement landscape-scale forest restoration projects, to  assist communities in increasing their resilience to wildfire, and for  other purposes, and be referred to the Committee on Agriculture,  Nutrition,…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693756/discharge-and-referral-s-350"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…but so many of the other aspects of the well-being of  Native people around the country.\n\nAs it relates to the EPA, I think, again, we have a good story to  tell here. We did scale back the overall budget, but we kept the  priorities in the right place. We fully funded the Clean Water and the  Safe Drinking Water State Revolving Funds. That is a priority…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699014/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…2020 plan was well received by most Alaskans because it was  viewed as balanced. BLM crafted a plan that was, as the Agency wrote at  the time, ``suitably specific for broad-scale management decisions. . .  . Additional site-specific analysis will occur when BLM receives an  application to approve an action on the ground. This will be done  through subsequent…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696449/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…Wall That Heals,  which will be on display in Nassau County, Florida, from April 17th  through April 21st at the Northeast Florida Fairgrounds.\n\nThe Wall That Heals is a half-scale replica of the permanent memorial  in Washington, D.C., that stands six feet tall at the center and covers  almost 300 feet from end to end.\n\nThe traveling exhibition will…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690073/town-of-hilliard-remembers-our-vietnam-veterans"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…discussions,  and I have come behind this microphone for over a decade now and feel  like sometimes I am doing a junior economics lecture.\n\nThe point is trying to say: Here is the scale of the problem, but  there are actually solutions if we can be bold, if we can be creative,  and if we can take on the entrenched incumbency of the bureaucracy and  business…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698412/fun-with-math"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…that is so  devastating.\n\nMr. Speaker, it is like we don't care about people's retirement, our  kids, the next generation, and how the hell they will actually cover  any of the scale of debt. Then we lie about what drives the debt.\n\nMr. Speaker, our best guess is we go from that $72,000 a second this  year to maybe about $82,000 a second next year. This…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690586/economic-anxiety"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…That is wonderful. Let's see. If I am doing $6.5 billion a  day, that is almost $270 million an hour. There is the fraud around  here. It is the inability to understand the scale of what is going on.\n\nLet's understand that borrowing is a tax. It is a tax paid for in the  future with your retirement, my kids, but it is a tax paid with  interest.\n\nWe…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694915/facts-and-math"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…power       systems, thermoelectric generators, advanced nuclear fuels,       and heater units.\n\n(B) Modeling and simulation, machine learning, data       assimilation, large scale data analytics, and predictive       analysis in order to optimize algorithms for mission-related       purposes.\n\n(C) Fundamental high energy physics, astrophysics, and…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688985/doe-and-nasa-interagency-research-coordination-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…failure  here. What we have instead is an agency stretching its mandate in a way  Congress never intended.\n\nBy allowing this final rule to remain intact, we are affirming that  scale alone justifies the regulation, meaning size and scope alone  justifies the regulation regardless of the conduct, the risk, or harm  to a consumer.\n\nThis CFPB approach violates…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689950/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications"}, {"senator": "Rob Wittman", "party": "Republican", "sentence": "…make sure we have not just the generation sources in place but also  the transmission systems that work together to make sure that we are  working against any sort of large-scale failure scenarios that make a  problem for us in the long term? We have to address those problems now.\n\nTo achieve this, we have to give our regional transmission  organizations…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695756/guaranteeing-reliability-through-the-interconnection-of-dispatchable-power-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…must replenish stocks of key defense       articles to fight and destroy Hamas, maintain its Qualitative       Military Edge in the region, and continue to deter broader-      scale regional conflict.\n\n(U) it is essential to the United States' national security       interest to swiftly provide Israel with the military       equipment and arms required…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688394/arms-sales-notification"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…designed to prevent--and, even more importantly, what it wasn't.\n\nBack in 1973, the goal was preventing another Vietnam. The idea was  to impose guardrails against the large-scale, indefinite commitment of  U.S. troops abroad. And in shutting that door, the law very  intentionally reaffirmed our Founders' decision to leave another door  open.\n\nThe law…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698662/venezuela"}, {"senator": "French Hill", "party": "Republican", "sentence": "…promptly to the Council, is       impracticable or insufficient to mitigate the threat that       material financial distress at the company, or the nature,       scope, size, scale, concentration, interconnectedness, or mix       of the activities of the company, could pose to the financial       stability of the United States.''; and\n\n(2) in subsection…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699822/financial-stability-oversight-council-improvement-act-of-2025"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…research over a variety of focus       areas, such as the following:\n\n(A) Modeling and simulation, machine learning, artificial       intelligence, data assimilation, large scale data analytics,       and predictive analysis in order to optimize algorithms for       purposes related to agriculture and energy, such as life       cycle analysis of agricultural…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688980/doe-and-usda-interagency-research-act"}]