[{"senator": "Kweisi Mfume", "party": "Democrat", "sentence": "…extraordinary business  acumen and strategic moves were beginning to differentiate his business  as a premier player in the entertainment industry.\n\nEntertainment Studios, once a small-scale television programming  company in Los Angeles, is now a division of the larger Allen Media  Group, and it has evolved into one of the largest cable network  portfolios in…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696283/recognizing-a-magnanimous-media-mogul-mr-byron-allen"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…turtles, divers explore historic shipwrecks,  and scientists unlock climate secrets.\n\nThis legislation would let tech moguls bulldoze right through these  waters with industrial-scale operations--massive drill rigs, heavy  machinery, and construction fleets--all without the environmental  review that everyone else would have to undergo.\n\nThe sponsors insist…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699959/undersea-cable-protection-act-of-2025"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…position in the Mediterranean, curb the free       flow of fighters and arms to conflicts raging in the       neighboring Sahel region and Sudan while also easing the       large-scale migration of African refugees to Europe.\n\n``We would like to have the involvement of United States.       And, especially with this government, they are always looking…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697384/recognizing-the-importance-of-libyas-return-to-stability"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…the House of Representatives. We passed it here in the Senate. It  included the Dream Act, and it was a step forward.\n\nI contrast it today with what we are faced with: full-scale battles  and war over immigration in cities across this country. It is  unnecessary. There are ways to resolve this fairly, humanely, and in an  American fashion. I hope the…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696348/trump-administration"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…Now, I opposed the war in Iraq from the outset. And the parallels to  what President Trump has kicked off in Venezuela are glaring. And I  absolutely will not support any large-scale military conflict in  Venezuela or a dangerous and expansive occupation.\n\nWe have a President ignoring the problems that he has caused in our  own country, all to start a war…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698684/9999"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…our technology, in our science  community is proof that we need to continue forward in that vein.\n\nSince January, Donald Trump and his political allies have launched a  full-scale assault on America's scientific enterprise. Federal  investments in science power nearly every aspect of our modern life,  medical breakthroughs, clean air and water, accurate…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691396/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "…opposition to H. Res. 516.  This resolution is a partisan, disproportionate response to the ICE  protest in Los Angeles. Republicans are intentionally misleading the  public on the scale of the  violence in an attempt to justify the blatant overreach of Federal  power.\n\nI want to be clear. There was no doubt there was violence. I am from  California. I was…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692811/providing-for-consideration-of-hr-military-construction-veterans-affairs-and-related-agencies-appropriations-act-providing-for-consideration-of-hr-special-interest-alien-reporting-act-of-providing-for-consideration-of-hr-jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-and-providing-for-consideration-of-h-res-condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…memos, our repeated and       increasingly desperate requests, pleas, and warnings,       regarding the need to implement activities to avert loss of       life on a massive scale,--and substantial risks to U.S.       national security.\n\nOn March 2, as my last official act before I was sent home,       I sent those memos to the Global Health staff, to…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691139/us-global-health-programs"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…the Protection of Pupil  Rights Amendment, or PPRA.\n\nIt is worth noting that there is no evidence that foreign entities of  concern are contributing to public schools at any scale. We have  already noted that there are five Confucius Institutes throughout the  United States, throughout 15,000 school systems.\n\nH.R. 1049 would impose new layers of reporting,…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697440/transparency-in-reporting-of-adversarial-contributions-to-education-act"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…economy in  the world.\n\nWe have proven that is what is good for clean air and is good for  business and the economy. And that is something that you all ought to  replicate and scale up, not fear and stifle. We have to be able to do  both--protect our planet, strengthen our economy.\n\nCalifornia has shown us the way. We can have reliable cars. Our kids…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691620/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "George Whitesides", "party": "Democrat", "sentence": "…foreign rivals like China.\n\nHowever, we can't continue this important work without our scientific  institutions.\n\nRecently, our biggest scientific agencies have come under a full- scale attack with the administration's proposed budget effectively  annihilating the very science that keeps us safe. Programs that  previously had broad, bipartisan support, such…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691391/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…American children, that would cut programs that people across this  country use to advance their education and that would blow a hole  through the United States' deficit on a scale we have never seen  before?\n\nJust a week ago, Elon Musk was tweeting ``KILL the BILL,'' and in the  days after was posting incriminating tweets not only about the  President,…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692301/protecting-our-nations-capital-emergency-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…is not a reliable way to counter nuclear threats.  In 80 years of the nuclear era, the only proven, demonstrated way to  reduce the risk of nuclear conflict and to lessen the scale of its  destruction is through diplomacy and negotiations.\n\nIf not for past arms control agreements, Mr. Speaker, today's  arsenals would be larger and more dangerous. If not…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694117/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…nearly one-half century.\n\nIn that moment, the Court did not just revoke a legal precedent, they  set in motion a wave of chaos, cruelty, and control. What followed was  a full-scale assault on reproductive healthcare: abortion,  contraception, IVF, and even access to emergency care.\n\nIn Ohio, we felt the effects immediately. Just hours after the Dobbs…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692969/dobbs-decision-anniversary"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…spending cannot be       reliably tracked. Therefore, the $1.9 billion figure reported       in this analysis necessarily--and perhaps substantially--      underestimates the true scale of dark money spending in 2024.                         Types of Dark Money Spending\n\nThe term dark money as used in this analysis refers to       election spending and contributions…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699084/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…about as perfect  as you  can get. In some economies that say they are free enterprise, they are  really not. For example, the government will come in and put its thumb  on the scale and affect supply and demand. The government might come  in--China does this all the time--and say: We are going to favor or  subsidize, either with direct money or special…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699012/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…Security, both the  employer's side and the individual's side.\n\nI think our math says that it only took care of 38 percent of the  shortfall, helping folks to understand the scale and also the  rhetorical solutions that are so often thrown out are not  mathematically honest.\n\nThen you come over here to discretionary. We can take a run at that.  Do you…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688088/republican-budget"}, {"senator": "Tom Tiffany", "party": "Republican", "sentence": "…of fishery management actions;\n\n(4) the mass marking program of the United States Fish and       Wildlife Service in the Great Lakes--\n\n(A) was initiated in 2010 on a limited scale;\n\n(B) annually tags approximately 9,000,000 to 11,000,000 of       the hatchery-produced fish stocked in the Great Lakes;\n\n(C) is a basinwide cooperative effort among the United…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693992/great-lakes-mass-marking-program-act-of-2025"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…unleashing American energy, we are bringing  relief to families right now.\n\nThe national average of gasoline is now under $3 a gallon. That  matters to everyone, from the large-scale shipping to the blue-collar  worker driving their daily commute.\n\nMr. Speaker, what we have done in 2025 is just the beginning. As we  move to 2026, Republicans are focused…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699063/how-republicans-have-delivered-for-americans"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "Mr. McCONNELL. Mr. President, when Iran's proxies launched a full- scale war on Israel, October 7, 2023, President Biden pledged an  unwavering commitment to Israel's security. That was the right message  in the moment.\n\nBut as I warned publicly…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692870/9999"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…the OCC and the Federal Deposit Insurance  Corporation, FDIC, revised their approach to evaluating bank merger  applications. The updated rule restricts a bank's ability to scale,  manage risk effectively, and broaden product offerings, ultimately  discouraging mergers altogether.\n\nBy dismantling a longstanding standard, and eliminating automatic  approval…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691514/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "…dominant force back then,  Pinal County's economy has exponentially grown and expanded over time,  but agriculture remains a significant part of the county's economy,  while large-scale farming operations and ag research also prevail.\n\nPinal County has experienced significant population growth in recent  decades, becoming one of the fastest-growing counties…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697110/tiffani-jaseph-named-2026-arizona-teacher-of-the-year"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…to do it by a major reconciliation bill that actually takes on big  issues, complex issues, real math? Or will we just continue to pander  and not tell the truth about the scale of what is coming at us?\n\nMedicare Advantage overpayments, we believe, this last year, just the  overpayment portion, was $84 billion. You start to see a chart like  this.…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699988/math-is-such-an-anathema"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…research over a variety of focus       areas, such as the following:\n\n(A) Modeling and simulation, machine learning, artificial       intelligence, data assimilation, large scale data analytics,       and predictive analysis in order to optimize algorithms for       purposes related to agriculture and energy, such as life       cycle analysis of agricultural…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688980/doe-and-usda-interagency-research-act"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…Wall That Heals,  which will be on display in Nassau County, Florida, from April 17th  through April 21st at the Northeast Florida Fairgrounds.\n\nThe Wall That Heals is a half-scale replica of the permanent memorial  in Washington, D.C., that stands six feet tall at the center and covers  almost 300 feet from end to end.\n\nThe traveling exhibition will…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690073/town-of-hilliard-remembers-our-vietnam-veterans"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…sort of start with this. We have spent time since last  summer working on pieces of legislation. The Wall Street Journal series  and the ProPublica series came out about the scale of bad acts that  were happening in what we call Medicare part C, which is Medicare  Advantage for most of us, which is now I think about 55 percent of the  Medicare population.…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690748/the-math"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…activities of foreign       adversaries at international standards-setting bodies       relevant to undersea cables, including information on the       differences in the scope and scale of the engagement of       foreign adversaries at such bodies compared to engagement at       such bodies by the United States and its allies and partners,       and the security…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694819/undersea-cable-control-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…be subject to a duplicative environmental review solely       due to the addition, substitution, or reallocation of other       sources of Federal assistance, if the scope, scale, and       location of the project remain substantially unchanged.\n\n``(2) Coordination of environmental review       responsibilities.--The Secretary shall, by regulation,…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…truth to our  voters after maybe we have lied to them? It is rich people that we  don't tax enough. It is waste and fraud. It is illegals. All of those  are real, except, in the scale of the spending, they are just not that  much. It is just the insanity of what is going on.\n\nLook, I am trying to help you understand wages.\n\nLet's back up.\n\nTax receipts are…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697051/facing-fiscal-reality"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…This NDAA emphasizes ensuring the lethality of the U.S. armed  services by reforming the acquisition process to deliver innovative  equipment to the warfighter at speed and scale. It does so by  accelerating the requirements process to reduce decision timelines from  3 years to 3 months, by making other transaction authorities more  easily available…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697795/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}]