[{"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…billionaires.\n\nSNAP is our Nation's most effective antihunger initiative. The  devastating Republican cuts threaten children and families in  California and across America who are scared and crying out for help.\n\nOne single mom, Melissa, from California who lives in a district  represented by one of our Republican colleagues shared that if not for  SNAP, her…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691483/gop-tax-scam-hurts-women-and-families"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…We took them up on that. We went in the facility. I am here to talk a  little bit about my experiences there.\n\nThe State of Florida and DHS got wind of our visit. They got scared.  They invited us. Of course, what we got was a sanitized version of the  way things usually are. Even that sanitized version to me was abhorrent  conditions.\n\nI also heard…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693654/internment-camp-in-the-florida-everglades"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…Oregon who wrote me this letter:\n\n``Hi. I am a local student, and I am in fourth grade. Ever since the  rules were changed to allow ICE agents to enter schools, I have felt  scared for my safety and the safety of my classmates, friends, and  neighbors. I feel scared and distracted in class sometimes because I am  worried ICE might come in our school.…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689733/challenges-facing-our-students"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…conservative, and they just don't see things politically the way I see  them. But when you close the door and there is no press around and you  ask them what is going on, they are scared to death.\n\nThey see China stopping purchases of soybeans. Why is that important?  Illinois is the No. 1 soybean-producing State in the United States, and  it is a major cash…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697242/the-economy"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…Congress who does not represent families who rely on SNAP's food  supports to make ends meet.\n\nWe all represent families that are getting squeezed by higher costs,  who are too scared to check their retirement accounts, who are putting  off having prescriptions filled, or who are falling behind on rent. It  is simple: These cuts will lead to suffering and…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691770/151-days-without-a-vote-to-lower-costs"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…they can live in safety and security? I think this is a weekend  for examining our own conscience.\n\nMy office has heard an influx of others fleeing horror, seeking  shelter, scared that they will be sent back somewhere. Haitians who  were here legally and working were scared in Ohio that they would be  sent back to the streets of Port-au-Prince that are…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690052/trump-tariffs"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…high rent and afraid  that they won't be able to buy a home one day. They are worried about  how they can afford healthcare once these Medicaid cuts take effect.  Seniors are scared their Social Security checks are going to dry up,  but Republicans want to focus on renaming a body of water thousands of  miles away from where we are today.\n\nInstead of addressing…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690938/gulf-of-america-act"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…programs are critical to families, to  their well-being, and how this program, if cut, would be devastating.\n\nThere is a common theme on all these stories; these families are  scared they will not be able to afford or get the care that their  family really relies on. They are also concerned that there is nowhere  to turn, even if the coverage is taken away.…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692972/one-big-beautiful-bill"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "Ms. BALINT. Mr. Speaker, our Nation is in crisis. We are in a very  dark place. Americans are scared, and they want to see a way forward.  We all need to start with ourselves.\n\nThis morning, I sat, and I lit a candle. I thought about the anguish  and suffering of Representative…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695814/bringing-compassion-to-our-nation"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…business in Santa Ana, Orange County, masked Federal agents start  going into our neighborhoods, picking up hardworking neighbors. Oh,  yeah, you bet, people were concerned, scared, and nervous.\n\nA lot of people expressed their First Amendment rights. We got the  National Guard. Orange County Sheriff Don Barnes did not call for the  National Guard. Local…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693145/condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…militarized immigration  operations cost at least $40 million over a 10-week period.\n\nIn the wake of these operations, families are afraid to leave their  homes, parents are scared to walk their children to school, and workers  and vendors fear being pulled from the streets and detained simply for  the way they look or the language they speak.\n\nThe Trump…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698781/operation-midway-blitz"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…Instead, I heard worry; I heard frustration  from Republicans; I heard a lot of buyer's remorse.\n\nRepublican Members from those districts I visited are nervous,  worried, and scared as could be. They know their voters don't agree  with Trump, but they are too scared to buck him. In the upcoming  reconciliation, we will see what they do. Will they side…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690262/trump-administration-first-100-days"}, {"senator": "Tina Smith", "party": "Democrat", "sentence": "…decides: I have to tell them that I am a police  officer. And they leave her alone.\n\nThis is about people dialing 911 because an ICE agent is at their  home, and they are so scared about what to do.\n\nSo I want to be clear: We are pro-public safety in Minnesota. We have  worked often with Federal authorities to catch bad guys and lock them  up. But we…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699416/9999"}, {"senator": "Brendan Boyle", "party": "Democrat", "sentence": "…for everyone who makes up  to $1 million. That is a massive amount of money. Every Democrat voted  for it. Every Republican voted against it.\n\nDon't be confused and don't be scared by this scare tactic. If you  are a middle-class American, if you are in the 99 percent, you will not  see your taxes go up next year. There is no question about that. What…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689914/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…half of the staff in the  Department of Education. I don't know about you, but I have young  people in my family who are excited about going to college, and they  are also scared because they don't even know if the colleges are going  to stay open.\n\nI am not just talking about elite Ivy League institutions. I am  talking about community colleges; I…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691088/big-backstabbing-bill"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…out the  crazy thing, the chat, the computer answering the phone at the IRS, has  a higher favorability rate than when a human answered the phone.\n\nMaybe we should stop being scared of adopting the technology because,  remember, last year's taxpayer audit said only 31 percent of the phone  calls to the IRS were getting answered, yet the IRS union attacks…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692327/math-always-wins"}, {"senator": "Jon Husted", "party": "Republican", "sentence": "…nearly 200 pregnancy  help centers and maternity homes that serve expectant mothers. I have  visited many of them. They want you to go see them, if you are in need,  if you are scared, if you need someone to talk to. They are there to  help, not to pressure, not to judge but to provide love, care, and  support. Many of the women who staff these pregnancy…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699107/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…gets us on social media. That is  what gets people's dopamine hitting. But at some point the math is  going to win.\n\nWe have the really smart analytic firms saying they are scared about  U.S. sovereign debt. We see things happening around the world that  makes me very nervous. There is an appetite for going on the long end  of the curve.\n\nThe United…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690586/economic-anxiety"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…are people who are alarmed that  Donald Trump would have access to information. Imagine if Donald Trump  could control this money. A lot of people in our country would be  scared to death. On the other hand, we can imagine maybe somebody from  the political left who would control this money. We could say that that  is pretty creepy.\n\nJust like in ``The…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693006/central-bank-digital-currency"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…months and months  and months and months running around here trying to show people how you  can modernize the delivery of services and lower the price of  government. That scared too many people. So we got a budget resolution  where functionally the baseline is $1.2 trillion in cuts and another  half trillion in shock absorbers. Yet, it is a $4.5 trillion…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688651/a-real-math-problem"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…are not asking  for any additional provisions, and they shouldn't ask for any  additional provisions. Let's just open back up and continue to  negotiate for 6 weeks. Don't be scared of the Congresswoman. Don't be  scared of the socialist wing of your party.", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695979/government-funding"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…legislation to fix what MedPAC has talked about now for years, back  when the Democrats controlled all this place, now that the Republicans  control this, but we are all too scared to actually read something that  is in a big binder that actually has math in it that would be hard and  difficult because, let's be honest, it is really hard putting a couple…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691811/actual-solutions"}, {"senator": "Rudy Yakym III", "party": "Republican", "sentence": "…found out we were  expecting our first child. Sallyann thought she was having some issues  with our pregnancy when she was only 7 weeks pregnant. We were young,  and we were scared. We didn't have a place to turn until one of her  friends suggested that we go to a pregnancy resource center.\n\nWe went down to the Women's Care Center in South Bend, where…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699232/supporting-pregnant-and-parenting-women-and-families-act"}]