[{"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…because he  can't drive or use a computer, or an immigrant who may lose his job  because a name correction appointment is weeks away, or the retiree who  waited hours just to schedule an appointment on the phone.\n\nSocial Security is not a political experiment. It is a promise. The  American people paid into the system and earned these benefits. They  shouldn't…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698683/social-security-customer-service"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…the files, or you are afraid that  there might be something in the files. You are in charge.\n\nBy the way, I was hoping the majority leader would tell us when he is  going to schedule the vote on his meaningless bill on the Epstein  files, but I think we will have to wait until he gets back on the  floor.\n\nDeLauro), the distinguished ranking member of the…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693718/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…Government of any gifts, benefits, or payments recovered or  received from foreign governments or others through his illegal  dealings.\n\nI have asked for unanimous consent to schedule floor votes--I want  floor votes--on each of these resolutions. I think the American people  deserve to know where we stand, who is going to allow him to go forward  with…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691548/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…referred to as the ``number one acquisition priority'' of both the  Department of the Navy and the Department of Defense, is building new  ballistic submarines on a very tight schedule to replace the aging  fleet of Ohio-class submarines, who have been on patrol starting in the  1980's. The first two submarines--USS District of Columbia and USS  Wisconsin--are…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696732/continuing-appropriations-and-extensions-act-2026"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…to help seniors continue to enjoy a  vibrant lifestyle as they age--able to remain in their homes and highly  active. At Home volunteers and professionals deliver a monthly schedule  of educational programs, active discussion groups, social gatherings,  and the necessary transportation.\n\nWhen I retire, not that long from now, I know exactly where I can…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691311/recognizing-at-home-on-the-sound"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…with disabilities to complete some transactions in  person or online, rather than by phone.\n\nYet, reduced staffing levels at field offices have made it more  difficult to schedule a timely appointment.\n\nIn my district, the Social Security Administration closed the White  Plains hearing office, forcing constituents in Westchester to travel  farther distances…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699376/concerning-state-of-service-at-social-security-administration"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…during World War II in an unbelievable timeframe,  but it also left us with a huge obligation to clean up the nuclear  waste. The Tri-Party Agreement guides the Hanford Cleanup schedule and  the goals that need to be met to complete this mission. Our current  Energy Secretary, if he is thinking about ignoring these commitments to  science or the Tri-Party…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695342/hanford-site-cleanup"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…serious traumatic brain injury.\n\nMr. Speaker, in the spirit of this legislation, which I can wholly  support, I believe that we must do more. I ask the chairman if we might  schedule a hearing for the more extensive examination into the many  other types of exposures--environmental exposures, toxic exposures-- that our veterans have been and our servicemembers…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693895/aces-act-of-2025"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…personal reasons.\n\nMr. Speaker, 10 years ago today, I was 31 weeks pregnant. I was  excited. I was expecting a girl. I had placenta previa, so I knew we  were going to have to schedule a C-section. We had just scheduled it.  She was due June 30, but we had scheduled a date in early June because  my doctor did not think it likely that we would make it to…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690243/health-disparities-in-minority-communities"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…seasons in the last decade, HHS has delayed the convening  of critical advisory councils of the CDC and FDA. These advisory  councils are responsible for determining the vaccine schedule--what  vaccines must be covered by insurance--and the safety, effectiveness,  and appropriate use of vaccines. They do essential and timely work to  keep people safe, and…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…on the floor.\n\nThis Senate is described as one of the great legislative bodies-- deliberative legislative bodies--in the world. You couldn't prove it by  the history of our schedule over the last several months.\n\nThis week, the Senate Democrats are going to put forward a proposal  to extend health insurance premium tax credits for 3 years. I have  heard…", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697576/department-of-defense"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…benefit  replacement.\n\nWe don't need more gratuitous bills from Republicans who just voted  to cut SNAP by $300 billion. We need them to step up and tell Speaker  Johnson to schedule a vote on benefit replacement this week.\n\nHungry families can't wait another 6 months for relief. Unlike so  many of my Republican colleagues, they don't get invited to fancy…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692258/end-hunger-now-snap-skimming"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…principle.\n\nThe Home Rule Act originally required the Board to hold special  elections on the first Tuesday occurring more than 114 days after a  vacancy and allowed the Board to schedule special elections on the same  day as the next general election if that election occurred within 60  days from when a special election would otherwise have been held. This…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697291/introduction-of-the-district-of-columbia-special-elections-home-rule-act"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…parents' couch playing video games, actually,  most of them are working but earn, for an individual, $21,597 a year.\n\nSome of them may work for employers who intentionally schedule their  hours at 29 hours rather than the 30 needed to trigger employer-covered  insurance. Some of them are self-employed. Some of them are in jobs,  like one of my constituents…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692205/raising-awareness-about-mens-health"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…pumpkin.  In this case, we only have a lump of coal when we hit the end of the  year.\n\nThen there is a requirement under the law for the President to lay  out an expenditure schedule so that we can see whether or not funds are  being delayed, or frozen, impounded, and so forth, and that schedule  has disappeared. That website has been shut  down. So the…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Scott Fitzgerald", "party": "Republican", "sentence": "…Legislature that culminated in the bill being  debated before us today.\n\nSince 2017, they have been working on a permanent solution, and that  is scheduling fentanyl as a schedule I item. It is the most important  thing that this House of Representatives will do in this Congress.", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692348/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…for Communications and       Information shall, on and after the date of the enactment of       this Act, be deemed to be a reference to the Under Secretary.\n\n(5) Executive schedule.--\n\n(A) In general.--Subchapter II of chapter 53 of title 5,       United States Code, is amended--\n\n(i) in section 5314, by adding at the end the following:\n\n``Under Secretary…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690257/national-telecommunications-and-information-administration-reauthorization-act-of-2025"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…deployed to harm's way alongside their American comrades, NATO's newest  members, Sweden and Finland, are each on track to meet the alliance's  new spending target years ahead of schedule.\n\nGermany has dramatically increased defense spending, and the Germans  have even amended their Constitution--amended their Constitution--to  allow for deficit spending on…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699111/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Jay Obernolte", "party": "Republican", "sentence": "…poisoning event.\n\nWe must give our law enforcement the tools to combat this problem.  This bill does exactly that. It permanently reschedules fentanyl and  its analogues as a schedule I narcotic, and it gives our law  enforcement agencies the tools that they need to begin dealing with  this problem.\n\nThat is why I am proud to be a cosponsor of the House…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692350/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Mr. Speaker, I thank the gentleman for  yielding.\n\nMr. Speaker, I rise today in strong support of the HALT Fentanyl Act,  which permanently extends President Trump's 2018 schedule I  classification of fentanyl-related substances.\n\nMr. Speaker, the United States is facing a poisoning epidemic, and it  is caused by illicit fentanyl and its related substances…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692349/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…defended our Nation.  Its annual Year in Review also features stories of soldiers preparing  for future challenges and meeting recruiting and retention goals well  ahead of schedule, demonstrating renewed commitment and purpose and  included in this Year in Review was Fort Stewart's Rock of the Marne.\n\nThis retrospective honors those who served today…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698838/recognizing-the-us-army-2025-year-in-review"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…Therefore, the Committees have prepared a       classified annex--referred to here and within the annex       itself as ``the Agreement''--that contains a classified       Schedule of Authorizations and describes in detail the scope       and intent of the Committees' actions.\n\nThe Agreement authorizes the Intelligence Community to       obligate and…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698262/explanatory-statement-for-the-intelligence-authorization-act-for-fiscal-year-2026"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…fentanyl's  chemical structure to create fentanyl analogues. The cartels did this  in an attempt to evade our criminal laws.\n\nRight now, fentanyl analogues are considered schedule I substances,  but only because of a series of temporary scheduling orders, and that  order is now set to expire on September 30 of this year.\n\nThat is why the HALT Fentanyl…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692345/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…examiners utilized and the amount       of time spent at the institution to carry out the       examination;\n\n``(C) make every effort, to the maximum extent practicable,       to schedule the examination at a time that is convenient for       the institution; and\n\n``(D) to the maximum extent practicable, give the       institution advance notice of issues expected…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…LaMalfa.\n\nAs you know, Doug was a happy warrior who cared immensely about his  country, his State, and the people he served. A few years ago, he took  time out of his busy schedule to travel with me to Arizona to better  understand the border crisis and the serious impact it was having on my  State as well as his own. Doug was always willing to listen,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698733/9999"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…year had we not completed that, and we  got it done 6 months prior to that crisis. I don't know the last time I  looked at Congress and found something done that far ahead of schedule.  It is usually the last minute.\n\nThat matters because that was a reality. That is what we knew was  coming, and we worked hard to accomplish a lot of really key important…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699064/how-republicans-have-delivered-for-americans"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…ELIGIBILITY OF CERTAIN ARTICLES FOR                     PREFERENTIAL TREATMENT.\n\n(a) In General.--The President shall proclaim such       modifications to the Harmonized Tariff Schedule of the United       States as may be necessary to restore the eligibility of       articles described in subsection (b) for preferential       treatment under section 213A…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698853/haiti-economic-lift-program-extension-act"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…overdose deaths, 75,000 of those attributed to  synthetic opioids, especially fentanyl-related substances.\n\nCurrently, fentanyl and fentanyl analogues temporarily fall under  schedule I of the Controlled Substances Act, the CSA, due to a  temporary scheduling order that runs through September 30 of this year.\n\nThis bill would permanently place fentanyl…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692343/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Control agencies throughout the greater  Tampa Bay metro area. Jeanne places dogs into temporary care at foster  homes and follows them all the way through until she is able to  schedule a meet-and-greet with a Veteran she feels would be the right  match for the dog. Once a match is made and the dog goes home with  their Veteran, Jeanne remains a constant…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690843/recognizing-jeanne-white"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…the Speaker of the  House,   Mike Johnson of Louisiana, to address all Members.\n\nMs. EDWARDS. I thank the Speaker so much for giving your time out of  your incredibly busy schedule. You are always really generous with your  time for the former Members. Thank you so much.\n\nMs. EDWARDS. We appreciate that, Mr. Speaker.\n\nThe Chair now recognizes the Honorable…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698189/9999"}]