[{"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…will depend on their ZIP  Code. Families will face confusion, delays, and costly legal battles  just to secure what the law already guarantees their children. States  and school districts will be left without clear guidance or support,  increasing litigation, and diverting resources away from classrooms.  Families, especially those without financial or…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698937/protecting-education-for-children-with-disabilities"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…Century Community  Learning Center grants yesterday, they are a small percentage of the  outstanding funding, and there is still no word on any of the other  grants.\n\nSchool districts across the country are scrambling to make decisions,  but they have unclear information and severely constrained budgets.  Many districts have already been forced to lay…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693986/withheld-education-funds"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…programs, teacher training, literacy training, and more. Without  warning, the administration froze them. The result has been delays and  potential cuts and layoffs. School districts, including the ones that I  represent, are now scrambling to fill unexpected budget gaps.\n\nI have heard directly from educators in my district whose jobs will  be on the…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693568/congratulating-military-academy-appointees"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…is no evidence that K-12 schools are under any  threat from misinformation or covert influence by authoritarian foreign  governments in any measurable way.\n\nIf passed, school districts already facing shortages of teachers,  counselors, and support staff now will have to divert critical time and  resources from instruction to completing bureaucratic paperwork,…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697410/combating-the-lies-of-authoritarians-in-school-systems-act"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…North Canton as a teacher, coach, and administrator.\n\nSince he began serving as the superintendent in 2016, North Canton  has consistently been ranked as one of the top school districts not  just in Stark County but throughout the State of Ohio.\n\nJust last year, the district received a 5-star rating, the highest,  on its school report card from the Ohio…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690330/recognizing-superintendent-jeff-wendorf"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…will make that  happen. Her whole background is anti-public schools.\n\nWhen you slash Federal funding for education, it leads to higher  taxes back home. So many of our school districts--they could be urban,  suburban, or rural--depend on Federal funding, and when you cut that,  it leads to higher property taxes to make up for the loss of money.  Communities…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688393/nomination-of-linda-mcmahon"}, {"senator": "Jim Costa", "party": "Democrat", "sentence": "…the taxpayers, send more money  to Washington than we get back every year.\n\nIn California, we were supposed to receive, as I said, $928 million.  This was a big blow to school districts across the country, including  those that I represent in the San Joaquin Valley in California. Fresno  Unified, which I represent, was to lose $7.1 million. Visalia Unified…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693899/denouncing-cuts-to-k-12-schools"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…discrimination claims based on disparate impact under  Title VI of the Civil Rights Act of 1964.\n\nAnd the Strength in Diversity Act, which would provide resources to  states or school districts that want to voluntarily develop plans to  integrate their schools.\n\nWe have to take steps to lower the cost of higher education for  students and families. To that end,…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689643/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…luxury. This is a public service and expectation that  we should be able to rely on, and we have it because of the hardworking  staff at NOAA.\n\nPlanes avoid turbulence. School districts decide whether it is safe  to have class during a snowstorm. People seek shelter during a tornado  or a hurricane. Weather forecasts are available at our fingertips, and…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691327/noaa-contributes-to-our-economy-and-well-being"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…school student who is terrified that  his family and friends will be kidnapped. I spoke with education  leaders who were in tears about the trauma they are seeing in their  school districts and with students who are afraid for themselves and  their families. This trauma will last for years and will affect the  ability of these kids to learn and thrive in…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696911/aggressive-immigration-enforcement-tactics-in-oregon"}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "…Castlemont High School and met with these  amazing students, who are full of potential. These students are not  only the future,  they are the now. Many teachers across our school districts, in my  district and throughout the country, are going in their own pockets to  buy support services for students and their own supplies. Kamau's  philanthropic spirit…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690855/thanking-w-kamau-bell-for-his-generous-donation-to-oakland-schools"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…Institutes in this country serving K-12 students. The  provisions of this bill will have to be administered not by those five  school systems, but every school district--15,000 school districts-- will have to administer the provisions of this bill.\n\nAs written, the bill would create significant administrative burdens  to our schools and chill community investment…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697533/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…more than an abstract Federal program. It  has been a promise, a promise that when Federal lands limit local tax  revenue, Congress will stand with rural communities and school  districts so that they continue to provide the basic essential services  that every American family deserves.\n\nRural communities across the country and in New Mexico know this…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697655/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "Thomas Suozzi", "party": "Democrat", "sentence": "…federalism, and they said: We are going to make you pay  taxes on the taxes you have already paid to your States, to your  cities, to your towns, to your villages, to your school districts. We  are going to tax you on the money you have already paid in taxes at the  State and local levels.\n\nThat caused some people's taxes to go up, especially in high-tax…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690627/republican-tax-cuts"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…``China.'' It says ``foreign entity of concern.''\n\nThis includes all teachers' and administrators' professional  development material and salary information, as well as the school  districts' contracts and records for all materials purchased from or  paid for by a foreign entity of concern. While this is not currently  required by law, parents now already…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697440/transparency-in-reporting-of-adversarial-contributions-to-education-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "Mr. WESTERMAN. Mr. Speaker, I rise today in support of S. 356, the  Secure Rural Schools Reauthorization Act of 2025, which is a lifeline  for rural school districts that have experienced severe budget impacts  since 2023 when the program was not reauthorized. This bill is vital to  restoring critical funding, preventing further school…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697657/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…in 2000 to offer an alternative funding formula that  takes historic production levels into account. This program has been a  lifeline to hundreds of rural counties and school districts across the  country who have seen their budgets slashed through no fault of their  own.\n\nThe program expired in the fall of 2023, resulting in county payments  reverting…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697653/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "Max Miller", "party": "Republican", "sentence": "…center  opened in 1974 as the Medina County Joint Vocational School before  changing its name to what it is today. The career center is a  partnership with six public school districts in northeast Ohio and  offers advanced career and technical education for approximately 1,200  high school students and nearly 3,000 adult students.\n\nAdditionally, the…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689426/recognizing-medina-county-career-center"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "Mr. CARTER of Georgia. Mr. Speaker, I rise today to recognize Buford  City Schools as being named among the top school districts in America.\n\nEducation is one of the greatest gifts we can provide our children,  and I am proud that Georgia is receiving recognition for this honor.\n\nBuford City Schools…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691892/recognizing-buford-city-schools"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "…began her career in general education, later finding  that her true passion resides in special education. Fifteen years  later, Tiffani has now taught in three Arizona school districts,  providing specially designed instruction in her classroom while also  supporting students' needs in general education.\n\nShe emphasizes inclusive, strengths-based instruction…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697110/tiffani-jaseph-named-2026-arizona-teacher-of-the-year"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…and technology skills, including the ability to analyze  big data, ensure data security, and manage cyber security risk.\n\nIn particular, this bill would allow States and school districts to  use a portion of their Federal student support and academic enrichment  grant funding to support accounting education, including accounting  career awareness. The…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699793/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…industry employs more than 925,000  Americans, generating a payroll of nearly $80 billion nationwide.\n\nHarvest on national forestland is also critical for supporting rural  school districts through county payments derived from timber sales.\n\nOur forests also provide countless recreational opportunities, such  as camping, hiking, fishing, and many other activities…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691520/recognition-of-may-as-wildfire-awareness-month"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…county commissioners and local leaders can plan  with confidence, knowing that the Federal Government will keep its  promise to pay predictable-share forest revenues to the school  districts that I represent.\n\nI have heard directly from our county leaders in Asotin, Ferry, Pend  Oreille, Stevens, and Walla Walla Counties. The uncertainty is real.  Some are…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692323/taking-an-important-step-for-rural-america"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…and technology skills, including the ability to analyze  big data, ensure data security, and manage cyber security risk.\n\nIn particular, this bill would allow States and school districts to  use a portion of their Federal student support and academic enrichment  grant funding to support accounting education, including accounting  career awareness. The…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699755/9999"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…with foreign  governments, and resources must be available for parents to review.\n\nWe know this can go on right now. We know contracts are undertaken  with all of our school districts now. We know that the lawyers on staff  have means by which to make sure that the appropriate t's are crossed  and i's are dotted. They can follow the law. We must do…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697438/transparency-in-reporting-of-adversarial-contributions-to-education-act"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…most--the students.\n\nPresident Reagan said back in 1982, and President Trump has recently  echoed, that we need to turn the schools back to the States and to the  local school districts. President Reagan rightly noted that `` . . .  the decline and the quality of public education began when Federal aid  became Federal interference.''\n\nFortunately, President…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689153/advancing-america-first-policies"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…charitable intent. These programs  exist because the CCP expects something in return: control over  curriculum and influence over young minds.\n\nIt is unacceptable that American school districts have entered into  financial arrangements with entities tied to the CCP, an adversary of  the United States and a regime with one of the worst human rights  records in…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697530/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}, {"senator": "Troy Nehls", "party": "Republican", "sentence": "…Nivens leads the way with innovation, high standards,  accountability, and joy for leading.\n\nLamar Consolidated Independent School District is one of the fastest- growing school districts in Texas, serving nearly 49,000 students  across nearly 60 campuses.\n\nBefore being named the 2025 National Superintendent of the Year, Dr.  Nivens was named the Texas…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700275/congratulating-dr-roosevelt-nivens"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…special  education services.\n\nYet, for decades we have fallen short of promised funding levels,  which have hovered around 13 to 15 percent, leaving States and local  school districts struggling to make up the difference.\n\nThis shortfall forces schools to stretch their already limited  resources, meaning fewer special education teachers, outdated  instructional…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689683/supporting-our-nations-children-with-disabilities"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…swift  passage so it can be sent to the President's desk without delay.\n\nFor generations, the Secure Rural Schools program has been a lifeline  for rural communities and school districts across America. Since 1908,  Federal law has required the U.S. Forest Service to share 25 percent of  revenues from Federal forest lands with local governments to support…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697671/support-for-rural-schools"}]