[{"senator": "Marc Veasey", "party": "Democrat", "sentence": "…strengthens our nation's  military lethality. The Exchange serves those who serve with department  stores, restaurants, malls, wellness services, combat uniforms at cost,  school meals for military children overseas, a robust presence at  ShopMyExchange.com, a leading credit option and more.\n\nAt 130, the Exchange, now based in Dallas, Texas, is among the…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693374/recognizing-the-army-and-air-force-exchange-service"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…by $37  trillion over the next 30 years.\n\nHow are Republicans going to pay for it? On the backs of the American  people with cuts to Medicaid, food assistance, housing, school meals,  clean energy, and selling your public lands.\n\nMr. Speaker, the craziest thing is the majority said that Republicans  wouldn't vote for it if it would raise the debt and…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689886/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "Mr. Speaker, today, we are considering S. 222, the Whole Milk for  Healthy Kids Act of 2025.\n\nSchool meals play a critical role in reducing child hunger and  providing children with the healthy food they need in this country.  Milk offered as part of these meals can deliver essential…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698183/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…support for a war machine budget that can't pass an  audit?\n\nI want people to look at this and pay attention because they will  never, ever fully fund Medicaid, universal school meals for every  hungry child, or guarantee healthcare as a human right in our country.  I think maybe it is because many of my colleagues in this Chamber are  actively profiting…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695276/taxing-excessive-ceo-pay"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…had an amendment, Mr.  Speaker, to prohibit the bill from going into effect unless cuts to  Medicaid and SNAP would not result in fewer families being eligible for  free school meals.\n\nMr. Speaker, as you know, Republicans voted down that amendment. We  can't find a way to stand up for school meals, for school breakfast,  for school lunch. That is just…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Joyce Beatty", "party": "Democrat", "sentence": "…in basic public school funding that keeps  students learning and teachers employed. We also stand to lose $21  million in special education support, and $19 million for school  meals--because no child should be too hungry to learn. More than 1,300  teaching jobs are on the line.\n\nAll of this--to make billionaires richer? Mr. Speaker, we are not  going…", "date": "2025-04-17", "source_url": "https://justfacts.votesmart.org/public-statement/1690123/president-trumps-proposed-department-of-education-shutdown"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…reason. No  explanation. Just cruelty. Two-thirds of SNAP recipients are kids,  seniors, or people with disabilities. That is whom Trump is cutting  off: kids who rely on school meals, seniors on fixed incomes, veterans  trying to get by, families trying to get groceries. That is the real- world consequence of Trump's decision.\n\nAnd while he is manufacturing…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696462/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-record-of-decision-for-the-barred-owl"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "Mr. PAPPAS. Mr. Speaker, I rise today because the Republicans' budget  scheme pushed through in the middle of the night last month is putting  school meals for hungry kids and food assistance for working families  at risk.\n\nA constituent of mine, Martha, from Somersworth is raising her 15- year-old grandson and battling breast…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692014/food-assistance-for-working-families-at-risk"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…provides mental health services. It ensures kids  with disabilities get what they need. In 43 States, including Virginia,  it also provides access to free and reduced-priced school meals.\n\nThere are over 37 million children enrolled in Medicaid and the  Children's Health Insurance Program, or CHIP, in the United States.  These are the most vulnerable people…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690740/medicaid-is-a-lifeline"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…banks and schools.\n\nJust yesterday, USDA announced that it was ending part of the Farm to  School Program. This program for years incentivized local food  procurement for school meals. Dozens of schools in Westchester and the  Bronx rely on these programs as a way to provide healthy food to  students. Similarly, Feeding Westchester and City Harvest do…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689059/feeding-our-children"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…that have happened across this country will likely vanish overnight.\n\nIn fact, the Urban Institute says that as many as 18.3 million  children will lose access to free school meals under these cuts.\n\nFood banks will be overwhelmed. Children will go hungry, and it will  have a domino effect: a domino effect on their education, a domino  effect on healthcare…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691770/151-days-without-a-vote-to-lower-costs"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…Civil Rights to advance Trump's hateful, far-right political  agenda. Then the Secretary will come after funding for programs that  help provide childcare, afterschool care, school meals, and more. Think  about it: school meals. For many children, that would mean taking away  access to the only meal a day they can count on.\n\nWhy? Not because she thinks these…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688248/nomination-of-linda-mcmahon"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…increasingly asked to do more in addition to teaching.  They check in on the well-being and mental health of their students.  They make sure that students get enough to eat during school meals and  have notebooks and pencils and crayons. They are advocates in front of  school boards to prevent cuts to funding and to resources.\n\nThere is a famous saying: ``To teach…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690736/to-teach-is-to-touch-a-life-forever"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…poor people off of healthcare? Where is the decorum in cutting  food benefits and nutrition benefits to people who are in desperate  need? Where is the decorum in cutting school meals?\n\nThese are unusual times that we are in. They are firing veterans as  we are gathered here today, people who serve our country with  distinction. Our constituents and your…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688503/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…the partnership  between Senator Bob Dole of Kansas and Senator George McGovern of South  Dakota. Since the beginning, McGovern-Dole has delivered more than 5.5  billion school meals to children around the globe.\n\nThe mission of these programs is more urgent now than ever. In 2023,  more than 735 million people around the world faced chronic hunger.…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691403/motion-to-discharge-s-res-195"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…want to drink.\n\nSome children struggle to consume enough of the right calories to  support healthy growth and stay energized throughout the entire school  day. For some, school meals may be the only meals they receive that  day.\n\nThis notion that whole milk consumption is linked to childhood  obesity is deeply flawed. In fact, studies suggest that higher…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698186/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…nutrients and numerous health benefits.\n\nUnfortunately, out-of-touch and outdated Federal regulations have  imposed restrictions on the types of milk students have access to in  school meals. While the Healthy, Hunger-Free Kids Act's intention to  reduce child obesity was good, its impacts to attack whole milk have  been misguided and devastating over the 15…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698178/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "John Boozman", "party": "Republican", "sentence": "…board for 7 years, and these things are important.  Labels are very, very important, so we appreciate you.\n\nI am proud to share a commitment also with her in supporting school  meals and to lead the committee in making commonsense updates to  strengthen children's capabilities in and out of the classroom. I look  forward to continuing our work in the…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697061/whole-milk-for-healthy-kids-act-of-2025"}]