[{"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…Speaker, importantly, how will those who may decide  to pursue STEM fields succeed where these same skills are useful among  the trades or manufacturing?\n\nThankfully, schools across the country are developing new tools and  curricula with students to help them learn these challenging topics.\n\nI will repeat again that this is without any additional cost.…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688979/mathematical-and-statistical-modeling-education-act"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…give more responsibilities to an agency that they are trying actively  to dismantle.\n\nNonetheless, there is a way forward to save teachers and students and  rural schools across the country, including back in Colorado, and that  is by ensuring that the Department of Education Protection Act receives  a vote here on the House floor.\n\nMr. NEGUSE.  Mrs.…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689052/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers-providing-for-consideration-of-hr-defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…cutting off the school mental health grants  is that he is cutting off existing grants. It is not that he is  announcing: I am not giving any new grants.\n\nThere are schools all across this country that have set up new mental  health clinics because of the grants they got. They were 5-year grants,  and 1 or 2 or 3 years into those grants, Donald Trump is…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690948/gun-violence"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…education, hands off our  teachers, hands off our students, and hands off our schools. Last week,  the Department of Education sent a letter to thousands of public  schools across the country asking them to certify that they would end  programs promoting diversity, equity, inclusion, and accessibility or  they would have their Federal funding cut.\n\nLet…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689604/hands-off-our-education"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…students, like fully  funding the Education Department's Office for Civil Rights to fund  investigations and hold colleges and universities--and, quite frankly,  schools across the country and secondary schools--tolerating anti- Semitism accountable, we can support all students' ability to live and  study in places that value and respect their heritage.…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691194/calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism-and-educate-the-public-on-the-contributions-of-the-jewish-american-community"}, {"senator": "Jimmy Panetta", "party": "Democrat", "sentence": "…19th Congressional District who participate in the Day of  Silence. This is a day in which we highlight discrimination and  harassment of LGBTQ students in our schools all across the country.\n\nThis year, I will feature the leadership of Bryce Grossman, an eighth  grader from Santa Cruz, who founded and is organizing the We Will Not  Be Erased walk on…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690886/commending-leadership-of-bryce-grossman"}, {"senator": "Jim Costa", "party": "Democrat", "sentence": "…This didn't happen on its own.  It happened because we put pressure on them.\n\nNow the money is flowing, and I hope it is the entire $7 billion that  goes to our schools throughout the country. Let's make sure that we  know where it first happened. It happened when the flood of phone lines  started going to my colleagues here in Washington.\n\nI am going…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693899/denouncing-cuts-to-k-12-schools"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…the plans laid out in Project 2025 to eliminate  funding for title I schools, which support low-income students. We are  talking about funding for 49,000 title I schools throughout the  country, including 170 schools in my State of Hawaii, 2,091 title I  schools in Florida, 7,500 title I schools in Texas, and so many more.  Every single State has title…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688248/nomination-of-linda-mcmahon"}, {"senator": "Michael Rulli", "party": "Republican", "sentence": "…Confucius  classrooms are propaganda, and they are often set up near our military  bases, just to give it another layer.\n\nThere are CCP and Chinese affiliations in 143 schools throughout this  country. Honorable Speaker, I was shocked myself to realize that one of  them sits right outside our capital city of Columbus, Ohio. This is  unacceptable.\n\nThey could…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697407/combating-the-lies-of-authoritarians-in-school-systems-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…own ability level, and your own  strengths and weaknesses in the modality that fits you.\n\nWe are seeing incredible things that are being done already at  different schools across the country as well as with platforms like the  Khan Academy where you can have a direct dialogue with a chatbot or,  for example, a reanimated version of Albert Einstein that…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689211/protecting-medicaid-for-californians"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…immigrants receive tax- funded meals day in, day out to eat on your dime?\n\nAgain, I heartily say: Absolutely not.\n\nTo the children at risk of falling behind in lagging schools all over  this country, I ask: Should we continue to allow millions upon millions  to arrive here illegally and crowd out your classrooms?\n\nI would say, again: Under no circumstances…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690711/outrageous-government-funded-incentives"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…more relevantly, as part of the same reconciliation bill, H.R.  1.\n\nWe believe this measure could triple the number of students attending  high-performing charter schools across the country, and it would be a  great help to California families who are being attacked by their own  State government.\n\nIf we could ignite this school choice revolution across…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "John Rose", "party": "Republican", "sentence": "…elected again, President Trump said he would put a stop to men  competing in women's sports. He did.\n\nHe said he would end divisive and anti-American DEI policies in  schools across the country. He did that, too.\n\nThe President told us that this country would once again be respected  on the world stage. Mr. Speaker, it is clear he has delivered on that…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690428/the-first-100-days"}, {"senator": "Dan Newhouse", "party": "Republican", "sentence": "…Speaker, I thank the chairman for yielding.\n\nMr. Speaker, I rise today in full support of the Whole Milk for  Healthy Kids Act of 2025.\n\nFor over 10 years, children in schools across our country have been  deprived of the many benefits of whole milk, and the Dietary Guidelines  for Americans has reported that nearly 90 percent of Americans do not  meet their…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698185/whole-milk-for-healthy-kids-act-of-2025"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…run any schools. Our  many public school systems in this country do not report to Washington,  DC, and Washington also has no authority over what is taught in our  schools around the country.\n\nThe job description of a Secretary of Education is to manage a  bureaucracy that runs a number of funding programs. By all accounts,  Linda McMahon did a great…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688387/nomination-of-linda-mcmahon"}, {"senator": "Tommy Tuberville", "party": "Republican", "sentence": "…with the Lord, but his work here on  Earth won't stop.\n\nI am glad to see that Turning Point has had more than 54,000 requests  for new chapters at colleges and high schools across the country.\n\nI have a granddaughter Rosie Gracie, and I will absolutely encourage  her to get involved in Turning Point when she is just a little bit  older.\n\nTo Charlie's grieving…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695705/expressing-support-for-the-designation-of-october-as-the-national-day-of-remembrance-for-charlie-kirk"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…and experience  to make decisions as to who to vote for in elections. The only way you  would want to do it is if you want to manipulate these young minds in  the schools across the country.\n\nI, like I think many other people, would have voted entirely  differently when I was 16 than when I was 26.\n\nWe have to be on the alert, and our comatose press…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693920/comatose-press-corps"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…reconciliation bill.\n\nHowever, the other one-half, the High-Quality Charter School Act, and  a tax provision contained therein, would triple the number of kids in  charter schools across the country remains missing still.\n\nI am encouraging my colleagues to ensure that we provide support for  charter school families in equal measure in a way that will expand…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691230/universal-school-choice"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…America and to  share why I think this is an extremely important program for us to  protect and to support right now and in the years ahead.\n\nRight now, we see our schools across this country in a state of  crisis. The nation's report card that recently came out revealed truly  shocking declines in student achievement, but one bright spot in this  otherwise…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Dave Joyce", "party": "Republican", "sentence": "…funded and vetted by the Chinese Government, a fact  that is rarely disclosed to the parents.\n\nA report from Parents Defending Education revealed that over 140 K-12  schools across the country had contracts with a Chinese Government  entity. Attached to these contracts are a variety of incentives,  including fully funded teacher exchanges, Chinese language…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697408/combating-the-lies-of-authoritarians-in-school-systems-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "…boards, and parents--the people who  are closest to the students and most invested in their success.\n\nThe Federal Government provides less than 10 percent of funding for  schools in this country. The other 90 percent of funding--money that  keeps the lights on, pays teachers, and buys new textbooks--well, that  comes from State and local governments and from…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688343/nomination-of-linda-mcmahon"}]