[{"senator": "Andrea Salinas", "party": "Democrat", "sentence": "Ms. SALINAS. Mr. Speaker, I thank Representative Vasquez for yielding  time.\n\nMr. Speaker, I rise in support of S. 356, the Secure Rural Schools  Reauthorization Act, my bipartisan legislation with Representatives  LaMalfa and Neguse in the House and Senators Crapo and Wyden in the  Senate.\n\nIn central and southern…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697662/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…teacher that profoundly impacted their lives.\n\nDespite working long hours, without a salary that reflects the work  they do, our teachers in Virginia have made sure that Virginia schools  consistently rank high in the country for K-12 performance, test  scores, and even safety. Over 92 percent of our students here in  Virginia graduate high school in 4 years,…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690753/national-teacher-appreciation-day"}, {"senator": "Lateefah Simon", "party": "Democrat", "sentence": "…to ensure that while the Republicans take away  healthcare from families and disabled children, those deaf and those  blind, that they get education and screening at their schools of  choice.\n\nWe are also here because advocates refused to be silent because  Congress recognized that an equal education is the foundation of any  democratic society.\n\nBefore…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698945/protecting-education-for-children-with-disabilities"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…Trump is  sending Christian refugees and women back to live under the Taliban  where they will face near-certain persecution.\n\nTrump is sending ICE officials to elementary schools where they tried  to gain access by lying about having permission from parents to speak  with their kids. ICE officials are arresting people with maximum  violence and lawlessness,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690540/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…administration.\n\nMaybe, Mr. Speaker, we should be reversing the Trump administration's  actions to close the Department of Education and rip away funding from  students, teachers, and schools.\n\nHouse Republicans are not likely to take on any of these actions that  I suggested because they refuse to take on President Trump, even when  he is breaking the law. It…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689263/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…Georgia. Always spurred by  a love of learning, he attended Lee County Training School in Leesburg,  Georgia, before pursuing Announcing and Broadcasting at the Broadcast  Schools of New York. Overseer Carter pursued theological studies at  Bethany Bible School and Theological Seminary, earning both a  Bachelor's in Ministry and a Master's in Theology.…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692741/in-memory-of-overseer-roosevelt-carter-i"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…districts and with students who are afraid for themselves and  their families. This trauma will last for years and will affect the  ability of these kids to learn and thrive in schools.\n\nI met with Latino businessowners who have seen significant reductions  in people visiting their shops and restaurants. The common thread in  their interactions was the word…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696911/aggressive-immigration-enforcement-tactics-in-oregon"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…rights.\n\nThey favor a minimum wage--the smaller the minimum the       better.\n\nThey indorse educational opportunity for all--but they       won't spend money for teachers or for schools.\n\nThey think modern medical care and hospitals are fine--for       people who can afford them.\n\nThey approve of social security benefits--so much so that       they took them…", "date": "2026-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1700295/president-trumans-words-still-ring-true-today-the-failings-of-the-state-of-the-union"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…to the lethality that can       come with any kind of experimentation or self-medication . .       . we must have specific fentanyl education introduced to . .       . our schools as soon as possible; otherwise, more children       will . . . die.\n\nThat doesn't even cost money.\n\nWe could be doing things through the Department of Education in  supporting…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687971/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-ocean-energy-management-relating-to-protection-of-marine-archaeological"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…administration and defunded in  the Republicans' big, ugly bill.\n\nI said this to Secretary Hegseth in our hearing last month: America's  future servicemembers are learning in our public schools. They might  rely on Medicaid to see a doctor. They may only have a meal to eat  because of WIC or food stamps, or they may live in subsidized housing.\n\nIf tomorrow's servicemembers…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693648/department-of-defense-appropriations-act-2026"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…cybertrucks, PBS and NPR won't get recalled because they are falling  apart.\n\nWhat is happening right now is pure bait and switch. Republicans are  trying to slash Medicaid, public schools, and programs like PBS so they  can give billions to Elon Musk and his fellow oligarchs. The corruption  we are seeing right now is outrageous, unprecedented, and cannot stand.", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689221/pure-bait-and-switch"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…forced to lay off educators and staff  who will not be paid without the Federal funding.\n\nFor many students across the country, the new school year starts in a  few weeks, and schools are now in an all-out crisis. As one  administrator told me, it is a ``five-alarm fire.''\n\nFunds authorized under the Every Student Succeeds Act are not a  luxury. They are…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693986/withheld-education-funds"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…lowering it.\n\nReal solutions to violent crime do not come from sending middle  schoolers to adult court. They come from investing in communities. They  come from supporting our schools, expanding after-school programs,  providing job training, and ensuring access to mental health services.\n\nI urge my colleagues to reject this misguided and dangerous bill.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695783/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Marc Veasey", "party": "Democrat", "sentence": "…communities, and instilled in her students a lasting sense  of discipline, perseverance, and hope. Her contributions have had a  profound and enduring impact, shaping not only the schools she led but  also the countless lives she touched.\n\nToday, we celebrate Mrs. Shirley Knox Benton not only for her  historic achievement but also for her unwavering devotion…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695981/recognizing-mrs-shirley-knox-benton"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…without a first name, a last name, and a shield number. We want to  mandate body cameras with strong protocols; protect sensitive  locations, including houses of worship, schools, and hospitals; and  restrict the use of deadly force.\n\nWe also want to enforce humanitarian standards in ICE and CBP  custody, ban military-grade equipment, strengthen civil…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699655/horrific-ice-abuses"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…Mr. Speaker, I rise today in support of H.R. 981 offered by the  gentleman from Wisconsin (Mr. Van Orden), my friend and colleague.\n\nThe bill would improve the information schools are required to give  individuals regarding GI Bill benefits.\n\nCurrently, schools are required to give an estimated cost of  education to anyone who potentially will use the…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689602/veterans-education-transparency-and-training-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "Mr. WESTERMAN. Mr. Speaker, I rise today in support of S. 356, the  Secure Rural Schools Reauthorization Act of 2025, which is a lifeline  for rural school districts that have experienced severe budget impacts  since 2023 when the program was not reauthorized.…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697657/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…in Legislative Affairs from George Washington University in  2023.\n\nKyle was an honor graduate from the Army's Ranger School, Basic  Officer Leader's Course, and Air Assault schools. After completing  Airborne school and Master Jumpmaster school with distinction, Kyle  spent most of his 17-year career at the tactical level specializing in  combined arms…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694098/recognizing-the-service-of-lieutenant-colonel-kyle-frazer"}, {"senator": "John Thune", "party": "Republican", "sentence": "…there is a widening gap in student performance. This should concern all  of us.\n\nAs the son of two public school educators and father of two daughters  who went to public schools, I know this problem is not going to be  fixed by Washington bureaucrats. It is going to be fixed by good  teachers, administrators, school boards, and parents--the people…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688343/nomination-of-linda-mcmahon"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…lot of the programs in our  current budget are programs designed to destroy the nuclear family.\n\nI have two other quick comments. One is with regard to transgender  and local schools. A lot of people have talked about men in women's  sports, and I don't even think that is the biggest scandal. I think the  biggest scandal is that we are educating our young…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689603/diversity-equity-and-inclusion"}, {"senator": "Pat Fallon", "party": "Republican", "sentence": "…American and  allied troops through the Middle East during Operation Iraqi Freedom.  On top of that, Pat and Beth have poured countless hours into  volunteering with local schools, educational programs, and park  district programs.\n\nIt is an honor to bestow Pat with the Patriot Award for his  exceptional service to our Nation. I thank him for all he…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694136/recognizing-congressional-patriot-award-recipient-pat-terrell"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "Mr. THOMPSON of Pennsylvania. Mr. Speaker, I rise to recognize Public  Schools Week.\n\nApproximately 9 out of 10 American students receive their education  from a public school. Our public school system, envisioned by our  Founding Fathers, is meant to…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688125/recognizing-public-schools-week"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…benefits to the region       that would have otherwise been absent. Our North Slope       residents are keenly aware that advances in our communities--      running water, local schools, health care, public safety,       electricity, and more--have come because of the coordination       and cooperation of Alaska Native leaders and entities across       the…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696834/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…showing how this has infiltrated K-12 classrooms as well as  funding from Qatar ended up at Brown University which developed anti- Israel curricula that then went to 8,000 K-12 schools throughout the  entire country.\n\nThe DETERRENT Act is a much-needed, commonsense piece of legislation  that simply says if you are going to accept funding from foreign  countries,…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689035/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "Mr. KILEY of California. Mr. Speaker, as a cosponsor of the Secure  Rural Schools Reauthorization Act, I am very glad and relieved this day  has finally come.\n\nMr. Speaker, seven of the counties in my district rely on this  program to assure every child…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697664/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…possible terms as irresponsible,  inflammatory, outrageous, revolting, and wrong. It should be ridiculed  and shamed.\n\nBusinesses have every right to protect their reputation, and schools  have every right to protect their children, but we should defend their  right to say what they will and trust that the vast majority of  Americans will see it for what it…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695787/beating-heart-of-democracy-is-freedom-of-speech"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "Mr. CARTER of Georgia. Mr. Speaker, I rise today to recognize Buford  City Schools as being named among the top school districts in America.\n\nEducation is one of the greatest gifts we can provide our children,  and I am proud that Georgia is receiving recognition…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691892/recognizing-buford-city-schools"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…overwhelming caseload while working hard to try to solve dozens of  projects that an activist judge has placed on hold in our communities  that they desperately need, like stormwater, schools, and even sewer  treatment plants not under construction, protecting our most precious  environments. But we can't unless the permits can be issued.\n\nThis is about predictability,…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698027/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…Accountability  Office Detailee for the Subcommittee on Oversight and Investigations  where she has been a critical team member in leading investigations  into Anti-Semitism in medical schools and hospitals and supported the  Committee's role in the bipartisan AI Task Force report that came out  in the 118th Congress. Kristen was also essential in Committee efforts…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691958/recognizing-kristen-pinnock"}, {"senator": "Rick Crawford", "party": "Republican", "sentence": "…thousands of Arkansas educators.\n\nMr. Vent's love for learning began in a three-room schoolhouse, which  had no indoor plumbing. He has spent most of his educational career in  schools along the Mississippi Delta, or what he calls ``the pure  Delta.'' He has dedicated his life to selflessly serving the community,  and ensuring students are prepared for a…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693884/recognizing-lee-vent"}]