[{"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…will be happening again this year.\n\nThey offer after-school programming, provide meal service at local  shelters, and help the next generation get involved, engaging high  school students and volunteer work.\n\nI am thankful for all Sewa International does for our communities.      Supreme Court of Virginia Prevented a Toll Hike on Dulles Greenway\n\nMr. SUBRAMANYAM.…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693866/recognizing-the-remarkable-work-of-sewa-international"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…Rising  in 2015.\n\nEducators Rising is a community-based Career and Technical Student  Organization within Phi Delta Kappa (PDK) International that develops  middle and high school students in rural, urban, and suburban  communities to become highly skilled educators in the communities where  they live.\n\nAs a ``Grow Your Own'' initiative, Educators Rising…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688484/recognizing-the-10th-anniversary-of-educators-rising"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…program for undocumented students. Finally, after receiving  DACA, she obtained her work authorization. She got a job overseeing a  leadership program for Connecticut high school students.\n\nThese two remarkable stories are just two examples of the  extraordinary impact that DACA recipients have on our community.\n\nLast December, President Trump said:\n\nWe…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692242/daca"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…President, but our children never will  because they are as evergreen as Evergreen High School. This is the  first time and the last time that they will be elementary school  students and middle school students and high school students. I think  we need to find a way to channel their raw emotion, their confusion,  their anger, their fear, and their…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695673/cloture-motion"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…have terminated over 1,400 meritorious grants totaling  more than $1 billion in funds.\n\nSome of the projects that these funds would have supported include  giving middle school students opportunities to use math and design to  address agricultural issues; identifying the use of deepfakes and  curbing the spread of misinformation; and supporting and training…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691188/protect-medicaid"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…who is terrified that  his family and friends will be kidnapped. I spoke with education  leaders who were in tears about the trauma they are seeing in their  school districts and with students who are afraid for themselves and  their families. This trauma will last for years and will affect the  ability of these kids to learn and thrive in schools.…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696911/aggressive-immigration-enforcement-tactics-in-oregon"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "Ms. DEXTER. Mr. Speaker, I recently held the first meeting of my  Youth Advisory Council, a group of two dozen high school students from  my district who will help guide my work here in Congress.\n\nThese students spoke boldly about their fears and hopes for the  future, and they made one thing clear:…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696966/youth-advisory-council"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…healthcare and community. Over the past 27  years, New Hampshire AHEC has focused on building the healthcare  workforce by offering both day and residential programs for high school  students, while also providing didactics and community-based  experiences for health professions students across the State. I cannot  stress enough how important the New Hampshire…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689246/national-ahec-week"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…preparing, and inspiring the  next generation of educators.\n\nEducators Rising is a community-based, Career and Technical Student  Organization that supports middle and high school students in rural,  urban, and suburban communities with a passion for teaching in their  communities.\n\nWith over 60 percent of K-12 educators in the United States teaching  within…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688150/recognizing-the-10th-anniversary-of-phi-delta-kappa-internationals-educators-rising"}, {"senator": "Madeleine Dean", "party": "Democrat", "sentence": "…actors  who share their intimate images, real or fake, without consent and from  the most harmful developments of AI.\n\nDuring the 2023-2024 school year, 15 percent of high school students  reported hearing about deepfakes of nonconsensual intimate images that  depicted kids at their schools. It happened to one of my hometown  constituents, a 20-year-old,…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690183/tools-to-address-known-exploitation-by-immobilizing-technological-deepfakes-on-websites-and-networks-act"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…delivered to students. Medicaid funding is the  fourth largest Federal funding stream for public schools.\n\nTwo weeks ago, I visited the Campus School in Boston, which is a  school for students with complex disabilities and extensive support  needs. During my visit, I met Natalie, a middle school student, and her  mom Julia. Natalie has Dup15q syndrome, which…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697522/50th-anniversary-of-individuals-with-disabilities-education-act"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…ICE surrounded him, traumatizing  the child, other parents, and preschool teachers. ICE then arrested the  father within sight of the school.\n\nIn October, two Oregon high school students were at a drive-through  coffee shop near their school. They were surrounded by multiple ICE  agents who were pointing guns at them. That is terrifying, outrageous,  and…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698641/immigration-enforcement-and-schools"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…can so callously plan to take a chain saw to the American dreams of so  many current and future students.\n\nBut, today, we are here to say that tens of millions of public school  students are not line items on your chopping block. They deserve  better. Our country is better than this.\n\nI urge all of my colleagues to reject President Trump's attempts to…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688250/nomination-of-linda-mcmahon"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…schools. They are killing American citizens. They are  disappearing legal migrants.\n\nI went down to Texas, a couple of weeks ago, and sat across a table  from two elementary school students who had been detained illegally for  6 weeks over Christmas, while their mother wasn't home. It was a choice  ICE made to traumatize and terrorize these children. Those…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700057/9999"}, {"senator": "Marilyn Strickland", "party": "Democrat", "sentence": "…Rights. The city  implemented key police reforms, including updates to the use-of-force  standards. She established the city of Tacoma's first Youth Commission,  giving high school students a chance to learn how government works. She  passed Home in Tacoma, which expanded key and necessary housing  opportunities across the entire city. She also raised our…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698197/recognizing-retiring-tacoma-mayor-victoria-woodards-for-her-years-of-service"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…Dutton, and Lex Flores, alongside all other  members, planned and carried out projects that range from food drives  to environmental cleanups, demonstrating that middle school students,  when given the tools and the trust, can rise to extraordinary heights.\n\nMr. Speaker, fewer than 10 percent of FFA chapters nationwide receive  this distinction. Warren…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696845/recognizing-50th-anniversary-of-opera-roanoke"}, {"senator": "Mike Flood", "party": "Republican", "sentence": "…highest honor presented at the competition,  and it also means that Rebel Robotics secured a world championship  title in Houston.\n\nI congratulate these exceptional high school students on their  achievements and for inspiring others to explore the world of robotics.", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690724/recognizing-first-national-bank-of-omaha"}, {"senator": "Max Miller", "party": "Republican", "sentence": "…The career center is a  partnership with six public school districts in northeast Ohio and  offers advanced career and technical education for approximately 1,200  high school students and nearly 3,000 adult students.\n\nAdditionally, the center offers secondary career development  resources and student internship opportunities, preparing students to…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689426/recognizing-medina-county-career-center"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…was passionate about educating students about the Federal  Government, playing an instrumental role in implementing the  Presidential Classroom, a program teaching high school students about  the U.S. Constitution and the workings of Washington, D.C.\n\nIn 1975, after the birth of his child, Richard Austen, the family  fell in love with and then moved…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691783/recognition-of-richard-dick-wallace"}, {"senator": "Ken Calvert", "party": "Republican", "sentence": "Mr. CALVERT. Mr. Speaker, I rise today in proud recognition of four  Corona High School students, Seth Hernandez, Billy Carlson, Brady Ebel,  and Ethin Bingaman who were selected in the 2025 Major League Baseball  Draft. Seth Hernandez, Billy Carlson, and Brady Ebel…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693755/recognizing-seth-hernandez-billy-carlson-brady-ebel-and-ethin-bingaman"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…ensuring that the  sacrifices of our Nation's heroes are not forgotten by future  generations. In 2025, he launched the Walk Among Heroes Youth  Ambassador Program where high school students walk the grounds of  historic battlefields while learning from WWII Veterans.\n\nMr. Speaker, let us all join in recognizing Michael A. Tarr for  receiving the prestigious…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696875/recognizing-mr-michael-tarr-on-being-named-marquette-county-veteran-of-the-year"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "Mr. SMUCKER. Mr. Speaker, I am pleased to recognize and congratulate  Solanco High School students Robert Baxter, Lucas Vilk, and Caleb Reed  on their success in the 2025 Student Drone Challenge.\n\nThe Student Drone Challenge is hosted by the Interaction of Ionizing…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698689/recognizing-solanco-high-school-students-for-their-performance-at-the-2025-student-drone-challenge"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…opportunity to serve  food to their peers.\n\nThe program allows 18 students to participate in morning class and an  additional 15 students to participate in the afternoon. High school  students from Clearfield, Curwensville, West Branch, Philipsburg- Osceola, and Moshannon Valley are eligible to enroll in the program.\n\nThe cafe operates as a training lab, giving…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699201/highlighting-student-run-cafe-at-clearfield-county-career-and-technology-center"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…aviation fabrication and assembly program in an economically  disadvantaged high school.\n\nUnder his leadership, this program became the first in the Nation to  award high school students with the National Aerospace/Aircraft  Assembly certification.\n\nIt is with great pride that I recognize his exceptional achievements  in building the local talent pipeline,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690495/congratulating-bill-mcinnish"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…beginning in civility from a  low point that this body can rise and behave in the manner, I think,  that all of the American people want it to behave, and certainly those  high school students that were watching from home, who were so excited  that their teacher was here to experience this special moment.", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688495/raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Marlin Stutzman", "party": "Republican", "sentence": "…their high standards through excellent  performance on State-required tests, a 95 percent graduation rate, and  exceeding expectations for college readiness.\n\nIn high school, students learn more than just math and chemistry  equations. Rather, students build their work ethic, establish critical  thinking skills, and learn what it means to be a citizen…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694841/recognizing-carroll-high-school"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…Caucus' core missions is to spotlight  exceptional educators, and Utah is blessed with so many. My team  recently visited Bluffdale Elementary, a dual language immersion school  where students start learning Portuguese in the first grade and stick  to it throughout high school.\n\nTwo inspiring classrooms were taught by Ms. Jessica Bell-Aver's first  grade…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691516/recognizing-bluffdale-elementary-school"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…across the country.\n\nI am also continuing to advocate for the High-Quality Charter Schools  Act, a bill I have introduced that would enable a similar measure of  school choice for students in the public school system through charter  schools, potentially tripling the number of students attending charter  schools across America.\n\nEight, when it comes…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Pat Ryan", "party": "Republican", "sentence": "…material in Cornwall.\n\nCornwall Cleanup Crew has become a popular community service  opportunity for students, including at The Storm King School and  Cornwall High School, whose students both contribute to the cleanup  efforts and learn about the importance of environmental protection.\n\nFinally, after a multiyear, lengthy process, the Cornwall Cleanup…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694021/recognizing-cornwall-cleanup-crew"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…we can help close our Nation's  skills gap and let students find the pathway to fulfilling careers.\n\nThe Counseling for Career Choice Act ensures that middle and high  school students are made fully aware of their career and educational  options prior to graduation so that they are aware of all the  opportunities before them.\n\nCTE has established itself…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695635/career-and-technical-education-caucus"}]