[{"senator": "Danny Davis", "party": "Democrat", "sentence": "…National Urban League leader, Whitney M. Young, was alive  today, he would join with us to congratulate Principal Rickey Harris  and the entire Whitney M. Young Magnet High School community,  especially the 23 ACT perfect scorers, on this monumental  accomplishment.\n\nImagine 23 perfect scorers in one school and in one place. What an  accomplishment. What…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692107/in-honor-of-charles-rangel"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…their lives. They all brought home a  championship, and they did it with teamwork and pride. They made us all  incredibly, incredibly happy that day.\n\nThey made their school and community and so many smile, so I  congratulate the Falcons.", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697975/divine-child-championship"}, {"senator": "Sylvia Garcia", "party": "Democrat", "sentence": "…months of hard work, and a season defined  by focus and resilience. It is a testament to the commitment of these  student-athletes and the pride they bring to their school and  community.\n\nThe Galena Park North Shore Mustangs have once again given Texas 29 a  moment to celebrate. Their achievement will be remembered not only for  the title itself, but…", "date": "2025-12-23", "source_url": "https://justfacts.votesmart.org/public-statement/1698467/congratulating-the-galena-park-north-shore-mustangs"}, {"senator": "Rashida Tlaib", "party": "Democrat", "sentence": "…profiled him--yes, they did--Oh, he can't  speak English, let's call immigration. He spoke English just fine.\n\nThat set into motion him being separated from his mother, his school  community, and ripping away his chance to be able to graduate with his  classmates.\n\nICE cruelty is evident because they sent him to Louisiana. He had  paperwork on file. He was…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692494/violations-of-rights-by-ice"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…team's stuffed animal  mascot, Thleebuss, deserves a little bit of credit.\n\nWe congratulate Coach Harrington, Coach Young, the Winter Guard, and  the Independence High School community on their championship.            Honoring Richard Martin on his 700th Platelet Donation\n\nMr. SUBRAMANYAM. Mr. Speaker, I rise today to honor Richard Martin of  Sterling,…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689774/congratulating-chief-keith-johnson-on-his-retirement"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…High School was recognized in Virginia for its  growing attention to environmental awareness and stewardship. The  students' efforts have made a lasting impact on the school and  community.\n\nI extend a special thank-you to the students, teachers, and parents  for their expertise and guidance along the way. The Woodgrove High  School Wolverines have made…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692320/congratulating-john-champe-high-school-class-of-2025"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "…looking away while Big Tech profits from tearing  our communities apart. Empathy is action against gun violence, the fear  that stalks every one of us. It stalks every school, every community,  and every public gathering.\n\nEnough with the excuses. Enough is enough.\n\nChildren's lives are worth more than the profits of gun  manufacturers. We need commonsense…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695714/calling-for-empathy-in-the-face-of-tragedy"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "…advocating for  Florida's agriculture industry. Born on April 6, 1942, in Samson,  Alabama, Bobby later moved to Florida, where we shared an alma mater,  Maynard Evans High School, and community, Pine Hills, Florida.  Following his graduation in 1961, Bobby began his lifetime service to  the Central Florida community.\n\nBobby first served as an area representative…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688335/in-memory-of-mr-bobby-beagles"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "…championship since 2017.\n\nI thank and congratulate Coach Preble, his staff, the players,  parents, fans, and everyone who played a part in this special season.  They made their school and community incredibly proud.\n\nOnce again, I congratulate them. Go Lancers. This is their victory.  They earned it, so enjoy.", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691925/jc-flag-football-championship"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…most  decorated swimmers in school history and will continue his athletic and  academic journey at Carson-Newman University.\n\nThe Glenvar Highlanders have made their school and community proud. I  ask my colleagues to join me in congratulating these outstanding young  athletes.\n\nHonoring the Life of Justice Lawrence Larkins Koontz, Jr.\n\nMr. CLINE. Mr.…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689724/congratulating-glenvar-high-school-boys-swim-team"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…outstanding  educator and mentor, Dave Blanchard, who was recently honored by the  Prairie Conference for 27 years of dedicated service to the Long  Prairie-Grey Eagle School community.\n\nFor nearly three decades, Dave has been the definition of stepping up  whenever needed. In addition to being a cornerstone of LPGE's English  department, he has served…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699884/congratulating-ellen-lampton"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…strong advocate for parent  involvement. He actively supports all parent involvement in evening  events, encouraging other parents to participate and engage with the  school community. His enthusiasm and dedication help to build a sense  of unity and positivity within the school and its surrounding  community. Mr. Robert Ross is a cornerstone of the…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691992/recognizing-robert-ross"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…national stage.\n\nMr. Speaker, I applaud both Aybrah and Elena and the entire West  Shamokin FBLA team for their leadership, hard work, and bright futures.  They make their school, their community, the Commonwealth, and this  Congressman very proud.", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693666/recognizing-aybrah-zelenski-and-elena-gourley"}, {"senator": "Jim Baird", "party": "Republican", "sentence": "…players on  this team should be proud of the hard work that allowed them to reach  the State championship. Their dedication in every game is an  inspiration to their school and community.\n\nI also thank the parents, teachers, staff, and coaches for all of  their contributions and support throughout this football season.\n\nMr. Speaker, I congratulate the…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698081/recognizing-pioneer-high-school-football-team"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…work and  dedication, both on and off the field, in achieving this accomplishment  is truly outstanding. He has achieved an impressive season, bringing  pride to his school and community.\n\nMr. Speaker, I ask my colleagues to join me in paying special tribute  to Nathan Bright of North Ridgeville High School. On behalf of the  people of the Fifth District…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693333/special-recognition-of-nathan-bright-for-winning-the-division-i-state-track-and-field-title-for-high-jump"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…placed first in the employment skills competition, and Brayden  placed first in the English creed speaking event. Their hard work and  commitment are a credit to their school and community.\n\nI congratulate Jilian and Brayden on their victories.", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698583/recognizing-mary-krinkie"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…work and dedication, both on and off the track, in  achieving this accomplishment is truly outstanding. She has achieved an  impressive season, bringing pride to her school and community.\n\nMr. Speaker, I ask my colleagues to join me in paying special tribute  to Isabella Zahn of Coldwater High School. On behalf of the people of  the Fifth District of…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693373/special-recognition-of-isabella-zahn-for-winning-the-division-iii-state-track-and-field-title-for-the-200-meter-dash-400-meter-dash-and-long-jump"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…work and dedication,  both on and off the track, in achieving this accomplishment is truly  outstanding. She has achieved an impressive season, bringing pride to  her school and community.\n\nMr. Speaker, I ask my colleagues to join me in paying special tribute  to Ariannah Floyd of Firelands High School. On behalf of the people of  the Fifth District of…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693403/special-recognition-of-ariannah-floyd-for-winning-the-division-ii-state-track-and-field-title-for-the-300-meter-hurdles"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…staff are treated to breakfast or lunch, and  receive tokens of gratitude from the community. Through her actions,  Shae has fostered a sense of unity and pride within the school  community. Her ability to bring people together, whether it's parents,  students, or staff, has created a supportive environment. Shae's impact  is felt not just in the success…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691987/recognizing-shae-burgess"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "…record of 28 wins and only 1 loss.\n\nI congratulate Coach Shannon Woolridge, the players, and everyone who  played a part in this special season. They have made their school and  community incredibly proud.\n\nThe Ravens should enjoy this victory they earned. Congratulations to  the Ravens.                 Congratulating Salpointe Women's Tennis Team\n\nMr.…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691459/recognizing-empire-high-schools-softball-team"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…work and dedication, both on  and off the track, in achieving this accomplishment is truly  outstanding. He has achieved an impressive season, bringing pride to  his school and community.\n\nMr. Speaker, I ask my colleagues to join me in paying special tribute  to Owen Scott of Van Wert High School. On behalf of the people of the  Fifth District of Ohio,…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693332/special-recognition-of-owen-scott-for-winning-the-division-ii-state-track-and-field-title-for-the-1600-meter-run"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…work and dedication, both  on and off the track, in achieving this accomplishment is truly  outstanding. She has achieved an impressive season, bringing pride to  her school and community.\n\nMr. Speaker, I ask my colleagues to join me in paying special tribute  to Anna Roessner of Fort Recovery High School. On behalf of the people  of the Fifth District…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693404/special-recognition-of-anna-roessner-for-winning-the-division-iii-state-track-and-field-title-for-the-100-meter-dash"}]