[{"senator": "Bennie Thompson", "party": "Democrat", "sentence": "…Society, the ESPN The Magazine Academic All-District  Team, and NCAA Football All-American honors.\n\nMr. Younger continued his academic pursuits at the Mississippi  College School of Law, earning his Juris Doctor degree in 2012. During  his time in law school, he was awarded the Best Paper Award in the  Constitutional Law Seminar, the John B. Fareese Trial…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695590/9999"}, {"senator": "Pramila Jayapal", "party": "Democrat", "sentence": "…many cases she has handled.\n\nOff the bench, she has mentored countless law students, new attorneys  and law clerks, taught as Jurist in Residence at Seattle University  School of Law, volunteered for the Seattle Girls' School Mock Trials  for nearly two decades, and co-chaired the Washington State Bar  Association/University of Washington Law School…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697901/recognizing-the-contributions-of-mary-yu"}, {"senator": "Marc Veasey", "party": "Democrat", "sentence": "…Hicks's distinguished career stands as a testament to  perseverance, excellence, and leadership. As the first African American  woman to graduate from Texas Tech University School of Law in 1974,  Judge Hicks broke numerous barriers in Tarrant County, serving as the  first Black female Municipal Judge, Chief Municipal Judge, Probate  Court Master, District…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699927/recognizing-the-honorable-judge-maryellen-hicks"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…mentorship in building a stronger future for government  leadership.\n\nThis edition includes other student led interviews by Cameron Mayers  from the University of Mississippi School of Law, Adam Royko from  Cleveland State University, Zahra Wakilzada from Georgetown University,  Sydney Aalbers from Texas Tech University, Skylar Kil from Tulane  University,…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692884/stennis-center-for-public-service-winter-2024-public-service-review"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…of       litigation.            Sincerely yours,\n\nCaroline Fredrickson, Georgetown University Law Center;       Erwin Chemerinsky, University of California, Berkeley School       of Law; Stephen I. Vladeck, University of Texas Law School;       Franita Tolson, University of Southern California, Gould       School of Law; Jessica Bulman-Pozen, Columbia…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696933/common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…of       litigation.            Sincerely yours,\n\nCaroline Fredrickson, Georgetown University Law Center;       Erwin Chemerinsky, University of California, Berkeley School       of Law; Stephen I. Vladeck, University of Texas Law School;       Franita Tolson, University of Southern California, Gould       School of Law; Jessica Bulman-Pozen, Columbia…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695596/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…you  will graduate, go to middle school and graduate, go to high school and  graduate, and then go to college and graduate. Then she dreamed about  us going to graduate school, get a law degree, a Ph.D., a medical  degree, an MBA, some form of advanced education. We were, like:  Grandma, we are going to be in school our entire lives.\n\nShe was so committed…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Diana DeGette", "party": "Democrat", "sentence": "…circumstance or  situation.\n\nJerry was a proud son of Pueblo, Colorado. He stayed in Colorado for  his education, attending Colorado State University and the University  of Denver School of Law, where he was a member of the law review.\n\nAfter graduating from law school, Jerry established a legal career  fighting for people who needed a strong advocate. He was…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690315/in-remembrance-of-gerald-p-mcdermott"}, {"senator": "Sara Jacobs", "party": "Democrat", "sentence": "…that, let's take the gentlewoman's point at face value. She  wants  to protect women. Great. So do I. Bathroom bans do not protect women.\n\nThe Williams Institute at the UCLA School of Law even did a study on  it, and there is zero evidence that allowing trans people to use the  correct bathroom increases the risk to others. In fact, it is actually  opposite.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695241/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Nancy Pelosi", "party": "Democrat", "sentence": "…F. Kennedy. When  President Kennedy was President, Steny and I worked in the office of  Danny Brewster of Maryland. That is when I got to know him. I was just  out of school. He was in law school. Sadly, we saw the assassination of  the President, and that was a horrible thing.\n\nAs he concludes his extraordinary leadership and service in the  Congress,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698705/recognizing-the-honorable-steny-hoyer"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…the Free State's world class colleges and universities. She's earned  degrees at the University of Maryland-College Park, Hood College, and  the University of Baltimore School of Law. On behalf of a grateful  Nation and the residents of Maryland's beautiful 8th District, I wish  Maryam Azarion nothing but the best as she begins a new chapter in her…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695862/congratulating-ms-maryam-azarion-on-her-retirement-after-more-than-25-years-of-federal-service"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…program.\n\nRosemari: Now, Rosemari says that she has an adult son, and that son  has CP, a seizure disorder, cystic--this is where maybe I should have  gone to medical school and not law school--cystic encephalomalacia. My  cousin, the doctor is here. She would be able to help me if she was  down here.\n\nBut it is her son, her adult son is on the autism…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Voters of the District of Columbia, League of Women Voters of       the United States, Legislation Clinic (University of the       District of Columbia David A. Clarke School of Law), Metro DC       DSA, Migrant Solidarity Mutual Aid, Miriam's Kitchen, More       Than Our Crimes.\n\nMovement for Freedom, Neighbors for Justice, Neighbors       United…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696988/opposition-letter-led-by-the-dc-justice-lab-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "Mr. COHEN. Mr. Speaker, I rise today to congratulate Sue Ann  McClellan, the University of Memphis Cecil C. Humphreys School of Law  Assistant Dean for Admissions, who will be retiring on July 30 after 30  years.\n\nDean McClellan has guided students at my law school alma mater into  the legal profession…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693637/congratulating-sue-ann-mcclellan-on-her-retirement"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…recently passed away.\n\nFor 28 years, Gerry served as the Mount Vernon district supervisor,  but he was no ordinary public servant. After getting his LLB from  George Washington School of Law, he decided that was not taxing enough  and proceeded to earn a master's of law in taxation from George  Washington School of Law.\n\nGerry was a man who wore many hats,…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687959/congratulating-dame-karen-pierce"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…Institute for the United States Chamber of Commerce after receiving his  bachelor's degree from Elon University and his Juris Doctorate from the  University of Baltimore School of Law. In 2020, Jake came to the United  States of House of Representatives as Policy Advisor and Counsel to  Congressman David McKinley (WV-01) before becoming General Counsel…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689859/recognizing-jake-tyner"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…were no  survivors. Of those who perished, seven were Kansans.\n\nKiah Duggins, a civil rights attorney and a Wichita native, was set  to begin teaching at Howard University School of Law.\n\nLindsey Fields, a professor at Butler Community College and the  president-elect of the National Association of Biology Teachers, was  traveling to our Nation's Capital…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699417/9999"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…service to the House Committee on Energy and Commerce.\n\nA graduate of Wayland Baptist University, The University of Sydney,  and The Catholic University of America's Columbus School of Law, Joanne  began her career on Capitol Hill as a Law Clerk for the United States  Senate Committee on the Judiciary in 2022 after having previously  worked in the legal field.…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692136/recognizing-joanne-thomas"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…judge of the Virginia Court of Appeals and  as a justice of the Supreme Court of Virginia.\n\nA Roanoke native and graduate of Virginia Tech and the University of  Richmond School of Law--go Spiders--Justice Koontz was known for his  clarity of writing, profound sense of fairness, and deep commitment to  justice. Justice Koontz mentored generations of legal…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689724/congratulating-glenvar-high-school-boys-swim-team"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Brunswick Judicial Circuit. Mr. Blackerby  earned his bachelor of arts in English from Emory University and his  juris doctor with honors from the University of Georgia School of Law,  where he served on the editorial board of the ``Journal of Intellectual  Property Law.'' He was also a member of both the Federalist Society and  the Student Bar Association.…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699982/governor-kemp-appoints-new-judges-to-superior-and-state-courts-in-georgia"}]