[{"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…President Trump is proposing on tariffs on  Canada.\n\nThe owner of Chatila's Bakery moved to the United States 36 years  ago. He was a cardiologist and his brother a Ph.D. scientist. They are  from Lebanon. He became a citizen, raised his family, and sent his  daughter to college. He and his brother got interested in sugar-free  desserts and candies…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689483/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Scott Peters", "party": "Democrat", "sentence": "…coastal recreation.\n\nWith cuts to NASA, NOAA, and the National Science Foundation, she has  seen labs at Scripps shut down and watched her coworkers lose their  jobs.\n\nAnother scientist whose research focuses on ensuring energy security  has felt the consequences of this administration's policy. She has had  her research censored by an administration that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695749/funding-cuts-to-science"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…apply for a federal grant in 2025 to       further my research, but with the current uncertainty, I am       deeply concerned about my application's future.\n\nHere is another scientist:\n\nMy 5-year NIH grant is in its second year; and although my       first-year budget ended and I submitted all the required       documents, my second-year funding was cut.…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Valerie Foushee", "party": "Democrat", "sentence": "…Speaker, I rise today as the Representative of  North Carolina's Fourth Congressional District, and the home of the  Research Triangle Park, to share the story of a Federal scientist, in  their own words, who was fired by President Trump and Elon Musk.\n\nI worked for the Department of Health and Human Services. I       was responsible for leading technical…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688136/fired-by-president-trump"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "Ms. RIVAS. Mr. Speaker, I rise to share the story of a Federal  scientist from California who, in their words, was fired by President  Trump and Elon Musk.\n\nThey wrote:\n\nI was a Pathways student intern at the EPA. I was assisting       and training…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688132/fired-by-president-trump"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…Capitol each year.\n\nThis legislation would change that, honoring one of the greatest  minds and patriots in American history.\n\nBenjamin Franklin was a statesman, diplomat, scientist, inventor,  political philosopher, and businessman. His groundbreaking experiments  pushed forward scientific understanding, his role as the first  Postmaster General created…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688219/procurement-and-placement-of-statue-of-benjamin-franklin-in-the-united-states-capitol"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…mentioned, but it is looming.\n\nIt is important to step back a moment and understand how we got to  this point. There is no better way to begin than with J. Robert  Oppenheimer, the scientist who led the team of physicists and engineers  who built the first atomic bomb. Oppenheimer, as you know, directed the  Manhattan Project's Los Alamos Laboratory in a way…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694014/new-start-treaty"}, {"senator": "Deborah Ross", "party": "Democrat", "sentence": "Ms. ROSS. Mr. Speaker, I rise today to share the story of a Federal  scientist who was fired by President Trump and Elon Musk.\n\nIn their own words, this researcher wrote:\n\nI was a biologist with USDA's Animal and Plant Health       Inspection Service.…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688173/fired-by-president-trump"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…grew up at the  university, where both of my grandparents, who raised me, worked. My  grandmother ran the costume lab at the theater department, and my  grandfather was a scientist. He was a biochemist who spent four decades  unlocking the key to how our metabolism works--in large part thanks to  funding from the National Institutes of Health. My grandfather…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688264/national-institutes-of-health"}, {"senator": "George Whitesides", "party": "Democrat", "sentence": "…that wildfires have       on drinking water quality. My work is not political, and my       career should never have been politicized. This was my dream       job.\n\nAnother scientist, in their own words, said:\n\nI was a biologist for the U.S. Geological Survey. I       conducted wildfire and fuels-related research in Sequoia and       Kings Canyon National…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688224/fired-by-president-trump"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "Mr. BEYER. Mr. Speaker, I rise to share the story of a Federal  scientist, and a constituent of mine, who has witnessed the impacts of  President Trump and Elon Musk's recent firings. He wrote:\n\nThis week, 168 of my colleagues at the National Science…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688192/fired-by-president-trump"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "Mr. TONKO. Mr. Speaker, I rise to share the story of a Federal  scientist who was fired by President Trump and Elon Musk.\n\nIn the employee's own words:\n\nI was the quality manager for an FDA human and animal food       laboratory which tests foods…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688139/fired-by-president-trump"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…given       priority to calling for abolition of nuclear weapons. It's a       position that occupies the highest moral ground, famously       seized by the Nobel laureate scientist George Wald in a       widely reprinted 1969 anti-war speech at MIT. ``Nuclear       weapons offer us nothing but a balance of terror, and a       balance of terror is still…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693757/marking-80-years-after-trinity-the-dangers-of-nuclear-war-have-never-been-higher"}, {"senator": "Eric Swalwell", "party": "Democrat", "sentence": "…origin of this bill because it is a  success story for anybody who believes that they can write to their  legislator and see a change in the laws that govern us. I thank  scientist Emily Calandrelli, a Californian whose advocacy and personal  testimony brought national attention to this issue. She wrote about the  exact experience I described, traveling…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696792/bottles-and-breastfeeding-equipment-screening-enhancement-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…Bachelor of Science in Computer Science from Mount  Saint Mary's University and a Master of Science in Computer Science  from Towson University. Branden is a talented research scientist at a  research and engineering company. Together, Emily and Branden have  built a strong, loving partnership that reflects their shared values  and passions.\n\nMr. Speaker,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690468/recognizing-the-marriage-of-emily-mclaughlin-wisniewski-and-branden-anton-ehrenreich"}, {"senator": "Jim Baird", "party": "Republican", "sentence": "…held a fellowship at the National Cancer Institute at  NIH and led breast cancer research at the University of Vermont.\n\nDr. Plaut then joined NASA and served as the lead scientist for the  International Space Station Biological Research Project, working with  engineers to build life science habitats for zero gravity.\n\nDr. Plaut joined Purdue University…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690518/congratulating-mccutcheon-high-schools-mavericks-robotics-team"}, {"senator": "Jim Baird", "party": "Republican", "sentence": "…not award any new funding.  As we look at reining in the out-of-control government spending and  bureaucracy, we must work with the resources we already have.\n\nAs an animal scientist, I understand the life-changing effects STEM  education can have when it comes to our livestock, creating innovative,  more effective farming techniques, our food quality,…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688977/mathematical-and-statistical-modeling-education-act"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…companies of three  researchers who simultaneously received Federal grants.\n\nIn September 2024, the Research Foundation of the State University of  New York paid $313,574 after a scientist failed to disclose Chinese  support.\n\nIn December 2024, the University of Delaware paid $700,000 for not  disclosing that a faculty member receiving a NASA grant taught at…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689054/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers-providing-for-consideration-of-hr-defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}]