[{"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…Secretary of Defense, the  National Security Advisor, and the Vice President leaked war plans to a  journalist. This is the same administration that accidentally fired  nuclear scientists and engineers who maintain our nuclear stockpile.  This is the same administration that is illegally firing Federal  employees and dismantling Federal agencies, and they…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689053/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers-providing-for-consideration-of-hr-defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…U.S. industrial       partners to use these tools to deploy and modernize their       systems.\n\nMr. Speaker, our country cannot afford to lose the talent of civic- minded scientists like this.\n\nMoreover, if Donald Trump thinks that he is going to strike a deal  with Ukraine on rare earth minerals, then he is going to need real  experts in our government…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688240/fired-by-president-trump"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "Ms. KLOBUCHAR. Mr. President, I rise today with my colleagues in  strong opposition to the firings of scientists, medical researchers,  and more at the Department of Health and Human Services.\n\nHHS is in charge of everything from preventing disease outbreaks to  making sure that our…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688282/department-of-health-and-human-services"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…reduced toxic pollutants, strengthened fish  habitat, and built natural buffers that protect homes and businesses  from flooding and storm surge.\n\nThese partnerships unite scientists, local governments, Tribal  nations, fishers and anglers, farmers, and community leaders around a  shared plan, and those plans deliver results.\n\nIn Tillamook Bay in Oregon,…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698176/enhancing-science-treatment-and-upkeep-of-americas-resilient-and-important-estuarine-systems-act"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "…infrastructure and redtape. We  need to set up a system that can reliably get to a yes or a no on a  permit in 2 or 3 years, not 10, not 17.\n\nWe know that permitting reform can work. Scientists at the Pacific  Northwest National Laboratory estimate that by 2050, transmission  expansion could save $270 to $490 billion--billion with a ``b.'' And  for every dollar…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698581/permitting-reform"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…return on investment, this is astonishingly bad. For every $1  spent by American taxpayers at NCI, they get almost $3 back. Experts  warn that we will lose a generation of scientists because of this  recklessness.\n\nI urge the administration and my Republican colleagues to reverse  course, maintain our global leadership, and work toward a better future…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695758/restoration-of-funding-for-cancer-research"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…Orthodox churches that September 1st be celebrated as a  special day of prayer for the environment. In 1995 he started a series  of environmental conferences, inviting prominent scientists, political  leaders, theologians, ecologists, and journalists to embark on weeklong  trips to examine the destruction that pollution has caused on major  waters. Designed…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695407/welcoming-his-all-holiness-bartholomew-i-ecumenical-patriarch-of-constantinople"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…measles, chicken pox,  polio, or other diseases.\n\nVaccines are safe, effective, and our best defense against life- threatening diseases.\n\nI urge all Americans to trust our scientists, our doctors, and  decades of research. Get vaccinated to protect yourself, your families,  and our communities. We have the power to maintain a healthy society  and prevent…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695621/vaccines-protect-our-communities"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…the medical care, education, and support they need to thrive.  However, this vision will never be achieved by slashing the coverage of  children on Medicaid or firing NIH scientists who are responsible for  developing treatments and cures for rare diseases.\n\nThe plan to severely cut Medicaid and gut NIH funding is a serious  threat to the health and…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688713/cuts-to-medicare-and-medicaid"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…stop  wasting money on Star Wars, which was then rebranded as the SDI, the  Strategic Defense Initiative, and has now been rebranded Golden Dome.\n\nFor more than 45 years, scientists have been patiently explaining to  policymakers that this is never going to work. It is easy to overwhelm  with a trivial response to it.\n\nWe have spent over $200 billion…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694113/risk-of-conflict-with-nuclear-weapons"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…crucial  role in fostering innovation and driving small business growth. The  labs form partnerships with small businesses so that they can leverage  the expertise of DOE's scientists and also gain access to world-class  labs to test new products. They also foster networking opportunities  that enable small businesses to connect, collaborate, and expand…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687906/doe-and-sba-research-act"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…collaborated on selecting an award for continued industry  work on a space microreactor design that could provide a supply of  power for use on the Moon and beyond.\n\nJust last week, scientists posted new data from the Department of  Energy's ground-based Dark Energy Spectroscopic Instrument, providing  insights on the mysterious dark energy of the universe that…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688987/doe-and-nasa-interagency-research-coordination-act"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…in my State. They tell me the same story:  Graduate students from abroad are choosing to study in Europe or  Canada, even China. Postdocs are leaving. Even American-born scientists  are considering opportunities elsewhere because they can't count on  research funding, because they are tired of political attacks, because  they don't want to work in an…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700133/climate-change"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…science. That is as plain as day. You don't  follow the science by defunding it. You do not follow the science by  shutting it down. And you don't follow the science by firing  scientists. That is exactly how R.F.K., Jr., has been operating.\n\nAs I mentioned last week, we saw some of the most egregious examples  yet when he fired the CDC Director, all because…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694964/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…Reducing methane waste in the atmosphere saves consumers money. It  protects local communities from pollution; and methane, as you know, is  a superpotent greenhouse gas.\n\nScientists agree that reducing methane is one of the best things we  can do  to combat climate change. Its deleterious effects on the atmosphere are  many, many times greater even than…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688145/methane"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…of the United       States.\n\n(2) Consistent with section 6 of the Consumer Product       Safety Act (15 U.S.C. 2055), consult with the following:\n\n(A) Technologists, data scientists, and experts in       artificial intelligence and machine learning.\n\n(B) Cybersecurity experts.\n\n(C) Members of the retail industry.\n\n(D) Consumer product manufacturers.…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693414/consumer-safety-technology-act"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…transitions, such as middle       school to high school, high school to college, and school to       internships and jobs.\n\n(5) Input from education researchers and cognitive       scientists, as well as practitioners in research and       industry, so that what is being taught is up-to-date in terms       of content and pedagogy.\n\n(6) A communications strategy…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688976/mathematical-and-statistical-modeling-education-act"}, {"senator": "Jake Ellzey", "party": "Republican", "sentence": "…absolutely can.\n\nI challenge you to wonder if we would have won World War II with  those who provide hurdles for us instead of a smooth path.\n\nWhat troubles me is that a couple of scientists, working deep inside  the Pentagon in a couple of wings that, frankly, don't need to be used,  have the power to counter the operational assessments of several four- stars.…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693649/department-of-defense-appropriations-act-2026"}, {"senator": "Roger Marshall", "party": "Republican", "sentence": "…again, we have to  think about the equation as well as clean, but we also need to think  about affordable and reliable.\n\nI think the challenge for those of us who are actually scientists is  to go back and think about all the predictions that have never, never  come true from the climate alarmists. In 2013, Peter Wadhams said we  would be ice free by 2015.…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698992/unanimous-consent-request-s-res-550"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…pilot/recovery  supervisor at the National Center for Atmospheric Research. He was  located in Palestine, Texas at their Balloon facility, wherein,  alongside some of the world's top scientists and astrophysicists, he  contributed to invaluable scientific discoveries in the facilities  critical outer space work.\n\nDanny then moved to work at the ALCOA plant in Rockdale,…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696328/recognizing-danny-charles-masur-with-a-congressional-veteran-commendation"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…College in Logan.\n\nTop-tier research institutions Brigham Young University, the  University of Utah, and Utah State University are preparing the next  generation of engineers, scientists, and innovators who will take the  torch from us and continue driving humanity's exploration of space.\n\nWith these resources, the State's workforce is uniquely positioned…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687925/space-dominance"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…prioritizes critical research and advanced  manufacturing that bolster private sector innovation, strengthen  university-industry partnerships, and train the next generation of  scientists and engineers right here at home--investments that are  essential to our long-term economic growth, to our national  competitiveness, and to our national security.\n\nAt NOAA,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699098/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…US, are operated from my alma mater, Odegard Hall in Grand Forks.\n\nThe mission, known as ROADS, is about more than technology. It is  about inspiring the next generation of scientists, engineers, and  leaders in space.\n\nNorth Dakota has long led in agriculture, energy, defense, and  aviation.  Now, we are expanding that leadership into space.\n\nI am proud…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694937/recognizing-north-dakotas-space-contributions"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…defense, with unmatched  infrastructure and mission synergy. Our workforce brings together  military expertise, leading civilian aerospace professionals, and a  pipeline of scientists and engineers. This is not just about geography.  It is about capability, efficiency, and effectiveness.\n\nThis decision is not about partisan politics. It is about national…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695727/congratulating-lieutenant-general-robert-a-rasch-jr"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…responsibility?\n\nThey shut the government down, and the moment you call attention to  their own actions, all they do is obfuscate and start shrieking about  unrelated things.\n\nScientists should study this at length and try to come up with a  cure. It is a serious affliction, as was evidenced numerous times over  in our Rules Committee meeting.\n\nIt is well…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696692/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…children, it is a problem for the men.  I think men are frequently more likely to cause problems and be less  productive if they are not connected with a family, and social  scientists like George Gilder have pointed this out. One of the reasons  why I think we have a disproportionate number of men in prison, men  doing drugs is because they are not connected…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689133/educating-young-people"}, {"senator": "Jefferson Shreve", "party": "Republican", "sentence": "…again showcase their talents at  VEX World competition in Dallas later this year. These students  exemplify the best of the next generation of innovators, engineers, and  scientists. Their work underscores the importance of a STEM education.\n\nMany Hoosiers have celebrated victories on basketball courts, and I  am proud to take this opportunity to spotlight…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690023/congratulating-greenfield-central-high-school-for-winning-the-indiana-state-robotics-championship"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…settlement of Mars, an  achievement that will truly define this century.\n\nThese are not science fiction novels. These are active projects by  American companies, American scientists, and American engineers  bringing in the golden age of American spaceflight.\n\nIn conclusion, Mr. Speaker, the urgency of action is now. America's  leadership in space is…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687924/space-dominance"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…million  from Chinese entities. In return, the top-ranked high school in the  United States gave them all the techniques that we are using to teach  our students to be better scientists, to be better in the technology  field, to be better in mathematics, and to be able to compete better  with the United States. It doesn't make any sense.\n\nThat is why some…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697302/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…the House Agriculture Committee, I applaud this  effort. It is exactly the kind of hands-on, forward-thinking program we  need to develop the next generation of farmers, scientists, and  entrepreneurs.\n\nAgriculture puts food on our tables, clothes on our backs, and fuel  in our vehicles. Programs like this ensure it continues to do so for  generations…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692938/recognizing-st-marys-area-school-district"}]