[{"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…Excellence in Biomedical       Engineering: Aaryasinh Vaghela and Rishik Puli, Basis       Independence School\n\nCharles ``Chuck'' Smith Award for Excellence in Computer       Science and Mathematics: Eamon O'Leary, South Lakes High       School\n\nFounders Lifetime Achievement Award: Dr. Dennis Humphrey,       PhD\n\nOmega Man of the Year: Sanford Crenshaw…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697131/recognizing-omicron-kappa-kappa-chapter-of-omega-psi-phi-fraternity-inc-for-its-achievement-week-and-honorees"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…want to add trillions of dollars to the debt, and they sure as hell do  not want the wealthy to continue to get rich off the backs of the rest  of us.\n\nThis is not rocket science. They want a tax code that doesn't screw  us over. They want affordable rent and mortgages. They want lower  healthcare costs. They want to see us fighting for a better future…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693089/what-americans-want"}, {"senator": "Chellie Pingree", "party": "Democrat", "sentence": "…funding for programs important to combating  and adapting to climate change. It rejects House Republicans' effort to  gut funding for renewable energy and funds USGS climate science.\n\nFunding for the Environmental Protection Agency's environmental  justice, a top target for this administration, is included at $30  million. The continuation of these grants…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698754/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Raja Krishnamoorthi", "party": "Democrat", "sentence": "…urgency in protecting our planet.\n\nThis month, he is visiting the United States to receive the Templeton  Prize--the most prestigious award at the intersection of religion and  science. He joins a distinguished group of past recipients, including  Mother Teresa, the Dalai Lama, and Archbishop Desmond Tutu.\n\nAs the longest-serving Archbishop of Constantinople…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695395/welcoming-the-all-holiness-ecumenical-patriarch-bartholomew"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…business.\n\nSomething's wrong here. Farmers are hurting. They need leadership  that invests in their success, Mr. Speaker. Don't cut their rural water  infrastructure or weaken the science that our farmers depend upon.", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699499/a-plea-for-small-family-owned-farms"}, {"senator": "Julia Brownley", "party": "Democrat", "sentence": "…Mr. Chair, I urge my colleagues to vote ``no'' on this amendment to  ensure DOD can test, validate, or reject technology on the merits, not  because of shortsighted, anti-science ideology.\n\nMs. BROWNLEY. Mr. Chair, I would just say that, yes, I want to be  competitive with China's military and their readiness first and  foremost.\n\nSecond, our DOD officials…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695257/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…charge, upended  over three decades of precedent on hepatitis B vaccine recommendations  for babies.\n\nSecretary Kennedy's fascination with quackery has, once again, set  health, science, and medicine in America backward.\n\nThe new guidance says that only babies whose mothers test positive  for hepatitis B or whose status is unknown should receive the vaccine.…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697786/attack-on-childrens-health"}, {"senator": "Scott Peters", "party": "Democrat", "sentence": "…invest in the future. Unfortunately, this administration  seems committed to doing the exact opposite.\n\nFunding cuts to the National Institutes of Health and the National  Science Foundation have kneecapped the world-class research ecosystem  that has made America great in the 20th century.\n\nThe politicization of science hurts the health and well-being…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695749/funding-cuts-to-science"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…nut from Jane's kind       outstretched hand and gently squeezed to say:\n\n``You are welcome here among us, you may watch us, you may       learn.'' And upon this invitation, science took a mighty       turn. Through the years at Gombe watching, Jane recorded       every deed, How they shared their       food and groomed with care--compassion was their…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696844/the-ballad-of-jane-goodall"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…scientist, and a constituent of mine, who has witnessed the impacts of  President Trump and Elon Musk's recent firings. He wrote:\n\nThis week, 168 of my colleagues at the National Science       Foundation were fired in a mass meeting and then waited for       hours for an email with instructions before they were removed       from NSF systems.\n\nTwo in my division…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688192/fired-by-president-trump"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…PETERS. Mr. President, I was unable to attend votes on January  15, 2026. Had I been able to attend, I would have continued to vote in  favor of H.R. 6938, Commerce, Justice, Science; Energy and Water  Development; and Interior and Environment Appropriations on rollcall  vote No. 10.", "date": "2026-01-29", "source_url": "https://justfacts.votesmart.org/public-statement/1699426/vote-explanation"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…fibrosis,  and her son has benefited from cutting-edge NIH research and lifesaving  medication approved by the Federal Government.\n\nAs this administration is cutting the very science that saves lives,  Susan's fight gives me hope that we can all make our voices heard and  fight for change.\n\nDon't underestimate Susan, and don't underestimate the American…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688360/dont-underestimate-susan-perri"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…otherwise would have nowhere to turn.\n\nIt rejects efforts by the Trump administration to eviscerate  scientific research funding, providing $4.8 billion more for the  National Science Foundation than the White House proposed.\n\nThe agreement also rejects the Office of Management and Budget's  illegal efforts to undermine America's dominance in scientific…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698760/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…me as a Member of  Congress, who is the co-chair of the House Manufacturing Caucus and is  a ranking member on the Research and Technology Subcommittee for  the Committee on Science, Space, and Technology, to make some notes and  snapshots of what is taking place right now.\n\nIt is not to accept that we have a lot of actions going on right now  that are…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689752/reflecting-on-americas-history"}, {"senator": "Summer Lee", "party": "Democrat", "sentence": "…to Washington, D.C.\n\nThis week, His All-Holiness is visiting our Nation's Capital to  receive the Templeton Prize, the most prestigious international award  in religion and science. With this honor, he joins the ranks of Mother  Teresa, Archbishop Desmond Tutu, and the Dalai Lama. The recognition  reflects not only his scholarship and spiritual leadership…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695564/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…Authority............................................          26.245          87.321         277.233     Outlays.....................................................         -12.404        -128.025        -165.530 Commerce, Science, and Transportation     Budget Authority............................................          28.674         112.433         208.612     Outlays.....................................................…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691578/fiscal-year-2025-enforcement-filing"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…Mexia, Texas,  with a Congressional Veteran Commendation in recognition of his  outstanding service to both his country and his community.\n\nAfter receiving his Bachelor of Science in Education from Texas A&M  University, Lt. Col. Matthews served with distinction in the United  States Army for over 24 years. His military career included service in  over…", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696269/recognizing-lieutenant-colonel-william-bill-patterson-matthews-usa-retired-with-a-congressional-veteran-commendation"}, {"senator": "Jake Ellzey", "party": "Republican", "sentence": "…deployments aboard aircraft carriers like the  Carl Vinson, Ranger, and Enterprise.\n\nHe also graduated from Navy Fighter Weapons School Adversary Course  and earned a master of science degree in systems management from the  University of Southern California.\n\nMost famously he was selected as an extra for the movie ``Top Gun,''  which was filmed on site in…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691519/truth-telling-with-math-and-facts"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…of the Committee on Energy and Commerce, or  their respective designees, and provides for one motion to recommit.\n\nThird, the rule provides for H.R. 6938, Commerce, Justice, Science;  Energy and Water Development; and Interior and Environment  Appropriations Act, 2026. H.R. 6938 would be considered under a closed  rule, and it also provides 1 hour of…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698637/providing-for-consideration-of-hr-saving-homeowners-from-overregulation-with-exceptional-rinsing-act-providing-for-consideration-of-hr-affordable-housing-over-mandating-efficiency-standards-act-and-providing-for-consideration-of-hr-commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…meta-analysis find? TFA teachers have had  a consistent and significant impact on students' academic achievements.  On average, students of TFA teachers perform better in math, science,  and reading. Some studies have found that having a TFA teacher adds up  to 50 additional days of learning.\n\nBeyond that, by the way, many TFA alums go on to found schools.…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…generate jobs and       revenue for generations to come, were simply no longer       allowed to propose mining projects in the area and forbidden       to go through the law and science-based environmental review       process to prove they can meet the high standards in place       before earning permits to construct a mine.\n\nWe collectively support the…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699275/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…Extension  in Lancaster County.\n\nAcross nearly four decades, Leon Ressler has served Penn State  Extension, a Pennsylvania-wide educational organization and network  focusing on science, agriculture, and the environment, in many roles.  Leon's tenure with Penn State Extension began in 1988. Ultimately, he  became Lancaster County Extension Director in 2001.…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692202/congratulating-leon-ressler-on-his-retirement"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…Member, be and is       hereby, elected to the following standing committees of the       House of Representatives:\n\nCommittee on Homeland Security: Mr. Van Epps.\n\nCommittee on Science, Space, and Technology: Mr. Van Epps.\n\nThe resolution was agreed to.\n\nA motion to reconsider was laid on the table.", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697817/electing-a-member-to-certain-standing-committees-of-the-house-of-representatives"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…Management stop to consider the $46 million in lost revenue to  the State of Montana, money that helps pay for K-12 education.\n\nMake no mistake, this amendment was not a moderate, science-based  decision. This was the heavy hand of Big Government crushing an entire  industry in the name of a radical Green New Deal agenda. It was the  inevitable result of an…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694891/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…these omnibus bills, and  backroom deals that the American people never asked for.\n\nMr. Speaker, this bill proves that those days are coming to an end.  The Commerce, Justice, Science; Energy and Water Development; and  Interior and Environment Appropriations Act, 2026 is bipartisan,  bicameral, and built the right way--from the ground up, from  subcommittees…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698747/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…AND STATISTICAL MODELING EDUCATION.\n\n(a) Findings.--Congress finds the following:\n\n(1) The mathematics taught in schools, including       statistical problem solving and data science, is not keeping       pace with the rapidly evolving needs of the public and       private sector, resulting in a STEM skills shortage and       employers needing to expend…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688976/mathematical-and-statistical-modeling-education-act"}, {"senator": "Dan Newhouse", "party": "Republican", "sentence": "…National  Laboratory in Richland, Washington.\n\nSince 2015, Dr. Ashby's leadership at PNNL has driven scientific  excellence and innovation, advancing the lab as a world leader in  science, national security, and energy research and development.\n\nDr. Ashby believes our biggest challenges cannot be solved alone, and  his tenure reflected that belief. Having spent…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696092/congratulating-dr-steven-ashby-on-his-retirement"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…today to honor Emily Hale for her  service to the House Committee on Energy and Commerce.\n\nA Louisville, Kentucky native, Emily graduated with a Bachelors of  Arts in Political Science from the University of Kentucky in 2024.  During her time in college, Emily volunteered her time as a Court  Appointed Special Advocate in Lexington and served as an intern…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693661/recognizing-emily-hale"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…public on the website of the Department of Commerce and       submit to the Committee on Energy and Commerce of the House       of Representatives and the Committee on Commerce, Science,       and Transportation of the Senate a report that includes--\n\n(1) a description of the activities of the Secretary under       this Act during the preceding year;\n\n(2)…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692733/deploying-american-blockchains-act-of-2025"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…Reporting.--Not later than 120 days after the date of       the enactment of this subsection and at least quarterly       thereafter, the Secretary shall submit to the Committee on       Science, Space, and Technology and Committee on       Appropriations of the House of Representatives and the       Committee on Energy and Natural Resources and the Committee…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688929/cost-share-accountability-act-of-2025"}]