[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…to environmental causes, for which he has earned the  nickname of the ``Green Patriarch.'' The foundation said his  environmental ministry is ``harnessing the power of the sciences to  expand our collective understanding of humankind's place and purpose in  the world'' and that ``Bartholomew has also deepened Christians' ideas  of what it means to be…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695345/welcoming-ecumenical-patriarch-bartholomew"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…bill advances out of Committee. We       encourage Congress to pursue avenues such as conducting       hearings or requesting a study from the National Academies of       Sciences, Engineering, and Medicine to provide clear guidance       around the use of force against youth. We are happy to meet       any time with your offices on this issue.…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700034/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…for Health.\n\nWhile much of my remarks will be dedicated toward our hard-nosed  scientific research funding, I do want to make mention of what it means  to have our health sciences under attack right now as well because  doctors and researchers, particularly in the medical fields, are  feeling extraordinary pain.\n\nThese aren't just talking points. This…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691394/stop-trumps-chaos-stand-up-for-science"}, {"senator": "André Carson", "party": "Democrat", "sentence": "…to introduce my resolution  recognizing National Caribbean American Heritage Month. Caribbean  Americans have enriched our nation through their contributions in the  arts, sciences, education, business, sports, military, and government.\n\nSince before our nation's founding, millions have emigrated from the  Caribbean to the United States. Today, more…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693058/introduction-of-resolution-recognizing-the-significance-of-national-caribbean-american-heritage-month"}, {"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "Mr. Speaker, I rise to express my support for H.R. 530, the ACES Act,  as amended, a bill that would task the National Academies of Sciences,  Engineering, and Medicine with studying the frequency and mortality of  cancer among individuals who served as air crew in the Armed Forces.\n\nI can't help but think of some…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690651/aces-act"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…Established in 1972, the  Templeton Prize honors individuals whose exemplary achievements advance  Sir John Templeton's philanthropic vision: harnessing the power of the  sciences to explore the deepest questions of the universe and  humankind's place and purpose within it. At this year's ceremony, His  All-Holiness will be honored for ``pioneering…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695407/welcoming-his-all-holiness-bartholomew-i-ecumenical-patriarch-of-constantinople"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…from my district has been dismayed that the President plans  to cut the NASA budget by 24 percent. This will end educational  programs that get students excited about the sciences. Do we want to go  to Mars? Who is going to take us there? It is going to need the  ingenuity and expertise of the American people.\n\nThe cuts are not just limited to NASA…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691395/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…Templeton Prize, given to singular champions of human  dignity and progress such as Mother Teresa and Archbishop Desmond Tutu,  honors people who have harnessed the power of the sciences to explore  the deepest questions of the universe and humankind's place and purpose  within it. His All-Holiness Bartholomew has earned this storied honor  through the same…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695566/welcoming-his-all-holiness-bartholomew-i-of-constantinople-to-the-united-states"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…one that  Andy Kim exemplifies.  He is the first Korean American to serve in this body at a time that  Korean Americans have made contributions--from the academics, to the  sciences, innovators, businesspeople, farmers. But this is the first  time the United States of America has seen a Korean American, the son  of immigrants, stand in this body. I will…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697705/9999"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…the savings that DOGE cuts had made to our budget.\n\nThey have also made the Federal Government much more bureaucratic and  less efficient. I have a lot of burgeoning life sciences industry in my  district, lots of companies doing medical devices and innovative drugs.  They have all reported to me that they are deeply concerned about the  massive cuts…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692038/consequences-of-doge"}, {"senator": "Scott Peters", "party": "Democrat", "sentence": "…administration's agenda for public health, national security, and  global competitiveness, and they asked that I tell you some of their  stories.\n\nOne researcher studies ocean and Earth sciences at San Diego's  prestigious Scripps Institution of Oceanography. Her research focuses  on addressing the threats that toxic algal blooms pose to public  health, fisheries,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695749/funding-cuts-to-science"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…are represented                                   below\n\nAtul Gawande, former Assistant Administrator for Global       Health, USAID\n\nDan Schwarz, Vice President, Management Sciences for Health\n\nNicolas Enrich, former Acting Assistant Administrator for       Global Health, USAID           usaid programs are cost-effectiveness and accountability\n\n``I led…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691139/us-global-health-programs"}, {"senator": "Scott Peters", "party": "Democrat", "sentence": "…infectious diseases.\n\nIn recognition of Dr. Crotty's enduring contributions to research on  the immune system, he was recently elected to the American Academy of  Arts and Sciences. This honor is a testimony to the value of his  scientific contributions and to the curiosity, integrity, and  commitment to public service that define his work.\n\nAt a time…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690713/recognizing-scripps-vice-chancellor-margaret-leinen"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…practical learning, research, and community  engagement has produced graduates who serve as leaders across  engineering, agriculture, business, education, public service and the  sciences.\n\nI commend Cal Poly San Luis Obispo for its enduring impact on the  Central Coast and the State of California, and for its continued  dedication to student success and service…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699776/recognizing-the-california-polytechnic-state-university-san-luis-obispo"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "…our K-12 students. Indeed, when I  taught chemistry, I saw firsthand how my students struggled because  they lacked the basic foundations in math that are necessary for the  sciences. Today, I hear from both our generals and our CEOs about what  these gaps mean for our country. It doesn't just hurt our economy. It  hurts our national security, as well.…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688979/mathematical-and-statistical-modeling-education-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…alumna of the University of Georgia--Go Dogs--she has received  several accolades, including the Outstanding Alumnus Award from the  College of Agricultural and Environmental Sciences and recognition as  the 2025 Milken Educator of the Year.\n\nMr. Speaker, I congratulate Rachel on her well-deserved recognition  as Georgia Teacher of the Year.", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692403/recognizing-rachel-kinsaul"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "Mr. BOST. Mr. Speaker, I move to suspend the rules and pass the bill  (S. 201) to provide for a study by the National Academies of Sciences,  Engineering, and Medicine on the prevalence and mortality of cancer  among individuals who served as active duty aircrew in the Armed  Forces, and for other purposes.\n\nThe…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693894/aces-act-of-2025"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…and by Senators Kelly and Cotton in the  Senate, is critically necessary.\n\nThe ACES Act directs the Department of Veterans Affairs to partner  with the National Academies of Sciences, Engineering, and Medicine to  conduct a comprehensive study on the prevalence and causes of cancer  among military aviators. We need to know the why, and we need to  provide…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693896/aces-act-of-2025"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…from the Michigan  Association of Broadcasting. Sheri is also a proud member of the Silver  Circle of the Michigan chapter of the National Academy of Television  Arts and Sciences--an honor reserved for those who have devoted a  quarter-century or more to broadcast excellence.\n\nBut Sheri's impact goes far beyond the newsroom. She's been a  tireless…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690456/recognizing-sheri-jones"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Patterson\n\nMr. HILL of Arkansas. Mr. Speaker, I rise today to recognize the  leadership of Dr. Cam Patterson, our former chancellor of the  University of Arkansas for Medical Sciences.\n\nLast year, Dr. Patterson announced his decision to step down from his  leadership position after 7 years of focused, dedicated service to the  university, the medical school,…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698914/warmth-of-collectivism"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…for  yielding.\n\nMr. Speaker, I rise today in support of my bill, H.R. 1455, the ITS  Codification Act.\n\nThis legislation would codify the Institute for Telecommunication  Sciences, ITS, which plays a critical role in making spectrum available  for commercial use.\n\nAs we examine how Federal and commercial spectrum is allocated, it is  our job as Members…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693438/institute-for-telecommunication-sciences-codification-act"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "Mr. BERGMAN. Mr. Speaker, I move to suspend the rules and pass the  bill (H.R. 530) to provide for a study by the National Academies of  Sciences, Engineering, and Medicine on the prevalence and mortality of  cancer among individuals who served as Active Duty aircrew in the Armed  Forces, and for other purposes, as…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690650/aces-act"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "Mr. LATTA. Mr. Speaker, I move to suspend the rules and pass the bill  (H.R. 1455) to codify the Institute for Telecommunication Sciences and  to direct the Assistant Secretary of Commerce for Communications and  Information to establish an initiative to support the development of  emergency communication and…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693439/institute-for-telecommunication-sciences-codification-act"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…Agency.\n\nAndy grew up in Knoxville and graduated from my alma mater, Bearden  High School. He attended the University of Tennessee and earned a  degree in fisheries and wildlife sciences. He began his career in  Hawkins County before moving south to Loudon County. His  responsibilities eventually expanded to include 11 counties in east  Tennessee, covering…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700233/congratulating-andy-collins-on-his-retirement"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…the manner in which each such       agreement is advancing scientific research and applications,       including priorities recommended by the National Academies of       Sciences, Engineering, and Medicine decadal surveys.\n\n``(4) Information specifying whether the Administrator has       entered into an agreement with a commercial vendor or a…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700115/accessing-satellite-capabilities-to-enable-new-discoveries-act"}, {"senator": "Brad Finstad", "party": "Republican", "sentence": "…my former professors at the University of Minnesota, who is stepping  down after 13 years of serving as the dean of the College of Food,  Agricultural and Natural Resource Sciences and the director of the  Minnesota Agriculture Experiment Station.\n\nAs our State's premier institution for agricultural education, the U  of M has a longstanding reputation…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699023/recognizing-brian-buhr"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…Republicans are taking action. Our Nation's most innovative  breakthroughs have been developed at U.S. universities, while  conducting vital research related to defense, energy sciences, and  other sensitive industries. Many colleges and universities have  accepted CCP funding, hoping to simply expand their foreign language  learning. They have, unfortunately,…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690825/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Jim Baird", "party": "Republican", "sentence": "…Foundation are  vehicles for some of our nation's cutting-edge scientific research.  Combined, these agencies tackle the modern challenges of physics,  quantum information sciences, Artificial Intelligence, and beyond.  However, there is no clear directive for these organizations to work  together.\n\nThis LegisLation explicitly directs the Secretary of…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688988/doe-and-nsf-interagency-research-act"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…of the National Science       Foundation (in this section referred to as the ``Director'')       shall seek to enter into an agreement with the National       Academies of Sciences, Engineering and Medicine (in this       section referred to as ``NASEM'') (or if NASEM declines to       enter into such an agreement, another appropriate entity)       under…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688976/mathematical-and-statistical-modeling-education-act"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…dark       matter, in accordance with section 305 of the Department of       Energy Research and Innovation Act (42 U.S.C. 18643).\n\n(D) Fundamental earth and environmental sciences, in       accordance with section 306 of the Department of Energy       Research and Innovation Act (42 U.S.C. 18644) and section       60501 of title 51, United States Code.…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688985/doe-and-nasa-interagency-research-coordination-act"}]