[{"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…officer training was completed, all 16 passed their exams.  With some claiming that the group must have cheated, the group was  forced to retake certain exams, and the group scored even higher. The  average grade for the group was 3.89 out of 4.0, the highest average of  any class in Navy history at that time.\n\nEven though all 16 men passed their exams,…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699496/introduction-of-the-golden-thirteen-congressional-gold-medal-act"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…Coaches Association.\n\nReese has been described as an aggressive and ferocious player and is  heralded as the most prolific goal scorer in the Akron area.\n\nThis season, Reese scored an impressive 44 goals and 15 assists,  leading the Hoban Knights to the State semifinals.\n\nThis is Reese's fourth year on the varsity team, and over her  impressive soccer…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697073/champion-of-the-week-reese-gallagher"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…Reduction Fund  language. Two pieces of evidence support my contention here.\n\nFirst, when this provision came up through the Environment and Public  Works Committee, it was ``scored'' by the Congressional Budget Office.  That means the Congressional Budget Office provided an estimate of the  funds saved by rescinding unobligated funds. The CBO score for…", "date": "2025-07-09", "source_url": "https://justfacts.votesmart.org/public-statement/1693322/greenhouse-gas-reduction-fund"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…graders reading below the basic level on the  National Assessment of Educational Progress was the largest in the  assessment's history, and the percentage of fourth graders who scored  below the basic level was the largest in 20 years.\n\nAdults are not doing any better. Recent results of the Program for  the International Assessment of Adult Competencies…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688311/nomination-of-linda-mcmahon"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…school's team that  could come close to 12 national titles.\n\nThey were led by Paige Bueckers who is going to be one of the greats  in the history of college basketball. She scored 17 points and had  numerous rebounds, steals, and blocks. She has had every award  imaginable for a college basketball player: ESPY Award, John R. Wooden  Award, and Naismith…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689671/congratulating-uconn-womens-basketball-stars"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…Again, Democratic Chair Whitehouse and Republican Chair Arrington used  the section 312 authority in a bipartisan manner to instruct CBO to  conform to the way it originally scored the program.\n\nOn a bipartisan basis during the fiscal years 2023-2025  appropriations cycles, Budget chairs have directed CBO to score  appropriations language related to the…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693857/hr-1"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…have to tell the truth.\n\nThis is written by Jessica Riedl in 2023. What was done is, they took  all these tax proposals that the Democrats have proposed, the ones we  have scored, and then did the economic modeling.\n\nLet's raise the capital gains tax on rich people. We will take  wealthy people and we will raise their marginal income tax. We will  raise…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692327/math-always-wins"}, {"senator": "Michael Rulli", "party": "Republican", "sentence": "…15th overall selection. Following his  tenure with the Rangers, J.T. was traded to the Tampa Bay Lightning.  After Tampa Bay, he was traded to the Vancouver Canucks, where he  scored over 150 goals in six seasons with the team, and his stellar  play earned him an alternate captainship. In 2024, J.T. was selected to  play in the NHL All-Star Game and went…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699838/congratulating-jt-miller-on-his-selection-to-the-team-usa-hockey-roster-for-the-2026-winter-olympics"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…semifinal.\n\nThis historic run was powered by standout performances. Jackson Jones  led with 37 goals and 47 assists. Holden Custer added 45 goals and 21  assists. Parker Dallas scored 42 goals with 36 assists. Jackson  Wininger contributed 24 goals and 26 assists.\n\nOn defense, Ronnie Frith, Brayden Hall, and Carson Garland combined  for over 120 takeaways…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693527/congratulating-central-high-school-womens-softball-team"}, {"senator": "Tom Kean, Jr.", "party": "Republican", "sentence": "…selected for the Branchburg Recreation Spring 2025 All- Star Team. Sadie led her travel team to the Parkway League Spring  Division Championship and was team leader in runs scored and RBI's,  carrying an impressive .521 batting average and .662 on-base percentage  this past spring.\n\nOff the field, Sadie is a two-time Hunterdon Art Museum Young Artist…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695064/recognizing-sadie-pirez-chevrolet-play-ball-player-of-the-month"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…receipts for the  economy.\n\nI look forward to the Democrats actually proposing this and being  willing to vote on it. That is because they throw these things out and  get them scored. They controlled everything here 1 year ago, a couple  of years ago. You notice they never did them, Mr. Speaker. They pretend  this solves the problem.\n\nYou get 1.5 percent,…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690586/economic-anxiety"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…what is coming  at us.\n\nMr. Speaker, I am trying to make the point again. Our legislation,  which we call Better Medicare, has been introduced. It is in the  process of being scored. Yet, when you start to see these sorts of  dollars--and, yes, it would change the current spending projection by  about 10 percent to 10.7 percent according to the Joint Economic…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691518/truth-telling-with-math-and-facts"}, {"senator": "John Thune", "party": "Republican", "sentence": "…their coverage there.\n\nThat is just flat staggering. Look at that. So we are looking at  2024, 2025 now--$150 billion a year over a 10-year period. As I said,  it ends up being scored by the CBO as $1.3 trillion.\n\nBut here is what happened. The spending went up dramatically when the  very issue that we are talking about here today, which is these Biden…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697879/healthcare"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…captured their second  consecutive State title, an incredible accomplishment that reflects  their hard work, talent, and dedication.\n\nWith a squad of just 11 boys, Glenvar scored an impressive 280  points, outpacing second-place Radford High by 75 points. Of the 11  swimming events contested, the Highlanders won 5 and were runners-up in  2 others.…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689724/congratulating-glenvar-high-school-boys-swim-team"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…right. We  had a bill we passed through this House just a few months ago in the  working families tax credit.\n\nPart of that bill was called the cost share reduction. It was scored  by the CBO to lower premiums for families by over 12 percent. What  happened? By the way, every Democrat voted against that, too, because  they have never cared about lowering…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696745/continuing-appropriations-and-extensions-act-2026"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…U.S. Marshals Service, are       not revenue for the federal government because they are also       an expense. The reforms advanced by H.R. 4242 have previously       been scored as having a de minimis effect on federal revenue.\n\nModernizing policy for less-lethal capabilities has the       backing of a wide range of respected organizations       representing…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700037/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…having this world where there is the risk scoring and--if  you see, there are actually now criminal investigations going on at the  Department of Justice because of people being scored as being much  sicker, needing much more, and they are actually not sick. There are  multiple criminal investigations going on at the Department of Justice.\n\nI keep approaching…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699988/math-is-such-an-anathema"}, {"senator": "Harriet Hageman", "party": "Republican", "sentence": "…and determination, working his way up the  roster to become a key piece of the Denver Broncos' offensive line.\n\nFrank's dedication and commitment paid off this weekend, as he scored  an iconic touchdown that was key in the Broncos' 33-30 victory.\n\nPlease join me in recognizing and celebrating the hard work and  successes of Wyoming's Frank Crum.", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699338/congratulating-frank-crum"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…perseverance, heart, and teamwork that defines Iowa athletes.\n\nLed by senior Dru Dorsey and freshman Ruby Stevens, the Knights  showed skill, leadership, and grit on the field. Dorsey scored one goal  and assisted on the other, setting the tone and sealing the win. From  defense to offense, the entire squad played with unity and  determination.\n\nThis moment is…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692297/recognizing-davenport-assumption-girls-soccer-team"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…does an  aggregation of a lot of studies, many of them from leftwing groups,  showing that if you raised every tax that functionally the Dems have  offered that has gotten scored, and then you adjust it for its economic  effects, you get about a 1.5 percent of GDP in taxes, additional taxes.\n\nThe cuts we had been talking about were now actually getting…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688651/a-real-math-problem"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…left will  say: No, Republicans need to tax people more. Okay. Yet, we have shown  the studies over and over that every Democratic tax that has actually  been proposed and scored produces about 1.5 percent of GDP. The cuts we  have talked about are about 1 percent of GDP. You have a big 2.5  percent there if we both did everything.\n\nMr. Speaker, we…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689614/its-the-math"}]