[{"senator": "Mike Quigley", "party": "Democrat", "sentence": "…1942, Donald W. Lang, Sr., enlisted in the Army with dreams of  becoming a pilot. Like many men at the time, Donald felt it was his  duty to serve his country, but despite scoring well on the aptitude  test, he, like many other qualified Black men, was forced to wait while  White pilots were fast-tracked for training.\n\nBy the time he was accepted for…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693640/the-story-of-brad-and-donald-lang-sr"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…Cardinals won their first State title, capping off the  season with a 23-5 record.\n\nThe championship game itself came down to the wire. With two outs and  the tying run in scoring position, the Cardinals recorded the final out  and sealed the win.\n\nI congratulate Gainesville High School on its historic championship- winning season and on all the hard…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692900/congratulating-virginias-10th-district-congressional-award-medalists"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…black-and-white television set in his prison cell.\n\nYou don't have to be a genius to know that this bill is an attack on  working families. That is why the AFL-CIO says no, and they are scoring  it.\n\nThey call it stablecoin. It is not stable. It is not a coin. It is a  money market account that, under this law, must pay zero percent  interest. Who wants to forgo…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693831/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…The average team size  is 21 students, but the Sprague team had only two. Impressively, the  Lincoln team was mostly sophomores, but they all worked hard and it  showed. A scoring anomaly resulted in both the Sprague and Lincoln  teams earning the title of cochampions for the first time in the  competition's history.\n\nMr. Speaker, I thank the Center…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691209/supporting-the-womens-bureau-at-the-department-of-labor"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…how it applies and is  adjudicated--a formal litigation where the Parliamentarian's office  issues guidance based on written and oral arguments and nonpartisan  current law scoring estimates.\n\nIt is not normal budget enforcement. Why is that? Because  reconciliation is a fast track process, and Senators, with eyes wide  open, voted to impose these strict…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693857/hr-1"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…additional subgrantee selection round, which       requires Eligible Entities to rescind all provisional       subaward selections. The Policy Notice also revises the       scoring rubric that Eligible Entities are to use to evaluate       subgrantee applications, placing particular emphasis ``on       minimizing the cost of deployment under the BEAD…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698437/us-government-accountability-office-opinion-letter"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…fabulous  woman is A'ja Wilson, who was named Time's 2025 Athlete of the Year.\n\nA'ja became the first player in either the WNBA or the NBA to win a  championship, claim the scoring title, and be named Finals MVP, league  MVP, and Defensive Player of the Year all in one season.\n\nA'ja's impact was pivotal as the Las Vegas Aces won a record 16  straight…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698087/aja-wilson-named-times-2025-athlete-of-the-year"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…offering it because in the absence of the other amendments, it is  really not useful.\n\nThis bill is an attack on working families, which is why the AFL-CIO  says no, and they are scoring it.\n\nThis bill prohibits Congress Members from sponsoring cryptocurrencies  because of the obvious corruption and conflict of interest, but it  allows the President to create…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693774/digital-asset-market-clarity-act-of-2025"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…bullet. I know that being silent wouldn't stop a bullet. I  know being complicit won't stop a bullet. I know pointing fingers won't  stop a bullet. I know running from the scoring of the NRA won't stop a  bullet.\n\nI know what can stop a bullet. It is men and women in this body  standing up together and saying that enough is enough. That is because…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691752/national-gun-violence-awareness-month"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…more deficits while pretending we are not.\n\nMy Republican colleagues initially said: Do you know what? We will  just put a clause into the budget resolution. It is called a scoring  rule, and that scoring rule will simply say that we are going to say  this costs nothing, that there is no additional debt.\n\nA scoring rule has been used in the past. OK,…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689508/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…of crypto.\n\nMs. WATERS. Mr. Speaker, I include in the Record the following  letters from organizations that oppose this terrible bill: a letter  from the AFL-CIO, which is scoring this vote, and a letter from Public  Citizen.                                                           AFL-CIO,                                               Legislative…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693839/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…now they are ready to impose an incredibly complicated, mandatory, and  invasive new compliance regime without offering any new resources to  support it.\n\nThis bill is about scoring political points at the expense of  immigrant entrepreneurs. It sends a message that some people, no matter  how hard they work or how closely they follow the rules, do not…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692125/american-entrepreneurs-first-act-of-2025"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…results of the Program for  the International Assessment of Adult Competencies show that overall  scores in literacy and numeracy have decreased for U.S. adults, with  adults scoring at the lowest level of proficiency in literacy,  increasing from 19 percent in 2017 to 28 percent in 2023.\n\nThis is a crisis. Eliminating the Department of Education does…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688311/nomination-of-linda-mcmahon"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…Carolina State  University alumnus to congratulate its football team on their new  title, the 2025 HBCU national champions. The Bulldogs erased a 21-point  half-time deficit, scoring three touchdowns in the third quarter to win  the Cricket Celebration Bowl in a four-overtime thriller over Prairie  View A&M University. I offer my not-so-sincere apologies…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699194/south-carolina-state-university-football-team-2025-hbcu-national-champions"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…stayed silent for year after year after year under Joe Biden.\n\nIt is impossible. Mr. Speaker, it is impossible to see that as  genuine. What I see is a group more focused on scoring political points  and drama than protecting abused children.\n\nMr. Speaker, the record is clear. Under Republicans, far more  information has been released in the last 6 months…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696818/epstein-files-transparency-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…policy, how we deliver  healthcare. Maybe things like Medicare Advantage and these things  should be rewarded for making their populations healthier instead of  running around scoring them as sicker. There are solutions here.\n\nWe have known this chart for decades, that this is coming. Why the  hell can't this place have an honest conversation? ``Oh, David,…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688651/a-real-math-problem"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…Head Coach Kyle Symons and Assistant Coaches  Joe DiVello, Brian Scott, Alan Kroh, Jon DiVello, and Josiah Huston,  Skyline's 13 wrestlers delivered a historic performance, scoring 218  points and sending six athletes to the finals.\n\nCongratulations to individual State champions Paden Alyea, Parker  Withers, and Josiah Sykes. In addition to the State…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691284/congratulating-salem-high-school"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…HIV, except the problem is  this person didn't have that. They had never been tested for it.  However, the insurance company was getting a bonus for that. It is  called risk scoring.\n\nWe are going to have to consider moving to a model that says we are  not going to let you go and score people differently. We want to create  a model where it is put in…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1699000/growing-the-gdp"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "…impressive season, they finished 16-1.\n\nFreshman quarterback Isla Collins, who is a youth national team  player for the United States, led her team with two rushing touchdowns,  scoring her first at the end of the first quarter and adding her second  touchdown in the middle of the fourth quarter. Additionally, junior  Andie Tkalcevic added a 21-yard field…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697431/congratulating-salpointe-catholic-high-schools-girls-flag-football-team"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…are in their retirement years earning their  healthcare benefits, helping them be healthier? They get rewarded by  having their population be healthier, not by running around scoring  with sicker. Yay, everyone wins.\n\nWhat would happen with that several hundred billion dollars over a  decade? That is not a cut. It is actually lining up incentives.  Instead,…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689381/us-borrows-billion-a-day"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…her patience at the plate.\n\nSerenity Burnshire and Carsyn Burton added crucial doubles, and  Vanessa Gordon's sacrifice fly RBI in the bottom of the fifth created  another scoring play.\n\nWhile in the circle, Lexi Burkholder and Liz Bilbow combined for a  stellar performance, supported by the steady glove of Emily Finks  behind the plate. Together, they…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693527/congratulating-central-high-school-womens-softball-team"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…issue from the insurance companies managing it. Make it so the  incentive is to help our brothers and sisters be healthier instead of  making billions and billions of dollars scoring people as sicker. Read  the articles.\n\nTurns out, I think this bill the Democrats would like, the  Republicans would like, and people who do math will really like.  Talent-based…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691811/actual-solutions"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "Mr. SCHWEIKERT. Mr. Speaker, we are having a really exciting  discussion with my buddy of how CBO actually does scoring on things. I  was trying to explain that some of the things we consider absurd are  actually our fault because it is the law that we have passed to tell  CBO how to do the…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693062/stop-bathing-in-folklore-and-start-bathing-in-math"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…States, they earned first  place with unmatched precision, speed, and teamwork, setting a record  time of 8 minutes and 33 seconds while producing four near-perfect  pizzas, each scoring an impressive 9.9 out of 10.\n\nBehind this victory are three standout individuals: Nicole Brock, a  25-year veteran and general manager in American Fork; Benny Loughton,  her…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690075/recognizing-utah-global-pizza-champions"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…looking at charts and data and trying to say: Hey, we want  to protect Medicare Advantage. That is what seniors have chosen. They  like it. Can we actually get rid of the risk scoring and some of the  games being played with the star ratings, where they are milking the  system, because think of that?\n\nMedPAC reports basically say that there is almost $2…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699257/debt-deficits-and-demographics"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…truly historic. Their season win total is now tied for  the third highest ever. Shai Gilgeous-Alexander hit a rare superfecta:  Regular season MVP, Finals MVP, NBA champion and scoring champion.\n\nThis season is the culmination of the vision of Clay Bennett and the  entire ownership team, the team's General Manager Sam Presti, and of  course Coach Daigneault.…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692772/congratulating-the-oklahoma-city-thunder"}, {"senator": "Craig Goldman", "party": "Republican", "sentence": "…an impressive 12-2 season. Freshman Paige Zavaleta and senior Alli  Zavaleta each recorded two goals in the championship match, while  senior Charlotte Goldman opened the scoring and senior Audrey Deem  added the final goal. Goldman, along with seniors Sydney Fewins, Isabel  Gonzalez, and Brown University signee Claire McKnight, were members of  all…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700251/congratulating-the-trinity-valley-girls-soccer-team-on-their-fourth-consecutive-3a-state-championship"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…behind this microphone  for a decade. I will try to go fast enough to touch on it.\n\nI did this board the other day. I just need to show you this is what  they call an economic scoring of the enhanced premium tax credits,  which is basically the subsidies on top of the subsidies.\n\nFunctionally, only 38 percent of that $40 billion is actually going  to cover…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697873/turning-healthcare-into-financial-engineering"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…past 8 years and their third straight championship. This  championship capped a phenomenal season where they finished with a  record of 12-1 and boasted one of the highest scoring offenses in the  Nation. Their success reflects the leadership of head coach Eric Kjar,  who instilled in these men values of dedication, perseverance, and hard  work.\n\nI…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697704/congratulating-corner-canyon-and-lone-peak-high-school-football-teams"}]