[{"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…education inspires creativity, which is important for economic  growth and innovation.\n\nImportantly, the arts help heal, and students and our Nation need  healing.\n\nFirst, scores of studies over several years show that students do  better in all subjects when they have arts education. Unfortunately,  arts education is often seen as an extra, or it is…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695492/national-arts-in-education-week-2025"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…Representatives. That was  Congress just doing its job.\n\nIf a noncontroversial, bipartisan, good bill like this can be taken  hostage and become a weapon for settling political scores, well, it may  not be in your State, it may not be in your district, but that could  happen and will happen to any of us.\n\nMr. Speaker, this may seem like a little water infrastructure…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698699/finish-the-arkansas-valley-conduit-act-veto-message-from-the-president-of-the-united-states"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…states in       providing community-based services for mental health       conditions and substance use disorders.\n\nAdditionally, the proposed HHS budget would eliminate       scores of mental health programs, including some that your       committee explicitly established in the landmark Substance       Use-Disorder Prevention that Promotes Opioid Recovery…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692341/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…buying power. Yet, we are focused  today on a regulatory budget that is unworkable.\n\nThe bill has no exceptions for national emergencies. Let's look back  to 2020. SBA issued scores of rules to provide relief to help small  businesses during the pandemic, so the author of the bill is incorrect  when she claimed that SBA didn't issue regulations to make…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697332/small-business-regulatory-reduction-act-of-2025"}, {"senator": "Dina Titus", "party": "Democrat", "sentence": "…2,000 homes were sacked and  plundered, 38 churches were burned to the ground and 35 more  desecrated, and 52 schools were destroyed. More than a dozen people  were killed and scores were injured during the riots, beginning a cycle  of violence and intimidation that has seen Istanbul's Greek population  reduced from 200,000 when the riots erupted to less…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695407/welcoming-his-all-holiness-bartholomew-i-ecumenical-patriarch-of-constantinople"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…Teachers who share similar backgrounds and experiences  with their students foster stronger student-teacher relationships,  improved academic outcomes including higher test scores, rates of high  school graduation and college enrollment, more inclusive school  climates, fewer suspensions, and lower rates of chronic absenteeism.\n\nEducators Rising has…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688150/recognizing-the-10th-anniversary-of-phi-delta-kappa-internationals-educators-rising"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…American innovation.\n\nLet's be honest about what's going on here. Elon Musk and the so- called Department of Government Efficiency are using the Federal  Government to settle scores: cancer trials, nonessential; national  science databases, too expensive. That is not policy. It is a crusade  against expertise.\n\nLast month, I sat down with five undergraduate…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691392/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…this could have been done but  said that the President wanted to send a message by killing all of  those on board.\n\nWe all agree that the scourge of drugs is real and that scores of  Americans die from such poison every year. We are all committed on both  sides of the aisle to battling the importation of illegal drugs, even  as we work to beat back…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696120/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…without a salary that reflects the work  they do, our teachers in Virginia have made sure that Virginia schools  consistently rank high in the country for K-12 performance, test  scores, and even safety. Over 92 percent of our students here in  Virginia graduate high school in 4 years, and we have amazing teachers  to thank for that.\n\nWe need to make sure…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690753/national-teacher-appreciation-day"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…of  the committee would recognize that this will mean that they will have  to stop taking the appropriations away from the Social Security  Administration. We have shut down scores of offices. Many people have  been fired, and that data and AI will not resolve the issue of having a  single point of contact or a person to deal with.\n\nMr. Speaker, I urge…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697187/improving-social-securitys-service-to-victims-of-identity-theft-act"}, {"senator": "Jahana Hayes", "party": "Democrat", "sentence": "…they needed us to do 20 years ago. There are so many  funding gaps and so many services that students still don't receive.\n\nI hear people talk over and over about the NAEP scores and how  students are not at proficiency or where they need to be. I would  encourage you to disaggregate those scores and look at the lack of  funding over the years, look…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689644/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…increased authorization line that has no score but  then bring a bill to the floor that could have a mandatory score.\n\nIt is the majority's responsibility to request and obtain CBO scores  for bills they are planning to move. The Republicans are changing the  rules as they please. I am, of course, concerned about this from a  process perspective, and I encourage…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692716/charlotte-woodward-organ-transplant-discrimination-prevention-act"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…The lives  of average Americans everywhere are getting much worse.\n\nPrices are skyrocketing. Homes are unaffordable. Consumer debt is  surging. Unemployment is rising. Credit scores are plummeting. Family  farms are going under. Gun violence continues to devastate our schools  and our towns.\n\nWhile Americans struggle, Donald Trump and his family are cashing…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695733/why-i-came-to-congress"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "…Americans, uncaring about the futures of our veterans and our seniors,  unmoved by the plight of the underprivileged, obsessed with attacking  our civil servants and settling scores, unable to make good on the  promises that they laid out when they took control, and they don't seem  to care.\n\nBut Marylanders care; the American people care, and we are tired…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690300/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-for-appliance-standards-certification-requirements-labeling-requirements-and-enforcement-provisions-for-certain-consumer-products-and-commercial-equipment"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…said A+++++, but the American people are giving him an F.  What crackpot economics did Donald Trump study? An A with five pluses?\n\nWell, in that case, let's look at the test scores. Over the last  year, the price of beef has gone up at the grocery store by 20 percent.  That is an F. Today, Americans pay 40 percent more for a single cup of  coffee on their…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697816/affordability"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…on in the hearts of those whom he had an impact on.\n\nBilly will be missed by his sister, Robin; his children, Skylar,  Caitlin, and Emery; three beautiful grandchildren; and scores of  friends and coworkers.\n\nBilly, first and foremost, was a man of service. He answered the call  to defend his country as a United States marine, proudly serving 4  years…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691576/recognizing-alhambra-theater-dining"}, {"senator": "Rick Crawford", "party": "Republican", "sentence": "…had ever  contemplated as remotely possible: to remove and exfiltrate for  prosecution a ruthless dictator whose direct involvement in  narcoterrorism has led to the death of scores of Americans and other  allies' citizens.\n\nPlease don't take my word for the nature of Maduro's reign over  Venezuela. My Democrat colleagues have for years been raising the…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698882/successful-operation-to-arrest-nicolas-maduro"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…Veterans Experience Office, to improve veteran       and beneficiary customer experience and satisfaction,       including through the use of what are known as ``trust-      scores'', Veteran Signals also known as ``VSignals'', and       related survey and data collection activities, processes, and       initiatives; and\n\n(2) submit to the Committee on…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693967/protecting-regular-order-for-veterans-act-of-2025"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…individual financial transactions through a CBDC does raise serious  privacy concerns and concerns about government control and  politicization of loans, online payments, credit scores, tax  compliance, Federal contracts, monetary policy, and the like.\n\nIn addition to these privacy concerns, a central bank digital  currency would centralize Americans' finances,…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693730/anti-cbdc-surveillance-state-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…One of the great lies here--and I have done entire presentations here  where I took a whole hour a while back where I did every tax hike that  the left has proposed and the scores and its economic factors.  Actually, we did a bunch of the cuts in spending and those things,  Republicans.\n\nThese tax hikes came out to 1.5 percent of GDP. Our cuts came out…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691811/actual-solutions"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…week--that is a term where we put in something  called a ``hopper.'' That is actually where you file your piece of  legislation--two pieces of legislation where the preliminary scores are  almost $2 trillion in savings over 10 years.\n\nAs we are having this discussion of debt and deficits, can you extend  the tax policy? Can you do other things? It is not…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691518/truth-telling-with-math-and-facts"}, {"senator": "John Thune", "party": "Republican", "sentence": "…her. Let's acknowledge that.  In January, the Nation's report card revealed that American students  are still struggling to make up ground lost during the pandemic.  Reading scores among fourth and eighth graders declined again, after  falling in 2022 and 2019. One-third of eighth graders are reading below  a basic level--the highest proportion ever recorded.…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688343/nomination-of-linda-mcmahon"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…get ahead academically  and succeed.\n\nData shows that our current educational system is failing our  students. Our outcomes are not where they need to be. Reading and math  scores are not where they need to be, et cetera.\n\nWe have got plenty to focus on with this particular issue. I am right  in the thick of it. My wife and I are very much in the thick…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689152/advancing-america-first-policies"}, {"senator": "Rob Wittman", "party": "Republican", "sentence": "…the individual medalist honor followed by outstanding performances from  Jack Houseknecht and Brodi Bartee, who each contributed standout  performances shooting their lowest scores of the season, Ethan  Thompson, Chriss Bassett, and Ainsley Asbury.\n\nCompeting among seven strong teams at Dogwood Trace Golf Course in  Petersburg, the Tigers captured the…", "date": "2025-10-28", "source_url": "https://justfacts.votesmart.org/public-statement/1696433/congratulating-the-tabb-high-school-tigers-golf-team"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…Democratic-led House considered the  last reconciliation bill, also known as the Build Back Better Act, the  process was a little messy, to say the least. The gentleman talks about  CBO scores, and it is certainly something that we are working very hard  on.\n\nMr. McGovern, in a meeting on November 4, 2021, was reading the  manager's amendment to be self-executed.…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691514/providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act-providing-for-consideration-of-sj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-review-of-final-rule-reclassification-of-major-sources-as-area-sources-under-section-112-of-the-clean-air-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…education system is failing. The National Assessment  of Educational Progress showed one-third of students are unable to read  at the basic level for their age group, and math scores are down 9  percent since 2018.\n\nNow, the Biden administration's response was to continue to shovel  more money into a failing system. They threw 200 billion in tax dollars…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690871/californias-disastrous-policies"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…forum, seniors U.V. Singh and Grayson Smith went  undefeated, while sophomore Dylan Hancock earned Salem's first-ever  congressional debate title with near-perfect speaker scores. Several  other Spartans, including medalists Rebekah Steinweg, Luke Stovall,  Kody Hinnant, and Abby Jones also delivered outstanding performances.\n\nAlso competing for Salem…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691284/congratulating-salem-high-school"}, {"senator": "French Hill", "party": "Republican", "sentence": "…overdraft  privilege.\n\nLike all price caps, this would reduce the availability of these very  overdraft services, especially, Mr. Speaker, for consumers who have  lower credit scores or are considered high risk.\n\nBy doing so, it effectively limits access to credit and that  overdraft privilege for those who need it the most at the time they  need it the…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689849/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…President Trump has reset our standing in the global  market after decades of failed and unfair trade deals put the American  economy last.\n\nSwift and decisive action has brought scores of countries to the  negotiating table and numerous new trade deals including with the U.K.,  the EU, Japan, Australia, Korea, El Salvador, Vietnam, Guatemala, and  Malaysia,…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699311/providing-for-consideration-of-hr-consolidated-appropriations-act-and-providing-for-consideration-of-hr-department-of-homeland-security-appropriations-act-and-for-other-purposes"}, {"senator": "Daniel Webster", "party": "Republican", "sentence": "…a 15 percent increase in  Algebra 1 proficiency, a 7 percent increase in English Language Arts  for grades 9 and 10, a 4 percent overall increase in English Language  Arts scores, and a 4 percent improvement in Civics end-of-course exam  performance. Additionally, the district proudly reports a high school  graduation rate of 93 percent, a significant…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694185/recognizing-lake-county-schools-on-earning-an-a-rating-from-the-florida-department-of-education"}]