[{"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "\"These families need immediate help, which is why I'm introducing this bipartisan legislation with Senators Scott, Klobuchar and Braun to get these payments in the hands of families who need them.\"\n\n\"With so many Americans facing economic hardship, Congress should take this opportunity to support families in smart, efficient ways,\" Scott said."}, {"senator": "Dianne Feinstein", "party": "Democrat", "sentence": "I am proud that Florida's Space Coast continues to be America's gateway to the stars, including this past weekend when NASA and SpaceX successfully launched the first American astronauts from American soil on an American rocket to the International Space Station in almost a decade.\" \"Our nation is competing against known adversaries like Communist China and Russia in the space launch industry, and we must put American interests and national security first,\" Scott said."}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "In doing so, we can train and build a workforce that is stronger and more dynamic than ever before.\" \n\n\"The COVID-19 epidemic has significantly altered our economy, and we should take smart, impactful steps to ensure American workers have access to the tools and training they need to succeed as the recovery process begins,\" Scott said."}, {"senator": "Jacky Rosen", "party": "Democrat", "sentence": "Senator Rick Scott said, \"It is unthinkable that a former member of Congress could be convicted of a crime involving public corruption and still benefit off the taxpayer dollars of hardworking families."}, {"senator": "Benjamin L. Cardin", "party": "Democrat", "sentence": "Scott said."}, {"senator": "Charles E. Schumer", "party": "Democrat", "sentence": "Senator Rick Scott said, \"We know Huawei is supported and controlled by the communist regime in Beijing, which continues to violate human rights and steal our data, technology, and intellectual property."}, {"senator": "Catherine Cortez Masto", "party": "Democrat", "sentence": "I'm proud to introduce this bipartisan, common-sense bill, and I will continue working to reduce healthcare costs for Americans.\"\n\nSenator Rick Scott said, \"Under our current system, loopholes exist that have allowed non-doctors to fraudulently bill health insurance companies to the tune of millions of dollars, which ultimately gets passed along to the consumer."}, {"senator": "Doug Jones", "party": "Democrat", "sentence": "Senator Rick Scott said, \"Communist China should not be allowed to host the 2022 Olympic Games while simultaneously running concentration camps, violating human rights and oppressing the people of Hong Kong."}, {"senator": "Cindy Hyde-Smith", "party": "Republican", "sentence": "Senator Rick Scott said, \"I'm proud to join Senator Tim Scott and my colleagues to recognize National School Choice Week."}, {"senator": "Rick Scott", "party": "Republican", "sentence": "Senator Rick Scott said, \"This week, I raised questions about the $12.5 million Foley & Lardner received to represent the illegitimate Maduro regime and announced that I would no longer meet with anyone from that firm."}, {"senator": "Joni Ernst", "party": "Republican", "sentence": "Scott said."}, {"senator": "Ben Sasse", "party": "Republican", "sentence": "Scott said."}, {"senator": "Rick Scott", "party": "Republican", "sentence": "Senator Rick Scott said, \"We have to get serious about the threat of coronavirus coming from China."}, {"senator": "Rick Scott", "party": "Republican", "sentence": "Senator Rick Scott said, \"We have to solve the spread of the Coronavirus."}, {"senator": "Rick Scott", "party": "Republican", "sentence": "Senator Rick Scott said, \"I applaud President Trump for providing a clear and concise message today about the growing threat of Communist China."}, {"senator": "Rick Scott", "party": "Republican", "sentence": "Senator Rick Scott said, \"As part of my 30-day plan to get back to normal, I called for a moratorium on financial payments, including rent, mortgages, credit card payments, taxes, and utilities."}, {"senator": "Rick Scott", "party": "Republican", "sentence": "Senator Rick Scott said, \"I'm glad the Peace Corps has finally come to its senses and sees Communist China for what it is: the second largest economy in the world and an adversary of the United States."}, {"senator": "Rick Scott", "party": "Republican", "sentence": "Senator Rick Scott said, \"The health and safety of American families is my focus, and I was glad the President agreed that solving the Coronavirus should be our first priority and will be the best stimulus for the American economy."}, {"senator": "Rick Scott", "party": "Republican", "sentence": "Senator Rick Scott said, \"Following many conversations between my office and the Interior Department, I'm glad to see the Department is putting national security first and adopting a no-fly rule for drones made in Communist China."}, {"senator": "Tim Scott", "party": "Republican", "sentence": "\"It is great news that our Democratic colleagues have finally relented on their blockade of funding for small businesses and their employees,\" Scott said."}, {"senator": "Rick Scott", "party": "Republican", "sentence": "Senator Rick Scott said, \"The use of apps like TikTok by federal employees on government devices is a risk to our networks and a threat to our national security, and I'm proud to join Senator Hawley to put an end to it."}, {"senator": "Marco Rubio", "party": "Republican", "sentence": "I thank Senator Scott for joining me in this effort to significantly reduce the burden of interest payments on FEMA loans to hard hit communities.\" \"Throughout my time as Governor of Florida, I saw firsthand the devastation and destruction massive storms can cause to families, communities and businesses,\" Scott said."}, {"senator": "Rick Scott", "party": "Republican", "sentence": "Senator Rick Scott said, \"I thank those Florida counties that were quick to implement mobile testing sites."}]