[{"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…on loan agents, it is essential that  the agency have proper oversight of their involvement to minimize  fraud. This will ensure that competent and honest agents can help  screen borrowers, prepare forms, and better reach communities that need  this capital most.\n\nThat is why this bill is so essential. The 7(a) Loan Agent Oversight  Act would require…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691856/9999"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…that broadband expansion in just a 5-year period. It was  incredible. It transformed our Nation.\n\nA 14-year-old girl today thinks that she has an entitlement to a 65- inch screen in her living room and a little digital device on her lap  at the same time. That didn't exist in the year 2000. It all happened  in the blink of an eye.\n\nNow, what would happen,…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690803/addressing-the-homework-gap-through-the-e-rate-program"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…helped  prevent terrorist attacks against U.S. aircraft from happening.\n\nThe jobs of TSA employees are difficult, from the Transportation  Security officers' perspective who screen millions of passengers a day,  to Federal air marshals providing in-flight security, to canine  handlers, inspectors, and cybersecurity experts, all helping to secure  our…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688740/tsa-commuting-fairness-act"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…one of just unthinkable size and scope--in Uvalde, TX. I  was actually sitting in the Presiding Officer's chair when I saw word  of the shooting scroll across my smartphone screen.\n\nGratefully, in the wake of that shooting, a group of us--Republicans  and Democrats--were able to come together and set aside the differences  that we had and still have…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690948/gun-violence"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…clear what data grantees are responsible for  collecting.\n\nThis bill would also compound this issue by requiring grantees to use  the Columbia-Suicide Severity Rating Scale to screen participants for  their baseline mental health when entering the program. While this  scale is a widely accepted, clinically validated behavioral health  screening instrument,…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691508/no-wrong-door-for-veterans-act"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…I watched on CNN as my then-Representative smiled and cheered in  the Rose Garden as President Trump repealed the Affordable Care Act in  the U.S. House. I looked at my TV screen, and I said: No, you don't get  to do that. You don't get to ignore your constituents, vote against  their interest, and keep your job.\n\nI am a former CIA officer. I served…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695610/healthcare"}, {"senator": "Nydia Velázquez", "party": "Democrat", "sentence": "…administration reinstituted longstanding antifraud  controls and put new safeguards into place to curb the flow of pandemic  dollars to fraudsters.\n\nBefore issuing a loan, the SBA would screen applicants on the  government's Do Not Pay list and then check its internal database for  fraudulent flags or holds. Borrowers had an opportunity to clear their  names, but…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687932/assisting-small-businesses-not-fraudsters-act"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…garbage about undocumented immigrants. CBO made it  clear that there is no Medicaid funding going to undocumented  immigrants in this country. It is clear. That is a smoke screen so that  people don't focus in on how their big, ugly bill is going to hurt  regular people in this country.\n\nIt really is astounding to me. I thought we all came here, no…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692265/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Eric Sorensen", "party": "Democrat", "sentence": "…broadcaster who has kept our district safe from storms for  nearly a half century.\n\nNext week, 25News Chief Meteorologist Chuck Collins, will be walking  away from the green screen. Chuck is a legend in the heart of Illinois,  offering a calm voice that is trusted in the best weather and the worst  storms.\n\nHe grew up in Central Illinois and, I may know…", "date": "2025-10-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696207/recognizing-25news-chief-meteorologist-chuck-collins-on-his-retirement-after-46-years-of-service"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…elected twice.\n\nHe correctly identified Russia as the ``evil empire.'' Ronald Reagan  had been an actor in Hollywood and fought to remove Communists from the  ranks of the Screen Actors Guild in California, where he met his wife.  That particular  effort by Reagan took great courage because he could have been killed.  That is what it is like to deal…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687991/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Steve Daines", "party": "Republican", "sentence": "…Record of Decision and the RMP amendment, which is based on       Alternative D in the final environmental impact statement.       The Miles City RMPA provides specific coal screen       designations for the 11.7 million acres of subsurface federal       mineral coal estate for which BLM has authority to determine       its availability. It also addresses…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693085/us-government-accountability-office-legal-opinion"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "Mr. CORNYN. Madam President, it looks like my timing is exquisite  because I came down here to talk about something that I think has sort  of fallen off the radar screen here in recent weeks, and that is the  work of the Department of Government Efficiency,  one of the most important developments that I think we have seen with  the advent of…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690662/department-of-government-efficiency"}, {"senator": "Mary Miller", "party": "Republican", "sentence": "…MILLER of Illinois. Mr. Speaker, today, Senator Mike Lee and I  will reintroduce the Shielding Children's Retinas from Egregious  Exposure on the Net Act, also known as the SCREEN Act.\n\nThe average age of a child's first exposure to pornography is 11  years old. Blocking and filtering software is ineffective, with nearly  80 percent of children and teens…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688197/blocking-and-filtering-software-is-ineffective"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…more IRS agents,  that is supposed to be a good thing and the sign of a strong economy.  That is the way they compute them. If we hire more bureaucrats to look  at a computer screen and do nothing in the Department of Defense, that  is also supposed to be a sign of a booming economy because we have more  jobs.\n\nIn fact, the difference between the--one…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700071/issues-of-the-day"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…spend it by this date, it is gone. You can say it can be used only for  these things.\n\nWhen we did stimulus checks during COVID, a lot of people went out  and bought flat-screen TVs from China. That didn't exactly help the  U.S. economy. Proponents of programmable money were saying they could  make it so you could spend it only on these things and…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693006/central-bank-digital-currency"}, {"senator": "John James", "party": "Republican", "sentence": "…there for a while.\n\nMichigan has the longest wait times on average of any State in that  immediate region and some of the longest wait times in the country. If  you want a flat-screen TV, Mr. Speaker, you can have one delivered to  your doorstep in hours. However, a lifesaving dialysis machine will  cost you $30,000 and might take you weeks to get.\n\nDo you…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697860/obamacare-isnt-working"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…the more children they can get online, the  longer they can keep them scrolling, the more data they collect on that  child. And the longer the eyeballs are trained on that screen, the  richer the data. And then, guess what? The Big Tech company whose value  is based on how many eyeballs they have and how long they have those  eyeballs on that screen,…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691286/statements-on-introduced-bills-and-joint-resolutions"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…in that direction,  teaching math appropriately, getting back to basics, utilizing  education technology in the right way, without having students be  exposed to excessive screen time. We have looked at school choice  programs, including, most importantly, expanding charter schools. We  have looked at the foundational importance of parental rights.…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697549/congratulating-eco-clean-solutions"}, {"senator": "Richard McCormick", "party": "Republican", "sentence": "…people are hooked on their cell phones  and electronics, it is more important than ever to protect our outdoors  so that our constituents can touch grass instead of a computer screen.\n\nIn short, citizens should never be denied access to the very parks  that they fund.\n\nMr. McCORMICK. Mr. Chair, in order to address my peers' concerns, I  will restate in…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694870/energy-and-water-development-and-related-agencies-appropriations-act-2026"}]