[{"senator": "Maxine Waters", "party": "Democrat", "sentence": "…Subcommittee, chaired by  Representative Joyce Beatty. The Subcommittee on Diversity and  Inclusion held 18 hearings, released three major reports, and brought  long-overdue scrutiny to the ways in which systemic barriers in our  financial system disadvantage entire communities. We exposed inequities  in hiring and promotion. We shined a light on the racial…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…with the rule of law and the values the United States  claims to uphold.\n\nThe President is also asking the American people to accept a  justification that does not withstand scrutiny. The Administration  claims these killings are about stopping drugs, but there is no  credible evidence that Venezuela is a significant source of fentanyl  entering the United…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698324/supporting-the-war-powers-resolutions"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…including compactness, contiguity, and respect       for political subdivision lines, the State of Texas must       demonstrate a compelling state interest to survive strict       scrutiny.\n\nIt is well established that so-called ``coalition       districts'' run afoul the Voting Rights Act and the       Fourteenth Amendment. In Petteway v. Galveston County,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694943/bloody-sunday-and-voting-rights-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…amendment that said 10 Members in the minority, or minority- majority, could sign a petition to have someone pulled out of a group  of 15 if they felt that person merited more scrutiny or presented  particular problems.\n\nI heard about kind of the distrust that that might be used to  dismantle an entire block of 15, so I am open to modifications of that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695308/cloture-motion"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…a classified briefing, if necessary. I demanded it  in a letter. I have yet to receive a satisfactory response. In fact,  those concerns collapse under even the slightest scrutiny.\n\nA Department of Defense letter, last year, confirmed, and I quote DOD  here, ``construction of the Revolution Wind project . . . would not  have adverse impacts to DOD missions.''…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696127/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…targeting.\n\nLet's be clear. A special interest alien, an SIA, does not mean  someone who is a terrorist. It just means that someone's travel  patterns indicate a need for further scrutiny. It means they need more  detailed questioning to determine what is going on.\n\nDuring markup and during the Rules Committee meeting, we heard from  my Republican colleagues…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693071/special-interest-alien-reporting-act-of-2025"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…a personal one, the       barriers that pregnant and parenting students face are not.       This proposed bill would reinforce structural and       institutional bias and scrutiny of the decisions students       make regarding their personal lives.\n\nWe welcome the opportunity to have an open dialogue with       the sponsors of the ``Pregnant Students'…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699317/pregnant-students-rights-act"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…impetus behind this bill to be retaliatory in nature, I do  agree with my majority colleagues that the Trump administration budget  formulation and execution process warrants scrutiny.\n\nSecretary Collins has already broken the law by redirecting funds  without congressional approval. I worry that the trend will continue  over the next few years. I hope…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693968/protecting-regular-order-for-veterans-act-of-2025"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…beneficial  long-term outcomes, and executing a successful raid does not constitute  a plan for governing a nation of 28 million people.\n\nCongress exists to provide oversight and scrutiny of the executive  branch, not to cheer from the sidelines. I commend our servicemen for  their performance last weekend, but I am deeply concerned about the  Trump administration's…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698780/venezuela"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…testify  publicly before the committee, under oath, so that the American people  hear the facts.\n\nThe truth should not be kept behind closed doors. The fresh air of  public scrutiny should be let in. The public has a right to know. That  is why Pete Hegseth must testify publicly and, most importantly, why he  must release the full tape of the attacks.", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697368/trump-administration"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…aspect of our politics. Super-PACs and dark money  groups now spend vast sums to influence, and sometimes determine,  election outcomes while shielding their donors from public scrutiny.  Compounding the problem, the Federal Election Commission has too often  failed to enforce the law, leaving voters vulnerable and unable to  discern who is trying to influence…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699248/citizens-united-16th-anniversary"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…identity.\n\nThese individuals met the same rigorous standards as their peers, the  same physical exams, screenings, and background checks; and in many  cases, under intense scrutiny, they didn't just meet those standards,  they exceeded them.\n\nTrans servicemembers are receiving glowing fitness reports and  commendations. One was described by her commander…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693974/transgender-americans-serve-with-honor"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…single jurisdiction in the country       that allows detention based solely on the nature of the       charge, and for good reason--it would not withstand       constitutional scrutiny. This bill would set a dangerous       precedent, eroding basic civil liberties and undermining       decades of legal precedent that protect fairness in our       criminal…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696985/opposition-letter-by-the-southern-poverty-law-center-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…refusal  to explain itself to Congress and the American people. This suggests  they know this operation and the tortured legal rationale they use to  justify it cannot withstand scrutiny.\n\nChairman Wicker--and I applaud him for his very forceful  determination to investigate this situation. We both have formally  requested the Executive orders that guide these…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697387/caribbean-boat-strike"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…there is approval from the U.S. Congress.\n\nMajority leader Thune has said:\n\nIf and when the plane is no longer a hypothetical, I can       assure you there will be plenty of scrutiny of whatever that       arrangement might look like.\n\nWell, it is no longer a hypothetical. Selling out American interests  began the first days and hours of this administration…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691548/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "John Rose", "party": "Republican", "sentence": "…criminal investigation into the activities of Special Counsel Jack  Smith and to consider possible Fourth Amendment violations during  Operation Arctic Frost.\n\nThat deserved scrutiny. That deserves answers. It doesn't merit  restitution paid for by hardworking waitresses, truck drivers, and  small business owners. Hardworking taxpayers shouldn't be punished…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699753/repeal-of-senate-payday-provision"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…allow those who are already providing mental  health services to receive grants for a suicide prevention program. Not  only are these applicants subject to the same level of scrutiny as  previous years' grantees but they also receive the same amount of  funding.\n\nThe idea that this creates a loophole or expands community care is  far from reality. Adding…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691509/no-wrong-door-for-veterans-act"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…Congressional Review Act is that passing a resolution of  disapproval under this law ensures that a substantially similar bad  rule can never be reintroduced in the future without scrutiny.\n\nWe obviously know that there are bad regulators from the prior  administration that prevented healthy mergers that would have prevented  bank failures. There is no guarantee…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691498/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…Regardless of what people might think because we  are allowed to travel to China, they are not showing you this part.\n\nThe CCP's secrecy ensures that China remains closed to scrutiny, but  the evidence is clear: Falun Gong practitioners are the primary victims  of this barbaric organ harvesting system.\n\nThe tribunal's findings are staggering. They concluded…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690647/falun-gong-protection-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…a new  Governor in the State, the project will finally be wound down.\n\nTaxpayers also deserve answers on where all of this money has gone.  Curiously, as we are seeing new scrutiny to answer that question as to  where the money is going, the Governor is pushing a bill in the  legislature to keep records of the project secret and to create new  exceptions…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700217/prices-in-california-are-too-high"}, {"senator": "John Thune", "party": "Republican", "sentence": "…obstruction.\n\nDemocrats, of course, attempted to justify themselves by claiming, in  the words of the Democratic leader, that ``historically bad nominees  deserve a historic level of scrutiny.'' The only problem with that  argument, of course, is that a lot of these supposedly historically bad  nominees received Democrat votes. So either Democrats were supporting…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699100/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…of China should--\n\n(1) work with the United States Government to identify a       list of unregulated chemicals used to create precursor       chemicals that bear increased scrutiny;\n\n(2) require the proper labeling of chemical and equipment       shipments in accordance with international rules;\n\n(3) immediately implement ``know-your-customer'' procedures…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694826/stop-chinese-fentanyl-act-of-2025"}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "…leverage.\n\nThis is all about politics, not what is best for the people of our  country. Now, they will tell you it is about healthcare, but their  position crumbles under scrutiny. If it were about healthcare costs,  why would they make people suffer more in order to change healthcare  policy rather than reopen the government and negotiate with Republicans…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696452/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Scott Fitzgerald", "party": "Republican", "sentence": "…firearm to  appropriately define a less-lethal projectile device.\n\nIt does so by instituting a five-part test, ensuring only devices  that are truly less lethal will pass ATF scrutiny. It also exempts  these devices from the firearm excise tax, the simple logic being that  police departments and manufacturers should no longer be paying a  firearm tax on…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700039/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…proper consultation as required by       department policy. At the very least, the complexity of the       new proposal warrants additional time for public review and       scrutiny and, importantly, meaningful consultation with the       Alaska Native tribal entities, corporations, and communities       most impacted by these decisions.\n\nThank you for…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696574/sj-res-80"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…people  watching might ask themselves that. Well, as history has taught us, it  is a broad-reaching issue that can have some very negative  consequences. Excessive regulatory scrutiny and additional costs can  change the way nonbanks conduct business.\n\nMr. Speaker, we cannot continue applying banklike regulations to  nonbanks that have fundamentally different…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699824/financial-stability-oversight-council-improvement-act-of-2025"}, {"senator": "Mary Miller", "party": "Republican", "sentence": "…States have enacted some form of website age verification  requirement.\n\nThe Supreme Court is poised to rule on the Texas age verification  law. Whether they apply strict scrutiny or a lower form of judicial  review, it is abundantly clear that the SCREEN Act is the answer.\n\nWe must take decisive action to protect our children from the scourge  of pornography.…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688197/blocking-and-filtering-software-is-ineffective"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…Trump administration by the American people, many of the  career VA employees who contributed to the crisis remain. Some of these  employees have operated far too long without scrutiny and with no  consequences for planning failures that total billions of dollars.\n\nWithout some ways of tying poor performance to outcomes for these  employees, what message…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693967/protecting-regular-order-for-veterans-act-of-2025"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…resources will be spread too thin, and the Tribes with established  rights will suffer.\n\nThat is the crux of the issue. If the Lumbee had a case that could  withstand the scrutiny of the OFA process, they would go through the  OFA process as set out by law. But as they know, it won't hold up under  a deliberative process. They sought special treatment…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697785/ensuring-fairness-and-integrity-in-federal-tribal-recognition"}, {"senator": "Dan Newhouse", "party": "Republican", "sentence": "…cattle industry  in the State of Washington. They preserve, protect, and promote the  beef industry through producer and consumer education, legislative  advocacy, regulatory scrutiny, and legal intervention.\n\nBased in Ellensburg, Washington, the Washington Cattleman's  Association has 1,500 members across the State. Their excellent  leadership in Olympia…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696671/congratulating-the-washington-cattlemans-association-on-their-100th-anniversary"}]