[{"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…constantly available in those vast, underground, big pipes that run  through all of our cities and towns.\n\nGeothermal energy doesn't depend on the weather. It doesn't depend on  the season or geographical conditions. It exists as a consistent and  dependable source for a clean energy grid. When you go underground,  generally, you have a 45- to 75-degree constant…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694099/trumps-reckless-tariff-policies"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "Ms. BYNUM. Mr. Speaker, I only have 1 minute today, but I wish I had  6 or 7 minutes.\n\nWildfire season is upon us. Over the weekend, we saw the Cram fire in  central Oregon grow to more than 95,000 acres, making it the largest  wildfire of the year so far in the United States.…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693956/addressing-firefighter-funding-cuts"}, {"senator": "Terri Sewell", "party": "Democrat", "sentence": "…like to also shed a light on the  outstanding high school basketball players in Alabama's Seventh  Congressional District who led their teams to championship victories  this season.\n\nThat includes the girls' 7A champions at Hoover High School, who  dominated their competition and brought home the gold at the end of  their 29-3 season. Way to go, ladies.…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689179/congratulating-high-school-basketball-champions"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…golden goal from Jaelyn  Clinkscales propelled the Akron Zips Women's lacrosse team to victory.\n\nThe odds were stacked against this team as they were picked to finish  last this season in the MAC Preseason Coaches Poll, but they persevered  and beat the odds coming in as the champions.\n\nThis historic season was led by Coach Elaine Jones, who also won the…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691189/champion-of-the-week-university-of-akron-womens-lacrosse-teams"}, {"senator": "Wesley Bell", "party": "Democrat", "sentence": "…women's soccer team, who just secured their second-straight Division  III national championship. These student-athletes reflect the best of  St. Louis.\n\nWhat they achieved this season didn't happen by accident. It came  from years of work, a culture of accountability, and a shared belief  that success in the classroom and success in competition strengthen…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698090/recognizing-washington-university-womens-soccer-team"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…health coverage, creating new pathways to  homeownership, raising the minimum wage, and expanding tax deductions  for working-class people.\n\nMr. Speaker, after Thanksgiving season, where so many families felt  the strain, the message from Delaware is clear: We need solutions, not  tariffs and cuts to healthcare but policies that make life more  affordable.", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697421/delaware-day"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "Ms. DEXTER. Mr. Speaker, back-to-school season should be a time of  excitement, a time when families pick out backpacks, meet teachers, and  look ahead to a year of learning and growth.\n\nHowever, for the Merlos family,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694771/toward-a-more-dignified-and-just-immigration-system"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…deadly diseases like Marburg and Ebola. They have  crippled our response to disasters like hurricanes in the Caribbean, as  we enter what is expected to be an active hurricane season.\n\nAnd just today, the Secretary of Defense said he would end the Women,  Peace, and Security program at the Department of Defense. Now, he  mistakenly said this was a program…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690349/9999"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…an area in Orange County that is prone to the same types  of wildfire risks that we saw devastate Los Angeles not too long ago.  We are about a month or two away from fire season. We have had a number  of fires similar, but smaller in scope, to the one that just hit Los  Angeles due to the Santa Ana winds that come through our area in  southern California…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689810/cuts-to-forest-service-endanger-millions"}, {"senator": "Al Green", "party": "Democrat", "sentence": "Mr. GREEN of Texas. Mr. Speaker, and still I rise, and I rise today  to initially extend greetings to all, especially those who are  traveling over this season of resurrection.\n\nIn my church--I am a Christian--we commemorate and celebrate Easter.  I want to let everyone know that I appreciate those who do, and to  those who do not,…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690093/protecting-the-american-dream"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…fortunate to have an  abundance of locally owned small businesses bringing life and community  to our cities.\n\nMr. Speaker, as we approach Small Business Saturday and the holiday  season, I encourage everyone to shop small and take some time to  support your local businesses. By doing so, you are supporting your  neighbors, growing your local economy, and making…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696998/small-business-saturday"}, {"senator": "Richard Neal", "party": "Democrat", "sentence": "Mr. NEAL. Mr. Speaker, I rise today to recognize and celebrate a  remarkable milestone in western Massachusetts broadcasting and  educational history: the 65th anniversary season of As Schools Match  Wits, an award-winning high school academic quiz show produced by New  England Public Media and Westfield State University. To the best of our  knowledge,…", "date": "2026-01-23", "source_url": "https://justfacts.votesmart.org/public-statement/1699382/recognizing-the-65th-anniversary-season-of-as-schools-match-wits"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…bill. Let that sink in. I mean, it is ridiculous. The Mayor  and the chairman of the D.C. Council warned that this would throw a  huge wrench into D.C.'s current tax filing season and force people to  refile their taxes. That is insane.\n\nIf this bill becomes law, they would be ripping away D.C.'s new child  tax credit, money that would go directly to…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699593/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…administration is doing the opposite, gutting our  Nation's largest emergency management agency.\n\nAs a New Yorker, I saw the flooding in Texas and immediately thought  of hurricane season on the East Coast. It has been a few years since a  major storm hit our region. We are due. Local and State agencies are  preparing, but this year they are doing so without…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1693988/fema-cuts-and-hurricane-season"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…get injured. When they do, whether they are insured  or not, they are showing up at the hospital, and the rest of us will  pay the cost.\n\nMr. Speaker, as we enter the holiday season, as a preacher's kid, I  have been thinking a lot about Matthew 25:31-40, where Jesus said:  ``Come, you who are blessed by my Father.'' He said when He enters into  his kingdom,…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698225/healthcare-affordability-crisis"}, {"senator": "Jim Baird", "party": "Republican", "sentence": "Mr. BAIRD. Mr. Speaker, I rise to honor the Pioneer High School  football team. The Pioneer Panthers had an incredible season and a  well-deserved visit to the 1A State Championship finals.\n\nWhile the end of this football season wasn't what the Pioneer team  really had hoped for, each and every one…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698081/recognizing-pioneer-high-school-football-team"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…American, who grabbed 9 rebounds  and scored 20 points.\n\nThe entire team made critical contributions, showing their depth and  the unity of this team. The championship caps off a season where the  Pirates won by an average of 57 points.\n\nI congratulate the entire Palm Bay Pirates team. They have made our  entire community proud.", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689242/recognizing-palm-bay-pirates-girls-basketball-team"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…to recognize the Salem High  School boys' lacrosse team, which made history this year by capturing  their first-ever VHSL State championship.\n\nThey capped an incredible 2025 season with an 11-7 victory over  Loudoun County. Along the way, they won the Region 4D championship with  a 14-3 win over Jefferson Forest and claimed the Tommy Girani Cup,  achieving…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693527/congratulating-central-high-school-womens-softball-team"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "Mr. THOMPSON of Pennsylvania. Mr. Speaker, I rise today to  congratulate Ellie Sheehan, drum major of the Penn State Blue Band this  season.\n\nThis is a historic milestone because Ellie is the first woman to hold  the position in the Blue Band's 126-year history.\n\nEllie hails from Hollidaysburg, Pennsylvania, and…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696938/congratulating-ellie-sheehan"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…congratulate the Olympus High  School Titans on winning the 5A Boys Basketball State Championship.\n\nWith a commanding 69 to 40 win over Highland High, the Titans capped  off a season defined by discipline, grit, and teamwork. This  championship reflects the hours of practice, the leadership of their  coaches, and the drive of a team that refused to let…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690115/recognizing-the-olympus-high-school-titans"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…area is known for producing.\n\nChristmas tree farms play such an important role in the economy of  North Carolina, and I want to highlight them especially during the  Christmas season.\n\nThe beautiful tree that I picked up that day is now in my living  room, and I will be enjoying it until January.\n\nI thank the Fairchild family for such an enjoyable visit…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697374/fun-with-math"}, {"senator": "Julia Letlow", "party": "Republican", "sentence": "…home their eighth national title.\n\nUnder the leadership of Coach Jay Johnson, LSU captured their second  title in 3 years. The Tigers triumphed through their championship  season with 53 wins and an undefeated College World Series.\n\nCoach Johnson and his team exemplified excellence on and off the  field, making Louisiana proud of not only their athleticism…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692910/congratulating-lsu-baseball"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…in American industry.\n\nThis year, House Republicans are keeping more hard-earned dollars in  working families' pockets, not with the Washington bureaucracy. The tax  filing season begins next week, and Americans can expect to see some of  the biggest tax refunds in history.\n\nAfter 4 years of painful inflation, we are cleaning up the economic  mess. Real…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699064/how-republicans-have-delivered-for-americans"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…Regional Park in Palm Bay, Florida, to celebrate the Seventeenth Annual  Family Christmas Extravaganza--an event that embodies the very best of  our community during the Christmas season.\n\nThis annual tradition is made possible through the collaboration of  faith-based organizations, including The House Church, Eastwind  Pentecostal Church, Jornada al Cielo,…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698220/recognizing-the-seventeenth-annual-family-christmas-extravaganza"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…Pirates took home their second State championship in  football. Never trailing in the game, they won 31-20 at Ford Field in  Detroit, and, I might add, they had a perfect 14-0 season.\n\nMr. Speaker, I congratulate Coach Schelke and his talented young  group of men on their incredible accomplishment at Ford Field. They  have made Michigan's Ninth District…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697371/recognizing-harbor-beach-football-team"}, {"senator": "Brad Finstad", "party": "Republican", "sentence": "…had  crossed the goal line, prompting a video review that ultimately ruled  in favor of the Wildcats.\n\nThe top-seeded Dodge County team has been nothing but impressive all  season, finishing strong with a record of 24-3-2. Their championship  win marks the first state title--not only for the program--but for any  girls hockey team south of the Twin Cities.…", "date": "2025-04-17", "source_url": "https://justfacts.votesmart.org/public-statement/1690120/recognizing-the-2025-class-1a-minnesota-state-girls-hockey-champions-the-dodge-county-wildcats"}, {"senator": "Tony Wied", "party": "Republican", "sentence": "…rise to recognize and congratulate the  West De Pere Phantoms football team for winning the WIAA Division 2  High School State Championship.\n\nFollowing an impressive regular season and dominant performance in  the playoffs, the West De Pere Phantoms traveled to Camp Randall  Stadium in Madison to compete in the 2025 WIAA Division 2 State  Football Championship.…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697388/congratulating-west-de-pere-phantoms-football-team"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…impressive jump of 6 feet 9 inches. His hard work and  dedication, both on and off the field, in achieving this accomplishment  is truly outstanding. He has achieved an impressive season, bringing  pride to his school and community.\n\nMr. Speaker, I ask my colleagues to join me in paying special tribute  to Nathan Bright of North Ridgeville High School. On behalf…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693333/special-recognition-of-nathan-bright-for-winning-the-division-i-state-track-and-field-title-for-high-jump"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…taxes  on their tipped income. Imagine what this means to Mary Beth's  employees. We also discussed no tax on overtime. To quote Mary Beth:  During busy times like football season, we work a lot of overtime  because we are just so busy. We do a lot of catering during football  season so that helps give our team a lot of opportunity to get more  hours.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694787/promises-made-promises-kept"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "Mrs. HOUCHIN. Mr. Speaker, today I rise in recognition of the 15-0  Indiana University football team for their historic season, winning the  Rose Bowl, then the Peach Bowl, and now advancing to the College  Football Playoff National Championship.\n\nThis team rose to the occasion when few expected it.…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698931/recognizing-indiana-university-football-team"}]