[{"senator": "Joe Morelle", "party": "Democrat", "sentence": "…Rochester, New  York. At the heart of his activism has always been a dedication to  ensuring that marginalized voices are heard and that his community has  a meaningful seat at the table.\n\nAlongside his advocacy, Henry devoted 34 years to the Rochester City  School District, most of them as a beloved kindergarten teacher. In his  dual-language classrooms,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695845/recognizing-henry-padron-morales"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…proposed reductions to Medicaid would impact state budgets,       rural hospitals and health care service providers. It is       necessary for Governors to have a seat at the table when       discussing any reforms and cuts to Medicaid funding. States       and territories should be afforded more flexibility when it       comes to administering…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…an abstract concept; that is the wisdom that has  served us well for well over 200 years, that those checks and balances  give all our citizens an opportunity to have a seat at the table when  major decisions about their lives and their futures are being made.\n\nSo that is why this decision that we are about to make is not just  about the tariffs. It is…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690522/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Wesley Bell", "party": "Democrat", "sentence": "…out. That  is not normal. That is not acceptable. In this administration, access  is bought instead of earned. If you are a billionaire or a special  interest, you get a seat at the table. If you are a nurse, a warehouse  worker, or a parent juggling two jobs, you are out of luck. That is how  we end up with policies like tariffs that raise costs for Missouri…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699585/stop-the-republican-affordability-crisis"}, {"senator": "Hillary Scholten", "party": "Democrat", "sentence": "…first and  only Black mayor of Grand Rapids. His leadership throughout the 1970s  marked a turning point for the city, proving that Black leaders could  and should have a seat at the table in shaping the future of our  communities.\n\nIn 2003, Parks was awarded the GIANT Among Giants Award, an annual  award presented by the city of Grand Rapids since 1983…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688206/highlighting-notable-black-leaders-from-michigans-third-congressional-district"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…possible position. Before we even get to the table,  Ukraine has been excluded from NATO. Territorial concessions were  granted to Russia, and Ukraine didn't even have a seat at the table.  This is what they get for a sacrifice of hundreds of thousands of their  people, cities destroyed across Ukraine.\n\nThe Trump administration must increase pressure on…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687990/three-year-anniversary-of-russias-brutal-attack-on-ukraine"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…is especially true when  Republicans control the House, the Senate, and the White House. But  these bills show that when Democrats roll up their sleeves and demand a  seat at the table and drive the hardest bargain we can, we do have the  power to reject devastating cuts proposed by President Trump, protect  programs that families rely on, and take…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699453/appropriations"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…like my predecessor John Mercer Langston, the first Black man to  serve in this body from Virginia.\n\nIt is a story of persistence, the persistence of women forcing a seat  at the table of democracy and bringing a folding chair like Shirley  Chisholm when they weren't let in. It is a story of the Federal  Government advancing, retreating, advancing,…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689341/fighting-voter-suppression"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…deficit, but work with us. Work with Congress to craft  smart, strategic reciprocity agreements with each country. Ensure that  workers, like United Auto Workers, have a seat at the table, a voice,  and real power to negotiate on all sides of all borders.\n\nFor too long, what has been happening is billionaire companies and  corporate executives have been…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690052/trump-tariffs"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…President can just decide not to spend money we have appropriated, and  that is okay. They have made clear that they can pass reconciliation  bills without giving us a seat at the table. It is up to them whether  Congress will pass funding that meets people's needs and solves their  problems and keeps the government open or not.\n\nI am usually the eternal…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695041/better-is-possible"}, {"senator": "Maggie Goodlander", "party": "Democrat", "sentence": "…threats of trade  wars against our neighbors and allies.\n\nIn Congress, I am fighting every single day to ensure that New  Hampshire small businesses get true advocates and a seat at the table  in trade negotiations and discussions that impact our international and  interconnected economy. I am looking for a level playing field for  small businesses to compete…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687955/small-business-advocacy-improvements-act-of-2025"}, {"senator": "Tony Wied", "party": "Republican", "sentence": "…on the jobsite.\n\nEarlier this year, the Small Business Administration created the Red  Tape Hotline under its Office of Advocacy. This hotline gives small  businesses a seat at the table to highlight the prohibitive red tape  regulations from across Federal agencies that hurt their ability to  grow and compete.\n\nMy bill takes that progress further. It…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697345/destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…own wife's gas stove, and we won that battle.\n\nFortunately for the American people, under the leadership of House  Republicans and President Trump, common sense has a seat at the table  again.\n\nAll we are doing is rolling back the senseless and unending  bureaucratic red tape ushered in under the previous administration that  harms hardworking Americans…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689128/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…rural counties in our districts where hardworking small  business owners are ready to grow if only they can access the capital  that they need. This bill gives them a seat at the table and a voice in  sharpening the policies that affect their future.\n\nMr. Speaker, I urge my colleagues to support H.R. 1190, and I reserve  the balance of my time.\n\nMr.…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692759/expanding-access-to-capital-for-rural-job-creators-act"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…the driver's seat. We cannot allow that to  happen.\n\nI come from the world of business and just like in business we want  the best, most qualified individuals to have a seat at the table. By  establishing a 6G Task Force, we can bring together America's brightest  industry leaders, stakeholders, and innovators to collaborate on the  future deployment…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690228/future-uses-of-technology-upholding-reliable-and-enhanced-networks-act"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "…the Secretary will help to recognize the  importance of this population.\n\nMr. Speaker, I was proud to work alongside Chairman Bost on this to  ensure survivors have a seat at the table.  I urge my colleagues to support and pass this commonsense legislation  again in the 119th Congress as it did without objection last Congress.", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689688/prioritizing-veterans-survivors-act"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…blame? The  people in power who allowed them to do it.\n\nI blame the corporate bosses, the special interests, and, yes, the  politicians who sold our country out for a seat at the table of the  globalist banquet.\n\nI blame the ideologues of the status quo, the international elites,  the so-called citizens of the world who see our country as a global…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690533/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Barry Moore", "party": "Republican", "sentence": "…Alabama, I want to thank Mayor Stimpson  for his leadership and deep commitment to public service. Through his  work, every Mobilian has been empowered to have a voice and a seat at  the table in shaping a better future for their city.", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696270/recognizing-the-accomplishments-of-mayor-william-s-sandy-stimpson"}, {"senator": "Young Kim", "party": "Republican", "sentence": "…needed partner in security against  shared threats.\n\nAs chairwoman of the East Asia and Pacific Subcommittee, I have  worked on bipartisan bills to give Taiwan a rightful seat at the table  in international organizations, such as WHO and IMF. I led the charge  to track and ensure efficient delivery of weapons that Taiwan has  purchased from the United States.…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690020/recognizing-taiwan-as-a-trusted-leader-in-freedom-democracy-and-trade"}, {"senator": "John Thune", "party": "Republican", "sentence": "…including  things like irrigation ditches, ephemeral streams, and even prairie  potholes.\n\nI know farmers and ranchers in my State of South Dakota would have  appreciated a seat at the table before the Biden administration  resurrected this harmful policy, and I am pleased that the Trump  administration is committed to consulting with stakeholders for their…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689698/energy-regulations"}, {"senator": "Mike Bost", "party": "Republican", "sentence": "…they did in the  original bill of 2008.\n\nMr. Ciscomani's bill will correct the Biden-Harris administration's  disservice to survivors and would ensure survivors have a seat at the  table again.\n\nThe current administration supports this bill and is therefore as  committed as I am to ensuring that the needs of the veterans' surviving  families are prioritized…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689687/prioritizing-veterans-survivors-act"}, {"senator": "Tom Kean, Jr.", "party": "Republican", "sentence": "…policymakers from America and  our allies, to offer technical expertise to American-led innovators.\n\nBy ensuring that our companies, engineers, and policymakers have a  seat at the table, we can promote fair competition, protect our  national security, and prevent our adversaries, like China, from  shaping the future of global communications to their…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693510/promoting-united-states-wireless-leadership-act-of-2025"}, {"senator": "Frank Lucas", "party": "Republican", "sentence": "…Agriculture Secretary Perdue under the first Trump  administration and former Agriculture Secretary Vilsack under the Biden  administration agreed that having a permanent seat at the table is  vital to the protection of our farmland and food supply.\n\nI am also pleased to boast bipartisan support from the leadership of  the House Financial Services Committee.…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692797/agricultural-risk-review-act-of-2025"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "…mandates. It is about empowering local governments and residents  to take control of their future. It is about ensuring that every  community, no matter how small, has a seat at the table and a voice in  our Nation's progress.\n\nI am proud to say that this bill has bipartisan support. This bill  was passed out of the House in the previous Congress, and…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693904/single-unique-zip-codes-for-certain-communities"}]