[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…because they are afraid to open their  door.\n\nThree hundred and seventy-four days ago, standing up for your First  Amendment rights, your Fourth Amendment rights, even your Second  Amendment rights was not in itself a provocation in the eyes of the  Federal Government.\n\nBut in so little time, so much has changed. In this America, we see  masked agents hiding…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699422/9999"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…constitutional rights of the people of Minnesota. I do say to our  colleagues, if you believe in the First Amendment, in the right to  assemble, then show it. If you believe in the Second Amendment and that  Alex Pretti had a right to be a lawful gun owner--and it was the Border  Patrol agents that took his gun out of his holster, all he was holding  was a cell phone--then…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700059/9999"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…Constitution. Though she has  since walked it back, the message was clear: This administration would  rather silence dissent than defend liberty.\n\nI hear defense of the Second Amendment, the right to bear arms, but I  want to make sure that we defend all amendments, including the Fifth  Amendment for due process, and the 10th Amendment, rights that are…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695623/warning-about-suppressing-rights-on-constitution-day"}, {"senator": "Elissa Slotkin", "party": "Democrat", "sentence": "…6-month-old who stopped breathing.\n\nImagine being the family watching on video as your loved one is  beaten and shot repeatedly and killed because they were exercising  their Second Amendment right and being present in their First Amendment  right with freedom of speech.\n\nAnd then imagine being grabbed off the street and taken to a  detention facility without…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699401/9999"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…wants what he calls a strategic reserve of crypto.  If you vote against this rule, you are voting to allow him to buy  bitcoin or Trump coin with taxpayer money. That second amendment, also  prohibited by this rule, says that taxpayer money will not be used to  bail out stablecoin or other crypto assets.\n\nWe have already seen dozens of scandals since…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693548/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…uphold  our values. It betrays them. It sends the cruelest message to some of  our most devoted patriots that one identity they hold matters more than  their service.\n\nMy second amendment restores retirement benefits to transgender  veterans who were forced out of the Armed Forces just shy of 20 years  of service.\n\nUnder the law, they should qualify for…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695110/providing-for-consideration-of-hr-streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-and-providing-for-consideration-of-hr-stop-illegal-entry-act-of-2025"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…were murdered for standing up for what is right and exercising  their constitutional First Amendment right to speech and assembly, and  in the case of Mr. Pretti, his Second Amendment right to carry arms. I  also stand in honor of the 38 people who have died in ICE custody since  Kristi Noem became the head of DHS. Although they are not household  names,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699660/horrific-ice-abuses"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…tonight  during the National Gun Violence Awareness Month to shake the core of  our very beings.\n\nI want to be abundantly clear that this is not about taking away  anyone's Second Amendment right to bear arms. Mr. Speaker, don't be  fooled by the gun manufacturers that want to continue to put profits  over people, over children, and over people's lives.…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691752/national-gun-violence-awareness-month"}, {"senator": "Joshua Gottheimer", "party": "Democrat", "sentence": "…in Paramus,  New Jersey, and Menlo Park. This tragedy was preventable and  unacceptable. My amendment will help ensure catastrophes like that  never happen again.\n\nMy second amendment will help VA hospitals provide kosher meal  options for Jewish veterans. Right now, many Jewish inpatient veterans  are only served frozen, prepackaged kosher meals that…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692953/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…level included in the bill  seriously underfunds CEBAFs operations. A funding level of $166 million  for CEBAF operations should be included in the final legislation.\n\nMy second amendment No. 42, emphasizes the need for funding  critically needed infrastructure improvements at CEBAF. The workforce  at JLab is rapidly growing with the increased use of CEBAF…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694942/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…residents of those countries are losing because our gun laws are  like Swiss cheese. They are filled with holes. Let's close those  loopholes. It doesn't diminish anybody's Second Amendment rights.\n\nJustice Scalise said it himself in District of Columbia v. Heller.  You can have criminal background checks to make sure that only the  right people are getting…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691242/leosa-reform-act"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "…we have critical trust  in the messages and content we all receive on a daily basis and that  there are penalties for the abuse of this very powerful technology.\n\nThe second amendment I want to highlight speaks to a deeply  disturbing issue that we all, both Republicans and Democrats, should be  horrified by. This is about the Trump administration's…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695106/providing-for-consideration-of-hr-streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-and-providing-for-consideration-of-hr-stop-illegal-entry-act-of-2025"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…rights back.\n\nThat same day, Trump's Department of Justice filed a motion in  Federal court, trying to overturn a decision to say that silencers are  not protected by the Second Amendment, trying to say that no State  legislature could ban or regulate the use of silencers, and silencers  are broadly used by killers, by criminals who are trying to hide the…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690948/gun-violence"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…creating a system where that kind of overreach of  power would be investigated, instead he is basically accusing the  victim here--and basically, really, even attacking Second Amendment  rights.\n\nSo I am here to join my colleagues to say, what are we going to do to  fix this system? What are we going to do to make sure that tragedies  like this don't…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699419/9999"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "…interactions between Homeland Security officers and his  neighbors. When agents became violent with a female protester, he  stepped in to protect her.\n\nHe also exercised his Second Amendment right to bear arms. Despite no  evidence that he was threatening anyone or holding anything but a phone  in his hands, officers still shot him repeatedly and killed him.…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699402/9999"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "…President's  efforts to combat veteran homelessness through investment in the new  Bridging Rental Assistance For Veteran Empowerment program.\n\nThis bill protects the Second Amendment rights of veterans by  preventing the VA from sending information to the Federal Bureau of  Investigation about veterans without a judge's consent.\n\nIt also prohibits…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692951/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…from 10 years to 30  years, and 51 percent of the Air Force's service-retained fighting  force is in the Air National Guard. We need to act to modernize our  fleet.\n\nMy second amendment will provide a 2-year funding mechanism for the  State Partnership Program. This is a key security cooperation program  that enables our National Guard units to train…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695238/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…think of all the things Americans need an ID for, yet face  absolutely  no backlash from the Democratic Party. For example, to exercise another  constitutional right, the Second Amendment, an individual must present  a government-issued photo ID to purchase a firearm from a Federal  firearms dealer. Yet, requiring identification to vote is somehow  portrayed…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699940/providing-for-consideration-of-s-veterans-accessibility-advisory-committee-act-of-providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-and-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…tragedies in Minnesota, and I did, but we need to be  careful. When we talk about people being murdered in Minnesota because  they were lawfully carrying a gun, using their Second Amendment rights,  we are belying decades of concealed-carry classes that tell people who  are carrying guns how they should behave around law enforcement.\n\nNow, I know Democrats…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699594/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…strengthens SNAP benefits.\n\nIt implements critical program integrity and cost-containment  provisions in Medicaid to strengthen it for future generations.\n\nIt safeguards the Second Amendment by removing tax and registration  requirements for firearm silencers and eliminating silencers from the  National Firearms Act.\n\nIt provides critical disaster recovery…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692263/providing-for-consideration-of-hr-prohibiting-voting-by-noncitizens-in-district-of-columbia-elections-providing-for-consideration-of-hr-district-of-columbia-federal-immigration-compliance-act-of-providing-for-consideration-of-hr-protecting-our-nations-capital-emergency-act-and-providing-for-consideration-of-s-halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Keith Self", "party": "Republican", "sentence": "…cutting costs, speeding decisions, and keeping our warfighters ahead.  It also mandates regular reports to Congress for swift, informed action  to maintain our edge.\n\nMy second amendment ensures an immediate pay raise for Department of  War blue-collar workers, the mechanics and technicians who keep our  bases and equipment ready. These Americans have…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695229/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…spent on public safety and national  security, not bloated bureaucracy.\n\nIt provides strong support for State and local law enforcement  partnerships, and it defends the Second Amendment and America's right  to bear arms.\n\nRepublicans are working to advance regular order and deliver results  for the American people--reliable and affordable energy, strong…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698748/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "Mr. CLYDE. Mr. Speaker, I rise today in support of restoring our  Second Amendment rights.\n\nEarlier this year, I worked diligently on and proudly voted for the  One Big Beautiful Bill Act, which was signed into law by President  Trump on July Fourth.…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697383/restoring-second-amendment-rights"}, {"senator": "Vince Fong", "party": "Republican", "sentence": "…would direct the Department of Defense  to assess the healthcare resources available to our Navy personnel at  the base and provide recommendations to improve them.\n\nMy second amendment focuses on strengthening the largest component of  China Lake, the Naval Air Warfare Center Weapons Division. It would  direct the Secretary of the Navy to review the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695160/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…fentanyl crisis, supports the Department  of Justice grant programs that target opioids and child exploitation,  and facilitates immigration enforcement. It protects the Second  Amendment by keeping long-standing safeguards in place that prevent  Federal agencies from restricting lawful firearms, ammunition, and  sporting equipment without congressional…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698637/providing-for-consideration-of-hr-saving-homeowners-from-overregulation-with-exceptional-rinsing-act-providing-for-consideration-of-hr-affordable-housing-over-mandating-efficiency-standards-act-and-providing-for-consideration-of-hr-commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…a small fee on electric vehicles because they use our  roads, too, and should help fund the highway trust fund.\n\nIt provides tax relief to Americans to exercise their Second  Amendment rights for the first time in history.\n\nI was proud to help move this legislation forward because North  Dakotans and all Americans are tired of waste and overreach, and…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691959/supporting-the-big-beautiful-bill"}, {"senator": "Lauren Boebert", "party": "Republican", "sentence": "…is on the front lines of protecting our  communities, and this investment will ensure they have the tools to  stop these lethal drugs before they reach our streets.\n\nMy second amendment redirects $2 million of wasteful spending to  increase further funding for counternarcotic support within the  Department of Defense. This will strengthen the DOD's critical…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693651/department-of-defense-appropriations-act-2026"}, {"senator": "Dan Meuser", "party": "Republican", "sentence": "…facilities.\n\nThis supports President Trump's initiative to end veteran  homelessness through the Bridging Rental Assistance for Veteran  Empowerment program, protects veterans' Second Amendment rights, and  invests heavily in general military construction.\n\nI proudly represent more than 45,000 veterans in Pennsylvania's Ninth  Congressional District. When I include…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692937/american-economy-gaining-momentum"}, {"senator": "Greg Murphy", "party": "Republican", "sentence": "…Carolina is proud to be called home by hundreds of thousands of  Active-Duty members of our military and those retired from our Armed  Services. I am grateful the Veterans Second Amendment Protection Act  was included in this package, as well as supporting language for the F- 35 sustainment center and utilities upgrade for future F-35 squadrons.  I wholeheartedly…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692939/military-construction-veterans-affairs-and-related-agencies-appropriations-act-2026"}]