[{"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…and I am proud to  have called him my friend.\n\nMr. Speaker, I invite my colleagues to join my wife, Vivian, and me,  along with the 765,000 residents of Georgia's Second Congressional  District, in extending our heartfelt condolences to Overseer Roosevelt  Carter's family and the members of First Monumental Faith Ministries.  We celebrate his leadership,…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692741/in-memory-of-overseer-roosevelt-carter-i"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…hear.\n\nMr. Speaker, I ask my colleagues in the U.S. House of Representatives  to join my wife, Vivian, and me, along with the more than 765,000  people of Georgia's Second Congressional District, in honoring the life  and legacy of Councilor Judy Thomas. Moreover, we extend our deepest  sympathies to Councilor Thomas's family, friends, colleagues, and all…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690837/in-memory-of-the-honorable-judy-thomas"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "Mr. Speaker, I rise today on behalf of New Mexico's Second  Congressional District to celebrate a long-awaited victory for rural  America, the imminent passage of the bipartisan Secure Rural Schools  Reauthorization Act.\n\nI preface my remarks…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697655/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…two great-great-grandchildren, and numerous nieces,  nephews, and cousins.\n\nMr. Speaker, my wife Vivian and I, along with the more than 765,00  people of Georgia's Second Congressional District, salute and honor  life of Honorable Curtis Parham ``CP'' Redding, Sr., a man of purpose  and heart, whose enduring love for his family and community will never…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691304/in-memory-of-the-honorable-curtis-parham-cp-redding-sr"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…to others for which we  should all aspire.\n\nMr. Speaker, I ask my colleagues to join my wife Vivian and me, along  with the more than 765,000 people of Georgia's Second Congressional  District in honoring the life and service of Mrs. Juanita Carson Booker  on the occasion of her 95th birthday.", "date": "2025-08-26", "source_url": "https://justfacts.votesmart.org/public-statement/1694759/recognizing-mrs-juanita-carson-booker"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…on Geno and the  women as loudly as anyone. It is a great university sports program that  brings everybody together. We are so proud of them, particularly in the  Second Congressional District. I have the honor to represent the  amazing university campus and stores and also Avery Point.\n\nWell done, bravo, and kudos to all of them. Just watching them…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689671/congratulating-uconn-womens-basketball-stars"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…There are so  many other seniors who are in the same boat. Without these programs,  seniors like me would die on the street.''\n\nThat is Paula, who lives in Arkansas' Second Congressional District,  represented by my colleague, Congressman French Hill.\n\n``My son is a 25-year-old young adult with profound nonverbal autism  who needs 24/7 support. Our family…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…home, but across this  country, the staggering healthcare disparities that persist across this  country and across too many counties in districts like mine, the Second  Congressional District of Alabama.\n\nLet me be clear at the outset: I do not subscribe to the notion that  healthcare is a luxury, that healthcare should be available to those  who can…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690245/health-disparities-in-minority-communities"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…and my colleagues who are leading  on this important legislation.\n\nI rise in support of the bipartisan Rural Small Business Resilience  Act.\n\nMy home in Maryland's Second Congressional District is home to nearly  640,000 small businesses, many of which are in rural communities, all  with unique needs and challenges.\n\nI support this bill because it will…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687928/rural-small-business-resilience-act"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…Georgians who can prove they are working,  studying or volunteering. Only about 6,500 of them, however have been  able to gain and maintain coverage.\n\nIn Georgia's Second Congressional District, which I represent, some  of the poorest counties have fewer than 10 enrollees despite having  high percentages of uninsured populations.\n\nThe Georgia Budget and…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689905/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…bills that are  bipartisan, common sense, and certainly mean a lot to the folks who I  represent out West.\n\nMr. Speaker, as you may know, I represent Colorado's Second  Congressional District. It is an incredibly large geographical  district. It is a district that spans across more than 8,000 square  miles. It is larger than eight States on the eastern…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693453/bolts-ditch-act"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…Truly the world is a better place because of Cliff.\n\nMr. Speaker, I ask my colleagues to join me, my wife Vivian, and the  more than 765,000 people of Georgia's Second Congressional District in  honoring the life and legacy of Mr. Clifford Odell Rutledge. We extend  our deepest sympathies to his family, friends, colleagues, and all  those who mourn…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688153/in-memory-of-clifford-odell-rutledge"}, {"senator": "Jennifer Kiggans", "party": "Republican", "sentence": "…bill, the Care for Military Kids Act, that was included in the  appropriations package for 2026 that just passed the House.\n\nAs a proud Representative of Virginia's Second Congressional  District, home to one of the largest Active-Duty military populations  in the United States, advocating for those who serve our country and  their families is one of my…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699300/advocating-for-military-families"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…BACON. Mr. Speaker, in recognition of Black History Month, I rise  today to honor two community leaders and two outstanding youth for  their contributions to the Second Congressional District of Nebraska.\n\nBrenda Council has been described as a pure force, a trailblazer, a  fighter, and a leader who has paved the way for so many in Omaha. As a  prominent…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699725/happy-90th-birthday-to-beth-ragland"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…support of my legislation, H.R. 1618, the  Precision Agriculture Satellite Connectivity Act, that I was pleased to  introduce with the gentlewoman from Illinois' Second Congressional  District (Ms. Kelly).\n\nFor years, large parts of my district and rural areas across America  have lacked access to fast broadband connections.\n\nReliable internet access…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693469/precision-agriculture-satellite-connectivity-act"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…Carl and Nancy taught music in southern Ohio for 43 years before  retiring at the end of the 2025 school year, leaving an indelible mark  on the arts in Ohio's Second Congressional District.\n\nCarl served as the band director at West Union High School, the choir  director at Manchester briefly, and later as music supervisor across  the whole school…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699834/recognizing-carl-and-nancy-schneider"}, {"senator": "David Taylor", "party": "Republican", "sentence": "Mr. TAYLOR. Mr. Speaker, I rise today to recognize two of southern  Ohio's outstanding young women who have proudly made the Second  Congressional District home to both Miss Ohio and Miss Ohio's Teen:  Olivia Fosson and Allison Payton.\n\nAllison, a Chillicothe native and rising senior at Zane Trace High  School, was…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695223/congratulating-miss-ohio-olivia-fosson-and-miss-ohios-teen-allison-payton"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…earned the  award, making this achievement nothing short of extraordinary.\n\nI look forward to seeing how Carter can continue to create positive  change in Ohio's Second Congressional District.\n\nI would also like to recognize Carter's parents and Scout leaders for  their role in this process. Without them, this achievement would not  have been possible.…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690320/recognizing-carter-bisig"}, {"senator": "Cliff Bentz", "party": "Republican", "sentence": "Mr. BENTZ. Mr. Speaker, I rise today to recognize the Korean and  Vietnam War veterans from Oregon's Second Congressional District who,  are visiting their memorials and the WWII Memorial, because of the  efforts of the Honor Flight of Southern Oregon. Whenever I have the  opportunity to meet…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691306/recognizing-the-honor-flight-of-southern-oregon"}, {"senator": "Neal Dunn", "party": "Republican", "sentence": "…underscore the dangers that law enforcement faces every day while  protecting our communities. I believe I can speak on behalf of the  constituents of Florida's second congressional district in saying that  we are deeply moved by Deputy May's sacrifice in the name of our  safety. We collectively mourn the passing of this outstanding public  servant.…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689979/mourning-the-loss-of-walton-countys-sheriff-deputy-william-will-paul-thomas-may"}, {"senator": "David Taylor", "party": "Republican", "sentence": "Mr. TAYLOR. Madam Speaker, during the month of August, I spent time  in Ohio's Second Congressional District, talking with countless Ohioans  about their priorities, touring family-owned businesses, and hearing  from local farmers, manufacturers, and defense companies…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694798/promises-made-promises-kept"}, {"senator": "David Taylor", "party": "Republican", "sentence": "Mr. TAYLOR. Madam Speaker, I rise today to recognize Ken Stewart.\n\nKen is a proud resident of Ohio's Second Congressional District and a  former firefighter with the Batavia Fire Department. Ken spent over  four decades with the department, working his way up from lieutenant to  chief.\n\nThis…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697115/recognizing-ken-stewart"}, {"senator": "French Hill", "party": "Republican", "sentence": "…National Guard Enlistment in the Second District of Arkansas\n\nMr. HILL of Arkansas. Mr. Speaker, I rise today to recognize the  outstanding patriotism of Arkansas' Second Congressional District,  which was the highest-producing district for Arkansas National Guard  enlistments in fiscal year 2025.\n\nOur district led the State in Army National Guard recruitment,…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699816/congratulating-robert-arrington"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…resources that are available in more urban  areas, farmers and farming families are facing a significant mental  health challenge. With 96 percent of farms in Ohio's Second  Congressional District being family farms, this demonstrates how close  to home this issue hits my district.\n\nWith the devastatingly high rate of mental health challenges and  substance…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691424/increasing-mental-health-services"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…proud of Madison's accomplishments, and we are happy  to call her one of our own. I look forward to seeing how she continues  to create positive change in Ohio's Second Congressional District.\n\nMr. Speaker, I also recognize Madison's grandmother and her  Scoutmaster, Ryan Pelliter, for their role in this process. Without  them, this achievement would…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693067/madison-wasmer-earns-eagle-scout-award"}]