[{"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…not discharge. In a  remarkable act of bravery, Conrad immediately stepped in to pull the  gun away from the suspect as he tried to point and shoot at the officer  for a second time.\n\nBoth the Canton Police Department and Walmart said that Conrad went  above and beyond in his service to our community, and I could not agree  more.\n\nWhat could have been…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698833/champion-of-the-week-conrad-piero"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…measures, Senate  Republicans are moving forward with their version of the big, ugly  bill. Because House Republicans broke so many rules when they passed  their bill the second time, they are going to have to vote on it a  third time when it comes back from the Senate.\n\nMiraculously, due to their own ineptitude, Republicans have given  themselves yet…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692813/providing-for-consideration-of-hr-military-construction-veterans-affairs-and-related-agencies-appropriations-act-providing-for-consideration-of-hr-special-interest-alien-reporting-act-of-providing-for-consideration-of-hr-jeremy-and-angel-seay-and-sergeant-brandon-mendoza-protect-our-communities-from-duis-act-of-and-providing-for-consideration-of-h-res-condemning-the-violent-june-2025-riots-in-los-angeles-california"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…will be persistent with it.\n\nI know that as we do it, we will gain additional momentum. There will  be many who won't vote for it initially, but then there will be more  the second time that will--and more the third time, the fourth time,  and however many times it is necessary to get us to our final Articles  of Impeachment that will bring President Trump…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692296/and-still-i-rise-denouncing-the-presidents-authoritar-ianism-and-recognizing-the-impeachment-warriors"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…farmworkers  who already endure grueling conditions are being stripped of hard- fought protections.\n\nNone of this is okay. This is not normal.\n\nAllow me to say this plainly for the second time tonight: If you work  in America today, you are less safe than you were a year ago. You are  more likely to be underpaid, exploited, or ignored. This is  unacceptable.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695577/trumps-labor-agenda-unsafe-and-underpaid"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…Whack Trump Voters'' with a  subhead of ``Whatever happened to GOP concern for the working class?''\n\nThe Wall Street Journal said: ``President Trump won the Presidency a  second time by promising working-class voters he'd lift their real  incomes. Which makes it all the more puzzling that he's so intent on  imposing tariffs that will punish those same…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688624/tariffs-whack-trump-voters"}, {"senator": "Emilia Sykes", "party": "Democrat", "sentence": "…that we are here today to celebrate the possibility of a  Women's History Museum is incredible. First, it is incredible because  why has it taken it so long, and, second, because it is time to  recognize the contributions of women in this country.\n\nOf course, the women from Ohio who are the heart of it all will  certainly be very much previewed and modelled…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689366/womens-history-month"}, {"senator": "Ilhan Omar", "party": "Democrat", "sentence": "…story that Trump told during the campaign about the need  to restore law and order, about the need to target criminals. Within  moments of assuming the Presidency for the second time, though, his  true agenda became clear.\n\nThe administration has no interest whatsoever in targeting criminals.  What they want is to fulfill Stephen Miller's white nationalist…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692431/ice-surveillance-and-trump"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…him in check. If he doesn't see that, then we will go on to another  stage of it.\n\nI am going to come to the floor and read these articles. Then they  will be read again a second time. I will ask for the vote.\n\nThere will be probably be a motion to table. The motion to table  means that if it prevails, then the articles will not go forward and  have the…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690862/and-still-i-rise-impeaching-president-trump"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…It burns no fossil fuel.\n\nAnd yet the Trump administration twice has tried to shut down that  project--twice. Just yesterday, they got blown up in Federal court for  the second time when they tried for the second time to shut down that  project. After $5 billion had been invested in it, they wanted to shut  it down.\n\nSo we have the way to go forward,…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698993/unanimous-consent-request-s-res-550"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…stop that cycle of  violence.\n\nIt was working in Oakland. Youth Alive! was preventing gun violence.  Last year, of the 113 clients they served, only 1 of them was injured a  second time. Yet, in the middle of a 3-year $2 million grant that Youth  Alive! was getting, it was suspended, terminated. They are going to  have to lay off their staff. That program…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690948/gun-violence"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…nuclear not just once but twice. First, we will go nuclear  and overturn the rule on points of order during a CRA, which is in the  law. Then Republicans plan to go nuclear a second time: to throw out  the rulebook and use the CRA against any Agency action that any Agency  submits, no questions asked. Like I said, this goes way beyond just the  legislative…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691542/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…Mount Vernon Public School System and now a professional in  education in that very same school system. Twice-elected to the Mount  Vernon City Council, he is serving for the second time as its presiding  officer.\n\nHappy Birthday to Derrick. There is much more ahead for him and the  people he serves. We salute Derrick from the floor of the House of  Representatives.…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699911/recognizing-derrick-thompson"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "Mrs. McCLELLAN. Mr. Speaker, on January 6, 2021, a crowd of people  stormed the Capitol seeking for the second time in American history to  take by force what they could not win at the ballot box.\n\nCapitol Police were beaten as they tried to protect Members of this  body and the Vice…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692516/government-of-the-people-not-of-the-king"}, {"senator": "André Carson", "party": "Democrat", "sentence": "…with our actions--rejecting misinformation, upholding the  integrity of our elections, and ensuring no one is above the law. As  soon as President Trump was sworn in the second time, he took the  unprecedented action of pardoning all January 6 rioters, including the  man who was convicted and imprisoned after targeting me. Since their  release, at least…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698532/recognizing-the-5th-anniversary-of-january-2021"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…But bringing  an impeachment resolution to the floor mere hours after it has been  introduced and without any investigative report--as Congressman Green  is doing for the second time this Congress--sets a harmful precedent.  It undermines the ability of Congress to make a serious and well- documented case for impeachment against this or any future president.…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698091/concerns-with-h-res-939"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…You need  to watch their behavior. And they mean what they say. And don't be like  the people in the thirties that got it wrong. Israel is not going to  get it wrong the second time.\n\nDonald Trump. God bless President Donald J. Trump. I am so glad he  won. What has he tried to do? Make peace, not war. He gave the  Ayatollah 60 days to find a peaceful…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692780/iran"}, {"senator": "Nicholas LaLota", "party": "Republican", "sentence": "…get it over the finish line in the  Senate in time, so I thank Chairman Williams for his important  leadership in getting it back to the floor and across the finish line a  second time in the House. We will get it done this time.\n\nI urge my colleagues to support this commonsense legislation.", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687908/doe-and-sba-research-act"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "Mr. MOORE of Utah. Mr. Speaker, again, yesterday marked 100 days  since President Trump took office for the second time. It has been a  whirlwind 100 days, to say the least, as his administration has taken  swift action to reverse many of the Biden-era policies that I believe  brought major…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690427/the-first-100-days"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…asking me to do that. I think he has raised the expectations here, so  we will see what I can do.\n\nMr. Speaker, I have been in Congress now for 10 months, and this is  the second time the government has been shut down. What is similar in  them both is the reason because Democrats have put the priorities of  illegal immigrants over the priorities of the…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699594/providing-for-consideration-of-senate-amendments-to-hr-consolidated-appropriations-act-providing-for-consideration-of-hj-res-disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-and-providing-for-consideration-of-hr-critical-mineral-dominance-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…This legislation will not only help taxpayers who have been victims  of fraud, but it will also help combat fraud by eliminating  opportunities for criminals to strike a second time.\n\nCheck fraud is a major challenge in this country, and it has grown  exponentially over the past several years. In fact, in 2022, the  Treasury Department's Financial Crimes…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689291/recovery-of-stolen-checks-act"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…President--let me apologize in  advance--is deeply disgusting. It is deeply disgusting. I mean, it is  clown world on steroids. When I first read about this, I read it a  second time because I experienced slack-jawed astonishment. When I read  it a second time and I realized it was true, I just wanted to run away  screaming.\n\nWhat am I talking about?…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697400/welfare-fraud"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…meetings. One of the  surprises that happens at a high school is meeting Iowa's ``Teacher of  the Year.'' This year, that was Stephanie Pritts, and I congratulate  her for a second time.", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697231/2026-iowa-teacher-of-the-year"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…farmworker, if they are  here illegally and they do not commit a felony, this bill does not  touch them. The only standard that this bill has: Do not come back into  the country a second time illegally, and do not get convicted of a  felony. How low do you think of the farmworkers that they cannot meet  that standard?\n\nMadam Speaker, I yield 2 minutes to the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695365/stop-illegal-entry-act-of-2025"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…way, funding the government is not a single vote.  It is a process that requires steady, deliberative progress. I am proud  to say we are doing just that.\n\nToday marks the second time this month that we are bringing  bipartisan, bicameral bills to the floor. We promised the American  people a responsible Member-driven process, and that is precisely what…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699054/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…is why we don't just grab them at the border and  turn them around. We actually get fingerprints, get information from  people in the processing. If you are coming a second or a third time, I  watched the prosecution by U.S. attorneys actually prosecuting  individuals there through that process, getting them a felony and then  putting them on a bus back…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690878/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…went on then to violate the Budapest Memorandum in  2014 when it invaded Crimea and annexed the Crimea Peninsula. Then, as  we all know, Russia violated the Memorandum for a second time in  February 2022 with its invasion of Ukraine proper.\n\nIf Russia were unwilling to honor the commitments enshrined in the  Budapest Memorandum in 2014 and 2022, how, then,…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690955/ukraine"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…and removed twice before.\n\nIn January, a 24-year-old Mexican national was charged with the  murder of his girlfriend in Utah just one week after being deported for  the second time.\n\nThese are not isolated cases. They are just a few recent examples  from my home State, and there are countless more heartbreaking stories  from across the country.\n\nIt…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695360/stop-illegal-entry-act-of-2025"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "Mr. SULLIVAN. Mr. President, I am coming down to the Senate floor for  the second time in about a month to try to pass a really important bill  for some really heroic constituents of mine, Alaskan Native Vietnam  veterans, and I am going to explain this bill…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696959/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-extension-of-deadlines-in-standards-of-performance-for-new-reconstructed-and-modified-sources-and-emissions-guidelines-for-existing-sources-oil-and-natural-gas-sector-climate"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "Mr. MORAN. Mr. President, we for a second time failed to pass a  continuing resolution to allow the Federal Government to continue to  operate. It is because we are coming to the end of the fiscal year. Not  all the…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695918/continuing-appropriations-and-extensions-act-2026"}]