[{"senator": "Lucy McBath", "party": "Democrat", "sentence": "projectile[s] at a velocity       exceeding 500 feet per second,'' it ignores the fact that       such devices, as with all firearms, do not by themselves       determine the velocity of the projectiles they fire, but it       is the ammunition which is the determinant of velocity.", "title": "Law-Enforcement Innovate to De-Escalate Act", "date": "2026-02-12"}, {"senator": "Brad Schneider", "party": "Democrat", "sentence": "We departed from Paris on an       overnight train that would pass through two border control       checkpoints, the first under German control, the second under       French.", "title": "Rose-Helene Spreiregen", "date": "2025-05-07"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "Second, although I would like to support it, I have to say no, not  because of something it has but what it lacks, and that is, it fails to  mention anything about the Trump-Musk assault on the VA and its  workforce and particularly the negative impacts of those actions on  veterans' mental health and suicide prevention.", "title": "-9999", "date": "2025-04-09"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "Chair, I yield an additional 30 seconds to the  gentlewoman from New York.", "title": "Financial Services and General Government and National Security, Department of State, and Related Programs Appropriations Act, 2026", "date": "2026-01-14"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "Second, we need real accountability, having ICE abide by the same  rules as local police do, including independent investigations of ICE.", "title": "Department of Homeland Security", "date": "2026-02-02"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "I want to make two points about the tariffs--one, the tariffs  themselves, and then second, the congressional failure to assert its  own authority on policies that it has the constitutional responsibility  for when our failure results in economic pain and insecurity for the  American people.", "title": "Terminating the National Emergency Declared to Impose Global Tariffs", "date": "2025-04-30"}, {"senator": "Al Green", "party": "Democrat", "sentence": "The second resolution is one that I am very proud to present.", "title": "Impact of President on Peace Process", "date": "2025-02-27"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "The  start of Donald Trump's second term has been the worst start of any  President's in modern times.", "title": "Trump Administration First 100 Days", "date": "2025-04-28"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "I am sure my friend has already mentioned this: Particularly from  Virginia's standpoint, Canada is our second biggest trading partner.", "title": "Terminating the National Emergency Declared to Impose Duties on Articles Imported From Canada", "date": "2025-04-02"}, {"senator": "Gary Peters", "party": "Democrat", "sentence": "He  is the spiritual head of the second largest Christian Church in the  world and the leader of over 1 million Greek Orthodox in the United  States, including many of my constituents in the State of Michigan.", "title": "Welcoming Ecumenical Patriarch Bartholomew", "date": null}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "The Republicans under President Trump, in his  second term, want to perpetuate his tax cut that he gave primarily to  the wealthiest people in America and add to it at the expense of  healthcare for America.", "title": "Establishing the Congressional Budget for the United States Government for Fiscal Year 2025 and Setting Forth the Appropriate Budgetary Levels for Fiscal Years 2026 Through 2034", "date": "2025-04-03"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "As the spiritual leader of the second-largest Christian Church in the  world, His All-Holiness carries a message of peace, reconciliation, and  interfaith dialogue that resonates deeply across all faith traditions.", "title": "Welcoming His All-Holiness Ecumenical Patriarch Bartholomew", "date": null}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "The Eaton fire was the second most destructive wildfire in  California's history.", "title": "Marking Anniversary of Los Angeles Fire", "date": "2026-01-07"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "Speaker, I rise in fierce opposition to this  performative and misleading resolution that reads like a cheap script  treatment looking for a second-rate director.", "title": "Condemning the Violent June 2025 Riots in Los Angeles, California", "date": "2025-06-27"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "20, the second  Republican resolution in just 2 days that will raise energy prices on  Americans.", "title": "Providing for Congressional Disapproval of the Rule Submitted By the Department of Energy Relating to ``Energy Conservation Program: Energy Conservation Standards for Consumer Gas-Fired Instantaneous Water Heaters''", "date": "2025-02-27"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "This legislation will not only help taxpayers who have been victims  of fraud, but it will also help combat fraud by eliminating  opportunities for criminals to strike a second time.", "title": "Recovery of Stolen Checks Act", "date": "2025-03-31"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "At the start of President Trump's historic second term earlier this  year, he did the unthinkable.", "title": "We Are Better Together", "date": null}, {"senator": "Russell Fry", "party": "Republican", "sentence": "For a  second, by the way, I think it is really rich coming from them because  I think eight of the top ten States with the highest energy costs are  blue States that are run by Democrat State legislators and Democrat  governors.", "title": "Saving Homeowners From Overregulation with Exceptional Rinsing Act", "date": "2026-01-07"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "This achievement marked the second year in a row a Penn Manor High  School team placed in the top two positions.", "title": "Recognizing Penn Manor High School Students for Their Achievement in the Sea Air and Land Challenge", "date": null}, {"senator": "James Risch", "party": "Republican", "sentence": "No member of the       committee may receive assignment to a second subcommittee       until, in order of seniority, all members of the committee       have chosen assignments to one subcommittee, and no member       shall receive assignments to a third subcommittee until, in       order of seniority, all members have chosen assignments to       two subcommittees.", "title": "U.S. Senate Committee on Foreign Relations Rules of Procedure", "date": "2025-06-02"}, {"senator": "Nathaniel Moran", "party": "Republican", "sentence": "Second, the bill helps the court address its growing case backlog.", "title": "Tax Court Improvement Act", "date": "2025-12-01"}, {"senator": "Roger Marshall", "party": "Republican", "sentence": "Let's talk about rural healthcare for a second.", "title": "-9999", "date": "2025-10-02"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "Now we are on the second  one, Khamenei.", "title": "Iran", "date": "2025-06-23"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "A second-generation firefighter, Randy has held numerous  leadership positions, including Chief, and has consistently  demonstrated commitment to public safety and the growth of the  Wendelville Volunteer Fire Company.", "title": "Recognizing Randy Moje", "date": "2026-02-03"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "The second bill is entitled Withhold Member Pay During Shutdowns Act.", "title": "Directing the Removal of United States Armed Forces From Hostilities Within or Against Venezuela That Have Not Been Authorized By Congress--", "date": "2025-11-06"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "President, I am coming down to the Senate floor for  the second time in about a month to try to pass a really important bill  for some really heroic constituents of mine, Alaskan Native Vietnam  veterans, and I am going to explain this bill a little bit.", "title": "Providing for Congressional Disapproval Under Chapter 8 of Title United States Code, of the Rule Submitted By the Environmental Protection Agency Relating to ``Extension of Deadlines in Standards of Performance for New, Reconstructed, and Modified Sources and Emissions Guidelines for Existing Sources: Oil and Natural Gas Sector Climate", "date": "2025-11-19"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "87j) is amended--\n\n(1) in subsection (a), by adding at the end the following:       ``Notwithstanding the previous sentence, if the Secretary       does not make a new appointment upon the completion of a term       of an existing member (including such existing member's       second successive term), then such existing member shall       continue to serve until such appointment is made.''; and\n\n(2) in subsection (e), by striking ``2025'' and inserting       ``2030''.", "title": "United States Grain Standards Reauthorization Act of 2025", "date": null}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "President, we for a second time failed to pass a  continuing resolution to allow the Federal Government to continue to  operate.", "title": "Continuing Appropriations and Extensions Act, 2026", "date": null}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "Every 2 seconds, someone in the U.S.", "title": "American Red Cross Founding Day", "date": "2025-05-21"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "The second is from Senator John Hoeven of North Dakota.", "title": "Energy", "date": "2025-02-26"}]