[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…so they can do the bidding of those who would pollute  our air.\n\nNow, I don't blame my Republican colleagues for wanting to shroud  what they have set out to do tonight in secrecy. I don't blame them for  trying to hide it. It was just a few short weeks ago the Republican  leader assured this body that he would never do any such thing, but  that was…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691582/hj-res-88"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…legal under domestic and  international law, then why won't they defend it before Congress and  the American people? The stonewalling suggests they lack genuine  answers. The secrecy suggests they know that this operation does not  make sense, is not good policy, and, indeed, is quite illegal in many  respects.\n\nNow, Mr. Hegseth's credibility is not the…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697387/caribbean-boat-strike"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…waited long enough. If our justice system means anything, it must mean  justice for the vulnerable human beings that powerful men thought they  could use and throw away. No more secrecy, no more corruption, no more  protection for predators.\n\nMadam Speaker, history will remember what we do in this moment. Here  is the truth: If we in Congress cannot unify…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695278/jeffrey-epsteins-abuse"}, {"senator": "Andrea Salinas", "party": "Democrat", "sentence": "Ms. SALINAS. Mr. Speaker, I rise to call out President Trump for  abusing his power, acting in secrecy, and threatening our safety, all  while failing to address the rising costs in America.\n\nTrump is deploying ICE to our neighborhoods to terrorize our  immigrant communities.…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699128/ice-operations"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…convicted of and sentenced to jail for  taking money from a number of terrorist groups, among them Hamas, as  part of his crypto venture. He was convicted of violating the Bank  Secrecy Act and turning a blind eye to terrorists, including Hamas,  cybercriminals, and child abusers.\n\nI am wondering if the new language would cover Changpeng Zhao, who  just…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697236/no-immigration-benefits-for-hamas-terrorists-act-of-2025"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…programs into a woodchipper.\n\nThis billionaire and his tech bros claim to have found billions in  fraud, waste, and inefficiency, but their methods and results are  shrouded in secrecy. When they hype their claim on Twitter or the White  House press room, independent review has shown that their claims are  false or riddled with errors.\n\nBuying condoms for…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687998/department-of-government-inefficiency"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…this drug.\n\nA lot of good news, if you are going to go out canoeing and white  water rafting, but they won't tell you it is $6,100 for Rinvoq.\n\nIt is time to end Big Pharma's secrecy. If they are going to  advertise a drug, they need to also declare to the American public how  much it costs.\n\nIt is basic. No gimmicks, no tricks, just the truth by advertising…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694204/military-construction-veterans-affairs-and-related-agencies"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…creation of this centralized database.\n\nYet, despite the gravity of these concerns, Republicans voted to  block this reasonable inquiry from a regime that seems to thrive on  secrecy.\n\nThis vote follows a troubling pattern that occurred right here in the  House when rules were adopted to block a resolution of inquiry that I  and other Members had to ask…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698920/ending-improper-payments-to-deceased-people-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…and Ohio's Legislature  have granted giant tax breaks to data centers, while local township  officials remain in the dark about details. That is not fair.\n\nOhioans know what secrecy and inside deals bring. FirstEnergy  scandals led to indictments, prison terms, and even suicides. Ohio  Statehouse corruption rewards big business and harms the public. The…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697372/rushing-to-build-ai-data-centers"}, {"senator": "Stephen Lynch", "party": "Democrat", "sentence": "…proven to be excessively slow, a waste of taxpayer money,       and puts officers unfit to serve back in the Metropolitan       Police Department.\n\nH.R 2096 Creates a Wall of Secrecy and Undermines Public       Transparency and Accountability.\n\nThis legislation will remove the current requirement for       the Metropolitan Police Department to publish…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692304/protecting-our-nations-capital-emergency-act"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…masks, why they refuse to wear badges, why they  won't identify themselves, and why they resist oversight and  accountability.\n\nThey were designed to operate in shadow and secrecy because they are  waging a war against the American people. You may not know it because  they just haven't come for you yet. Trump's authoritarian fascist  tendencies, his…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697453/fighting-dhs-immigration-raids"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…to track. Fueled by Citizens       United, secretive political spending has eroded       accountability and Americans' trust in the political process.       The trend toward secrecy in U.S. campaigns is likely to       continue until Congress takes action to require disclosure of       large political contributions and expenditures.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699084/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…Supreme Court should be respected or not? Those are  the questions at issue on S. Res. 195.\n\nOur President, President Trump, has entered into an agreement still  shrouded in some secrecy with the President of El Salvador, President  Bukele, to deport American residents into El Salvador and imprison them  in prisons in a country that has been charged by the…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691406/motion-to-discharge-s-res-195"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Government should follow their lead and make salary  range disclosure a national requirement. Salary transparency is an  important tool to combat the gender and race pay gap. Salary secrecy  facilitates both intentional and unintentional pay discrimination and  perpetuates the pay gap.\n\nStudies have consistently shown that when women negotiate for their  salaries,…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688710/introduction-of-the-salary-transparency-act"}, {"senator": "Katherine Clark", "party": "Democrat", "sentence": "…vote.  This is about justice for the victims and survivors of Jeffrey Epstein.  This is about every victim of trafficking and sexual abuse, monstrous  crimes that thrive in secrecy and fear.\n\nYet, instead of shining a light on that darkness, just moments ago,  Donald Trump defended the continued obstruction of releasing these  files. Even as House Republicans…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696821/epstein-files-transparency-act"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…been put out.\n\nNow the House just voted to have greater transparency. Time will tell  what that means in terms of what the court does and how they deal with  the grand jury secrecy and what they do to continue to redact and  protect victims' names under existing laws and how the courts treat  that. That is going to be a process, as the gentleman likely…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696887/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…was a private citizen while he was  between his two terms in office. J.P. Cooney and Molly Gaston  reportedly accused the whistleblower disclosures of violating grand  jury secrecy rules when I obtained 197 of Jack Smith's subpoenas--wide- ranging subpoenas--that violated the privacy of a lot of people,  including a lot of Members of the Senate and Congress.…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699769/whistleblowers"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…predates any government. The government  doesn't give you that right. Governments around the world have adopted  a very similar approach. In the United States, we have the Bank Secrecy  Act, anti-money laundering laws, and know your customer laws.\n\nThe United States, every Western democracy, and dictatorships around  the world have similar features for banking.…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693006/central-bank-digital-currency"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…that FCC license or  authorization, that are owned by foreign adversarial governments. Under  the FACT Act, companies with foreign ties will no longer be able to  operate in secrecy, and they will no longer be able to conceal their  financial backers or obscure their true loyalties.\n\nHuawei should serve as a warning. China is on the offensive to  undermine…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690666/fact-act"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…into this because China  is a closed society. Regardless of what people might think because we  are allowed to travel to China, they are not showing you this part.\n\nThe CCP's secrecy ensures that China remains closed to scrutiny, but  the evidence is clear: Falun Gong practitioners are the primary victims  of this barbaric organ harvesting system.\n\nThe…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690647/falun-gong-protection-act"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…donations from Middle Eastern sources saw, on average, 300 percent more  anti-Semitic incidents than other institutions.\n\nCorrelation is not causation, but one thing is certain: Secrecy  allows these influences to operate unchecked and unexamined. The less  we know about where this money is coming from and what it is funding,  the easier it is for malign…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689028/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}]