[{"senator": "Chuck Schumer", "party": "Democrat", "sentence": "Mr. SCHUMER. Mr. President, on Signalgate, today, a Pentagon watchdog  will release a new report on Signalgate finding that Secretary Hegseth  put the lives of American troops at risk by sharing sensitive  operational information on a group chat in flagrant disregard of  security proposals. Secretary Hegseth…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697514/signalgate"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…that these cartels were terrorist organizations.\n\nThen the President decided that America is in a ``non-international  armed conflict,'' which is a dubious claim. Now, Secretary Hegseth has  begun calling these cartels ``the Al Qaeda of the Western Hemisphere,''  and declared open season on them.\n\nBut he seems to have forgotten an important fact: After…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696553/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Adam Smith", "party": "Democrat", "sentence": "…to pull troops out of  Eastern Europe in this moment and really reassert the ability of our  committee to exercise oversight. We have a fence on the travel budget  for Secretary Hegseth until he follows the law and releases the videos  for all of the boat strikes that are going on right now in Latin  America and also until he gets us the execute orders…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697790/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…laws.\n\nEven President Trump is trying to distance himself from this unlawful  attack, saying that he ``wouldn't have wanted that, not a second  strike.''\n\nLet me be clear. Secretary Hegseth has blatantly carried out illegal  acts of violence and, right now, he is trying to convince the American  people that these actions are okay. Mr. Speaker, the American…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697303/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…reeks of corruption, which is  the MO of the Trump administration.\n\nThe failure of the leadership at the Department of Defense is also a  national embarrassment. The mess Secretary Hegseth creates regularly  shows the consequences of picking an inexperienced FOX News host to  lead a massively complex life-or-death Federal Agency. Donald Trump is  learning…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697368/trump-administration"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "Mr. SCHUMER. Mr. President, now on the all-Senators briefing tomorrow  morning: Senators, tomorrow morning, will attend a briefing by  Secretary of Defense Pete Hegseth and Secretary of State Marco Rubio on  the latest developments in the Caribbean, including getting to the  bottom of what happened during the September 2 boat…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698188/all-senators-briefing"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…The facts as we understand them are these: On September 2, U.S.  forces conducted a strike on a vessel in the Caribbean. From his own  public statements, we know that Secretary Hegseth authorized and  oversaw the strike. According to press reports, the initial strike left  survivors in the water, clinging to the wreckage. Then U.S. forces  carried out…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697387/caribbean-boat-strike"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…the idea that democracies should stand together against  authoritarian governments.\n\nAnd while it is foolish and shortsighted, it is also not surprising  to hear Defense Secretary Hegseth recently declare, at the Reagan  Defense Forum, an end to what he calls ``idealistic utopianism,'' while  calling for a renewed focus on the Western Hemisphere.\n\nSo what…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698259/nominations"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…accounting titles from which billions  and billions of America's taxpayer funds were transferred. These  shorted accounts are going to have to be refinanced. How and when?\n\nSecretary Hegseth, Secretary Rubio and perhaps OMB Director Russell  Vought, their chief budget manager, it is your sworn constitutional  duty to provide the American people which Defense…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698837/reflecting-on-impact-of-illegal-action-in-venezuela"}, {"senator": "Chrissy Houlahan", "party": "Democrat", "sentence": "Ms. HOULAHAN. Mr. Speaker, I rise today as a veteran of the United  States Air Force on this national Women Veterans Day to tell Secretary  Hegseth and President Trump that women who raise their hand and swear  an oath to protect and defend this Nation are not going anywhere and we  will not be silent.\n\nFrom the…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692563/women-in-the-military"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "…lawful duty. The President's reaction was that these  Democratic Members of Congress were traitors and should be hanged.\n\nFast-forward to last week, when we learned that Secretary Pete  Hegseth ordered the illegal killing of defenseless survivors of an  attack on a boat in the Caribbean. This is what our colleagues were  warning about.\n\nMr. Speaker, Secretary…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697546/holding-war-criminals-accountable"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…were in danger.\n\nThis isn't a political issue. It is about trust, discipline, and the  safety of our  servicemembers. Our men and women in uniform deserve better, and  Secretary Hegseth needs to do the right thing to restore the confidence  of the Armed Forces, the American people, and our allies. Pete Hegseth  must go, and Congress must investigate…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689155/pete-hegseth-must-go"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…It would not be the last time President Trump disregarded the law and  the facts to achieve his policy goals.\n\nAlso, by last summer, it was clear that, in addition to Secretary  Hegseth, Deputy Chief of Staff Stephen Miller and Secretary of State  Marco Rubio were engaged in planning these various proposed operations,  and their personal agendas converged.…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699116/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Becca Balint", "party": "Democrat", "sentence": "Ms. BALINT. Mr. Speaker, Defense Secretary Hegseth should be one of  the busiest people on the planet, defending our country and leading  nearly 3 million courageous Americans in our Armed Forces. It is an  awesome responsibility.…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692120/stop-renaming-ships"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…have viewed  in a classified setting, is deeply alarming and calls into question the  Trump administration's respect for the laws of armed conflict. I have  called on Secretary Hegseth and Secretary Rubio to immediately release  the strike video in its entirety, so that the American public  understands what President Trump has ordered in the Caribbean…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698418/supporting-of-h-con-res-61-and-h-con-res-64"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…off-again  temper tantrum of tariffs tank the dollar, drive up prices, destroy the  markets, and threaten a recession.\n\nOne hundred days of chaos in the White House, where Secretary Hegseth  texts war plans to journalists, and the administration belittles allies  while embracing dictators like Putin.\n\nOne hundred days of corruption, as billionaires like…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690387/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-national-park-service-relating-to-glen-canyon-national-recreation-area-motor-vehicles-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-united-states-fish-and-wildlife-service-relating-to-endangered-and-threatened-wildlife-and-plants-endangered-species-status-for-the-san-francisco-bay-delta-distinct-population-segment-of-the-longfin-smelt-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision-providing-for-consideration-of-hj-res-providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision-and-for-other-purposes"}, {"senator": "Cory Mills", "party": "Republican", "sentence": "…built on.\n\nHowever, there is a glaring error. A caveat built into the list gives  commanders the ability to fly any flag they deem appropriate. Since  President Trump and Secretary Hegseth have taken office, the woke  infiltration of our military, even its highest leaders, continues to be  exposed.\n\nThe embarrassment of these flags is hard to grasp: drag…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695264/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "…We know it has overwhelming support on this side of the aisle, on  that side of the aisle, and at the other end of the building. What are  we waiting for? Let's do it.\n\nSecretary Hegseth and I have worked together to expedite weapons  development. Already, we are seeing progress there. This week, the U.S.  Air Force live-tested a new, low-cost, air-launched…", "date": "2026-02-05", "source_url": "https://justfacts.votesmart.org/public-statement/1699762/9999"}, {"senator": "Jimmy Patronis, Jr.", "party": "Republican", "sentence": "…protect this great country that we call home. I encourage my colleagues  to support this amendment that builds upon both what the President's  executive order does and Secretary Hegseth's charge to restore the  Department of War to greatness.\n\nMr. PATRONIS. Mr. Chair, the good gentleman may be the only mechanic  in the Chamber, but I am the one who was…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695161/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…defense budget requests that  didn't even keep pace with inflation.\n\nThe administration cannot afford to make this same mistake. So, this  week, I was encouraged to hear Secretary Hegseth proclaim a ``Trump  buildup'' in the mold of the Reagan buildup that helped end the Cold  War. For the record, my fellow defense appropriators and I have been  ready…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695989/9999"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…either.\n\nYesterday, the U.S. House of Representatives received a detailed  briefing from the administration on Operation Southern Spear. We heard  directly from Secretary Rubio, Secretary Hegseth, and General Caine.  Their message was clear: Narcoterrorists are the single greatest threat  in the Western Hemisphere.\n\nPresident Trump is acting decisively,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698238/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "…defenses. Americans are already building the technology  to meet those threats, and these reforms will help the Pentagon tap  into that energetic innovation ecosystem.\n\nSecretary Hegseth and his staff have been strong partners in these  efforts as we seek to implement our shared peace through strength  agenda with President Trump. Our reforms, plus our…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698257/nominations"}]