[{"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…Newark, New Jersey. They have had radar failures and  repeated flight delays due to serious staffing shortages. This is true  across our country, but what did the Secretary of Transportation, Mr.  Duffy, say? He said: What you see in Newark is going to happen in other  places across the country. My reply: Excuses aren't an answer.\n\nGoing forward, what…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691012/troubling-situation-in-newark"}, {"senator": "Shomari Figures", "party": "Democrat", "sentence": "…to Port Ocean Rail and Truck Jobs Act, as  amended, which was introduced by my colleagues, Representatives  Barrett, Scholten, Bost.\n\nThis legislation requires the Secretary of Transportation to develop  an action plan that identifies supply chain job needs at port,  railroads, and trucking companies in consultation with the Secretaries  of Defense, Veterans…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695017/transitioning-retiring-and-new-service-members-to-port-ocean-rail-and-truck-jobs-act"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…and local  leaders to find creative solutions to this problem, but Federal action  is necessary.\n\nMy bill, the Bridges Not Bumpers Act of 2025, would direct the  Secretary of Transportation to establish a Bridge Strike Working Group  whose work will provide recommendations to prevent future strikes. It  will also create a national clearinghouse to serve…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697851/finding-solutions-to-bridge-strikes"}, {"senator": "Rick Larsen", "party": "Democrat", "sentence": "Mr. Speaker, I rise in support of H.R. 1182, the Compressed Gas  Cylinder Safety and Oversight Improvements Act.\n\nThe bill requires the Secretary of Transportation to advance a  rulemaking to make the standards for foreign manufacturers of  compressed gas cylinders sold in the U.S. the same as standards for the  domestic makers…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692181/compressed-gas-cylinder-safety-and-oversight-improvements-act-of-2025"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…such request and an attestation of actions to date       demonstrating progress toward achieving compliance;\n\n(ii) the Administrator, in consultation with the Secretary       of Transportation, determines additional time is required to       mitigate a significant disruption to air transportation; and\n\n(iii) the Administrator determines the aircraft…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700111/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…illuminated with lights from emergency  responders who were searching the icy waters of a crash site.\n\nAt the airport, I was joined by local leaders and the newly sworn-in  Secretary of Transportation, Sean Duffy. Our conversation that night  was one of many that would then span the course of the following year,  trying to understand how an accident like this…", "date": "2026-01-28", "source_url": "https://justfacts.votesmart.org/public-statement/1699417/9999"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "Mr. EZELL. Mr. Speaker, I move to suspend the rules and pass the bill  (H.R. 2035) to amend title 46, United States Code, to direct the  Secretary of Transportation to ensure that all cargoes procured,  furnished, or financed by the Department of Transportation are  transported on privately-owned commercial vessels of the United…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692187/american-cargo-for-american-ships-act"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…after the       date of the enactment of this section, the Secretary, in       carrying out the program under subsection (b), and in       collaboration with the Secretary of Transportation, the       Administrator of General Services, industry partners,       institutions of higher education, and National Laboratories,       shall support demonstrations…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688938/innovative-mitigation-partnerships-for-asphalt-and-concrete-technologies-act"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…part 148 of title       33, Code of Federal Regulations (as in effect on the date of       enactment of this Act), except as provided in paragraph (2),       to the Secretary of Transportation.\n\n(2) Retention of authority.--The Commandant shall retain       responsibility for authorities pertaining to design,       construction, equipment, and operation…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "…to be a pretty bad Secretary of Defense--nonetheless,  nonetheless, Joe Biden had won the election, and that is who he chose.  When I supported Pete Buttigieg for Secretary of Transportation, I had  higher hopes, but we had a decent working relationship, and I was happy  to have supported him. When I introduced Shalanda Young in the Budget  Committee…", "date": "2025-08-02", "source_url": "https://justfacts.votesmart.org/public-statement/1694711/9999"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "Mr. BARRETT. Mr. Speaker, I move to suspend the rules and pass the  bill (H.R. 3055) to direct the Secretary of Transportation to develop  an action plan on members of the Armed Forces eligible for  preseparation counseling and veterans becoming supply chain employees,  and for other purposes,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695018/transitioning-retiring-and-new-service-members-to-port-ocean-rail-and-truck-jobs-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…billions and billions of dollars into, at the  beginning of this year, I introduced legislation to say that it shall  receive no more Federal funding.\n\nI then joined Secretary of Transportation Sean Duffy at Union Station  in Los Angeles to announce an investigation, an audit, and a compliance  review by the Federal Department of Transportation into California…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…for Californians. Today is  the beginning of the end of high-speed rail, the biggest public  infrastructure disaster in U.S. history.\n\nA few months ago, I joined Secretary of Transportation Sean Duffy in  Los Angeles to announce an investigation and compliance review into the  State's high-speed rail project. Today, the results are in.\n\nThe State, with…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691937/high-speed-rail-in-california"}, {"senator": "Mike Ezell", "party": "Republican", "sentence": "Mr. EZELL. Mr. Speaker, I move to suspend the rules and pass the bill  (H.R. 1182) to require the Secretary of Transportation to promulgate  regulations relating to the approval of foreign manufacturers of  cylinders, and for other purposes.\n\nThe Clerk read the title of the bill.\n\nThe text…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692179/compressed-gas-cylinder-safety-and-oversight-improvements-act-of-2025"}]