[{"senator": "John Larson", "party": "Democrat", "sentence": "…either. It is long overdue that, as an equal branch of  government, we hold the executive branch accountable when they are  taking people's personal data and Social Security information and  exposing it. There is no reason why any 24-year-old, unvetted,  unaccountable person should have access to any American's Social  Security information.\n\nMadam Speaker,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695217/data-collected-by-doge"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…from  every State, demanding that States hand over not just the names of  every voter on the voter rolls but their dates of birth, their voting  history, their Social Security information, and more.\n\nIt was a blatant power grab, long before Elon Musk started tapping  into Federal servers, by the way. It was a blatant power grab which was  responded to:…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690535/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Patty Murray", "party": "Democrat", "sentence": "…Pell grant by over $1,000,  and we said: Absolutely not.\n\nRight now, we are still learning new details about how Trump and his  DOGE flunkies misused Americans' Social Security information and did  untold damage to the Social Security Administration. Every American  should be outraged by the way this administration has tried to sabotage  Social Security,…", "date": "2026-01-30", "source_url": "https://justfacts.votesmart.org/public-statement/1699453/appropriations"}, {"senator": "Zoe Lofgren", "party": "Democrat", "sentence": "…underway at NIST. There is also a provision in the bill that implicates  agencies outside of the Department of Commerce by duplicating the  Department of Homeland Security's information technology supply chain  security programs.\n\nThis Act was included as part of a broader NTIA Reauthorization that  was considered in  the 118th Congress. At the time,…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693613/ntia-policy-and-cybersecurity-coordination-act"}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "…I  don't think we have a right to know--all 535 of us--but there is a  thing called the Gang of 8. They are supposed to be trusted with the  most sensitive national security information, and they were not trusted  with the national security information in realtime. But do you know who  was trusted with that national security information, we think? Oil…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698623/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "…strategic  competitor, a platform to potentially interfere with academic freedom  and free speech as well as greater access to sensitive intellectual  property and national security information.\n\nTo curtail these efforts, H.R. 881 requires the Secretary of Homeland  Security to ensure that U.S. institutions of higher education that have  relationships with…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690827/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Mazie Hirono", "party": "Democrat", "sentence": "…this year, Trump tried to shut down Social Security offices  across the country, making it much harder for recipients of Social  Security benefits to call Social Security, find out the information  they needed, and to access their benefits. So Social Security reversed  course on this I call it lamebrain idea to close some of the offices  when they responded…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696175/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…customer service. Thumb  drives went into our central data computers by DOGE employees, people  who had not been confirmed by any Senate or anything else, and our  Social Security information was captured--captured indeed--on thumb  drives.\n\nDemocrats are going to continue to fight to protect Americans from  having their personal Social Security information…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697187/improving-social-securitys-service-to-victims-of-identity-theft-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…somewhere or made open for the entire internet, which is  full of hackers to access. We must protect the assets of our people and  those who trust this program.\n\nSocial Security information has always been private until now. Social  Security is often the only resource that keeps our seniors out of  poverty. For more than 7 million Americans over the age…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699878/protecting-social-security"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…single day.\n\nI want to be honest about the bill we are debating right now. This is  not a bill of national security. If it were, it wouldn't propose to  make sensitive security information public.\n\nNo, this bill is just Republicans' latest attempt to give the Trump  administration another anti-immigrant tool so that they can continue to  do the fear-mongering…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693072/special-interest-alien-reporting-act-of-2025"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…this bill is not good for national security. That is  plain and simple.\n\nThis bill would require Customs and Border Protection to publish  sensitive detailed national security information on a monthly basis.  This information would give the bad guys around the world real-time  updates on DHS operations and targeting.\n\nLet's be clear. A special interest…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693071/special-interest-alien-reporting-act-of-2025"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "…committee, in consultation with the Secretary, determines       such is appropriate.\n\n(b) Information Sharing.--\n\n(1) In general.--The Secretary of Homeland Security shall       review information relating to terrorism threats to the       United States posed by the use of generative artificial       intelligence for terrorism that is gathered by State…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696919/generative-ai-terrorism-risk-assessment-act"}]