[{"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…economy.       And the island of Haiti, which is only a short distance from       Florida, must be recognized as an important ally to the       United States' national security interests.\n\nOn a personal note, I credit the people of Haiti,       especially as we are coming off of celebrating independence,       for teaching me my earliest lessons in the…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699707/congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…This is not an America First bill. It is a China first bill because  of the void that is being created all across the world. It is in  America's interests, our national security interests and our leadership  interests, to make sure that we are investing in development,  diplomacy, and democracy all across the world.\n\nGreat leaders have recognized that…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693714/relating-to-consideration-of-the-senate-amendment-to-hr-rescissions-act-of-2025"}, {"senator": "Eugene Vindman", "party": "Democrat", "sentence": "…the  free world will grow tired, turn inward, and look away. We cannot let  that happen.\n\nStanding with Ukraine is not charity. It is deterrence and in our  national security interests.\n\nIf we do not stand with Ukraine, eventually American troops will be  forced to fight aggressors in East Asia and Europe.\n\nDeterrence is the key to putting them and…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690211/appeasement-invites-more-aggression"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "…funding to go to U.S.  institutions of higher education that maintain a relationship with  programs and entities in China if the relationship is either in the  national security interests of the United States or has no bearing on  the national security interests of the United States or its allies.\n\nThis is critical, as the bill's language could encompass…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690827/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…transferring advanced U.S. technology  and AI chips.\n\nMr. Speaker, this is corruption, plain and simple.\n\nIt is the prioritization of personal profit over the national  security interests of our country, the country we all love so dearly.\n\nIt is wrong. It is immoral, and my colleagues on the other side of  the aisle say nothing. Worse, some of them defend…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699746/it-is-time-for-the-corruption-to-end"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…self-sustain, and recognizing that good portions  of our energy come from overseas and potentially adversarial countries,  green energy can also help us advance national security interests. As  for my role in this effort, I have focused on supporting federal  programs that help advance these goals.\n\nThese unique energy resilience challenges in remote and…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692645/introduction-of-the-energy-transitions-initiative-authorization-act"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…of signal does cutting support send to the Kremlin? Cutting  off the BSI is a massive gift to Putin.\n\nDeterring a war between Russia and NATO is in our best national  security interests.\n\nMr. Chair, I urge a ``yes'' vote.\n\nMr. AUSTIN SCOTT of Georgia. Mr. Chair, I yield 1\\1/2\\ minutes to the  gentleman from Ohio (Mr. Turner).", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695263/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…have been in wheelchairs, and  physicists who have contributed.\n\nIt is important to leave nobody behind because the education of  everybody is important to our national security interests and our  economic interests.\n\nI am so happy that Mrs. Hayes has raised this in this Special Order  hour, and I thank her for allowing me to participate.", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698944/protecting-education-for-children-with-disabilities"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…China and Russia combined, comprising a significant part of the vast  Pacific Ocean and our Earth's surface.\n\nThe Pacific Islands region remains critical to our national security  interests in the Indo-Pacific and advises greater U.S. engagement to  advance our shared interests and values, particularly in the context of  growing geopolitical competition…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694767/supporting-the-partner-act"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…China and Russia combined, comprising a significant part of the vast  Pacific Ocean and our Earth's surface.\n\nThe Pacific Islands region remains critical to our national security  interests in the Indo-Pacific and advises greater U.S. engagement to  advance our shared interests and values, particularly in the context of  growing geopolitical competition…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693376/introduction-of-the-pacific-partnership-act"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…Between the United States and  the Chinese Communist Party. Last Congress, the committee released a  bipartisan report on maintaining America's economic and national  security interests. The report found that the widespread adoption of  certain People's Republic of China-developed technologies in the United  States poses a significant risk to national…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690264/foreign-adversary-communications-transparency-act"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…precarious  situation in a land a stone's throw away from our shores, is to  reauthorize these programs.\n\nPresident Trump has lifted up the need to fortify economic and  security interests in our hemisphere, and I can think of no better way  to buoy these interests than support the bipartisan HOPE/HEALTH  programs.\n\nMs. MOORE of Wisconsin. These programs…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698854/haiti-economic-lift-program-extension-act"}, {"senator": "Kelly Morrison", "party": "Democrat", "sentence": "…opportunities for small businesses to  participate in research and development opportunities at DOE and its  national laboratories.\n\nIt is in our economic and national security interests for the United  States to remain a leader in R&D and technological advancement. In  order to maximize our impact, we must tap into talent wherever we can  find it. Too…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687910/doe-and-sba-research-act"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…Iran Sanctions Act of 2025 would send an  important message about Congress' role in the conduct of U.S. foreign  policy toward Iran and, in sum, serves American national security  interests.\n\nMr. Speaker, this bill sends a clear signal that the United States  will continue to use every tool at its disposal necessary to prevent  Iran from obtaining a nuclear…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690687/solidify-iran-sanctions-act-of-2025"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…such group of Members of Congress  dedicated to this dynamic and diverse part of the world. We believe  that the Pacific Islands region remains critical to our national  security interests in the Indo-Pacific which advises greater U.S.  engagement with this region to advance our shared interests and values,  particularly in the context of growing geopolitical…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693346/introduction-of-the-blue-pacific-act"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…interim authorities  start exporting black market oil again, to keep themselves in power,  unaccountable not only to their own people but to America's vital  national security interests?\n\nI will say I don't think so. I don't think our Democratic colleagues  want to let Venezuela start exporting black market oil again. I believe  they were genuine years…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698556/venezuela"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…the AGOA Extension  Act, legislation to reauthorize the African Growth and Opportunity Act  trade preference program.\n\nOur Nation's economic, strategic, and national security interests are  front and center in AGOA. Think about it: This program strengthens our  critical supply chains and helps us counter the harmful global  influence of nations like…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698908/agoa-extension-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…sector entities based in trusted countries can enhance the       United States economic strength, policies regarding foreign       direct investment should reflect security interests and       should not disadvantage domestic investors or companies;\n\n(5) United States efforts to attract foreign direct       investment from responsible private-sector…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692697/global-investment-in-american-jobs-act-of-2025"}, {"senator": "Mario Diaz-Balart", "party": "Republican", "sentence": "…State the tools and leverage to  demand much-needed reforms.\n\nThese are historic changes, and this approach, again, protects  American taxpayers but also the national security interests of the  United States.\n\nMadam Speaker, we would not be here debating this if it wasn't for  the brilliant, persistent leadership of the full committee chairman. A  lot…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699572/consolidated-appropriations-act-2026"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…to this  misguided amendment.\n\nThe longstanding U.S. military investment for the independent  Lebanese Armed Forces, also known as the LAF, has worked to support  U.S. security interests in the Middle East for close to 20 years.\n\nAs co-chair of the U.S.-Lebanon Friendship Caucus and a member of the  House Intelligence Committee, I work closely with the…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693688/department-of-defense-appropriations-act-2026"}, {"senator": "Donald Bacon", "party": "Republican", "sentence": "…Ukrainians have suffered for decades and  centuries under Russia. Four million Ukrainians were killed alone in  the 1930s purposefully.\n\nA Ukrainian victory is in our national security interests. A thriving  Ukraine that is a democracy with free markets is in our national  security interests. If Ukraine falls, then you can assume that Moldova,  Georgia, and others…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695259/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Mario Diaz-Balart", "party": "Republican", "sentence": "…opposing  our enemies, although that is a big part of it. It means supporting and  standing with our allies, with our friends, who can be a force  multiplier in our national security interests.\n\nThat is why this bill acknowledges our friends and provides robust  assistance for allies, partners like Israel, Egypt, Jordan, Taiwan, and  the Philippines, to name…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699051/financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…in  global, industry-led standards bodies.\n\nWithout participation by U.S. agencies and companies, we allow our  adversaries to pursue their own economic and national security  interests unchecked and the opportunity to lead in the development of  standards for the next generation of wireless technology.\n\nAlready, we are hearing about the Chinese Communist…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693509/promoting-united-states-wireless-leadership-act-of-2025"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…Committee on Foreign Relations of the Senate not later than       15 days before such waiver is to take effect that the waiver       is crucial to the national security interests of the United       States.\n\n(g) Exception Relating to Importation of Goods.--\n\n(1) In general.--The authorities and requirements to impose       sanctions authorized…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692720/sanction-sea-pirates-act-of-2025"}, {"senator": "James Risch", "party": "Republican", "sentence": "…million.\n\nThe proposed sale is consistent with U.S. law and policy as       expressed in Public Law 96-8.\n\nThis proposed sale serves U.S. national, economic, and       security interests by supporting the recipient's continuing       efforts to modernize its armed forces and to maintain a       credible defensive capability. The proposed sale will help…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696897/arms-sales-notification"}, {"senator": "James Risch", "party": "Republican", "sentence": "…confirmed what we have known all  along: The Iran nuclear program is not civilian, as they claim; it is  the pursuit of a bomb to destroy Israel and threaten U.S. national  security interests in the region.\n\nThe international community must not tolerate this activity any  longer. The decision to initiate the snapback process is only the  beginning. The U.N.…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694081/9999"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Hemisphere is America's backyard. It is also why I am  pleased that the recently released National Security Strategy reasserts  the Monroe Doctrine with current American security interests.\n\nUnder the National Security Strategy, the United States will enlist  allies in the Western Hemisphere to partner in controlling migration,  halting drug trafficking,…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698884/successful-operation-to-arrest-nicolas-maduro"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…killing our families. I can't  think of a greater security concern than this. The President has  effectively and appropriately promoted and defended America's economic  and security interests by the use of tariffs.\n\nToday, Mr. Speaker, as a result, we have a lower trade deficit than  we have had since 2009. By the way, the top 20 economies in the world  that…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699974/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…ban which elevated the United States as the  premier global oil producing nation.\n\nThis bill will similarly allow our vast natural resources to advance  our national security interests.\n\nMr. Speaker, I urge my colleagues to support this legislation, and I  thank my friend, the chairman of the committee, for bringing forth this  bill.", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697081/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…will not expire on some arbitrary date.  The only way to make U.S. sanctions go away is to stop the sanctionable  conduct and not threaten the United States' national security interests  or our allies, period.\n\nThe fact that we are considering this bill under suspension of rules  is hugely significant. It shows that eliminating this sunset is not a…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690688/solidify-iran-sanctions-act-of-2025"}]