[{"senator": "Mark Warner", "party": "Democrat", "sentence": "…for  Americans and Australians alike. Ambassador Rudd spearheaded  Australia's push to advance the landmark AUKUS security pact, expanding  the broad bipartisan support and securing the endorsements of both  President Biden and President Trump and advancing investment in  limitation strategies both here in the United States and back in his  home in Australia.…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699544/9999"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…success and vitality of the United  States of America.\n\nLet me be clear, Mr. Speaker, so there is no misrepresentation. House  Democrats understand the importance and urgency of securing the border.  We believe that our immigration system is broken and that it should be  fixed in a comprehensive and bipartisan way. So many leaders in that  effort with so many…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…the same time, multiple dark money groups also worked to       elect Trump, and the flow of money increased substantially in       the final months of the election cycle. Securing American       Greatness, after its incorporation in March 2024, spent more       than $81 million, about $67 million of which went to super       PACs.\n\nAnother major supporter…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699084/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "…project and  begin delivering clean, reliable water to rural communities.\n\nMy Democratic colleagues and I are committed to addressing the  barrier that rural communities face in securing clean water. That is  why we passed historic water infrastructure investments under the  Infrastructure Investment and Jobs Act and the Inflation Reduction Act.\n\nSince 2022,…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693877/finish-the-arkansas-valley-conduit-act"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…emerge with criminal records directly tied to their  exploitation. These records follow them along their path long after  they are free, preventing them from finding a job, securing safe  housing, pursuing education, or even getting treatment for the trauma  that they have escaped.\n\nThe barriers they face as a result of their records often serve as  painful…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697180/trafficking-survivors-relief-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…could have been done by simply providing more  resources, more cops on the streets with the equipment that they need  to accomplish the same thing.\n\nWe are not talking about securing our borders. We are not talking  about nullification of Federal law. We are talking about overreach and  possible overuse, contrary to the spirit of our Federal system of…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696297/9999"}, {"senator": "Chellie Pingree", "party": "Democrat", "sentence": "…public policy. He skillfully facilitated a  pause on federal whale regulations and continuously explored  opportunities to protect Maine's heritage lobster industry, while  securing funding for broader fisheries and marine mammal research.  Further, he helped steer Maine's fisheries and marine economy through  crisis during the pandemic.\n\nPat embodies…", "date": "2026-02-20", "source_url": "https://justfacts.votesmart.org/public-statement/1700092/recognizing-patrick-keliher"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…pre-trial system that relies on regular check-ins,       targeted social-service referrals, and text message reminders       consistently outperforms cash bail systems at securing       appearance and protecting public safety. Maintaining housing,       employment, child-care, and medical care substantially       reduces recidivism and promotes community…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696949/opposition-letter-led-by-the-american-civil-liberties-union-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Derek Tran", "party": "Democrat", "sentence": "…Act.\n\nFar too often, bureaucratic barriers and complex government jargon  prevent small business owners, especially veterans and immigrant  entrepreneurs, from accessing and securing Federal contracting  opportunities.\n\nI consistently hear from small business owners in Orange County that  the main reason they do not apply for Federal contracts is that…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691852/plain-language-in-contracting-act"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…see its budget reduced by that bill.\n\nThe Office of Defense Nuclear Nonproliferation is involved in  critical nuclear security work, which is actively keeping us safe, from  securing nuclear material worldwide to verifying that other countries  and various rogue actors are not developing nuclear weapons.\n\nIt would be nice if we lived in a world where a…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694866/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "…manufacturing, uses forced labor, and manipulates its currency.\n\nWe cannot cede our leadership to China or any other country. This  also means investing in advanced manufacturing, securing domestic  battery supply chains, and protecting the Inflation Reduction Act's  historic EV investments.\n\nCalifornia's Advanced Clean Cars II program would impose EV sales…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690490/providing-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-advanced-clean-cars-ii-waiver-of-preemption-notice-of-decision"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…regular families, we just don't seem to have the time. We  could be doing that here on the floor now. This is a marvelous bill we  are passing today, but I would much rather be securing the time for  that purpose.\n\nThose hikes in healthcare premiums are not isolated, Mr. Speaker.  They come on the heels of the One Big Beautiful Bill Act that slashed  more…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697171/hospital-inpatient-services-modernization-act"}, {"senator": "Judy Chu", "party": "Democrat", "sentence": "…they were just starting  out. SBICs fill a gap in the investment ecosystem and level the playing  field for the smallest businesses which often face the highest barriers  to securing investments from traditional private investors.\n\nThe nearly 319 certified SBICs in operation today have invested or  committed over $38 billion in small businesses nationwide.…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687919/investing-in-main-street-act-of-2025"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…be  instrumental in the continued restoration of the Woodbrook Superfund  Site, and associated conservation efforts throughout the area. Dorothy  played a pivotal role in securing grants from Sustainable Jersey and  the National Park Service, including twenty-five thousand dollars to  provide composters to residents. In 2015, Dorothy was named a  Sustainability…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698050/recognizing-dorothy-giamboi-for-nearly-fifteen-years-of-public-service"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…suspect telecommunications  equipment and infrastructure across the African Continent. The  assessment required in this bill is an important step to understand the  cost of securing the connection between the United States and our  African allies and how best to ensure a critical global communications  channel is protected from the prying eyes of our…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692700/assessment-of-trans-atlantic-submarine-fiber-optic-cable"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…remembering  the American people, exactly what we told them, and why they elected  us. To do all of that, it takes resources, particularly the one that  focuses in our committee on securing the border.\n\nIt takes resources, and the reason we need so many resources to  secure the border is because the previous administration screwed  everything up so badly. Day…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688069/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…Speaker, last night, the Rules Committee met and  reported out a rule providing for consideration of three measures.\n\nThe rule provides for consideration of H.R. 3617, the Securing  America's Critical Minerals Supply Act, under a closed rule, with 1  hour of debate equally divided and controlled by the chair and ranking  minority member of the Committee…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699905/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Andy Biggs", "party": "Republican", "sentence": "…environmental quality. Under the Biden administration,  routine water projects became regulatory nightmares with EPA  restrictions untailored to Arizona's desert reality.\n\nSecuring permits often means chaotic delays from Federal  bureaucracies, even to access water on lands the Federal Government  controls, which is over 80 percent of Arizona. With only…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698020/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…volunteering for Gulf Middle School since  2016. She has helped with the school's tutoring program, volunteers  weekly in the free school store (the Treasure Chest), helped with  securing English as a Second Language tutors for Gulf Middle School  families, and coordinated a free weekly meal to serve families and the  community. Mary has also been a big supporter…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691273/recognizing-mary-miller"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…because this administration and those of us who  have stood up to fight and expose this are seeing to it that we are  removing people from this country who should be removed, securing the  border so that people aren't flowing across it, standing with law  enforcement, securing our communities, backing the blue, restoring  safety and security, not just in…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695719/highlighting-flawed-policies"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…the  American people know that the bill that we will be voting on today  reduces taxes, creating jobs.\n\nIt is the elimination of taxes on tips and overtime. It provides for  securing the border. It provides for energy independence. It provides  for the ability to have peace through strength. All of this is in the  bill.\n\nOn compassion, it is not compassion…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693234/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "John Rose", "party": "Republican", "sentence": "Mr. ROSE. Mr. Speaker, I rise in strong support of the SAVE America  Act because nothing matters more than securing our elections. Our  Republic depends on it.\n\nFree, fair, and honest elections unmoored by fraud or suspicion are  fundamental to our constitutional Republic. The right of…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700015/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…speak more on these  later.\n\nThis week, we are seeing great progress in getting our reconciliation  package to the next step. The efforts seek to serve Americans better by  securing our border, supporting our economy, bolstering domestic energy  production, maintaining a pro-family and pro-growth Tax Code, and much,  much more.\n\nI thank each Member involved…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689152/advancing-america-first-policies"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "Mr. BEGICH. Mr. Speaker, I rise today to highlight an issue of  national importance: Our commitment to space exploration and Alaska's  vital role in securing America's presence in space.\n\nSpace exploration drives innovation, strengthens our economy, and  enhances national security. The investments we make today will shape  our…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687923/space-dominance"}, {"senator": "Juan Ciscomani", "party": "Republican", "sentence": "…Mr. Speaker, I rise today to congratulate Buena High  School Colts relay team on a remarkable achievement, winning the All- State Title in the 4 by 400 relay race.\n\nAfter securing the Division II last year, they faced off against top  schools from across the State and came out victorious and took the top  honor, adding yet another trophy to their cabinet.…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691459/recognizing-empire-high-schools-softball-team"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…miners, engineers, and       support staff across Montana.\n\nA stable, domestic fuel source that lowers electricity       costs for manufacturers and keeps Montana competitive.\n\nSecuring a domestic fuel source to supply affordable       baseload power during a period of unprecedented electricity       demand growth and ballooning projected future development.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694888/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…prioritize public safety by supporting law enforcement and  stopping the flow of fentanyl into our communities. We advance American  strength by unleashing energy dominance, securing critical minerals,  and investing in nuclear power. We uphold stewardship by protecting  public lands, supporting wildland firefighters, ensuring responsible  resource management,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698749/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…well as  those affected in the months following the October 7 attacks.\n\nMy House Republican colleagues and I are grateful to President Trump  and Prime Minister Netanyahu for securing the recent ceasefire  agreement which has led to Hamas releasing American and Israeli  hostages. As we remember this day, we are more motivated than ever to  stand with Israel…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688138/promoting-stability-and-prosperity"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…choices. History will remember those who chose not to leave  this enormous bill to their children.\n\nVote yes on this plan. Vote yes on restoring fiscal sanity. Vote yes  on securing the future for our country.                               159, S. Con. Res.  22.", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695544/setting-forth-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2026-and-setting-forth-the-appropriate-budgetary-levels"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…approximately 150  permanently displaced residents, they implemented a housing eligibility  process, with the intent of ensuring fair and transparent allocation of  resources. By securing placements at facilities like Pasco Hope, the  team supported individuals and families along a pathway to rebuild  their lives. Between September 28 and October 18, 2024,…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691008/recognizing-kyle-smith"}]