[{"senator": "Betty McCollum", "party": "Democrat", "sentence": "…let me tell you a bit about what these three bills  would do. H.R. 3633, which Republicans are calling the CLARITY Act,  would carve the crypto industry out from current securities laws and  regulations. This would continue to expose consumers to harmful crypto  practices. Additionally, the CLARITY Act would not only enable  conflicts of interest from…", "date": "2025-07-25", "source_url": "https://justfacts.votesmart.org/public-statement/1694254/9999"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…of my committee have  passed reforms to the Committee on Foreign Investment in the United  States, updated our anti-money-laundering bills, and made numerous  changes to securities and consumer protection laws on the NDAA.\n\nThis year, Speaker Johnson cut a deal with his Freedom Caucus members  to insert a ban on the U.S. from researching how to create…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695151/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "Mr. Speaker, this bill requires the SEC to study the costs  encountered by small- and medium-sized companies when undertaking the  initial public offering of their securities to the public, otherwise  known as IPO, as well as certain other offerings that are exempt from  SEC registration.\n\nWhen going public, companies tend to hire underwriters,…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693906/middle-market-ipo-cost-act"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…the industry, including  the President's own meme coin schemes, completely unregulated.\n\nSecondly, the CLARITY Act also lacks the basic investor protections  present in the securities laws. For example, firms are not required to  serve the best interests of their investors or to separate critical  market functions and many other basic protections.\n\nNow,…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693779/digital-asset-market-clarity-act-of-2025"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…justice everywhere, that when you have a President that  so exceeds his constitutional authority, that he begins to do things to  infringe upon the fundamental rights and securities of other Americans,  it is a threat to all Americans.\n\nThis is why right across the way--I can almost see it looking through  these windows--why the Supreme Court, with nominees…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692454/alex-padilla"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…allows startups  to discuss their products and business plans at certain events known as  demo days without such discussions counting as a general solicitation  under our securities regulations and, therefore, as an investment  offering necessitating SEC registration.\n\nSecond, it defines what an angel investor is for purposes of security  laws. Angel…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692724/helping-angels-lead-our-startups-act-of-2025"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…prosperous communities for the long term.\n\nThe United States, as the largest donor to the IDA, helps to direct  where and how these funds are used. My bill would exempt IDA securities  from Securities and Exchange Commission regulations, just as other  World Bank arms have been exempt for decades. This ensures that the IDA  can continue raising capital…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693972/aligning-sec-regulations-for-the-world-banks-international-development-association-act"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…host events to  promote capital-raising options for small businesses.\n\nHer bill would also require the Small Business Office to coordinate  on an annual basis with State securities commissions to ensure both  Federal and State regulators are working as effectively and efficiently  as possible to address the needs of small businesses.\n\nMr. Speaker, I…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692705/promoting-opportunities-for-non-traditional-capital-formation-act"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…crypto exchange-traded funds, or ETFs.\n\nAll of this comes at the same time that the Trump administration has  taken away the independence of the financial regulators like the  Securities and Exchange Commission.\n\nHe issued Executive Order 14255 which now requires all rules written  by the financial regulators to be reviewed and approved by the White  House…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693777/digital-asset-market-clarity-act-of-2025"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…events to promote capital-raising  options for these underrepresented small businesses. My bill would also  require the Office to meet annually with representatives of State  securities commissions to ensure that there is a whole-of-government  approach to addressing the unique needs of underrepresented businesses.\n\nThe North American Securities Administrators…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692704/promoting-opportunities-for-non-traditional-capital-formation-act"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…companies that can qualify as a well-known seasoned  issuer, or WKSI. This designation is a special status conferred on  companies that frequently raise money by issuing securities from the  public.\n\nThink of WKSI status like having frequent-flyer privileges. It allows  companies that are well known to regulators and the public to raise  money without…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697268/expanding-wksi-eligibility-act"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…expense ratios of mutual funds.\n\nThis bipartisan bill, H.R. 2225, the Access to Small Business  Investor Capital Act, makes a narrow technical correction of the  Federal securities rules that had a major unintended consequence over  the last two decades.\n\nIn 1980, Congress created Business Development Companies to  facilitate capital formation and get…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692711/access-to-small-business-investor-capital-act"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…Mr. Speaker, this is important to me because, as someone who has  spent my career trying to uphold the rule of law, I turned down Wall  Street to begin my career at the Securities and Exchange Commission to  crack down on corporate fraud, exactly the type that Donald Trump and  many of his allies are committing right now, such as securities fraud,…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690818/gross-violations-of-law-by-trump-administration"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "…investors like  putting their money in them. They are the envy of the world because we  provide robust investor protections when people put their money in  them, because of the Securities and Exchange Commission. Yet, the  CLARITY Act would allow companies to raise up to $200 million over 4  years without any disclosure and without any transparency, just by…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693785/digital-asset-market-clarity-act-of-2025"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…you are rich today.\n\nI rise in support of this bill. The accredited investor framework has  long protected the general public from investing in high-risk, illiquid  private securities. Unlike our public capital markets, in the private  capital markets, companies don't provide anywhere near the same  financial and other disclosures to investors. There are…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692775/fair-investment-opportunities-for-professional-experts-act"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "Mr. DAVIDSON. Mr. Speaker, I move to suspend the rules and pass the  bill (H.R. 4429) to require the Securities and Exchange Commission to  revise the definition of a qualifying investment, for purposes of the  exemption from registration for venture capital fund advisers under the…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697191/developing-and-empowering-our-aspiring-leaders-act-of-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "Mr. HILL of Arkansas. Mr. Speaker, I move to suspend the rules and  pass the bill (H.R. 1469) to create an interdivisional taskforce at the  Securities and Exchange Commission for senior investors, as amended.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:                                 H.R.…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693935/national-senior-investor-initiative-act-of-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…institution from other Federal Government agencies or public       sources to minimize information requests of such applicants;       and\n\n(C) in consultation with the Securities and Exchange       Commission, review how de novo regulated institutions raise       capital while maintaining investor protections, including the       impact of--\n\n(i)…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "Mr. DOWNING. Mr. Speaker, I move to suspend the rules and pass the  bill (H.R. 3422) to amend the Securities Exchange Act of 1934 to  require the Advocate for Small Business Capital Formation to provide  educational resources and host events to promote capital raising  options for…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692706/promoting-opportunities-for-non-traditional-capital-formation-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…enactment of this Act, the Secretary of the Treasury, in       consultation with the Chairman of the Board of Governors of       the Federal Reserve System, the Chairman of the Securities       and Exchange Commission, the Chairman of the Commodity       Futures Trading Commission, and the Secretary of State, shall       conduct a study and issue a report…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694119/china-financial-threat-mitigation-act-of-2025"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…required by paragraph (1), the       Advocate for Small Business Capital Formation and the       Investor Advocate shall have authority to--          (A) obtain from the Securities and Exchange Commission       (in this section referred to as the ``Commission'') and       utilize any       data or information necessary to carry out the study;…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697244/improving-capital-allocation-for-newcomers-act-of-2025"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "Mrs. WAGNER. Mr. Speaker, I move to suspend the rules and pass the  bill (H.R. 3381) to amend the Securities Act of 1933 to expand the  ability to use testing the waters and confidential draft registration  submissions, and for other purposes, as amended.\n\nThe Clerk read the title…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692737/encouraging-public-offerings-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…the Nuclear Regulatory Commission, the       Occupational Safety and Health Review Commission, the Office       of Compliance, the Postal Regulatory Commission, the       Securities and Exchange Commission, the Securities Investor       Protection Corporation, the Environmental Protection Agency,       the Small Business Administration, the Federal Housing…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697203/count-the-crimes-to-cut-act"}, {"senator": "Brian Jack", "party": "Republican", "sentence": "…shall be in       order to consider in the House the bill (H.R. 3633) to       provide for a system of regulation of the offer and sale of       digital commodities by the Securities and Exchange Commission       and the Commodity Futures Trading Commission, and for other       purposes. All points of order against consideration of the       bill are…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693544/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "Mrs. WAGNER. Mr. Speaker, I move to suspend the rules and pass the  bill (H.R. 3394) to amend the Securities Act of 1933 to codify certain  qualifications of individuals as accredited investors for purposes of  the securities laws, as amended.\n\nThe Clerk read the title of the bill.…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692776/fair-investment-opportunities-for-professional-experts-act"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…designed to reinforce and enhance our  safeguards protecting senior investors from financial fraud and abuse.\n\nH.R. 1469 creates the senior investor task force within the  Securities and Exchange Commission which is tasked with reporting on  industry trends and challenges impacting investors over the age of 65.  The task force will also make recommendations…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693936/national-senior-investor-initiative-act-of-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Financial Stability Board.\n\n(4) The Basel Committee on Banking Supervision.\n\n(5) The International Association of Insurance Supervisors.\n\n(6) The International Organization of Securities       Commissions.\n\n(b) Policy Advancement.--The Secretary of the Treasury, the       Board of Governors of the Federal Reserve System, and the       Securities and Exchange…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699846/pressure-regulatory-organizations-to-end-chinese-threats-to-taiwan-act"}, {"senator": "Mark Messmer", "party": "Republican", "sentence": "…best  and brightest minds in the industry have picked up and left for other  countries.\n\nThe CLARITY Act finally establishes distinct jurisdictional  boundaries between the Securities and Exchange Commission and the  Commodity Futures Trading Commission, while also creating guardrails to  incentivize and safeguard investment.\n\nThe bill not only expands…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693781/digital-asset-market-clarity-act-of-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…cited as the ``Middle Market IPO Cost       Act''.       SEC. 2. STUDY ON IPO FEES.\n\n(a) Study.--The Comptroller General of the United States,       in consultation with the Securities and Exchange Commission       and the Financial Industry Regulatory Authority, shall carry       out a study of the costs associated with small- and medium-      sized companies…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693907/middle-market-ipo-cost-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…methods to determine whether an individual       seeking to be certified as an accredited investor       demonstrates competency with respect to--\n\n(i) the different types of securities;\n\n(ii) the disclosure requirements under the securities laws       applicable to issuers and offerings of securities exempt from       registration under section 5 of the…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693888/equal-opportunity-for-all-investors-act-of-2025"}]