[{"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…need to be told as it relates to the veterans  in this country, and there are stories that need to be told as it  relates to law-abiding immigrant families.\n\nWe have to secure our border. We believe that we have a broken  immigration system that should be fixed in a comprehensive and  bipartisan way, but we must also stand up for Dreamers and farmworkers…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…parents.\n\nMr. Speaker, what are we doing here?\n\nI am a member of the Committee on Homeland Security, and under the  Biden administration, I pushed for more resources to secure the border.  I know that we need to enforce immigration laws, but not like this.\n\nThey are sending masked agents into American neighborhoods. They are  beating people in the streets.…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699355/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Mike Levin", "party": "Democrat", "sentence": "…resources to remove dangerous individuals, not those  contributing positively to our society and to our economy, not people  like Nelson and Gladys Gonzalez.\n\nI am all for a secure border, but what we are seeing today is not the  America that I know.", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690924/recognizing-gladys-and-nelson-gonzalez"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…the American people want us to confront.\n\nFrom the very beginning of this Congress, Democrats have said: We  will work with anyone to lower the high cost of living, to secure the  border, to fix our broken immigration system, to protect communities,  to stand up for the healthcare, for the safety, for the well-being, and  for the national security of…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690933/gulf-of-america-act"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…beyond what has been  incredibly partisan rhetoric about the immigration issue. The reason we  have the opportunity is because there is now bipartisan agreement about  a secure border. There is now bipartisan agreement about deporting  criminals.\n\nIsn't it time for us to have the discussion about legal ways to have  an immigration policy that is safe…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700023/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…Chairman, I rise today in support of the House's fiscal year 2025  budget resolution, which is a critical step needed to unlock a  reconciliation bill that is going to help secure our border and  revitalize our military. It is going to unleash American energy  independence and extend tax cuts for American families and small  businesses.\n\nSimply put, this…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688038/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…on the table.\n\nPresident Trump and House Republicans are fulfilling the mandate  given by the American people to restore economic prosperity, support  small businesses, secure our border, unleash American energy, invest in  rural America, and the list goes on.\n\nThis legislation cuts taxes on hardworking Americans, lowers energy  costs, brings jobs home,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694793/promises-made-promises-kept"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…this resolution fails. That is what is at stake.\n\nWe do a lot of other things that we will open up the door to go do in  reconciliation by passing this resolution. We secure America's border.  Now, again, this was a major issue on the campaign, and I know the  folks on the other side want an open border. Thank God President Trump  won and followed through…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689896/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…deliver on the agenda of President Donald  Trump. Again, it is Donald Trump promises made promises kept.\n\nThis budget resolution provides a framework for Congress to secure  the border, unleash American energy, prevent the largest tax hike in  history, create jobs, and bring common sense back to the government.  Unnecessary and wasteful government spending…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688088/republican-budget"}, {"senator": "John Rose", "party": "Republican", "sentence": "…thing the President  needed to accomplish this was leadership. We heard the last  administration claim time and time again that Congress would need to  pass legislation to secure the border. We heard a blank check would end  the unprecedented illegal immigration happening at our southern border.  Yet, last month, President Trump's Border Patrol reported…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690428/the-first-100-days"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…border.\n\nUnder President Biden, criminals, terrorists, and traffickers were  flowing across that border, but because President Trump on day one took  Executive action to secure that border, illegal crossings are at their  lowest level in decades. This is something the American people wanted  to see done.\n\nIn March, those crossings were down 95 percent from…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690548/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…the lowest poverty rates  in recorded history.\n\nThis bill also equips our troops and law enforcement, Mr. Speaker, to  defend our sovereignty, protect our citizens, and secure our border  after years of neglect and lawlessness.\n\nWhile more work remains no doubt to rein in Washington's out-of- control spending and put our Nation on a more sustainable fiscal…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693192/one-big-beautiful-bill-act"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…who face the threat of abuse, trafficking, and sexual  exploitation.\n\nThankfully, after 4 years of failure under the Biden administration,  President Trump is working to secure our border, to protect our  communities, and to bring human trafficking to an end. And there is so  much more that Congress can do to support this effort.\n\nLast week, I introduced…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688161/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…process of getting this  over the finish line.\n\nThis bill will deliver on our conservative agenda and make positive  changes that we know that Americans want. From a more secure border to  stronger domestic energy resources, to more efficient Federal programs,  to a tax code that supports families and businesses, this is a once-in- a-generation moment,…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690787/big-beautiful-bill"}, {"senator": "Mark Alford", "party": "Republican", "sentence": "…hasn't happened in years, and it sends a clear, powerful message  back home that the House is back at work. We are back to governing.\n\nThese bills strengthen our military, secure our border, invest in  health and workforce readiness, modernize transportation, and deliver  real savings for taxpayers.\n\nIt is peace through strength. This Homeland bill makes…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699347/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Eric Schmitt", "party": "Republican", "sentence": "…opposed to that? Because they want people who  shouldn't be able to vote--illegal immigrants or fraudsters--to vote  for them. That is the truth.\n\nSo we have now the most secure border in the history of our country,  and we are trying to execute on the immigration laws that we have on  the books that have been voted for by Republicans and Democrats alike,…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700065/9999"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…Dan Bishop, the SUE for  Immigration Enforcement Act, which was included in the Laken Riley Act.  It will allow us to sue the government in the future when they fail to  secure the border, a monumental change in allowing States to defend  themselves against the abuses that we saw under Biden and Mayorkas.\n\nSpeaking of the border, perhaps the most comprehensive…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697130/congress-is-back"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…across the country and spur economic growth. Our  bill is the most proworker, profamily legislation Congress has seen in  a generation.\n\nThe one big, beautiful bill will secure the border once and for all  and make America safe again. The border was the number one issue on the  campaign trail, and President Trump and his administration have made  historic…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691527/one-big-beautiful-bill"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…ridiculous subsidizing, enriching the  Chinese and enriching billion-dollar corporations, and undermining our  energy security.\n\nDo we have the resources necessary to secure the border and the fees  to pay for it? Are we putting in the provisions that we ought to be  putting in there to guarantee that we are going to have the President  be able to carry…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690594/fiscal-responsibility"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "Mr. McCLINTOCK. Mr. Speaker, this bill fulfills many of the promises  we made to the American people: lower taxes, lighter regulations, a  secure border, more frugal spending, and a war on waste. Throughout  history, these are the policies that have produced prosperity and  security, and there is every reason to believe…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693165/one-big-beautiful-bill-act"}]