[{"senator": "Maxine Waters", "party": "Democrat", "sentence": "…use the internet. Trump has put these plans on hold for  now, but we know this administration will continue to make life harder  for seniors.\n\nNow Trump is adding Social Security numbers to the Social Security  death list to force immigrants to leave the country. People who have  their Social Security numbers placed on the death list by mistake can  have…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690919/protecting-americans-from-harmful-crypto-practices"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…millions of Americans. I wish we were here on the floor preventing  Mr. Musk from getting our personal health records, our consumer data,  our business records, our Social Security numbers, and our tax data.\n\nAfter we pass this bill, I hope that the Financial Services Committee  would investigate what has happened to consumer protection and what has  happened…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692804/homebuyers-privacy-protection-act"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…15 million illegal aliens who have come here and we have evidence that  they are participating in our elections.\n\nThe next thing you will say is: Did they get Social Security numbers?  Mr. Speaker, they did. The DOGE team just announced millions of  illegals now have Social Security numbers. It is happening, and it ends  today when we vote on the SAVE…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1689995/safeguard-american-voter-eligibility-act"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "…administration, more than 1 million  illegal aliens received Medicaid benefits.\n\nFact number two, in fiscal year 2024 alone, over 2 million illegal  aliens were given Social Security numbers.\n\nFact number three, a 2023 study showed that the net cost of illegal  aliens to the American taxpayer was at least $150 billion annually.\n\nFact number four, States are…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690711/outrageous-government-funded-incentives"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…amendment made by subsection (a)       shall take effect 180 days after the date of enactment of       this Act.\n\nMr. Speaker, in recent years, the theft and misuse of Social Security  numbers has become a very serious problem in our country. In 2024  alone, there were over 3,000 reported data breaches, and over half of  them included compromised Social Security…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697186/improving-social-securitys-service-to-victims-of-identity-theft-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…Missouri. Mr. Speaker, I move to suspend the rules and  pass the bill (H.R. 5348) to amend title II of the Social Security Act  to provide for the reissuance of social security account numbers to  young children in cases where confidentiality has been compromised, as  amended.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697263/social-security-child-protection-act-of-2025"}, {"senator": "David Kustoff", "party": "Republican", "sentence": "…gain access to  sensitive information. Just last year, there were over 3,000 separate  data breaches that were reported, including many leaks involving stolen  Social Security numbers.\n\nCurrently, when somebody has their identity stolen, they have got to  navigate a baffling process at the Social Security Administration. The  Ways and Means Committee…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697188/improving-social-securitys-service-to-victims-of-identity-theft-act"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…about kids. But remember, every child  receives a Social Security number that follows them around for the rest  of their life. Every year, there are kids whose Social Security numbers  are lost or stolen in the mail and exposed to fraudsters.\n\nBecause children don't open bank accounts, they don't apply for lines  of credit, and they don't seek employment,…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697265/social-security-child-protection-act-of-2025"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…falsified information.\n\nIn 2023, $21 billion in subsidies were paid out with no evidence of  tax reconciliation. Taxpayers were left footing the bill, as reused  Social Security numbers, subsidies paid on behalf of deceased  individuals, and billions in unreconciled payments expose a system  unable to protect public funds.\n\nIn the Working Families Tax…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698431/republicans-have-delivered-in-2025"}, {"senator": "Mike Haridopolos", "party": "Republican", "sentence": "…approved and received taxpayer  subsidies directly to insurance companies. The GAO even reported that  they were not required to provide documentation, such as Social  Security numbers or income verification. It was money sent directly to  insurance companies from taxpayers.\n\nDemocrats said healthcare would be affordable, yet since the  implementation…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698796/breaking-the-gridlock-act"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…found out that dead people were getting  ObamaCare subsidies. The Democrats don't care about any of that.\n\nThat is insulting to taxpayers.\n\nMr. President, 58,000 Social Security numbers that were linked to  death records were used to receive subsidies. More than 7,000 Social  Security numbers were used in enrollments after the date of that  person's death,…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697878/healthcare"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…submitted. However, we did not submit documentation.''\n\nIn two cases, brokers called the ObamaCare help center       because applicants had submitted invalid Social Security       numbers. The center let brokers submit the       fraudulent applications anyway. This suggests the Centers for       Medicare and Medicaid Services, which runs the federal…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697906/affordable-care-act"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…fraud-ridden subsidy that has proven time and again--GAO, CBO, all the  watchdogs say it is fraught with tens of billions of dollars of fraud.  Tens of thousands of Social Security numbers from dead people have been  used to siphon money away from this program.\n\nMillions of people, according to CBO, are ineligibly on the program,  and the answer from the…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698366/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…despite missing or falsified  documentation, these ObamaCare subsidies continued for these fraudulent  applications. Taxpayers are left footing the bill as reused Social  Security numbers, subsidies paid on behalf of deceased individuals, and  billions in unreconciled payments expose a system unable to protect  public funds.\n\nTo be clear, expanding access…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698804/breaking-the-gridlock-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…turns  out there is no free option here.\n\nWe have some charts that show some things. Here are people who are  undocumented in America. They are working under stolen Social Security  numbers. They are giving into the system, but they are never going to  get anything out. Then, you look at the suppression of wage growth. I  know this is geeky, but I sort of…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693062/stop-bathing-in-folklore-and-start-bathing-in-math"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…of a so-called clean extension, with no  changes, outright laughable. That is not a clean extension.\n\nThe investigators at the GAO created fake identities and Social  Security numbers for 24 individuals who did not exist. They did this in  order to find out what would happen when they took advantage of these  ObamaCare subsidies.\n\nThey took these imaginary…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697929/healthcare"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…instructed.\n\nFor applications for plan year 2024, our covert tests       included fictitious applicants       who provided invalid (i.e., never issued) Social Security       numbers (SSN). Additionally, we stated income at a level       eligible to obtain APTC. As appropriate, we used publicly       available information to construct our applications…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698800/breaking-the-gridlock-act"}]