[{"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…Human Services, Education, State, Treasury, Transportation, and Housing  and Urban Development will be fully funded through the end of  September.\n\nThe Democratic wins we secured in this bill will be locked in. We  will reject $163 billion in cuts to public services proposed by  President Trump. We will increase funding for the National Institutes…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699573/consolidated-appropriations-act-2026"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…worked tirelessly to make this happen.\n\nThey are Ranking Members Grace Meng, Marcy Kaptur, and Chellie  Pingree on the Appropriations Committee, who led these negotiations and  secured crucial funding for key programs. Subcommittee staff,  especially Bob Bonner, Rita Culp, Scott McKee, Adam Wilson, Nora Faye,  Jamie Wise, Faye Cobb, Jocelyn Hunn, Michael…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698760/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Shontel Brown", "party": "Democrat", "sentence": "…Two, more than 20 employees resigned from DOGE, refusing to  ``jeopardize Americans' sensitive data, or dismantle critical public  services.''\n\nThree, one of Musk's companies secured a lucrative FAA contract,  laying bare his blatant conflicts of interest. Somehow, I doubt that  one will be canceled.\n\nNumber four, he fired 6,000 veterans serving the American…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688144/recognizing-resilience-resistance-and-relentless-struggle-lessons-of-black-history"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…hospitals that serve communities facing the  greatest social and financial barriers to care.\n\nDuring Dr. Siegel's tenure, he led efforts to preserve the 340B Drug  Pricing Program, secured targeted safety-net hospital funding during  the COVID-19 pandemic, and fought to close Medicaid payment gaps. He  was instrumental in stopping harmful cuts to Medicaid DSH…", "date": "2025-10-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696206/recognizing-dr-bruce-siegel"}, {"senator": "LaMonica McIver", "party": "Democrat", "sentence": "…Jersey's congressional delegation, and his son carried that legacy  while blazing his own path.\n\nA leader on the House Committee on Transportation and Infrastructure,  Mr. Payne secured critical investments that made rail travel in New  Jersey safer and more affordable.\n\nIn honor of his legacy that inspires my leadership and shapes my home  district, today…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698322/wishing-a-happy-heavenly-birthday-to-the-honorable-donald-payne-jr"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…year in Congress, I made a  simple commitment to my district: to listen and to get things done.\n\nThis week, I am proud to share that I am delivering on that  commitment. I secured over $6 million in Community Project Funding for  seven transformative community-led initiatives across the district in  Portland, Gresham, Sandy, and Multnomah County.\n\nThese…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698771/delivering-on-commitments-to-oregons-third-congressional-district"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…but to do so in the course as required by the 2022 law requires some  agreement from down the hall in the House of Representatives that, for  whatever reason, hasn't been secured. But we can at least get it placed  up here on the second floor of the Senate, the floor where we sat 5  years ago, the floor where the House sat 5 years ago. The Chambers…", "date": "2026-01-06", "source_url": "https://justfacts.votesmart.org/public-statement/1698521/anniversary-of-january-6"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…Bynum).\n\nMr. Speaker, the Republicans keep complaining about the Consumer  Financial Protection Bureau. Let's review the terrible things they have  done.\n\nSince 2011, they secured more than $21 billion for 205 million  consumers who were harmed by bad actors including the biggest banks.  The agency has received more than 10 million complaints from harmed…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689845/disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…mentors, coaches, and judges, providing  over 500 students with meaningful real-world business experience.  Through his leadership, the program has raised more than $80,000 and  secured $100,000 in grants, helping to build a lasting foundation for  future innovation.\n\nAs a longtime CASA Kane County volunteer, he has dedicated his  efforts to protecting the…", "date": "2025-04-24", "source_url": "https://justfacts.votesmart.org/public-statement/1690141/recognizing-robert-bob-p-hubbard-as-batavias-2024-citizen-of-the-year"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…that, honoring not only a promise to our  veterans, but also their families.\n\nThis pension benefit is not, nor was it ever, a handout. It was an  earned benefit that Mr. Peltz secured through his service in World War  II. I will continue to fight until every beneficiary gets the benefits  that they earned, no matter how long that takes. We must continue…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699468/ernest-peltz-accrued-veterans-benefits-act"}, {"senator": "Gil Cisneros", "party": "Democrat", "sentence": "…football season of the Baldwin Park Braves.\n\nAfter enduring a five-game losing streak, the Braves turned their  season around with determination and teamwork and ultimately secured an  at-large bid into Division 11 playoffs.\n\nIn the playoffs, the Braves became a different team and dominated  their way to the CIF Division 11 championship game.\n\nThis was…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697339/congratulations-to-the-lady-eagles-volleyball-team"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…or Jews. These covenants have since been declared void.  Newlands went further to keep Black and White Americans separate. In  the late 1800s, he and Senator William Stewart secured 2,000 acres of  land for Rock Creek Park. Establishing this park not only increased  property values for landowners like Newlands and Stewart, but also kept  White communities…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694054/francis-g-newlands-memorial-removal-act"}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "…not ask for  this; Portland did not ask for this; Chicago did not ask for this; our  servicemembers did not ask for this.\n\nI am relieved to announce that just moments ago I secured a Senate  hearing in the coming weeks with witnesses from the Trump  administration where I will ask tough questions and demand answers on  these unjustifiable actions because…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696180/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-central-yukon-record-of-decision-and-approved-resource-management-plan"}, {"senator": "Delia Ramirez", "party": "Democrat", "sentence": "…the Illinois Chapter of Ukrainian Medical Association of North America  and the president of the Illinois division of Ukrainian Congress  Committee of North America, she has secured medical donations and  supply donations to help save lives in Ukraine.\n\nThis past Sunday I had the honor to stand with her and Ukrainian  Americans at a Chicago rally to send…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688474/womens-history-month"}, {"senator": "Steny Hoyer", "party": "Democrat", "sentence": "…you can have  security.\n\nWe have some number of security organizations. They are all located  either in the suburbs or at Boeing Air Force base. Boeing Air Force  base is a secured piece of much acreage, so they are not subject to  that risk.\n\nAll of these agencies, including the CIA at Langley and other  agencies, four of which are in Virginia, are…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699075/providing-for-consideration-of-hr-financial-services-and-general-government-and-national-security-department-of-state-and-related-programs-appropriations-act-2026"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…the imposition of arbitrary       detentions and for torture against members of the Uyghur       community and other minority populations.\n\n(10) Uyghurs and Kazakhs who have secured citizenship or       permanent residency outside of the PRC have attested to       repeated threats, harassment, and surveillance by PRC       officials.\n\n(11) Reporting from…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694799/uyghur-policy-act-of-2025"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Small-dollar Mortgage Defined.--The term ``small-dollar       mortgage'' means a mortgage that--\n\n(1) has an original principal balance of $100,000 or less;       and\n\n(2) is secured by a 1- to 4-unit property that is the       principal residence of the mortgagor.       SEC. 303. COMMUNITY INVESTMENT AND PROSPERITY.\n\n(a) Revised Statutes.--The paragraph…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…Georgia. Mr. Speaker, I rise today to recognize the  remarkable achievement of professional golfer Russell Henley.\n\nRussell, a University of Georgia alum--go Dawgs--recently secured his  fifth PGA Tour victory at the 2025 Arnold Palmer Invitational.\n\nRussell delivered a pivotal chip-in eagle on the par 5 hole during  his final round at Bay Hill, taking…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689684/congratulating-russell-henley"}, {"senator": "Dale Strong", "party": "Republican", "sentence": "…5 percent to 2.5 percent.  Gas prices have hit a 4-year low, averaging $2.95 a gallon. Advanced  manufacturing and industry are returning to U.S. soil.\n\nPresident Trump has secured over $8 trillion in investments that will  fuel job growth and create opportunity. The stock market continues to  set new all-time highs.\n\nIt is a fact that Republicans are…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697390/providing-an-update-to-the-american-people"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…level  in 15 years. Morale is high. Deterrence is back.\n\nPresident Trump successfully crippled Iran's nuclear program. He  strengthened the success of the Abraham Accords. He secured the release  of the hostages in Gaza. He ended wars around the world not once, not  twice, but eight times. President Trump is the President of peace, and  he is achieving…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696537/government-funding"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…months. He has done an incredible job  leading the Budget Committee and leading our Conference to a resolution  passed out of the House that not only extended the tax cuts but secured  the border. It unleashes American energy. It funds our military. All  the priorities, all the mandates that the American people have given us  and have given the President…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689909/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Morgan Luttrell", "party": "Republican", "sentence": "…Training predominantly  Primary Care Physicians, they will serve throughout Texas and the U.S.  in underserved communities. Since Dr. White coming to the helm, the  medical school secured an investment from the State of Texas for $32  million and an additional $23 million in pledges and gifts in 2023  alone.\n\nIt's not just in the classroom that Dr. White is…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691515/recognizing-dr-alisa-white-president-of-sam-houston-state-university"}, {"senator": "Burgess Owens", "party": "Republican", "sentence": "…in the NJCAA Half Marathon  National Championship, a historic feat for SLCC and a significant  milestone in women's athletics at the college.\n\nOn the men's side, the Bruins secured second place in the NJCAA Half  Marathon National Championship, demonstrating their competitive edge  and depth of talent.\n\nThese achievements would not have been possible…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690034/recognizing-the-slcc-cross-country-team"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…[Nov. 11, 2025]\n\nPresident Trump Needs Better Rare Earths Negotiating Tools                  (By Debra Struhsacker, Sarah Montalbano)\n\nPresident Trump secured a one-year reprieve from Beijing's       threat to shut down global rare-earths exports, which would       have interrupted manufacturing of semiconductor chips and…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699694/critical-mineral-dominance-act"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…a member of the Senate Armed Services Committee, I am proud to  report that this year's National Defense  Authorization Act meets this moment. It includes key provisions I  secured to modernize our nuclear deterrent and strengthen our national  defense.\n\nAs chair of the Strategic Forces Subcommittee, I fought to upgrade  the National Nuclear Security…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695027/9999"}, {"senator": "Jim Jordan", "party": "Republican", "sentence": "…across this great country. I don't want the taxes to go  up on the families who I represent in the Fourth District of Ohio. I  don't want that to happen.\n\nI want the borders secured. I want to reduce spending because I know  we are running deficits in the trillions, and we have piled up $36  trillion in debt. I want to help our national defense because…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688069/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Tony Wied", "party": "Republican", "sentence": "…and among NFL fans across the country.\n\nDuring his tenure as president and CEO, the Green Bay Packers won the  Super Bowl in 2011, made 5 NFC Championship Game appearances, secured 8  NFC North division titles, earned 13 playoff appearances, and posted a  172-101 regular season record, which was the second best in the league  over that span.\n\nOff the…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694121/recognizing-mark-murphy"}, {"senator": "Michael Cloud", "party": "Republican", "sentence": "…undermining America's energy dominance.\n\nIn the base of this bill, there is $50 million for the ARDP  demonstration programs and $77 million for risk-reduction projects. We  secured close to $5 billion in Army Corps projects that improve  navigation and operating waterways for vessels which strengthens our  economy, helps us to export, and helps us to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694857/energy-and-water-development-and-related-agencies-appropriations-act-2026"}, {"senator": "Addison McDowell", "party": "Republican", "sentence": "…November 1,  2025, Jesse Love, Jr. brought home the 2025 NASCAR Xfinity title from  Phoenix, Arizona. Love held the lead for the final 24 laps, displaying  his dominance as he secured his third career victory on his first-ever  non-superspeedway track.\n\nAt just 20 years old, Love is no stranger to winning and bringing  back hardware to the stock car racing…", "date": "2025-11-04", "source_url": "https://justfacts.votesmart.org/public-statement/1696515/recognizing-jesse-love-jr"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…Athletic Association (AHSAA) 1-5A State Championship.\n\nAt Protective Stadium in Birmingham, Alabama, on December 3, 2025,  the Moody flag football team, with a record of 22-3, secured the  school's first state championship in flag football over Montgomery  Catholic School with a score of 28-17.\n\nThe championship team from Moody, Alabama, is led by Coach…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698051/recognizing-moody-high-school-for-winning-the-ahsaa-class-1-5a-state-championship-in-girls-flag-football"}]