[{"senator": "Chris Murphy", "party": "Democrat", "sentence": "…did we invade Venezuela? Why are we still talking about  Venezuela?\n\nWell, let's rule out the reasons we know don't hold water. It is not  because Venezuela presents a security threat to the United States.\n\nThere was a reason we went into Afghanistan. However badly that  occupation ended, there was a reason we went into Afghanistan. They  were harboring…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698610/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…``deliberative  process privilege'' claim.\n\nOn February 29, 2024, I wrote to then-President Biden, urging the  administration to take action to address the serious national security  threat posed by foreign governments exploiting U.S. phone carriers'  weak cybersecurity. In that letter to then-President Biden, I stated  that ``CISA is actively hiding information…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689978/nomination-of-sean-plankey"}, {"senator": "Andy Kim", "party": "Democrat", "sentence": "…American people. Millions of Americans  are about to see their healthcare costs rise exponentially. Why are we  conducting military operations in a country that has no direct security  threat to the United States when people are about to lose their  healthcare?\n\nEven if this administration had a sound foreign policy, it would be  essential that Congress assert…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698621/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Sydney Kamlager-Dove", "party": "Democrat", "sentence": "…Fact: President Trump just pardoned a known Honduran cocaine kingpin.\n\nFact: Most smugglers that bring drugs into the country are U.S.  citizens.\n\nFact: The real national security threat is selling our AI chips to  China, not blowing up fishermen.\n\nAmerican taxpayers are spending millions of dollars to stop the  Europeans from partying. What is in it for…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698250/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…was in World War II or the war in Afghanistan, where 165  Canadians gave their lives after our country was attacked. There is no  national emergency. There is no national security threat underpinning  these threats.\n\nIn an interview just last night, Donald J. Trump admitted he placed  tariffs on Switzerland. Why? I will tell my colleagues why. It is  simply…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699971/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…security. This plane is emblematic of a core,  metastasizing corruption, an economic cancer that has infected the  White House, but it is also emblematic of a national security threat  from nations who would buy our President--maybe not signed, sealed, and  delivered but exert undue influence.\n\nIn fact, the national security threat is even greater from…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691071/9999"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…consumers who will be stuck in a  lengthy bankruptcy process if a stablecoin ever fails.\n\nAdditionally, it leaves the door open for foreign firms that present  a major national security threat, including targets of sanctions, all  to appease those in the Trump family's inner circle which has ties to  those shady entities.\n\nYes, I am talking about Tether, the…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693839/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…Easterly to release the report. When she  didn't act on my request, I wrote to President Biden--that was in  February of 2024--urging him to address the serious national security  threat posed by foreign governments exploiting U.S. phone carriers'  weak cybersecurity. The Biden administration took no action.\n\nCISA's top telecommunications security expert…", "date": "2025-07-28", "source_url": "https://justfacts.votesmart.org/public-statement/1694259/telecom-cybersecurity-transparency-act"}, {"senator": "August Pfluger", "party": "Republican", "sentence": "…promote culture, as they may say,  but to expand their influence inside the United States for malign  purposes. This legislation would put an end to this egregious national  security threat. Quite frankly, it is well overdue.\n\nMr. Speaker, I urge my colleagues on both sides of the aisle to come  together, to stand firm for our American education system, and…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690828/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Brad Knott", "party": "Republican", "sentence": "Mr. KNOTT. Mr. Speaker, it is my privilege to speak in favor of H.R.  4070, the Tren de Aragua Border Security Threat Assessment Act.\n\nI thank Chairman Guest and Chairman Garbarino for their support and  leadership on the Homeland Security Committee from which this bill has  originated.…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696955/tren-de-aragua-border-security-threat-assessment-act"}, {"senator": "James Risch", "party": "Republican", "sentence": "…is  not well-taken, and I am going to quote from the Executive Office of  the President their statement on the policy.\n\nS.J. Res. 59 fails to account for the dynamic security       threat posed by Iran and its proxies and our commitments to       force protection in the region.\n\nOn June 12, the International Atomic Agency Board of       Governors found…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693132/motion-to-discharge-sj-res-59"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…eventually  default on the debt are what lie ahead for the American economy.\n\nUnfortunately, a debt crisis will not just stop with our economy. A  threat to our financial security is also a threat to our national  security. We must remember that the surest path to peace is leaving no  doubt in your adversary's mind about your ability to respond with  aggression.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695544/setting-forth-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2026-and-setting-forth-the-appropriate-budgetary-levels"}, {"senator": "Keith Self", "party": "Republican", "sentence": "…which carries little or no  consequences for hostilities that do not exist, this Chamber should  focus on supporting the President's efforts to deter the growing  national security threat from Venezuela.\n\nHundreds of Americans die each day due to illegal drugs. Rather than  Democrats making it their life's mission to destroy Donald Trump,  America would…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698450/removal-of-the-use-of-united-states-forces-for-hostilities-within-or-against-venezuela"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "Mr. GUEST. Mr. Speaker, I move to suspend the rules and pass the bill  (H.R. 4070) to require a homeland security border threat assessment on  Tren de Aragua and associated strategic plan, and for other purposes.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696956/tren-de-aragua-border-security-threat-assessment-act"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…Van  Hollen said it was an illegal ``act of war,'' a complete reversal of  his previous positions.\n\nSenator Murphy told CNN on Sunday that Venezuela, he said, is ``not a  security threat'' to the United States. He sure viewed it differently  in the past. Evidently, they were all for it before they were against  it. That is what we see with these Democrats:…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698571/venezuela"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "…terrorism threat landscape and the       increasing utilization of generative artificial intelligence       by foreign terrorist organizations represent a national       security threat, and the challenges posed by such threat are       not well understood; and\n\n(2) the Department of Homeland Security, in consultation       with the Office of the Director…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696919/generative-ai-terrorism-risk-assessment-act"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…underestimated--Canada underestimated the toll of the fentanyl  crisis and what it had taken, and they literally called it, according  to the Canadian fentanyl czar, a national security threat.\n\nThe northern border, for whom this emergency exists, is acknowledging  that there is an emergency, a national security threat, but I guess my  colleagues think that…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699965/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…provisions to address outbound foreign investments that  they be included in the final version.\n\nWe all know that the Chinese Communist Party is the greatest national  security threat--not just to the region but globally--at this time.  What many of us did not fully appreciate is how American investors are  directly supporting the Chinese economy and…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697200/senate-agenda"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…after  Maduro's capture, Senator Murphy said:\n\nThe invasion of Venezuela has nothing to do with American       security.\n\nNothing.\n\nHe further said:\n\nVenezuela is not a security threat to the [United States].\n\nI disagree. I think it has more than a little to do with our national  security and our safety. I have heard from too many Arkansas mothers  and…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698556/venezuela"}, {"senator": "French Hill", "party": "Republican", "sentence": "…abuses.  Over 8 million Venezuelans have fled Venezuela, their home country,  because of Maduro.\n\nRepublicans and Democrats have acknowledged that Maduro has been a  national security threat to the United States, and that is why I have  to call out the hypocrisy that I have witnessed in recent days from my  colleagues on the other side of the aisle.\n\nThe Western…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698884/successful-operation-to-arrest-nicolas-maduro"}, {"senator": "James Risch", "party": "Republican", "sentence": "…intervention in Venezuela. Do you know what  he says now, after the invasion?\n\nThe invasion of Venezuela has nothing to do with American       security. Venezuela is not a security threat to the U.S.\n\nThat is what he says today.\n\nNow, one of my favorites, this Senator said--and this was on February  5, 2020:\n\nAnd the President brags about his Venezuela…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698707/venezuela"}, {"senator": "Keith Self", "party": "Republican", "sentence": "…which carries little or no  consequences for hostilities that don't exist, this Chamber should  focus on supporting the President's efforts to deter the growing  national security threat from Venezuela.\n\nHundreds of Americans die each day due to illegal drugs like  fentanyl. Rather than Democrats making it their life's mission to  destroy Donald Trump,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698245/resolution-to-remove-united-states-armed-forces-from-hostilities-with-presidentially-designated-terrorist-organizations-in-the-western-hemisphere"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…entities involved in the  fentanyl trade and puts pressure on the CCP to shut down the labs that  fuel this crisis.\n\nIt is time to treat this for what it is: a national security threat.\n\nThe Stop Chinese Fentanyl Act sends a clear message: The United  States will not sit back while foreign actors profit from American  pain.\n\nHouse of Representatives,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694826/stop-chinese-fentanyl-act-of-2025"}]