[{"senator": "Brad Schneider", "party": "Democrat", "sentence": "…files.\n\nMy Democratic colleagues and I are here to work to lower costs and  grow our economy, to build healthier and safer communities, and to  ensure strong national security and national defense.\n\nI implore my colleagues on the other side of the aisle to join us.  Let's get back to work and deliver the results that the American people  sent us here…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694074/time-to-deliver-results-for-american-people"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…therefore,  should not be deported.\n\nThe damage that is being caused right now by this administration to  our communities, to our international standing, to our national  security and national fabric, will take years to unwind. Eager to do  their part and contribute to the chaos, House Republicans continue to  find novel ways to bring this Chamber to new…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690745/providing-for-consideration-of-hr-gulf-of-america-act-and-providing-for-consideration-of-hr-dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…never been about efficiency. You don't  eliminate entire agencies and departments as Elon Musk has done, you  don't get rid of 50 percent of the personnel at Social Security, or the  National Oceanic and Atmospheric Administration if you are simply  trying to improve efficiency and get rid of waste, fraud, and abuse.\n\nThis was always about finding enough…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692038/consequences-of-doge"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…direction through  funding and oversight. That was fiscal year 2024.\n\nThey have been operating on a continuing resolution for 16 months  now, and that cripples national security. That is a national security  risk. No new programs are possible, and procurement is excessively  expensive because it cannot function over multiple years without  effective system-wide…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699571/consolidated-appropriations-act-2026"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…every day more expensive. It will slash critical  investments in the things that make us healthier, safer, and more  productive, things like cancer research, aviation security, and our  National Park System. It will decimate critical programs that support  the people we represent, stripping healthcare for millions and making  it harder for families to put…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688065/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…idea that somehow it might interfere with the movement of  submarines from the Groton sub base or maybe testing of submarines by  electric boat or some other national security or national defense need,  no adverse impact to DOD mission.\n\nSo these national security concerns, quite clearly and outrageously,  were just a pretext, a flimsy excuse to continue…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696127/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…term ``sector'' means a collection of       assets, systems, networks, entities, or organizations that       provide or enable a common function for national security       (including national defense and continuity of Government),       national economic security, national public health or safety,       or any combination thereof.\n\n(11) Sector risk…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696755/strengthening-cyber-resilience-against-state-sponsored-threats-act"}, {"senator": "Nicholas Langworthy", "party": "Republican", "sentence": "…close the supply chain vulnerabilities that Communist China  actively exploits to the detriment of the American people.\n\nIf Democrats were serious about supply chain security and national  defense, this is exactly the kind of bill that they would support.  Instead, they spent years defending policies that left America exposed.  Republicans are choosing…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699905/providing-for-consideration-of-hr-law-enforcement-innovate-to-de-escalate-act-providing-for-consideration-of-hr-undersea-cable-protection-act-of-providing-for-consideration-of-hr-securing-americas-critical-minerals-supply-act-and-for-other-purposes"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…begin restoring American deterrence, prioritizing  lethality, and ensuring peace through strength.\n\nIt will help defend the DOD's mission at the border because border  security is national security.\n\nIt will help improve the quality of life for our servicemembers and  their families.\n\nIt will help us start to revitalize our defense industrial base and…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688078/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Brandon Gill", "party": "Republican", "sentence": "…but they do not have the  right to our tax dollars.\n\nTo my colleagues who say that this is only a small part of our  budget, I would ask them what, outside of border security and national  defense, would they like to cut from our budget? They have never seen a  foreign country they don't want to shower with our tax dollars or an  illegal alien that they…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692538/rescissions-act-of-2025"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…agricultural education is critical not only for our rural  communities but for the entire country.\n\nAgriculture is the backbone of our economy. As I often say, food  security is national security, and investing in the next generation of  producers ensures that there is food on our tables, clothes on our  backs, and fuel in our vehicles. However, beyond…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687891/national-future-farmers-of-america-week"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…surrounding social justice  communities. And it did not even consider the jobs lost in the  downstream communities that rely on the [Powder River Basin] coal.''\n\nEnergy security is national security, and Wyoming's energy industry  remains indispensable to ensuring that America stays energy dominant.  Wyoming's Powder River Basin, with its low-sulfur coal,…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696879/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-buffalo-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Jodey Arrington", "party": "Republican", "sentence": "…beautiful win for the American people.\n\nIt is big because it delivers the largest tax cuts for families and  small businesses; the greatest single investment in border security and  national defense; the most significant commitment to unlocking  America's energy resources; and the largest reduction in mandatory  spending in the history of the United States…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694789/promises-made-promises-kept"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…good-paying jobs supported by Montana's coal industry and  the broad positive economic effects of producing energy here at home.\n\nThe CRA isn't just about Montana. Energy security is national  security, and Montana's mining industry plays a vital role in ensuring  America and our allies maintain a strategic energy advantage over our  adversaries.\n\nWe can…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694888/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Paul Gosar", "party": "Republican", "sentence": "Mr. GOSAR. Mr. Chairman, I yield myself such time as I may consume.\n\nMr. Chairman, energy security is national security. As the 119th  Congress works to protect and strengthen America's energy backbone, we  have a responsibility to ensure our decisions are informed,  transparent,…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697892/electric-supply-chain-act"}, {"senator": "Mike Rogers", "party": "Republican", "sentence": "…building the Golden Dome  missile defense shield to protect our homeland, begin to revitalize our  defense industrial base, help us secure our border because border  security is national security, begin to rebuild our munitions  stockpiles and critical mineral supply chains, and continue to improve  the quality of life of our servicemembers and their…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693190/one-big-beautiful-bill-act"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…instead of in the government's  coffers. It delivers permanent tax relief, begins to rein in  Washington's out-of-control spending, makes historic investments in  border security and national defense, and restores the kind of  commonsense priorities people in my State of North Dakota live by every  single day.\n\nThere are so many wins in this bill that we…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694173/benefits-of-one-big-beautiful-bill"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…families, their  paychecks, and communities, and certainly not when Texas and our Gulf  Coast stand ready to supply LNG to the world safely, cleanly, and  reliably. Energy security is national security. We must never forget  this.\n\nI am proud to support this bill. It is a wise, good bill that will  strengthen America. I urge my colleagues to join me in unlocking…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697084/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…enhance the national security       of the United States.\n\n(b) Elements.--The report required by subsection (a) shall       include an assessment of--\n\n(1) the digital security, national security, and economic       opportunities associated with a trans-Atlantic submarine       fiber optic cable described in subsection (a);\n\n(2) the lifespan of submarine…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692701/assessment-of-trans-atlantic-submarine-fiber-optic-cable"}, {"senator": "Rudy Yakym III", "party": "Republican", "sentence": "…completes the wall, funds thousands of new border agents, and equips  them with the cutting-edge tools that they need.\n\nI urge my colleagues to vote ``yes'' because border security is  national security.", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693161/one-big-beautiful-bill-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…that we give companies the certainty  that they can build these communication lines and diversify where they  are locating them so that we can protect our economic security and also  our national security.\n\nThis legislation before us today accomplishes two objectives:\n\nFirst, it eliminates the requirement for undersea cables to obtain a  special use permit…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699960/undersea-cable-protection-act-of-2025"}]