[{"senator": "Suhas Subramanyam", "party": "Democrat", "sentence": "…Speaker, we had some good news this week.\n\nOne of my constituents was finally able to get an in-person  appointment to receive at least an interview about her Social Security  benefits. You would think that we would be delighted that appointment  is going to happen in a couple of days, but this is also bad news  because she had actually reached out…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697218/recognizing-bishop-michelle-c-thomas"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…the House and Senate.\n\nAll that is needed is three Republicans to stand up and say: No. Wait  a minute. This is not what the Nation needs. We do not need to cut  Social Security benefits. We need to enhance them.\n\nMr. Speaker, as my colleagues are aware, in the Speaker's district  alone, there are 189,000 Social Security recipients who haven't  received…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688396/preeminent-antipoverty-program-for-elderly-and-children"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…ways in which  it can be weaponized. Any hostile agent from outside the United States  can use that data in all kinds of ways. What happens if, suddenly, your  Social Security benefits aren't there or the files regarding your  disability benefits or your age and birth records? Who all knows what  can disappear or be modified? Banking records are possibly…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…won't spend money for teachers or for schools.\n\nThey think modern medical care and hospitals are fine--for       people who can afford them.\n\nThey approve of social security benefits--so much so that       they took them away from almost a million people.\n\nThey believe in international trade--so much so that they       crippled our reciprocal trade…", "date": "2026-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1700295/president-trumans-words-still-ring-true-today-the-failings-of-the-state-of-the-union"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…imposition,  confusing businesses, and tanking the stock market; illegal seizure of  citizens without judicial process; dramatic cuts to the delivery of  Social Security benefits and veteran benefits; abandoning environmental  protections for clean air and clean water; destabilizing families,  hospitals, and nursing homes with pending Medicaid cuts; and…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690483/trumps-100-days"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…to continue to fight to protect Americans from  having their personal Social Security information politicized or bought  and sold to the highest bidder or their Social Security benefits put at  risk. It is very, very frightening, so frightening, Mr. Speaker, that  as soon as our current Treasury Secretary was brought into office, I  wanted to know what…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697187/improving-social-securitys-service-to-victims-of-identity-theft-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "Ms. KAPTUR. Mr. Speaker, my message today is an alert for Social  Security recipients. Pay attention to what billionaire Elon Musk is  doing with your hard-earned Social Security benefits.\n\nMusk is coming after your Social Security. The top administrator of  the Social Security administration says that Musk's DOGE boys are  trying to break the system entirely.…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688636/social-security-benefits-are-your-hard-earned-benefits"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "Mr. DELUZIO. Mr. Speaker, I represent more than 180,000 people in  western Pennsylvania who receive Social Security benefits. Those are  earned benefits. My constituents receive more than $350 million of  those monthly benefits.\n\nI join my colleagues in sounding the alarm on this administration's…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690821/protecting-social-security-benefits"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…statements to  increase the public's understanding of its programs. However, SSA's  funding constraints already limit SSA's ability to educate Americans  about their Social Security benefits. Section 1143 of the Social  Security Act, 42 U.S.C. Sec. 1320b-13, SSA is required to mail Social  Security annual statements to most workers aged 25 and older who are…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697776/claiming-age-clarity-act"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…beneficiaries today, with the baby boomer retirements that are swelling  the ranks of Social Security beneficiaries, it is 73 million Americans  now who are receiving Social Security benefits. These are people with  retirement benefits, children who have lost a parent, and people on  disability.\n\nWe now have a bigger-than-ever population of people collecting…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689134/dont-touch-social-security"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…It is the safety net for  capitalism. That is what Roosevelt intended it to be. It is long  overdue that we have a vote in the United States Congress to enhance  Social Security benefits for all Americans.\n\nThere are 10,000 baby boomers who become eligible for Social Security  every day. More than 70 million people receive Social Security, and now  Mr.…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687913/social-security-is-an-earned-benefit"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…work just to  keep a roof over my head, afford rising food and utility costs, and  maintain my car. Meanwhile, the government keeps taking more and more  out of my Social Security benefits, money I already paid taxes on while  working. It feels like the middle class no longer exists. You are  either rich or poor. Politicians today have no real understanding…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…a unified  Democratic Party and Congress to push forward a bill that was last  extended in 1971. Richard Nixon was President of the United States the  last time Social Security benefits were extended for your constituents  as well as my constituents in Connecticut.\n\nIt is long overdue. We have a COLA that doesn't work. We have people  that continue to…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688486/social-security-is-the-number-one-antipoverty-program-in-united-states"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…dignity, with  respect, not with the contempt we see from DOGE. And no good business  operator would take this slash-and-burn approach DOGE is taking.\n\nPeople's Social Security benefits are also at risk. Their ability to  see a doctor is at stake. Their ability to put kids in daycare is at  stake. The longer DOGE is allowed to rain chaos on the American…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688202/department-of-government-efficiency"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "…the  haphazard and illegal cuts to personnel made by Elon Musk and DOGE,  including many who are complaining now that they are having difficulty  accessing their Social Security benefits because of the mass cuts in  SSA.\n\nThese are real people that are not getting their benefits. They can't  get anyone on the phone when they try to call Social Security.…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692038/consequences-of-doge"}, {"senator": "Julie Fedorchak", "party": "Republican", "sentence": "…child tax credit to  $2,500 per child; raising the standard deduction for all filers;  establishing savings accounts for newborns; and creating a new  deduction on Social Security benefits for senior citizens.\n\nFor the average family of four in North Dakota, this package will  help save an estimated $1,600 in taxes. That buys about 8 weeks of  groceries.…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691959/supporting-the-big-beautiful-bill"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…individual deduction, while married couples filing  jointly can claim $12,000, significantly reducing and for most seniors  effectively eliminating Federal taxes on Social Security benefits.\n\nAfter a lifetime of contributing to our communities and our country,  seniors deserve real peace of mind, and this deduction helps deliver  exactly that.", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699896/delivering-for-iowa"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…they earn with no tax on  tips and no tax on overtime. To our seniors, I have good news for you,  too. With the new deduction, you are not going to pay any tax on Social  Security benefits.\n\nBut wait, there is more, Mr. Speaker. We have unleashed American  energy, restored our independence, and brought down costs at the pump.\n\nDo you know why we don't hear…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699278/highlighting-republican-successes-in-2025"}, {"senator": "Nicole Malliotakis", "party": "Republican", "sentence": "…they have to wait months to sometimes see  their replacement check also stolen.\n\nThis is not just happening with IRS tax refunds. It is also happening  with Social Security and other benefits that our constituents rely on.\n\nApproximately 10 percent of American taxpayers receive their tax  refunds via paper checks, equating to about 10 million paper checks…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689293/recovery-of-stolen-checks-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…improvements to our tax code are already making a real difference for  older Americans. For too long seniors were treated unfairly, Mr.  Speaker, taxed on their Social Security benefits and left struggling to  cover rising costs.\n\nThat is finally starting to change. This year, a new $6,000 tax  exemption for taxpayers age 65 and older takes effect.…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700050/tax-policy-should-reward-a-lifetime-of-hard-work"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…that. Now, if they choose to work overtime, they can now  deduct up to $12,500 in qualified overtime income.\n\nNow seniors can deduct an additional $6,000 on their Social Security  benefits.\n\nAll of these enhanced deductions will ensure that those who are  experiencing the brunt of the affordability burden will have a little  more breathing room when tax…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698258/nominations"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…serves  the people must also respect the rights of those who serve within it.\n\nFederal employees work tirelessly every day, often behind the scenes.  They process Social Security benefits, safeguard our food and water,  care for our veterans, and respond whenever a disaster strikes. Their  work is essential, and its impact reaches every community across…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1697991/protect-americas-workforce-act"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…permanent. He promised  he would deliver the largest tax cut for hardworking taxpayers in  American history, and he promised to eliminate taxes on tips, overtime,  and Social Security benefits.\n\nPresident Trump is keeping his word. He is delivering much-needed  relief for the American people, and this will produce an investment  surge, driving real median incomes…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693212/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…lie about what our bill  does. Mr. Speaker, the truth is that the One Big Beautiful Bill Act  eliminates taxes on tips and on overtime pay. It lowers taxes on Social  Security benefits and expands the child tax credit for working-class  families.\n\nOur bill helps keep American family farms afloat by eliminating the  death tax for most, saving 2 million…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692936/peace-through-strength"}, {"senator": "French Hill", "party": "Republican", "sentence": "…relations in the sub-Saharan Africa region.\n\nDiversified supply chains.\n\nNew markets for American goods and services.\n\nStronger and diversified American investments.\n\nNational security benefits of AGOA include:\n\nPeace and stability in a region that our adversaries, such as China,  are trying to exploit.\n\nAn American presence in a region rich in critical minerals.…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698905/agoa-extension-act"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…bipartisan support in the Ways  and Means Committee.\n\nMr. SMITH of Missouri.\n\nMr. Speaker, no American entering retirement should lose out on their  hard-earned Social Security benefits because the Social Security  Administration failed to provide information in clear and  understandable terms. We need to make it easier and not harder for  individuals…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697232/claiming-age-clarity-act"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "…doesn't get any simpler than minimum, standard, and  maximum benefit ages.\n\nThis bill will help seniors make informed decisions when deciding  when to begin their Social Security benefits that they have earned.\n\nMr. Speaker, I thank Mr. Beyer for leading this effort with me, and I  urge my colleagues to support this commonsense bill.", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697234/claiming-age-clarity-act"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…paid into this program  for decades. They deserve the full sum of their Social Security income.  However, nearly 66 percent of retirees are paying taxes on their Social  Security benefits because Bidenflation pushed seniors' benefits into  higher income brackets.\n\nTo address this, I have introduced the RETIREES First Act. It would  lower the tax burden…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690548/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…first when we passed the largest tax cut in  American history. We delivered no tax on tips, no tax on overtime, and  tax relief for seniors by lowering taxes on Social Security benefits,  because the key to affordability is bigger paychecks, not bigger  government.\n\nPeople are going to be feeling the effects of these tax savings in  their pocketbooks…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699063/how-republicans-have-delivered-for-americans"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…world  connected, but there is no cable connecting the United States to the  continent of Africa.\n\nMr. Speaker, a transatlantic submarine cable could provide national  security benefits to the United States, given Africa's strategic  importance, and it is an important issue to study, in my opinion.\n\nI thank Delegate Plaskett and Representative Fulcher…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692701/assessment-of-trans-atlantic-submarine-fiber-optic-cable"}]