[{"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…authorize the  Baltic Security Initiative.\n\nThis amendment comes up at a crucial time. Just last week, the  administration announced the U.S. would be pulling out of all security  assistance programs for Europe, including the BSI.\n\nI have had the privilege of traveling to the Baltic. When we speak  with the people there, it is not a question of if Russia…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695263/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…State  and Commerce to hire locally employed staff in the region, establishing  a workforce development program, codifying a media program and more.\n\nIt increases U.S. security assistance to address regional maritime  security, transnational crime and law enforcement issues by authorizing  the Secretary of State to provide assistance to build the capacity…", "date": "2025-07-10", "source_url": "https://justfacts.votesmart.org/public-statement/1693346/introduction-of-the-blue-pacific-act"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…prerogatives. This bill does include important  provisions, including an increase in pay for servicemembers,  investments in research, and reauthorization of the Ukraine Security  Assistance Initiative. It includes a provision I worked on to ensure  continued public access to Greenbury Point near the Naval Academy and  my efforts with Senator Kennedy to…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698254/nominations"}, {"senator": "Betty McCollum", "party": "Democrat", "sentence": "…deployments  become limited, and it saps the morale and capabilities of the infected  individuals and their communities.\n\nDOD's HIV-AIDS prevention program pairs health and security  assistance to provide care and treatment in concert with military  training, exercises, and humanitarian activities.\n\nThis amendment would eliminate a successful military-to-military…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693686/department-of-defense-appropriations-act-2026"}, {"senator": "Rosa DeLauro", "party": "Democrat", "sentence": "…broad support in Congress for helping Ukraine defend itself  against Russia's brutal invasion, they empower Putin by failing to  include $300 million for the Ukraine Security Assistance Initiative.\n\nThe majority's bill holds the door open for disinformation created by  America's enemies rather than allowing the Department of Defense to  counter the…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693648/department-of-defense-appropriations-act-2026"}, {"senator": "Ed Case", "party": "Democrat", "sentence": "…function for the millions of Americans who depend on it at  a time when Social Security is being crippled by staff cuts.\n\nIn Foreign Affairs, this bill provides continued security assistance  to our friends and allies throughout the world. It maintains some  effective projection of presence out there into the world. It funds the  Countering PRC Influence…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699571/consolidated-appropriations-act-2026"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "Mr. KAINE. Madam President, pursuant to section 601(b) of the  International Security Assistance and Arms Control Expert Act, I move  to discharge the Committee on Foreign Relations from further  consideration of S.J. Res. 59, to direct the removal of U.S. Armed…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693124/motion-to-discharge-sj-res-59"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…sacrificial deeds of our forebears  explain why I rise to express my deep opposition to this bill's  irresponsible and shortsighted exclusion of any funding for the Ukraine  Security Assistance Initiative.\n\nThroughout generations, the fundamental purpose of our Nation is to  guarantee liberty, to develop the kinds of relationships with our  democratic allies…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693693/department-of-defense-appropriations-act-2026"}, {"senator": "Gregory Meeks", "party": "Democrat", "sentence": "…Crucially, the bill also does not alter or undermine congressional  oversight over direct commercial sales.\n\nIn short, while I have strong concerns about the arms sales and  security assistance policies of the Trump administration, I support  efforts to provide our allies and partners with improved timelines and  processing for defense articles that they need…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694831/international-traffic-in-arms-regulations-licensing-reform-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…Donald Trump, Congress,  and the American people for their firm and consistent support of  Ukraine's independence, sovereignty, territorial integrity, as well as  for the security assistance packages provided to Ukraine, which have  helped stabilize the situation on the frontline.''\n\nThe people of Ukraine are beyond grateful. If you walk through the  streets…", "date": "2025-03-05", "source_url": "https://justfacts.votesmart.org/public-statement/1688568/9999"}, {"senator": "James Risch", "party": "Republican", "sentence": "…military dialogues and highlevel defense policy exchanges.       The historic ten-year U.S.-Israel Memorandum of Understanding       to provide Israel with $38 billion in security assistance is       a bulwark against regional threats. Should hostilities       resume, Israel will need urgent and substantial support to       respond to the immediate threat…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688394/arms-sales-notification"}, {"senator": "Roger Wicker", "party": "Republican", "sentence": "…colleagues that Congress  overwhelmingly passed and President Donald Trump enthusiastically  signed the National Defense Authorization Act. That law extends  Ukraine's Security Assistance Initiative and our commitment to sharing  intelligence with Ukraine. Good for the President, and good for our  friends in the House and Senate.\n\nOur allies across the…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699095/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…people of Georgia have freely elected to pursue;\n\n(4) to reevaluate its relationship with the Government of       Georgia and review all forms of foreign and security       assistance made available to the Government if it takes the       required steps--\n\n(A) to reorient itself toward its European Union accession       agenda; and\n\n(B) to advance…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690702/mobilizing-and-enhancing-georgias-options-for-building-accountability-resilience-and-independence-act"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…to our own interests. But that is  exactly what some in Washington seem to be doing.\n\nCongress recently learned that a senior DOD official conducted a  review of DOD security assistance efforts and--listen to this-- concluded that the Ukraine Security Assistance Initiative, among other  programs, was wasteful. This is a Republican administration panning…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692870/9999"}]