[{"senator": "Katherine Clark", "party": "Democrat", "sentence": "…When you destroy our capacity to address famine,  control disease, and build infrastructure in developing nations, you  are ceding our power to our rivals. You are planting the seeds of  future wars.\n\nA prominent Republican said this week that he just couldn't justify  these investments. In this debate, I have heard that this is about  putting America first.…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692545/rescissions-act-of-2025"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…crypto con,  this bill, which should be called the calamity act, is bad public  policy. That is plain and simple.\n\nThe bill would lead to increased investor harm, plant the seeds for  the next financial crisis, and endanger our national security.\n\nJust last week, the former chairman of the Commodity Futures Trading  Commission warned that this bill…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693777/digital-asset-market-clarity-act-of-2025"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…to lay the economic foundation for this  country.\n\nThey had a hand in building this Capitol and a hand in building the  White House. They built roads and bridges, planted the seeds, and  harvested the crops. These are the people who laid the economic  foundation. They are the economic foundational mothers and fathers of  the United States of America.…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690560/a-message-to-the-cabinet"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…election and current voting machines.\n\nBut rewriting the history of January 6 was only the beginning of a  relentless, purposeful campaign to stoke fear among voters and sow  seeds of distrust in American elections. They have employed Federal  Agencies to help do some of the dirty work. In fact, President Trump  has weaponized several Federal Agencies…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696440/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "…for       things we need to pick up. We're letting the natural cycle do       its thing and kind of working alongside it.'' But for       Guerrero, it's starting to plant the seeds for the next       generation. ``It's a great opportunity to have high school       students come out and share this with their friends and be       like `oh there's a farm…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695344/recognizing-kyla-guerrero-for-her-impressive-gold-award-project"}, {"senator": "Jill Tokuda", "party": "Democrat", "sentence": "…of the clearest demonstrations of our strength and  resolve. The fact that this amendment has even been made in order  undermines us. Just giving this amendment airtime sows seeds of doubt  in Taiwan as to our support and further emboldens Beijing. This is not,  by any means, a serious amendment.\n\nIn this very same bill that we are debating, we are considering…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695235/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…A porchlight glow, a voice I knew to call,      A place where I was seen, not just around.       Yet though I ache, I stay, because I know      Great dreams are born from seeds we bravely sow                                 BY EMMA ROSS       I dreamed of shaping laws before I came,      A distant vision held in hopeful hands;      But here, where…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699130/senate-pages"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…TPS has       enabled Haitians across the country to contribute to the       fabric of our cities, states, and country as a whole. They       have planted roots here and sown seeds of community, culture,       and connection.\n\nSome may point to the word ``temporary'' in Temporary       Protected Status and suggest that termination was always       inevitable.…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699630/constituent-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Sean Casten", "party": "Democrat", "sentence": "Mr. CASTEN. Mr. Speaker, this week, we will vote on bills to defund  the police, sow the seeds for our next financial crisis, and remove any  remaining fig leaf that we might hide behind when we insist that  Congress is a coequal branch of government.\n\nI am, of course,…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693618/crypto-used-by-criminals-and-corrupt-politicians"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…President has also broken his promise many times over to the  farmers in Illinois. His tariffs have made farming in Illinois  unprofitable--not just by making the fertilizer, seeds, machinery, and  equipment more expensive but also by wrecking export markets like China  for years to come.\n\nI have met with these farmers throughout my congressional career.…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700151/tariffs"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…to hear me out on this.\n\nThe Senators from Kentucky and Oregon cooperated to create the first  research on hemp. We cooperated to give the first opportunity to move  research seeds across State lines. We cooperated and pushed to create  hemp as a legitimate agricultural product.\n\nCBD derived from hemp has been approved by the FDA for treating  seizures.…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696665/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…Trump the pen to write the rules that would put more money in  his family's pockets. A vote for S. 1582 is a vote for consumer harm. A  vote for S. 1582 is a vote to plant the seeds for the next financial  crisis. A vote for S. 1582 is a vote to endanger our national security.\n\nThat is why I will be voting ``no'' on S. 1582, the GENIUS Act, and I  urge…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693839/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…school. By providing Joliet  firefighters with the tools to help individuals facing trauma, these  first responders are able to recognize the signs of stress, and plant  the seeds of a healthier tomorrow. It also helps the firefighters  understand their own mental health needs from the strains of the job,  so we can keep them healthy, too.\n\nAdditionally,…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688330/recognizing-the-joliet-emsfire-department-program"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…us down, we have  resisted and we have pushed this country closer to the ideals it claims  to hold.\n\nThey are trying to bury us, but what they don't realize is that we  are seeds and still we rise. I stand here a proud Black woman and a  proud member of the Congressional Black Caucus, and I refuse to stand  by while this administration tries to turn…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690636/trumps-first-100-days"}, {"senator": "Ben Cline", "party": "Republican", "sentence": "…Speaker, fewer than 10 percent of FFA chapters nationwide receive  this distinction. Warren County's students have set a new standard of  excellence, and they remind us that the seeds of leadership, once  planted, can grow into something that lifts up an entire community. I  am proud to honor them today.                       Denouncing Socialism in America…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696845/recognizing-50th-anniversary-of-opera-roanoke"}, {"senator": "Claudia Tenney", "party": "Republican", "sentence": "…our constitutional Republic and to keep the power in ``we the people''  than the sacred right to vote.\n\nDemocrats have continuously undermined election integrity, sowing the  seeds of mistrust with mail-in ballots, failing to provide ID, not  proving that there is, indeed, one citizen, one vote.\n\nThis bill merely requires that you prove that you are a…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700012/veterans-accessibility-advisory-committee-act-of-2025"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…has 15 milligrams. The bill before us nullifies all these  State laws and makes the hemp industry kaput.\n\nThe language in this bill will outlaw all current hemp plants and  seeds. It changes the definition of what a hemp plant is. It makes it  so low that there may not even be an existing plant that can meet the  parameters. But every plant in the country…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696661/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…and vegetables to the Cypress Elementary Cubs. As part of  the school's 4th Grade Science Lessons, students learn the farm-to- table concept by preparing the soil, planting seeds, nurturing the  seedlings into mature plants, harvesting and finally preparing and  consuming fresh produce. They learn the life cycle of plants and the  value of working for…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691924/recognizing-robert-obrien"}, {"senator": "Lloyd Smucker", "party": "Republican", "sentence": "Mr. SMUCKER. Mr. Speaker, I rise to recognize and congratulate Rohrer  Seeds, of Smoketown in Lancaster County, Pennsylvania, for over a  century in business.\n\nRohrer Seeds began in 1919 when P.L. Rohrer bought the business he  worked for and introduced…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700123/recognizing-rohrer-seeds-for-their-century-of-service"}, {"senator": "Kat Cammack", "party": "Republican", "sentence": "…game to become the three-time national champions,  winning the first title since the 2006-2007 season.\n\nLed by Coach Todd Golden, the Gators were one of four tournament one- seeds, advancing through the rounds of 64 and 32 before dancing their  way through the Sweet 16, Elite Eight, and Final Four.\n\nAfter winning the title this week, the Gators ended…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690032/recognizing-the-florida-gators"}]