[{"senator": "Bennie Thompson", "party": "Democrat", "sentence": "…Reunion, to be held on August 28-29,       2025, at the Leflore County Civic Center;\n\nWhereas this reunion not only honors the rich legacy of       Amanda Elzy High School but also seeks to highlight the       school's uncertain future due to funding challenges-making       this celebration both a joyful and urgent call to preserve an       institution that…", "date": "2025-08-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694753/recognizing-the-amanda-elzy-high-school-multi-year-reunion"}, {"senator": "Rob Menendez", "party": "Democrat", "sentence": "…one, not a single person should feel  safe with him as our President.\n\nThis administration's extreme agenda does not reflect the best of who  we are as a country but, instead, seeks to turn us against each other.  We cannot allow that to happen.", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698775/holding-ice-accountable"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…violation of the Constitution.\n\nAnd let me be clear about one final point: Such a brazen attempt  would not merely be unlawful; it would also be impeachable. A President  who seeks to seize control of elections is attacking the constitutional  order itself, and that is precisely the kind of abuse of power for  which impeachment exists, not as a partisan…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700022/disapproving-the-action-of-the-district-of-columbia-council-in-approving-the-dc-income-and-franchise-tax-conformity-and-revision-temporary-amendment-act-of-2025"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…the pockets of eight Senators that  we know of by allowing them to sue the government for millions of  dollars if the Department of Justice subpoenas their phone records or  seeks a lawful nondisclosure order.\n\nWhile families in my district are stretching every single dollar just  to pay for food and rent, Senators want to get a personal payout if law…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696743/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Jim Clyburn", "party": "Democrat", "sentence": "…make far less frequent by its dismantling of the Department of  Education and of mutually beneficial international trade.\n\nIt is sadly no surprise that this administration seeks to prevent the  teaching and celebrating of these types of moments in our schools and  museums.\n\nI'll close by reiterating the admonition to my Republican colleagues  I shared…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689638/education-is-of-great-importance-to-congressional-black-caucus-congress-and-constituents"}, {"senator": "Val Hoyle", "party": "Democrat", "sentence": "H.R. 131 seeks to address a longstanding water challenge in  southeastern Colorado. The Arkansas Valley Conduit is a 130-mile  pipeline first authorized in 1962 to deliver water from the…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693877/finish-the-arkansas-valley-conduit-act"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…and I'm proud to work with a bipartisan group of Members to  remove an outdated and unnecessary regulatory barrier.\n\nFinally, the Access to Small Business Investor Capital Act seeks to  resolve the AFFE issue with BDCs being removed from indices by  eliminating the double counting of fees and, consistent with this  intent, it is expected that comparable…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697831/increasing-investor-opportunities-act"}, {"senator": "Jonathan Jackson", "party": "Democrat", "sentence": "…District's local sovereignty. It  would fundamentally alter D.C.'s criminal justice system by reducing  the eligibility age for the Youth Rehabilitation Act (YRA) from 24 to  18. It seeks to eliminate judicial discretion to impose sentences below  mandatory minimums, and would restrict vital alternatives like  probation, community service, and the ability to…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695721/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Dave Min", "party": "Democrat", "sentence": "Mr. MIN. Madam Chair, I rise today in opposition to the disastrous  GOP budget resolution.\n\nThis bill seeks to cut $3 trillion in spending, supposedly by  targeting waste and fraud, but the entire domestic discretionary budget  is only $917 billion, and that simply doesn't add up.…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688058/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Mary Scanlon", "party": "Democrat", "sentence": "…laundering, and pardoned  the former owner of the Silk Road who was responsible for selling  hundreds of millions of dollars' worth of drugs on the deep web.\n\nApparently, anyone who seeks to buy influence in this White House  simply has to find one of the President's companies or meme coins and  make a sizable investment. Emiratis and Saudis are investing in…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693551/providing-for-consideration-of-hr-department-of-defense-appropriations-act-providing-for-consideration-of-hr-digital-asset-market-clarity-act-of-providing-for-consideration-of-hr-anti-cbdc-surveillance-state-act-providing-for-consideration-of-s-guiding-and-establishing-national-innovation-for-us-stablecoins-act-and-waiving-a-requirement-of-clause-6a-of-rule-xiii-with-respect-to-consideration-of-certain-resolutions-reported-from-the-committee-on-rules"}, {"senator": "Sarah Elfreth", "party": "Democrat", "sentence": "…ELFRETH. Madam Chair, I rise in opposition to the amendment.\n\nMs. ELFRETH. Madam Chair, House Natural Resources Committee Democrats  strongly oppose Biggs amendment No. 29, which seeks to weaken the  Department of Defense's work to preserve habitats crucial for military  readiness and recovering vulnerable species.\n\nThe DOD covers millions of acres, spanning…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695231/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "John Garamendi", "party": "Democrat", "sentence": "…there are numerous examples where outsourcing  inspection work to private contractors has undermined public safety,  delayed projects, and contributed to cost overruns. Our bill seeks to  avoid these potential conflicts of interest, while also mandating  public disclosure of any private inspection contracts used by state and  local transportation departments…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692433/introduction-of-the-public-inspectors-for-safe-infrastructure-act"}, {"senator": "Bobby Scott", "party": "Democrat", "sentence": "…are able to verify that China poses a credible  threat to our K-12 schools, this bill, as written, does nothing to  actually address any national security threats. Instead, it seeks to  punish schools for accepting educational materials or participating in  cultural exchange programs. Actually, our schools would be the victims  of the undue foreign influence,…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697533/promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…reliable, affordable power.\n\nThis bill provides $3.1 billion for energy efficiency and renewable  energy programs, an increase of $1.3 billion over the Republican bill.  Our goal seeks to secure U.S. energy independence in perpetuity to  drive down prices for the long haul.\n\nFurther, with $8.4 billion allocated for the Department of Energy's  Office of Science,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698752/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Bennie Thompson", "party": "Democrat", "sentence": "Mr. Speaker, H.R. 881, the DHS Restrictions on Confucius Institutes  and Chinese Entities of Concern Act seeks to help address the threat  posed to U.S. colleges and universities by the People's Republic of  China and Chinese Communist Party.\n\nThe People's Republic of China and the…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690827/dhs-restrictions-on-confucius-institutes-and-chinese-entities-of-concern-act"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…resources is vital, particularly in a State like Florida where growing  our economy is contingent on protecting the environment.\n\nMr. Chair, that is why the Bean amendment seeks to codify the  permitting program administered by the States of Florida, Michigan, and  New Jersey, and to provide certainty to the other States lined up to do  the same.…", "date": "2025-12-11", "source_url": "https://justfacts.votesmart.org/public-statement/1698026/promoting-efficient-review-for-modern-infrastructure-today-act"}, {"senator": "Bob Latta", "party": "Republican", "sentence": "…existing NTIA Office of Policy Analysis and Development to  the Office of Policy Development and Cybersecurity and codifies the  existing activities of the office.\n\nH.R. 1766 seeks to promote effective information sharing,  collaboration, and response efforts established in the Secure and  Trusted Communications Networks Act. The legislation also facilitates…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693497/ntia-policy-and-cybersecurity-coordination-act"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…veterans often face barriers when starting or  growing their businesses. Chief among them are access to capital and  general awareness of available resources.\n\nThe SERV Act seeks to reduce those barriers by directing the  Interagency Task Force on Veterans Small Business Development to create  an action plan to improve outreach to veterans and inform…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687890/successful-entrepreneurship-for-reservists-and-veterans-act"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…challenges in the Department, including a specific  focus on the Joint Strike Fighter and amphibious ship readiness  concerns.\n\nThis bill reestablishes safety as a culture and seeks to partially  correct the mistakes that led up to the Black Hawk collision with a  commercial airliner here at DCA earlier this year.\n\nThis bill seeks to foundationally reform…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695145/streamlining-procurement-for-effective-execution-and-delivery-and-national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…U.S. Senate,      Washington, DC.\n\nDear Senator Daines: On behalf of over one thousand       employees, I write to express my strong support for S.J. Res.       61, which seeks to rescind the 2024 Miles City Resource       Management Plan Amendment (``RMPA'') under the Congressional       Review Act (``CRA''). Navajo Transitional Energy Company, LLC…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694888/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-miles-city-field-office-record-of-decision-and-approved-resource-management-plan-amendment"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…The judiciary is appointed for the sole purpose of  resolving cases and controversies brought to it by individual injured  parties. Traditionally, that means an injured party seeks redress  through his local district court. This simple process ensures decisions  are limited to the unique circumstances of the individuals involved and  are restricted to…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689722/no-rogue-rulings-act-of-2025"}, {"senator": "John Moolenaar", "party": "Republican", "sentence": "Mr. MOOLENAAR. Mr. Speaker, I thank the chairman for this time.\n\nChina is our Nation's greatest adversary, and it seeks to harm our  country on a daily basis. It thrives in the shadows. It uses fentanyl  precursors, predatory trade practices, and cyberattacks to hurt us.\n\nChina also uses informational…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697437/transparency-in-reporting-of-adversarial-contributions-to-education-act"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…postpone the effective  date of these standards, providing breathing room for businesses.  However, more work needs to be done; and Congress has a role to play.\n\nMy resolution seeks to ensure that these overreaching regulations are  permanently overturned. By doing so, we will protect small businesses  from unnecessary compliance costs and preserve the…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689262/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…only include historic mine residue.\n\n``(4) Community reclaimer defined.--For purposes of this       section, the term `Community Reclaimer' means any person       who--\n\n``(A) seeks to voluntarily assist a State with a       reclamation project under this section, which may include       companies that currently hold reclamation liability elsewhere…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691092/community-reclamation-partnerships-act-of-2025"}, {"senator": "Mike Kennedy", "party": "Republican", "sentence": "…KENNEDY of Utah. Mr. Speaker, I rise today to support the passage  of my legislation, the United States Research Protection Act. H.R. 1318  is a critical piece of legislation that seeks to protect the future of  our Nation's scientific and technological advancement. The stakes could  not be higher in this era of rapid global innovation and increasingly  complex…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688932/united-states-research-protection-act"}, {"senator": "John Hoeven", "party": "Republican", "sentence": "…the Biden administration's North Dakota resource management plan  ignores that record of responsible energy development. Instead, the  North Dakota resource management plan seeks to curtail coal, oil, and  gas production by locking away taxpayer-owned energy reserves and  jeopardizing our Nation's energy security.\n\nUnder this plan, nearly 213,000 acres--or…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696141/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…the  Federal formula for student aid, counting assets in small businesses  and family farms as part of the family's net worth. My Family Farm and  Small Business Exemption Act seeks to correct this flaw and to level  the playing field for students who come from these families.\n\nWhen these students are applying for higher education financial aid,  assets…", "date": "2025-05-06", "source_url": "https://justfacts.votesmart.org/public-statement/1690715/help-small-businesses-thrive-again"}, {"senator": "Byron Donalds", "party": "Republican", "sentence": "…Service to approve a State-submitted wildlife action plan, with most  taking over 18 months to simply get an approval. This is something that  is unacceptable, and my legislation seeks to change that.\n\nThe bill directs the Secretary of the Interior to approve a State's  SWAP within 180 days, once the Secretary determines the SWAP complies  with the requirements…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697625/make-state-wildlife-action-plans-efficient-act-of-2025"}, {"senator": "Ann Wagner", "party": "Republican", "sentence": "…policies.\n\nTaiwan's per capital GDP has grown more than 35 times larger since  the end of the Chinese Civil War. The island has crucial insights to  offer an institution that seeks to put its borrowers on stable footing.  It is long overdue for Taiwan to receive the recognition and  representation it rightfully deserves at the IMF.\n\nMr. Speaker, I urge…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692796/taiwan-non-discrimination-act-of-2025"}, {"senator": "Ted Cruz", "party": "Republican", "sentence": "…This is what good leadership looks like. Not command and       control, but compassion and service. Not someone who thinks       they have all the answers, but someone who seeks first to       understand.\n\nI have never witnessed a leader at his level, a man who       leads an entire national agency, show such humility,       humanity, and heart. Kennedy…", "date": "2025-10-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696063/texas-measles-outbreak"}]