[{"senator": "Shontel Brown", "party": "Democrat", "sentence": "…this what it is: Trump's resegregation agenda.\n\nWe know what happens when prejudice prevails. Opportunity is  obstructed, and red lines are drawn with Federal funds. We have seen  this story before.\n\nYet despite the dark clouds gathering above 1600 Pennsylvania Avenue,  Black Americans have long battled bigotry, broken barriers, and built a  brighter…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688144/recognizing-resilience-resistance-and-relentless-struggle-lessons-of-black-history"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…for our democracy. The  start of Donald Trump's second term has been the worst start of any  President's in modern times. He now has the lowest approvals any  President has seen through his first 100 days since they started  polling 80 years ago.\n\nTomorrow night, Senate Democrats will take to the floor to highlight  the disaster of Donald Trump's first…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690262/trump-administration-first-100-days"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…strangers became  regulars. A community was brought closer together.\n\nOwner Dean Yakumithis and his team built a place where hard work  mattered. Coffee stayed warm. People felt seen and appreciated. Though  the doors have now closed, the spirit of that table endures in every  single life that Tim touched. There were thousands.\n\nLet us keep Tim's memory…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699337/applauding-president-zelenskyys-address-in-davos"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…provider whose name and phone       number were posted online by a local activist said that ever       since then, her phone has been ``flooded'' with calls, and       she has seen people loitering around her home with recording       devices. The San Diego Union-Tribune is not identifying her       due to safety concerns.\n\n``This has raised serious safety…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699222/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…administration.\n\nRepresentative Garcia, I had not heard the story about your request  to the Ambassador to do a welfare check.\n\nThis is one picture of Andry Hernandez. I have seen other pictures of  him, other photographs. It is hard for, I think, anyone who looks at  these photographs to believe that Andry is a dangerous member of the  Tren de Aragua…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690506/trump-immigration-policies"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…after violent crime, hate crime, to defend the victims of rape and  sexual assault, and my colleague changes the subject once again to talk  about weaponization.\n\nWe have never seen weaponization of the government like what we have  seen under Donald Trump and his Department of Justice. The first thing  they did was they got rid of a dozen experienced veteran…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691030/expressing-support-for-local-law-enforcement-officers"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…known to many  back home as ``Coopdawg,'' has spent years fighting for veterans in New  Mexico.\n\nAs chairman of the Lincoln/Otero County Veterans Leadership Council,  he has seen firsthand the barriers that rural veterans face: long  travel times for medical care, unreliable transportation, and a system  that too often overlooks them.\n\nHis advocacy directly…", "date": "2025-03-03", "source_url": "https://justfacts.votesmart.org/public-statement/1688352/ensuring-veterans-receive-care-they-earned"}, {"senator": "Chris Deluzio", "party": "Democrat", "sentence": "…alternative, a bold enough  alternative.\n\nWhile the President's numbers may be in free fall, we also see  favorability of the Democratic Party at record lows, the lowest CNN has  seen since 1992. There has not been a strong enough vision from  Democrats on this side of the aisle when we have something to say.\n\nOur party needs to change, and economic populism…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689080/economic-populism"}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "…I hope we can turn things around here in the coming weeks. But in  my lifetime, and certainly in my time in public office and in my time  serving this country, I have never seen anything like I have seen this  week.", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692559/alex-padilla"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…additional shots fired as she passed by through her  window--the window was not up; it was not elevated--through her window.  We do know that she died. We do know because we have seen it.\n\nNow, you can justify this if you would like, but you can't justify  the Justice Department concluding that it would not cooperate with the  local authorities with the investigation,…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699134/where-do-you-stand"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…killings are not only horrifying for Minnesota but a tragedy  for America. This heinous act of political violence defies American  values and democracy.\n\nUnfortunately, we have seen a disturbing increase in political  violence in recent years, seemingly, as part of a misguided and  sickening attempt to strike fear and intimidation in the hearts of the…", "date": "2025-06-16", "source_url": "https://justfacts.votesmart.org/public-statement/1692572/minnesota-lawmakers-shooting"}, {"senator": "Jake Auchincloss", "party": "Democrat", "sentence": "…Therapists pack up their tools of possibility--      Weighted vests, sensory brushes,      Piece of someone's future      Now deemed too expensive      By men who've never seen      How a body learns to trust itself      One careful touch at a time.      Listen to power chairs going still,      To screens falling dark in throats      That borrow them…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690834/advocating-against-medicaid-cuts"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…insurance premiums don't skyrocket.\n\nThis CR, this dirty CR, which does nothing to solve the healthcare  crisis, is one of the most immoral, unethical, evil things that I have  ever seen happen in all of my time in Congress. It is just part of a  larger pattern of indifference from Republicans that we have seen time  after time after time.\n\nWhen the billionaire…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696693/providing-for-consideration-of-senate-amendment-to-hr-continuing-appropriations-and-extensions-act-2026"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…their voting rolls, which is specifically directed perhaps at electoral  interference.\n\nMr. REED. Well, I concur.\n\nIf I may raise one additional question?\n\nMr. REED. You have seen firsthand what is happening in Portland. It  is outrageous. The situation has been completely distorted by the  President to suggest that there is major civil upheaval. That…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696343/trump-administration"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…introduced  in Congress in 1909, it was not until 1925--after more than 30 bills  had been introduced--that the Federal Probation Act came to fruition.\n\nSince passage, we have seen the life-changing effects of probation as  an alternative to prison. This is especially true for past offenders  suffering from substance abuse and mental health challenges.…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688628/100th-anniversary-passage-of-the-federal-probation-act-of-1925"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…Democrats talk about indigenous people, people  of color, how much they care about minority communities. When it comes  to my State, these guys target Alaska Natives. I have seen it my whole  career. I mean, geez, the minority leader--the guy goes after Alaska  Natives like they are some kind of criminals. It is outrageous.\n\nThis is a bill for indigenous…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696959/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-extension-of-deadlines-in-standards-of-performance-for-new-reconstructed-and-modified-sources-and-emissions-guidelines-for-existing-sources-oil-and-natural-gas-sector-climate"}, {"senator": "Ryan Zinke", "party": "Republican", "sentence": "…minerals are  found in Twin Metals in the great State of Minnesota.\n\nNow, is it in the boundary waters? Is it in the area that is  protected around it? No, it is not.\n\nI have seen these wonderful pictures of canoeing, of waters, of  streams, of lakes, and they are absolutely beautiful. The problem is  that is in the boundary waters. That is not where…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699276/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-public-land-order-no-7917-for-withdrawal-of-federal-lands-cook-lake-and-saint-louis-counties-mn"}, {"senator": "Blake Moore", "party": "Republican", "sentence": "…year.\n\nHonoring Mark Roman\n\nMr. MOORE of Utah. Mr. Speaker, I will briefly add that I had the  opportunity to serve on Chairman Smith's Ways and Means Committee, and  I have seen the work that Mark Roman did, mostly behind the scenes, the  stress that he is put under, and the outcomes that we have delivered.\n\nOftentimes, we don't talk about this being…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699706/historic-tax-relief-for-families"}, {"senator": "Pat Ryan", "party": "Republican", "sentence": "…allowing them to expand their important environmental work into other  communities in Orange County and across the Hudson Valley.\n\nI have been out there with this crew and seen them work in the cold  and the heat. Their relentless efforts to combat littering and to  really bring our community together in a positive way while doing so is  a truly commendable…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694021/recognizing-cornwall-cleanup-crew"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…mergers. In fact, what we want  to do here with the resolution disapproving of this is to actually  force the agencies to make a decision one way or the other.\n\nThe problem we have seen, especially in the previous administration,  is not necessarily that they disapproved a merger. They just didn't  make a decision. If it is in the interest of financial stability…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691498/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "Erin Houchin", "party": "Republican", "sentence": "…percent growth in 2018 and 2.6 percent growth in 2019,  well above CBO's pre-Tax Cuts and Jobs Act projections of 2.2 percent  and 1.7 percent respectively.\n\nMeanwhile, we have seen what Bidenflation has cost American families.\n\nAgain, this budget resolution does not cut a single specific program  or benefit. The budget resolution sets a framework. It is…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688089/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-waste-emissions-charge-for-petroleum-and-natural-gas-systems-procedures-for-facilitating-compliance-including-netting-and-exemptions-and-providing-for-consideration-of-h-con-res-concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Josh Hawley", "party": "Republican", "sentence": "…surged to 104  million. Think about that--104 million reported sexually abusive  images. That is up from merely 450,000 as early as 2004. In the space  of 20 years, we have seen an explosion of sexual abuse material online.\n\nThe data does not lie. Our children are not safe. But I also know it  because whistleblowers tell us. The experts from these companies…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697735/9999"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…faculty-level  disclosures and imposes real penalties for noncompliance, including  loss of title IV funds.\n\nThe good news, Mr. Chair, is that over the last year or so we have  seen a reckoning begin in higher education in this country, and we are  starting to see very positive changes. A number of university  presidents have lost their jobs, and universities…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689035/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…States  has dropped sanctions against Mr. Dodik and his family.\n\nI am all for rewarding this good behavior, but there are very good  reasons to believe that Mr. Dodik has not seen the error of his ways.  Mr. Dodik, since, falsely alleged that he was still the rightful  President of RS, questioned whether Bosnia and Herzegovina should  continue to exist--and…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696528/bosnia"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…However, today nearly three in four school- age children are not getting their recommended daily intake of dairy.\n\nSince whole milk was removed from schools in 2012, we have seen  declines in milk consumption, increased food waste, and growing  concerns about childhood nutrition. This legislation is a commonsense  solution that simply gives schools the…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692463/national-dairy-month"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "…things. This is the way we do  things elsewhere in the Senate where we have got noncontroversial  legislation. Let's move them forward. Now, we have moved them forward.  You have seen pairings here; Democratic bills brought to the floor, not  stitched together surgically in one legislative package but paper- clipped together in one stack so that we are presenting…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698423/unanimous-consent-requests-the-calendar"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…the leader will protect the broader membership and  broader Members--on votes and different things. That is kind of what  leadership is about.\n\nThis is the first time I have seen in my entire time here in the U.S.  Senate where, on the Democrat side, the broader membership seems to be  protecting just the leader. We all know why. He is worried about…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696006/en-bloc-nominations"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…the energy needs that AI creates. This summit is  huge. It is huge for the Commonwealth, for Pennsylvania, and for  America.\n\nUnder the Trump administration, we have already seen historic  investments in the Pennsylvania economy, including the Nippon and U.S.  Steel merger and Amazon's $20 billion investment in building data  centers in the Commonwealth.…", "date": "2025-07-14", "source_url": "https://justfacts.votesmart.org/public-statement/1693458/golden-age-of-america-has-arrived"}, {"senator": "John Thune", "party": "Republican", "sentence": "…been complied with. And there was a reckless tax-and- spending spree that caused a yearslong inflation crisis. Inflation got  up in the double-digit range--something we haven't seen in several  decades.\n\nRepublicans have spent the last year cleaning up from the  consequences of Democrats' Big Government philosophy. President Trump  has repealed a number…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697344/biden-administration"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…President  Donald Trump for the executive actions he has taken to secure our  southern border. Thanks to his leadership, illegal crossings have  dropped to the lowest level we have seen in decades. Our communities  have suffered for too long under Joe Biden's failed open-border  policies.\n\nCrime has surged, fentanyl has poured in, and American jobs have been…", "date": "2025-03-04", "source_url": "https://justfacts.votesmart.org/public-statement/1688462/america-deserves-president-trump"}]