[{"senator": "Al Green", "party": "Democrat", "sentence": "…understanding of it within the mind to conclude that this  is not classified information.\n\nToo many experts differ with him. We had persons who are on the  Permanent Select Committee on Intelligence in the House to indicate  that this was clearly classified information. In fact, they indicated  that things that are less serious in nature have been classified.…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689201/and-still-i-rise-censured-but-not-silenced"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Ambassador, retired; Christopher Dell, US       Ambassador, retired; Anne E. Derse, US Ambassador, retired;       Vicki Divoll, Former General Counsel, Senate Select Committee       on Intelligence; Mary Draper, Senior Foreign Service Officer,       retired; Melvin Dubee, Former Deputy Staff Director, Senate       Select Committee on Intelligence; Martha…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691413/recognizing-assault-on-american-diplomacy"}, {"senator": "John Larson", "party": "Democrat", "sentence": "…I had to explain to my daughter when she said: Do you mean your  granddaughter won't see these programs?\n\nI said: Well, I went to  Jim Himes on the Permanent Select Committee  on Intelligence, and I asked him if he had heard anything about wokeism  or what does woke mean?\n\nJim looked around the room. He was a little cautious, and he said:  Well, woke…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693050/defunding-sesame-street"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "…martial law to stop the peaceful transfer of  power to stop Joe Biden from becoming President, decided that Stacey  Plaskett should no longer be on the Permanent Select Committee on  Intelligence. We spent half a day on that.\n\nCongresswoman Mace decided that Cory Mills should no longer be on  committees. Apparently, we may do another one.\n\nI prepared a…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697156/denouncing-the-horrors-of-socialism"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "…think, would offend the sensibility of anybody  in this Chamber.\n\nI am going to limit my remarks to two things I know very well: number  one, the House Permanent Select Committee on Intelligence and what we  need to do to preserve that very special environment; and, number two,  the character of Delegate Stacey Plaskett. On HPSCI, I have served for  10…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696894/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "…the Intelligence Authorization  Act. I thank, again, the chairman and ranking member. I thank Chairman  Crawford and all members and staff of the House Permanent Select  Committee on Intelligence who contributed to this important  legislation.\n\nIn both the unclassified text and the classified annex, the bill  enhances congressional oversight of the intelligence…", "date": "2025-12-10", "source_url": "https://justfacts.votesmart.org/public-statement/1697797/disinterment-of-remains-of-fernando-v-cota-from-fort-sam-houston-national-cemetery-texas"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…the United States.\n\nI first got to know Kevin and his wife Therese over a decade ago. But  now, more recently, as chairman and now vice chairman of the Senate  Select Committee on Intelligence, I have had the pleasure of working  with Ambassador Rudd on some of the most pressing challenges of our  time.\n\nWith his departure, we are going to bid farewell…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699544/9999"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…for  inappropriate coordination with convicted  sex offender Jeffrey Epstein during a congressional hearing and  removing Delegate Plaskett from the Permanent Select Committee on  Intelligence and referring her to the Ethics Committee for further  investigation.\n\nAfter 4 years of silence on this matter, there was not a peep during  the entire Biden…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696888/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Andrew Garbarino", "party": "Republican", "sentence": "…committees.--The term       ``appropriate congressional committees'' means--\n\n(A) the Committee on Homeland Security, the Committee on       Judiciary, and the Select Committee on Intelligence of the       House of Representatives; and\n\n(B) the Committee on Homeland Security and Governmental       Affairs, the Committee on Judiciary, and the Select Committee…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696755/strengthening-cyber-resilience-against-state-sponsored-threats-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…Finance, the Committee on Foreign Relations,       the Committee on Homeland Security and Governmental Affairs,       the Committee on the Judiciary, and the Select Committee on       Intelligence of the Senate; and\n\n(B) the Committee on Financial Services, the Committee on       Foreign Affairs, the Committee on Homeland Security, the       Committee…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693963/financial-technology-protection-act-of-2025"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "Convening of Meetings\n\n1.1. The regular meeting day of the Select Committee on       Intelligence for the transaction of Committee business shall       be every Tuesday of each month that the Senate is in session,       unless otherwise directed by the Chairman.…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688225/us-senate-select-committee-on-intelligence-rules-of-procedure"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "Mr. COTTON. Mr. President, this explanation reflects the status of  negotiations and disposition of issues  reached between the Senate Select Committee on Intelligence and the  House Permanent Select Committee on Intelligence for the Intelligence  Authorization Act for Fiscal Year 2026.\n\nThe explanation shall have the same effect…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698262/explanatory-statement-for-the-intelligence-authorization-act-for-fiscal-year-2026"}, {"senator": "Rick Crawford", "party": "Republican", "sentence": "…the  world of a freedom-killing, murderous dictator. We are all better for  it.\n\nMr. Speaker, I now recognize my friend, vice chairman of the House  Permanent Select Committee on Intelligence, the gentleman from  Mississippi (Mr. Kelly).\n\nMr. CRAWFORD. Mr. Speaker, I thank the gentleman from Mississippi for  his remarks.\n\nMr. CRAWFORD. Mr. Speaker,…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698882/successful-operation-to-arrest-nicolas-maduro"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…Financial Services of the House of       Representatives;\n\n(D) the Committee on Banking, Housing, and Urban Affairs of       the Senate;\n\n(E) the House Permanent Select Committee on Intelligence;\n\n(F) the Senate Select Committee on Intelligence;\n\n(G) the Committee on Appropriations of the House of       Representatives; and\n\n(H) the Committee on Appropriations…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694815/haiti-criminal-collusion-transparency-act-of-2025"}, {"senator": "Michael Guest", "party": "Republican", "sentence": "…Appropriate congressional committees.--The term       ``appropriate congressional committees'' means the Committee       on Homeland Security, the Permanent Select Committee on       Intelligence, and the Committee on Energy and Commerce of the       House of Representatives and the Committee on Homeland       Security and Governmental Affairs, the Select…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696919/generative-ai-terrorism-risk-assessment-act"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…committees of congress.--In this section,       the term ``appropriate committees of Congress'' means--\n\n(A) the Committee on Foreign Relations of the Senate, the       Select Committee on Intelligence of the Senate, and the       Committee on Armed Services of the Senate; and\n\n(B) the Committee on Foreign Affairs of the House of       Representatives, the Permanent…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690702/mobilizing-and-enhancing-georgias-options-for-building-accountability-resilience-and-independence-act"}, {"senator": "William Timmons", "party": "Republican", "sentence": "…element of the intelligence       community receives the assessment, by the head of the element       of the intelligence community to--\n\n(A) the Director;\n\n(B) the Select Committee on Intelligence of the Senate; and\n\n(C) the Permanent Select Committee on Intelligence of the       House of Representatives.       SEC. 4. SOFTWARE MODERNIZATION PLANNING AT…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698153/strengthening-agency-management-and-oversight-of-software-assets-act"}, {"senator": "Darin LaHood", "party": "Republican", "sentence": "…blind eye to the transshipment of their cocaine and  other drugs across our borders.\n\nI thank Chairman Crawford, and I thank the members of the House  Permanent Select Committee on Intelligence for being here tonight and  look forward to continuing to work with the Trump administration to  make the Western Hemisphere a safer place.", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698885/successful-operation-to-arrest-nicolas-maduro"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…Committee on Aging is authorized to meet during the  session of the Senate on Wednesday, January 14, 2026, at 3:30 p.m., to  conduct a hearing.                       SELECT COMMITTEE ON INTELLIGENCE\n\nThe Select Committee on Intelligence is authorized to meet during the  session of the Senate on Wednesday, January 14, 2026, at 3 p.m., to  conduct a closed briefing.", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699122/authority-for-commitfees-to-meet"}, {"senator": "Ralph Norman, Jr.", "party": "Republican", "sentence": "…privileges of  the House.\n\nThe form of the resolution is as follows:\n\nCensuring and condemning Delegate Stacey Plaskett and removing her  from the House Permanent Select Committee on Intelligence for conduct  that reflects discreditably on the House of Representatives for  colluding with convicted felony sex offender Jeffrey Epstein during a  congressional…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696890/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Ronny Jackson", "party": "Republican", "sentence": "…Jeff was instrumental in my success  on the House Armed Services Committee, House Agriculture Committee,  House Foreign Affairs Committee, and House Permanent Select Committee  on Intelligence. He provided key legislative guidance that strengthened  our national security and helped assemble a top-tier team to serve the  people of Texas Thirteen.\n\nCurrently,…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690377/recognizing-the-career-of-jeffery-ronald-billman"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…investigated by Ethics, by DOJ, and I would  recommend by the Oversight and Judiciary Committees. Meanwhile,  she should absolutely be removed from the House Permanent Select  Committee on Intelligence. This, Mr. Speaker, is my position. I present  it without note for the betterment of the debate of this body.", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696892/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}]