[{"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…can influence the  makeup of the FTC by nominating new members--as President Trump has  done by nominating Mr. Meador--and appointing the Chair--as President  Trump did by selecting Mr. Ferguson--and even appointing a new Chair if  the President is displeased with his initial selection.\n\nHad the President not taken this illegal action, Republican  Commissioners…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1689985/confirmation-of-mark-meador"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…disabilities in the  workforce. In 2001, the Department of Labor's Office of Disability  Employment Policy (ODEP) was created and was given responsibility for  NDEAM and for selecting and helping promote its annual theme.\n\nThis year's theme is ``Celebrating Value and Talent'', which reminds  us that Americans with disabilities bring innovation, resilience,…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696023/recognizing-national-disability-employment-awareness-month"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…qualifications for       judicial office; and (c) recommending the three most       qualified applicants to the President of the United States       for his or her consideration in selecting a nominee to fill       each judicial vacancy on the District of Columbia Court of       Appeals and the Superior Court of the District of Columbia.\n\nSince its first list…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695614/district-of-columbia-judicial-nominations-reform-act"}, {"senator": "Adelita Grijalva", "party": "Democrat", "sentence": "…Mr. Speaker, I thank Representatives Rivas and Randall  for leading on this very urgent healthcare issue.\n\nMillions of Americans who depend on the Affordable Care Act are  selecting their plans right now, and what they are seeing are  healthcare options that they cannot afford due to Republicans' refusal  to extend premium assistance.\n\nI am here today…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698664/protecting-healthcare-for-millions-of-americans"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…exploration.\n\nThe Department of Energy and NASA's partnership is already  demonstrating impressive results. For example, earlier this year, NASA  and the DOE collaborated on selecting an award for continued industry  work on a space microreactor design that could provide a supply of  power for use on the Moon and beyond.\n\nJust last week, scientists posted…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688987/doe-and-nasa-interagency-research-coordination-act"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…Age.--The applicant shall be not less than 19 years       old and not more than 31 years old as of September 30 of the       fiscal year in which the Program selection panel selecting       such applicant convenes, or an age otherwise determined by       the Commandant.\n\n``(2) Character.--\n\n``(A) In general.--The applicant shall be of outstanding…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…that it was effectively a ``No Development'' plan and made  nearly 1.2 million acres unavailable for leasing or exploration. On  December 9, 2024, DOI issued its 2024 ROD selecting Alternative D2's  terms and conditions for the oil and gas program. The December 2024  ROD's terms were so limiting that they would make leasing, exploration,  and development…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697739/9999"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…School junior, has once again earned the prestigious opportunity to  perform with the Pittsburgh Symphony Orchestra.\n\nThe Student Side-By-Side program is highly competitive, selecting  only the most dedicated and talented student musicians from across the  region. Sorren's invitation back for a second year is a testament to  his exceptional talent on the…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689957/recognizing-sorren-morelli"}, {"senator": "Bill Huizenga", "party": "Republican", "sentence": "…return, meaning more money in the pockets of  the investor.\n\nBrokerage window participants are bypassing the investments selected  by the plan's investment fiduciaries and self-selecting investments for  their retirement savings.\n\nAgain, Mr. Speaker, this is about whether you want to be involved in  your own retirement savings decisions. I do, by the way.…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699155/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "Rick Allen", "party": "Republican", "sentence": "…advance radical policies  and favors to crony capitalists.\n\nThe bill declares that race, color, religion, sex, or national origin  may not be taken into consideration when selecting a fiduciary,  counsel, employee, or service provider of an ERISA plan.\n\nLastly, it implements a notice requirement on defined contribution  plans, explaining the difference…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699156/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "David Taylor", "party": "Republican", "sentence": "…technical assistance       providers to support communities, including--\n\n(A) a description of the criteria, evaluation process, and       contracting mechanisms used for selecting such providers;\n\n(B) a description of the extent of coordination with State,       Tribal, and regional partners in the selection and deployment       of such providers;…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695402/water-resources-technical-assistance-review-act"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…strengthens fairness and nondiscrimination in  the selection of service providers. It states clearly that race, color,  religion, sex, or national origin may not be considered when selecting  fiduciaries, counsel, employees, or service providers for ERISA plans.  Retirement plan service providers should be chosen on performance and  price, not on ideology or…", "date": "2026-01-15", "source_url": "https://justfacts.votesmart.org/public-statement/1699160/protecting-prudent-investment-of-retirement-savings-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…days of the Civil  War.\n\nThe Senate revived the ceremonial reading in 1888, and each year  since 1896, the Senate has observed George Washington's birthday in  February by selecting a Senator, alternating parties, to read the  7,641-word statement in their legislative session. This year,  fittingly, in this year of America250, our semiquincentennial,…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700272/president-washingtons-farewell-address"}, {"senator": "French Hill", "party": "Republican", "sentence": "…established by the Corporation not later than       1 year after the date of enactment of this subparagraph.\n\n``(iv) Report to congress.--Not later than 30 days after       selecting an alternative described in clause (i), the       Corporation shall issue a report to the Committee on       Financial Services of the House of Representatives and the…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699797/housing-for-the-21st-century-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…the whole world burns.\n\nThis perversion of Federal elections simply cannot be tolerated by  the United States Congress. We have a duty to protect the rights of  voters in selecting their Representatives in this body, and we have the  authority to do so under the Elections Clause of the U.S. Constitution.\n\nPursuant to that authority, I have introduced…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694777/protecting-representative-form-of-government"}]