[{"senator": "Morgan McGarvey", "party": "Democrat", "sentence": "…oath and chose to commit themselves to a higher purpose.\n\nWhile every individual servicemember makes sacrifices and dedicates  themselves to this path of honor, there are a select few who  distinguish themselves from the rest.\n\nThe Medal of Honor cannot be won. It must be earned through extreme  selflessness and bravery. We recognize this distinguished…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688216/medal-of-honor-act"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "…Let's be honest about what this bill is really about. It is not about  the Constitution. It is about partisanship. The House majority wants to  give Donald Trump the ability to select judges for local municipal  matters for Washington, D.C., and bypass the current commission process  that exists.\n\nThis is another attempt for Republicans to try to gut D.C.'s…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695613/district-of-columbia-judicial-nominations-reform-act"}, {"senator": "Don Beyer, Jr.", "party": "Democrat", "sentence": "…preeminent environmental economist.\n\nMr. BEYER. Madam Chair, I yield 1 minute to the gentleman from  Illinois (Mr. Krishnamoorthi), who is the distinguished ranking member  of the Select Committee on the Strategic Competition Between the United  States and the Chinese Communist Party.\n\nMr. BEYER. Madam Chair, I yield 1\\1/2\\ minutes to the gentleman from  New…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688065/concurrent-resolution-on-the-budget-for-fiscal-year-2025"}, {"senator": "Hank Johnson, Jr.", "party": "Democrat", "sentence": "…oversight.\n\nHe has also violated the right to due process by dispatching armed,  masked, unidentifiable people, wearing plain clothes and tactical gear,  onto the streets of select American cities. They pull up on people,  jump out with assault weapons, force them into unmarked cars, and  disappear them. Their families learn days later that their loved…", "date": "2025-06-25", "source_url": "https://justfacts.votesmart.org/public-statement/1692929/holding-power-accountable"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…year--or last year.\n\nLet me be crystal clear. At least in my mind, these bans are not  about your safety or mine. These bans are about limiting access to the  American dream to a select few that the administration thinks look the  right way or worship the right god.\n\nBut it is not just the President--not just President Trump. On the  floor of this body, a…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698866/commerce-justice-science-energy-and-water-development-and-interior"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…the grid, and now this.\n\nThis is an important topic. I have gained a little bit of knowledge  not just from the Energy and Commerce Committee, but I serve on the  bipartisan Select Committee on the Strategic Competition Between the  United States and the Chinese Communist Party. My colleague, Republican   Rob Wittman, and I led a critical minerals working…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699992/securing-americas-critical-minerals-supply-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…The JNC's mission is straightforward: to recommend to the       President highly qualified individuals to fill judicial       vacancies on the District's local courts, and to select the       chief judges of the D.C. Court of Appeals and the Superior       Court of the District of Columbia. For more than five       decades, through rigorous evaluation…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695614/district-of-columbia-judicial-nominations-reform-act"}, {"senator": "Lou Correa", "party": "Democrat", "sentence": "…usually do.\n\nThis bill aims to improve the program's stability and strengthen  partnerships with at-risk cities by allowing the Countering Weapons of  Mass Destruction Office to select STC cities based on their  preparedness capabilities rather than UASI designations.\n\nThe bill, Mr. Speaker, also establishes performance metrics, enhances  oversight of expenditures,…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688696/securing-the-cities-improvement-act"}, {"senator": "Kathy Castor", "party": "Democrat", "sentence": "…shipping American  energy overseas to China to power their AI data centers and their  manufacturing is a risk, an economic risk, and a military risk?\n\nI also serve on the House Select Committee on the Strategic  Competition Between the United States and the Chinese Communist Party.  On that committee, we have heard over and over about the dangers of  Chinese…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697080/unlocking-our-domestic-lng-potential-act-of-2025"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…Sports Club; Parent: Michael Day,       Basketball. Lee-Mt. Vernon Sports Club.                             Providence District\n\nMale Athlete: Ben Ochsendorf Basketball, McLean Select/Nova       Cats AAU; Female Athlete: Ryan Elizabeth McIntosh, Swimming,       Poplar Heights Crush/Coach Mark Cruz, Volleyball, Vienna       Youth Inc. Parent: Mary Wong, Volleyball,…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697100/recognizing-the-recipients-of-the-2025-stephen-a-mclaughlin-fairfax-county-champions-of-character-awards"}, {"senator": "Janelle Bynum", "party": "Democrat", "sentence": "Ms. BYNUM. Mr. Speaker, the beginning of this month marked the start  of open enrollment for healthcare. As Oregonians have started to select  their plans, constituents of mine have been writing in. They are seeing  plans that are hundreds, if not thousands, of dollars more.\n\nWithout subsidies, David from Bend's…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697135/healthcare-open-enrollment-for-oregonians"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…Amendment, Congress exercised its enforcement authority by       enacting legislation (codified at 3 U.S.C. Sec. 21),       providing that the District residents may select presidential       electors; the votes of the electors are currently awarded to       the ticket prevailing in the District's presidential       election.\n\nThe existing statutes,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695559/dc-criminal-reforms-to-immediately-make-everyone-safe-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…post-traumatic  stress disorder.\n\nSeveral of the officers who were there had been in the Iraq war, and  they had been in the Afghan war. They testified before the January 6th  Select Committee, and several of them testified they had never seen  violence as brutal and as bloody as what took place on January 6, 2021,  with the various extremist groups that…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691242/leosa-reform-act"}, {"senator": "Haley Stevens", "party": "Democrat", "sentence": "…continuing the innovation ecosystem necessary to win  into the mid-21st century.\n\nFrom my vantage point of serving on the Science, Space, and  Technology Committee and the Select Committee on the Strategic  Competition Between the United States and the Chinese Communist Party,  I certainly understand the risks. Many of us who are delving into these…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688933/united-states-research-protection-act"}, {"senator": "Jim Himes", "party": "Democrat", "sentence": "…called for martial law to stop the peaceful transfer of  power to stop Joe Biden from becoming President, decided that Stacey  Plaskett should no longer be on the Permanent Select Committee on  Intelligence. We spent half a day on that.\n\nCongresswoman Mace decided that Cory Mills should no longer be on  committees. Apparently, we may do another one.…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697156/denouncing-the-horrors-of-socialism"}, {"senator": "Andrew Clyde", "party": "Republican", "sentence": "…Virgin Islands for  inappropriate coordination with convicted  sex offender Jeffrey Epstein during a congressional hearing and  removing Delegate Plaskett from the Permanent Select Committee on  Intelligence and referring her to the Ethics Committee for further  investigation.\n\nAfter 4 years of silence on this matter, there was not a peep during  the…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696888/notice-of-intention-to-offer-resolution-raising-a-question-of-the-privileges-of-the-house"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…this legislation.\n\nMr. MAST. Madam Speaker, I yield myself the balance of my time.\n\nMadam Speaker, in closing, I again thank Representative McCormick for  his bill, as well as Select Committee on the CCP Chairman Moolenaar and  Representatives Baumgartner and Lawler for their work to bring this  bill to the floor to ensure that we finally end China's support…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690679/economic-espionage-prevention-act"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…CERTAIN LAND.\n\n(a) In General.--Notwithstanding section 16(b) of the       Alaska Native Claims Settlement Act (43 U.S.C. 1615(b)), Cape       Fox shall not be required to select or receive conveyance of       the approximately 185 acres of unconveyed land described in       subsection (b) located within the township in which the       Native Village…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698209/cape-fox-land-entitlement-finalization-act-of-2025"}, {"senator": "Ken Calvert", "party": "Republican", "sentence": "…infrastructure around the  world continues to grow. Some reports indicate China owns or operates  ports and terminals at nearly 100 locations in over 50 countries.\n\nLast year, the Select Committee on the Chinese Communist Party issued  a report highlighting its national security concerns over the influence  of critical port infrastructure by Chinese-owned enterprise.…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692207/secure-our-ports-act-of-2025"}, {"senator": "Buddy Carter", "party": "Republican", "sentence": "…``(1) in consultation with the governments of Abraham       Accords countries, as well as appropriate United States       Government diplomatic and security personnel--\n\n``(A) select the location of the Abraham Accords Office in       an Abraham Accords country; and\n\n``(B) establish such office; and\n\n``(2) assign to such office such personnel of the Food…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697276/mikaela-naylon-give-kids-a-chance-act"}, {"senator": "Tom Barrett", "party": "Republican", "sentence": "…section 106(k)(1)       of title 49, United States Code, the Administrator shall set       aside $13,740,000 for each of fiscal years 2026 through 2028       to--\n\n(1) recruit, select, train, and delegate the necessary       authorities to additional aviation medical examiners and       human intervention motivation study aviation medical       examiners,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695004/mental-health-in-aviation-act-of-2025"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…premiums for all  Americans, all the Americans on commercial insurance, all the small  businesses, all the people on the ACA exchanges, and all the self- insured, not just a select few, and not subsidizing profitable  insurance companies.\n\nInsurance, especially bad insurance, is not care.\n\nThe Lower Health Care Premiums for All Americans Act offers  commonsense…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698401/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Rick Crawford", "party": "Republican", "sentence": "…efforts to rid the  world of a freedom-killing, murderous dictator. We are all better for  it.\n\nMr. Speaker, I now recognize my friend, vice chairman of the House  Permanent Select Committee on Intelligence, the gentleman from  Mississippi (Mr. Kelly).\n\nMr. CRAWFORD. Mr. Speaker, I thank the gentleman from Mississippi for  his remarks.\n\nMr. CRAWFORD.…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698882/successful-operation-to-arrest-nicolas-maduro"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…good  and is currently saying that he is going to sue for tens of millions of  dollars. I believe my side did the right thing in voting to open up the  government. There are a select few people that did the wrong thing in  putting language in the bill that would make themselves individually  wealthy.\n\nAll this language does is repeals that. All this does…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696929/repeal-of-senate-notification-requirements-relating-to-legal-process-on-disclosures-of-senate-data"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "…office  or it might recognize--I don't know--``National Sofa Care Month,'' if  there is such a thing. Others deal with discrete, local issues--issues  that, while important to a select few people who live around, for  example, a particular piece of land owned by the Federal Government and  might be affected by the land management policy associated with that…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698423/unanimous-consent-requests-the-calendar"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…We know a lot about  the one discovered in Reedley because I requested a report from the  House of Representatives, an investigation which resulted in a report  by the House Select Committee on the Chinese Communist Party.\n\nI want to share some of the details of that report, but I will start  with its conclusion: That no one knows whether there are other…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699473/illegal-bio-lab-in-las-vegas"}, {"senator": "William Timmons", "party": "Republican", "sentence": "…of the element of the intelligence       community receives the assessment, by the head of the element       of the intelligence community to--\n\n(A) the Director;\n\n(B) the Select Committee on Intelligence of the Senate; and\n\n(C) the Permanent Select Committee on Intelligence of the       House of Representatives.       SEC. 4. SOFTWARE MODERNIZATION…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698153/strengthening-agency-management-and-oversight-of-software-assets-act"}, {"senator": "Dan Newhouse", "party": "Republican", "sentence": "…border and  domestic security. This bill boosts funding for the Coast Guard and  provides funding to counter China's footprint in the Indo-Pacific.\n\nLastly, as a member of the Select Committee on the CCP, the Chinese  Communist Party, I am pleased to see this bill refocuses the  Cybersecurity and Infrastructure Agency, or CISA, on its core  cybersecurity…", "date": "2026-01-22", "source_url": "https://justfacts.votesmart.org/public-statement/1699356/department-of-homeland-security-appropriations-act-2026"}, {"senator": "Brian Babin", "party": "Republican", "sentence": "…science, economics,       publishing, marketing, actuarial science, operations       research, engineering, and medicine, require data savvy,       including the ability to select reliable sources of data,       identify and remove errors in data, recognize and quantify       uncertainty in data, visualize and analyze data, and use data       to develop…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688976/mathematical-and-statistical-modeling-education-act"}, {"senator": "Tim Burchett", "party": "Republican", "sentence": "…this great country.\n\nOnly U.S. citizens should participate in the election process. The  laws we create in Congress affect all Americans, and Americans should  be the ones who select their leaders.\n\nThis SAVE America Act puts in place safeguards, Mr. Speaker, to  prevent noncitizens from abusing our democratic process. United States  citizens should be…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1700006/veterans-accessibility-advisory-committee-act-of-2025"}]