[{"senator": "Ro Khanna", "party": "Democrat", "sentence": "…my country. I want Prime Minister  Carney to know that there is a new generation of America that believes  in a multiracial democracy that raises the sovereignty and self- determination of all nations. I want him to know that there is a new  generation that believes in statesmanship, not subjugation. I want him  to know that there is a new generation…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699243/might-does-not-make-right"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…Since this great  Nation's founding, the United States has signed hundreds of treaties  with Tribal nations and passed hundreds of laws reaffirming Tribal  sovereignty, self-determination, and U.S. commitments to indigenous  communities.\n\nHowever, over the last month, we have seen and heard from Tribes all  over the country whose Federal funds have been…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688266/sovereign-tribal-nations"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…jurisdictions with progressive or       Black leadership. This fight is not just about the District       of Columbia, it is about protecting democracy, equity, and       self-determination in communities across the country.      Vote NO on H.R. 5214--``District of Columbia Cash Bail Reform           Act of 2025''\n\nThis bill seeks to do two things: create…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696985/opposition-letter-by-the-southern-poverty-law-center-on-the-common-sense-law-enforcement-and-accountability-now-in-dc-act-of-2025-hr-and-the-district-of-columbia-cash-bail-reform-act-of-2025-hr"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…not negotiate over food. You do not bargain with medicine. You  do not turn aid sites into deathtraps.\n\nPalestinians in Gaza deserve safety, dignity, and the right to self- determination, not starvation.\n\nOregonians have been clear: The United States has a moral obligation  to use its power to end this tragedy. A critical step is demanding the  U.N.…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694108/ongoing-massacre-in-gaza"}, {"senator": "Josh Harder", "party": "Democrat", "sentence": "…APSARA purchased the Park Village  complex from the U.S. Department of Housing and Urban Development for  one dollar in 1993--a landmark act of community ownership and self- determination. Since then, APSARA has grown into a trusted community  institution offering affordable housing, youth development, health  access, workforce support, and immigrant…", "date": "2025-08-08", "source_url": "https://justfacts.votesmart.org/public-statement/1694721/recognizing-sovanna-koeurt"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…prepare the next generation of advocates. The campaign is  not only an investment in facilities and services, but in the vision  that every individual deserves the right to self-determination,  belonging, and a life of purpose.\n\nMr. Speaker, I ask my colleagues to join me in recognizing CRi for 50  years of leadership, compassion, and impact. Their history…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696045/9999"}, {"senator": "Emily Randall", "party": "Democrat", "sentence": "…museum where future generations can learn about their heritage,  their connection to the Salmon River watershed, and their  responsibility to protect the land.\n\nThis is self-determination in action. This is environmental  stewardship in partnership with Tribal leadership. This is Congress  fulfilling its promise.\n\nI am proud to champion this bill, and…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697702/quinault-indian-nation-land-transfer-act"}, {"senator": "Sarah McBride", "party": "Democrat", "sentence": "…greatest State in the Union. It marks the moment when  Delaware said: ``We can govern ourselves. We can shape our own  future.''\n\nThat commitment to dignity, democracy, to self-determination is the  essence of who we are as Delawareans.\n\nEach June, my neighbors gather in Old New Castle, one of the most  historic towns in America, to honor our legacy with…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692377/recognizing-milford-delaware"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…well that the President look into what the Declaration  of Independence was about. We may want him to understand that there was  a foundational document as relates to self-determination of those who  had recently gained their independence from Great Britain.\n\nI hoped that he would maybe spend a few of these days in his first  100 days doing that. It…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690636/trumps-first-100-days"}, {"senator": "Maxine Dexter", "party": "Democrat", "sentence": "…unshakable belief in the sanctity of human life. We are our brother's  keeper. I will do all I can to protect and defend each person's right  to freedom, safety, and self-determination.", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697114/genocide-in-gaza"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…assumed the Patriarchate of Constantinople during the  same year that the Soviet Union dissolved. His leadership was  instrumental in advancing the spiritual and political self- determination of the Eastern Orthodox faithful in former Soviet  republics. Today, he is a steadfast and unflinching moral leader  supporting the people of Ukraine as they resist…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695566/welcoming-his-all-holiness-bartholomew-i-of-constantinople-to-the-united-states"}, {"senator": "Lloyd Doggett II", "party": "Democrat", "sentence": "…leaders  since World War II.\n\nIf we fail Ukraine, our democratic ally, we fail the rule of law.  Let's unite to resist the appeasement of Putin and seek a victory for  self-determination, democracy, and freedom.", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1688131/ukraine"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…`protections' for NPR-A, will  undoubtedly shrink the economic opportunities available to the North  Slope. It virtually guarantees to set us back on our journey toward  self-determination by requiring further reliance on the Federal and  State government to provide for the basic needs of the people on the  North Slope.''\n\nUltimately, the Biden administration…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696834/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-national-petroleum-reserve-in-alaska-integrated-activity-plan-record-of-decision"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…efforts undertaken by KIC in order to open ANWR to oil and gas  operations. He highlighted the fact that pursuing oil and gas endeavors  in ANWR is essential to realizing self-determination within Kaktovik.  In testimony on Coastal Plain oil and gas development delivered to the  House Committee on Natural Resources in 2023, Mr. Lampe objected to  radical…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697739/9999"}, {"senator": "Lisa Murkowski", "party": "Republican", "sentence": "…Record of Decision.''                                  Background\n\nThe North Slope Inupiat have called the Arctic home for       over 10,000 years. We are proud of our self-determination       efforts to ensure future generations of Inupiat continue to       reside in our communities and have access to essential       services. Without a stable economy,…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696449/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…repression over freedom, indoctrinating their citizens to embrace  socialism and communism, ideals fundamentally opposed to American  values of liberty, freedom, and self-determination.\n\nNow, we are seeing those same authoritarian efforts reach into our  classrooms. While some are now closed, the CCP established Confucius  Institutes on college campuses…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697409/combating-the-lies-of-authoritarians-in-school-systems-act"}, {"senator": "Nicole Malliotakis", "party": "Republican", "sentence": "…if you sacrifice, and  if you play by the rules, then you can succeed.\n\nThat only happens in a country where you have freedom, where you have  liberty, where you have self-determination, and where you have the free  market.\n\nIn contrast, Mr. Speaker, socialism is the belief that you work hard,  you sacrifice, you do everything right, and the government…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697157/denouncing-the-horrors-of-socialism"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…accordance with Federal trust       responsibilities and treaty obligations, laws, and policies       relevant to Indian Tribes and in support of the principles of       self-determination, self-governance, and co-management with       respect to Indian Tribes, and to support engagement with       Native Hawaiians, there shall be in the Coast Guard a Special…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694199/coast-guard-authorization-act-of-2025"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…education.\n\nAs timber revenues declined due to foolish Federal regulations and  reduced harvests, Congress acted in 2000 to create the Secure Rural  Schools and Community Self-Determination Act, preserving vital funding  for most rural counties. When last reauthorized in 2023, this program  delivered more than $281 million nationwide to help keep teachers…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697671/support-for-rural-schools"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…way  they want to live them. Today, when we talk about this, we stand with  Iran not only because we believe in freedom for all people around the  world but freedom of self-determination and to decide what kind of  government we want.\n\nFrankly, we want to allow women to vote, to have equal rights with  men, to live in a society where religion is important…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691211/supporting-a-free-democratic-and-secular-iran"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…Mr. President, I rise today to urge my colleagues to  overturn the Biden administration's restrictive Central Yukon land  management scheme, which threatens Alaska's self-determination and  resource development. I ask my colleagues to support our resolution of  disapproval, H.J. Res. 106, to protect Alaska's rights and future.\n\nThe implementation of…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696162/hj-res-106"}, {"senator": "Mike Simpson", "party": "Republican", "sentence": "…Mr. Speaker, I rise today in strong support of S. 356,  the Secure Rural Schools Reauthorization Act of 2025.\n\nThis bill would reauthorize the Secure Rural Schools and Self- Determination Program (SRS) through Fiscal Year 2026 and provide lapsed  payments for 2024 and 2025.\n\nAdministered by the U.S. Forest Service and U.S. Bureau of Land  Management,…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697660/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "Troy Downing", "party": "Republican", "sentence": "…make even more  progress on housing by addressing reforms to the Build America Buy  America Act, or BABA, and reauthorizing the Native American Housing  Assistance and Self-Determination Act, or NAHASDA.\n\nDon't let the name fool you. BABA may sound patriotic, but mandating  BABA compliance for HUD-funded projects hamstrings builders by  dictating how…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699815/lowering-housing-costs-and-advancing-main-street-community-banks"}, {"senator": "John Thune", "party": "Republican", "sentence": "…redesignated by       paragraph (4), the following:\n\n``(6) Indian tribe.--The term `Indian tribe' has the       meaning given that term in section 4 of the Indian Self-      Determination and Education Assistance Act (25 U.S.C. 5304).\n\n``(7) Native hawaiian organization.--The term `Native       Hawaiian organization' has the meaning given that term…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695277/harmful-algal-bloom-and-hypoxia-research-and-control-amendments-act-of-2025"}, {"senator": "Mary Miller", "party": "Republican", "sentence": "…inherent to each member of the human race with life being our       most fundamental inalienable divine right. All men and women       have the right to liberty, self-determination and self-      governance. The individual's responsibility of work,       education, and industry are crucial elements of self-      governance in society and the preservation…", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688744/declaration-of-mothers-a-proclamation-and-pledge-for-the-preservation-of-freedom-and-virtue"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…future. This bill transfers land already in use and allows Southcentral  Foundation to make long-term investments in modern infrastructure. The  bill supports Tribal self-determination, strengthens care delivery, and  empowers a trusted partner to do even more for our communities.\n\nThis is a narrowly tailored, fiscally responsible bill with broad  support.…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698112/southcentral-foundation-land-transfer-act-of-2025"}, {"senator": "Peter Stauber", "party": "Republican", "sentence": "…Anchorage, Alaska, to the Southcentral  Foundation.\n\nSouthcentral Foundation is a tribally-operated health organization  serving Alaska Native people under the Indian Self-Determination and  Education Assistance Act. This parcel, currently owned by the Centers  for Disease Control and Prevention, has housed Southcentral  Foundation's behavioral health…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698113/southcentral-foundation-land-transfer-act-of-2025"}]