[{"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…practices  enacted by the locally elected District of Columbia Government. The  over 700,000 D.C. residents, a majority of whom are Black and Brown,  are capable and worthy of local self-government.\n\nMr. Speaker, I include in the Record two letters, one from every  Member of D.C.'s locally elected legislature, the Council; and one from  D.C.'s locally elected…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692373/district-of-columbia-federal-immigration-compliance-act-of-2025"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…prices, grid reliability, and American energy  independence.\n\nIt was done in a way that was as illogical, chaotic, and likely  illegal as canceling Revolution Wind was. Again, a self-inflicted wound  in every way by this President, and that is why he is the energy  emergency. He created it in just months, not even a year. He declared  it on his first day…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696127/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…about to hear about it because DOGE is  defunding the police as we speak and, unfortunately, with your  cooperation and your passivity, they are getting away with it.\n\nNow, this self-anointed fourth branch of government, DOGE, which I  think is getting run out of town right now because of its rank  incompetence and lawless assaults on the privacy data of…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691320/improving-law-enforcement-officer-safety-and-wellness-through-data-act"}, {"senator": "Seth Magaziner", "party": "Democrat", "sentence": "…in and save the day.\n\nWe cannot allow this to happen, not only because of the moral  imperative of saving the lives of starving children around the world  but out of our own self-interest. It is in our interest to build good  will. We can do it if the Trump administration will just do what it  says it is going to do and restore funding for emergency…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692007/cuts-to-public-broadcasting"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "Mr. LATIMER. Mr. Speaker, I rise tonight to bring attention to the  Senate's despicable decision last week to sneak in a self-serving  provision into the bill that was used to reopen the government.\n\nWhile 42 million Americans on SNAP were denied their benefits, Senate  leadership added a payout provision…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696864/calling-for-quick-action"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…great Nation, that is attacking policing and attacking home  rule of this city. That is what these bills are all about.\n\nThey are a distraction. They are about taking over the self- governance of the city of Washington, D.C., and they are about taking  away the power of the people.\n\nI think it is important to understand that as the Washington, D.C.,  Delegate,…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692301/protecting-our-nations-capital-emergency-act"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…operates as the functional equivalent of a state,  providing state-, county- and city-level services, despite being denied  voting representation in Congress and full local self-government. This  bill would not change any legal authorities.\n\nI urge my colleagues to support this bill.", "date": "2025-10-28", "source_url": "https://justfacts.votesmart.org/public-statement/1696437/introduction-of-the-district-of-columbia-government-title-equality-act"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…more on our debt.\n\nAt the same time, the dollar is declining and prices are going up,  meaning it is going to be harder to afford groceries.\n\nMr. Speaker, these are the most self-destructive, wealth-destroying  policies any administration has undertaken in modern American history.  They have tariffs at 1909 levels at 22.5 percent, making a global trade…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689980/modernizing-our-economic-theories"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…Black  history. Black history is American history.\n\nDictators try to shutter museums, censor history, and whitewash the  truth, but we know the truth. We hold these truths to be self-evident,  that centuries of bondage and enslavement brutalized Black bodies and  tore apart Black families, that Black women have been the mothers of  movements, that Black…", "date": "2025-04-09", "source_url": "https://justfacts.votesmart.org/public-statement/1689876/trumps-attacks-on-black-history"}, {"senator": "Sanford Bishop, Jr.", "party": "Democrat", "sentence": "…volunteers across 40 states, the District  of Columbia, Japan, and beyond. Through this program, young men and  women cultivate essential values such as leadership, teamwork, and  self-discipline.\n\nThe Albany, Georgia chapter exemplifies excellence in service,  community engagement, and leadership. Under the guidance of Unit  Commander Eric Crump and his wife,…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691397/recognizing-the-albany-georgia-young-marines"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…relied on Medicaid for hearing aids, surgeries,  dental work, housing, and more. If he loses his coverage, she believes  Michael will become frustrated and either go to jail, self-harm, or  die.\n\nMichael's mother passed away when he was 19. With no other family to  step in, Bonnie worries about what will happen to her nephew after she  is gone. This is…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691458/medicaid-and-snap"}, {"senator": "Robert Garcia", "party": "Democrat", "sentence": "…residents and their elected  officials, while ignoring the real issues the rest of the country  faces.\n\nNearly 700,000 taxpaying Americans in D.C. deserve the same right to  self-governance as every other community including control over  criminal laws.\n\nDemocrats on the Committee on Oversight and Government Reform  strongly oppose this bill, which would…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695593/lowering-age-at-which-a-minor-may-be-tried-as-adult-for-certain-criminal-offenses-in-district-of-columbia"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…Iran without a  congressional vote.\n\nLet me answer a couple of questions that colleagues of mine have  asked about the resolution that I filed yesterday.\n\nFirst, what about self-defense? What about if Iran does take action  against the United States, the homeland, or at a U.S. base in the  Middle East or at a U.S. consulate in Erbil in the Kurdish area…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692637/war-powers-resolution"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…go to college or trade school. They should not be worried  about someone catfishing them and using intimate images of them to  either coerce money from them or push them to self-harm.\n\nFrom Michigan, to Kentucky, to Ohio, and Georgia, these schemes range  across the country. These sextortion operations are expanding, and we  must do what we can to help…", "date": "2026-01-20", "source_url": "https://justfacts.votesmart.org/public-statement/1699202/supporting-hr-the-combating-online-predators-act"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…which claims to bring digital assets under a regulatory umbrella but  fails in two major areas.\n\nFirst, it fails because it has no KYC--know your customer-- requirements for self-hosted wallets. It allows anonymous trading on  DeFi exchanges and the dark web, which means there is no way to prevent  wash trading, front running, corruption, ransomware,…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693779/digital-asset-market-clarity-act-of-2025"}, {"senator": "Nick Begich III", "party": "Republican", "sentence": "…build that  future. This bill transfers land already in use and allows Southcentral  Foundation to make long-term investments in modern infrastructure. The  bill supports Tribal self-determination, strengthens care delivery, and  empowers a trusted partner to do even more for our communities.\n\nThis is a narrowly tailored, fiscally responsible bill with broad…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698112/southcentral-foundation-land-transfer-act-of-2025"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…SULLIVAN. Mr. President, I rise today to urge my colleagues to  overturn the Biden administration's restrictive Central Yukon land  management scheme, which threatens Alaska's self-determination and  resource development. I ask my colleagues to support our resolution of  disapproval, H.J. Res. 106, to protect Alaska's rights and future.\n\nThe implementation…", "date": "2025-10-09", "source_url": "https://justfacts.votesmart.org/public-statement/1696162/hj-res-106"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…it. Pregnancy resource centers offer the best hope  of achieving this goal by providing parenting classes and life skills  training to help that mother move from a crisis to self-sufficiency.\n\nPregnancy centers are the backbone of community-based support. The  impact of their work is undeniable.\n\nIn 2024 alone, over 2,700 centers aided nearly 3.8 million…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699227/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…continuous  efforts undertaken by KIC in order to open ANWR to oil and gas  operations. He highlighted the fact that pursuing oil and gas endeavors  in ANWR is essential to realizing self-determination within Kaktovik.  In testimony on Coastal Plain oil and gas development delivered to the  House Committee on Natural Resources in 2023, Mr. Lampe objected to…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697739/9999"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…Constitution provides such power to the Presidency.\n\nNo Supreme Court has allowed the Congress to abdicate its role in the  decisions of war and peace, and no Congressman of any self-respect will  argue otherwise.\n\nOur leaders debated fully whether or not to grant this power to the  President. To a man, from Jefferson to Hamilton, the spectrum of our  Founding…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698611/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-air-plan-approval-south-dakota"}, {"senator": "Vince Fong", "party": "Republican", "sentence": "…additional real, compassionate support during life's  most vulnerable moments.\n\nThese services are valued at over $450 million annually and help  families choose stability, self-sufficiency, and hope.\n\nThe Temporary Assistance for Needy Families program was created to  strengthen families, reduce dependency, and ensure children can be  cared for in…", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699225/supporting-pregnant-and-parenting-women-and-families-act"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…banks, so  when central banks pay each other, they broker the transaction through  the Bank for International Settlements.\n\nWhat is the digital currency? Digital is sort of self-explanatory.  Currency is a means of payment. Traditionally, you think of money, the  system of money is as old as people. The right to transact predates any  government. People…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693006/central-bank-digital-currency"}, {"senator": "GT Thompson, Jr.", "party": "Republican", "sentence": "…children through  tutoring, mentoring, and sometimes providing classroom support to  teachers. These grandparents have the ability to help young people in  need learn independence, self-confidence, and social skills.\n\nMr. Speaker, many of us have fond memories of our own grandparents,  and I am glad that for the past 60 years the foster grandparent program…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695216/recognizing-americorps-seniors-foster-grandparent-program"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…transferred to patrol. He was  responsible for the I-80 corridor, all the way from Bell Road in Auburn  to Donner Summit. During this time, Lieutenant Doolittle developed  strong self-reliance and proficiency, and his work did not go  unnoticed. He received the Mothers Against Drunk Driving Award in both  2006 and 2008 for the most DUI arrests in the department…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692138/ten-radical-failed-policies-of-governor-newsom"}, {"senator": "James Risch", "party": "Republican", "sentence": "…enrichment       facility in a secure location and that other measures were       being planned.\n\nIsrael took action against Iran, an action it believed was       necessary for its self-defense. The United States' top       priority is protecting American forces in the region.       President Trump will take all necessary steps to protect our       forces,…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693132/motion-to-discharge-sj-res-59"}, {"senator": "Brian Fitzpatrick", "party": "Republican", "sentence": "…Trevose, the parish has been a steadfast presence in Bucks County for  three-quarters of a century.\n\nCelebrating 75 years as a parish also means celebrating 75 years as  their self-titled Family of Faith. Through grounding their lives in  love and faith, Assumption BVM has become a source of strength,  spiritual growth, and support for countless individuals.…", "date": "2025-08-15", "source_url": "https://justfacts.votesmart.org/public-statement/1694740/recognizing-assumption-of-the-blessed-virgin-mary-parishs-75th-anniversary"}, {"senator": "Tom McClintock", "party": "Republican", "sentence": "…will put to people next year: Are you better off today than you were  2 years ago? Obnoxious protests, hysterical rhetoric, and doomsday  trolling won't change that simple and self-evident answer.\n\nOne party will have been proven undeniably right and the other  mendaciously wrong, and I think that is what the Democrats fear the  most.", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693629/democrats-big-mistake"}, {"senator": "Nancy Mace", "party": "Republican", "sentence": "…320,000 American jobs, generates $28.4  billion in regulated market activity, and produces some $1.5 billion in  state tax revenue.\n\nThe hemp industry has stepped forward to self-regulate in the absence  of uniform federal regulations--uniting behind a framework which  restricts the sale and possession of hemp products to adults 21 years  and older,…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696735/continuing-appropriations-and-extensions-act-2026"}, {"senator": "French Hill", "party": "Republican", "sentence": "…exploitation and       cognitive decline;\n\n``(B) identify areas in which senior investors would       benefit from changes in the regulations of the Commission or       the rules of self-regulatory organizations;\n\n``(C) coordinate, as appropriate, with other offices within       the Commission, other taskforces that may be established       within the Commission,…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693935/national-senior-investor-initiative-act-of-2025"}, {"senator": "James Risch", "party": "Republican", "sentence": "…stability and economic progress in Europe.\n\nThe proposed sale will improve Ukraine's ability to meet       current and future threats by further equipping it to conduct       self-defense and regional security missions with a more       robust air defense capability. Ukraine will have no       difficulty absorbing these articles and services into its…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694901/arms-sales-notification"}]