[{"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…a reality, hitting my home  State of Florida especially hard. In Florida, more than 4 million  people rely on the ACA and face premiums that are doubling or tripling.\n\nA self-employed mom recovering from cancer in Lake Worth Beach is  dropping her coverage as her premium tripled overnight. A 62-year-old  waiter in West Palm Beach is going without insurance…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698564/saving-homeowners-from-overregulation-with-exceptional-rinsing-act"}, {"senator": "Gwen Moore", "party": "Democrat", "sentence": "…forced to make the  difficult decision to insure only his daughter.\n\nHe's one of over 300,000 Wisconsinites covered by the ACA.\n\nAnother is Jeffrey from Milwaukee:\n\nI am self-employed and completely count on these credits in       order to afford my own health insurance, without them I may       be uninsured. The anxiety that I, and I'm sure others are…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696975/stories-from-home-the-human-cost-of-expiring-healthcare-tax-credits"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…Some of them may work for employers who intentionally schedule their  hours at 29 hours rather than the 30 needed to trigger employer-covered  insurance. Some of them are self-employed. Some of them are in jobs,  like one of my constituents who I spoke to during a press conference  after we passed the big, ugly bill, who worked as a contractor, got  injured,…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692205/raising-awareness-about-mens-health"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…particular, on the kind of person who is really  going to be affected by the Trump rule if we do not affirmatively  embrace this Congressional Review Act resolution, and that is self- employed entrepreneurs and gig workers.\n\nYou know, one of the challenges about the American healthcare system  before the Affordable Care Act was it was very, very difficult to…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698982/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-centers-for-medicare-medicaid-services-relating-to-patient-protection-and-affordable-care"}, {"senator": "Lucy McBath", "party": "Democrat", "sentence": "…Georgia from Rich about the impact  that these cost increases would have on his livelihood. I have heard  many stories, but this one really struck me.\n\nHe writes: I am the self-employed, sole provider for a family of four  where two of us have preexisting conditions. If the Republicans get  their way and remove the subsidies, my very basic catastrophe…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697215/medical-bills-are-too-high"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…starters to make it very concrete about Vermonters.  A woman named Sarah is going to see her premium go from $217 a month to  $1,200 a month. This is a person who is 63, self-employed, and might  have to go without healthcare for the first time in her life.\n\nCara, also self-employed, has had the same income for 20 years,  really scraping by. She pays…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696453/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…amplifying the stories of our constituents, and tonight we do the same,  amplifying the stories of people whether they are small business  owners, they are employees, they are self-employed, farmers, or others,  who could find themselves unable to afford healthcare without an  extension of the enhanced premium tax credit.\n\nWe know that there is a healthcare…", "date": "2025-11-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696767/stories-from-home-the-human-cost-of-expiring-healthcare-tax-credits"}, {"senator": "Mark DeSaulnier", "party": "Democrat", "sentence": "…and President Trump passed their big, ugly bill that  kicks 10 million Americans off of Medicaid. It increases healthcare  costs for 5 million small business owners and self-employed workers. It  fails to extend critical tax credits. This is all to give billions of  dollars of tax credits to the wealthiest Americans.\n\nTime is running out, as we all…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698147/affordability-crisis-in-america"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…credits. Her tea  shop is not an exception. It is the norm. Nearly half of all adults  with ACA marketplace coverage are small business owners, small business  employees, or self-employed. In many cases, the Affordable Care Act and  the enhanced premium tax credits have given them the freedom to start  their small business, but the Republican attacks on…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697348/destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…owners, beauticians, barbers,  landscapers, florists, mediators, chiropractors, funeral directors,  farmers, small business owners and their employees, gig workers, the  self-employed, and more.\n\nWe have told stories of people worried about how they are going to  pay that unexpected bill if they get sick or injured or if they lose  their health insurance.…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698225/healthcare-affordability-crisis"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "…reconsidering prescriptions,  and families are facing the very real possibility of going uninsured.\n\nTake Cricket, for example, a constituent in my district. At 63,  Cricket is self-employed and not yet eligible for Medicare. She has  relied on ACA coverage for 8 years, paying $350 a month.\n\nLast year, she suffered a head injury that required emergency care,…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698672/protecting-healthcare-for-millions-of-americans"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…of us represent portions of that part of the  Commonwealth--told several stories.\n\nThere was one from Reagan Fisher Wyssbrod from Salem. Reagan and her  husband, who is self-employed, have two children.\n\nWyssbrod works three part-time jobs to help support the family while  keeping the flexibility needed for her children. She spends some days  as a substitute…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697213/medical-bills-are-too-high"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…in my district  in Brooklyn, a woman who wants to work, who does work, and who  contributes to her community every single day.\n\nDenise, of Prospect Lefferts Gardens, is self-employed. She is a  graphic designer. She also lives with lupus, a serious autoimmune  condition that requires consistent care and access to specialists. The  only reason she has…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697649/restoring-enhanced-premium-tax-credits"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…record, because I think it is  important, that one-half of adults with the Affordable Care Act  healthcare coverage are small business owners, small business  employees, or self-employed people. We are talking about millions and  millions of Americans. Many of them are going to see their healthcare  costs rise so high that they are not going to be able…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697303/providing-for-consideration-of-hr-student-compensation-and-opportunity-through-rights-and-endorsements-act-providing-for-consideration-of-hr-combating-the-lies-of-authoritarians-in-school-systems-act-providing-for-consideration-of-hr-transparency-in-reporting-of-adversarial-contributions-to-education-act-providing-for-consideration-of-hr-promoting-responsible-oversight-to-eliminate-communist-teachings-for-our-kids-act-providing-for-consideration-of-hr-small-business-regulatory-reduction-act-of-providing-for-consideration-of-hr-destroying-unnecessary-misaligned-and-prohibitive-red-tape-act"}, {"senator": "Luz Rivas", "party": "Democrat", "sentence": "…and how this will impact them and their daily lives, I  also have heard many stories from my own constituents. This includes  Angel from San Fernando. Angel's husband is self-employed, and she  works part time. Because of the ACA, they can have reliable healthcare  that covers her husband's preexisting conditions. Angel is dreading the  update that will…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698671/protecting-healthcare-for-millions-of-americans"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…leave ObamaCare in place? That can sit there and keep doing what it is  doing, but we are going to give people this option, so employers can  put it in there.\n\nIf you are self-employed, you can get the same tax break. It is all  equal tax treatment. Nobody is treated differently. We would have a  product over here that would allow for true catastrophic…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698106/bringing-america-back-to-its-roots"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…now enjoy  no tax on tips and no tax on overtime, which will actually incentivize  people to work more, which we need, without seeing their tax bill go  up.\n\nEmployees and self-employed individuals can now deduct up to $25,000  in qualified tip income through 2028.\n\nNext time you go to a restaurant or a bar, why don't you ask the  waitstaff what they think…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698258/nominations"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…the Chair of the       National Council on Disability, shall--\n\n(1) provide assistance to individuals with disabilities who       desire to become entrepreneurs or to be self-employed;\n\n(2) help individuals with disabilities find employment at       small business concerns (as defined under section 3 of the       Small Business Act (15 U.S.C. 632));…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691777/thinkdifferently-about-disability-employment-act"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…solutions to America's broken healthcare system.\n\nIt lowers premiums through choice and competition. By expanding  association health plans, we give small businesses and self-employed  workers the buying power of large employers, cutting premiums by as  much as 30 percent.\n\nIt gives families control over their dollars. We strengthen CHOICE  arrangements,…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698401/lower-health-care-premiums-for-all-americans-act"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…though. If you are  a special interest and the taxes hurt you, the tariffs hurt you, you  will get a bailout. But if you are just an average person working for  yourself, self-employed, and the tariffs cause all of your groceries to  go up and cause your electronics to go up, no one is going to help you;  you will just pay higher prices. If you think…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689478/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Morgan Griffith", "party": "Republican", "sentence": "…bringing transparency into the commercial market for PBMs under this  bill.\n\nThe bill also expands access to association health plans, which allow  small businesses and self-employed workers to band together and  purchase health insurance. One of the biggest complaints we hear from  businesses, especially small businesses, is the rising costs of  premiums…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698304/providing-for-consideration-of-hr-lower-health-care-premiums-for-all-americans-act-providing-for-consideration-of-hr-do-no-harm-in-medicaid-act-providing-for-consideration-of-hr-protect-childrens-innocence-act-and-relating-to-consideration-of-hr-standardizing-permitting-and-expediting-economic-development-act"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…suffer further pain as opposed to joining us  and fixing the problem as opposed to extending it.\n\nMy bill, the Association Health Plans Act, allows small businesses  and self-employed Americans to band together, like large companies, to  lower costs and deliver high-quality coverage. The CBO report today  estimates that this could cover more than 200,000…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698404/lower-health-care-premiums-for-all-americans-act"}]