[{"senator": "Frank Mrvan", "party": "Democrat", "sentence": "…community project funding requests in these measures, including the  funds specific to the members of northwest Indiana law enforcement  agencies. I am grateful every day for the selfless service and  sacrifice that first responders, including our local police, fire  departments, and emergency personnel, provide to our communities every  day.\n\nThese requested…", "date": "2026-01-08", "source_url": "https://justfacts.votesmart.org/public-statement/1698753/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Laura Gillen", "party": "Democrat", "sentence": "…all four  would tragically lose their lives caused by the toxins that they were  exposed to in their heroic efforts. This is a painful reminder of the  lasting cost of their selfless service.\n\nUnfortunately, thousands of our heroic law enforcement officers,  firefighters, and emergency personnel who bravely answered the call on  the darkest day in our…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691183/national-police-week"}, {"senator": "Adam Gray", "party": "Democrat", "sentence": "…Commerce which recognizes  businesswomen who empower others by leading with wisdom and passion.\n\nPlease join me in honoring Annissa Fragoso for her dedication,  commitment and selfless service to the people of Merced County.", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695992/recognizing-annissa-fragoso"}, {"senator": "Sam Liccardo", "party": "Democrat", "sentence": "…Speaker, I rise today to recognize the  extraordinary life of Colonel Vu Van Loc, a South Vietnamese Army  veteran and beloved community member and leader in San Jose, for his  selfless dedication to Vietnamese refugees and to cultural  preservation.\n\nBorn in 1933 in northern Vietnam, Loc Vu and his family fled their  homeland during the fall of Saigon, ultimately…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698268/recognizing-the-life-of-colonel-vu-van-loc"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…preserving our environment, including our public parks and outdoor  spaces, as the efforts of the individuals and organizations recognized  tonight reflects. These are truly selfless actions done for the benefit  of all and merit our highest praise.", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696038/recognizing-the-2025-elly-doyle-park-service-awardees"}, {"senator": "George Whitesides", "party": "Democrat", "sentence": "…contributions  but also in the example he sets for future generations about duty,  resilience, and honor.\n\nIt is with great respect and admiration that I recognize Mauro Reza  for his selfless service to our country. His story is a testament to  the courage of those who have fought for our freedoms, and I urge my  colleagues to join me in expressing our gratitude…", "date": "2025-04-01", "source_url": "https://justfacts.votesmart.org/public-statement/1689403/congratulating-mauro-reza-boots-on-the-ground-alliances-veteran-of-the-year"}, {"senator": "Jasmine Crockett", "party": "Democrat", "sentence": "…volunteers, the program has completed over 17,900 tax  returns, returned more than $3.3 million to the community, and saved  taxpayers an estimated $300,000 in fees.\n\nMr. Phillips' selfless service and steadfast leadership have helped  ensure financial stability for countless Dallas residents. He has also  mentored and supported fellow volunteers, strengthening…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695269/recognizing-the-work-of-robert-phillips"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…about a so- called stolen election, with threats against election officials  continuing in subsequent elections.\n\nThere was no stolen election. That is a farce. But for those selfless  election workers, Donald Trump hasn't even tried to lower the  temperature of political rhetoric or combat the disinformation that  leads to the threats and harassment. Instead,…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690535/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Salud Carbajal", "party": "Democrat", "sentence": "…Paul attended Franklin Elementary, Santa Barbara Junior High,  and Santa Barbara High School. In 1943, during what would have been his  senior year, Paul made the brave and selfless decision to leave school  and enlist in the United States Navy during World War II.\n\nAssigned as a 20-millimeter antiaircraft gunner aboard the USS  Maryland, Paul served…", "date": "2025-06-20", "source_url": "https://justfacts.votesmart.org/public-statement/1692689/recognizing-the-100th-birthday-of-paul-david-lopez"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…from the gunman. To Spencer,  too, I wish a full and swift recovery.\n\nAhmed, Spencer, and countless others should never be put in these  unimaginable situations. Yet their selfless acts in the face of such  violence are the ultimate demonstration of love--a willingness to risk  their own lives to save a stranger.\n\nAs we seek to address the scourge of…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698170/shooting-at-brown-university-and-shooting-in-sydney-australia"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…ICE agent, her final words to the officer who  shot her were, ``I am not mad at you.''\n\nAlex Pretti was a VA intensive care nurse and guardian angel who did  one of the most selfless jobs one could think of, caring for our  veterans, often in their final hours.\n\nLast Saturday, I met with the workers who were on the shift that,  only 2 weeks before, was…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700059/9999"}, {"senator": "James Walkinshaw", "party": "Democrat", "sentence": "…congratulating Lt.  Colonel Jabar Shabazz on his retirement. On behalf of myself and the  citizens of Fairfax County, I thank him and his family for his  honorable 31 years of selfless service to our Nation. Fairfax County is  the safest jurisdiction of its size, and that is in no small part due  to the dedication of individuals like Lt. Col. Shabazz. Best…", "date": "2025-10-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696033/recognizing-lieutenant-colonel-jabar-shabazz-on-his-retirement-from-the-fairfax-county-sheriffs-office"}, {"senator": "Josh Harder", "party": "Democrat", "sentence": "…megafire crisis, and in 2024 alone we  saw 9 wildfire incidents that burned nearly 15,000 acres in total.  Thankfully, these fires were contained due to the quick action and  selfless heroism of our firefighters, law enforcement, and first  responders. Just earlier this year, during the historic Los Angeles  fires, San Joaquin County sent nearly a dozen…", "date": "2025-05-23", "source_url": "https://justfacts.votesmart.org/public-statement/1691677/recognizing-the-1st-anniversary-of-corral-fire-in-san-joaquin-county-california"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…us to emigrate to this great nation, where       we begin to develop a sense of belonging.\n\nI have had the privilege of meeting numerous highly trained       Haitian women, selfless mothers committed to the education of       their children, as well as men who practice various       professions, such as plumbing, masonry, accounting, teaching,       agricultural…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699720/witness-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Chris Pappas", "party": "Democrat", "sentence": "…helping improve New Hampshire's transportation for the past 35 years  and his 40 years of public service dedicated to New Hampshire. I would  also like to thank Bill for his selfless service and for his leadership  in the state. I wish him and his wife, Colleen, all the best in his  retirement and future endeavors.", "date": "2026-01-21", "source_url": "https://justfacts.votesmart.org/public-statement/1699267/recognizing-william-bill-cass-commissioner-of-new-hampshire-department-of-transportation"}, {"senator": "Pete Sessions", "party": "Republican", "sentence": "…United States of America and his enduring  contributions to the people of East Texas. His devotion to both country  and community stands as a shining example of patriotism and selfless  service.", "date": "2025-10-17", "source_url": "https://justfacts.votesmart.org/public-statement/1696279/recognizing-delman-leon-orme-with-a-congressional-veteran-commendation"}, {"senator": "John Carter", "party": "Republican", "sentence": "…elementary  school teacher in KISD for 20 years, chaired the Harker Heights Parks  and Recreation Committee for 12 years, and coached youth soccer for  over a decade. Her selfless work has positively impacted the lives of  countless young people. Today, she continues to serve as a Wounded  Warrior member and volunteer and has been a member of the Fort…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689348/saluting-the-service-of-command-sergeant-major-angela-wilson"}, {"senator": "Michelle Fischbach", "party": "Republican", "sentence": "…made a lasting impact on generations of  students and staff. He is a reminder that the success of our school  depends not just on what happens in the classroom but on the selfless  dedication of those who support our students in every area of their  lives.                         Congratulating Brock Nelson\n\nMrs. FISCHBACH. Mr. Speaker, I rise today…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699884/congratulating-ellen-lampton"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…War. This recognition is presented in  correspondence with the Dustoff Crews of the Vietnam War Congressional  Gold Medal Act, honoring the individuals who served in these selfless  and heroic missions. Mr. Sarrault's service exemplifies the unwavering  dedication shown by members of these Dustoff Crews to both their fellow  servicemembers and their…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692726/thanking-roger-sarrault-for-his-service-with-the-us-army-as-a-member-of-the-dustoff-crews-during-the-vietnam-war"}, {"senator": "Jack Bergman", "party": "Republican", "sentence": "…Medevac crews during the Vietnam War. This  recognition is presented in correspondence with the Medevac crews of  the Vietnam War Congressional Gold Medal Act, which honors the selfless  and heroic individuals who served in these lifesaving missions.\n\nMSgt Timmins' service exemplifies the unwavering dedication  demonstrated by members of these Medevac crews…", "date": "2025-06-24", "source_url": "https://justfacts.votesmart.org/public-statement/1692874/recognizing-master-sergeant-gerald-timmins-for-his-service-with-the-us-marine-corps-as-a-member-of-the-medevac-crews-during-the-vietnam-war"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…neighbors and flood victims, she helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those who needed help. A truly selfless  leader, Ms. Arnold was a strong advocate for bringing in government and  non-profit resources to aid in the recovery process.\n\nIt is clear that Kristina Arnold has made a…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691077/recognizing-kristina-arnold"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…neighbors and flood victims, he helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those who needed help. A truly selfless  leader, Mr. Phillips was a strong advocate for bringing in government  and non-profit resources to aid in the recovery process.\n\nIt is clear Mike Phillips has made a profoundly…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691726/recognizing-mike-phillips"}, {"senator": "Pat Ryan", "party": "Republican", "sentence": "…and the heat. Their relentless efforts to combat littering and to  really bring our community together in a positive way while doing so is  a truly commendable pillar of selfless service.\n\nOn behalf of our entire community, I thank them and join in  celebrating this certification that will allow them to continue to  expand on their important work.…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694021/recognizing-cornwall-cleanup-crew"}, {"senator": "David Taylor", "party": "Republican", "sentence": "Mr. TAYLOR. Mr. Speaker, I rise today to recognize the selfless acts  of service done by Diana Lawrence and the Troop Box Ministry to bless  our Nation's servicemembers.\n\nIt all began nearly a quarter century ago in the garage of the…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691308/acts-of-service-by-diana-lawrence-and-troop-box-ministry"}, {"senator": "Adrian Smith", "party": "Republican", "sentence": "…the fact that when I was a brand-new Member of Congress,  a while back, that he has always been a great help not just to me but  to anyone who asks. I am grateful for his selfless public service. As  was said before, I think it will last for generations. I am grateful,  and I wish him well.", "date": "2025-03-10", "source_url": "https://justfacts.votesmart.org/public-statement/1688733/offering-thanks-and-gratitude-to-james-min"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…neighbors and flood victims, he helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those who needed help. A truly selfless  leader, Mr. Hutton was a strong advocate for bringing in government and  non-profit resources to aid in the recovery process.\n\nIt is clear Ronnie Hutton has made a profoundly…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691912/recognizing-ronnie-hutton"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…neighbors and flood victims, he helped coordinate  the collection and distribution of emergency supplies, meals and  donated services to help those who needed help. A truly selfless  leader, Mr. Chase was a strong advocate for bringing in government and  non-profit resources to aid in the recovery process.\n\nIt is clear that Jason Chase has made a profoundly…", "date": "2025-05-07", "source_url": "https://justfacts.votesmart.org/public-statement/1690800/recognizing-jason-chase"}, {"senator": "Mike Lawler", "party": "Republican", "sentence": "…hesitation, he secured a ladder, climbed to the window the  resident was attempting to escape from, and calmly coached the  individual to safety. His quick thinking, bravery, and selfless action  helped save a life from what would have been a tragedy.\n\nChief Hyman joined the Ramapo Police Department in 1989 and has  served his community with integrity, valor,…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699731/recognizing-extraordinary-service-of-cardinal-timothy-dolan"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Ann Keckler, a remarkable advocate  for her fellow veterans and their families. Hernando County, and indeed  all of Florida, were fortunate to benefit from her decades of selfless  dedication. Mary Ann served as Disabled American Veterans (DAV)  Commander for Hernando County No. 67, and from 2018 to 2019, she held  the position of State DAV Commander.…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697717/recognizing-mary-ann-keckler"}, {"senator": "Scott Perry", "party": "Republican", "sentence": "…Hall of Fame  in 2025, which speaks broadly to his leadership abilities and legacy.\n\nMr. Speaker, I am honored and privileged to recognize Chairman  Jonathan Holmes for his selfless, tireless, and dedicated service to  the Citizens of Jackson Township, York County, Pennsylvania. His  leadership, professionalism, and fidelity will be greatly missed, and…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697178/recognizing-jackson-township-board-of-supervisors-chairman-jonathan-d-holmes"}]