[{"senator": "Robin Kelly", "party": "Democrat", "sentence": "…provide affordable care to  her employees, allowing her coffee shop and her employees to thrive.\n\nAnother small business owner in my district runs a wine production  business that sells nationwide. Despite her success, she has to rely on  her husband's job for healthcare. These are two small business owners  who have created their own success, and through…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697214/medical-bills-are-too-high"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…see  their utility bills rise by hundreds of dollars per year.\n\nThis is a lose-lose. It is bad for people's wallets. It is bad for  building a strong, competitive economy. It sells out current and future  generations to fund tax cuts for billionaires.\n\nMr. Speaker, I urge the Senate to reject this disgusting abomination.", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692366/american-energy-jobs-at-risk"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…see that there is a tax on there, a  sales tax of 10 percent, or $4,000.\n\nWell, here is where the stealth comes in. Here is where the art of  the steal begins. When the person sells that $40,000 item and has to  add that additional $4,000 to it, that person becomes somewhat of a tax  collector for the Trump tariff-tax steal. That person who purchased…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690093/protecting-the-american-dream"}, {"senator": "Melanie Stansbury", "party": "Democrat", "sentence": "…President and to win this Republican majority who  is trying to send our country into the largest deficit spend in  American history.\n\nAs for Mr. Trump, this is what happens when he sells his soul. We see  what happens.\n\nI have a lot of love in my heart for people who are going through  hard times. I know that both of them are having a hard time. For the  sake…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692039/consequences-of-doge"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…from D.J. Trump for $22,500. What is that check  for? Underneath the photo taken in the 1990s, a handwritten note says:\n\nJeffrey showing early talents with money and women! Sells       ``fully depreciated''--\n\nAnd then there is a name of a woman who has been blocked out.\n\nto Donald Trump for $22,500.\n\nI don't know if a woman was sold to Donald Trump…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695214/jeffrey-epstein"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…it is not staying on Main Street. They are  not getting the rewards for the work which they have done.\n\nA small business in Massachusetts that designs and manufactures and  sells outdoor recreation equipment told me that they have paid an extra  $500,000 this year because of Trump's tariff taxes. Earlier this week,  they received a $40,000 bill from…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696444/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Brad Sherman", "party": "Democrat", "sentence": "…loan, of course the mortgage lender has to  look at your credit report, so they call Equifax or whoever or email  Equifax and get your credit report. Then the credit bureau sells that  information--which you don't want divulged and which the lender doesn't  want divulged--to other financial institutions without your permission,  creating a so-called…", "date": "2025-06-23", "source_url": "https://justfacts.votesmart.org/public-statement/1692804/homebuyers-privacy-protection-act"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…Speaking with small businesses and workers all over Oregon--I did it  just last week--every single one warned of damage from tariffs, and  soon.\n\nBob's Red Mill, for example, sells delicious flour and grains, mostly  made from wheat and other crops in Oregon. But some of their  ingredients--like coconut or tapioca, which just aren't grown here-- come…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690532/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…have struck this provision, and Republicans voted against it.\n\nHere we are. Republicans are on the House floor pushing forward  legislation that actively and intentionally sells out States' rights.  Much like their promise to lower prices, I guess that was also just an  empty campaign slogan.\n\nTheir bill goes even further than that. It also makes the…", "date": "2025-12-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698067/improving-interagency-coordination-for-pipeline-reviews-act"}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "…American economy.\n\nI know Senator Van Hollen is going to say a lot of the same things  that I was going to say.\n\nI would just say to the Presiding Officer again: I know he sells  great cars, but I am not sure if even folks in Ohio are going to be  able to afford $2,000 or $5,000 more per car just because of ill-suited  tariffs.\n\nSo I would hope that…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689480/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…boondoggle is all about. It takes  financial security from children, rips dinner off the family table, and  crushes people's opportunities for health and financial security and  sells it away to the ultrawealthy.\n\nThis is not a big beautiful bill, as Donald Trump would call it, it  is a big billionaire buyoff and a bludgeoning of our health, our  economy,…", "date": "2025-06-17", "source_url": "https://justfacts.votesmart.org/public-statement/1692644/one-big-beautiful-bill"}, {"senator": "Julie Johnson", "party": "Democrat", "sentence": "…documents, and this one being put up by House  Republicans is morally bankrupt. I will not vote for a bill that  abandons families like Stephanie's and lets kids go hungry or that  sells out our most vulnerable neighbors just to pay for another tax  break for those who definitely do not need one.\n\nMr. Speaker, if you are a Member of this body who claims to…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691436/republican-budget-bill"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…August  district work period hearing from them, the people.\n\nMany stories have been written about how the House Republicans were  selling the bill, but the truth is, the bill sells itself.\n\nEvery Michigander I spoke with is excited. They are excited for no  tax on tips, tax relief for seniors, the end of the death tax, and  provisions to help small businesses…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694791/promises-made-promises-kept"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…easement that       includes permission for cutting and removal described in       subsection (a) shall include a requirement that, if the       applicable electrical utility sells any portion of the       material removed under the permit or easement, the electrical       utility shall provide to the Secretary concerned any proceeds       received from…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691068/fire-safe-electrical-corridors-act-of-2025"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…U.S. sovereign debt. We see things happening around the world that  makes me very nervous. There is an appetite for going on the long end  of the curve.\n\nThe United States sells very short-term debt. Then we have 2 years, 5  years, 20 years, and 30 years. We are having real trouble selling the  debt on the long end of the curve. Do not pay attention…", "date": "2025-05-01", "source_url": "https://justfacts.votesmart.org/public-statement/1690586/economic-anxiety"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…other side is saying, they would buy them. They wouldn't have  to be told to buy them.\n\nI have a letter from the National Association of Food Equipment  Manufacturers, which sells to restaurants and so forth. It says these  costs must be passed on to customers, many of which are small  businesses like restaurants, bars, retailers, hotels, grocers, and…", "date": "2025-03-26", "source_url": "https://justfacts.votesmart.org/public-statement/1689129/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…the end the following:\n\n``(B) includes--\n\n``(i) any entity of the People's Republic of China that the       President determines--\n\n``(I) produces, manufactures, distributes, sells, or       knowingly finances or transports any goods described in       clause (i) or (ii) of paragraph (8)(A); and\n\n``(II) fails to take credible steps, including through…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694826/stop-chinese-fentanyl-act-of-2025"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…transfer or sell the       parcel of land to any other entity, except the Oscar Cross       Boys & Girls Club of Paducah;\n\n(2) if the City of Paducah, Kentucky, transfers or sells       such parcel to the Oscar Cross Boys & Girls Club of Paducah,       that the Oscar Cross Boys & Girls Club of Paducah offers to       convey the parcel of land to the…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697651/removing-restrictions-from-a-parcel-of-land-in-paducah-kentucky"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…we have to bring about 10 to $11 trillion of debt to market  this year for refinancing, and we are going to issue probably $2  trillion of new debt.\n\nWhen the United States sells a 10-year bond and Greece sells a 10- year bond today, Greece has a lower interest rate than the United  States. When the debt markets think Greece is more creditworthy than…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699988/math-is-such-an-anathema"}, {"senator": "Clay Higgins", "party": "Republican", "sentence": "…officials to embrace, that culture that has woven its way into the  fabric of our country that pushes back against the prevention of crime  and the enforcement of law, and sells this idea that we are somehow a  less compassionate nation if we do not continually release career  criminals upon the streets. There is this notion that we can somehow  enforce…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695204/people-are-sick-and-tired"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…possession of the United States.\n\n(11) Third-party online seller.--The term ``third-party       online seller'' means any person other than a hotel or short-      term rental that sells covered services or offers for sale       covered services with respect to a hotel or short-term rental       in a transaction facilitated on the internet.\n\n(12) Total services…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690200/hotel-fees-transparency-act-of-2025"}]