[{"senator": "Steven Horsford", "party": "Democrat", "sentence": "…telling Main Street America: Take  us to court. They are choosing delay over relief and politics over  people.\n\nTonight, the President will stand in this very Chamber and try to  sell the American people on his economy. Working families don't need a  sales pitch; they need relief. They need honesty. They need their money  back--no more excuses, no more delays,…", "date": "2026-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1700196/providing-for-consideration-of-hr-dont-mess-with-my-home-appliances-act-and-providing-for-consideration-of-hr-homeowner-energy-freedom-act"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…you have trouble getting a  mortgage on your property, which means, if you are not selling to a  hedge fund or a billionaire, you have to mark your property down; you  have to sell it for cheap because there simply isn't a mortgage  available for it.\n\nJay Powell, who is useless on climate but knows a little bit about  mortgages and markets and the economy,…", "date": "2026-02-03", "source_url": "https://justfacts.votesmart.org/public-statement/1699613/9999"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…but for a working  person who has to get a mortgage to afford a house or for a working  person who has a house on which he or she is paying a mortgage and now  they need to sell it and they can't find a buyer because the buyer  can't get a mortgage to buy the house because the house can't get  insurance--the property is uninsurable.\n\nThat is how that…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697077/climate-change"}, {"senator": "Yassamin Ansari", "party": "Democrat", "sentence": "…bipartisan. The TRUST in Congress Act and bills like it would  prevent corruption and restore trust in Congress.\n\nBefore I was sworn in to Federal office, I made a personal effort to  sell stocks that I had and to ensure that my financial future would not  and could not be dependent on information that I might become privy to  as a Member of the House of Representatives.…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691213/stock-trading-ban-for-members-of-congress"}, {"senator": "Jason Crow", "party": "Democrat", "sentence": "…universities are buckling.  Some of our most powerful CEOs have capitulated. Some of our largest  media companies are simply surrendering.\n\nIf those with power and influence want to sell off our rights and  freedoms to enrich themselves, then Americans should make it clear that  cowardice and greed will fail. We will not shop at their stores. We  will not tune…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695733/why-i-came-to-congress"}, {"senator": "Steve Cohen", "party": "Democrat", "sentence": "…and with the Trump  tax program starting in 2017, they have increased their wealth  tremendously.\n\nNot paying taxes on real estate and stocks and all that they don't  trade or sell, just accumulating that wealth over and over again while  hardworking people, firemen, nurses, you name it, pay on their wages is  wrong.\n\nWe need to have a tax system that…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695620/billionaires-dont-pay-their-fair-share-of-taxes"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…bushel. There is now talk, by Trump, of taking revenue from the  tariffs to pay farmers a subsidy. I get it--the farmers need it--but  wouldn't it make more sense to let farmers sell the crops that they  grow rather than have a tariff that prohibits them from selling to  markets they have had?\n\nThen the second thing I noticed--and I really am interested…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696342/trump-administration"}, {"senator": "Joe Courtney", "party": "Democrat", "sentence": "…about how aesthetically ugly wind turbines are, he added another new,  startling criticism to his repertoire, mainly that Europe and the U.S.  are suckers for allowing China to sell us wind turbine parts while at  the same time China doesn't even use wind power in its own country.\n\nHere is exactly what he said: ``All you have to do is say to China,  how…", "date": "2026-01-13", "source_url": "https://justfacts.votesmart.org/public-statement/1698954/china-is-not-scamming-europe-and-united-states-on-wind-power"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…There is a 10 percent tariff.\n\nThis tariff is collected at the point of entry into the United States  of goods that an importer desires to purvey in this country. He wants  to sell it, she wants to sell it, or they want to sell it. They want to  sell these goods, so they have to pay this tariff. This tariff has to  be paid that the President would add…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690093/protecting-the-american-dream"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…those drugs, those new breakthrough drugs that you see on  television, were developed by America's taxpayers at the National  Institutes of Health. Sure, the drug companies sell them and market  them, do a good job in that regard. They charge too much in most  instances, but having done the basic research at the expense of  American taxpayers, those…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690656/national-institutes-of-health"}, {"senator": "Maxwell Frost", "party": "Democrat", "sentence": "…colleagues ever talk about it. I came at  this bill skeptically when I looked at it. It turns out the bill itself  was pretty much written by a corporation, Axon, that wants to sell a  new type of taser.\n\nLet's be clear with everyone. Anyone can buy a taser right now. I  would ask everyone watching to go online and look at the fact that  anyone can buy…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700035/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Jamie Raskin", "party": "Democrat", "sentence": "…didn't want to hear it because we know that, in fact,  there is a commercial purpose that pervades this entire legislation. It  is all about opening up a huge, new market to sell tasers, including to  millions of people who nobody should want to have them.\n\nI have repeatedly supported and will continue to support legislation  to give law enforcement…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700036/law-enforcement-innovate-to-de-escalate-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "…and foreign manufacturers are on the side of this  Republican resolution that will terminate the standards.\n\nWhy?\n\nIt is because inefficient appliances mean that gas companies sell  more gas.\n\nNow, Mr. Speaker, if you look at where the manufacturers stand on  this, three out of four major water heater manufacturers are in favor  of the standards and are…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688293/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-consumer-gas-fired-instantaneous-water-heaters"}, {"senator": "Ayanna Pressley", "party": "Democrat", "sentence": "…locked up. I am thinking       of leaving, but I can't go back to Haiti. Can you please help       me find another country to go to? I don't know if I will be       able to sell my home before the due dates. I don't know what       to do for my son. Please help me.''\n\nAnother constituent asked our office, ``Do you think I       should remove my money…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699703/community-testimony-during-the-congressional-field-hearing-on-haitian-tps-termination"}, {"senator": "Jared Huffman", "party": "Democrat", "sentence": "…astronomically high costs in this remote region.\n\nLet me be clear. House Republicans' actions today will do absolutely  nothing to lower your energy bills, but it will allow for the sell-off  of some of our most special and sacred public lands. That is why I  oppose H.J. Res. 131 and all the CRA resolutions on the floor today.\n\nI urge my colleagues to join me…", "date": "2025-11-18", "source_url": "https://justfacts.votesmart.org/public-statement/1696832/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-bureau-of-land-management-relating-to-coastal-plain-oil-and-gas-leasing-program-record-of-decision"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…now. It  should make us a little nervous that certain foreign governments are no  longer bingeing on U.S. debt because we would love to get their money.  Most of the debt we sell to the retirement, to the business, to the  bank, and other things.\n\nThe day we were elected, publicly borrowed debt was about $28  trillion. Let's do a math experiment. Baseline…", "date": "2025-03-06", "source_url": "https://justfacts.votesmart.org/public-statement/1688651/a-real-math-problem"}, {"senator": "Andy Barr", "party": "Republican", "sentence": "…for the American people.\n\nThat is why we want to disapprove this bad regulation. That is why we  want to make sure that mergers are allowed to allow for distressed  banks to sell themselves instead of failing, thereby insulating the  Deposit Insurance Fund from losses.\n\nThis is to help financial stability, Mr. Speaker. I urge all of my  colleagues, for…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691498/providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-the-comptroller-of-the-currency-of-the-department-of-the-treasury-relating-to-the-review-of-applications-under-the-bank-merger-act"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…Mr. Speaker, I rise today to strongly  support the HALT Fentanyl Act. This is critical legislation that will  increase penalties for the criminals who produce, traffic, and sell  this poison.\n\nIn 2023, one Pennsylvanian died every 2 hours from an overdose, with  the overwhelming majority of these resulting from fentanyl poisoning.  Our Nation has lost…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692145/doge-rescissions-package"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…patients undergoing organ       transplants abroad are at-risk of receiving trafficked       organs.\n\nIn many countries, impoverished people are targeted and       coerced to sell an organ from which the traffickers make a       significant profit. The `donor' is left without medical care       and with significant health risks.\n\nIn China the situation…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690630/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…select committee report calls this baffling.\n\nLater, local officials discovered a refrigerator in the lab labeled  ``Ebola.''\n\nWhile the supposed purpose of the lab was to sell test kits, in fact,  all the company did was buy counterfeit kits from China and resell them  in the United States. Thus, the committee found there was a lack of  apparent legitimate…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699473/illegal-bio-lab-in-las-vegas"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…am working on  getting off of it.\n\nIs it moral with taking hard-earned money, rare resources--remember,  it is borrowed money now--and say: Go eat crap.\n\nNow the people who sell onion rings come lobby us and come attack us  and say: People should have the choice. They should with their own  money.\n\nThe fact of the matter is, when we looked at some of…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693062/stop-bathing-in-folklore-and-start-bathing-in-math"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…this November continuing resolution: Democrats  orchestrated the longest shutdown in history. They did so because they  have nothing to run on, because they have nothing to sell to the  American people except for hatred of President Trump and wanting to  play games with your healthcare.\n\nBecause they broke the healthcare system, you now can't afford…", "date": "2025-11-20", "source_url": "https://justfacts.votesmart.org/public-statement/1697130/congress-is-back"}, {"senator": "Glenn Grothman", "party": "Republican", "sentence": "…Now, people do not earn enough income to use, say, in the case of  $100 million, a building, they don't have enough credits to offset $70  million in taxes. So they have to sell the credits to somebody else.  This means getting lawyers and experts from LIHTC involved so that  these credits can be transferred.\n\nA significant number of these credits go…", "date": "2025-05-08", "source_url": "https://justfacts.votesmart.org/public-statement/1690921/big-beautiful-bill"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…JOYCE of Pennsylvania. Mr. Speaker, I rise today in strong  support of the HALT Fentanyl Act, critical legislation to crack down on  the criminals who produce, traffic, and sell fentanyl and fentanyl- related substances.\n\nEarlier this year, we were able to hear powerful testimony from two  of my constituents, Ray and Deb Cullen, who tragically lost…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692344/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…mistreatment of two other migrant  children placed into the care of another sponsor who applied to take  them in as their father. One of the children was reportedly forced to  sell drugs.\n\nThe records show this sponsor was later known to have used multiple  aliases as far back as 2015. In addition, records show this sponsor has  past convictions for fraud,…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699108/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…one step  toward peaking that mountain of regulation, making small businesses  freer to do what they do, making life more affordable to all the people  I represent who buy and sell on Main Street each and every day.", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697331/small-business-regulatory-reduction-act-of-2025"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…look at that. We have a situation where he reduced the sentence  of a Buffalo man, Lairon Graham, 67. In 2023, he was convicted of  organizing and heading a drug conspiracy to sell fentanyl, crack  cocaine, and heroin. When police raided his home, they found fentanyl,  crack, and cash. He also possessed a firearm. In addition to heading up  the drug gang,…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691169/providing-for-consideration-of-hr-improving-law-enforcement-officer-safety-and-wellness-through-data-act-providing-for-consideration-of-hr-leosa-reform-act-and-providing-for-consideration-of-hr-federal-law-enforcement-officer-service-weapon-purchase-act-of-2025"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…they need to. They said they will send troops into  other countries if they need to. The blockade is said to be, Oh, we are  going to control the ships, and we are going to sell the oil, and we  are going to run. We are in charge. It is our oil. We are going to be  in charge of Venezuela.\n\nBut that sounds to me like a military blockade, a long-term…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699091/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…removing the deed       restrictions under subsection (a), the Secretary shall       include a reservation requiring that--\n\n(1) the City of Paducah, Kentucky, not transfer or sell the       parcel of land to any other entity, except the Oscar Cross       Boys & Girls Club of Paducah;\n\n(2) if the City of Paducah, Kentucky, transfers or sells       such…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697651/removing-restrictions-from-a-parcel-of-land-in-paducah-kentucky"}, {"senator": "Zach Nunn", "party": "Republican", "sentence": "…year, while Americans  got hammered by inflation and rising interest rates.\n\nMr. Speaker, I am a farm kid from Iowa. When I came to Washington, I  didn't have many stocks to sell, but I sold them all because it is the  right thing to do. It is ridiculous that anyone would commit insider  trading while being here.\n\nPresident Trump agrees and Speaker Johnson…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691381/congressional-stock-trading-ban"}]