[{"senator": "George Latimer", "party": "Democrat", "sentence": "…Americans living their everyday lives is not justifiable  protest.\n\nThese two unconscionable tragedies in just the past 2 weeks are a  product of a terrifying rise in anti-Semitism in our country. Sadly,  this does not come as a surprise to the American Jewish community, who  regularly face hatred and threats.\n\nAccording to AJC, roughly 7 in 10 Jewish…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691921/rise-of-anti-semitism"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…burn them alive with Molotov cocktails and  incendiary devices.\n\nOur community, Mr. Speaker, is reeling from this terrorist attack.  This kind of hateful violence and anti-Semitism is spreading across the  country. It is metastasizing, and it has deeply shaken the people of my  State and the people of my community. The group, the organization that  was…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692173/condemning-the-rise-in-ideologically-motivated-attacks-on-jewish-individuals-in-the-united-states-including-the-recent-violent-assault-in-boulder-colorado-and-reaffirming-the-house-of-representatives-commitment-to-combating-antisemitism-and-politically-motivated-violence"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…the media and many persons who can make a difference will reject  what you are doing simply because you are saying this is racist. That  is the case.\n\nIt is not like anti-Semitism. There is a big movement to eliminate  anti-Semitism in the country, but when it comes to racism, we want to  manage racism and eliminate anti-Semitism. We need to eliminate…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694943/bloody-sunday-and-voting-rights-act"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…will be denied access to  security clearances or even to go on to governmental property, and  intimidation and threatening our universities, supposedly in the name  of anti-Semitism--nobody hates anti-Semitism more than I do, but I  despise using anti-Semitism as a pretext or a guise simply to attack  people or institutions because they disagree with…", "date": "2025-04-29", "source_url": "https://justfacts.votesmart.org/public-statement/1690353/9999"}, {"senator": "Jennifer McClellan", "party": "Democrat", "sentence": "…and clean water, impact public health.\n\nAs it is also National Ocean Month, the health of our oceans impacts  public  health. The stress of crime, gun violence, racism, anti-Semitism,  hatred, and division impact our mental and physical health.\n\nWe need to start thinking holistically about public health. We need  to start thinking holistically about healthcare…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692205/raising-awareness-about-mens-health"}, {"senator": "Jacky Rosen", "party": "Democrat", "sentence": "…American Jewish  Committee was holding a large event. And the shooter went there  specifically to target and kill Jews and people whom he perceived to be  Jewish.\n\nThis is anti-Semitism--plain and simple. There is no justification in  the world for carrying out or condoning this violent and vile hate  crime. It is pure anti-Semitic violence.\n\nMy heart is…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691646/recognizing-the-significance-of-jewish-american-heritage-month-and-calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…476, a  resolution that makes clear that we stand with the Jewish people, the  Jewish community, and which explicitly calls for us to do more to  address the scourge of anti-Semitism.\n\nMr. Speaker, that resolution is broadly supported by the members of  Colorado's congressional delegation. Colorado has eight Federal  lawmakers here in Washington. Six of…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692191/denouncing-the-antisemitic-terrorist-attack-in-boulder-colorado"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…from communities of color in the State of Texas. It is  racist.\n\nNow, in this country there seems to be a problem with people saying  ``racism.'' It is okay to say ``anti-Semitism,'' but don't say  ``racism.'' Racism has not received the same amount of  acclaim when it comes to dealing with racist issues that anti-Semitism  has received when it comes…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694163/racism-infused-in-texas-politics"}, {"senator": "Peter Welch", "party": "Democrat", "sentence": "…administration. I have heard consistently positive reactions to her  leadership of UNESCO by Republicans and Democrats alike, including  regarding UNESCO's efforts to address anti-semitism.\n\nGiven Director General Azoulay's success in focusing UNESCO on its  mission of promoting international cooperation and peace in a manner  consistent with democratic values…", "date": "2025-07-22", "source_url": "https://justfacts.votesmart.org/public-statement/1694037/unesco"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…community-- who welcomed a son into the world just 2 months ago.\n\nMay the memories of all those killed and injured this weekend be a  blessing.\n\nI have warned repeatedly that anti-Semitism is a scourge around the  world that must be condemned loudly and fought vigorously at every  turn. The Jewish people have been collectively demonized, increasingly  so in…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698130/shooting-at-brown-university-and-shooting-in-sydney-australia"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…necessary to benefit all Americans.\n\nThis reporter mentioned these two words, ``fascism'' and ``racism,''  as incitive terms. Interesting to note, the reporter did not say  ``anti-Semitism.'' By the way, I fight anti-Semitism every day of my  life. I am antithetical to it, and I am going to fight it. I think we  have to end anti-Semitism. I am going to fight…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695338/dark-days"}, {"senator": "Jerry Nadler", "party": "Democrat", "sentence": "…full horror of the destruction there will become clear to all.\n\nFriedman continued, Mr. Speaker, writing: ``Israel, instead of being  seen by Jews as a safe haven from anti-Semitism, will be seen as a new  engine generating it; sane Israelis will line up to immigrate to  Australia and America rather than beckon their fellow Jews to come  Israel's way.…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692485/supporting-israeli-security-and-palestinian-freedom"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…Colorado. We have introduced a resolution, H. Res. 476. It is  a bipartisan resolution. Several of my Republican colleagues have  joined me on this resolution.\n\nIt denounces anti-Semitism, condemns the horrific attack in my  community, and lifts up the organization Run for Their Lives, which was  heinously targeted by this terrorist. This is an organization…", "date": "2025-06-11", "source_url": "https://justfacts.votesmart.org/public-statement/1692346/halt-all-lethal-trafficking-of-fentanyl-act"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…universities. That is why Trump's decision to  target universities that permit criticism of President Trump is so  bone-chilling. He pretends like he is standing up to anti-Semitism on  campuses, but what he is really trying to do is make clear that  protests against his policies on campuses will result in Federal  funding being cut off.\n\nColumbia University…", "date": "2025-04-10", "source_url": "https://justfacts.votesmart.org/public-statement/1690111/authorizing-representation-by-the-senate-legal-counsel-in-the-case-of-desmond-bellard-v-ronald-wyden-us-senator"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "Mr. SCHUMER. Mr. President, last night, just a few blocks from here,  at the Capital Jewish Museum, a scourge of anti-Semitism reared its  ugly head yet again in America. The sickening, cold-blooded murder of  two Jewish staffers of the Israeli Embassy seems to be another horrific  incident of anti-Semitism,…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691653/capital-jewish-museum-shooting"}, {"senator": "Aaron Bean", "party": "Republican", "sentence": "…$30.6  million to various schools around the Nation.\n\nWhat did they get, Mr. Speaker?\n\nWhat do you get for $30 million invested in our schools?\n\nIt is a clear act of anti-Semitism. Classroom maps where they funded  omitted Israel and instead labeled it Palestine. Following a  congressional hearing last year, New York Public Schools acknowledged  receiving…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697439/transparency-in-reporting-of-adversarial-contributions-to-education-act"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…someone to walk out to murder--just a  random person, apparently just to be able to kill a Jew. And then later  screamed at the front door ``Free Palestine.''\n\nThis is anti-Semitism at its worst, and I want my Jewish friends to  be able to know we are praying for you; we are speaking out on your  behalf today; and we have not forgotten. And this kind…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691662/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…that has happened before as a debate like this happened.\n\nI thank Representative Wasserman Schultz for bringing this forward  and saying that we should stand together on anti-Semitism.\n\nMr. Speaker, I recognize that I am new, but a resolution like this  that says that people should care about these issues is not the time  for people to go and make partisan…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691193/calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism-and-educate-the-public-on-the-contributions-of-the-jewish-american-community"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…Government Accountability  Office Detailee for the Subcommittee on Oversight and Investigations  where she has been a critical team member in leading investigations  into Anti-Semitism in medical schools and hospitals and supported the  Committee's role in the bipartisan AI Task Force report that came out  in the 118th Congress. Kristen was also essential…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691958/recognizing-kristen-pinnock"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…the U.S. House of  Representatives, I thank Carla for her extraordinary service. Her  legacy will continue to shape Marion County for years to come.                     Anti-Semitism Has No Place in America\n\nMrs. MILLER-MEEKS. Mr. Speaker, I rise today with urgency and  determination to address the alarming rise in anti-Semitic violence  that is sweeping…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692297/recognizing-davenport-assumption-girls-soccer-team"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…discovered the magazine and became a 30-year subscriber.\n\nNorman and Commentary were there to chronicle the threat from  militant Islam, communist China, and growing anti-Semitism and  radicalism at home.\n\nThanks to great thinkers like Norman, I cannot claim to be a  neoconservative. I was, if I could borrow the phrase, ``right from the  beginning.''…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698421/unanimous-consent-requests-the-calendar"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…and by each President  since, this month recognizes the contributions of the Jewish community  to our country. We celebrate this month amidst a persistent increase in  anti-Semitism in our country.\n\nSince the October 7, 2023, attacks by Hamas on Israel, incidents of  anti-Semitic attacks and harassment have skyrocketed. The American  Jewish Committee…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691192/calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism-and-educate-the-public-on-the-contributions-of-the-jewish-american-community"}, {"senator": "Rick Scott", "party": "Republican", "sentence": "…cold blood.\n\nThese were innocents, out for a night together at the Capital Jewish  Museum here in DC, just like members of our own staff do each and every  week. This anti-Semitism and hate for Israel and the Jewish people is  disgusting, unacceptable, and must be condemned on every level. It is  despicable, and it is dangerous.\n\nWe have seen a rise…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691647/recognizing-the-significance-of-jewish-american-heritage-month-and-calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "…institutions across the United  States is totally unacceptable. Every American has the right to  assemble peacefully and practice their faith without fear of violence.  Acts of anti-Semitism, whether expressed through threats, vandalism, or  violence, are fundamentally incompatible with the values of this  Nation.\n\nToday, remember those who we have lost and stood…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692174/condemning-the-rise-in-ideologically-motivated-attacks-on-jewish-individuals-in-the-united-states-including-the-recent-violent-assault-in-boulder-colorado-and-reaffirming-the-house-of-representatives-commitment-to-combating-antisemitism-and-politically-motivated-violence"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "Mr. MANN. Mr. Speaker, after decades of pledging Never Again, we are  watching the vile presence of anti-Semitism rear its ugly head once  again.\n\nFirst, the unthinkable happened 2 weeks ago here in the streets of  the Nation's Capital when two staffers from the Israeli Embassy, Yaron…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692073/condemning-anti-semitism"}, {"senator": "Cynthia Lummis", "party": "Republican", "sentence": "…last night at the Capital  Jewish Museum.\n\nMay their memory be a blessing for their families, their friends,  their community, and their faith.\n\nLet me be very clear. Anti-Semitism and this kind of hate-fueled  violence have no place in our country, no place in the world.\n\nI encourage you all to join me in keeping these families in your  prayers in the…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691665/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Marsha Blackburn", "party": "Republican", "sentence": "…them.\n\nIn Australia, two terrorists opened fire on a Hanukkah celebration.  They murdered 15 people, including a 10-year old girl and a Holocaust  survivor.\n\nWe know that anti-Semitism is a sickness. It is spreading across the  globe, and world leaders must do more to protect their Jewish  communities.\n\nOur Nation's prayers remain with all of these victims…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698427/unanimous-consent-requests-the-calendar"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…signed by the President,  we could all save time and be much more efficient. We are doing the  people's work today.\n\nMr. Speaker, being lectured to about how we feel about anti-Semitism  on our side of the aisle is not something that I am used to hearing. It  is the Republicans who have led the fight against anti-Semitism on our  college campuses.\n\nMr. Speaker,…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689054/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers-providing-for-consideration-of-hr-defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "…people who had peacefully  gathered.\n\nWe stand in strong opposition and denounce this attack, but this  attack was not an isolated instance. It is part of a surge in anti- Semitism that is going unaddressed. Whether it is the Pennsylvania's  Governor's mansion; a couple in Washington, D.C.; or peaceful protests  in Boulder, Colorado, these attacks should…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692192/denouncing-the-antisemitic-terrorist-attack-in-boulder-colorado"}, {"senator": "Randy Fine", "party": "Republican", "sentence": "…join Egypt, Saudi Arabia, the UAE, and Bahrain and declare  the Muslim Brotherhood and all of its affiliates the terrorist  organization that it is.\n\nWe must tackle the anti-Semitism that we have seen at our  universities, and I have a bill that will deal with that. That is  because when people hear lies that come from the universities that they  believe…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691864/call-evil-by-its-name"}]