[{"senator": "Emily Randall", "party": "Democrat", "sentence": "…powerful reminders  of what happens when we allow fear and prejudice to override our values  of inclusion and justice. In this moment in our history as we celebrate  the semiquincentennial of our Nation, we are also watching history  attempt to repeat itself with the rounding up of Americans and the  rounding up of folks living in this country who are being…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697763/semiquincentennial-tourism-and-access-to-recreation-sites-act"}, {"senator": "Joe Morelle", "party": "Democrat", "sentence": "…reminds us of our shared responsibility to uphold the  values of liberty and equality that have defined this Nation for two- and-a-half centuries.\n\nI, again, thank the Semiquincentennial Commission for its leadership  and planning for this momentous occasion. I particularly commend my  colleague, Congresswoman Watson Coleman, for her leadership in  advancing…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699839/semiquincentennial-congressional-time-capsule-act"}, {"senator": "Maxine Waters", "party": "Democrat", "sentence": "…the gentlewoman from  New Jersey (Mrs. Watson Coleman), who has put a lot of work into this  as she serves as the co-chair of the America 250 Caucus and serves on  the Semiquincentennial Commission.\n\nMrs. WATSON COLEMAN. Madam Speaker, I thank Representative Waters  from the great State of California for yielding.\n\nLet me just say, I enjoyed working on…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699868/for-americas-250th-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…tribute to the founding       generation and the ideals we share with them to this day, but       also as a unifying and educational gesture on the occasion of       the semiquincentennial.       SEC. 3. MINTING AND ISSUING OF $2.50 NUMISMATIC COINS.\n\n(a) In General.--Section 5112 of title 31, United States       Code, is amended by adding at the end the…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699867/for-americas-250th-act"}, {"senator": "Bruce Westerman", "party": "Republican", "sentence": "…by the Senate and House of Representatives of       the United States of America in Congress assembled,       SECTION 1. SHORT TITLE.\n\nThis Act may be cited as the ``Semiquincentennial Tourism       and Access to Recreation Sites Act'' or the ``STARS Act''.       SEC. 2. WAIVED FEES AT PUBLIC RECREATIONAL SITES IN HONOR OF                     AMERICA'S…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697765/semiquincentennial-tourism-and-access-to-recreation-sites-act"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "Mr. ADERHOLT. Madam Speaker, I rise today to speak on the bill, S.  3705, the Semiquincentennial Congressional Time Capsule Act, as led by  Congresswoman and fellow commissioner on the Semiquincentennial  Commission, Bonnie Watson Coleman, and also by Senator Thom…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699841/semiquincentennial-congressional-time-capsule-act"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "Mrs. BICE. Madam Speaker, I move to suspend the rules and pass the  bill (S. 3705) to provide for the creation of a congressional time  capsule in commemoration of the semiquincentennial of the United  States, and for other purposes.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:                                  S. 3705\n\nBe…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699840/semiquincentennial-congressional-time-capsule-act"}, {"senator": "Celeste Maloy", "party": "Republican", "sentence": "…idea we ever had,'' our national parks.\n\nNational parks provide our connection to history, nature, and shared  heritage, including our bright future as a nation. The  Semiquincentennial Tourism and Access to Recreation Sites Act, which  doesn't exactly roll off the tongue, so we call it the STARS Act,  designates Constitution Day, September 17, 2026,…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697764/semiquincentennial-tourism-and-access-to-recreation-sites-act"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "Mr. STEIL. Madam Speaker, I move to suspend the rules and pass the  bill (H.R. 469) to provide for the creation of a Congressional time  capsule in commemoration of the semiquincentennial of the United  States, and for other purposes.\n\nThe Clerk read the title of the bill.\n\nThe text of the bill is as follows:                                  H.R. 469…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688200/semiquincentennial-congressional-time-capsule-act"}, {"senator": "Robert Aderholt", "party": "Republican", "sentence": "…Committee just  mentioned, I was privileged to introduce. It is a bicameral, bipartisan  $2.50 for America's 250th Act in partnership with Congresswoman and  fellow U.S. Semiquincentennial Commissioner Bonnie Watson Coleman, as  well as Commissioners Congresswoman Maria Salazar and Congressman  Dwight Evans.\n\nI thank the chair and ranking member of the…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699869/for-americas-250th-act"}, {"senator": "Elise Stefanik", "party": "Republican", "sentence": "…the American Revolution, home to numerous  battlefields and historic sites that were critical in shaping our  Nation's founding and history.\n\nAs we approach the U.S. semiquincentennial and the 250th anniversary  of the Battles of Saratoga, there is no better time to recognize the  pivotal role this site played in our Nation's war for independence.…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691016/strengthening-americas-turning-point-act"}, {"senator": "French Hill", "party": "Republican", "sentence": "…February by selecting a Senator, alternating parties, to read the  7,641-word statement in their legislative session. This year,  fittingly, in this year of America250, our semiquincentennial, it was  Senator Tim Kaine of Virginia.\n\nThe House revived the ceremonial reading in 1889 and continued  intermittently until 1933, after which it became an annual fixture…", "date": "2026-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1700272/president-washingtons-farewell-address"}, {"senator": "Chuck Edwards", "party": "Republican", "sentence": "…America250-- specifically how FMC can engage audiences across the country and even  overseas in a discourse about our representative democracy as part of  the Nation's semiquincentennial celebration.\n\nAs part of our contribution to America250, we want to engage in a  dialogue with many different audiences, and we want that dialogue to be  credible, inspirational,…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698189/9999"}, {"senator": "French Hill", "party": "Republican", "sentence": "…democratic socialism vision  with New Yorkers. He pledged to ``replace the frigidity of rugged  individualism with the warmth of collectivism.''\n\nHere in our Nation's semiquincentennial, 250 years of liberty, the  new mayor rejected the fundamentals of American hard work and the  extraordinary benefits of markets that have freed billions from hunger…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698914/warmth-of-collectivism"}]