[{"senator": "Joaquin Castro", "party": "Democrat", "sentence": "…in the country.\n\nOur economy is deeply tied to North American supply chains. Thousands  of San Antonians work in aerospace, automotive manufacturing, energy,  machinery, semiconductors, and medical devices, exactly the high-paying  industries we want to be growing here in the United States.\n\nThese companies chose San Antonio because we are highly integrated…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699976/relating-to-a-national-emergency-by-the-president-on-february-2025"}, {"senator": "Bill Foster", "party": "Democrat", "sentence": "…discoveries driving the next  generation of science.\n\nThis includes funding for AI, for cybersecurity, for supercomputers,  fusion energy, space, ocean exploration, black holes, semiconductors,  and, last but not least, the internet.\n\nIn addition to basic research, the NSF also funds many educational  programs supporting the next generation of scientists. Perhaps…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691390/stop-trumps-chaos-stand-up-for-science"}, {"senator": "Paul Tonko", "party": "Democrat", "sentence": "…breakthroughs, our competitiveness, and the livelihoods of  the next generation.\n\nThis is about whether America leads in clean energy, advanced  manufacturing, quantum computing and semiconductors, or cedes those  opportunities to competitors abroad. We are supposed to win all the  races and make us great again. We are falling behind in competition.\n\nConstruction…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695601/devastating-harm-caused-by-trump-administration"}, {"senator": "Ro Khanna", "party": "Democrat", "sentence": "…soared.\n\nSo one of the things this group wants to do is to renew economic  revitalization in advanced manufacturing in these communities and to  have a real plan for new semiconductors, new robotics, advanced steel,  advanced automobiles, and have new factories and new industry come up.\n\nNow, the President and JD Vance understood that the country was…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689079/economic-populism"}, {"senator": "Darren Soto", "party": "Democrat", "sentence": "…within the RDT&E-Defense Wide Account, to the Industrial Base Analysis  and Sustainment Program's (IBAS) Fan-Out Wafer level packaging program  in the en bloc package.\n\nSemiconductors support nearly all Department of Defense (DoD)  activities. Ensuring secure access to leading-edge semiconductors,  however, is a challenge. The pandemic exposed the challenges…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693817/department-of-defense-appropriations-act-2026"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…week I placed new duties on       some Japanese products in response to Japan's inability to       enforce their trade agreement with us on electronic devices       called semiconductors. Now, imposing such tariffs or trade       barriers and restrictions of any kind are steps that I am       loath to take. And in a moment I'll mention the sound       economic…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696451/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Marcy Kaptur", "party": "Democrat", "sentence": "…is merely the       latest technological feat for a country that has stunned       Western governments with a string of breakthroughs on       artificial intelligence, semiconductors and EVs--a       vindication of leader Xi Jinping's ambitions of turning China       into a global technological powerhouse.\n\nContemporary Amperex Technology, the world's…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694959/highlighting-advances-in-chinese-electric-vehicle-technology-and-the-need-for-american-investment-in-battery-technology"}, {"senator": "Greg Landsman", "party": "Democrat", "sentence": "…Chains Act, as has  been said, is a very straightforward, commonsense bill. It will help  strengthen our domestic semiconductor industry and grow U.S.  manufacturing.\n\nSemiconductors are the foundation of modern technology and core to  our national security. They power everything from our cell phones,  laptops, cars, medical devices, and critical infrastructure.…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690163/securing-semiconductor-supply-chains-act-of-2025"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…others.\n\nOur use of export controls have become more and more frequent and  more complicated, as we have started to apply novel controls in  critical technology areas such as semiconductors and AI. While this  change in U.S. export control policy has taken place, congressional  consultation and oversight has not kept up.\n\nThe bill in front of us today by Representative…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690694/maintaining-american-superiority-by-improving-export-control-transparency-act"}, {"senator": "Frank Pallone, Jr.", "party": "Democrat", "sentence": "Mr. Speaker, I rise to speak in support of H.R. 2480, the Securing  Semiconductor Supply Chains Act.\n\nSemiconductors are a necessary component of everything from consumer  electronics to automobiles to our national defense weapons systems. The  United States, once a global powerhouse…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690161/securing-semiconductor-supply-chains-act-of-2025"}, {"senator": "John Olszewski, Jr.", "party": "Democrat", "sentence": "…played a crucial role in supporting Russia. Though they  have not provided overt military support, they are continuing to  provide dual-use goods, like industrial tools and semiconductors.\n\nAt a minimum, given its tendencies to appease Russia rather than  pressure it, the Trump administration must maintain the current posture  of deterrence with the existing…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690677/economic-espionage-prevention-act"}, {"senator": "Randy Weber, Sr.", "party": "Republican", "sentence": "…next-generation economy.\n\nThese resources, Mr. Speaker, are absolutely required in virtually  everything we need to compete as well as defend our country from  foreign threats: semiconductors, nuclear reactors, oil and gas  infrastructure, the transmission system, and military weaponry, just to  name a few.\n\nMake no mistake about it, Communist China knows this…", "date": "2026-02-11", "source_url": "https://justfacts.votesmart.org/public-statement/1699990/securing-americas-critical-minerals-supply-act"}, {"senator": "Lisa McClain", "party": "Republican", "sentence": "…in the Indo- Pacific is to American jobs and our economy.\n\nTaiwan is not only a democratic partner. It is also a key player in  the global supply chain, especially for semiconductors that power  everything from our cars to our national defense system.\n\nThis bill sends a clear and bipartisan message: If the CCP wages war  against Taiwan, there will be…", "date": "2025-07-21", "source_url": "https://justfacts.votesmart.org/public-statement/1693874/taiwan-conflict-deterrence-act-of-2025"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…FINDINGS.\n\nCongress finds the following:\n\n(1) On March 14, 2024, the Department of State notified       Congress of the following:\n\n(A) People's Republic of China exports of semiconductors to       Russia have increased substantially since Russia's full-scale       invasion of Ukraine.\n\n(B) In the second half of 2023, China exported between       $25,000,000…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690679/economic-espionage-prevention-act"}, {"senator": "John Joyce", "party": "Republican", "sentence": "…$1.4  trillion investment into our economy from the United Arab Emirates.  This investment will support American artificial intelligence  infrastructure. It will support semiconductors made in America. It will  support energy production from America. It will support American  manufacturing.\n\nOur two nations worked closely together during President Trump's…", "date": "2025-03-24", "source_url": "https://justfacts.votesmart.org/public-statement/1688957/president-trump-bringing-back-investments"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…advances--most importantly, in certain critical sectors.\n\nAs of 2023, U.S. investors were investing close to $2 billion in  Chinese critical technology sectors, including semiconductors, quantum  computing, and artificial intelligence. A report from the U.S.-China  Economic and Security Review Commission noted: ``The United States is  the most important…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688807/cormick-and-mmcr-fettermanhagerty-kim-cormick-schumer-sullivan-fetterman-and-others-for"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…of the Department of Commerce established by       Executive Order No. 13577 (76 Fed. Reg. 35715).       SEC. 3. FINDINGS.\n\nCongress makes the following findings:\n\n(1) Semiconductors underpin the United States and global       economies, including manufacturing sectors. Semiconductors       are also essential to the national security of the United…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690162/securing-semiconductor-supply-chains-act-of-2025"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Things.\n\n(vii) Nano technology.\n\n(viii) Robotics.\n\n(ix) Microelectronics, optical fiber ray, and high       performance and advanced computer hardware and software.\n\n(x) Semiconductors.\n\n(xi) Advanced materials science, including composition 2D,       other next generation materials, and related manufacturing       technologies.\n\n(13) Institution of higher…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690188/promoting-resilient-supply-chains-act-of-2025"}, {"senator": "Richard McCormick", "party": "Republican", "sentence": "…minority  party for supporting this bill.\n\nSince illegally invading Ukraine, the Russian Federation has become  reliant on the People's Republic of China for its supply of  semiconductors and other critical dual-use technologies. The State  Department notified Congress last year that the PRC exports of  semiconductors significantly increased in 2023 compared…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690678/economic-espionage-prevention-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…tune of billions of dollars.\n\nThe U.S.-China Economic and Security Review Commission noted that the  United States is ``the most important single source of investment to  semiconductors, quantum computing, and AI in China.'' In other words,  we are funding our principal competitor, and that competitor is not  only an economic competitor but is vying for…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697200/senate-agenda"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…battle for the future of the world will  literally be determined by who wins the race for artificial  intelligence, which is heavily reliant on the production of advanced  semiconductors and other advanced microelectronics.\n\nThese technologies--and this is really important--have both  commercial and military applications, but in China, anything that is…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697555/china"}, {"senator": "Jason Smith", "party": "Republican", "sentence": "…extracted resources routed to the United States or allied       partners for processing. The incentive should be industry       agnostic, so minerals sourced for defense, semiconductors,       and energy would be eligible for the incentive. However, in       the meantime, ensuring AGOA's renewal without interruption is       essential to signal the strength…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698908/agoa-extension-act"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…advances--most importantly, in certain critical sectors.\n\nAs of 2023, U.S. investors were investing close to $2 billion in  Chinese critical technology sectors, including semiconductors, quantum  computing, and artificial intelligence. A report from the U.S.-China  Economic and Security Review Commission noted: ``The United States is  the most important…", "date": "2025-03-13", "source_url": "https://justfacts.votesmart.org/public-statement/1688824/statements-on-introduced-bills-and-joint-resolutions"}]