[{"senator": "Al Green", "party": "Democrat", "sentence": "…has not received the same amount of  acclaim when it comes to dealing with racist issues that anti-Semitism  has received when it comes to dealing with things that are anti- Semitic.\n\nWell, I am not afraid. I am going to speak truth to power and about  power. Here is the truth: Under this President, Republicanism is  eroding and devolving into racism.…", "date": "2025-07-23", "source_url": "https://justfacts.votesmart.org/public-statement/1694163/racism-infused-in-texas-politics"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…itself.\n\nAfter the invasion took place, they went through the Halls. They did  some very ugly things. Aside from calling for the lynching of people,  aside from having some anti-Semitic commentary on various pieces of  paraphernalia, they had gallows. Aside from these things, they  committed other demeaning and vile acts, such as defecating in various  public…", "date": "2025-12-04", "source_url": "https://justfacts.votesmart.org/public-statement/1697472/president-trump-is-a-threat-to-our-republic"}, {"senator": "Jacky Rosen", "party": "Democrat", "sentence": "…that  took place last night. Like so many other Jews in America and around  the world, I woke up this morning heartbroken by the news of yet  another unspeakable act of anti-Semitic violence that occurred late  last night, this time--this time--in our Nation's Capital, less than 1  mile from where I am standing this very moment. This shooting occurred…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691646/recognizing-the-significance-of-jewish-american-heritage-month-and-calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism"}, {"senator": "Sharice Davids", "party": "Democrat", "sentence": "…DAVIDS of Kansas. Mr. Speaker, I rise today with a heavy heart to  honor the lives of Sarah Milgrim and her partner, Yaron Lischinsky, who  were tragically killed in an anti-Semitic attack outside the Capital  Jewish Museum here in D.C.\n\nSarah grew up in Prairie Village, Kansas, a community that I have the  honor of serving in Congress. She graduated…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691841/in-memory-of-recent-gun-violence-victims"}, {"senator": "Mark Takano", "party": "Democrat", "sentence": "…burials were due to clerical errors, we have heard many stories of  Jewish war heroes not wanting to display their faith on their dog tags  while fighting against the anti-Semitic and genocidal Nazi regime.\n\nSadly, this issue is not limited to World War II.\n\nThis past spring, I had the honor of participating in a ceremony at  Arlington National Cemetery…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695467/fallen-servicemembers-religious-heritage-restoration-act"}, {"senator": "Laura Gillen", "party": "Democrat", "sentence": "Ms. GILLEN. Mr. Speaker, I rise today to condemn the despicable anti- Semitic terror attack targeted against Jews who were marching in  Boulder, Colorado, in support of the hostages being held in Gaza.\n\nThis horrific attack comes on the heels of another…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691979/condemning-the-boulder-colorado-anti-semitic-attack"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…abilities to engage in  important educational programming in conjunction with our democratic  allies while failing to confront the real problem of antidemocratic and  anti-Semitic foreign influence.\n\nMr. Speaker, it is a shame that we could not work in a bipartisan way  to make this bill better and to address the root issue that both sides  of the aisle…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689052/providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-walk-in-coolers-and-walk-in-freezers-providing-for-consideration-of-hj-res-providing-for-congressional-disapproval-of-the-rule-submitted-by-the-office-of-energy-efficiency-and-renewable-energy-department-of-energy-relating-to-energy-conservation-program-energy-conservation-standards-for-commercial-refrigerators-freezers-and-refrigerator-freezers-providing-for-consideration-of-hr-defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…personally. It shocks the conscience that on the eve of the holiday of  Shavuot, our Jewish brothers and sisters were subjected to yet another  brutal, horrific, and anti-Semitic act of violence.\n\nThe scourge of anti-Semitism has metastasized across our country, and  we have to do more now to stop this hatred and violence.\n\nWe continue to stand with…", "date": "2025-06-03", "source_url": "https://justfacts.votesmart.org/public-statement/1691842/in-memory-of-recent-gun-violence-victims"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…turn. The Jewish people have been collectively demonized, increasingly  so in the last few years. This tragedy in Sydney shows the danger--the  abject danger--of letting anti-Semitic rhetoric and action go  unchecked.\n\nSo those of us in elected office have a responsibility to speak out  against anti-Semitic rhetoric and conduct wherever it arises and…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698130/shooting-at-brown-university-and-shooting-in-sydney-australia"}, {"senator": "Troy Carter, Sr.", "party": "Democrat", "sentence": "…who was detained because of his participation in a peaceful  protest. I had an opportunity to sit and visit with him. He said,  without fear of contradiction: I am not anti-Semitic. I am not pro- Hamas. I am simply concerned about my homeland and the treatment of the  people that are there.\n\nRumeysa Ozturk is a Ph.D. student detained because she wrote…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690503/trump-immigration-policies"}, {"senator": "George Latimer", "party": "Democrat", "sentence": "…yelling, ``Free Palestine,'' murdered them.\n\nThis past weekend, 12 people who gathered weekly to bring attention  to the hostages held captive by Hamas were firebombed by an anti- Semitic terrorist in Boulder, Colorado. Committing violent acts and  murder against Americans living their everyday lives is not justifiable  protest.\n\nThese two unconscionable tragedies…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691921/rise-of-anti-semitism"}, {"senator": "Joe Neguse", "party": "Democrat", "sentence": "…My wife  and I are incredibly blessed and lucky to be raising our family in this  community.\n\nLast week, I introduced a bipartisan resolution denouncing this  heinous anti-Semitic terror attack in my community. H. Res. 476, a  resolution that makes clear that we stand with the Jewish people, the  Jewish community, and which explicitly calls for us to…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692191/denouncing-the-antisemitic-terrorist-attack-in-boulder-colorado"}, {"senator": "Joshua Gottheimer", "party": "Democrat", "sentence": "…unfunded spending  increases, and even government-run grocery stores.\n\nIn New York, job-killing comptroller, socialist, and reckless spender  Brad Lander refuses to condemn anti-Semitic language like globalize the  intifada, which calls for the death of the Jewish people. Many of  Mayor-elect Mamdani's policies are radically at odds with both the  Democratic…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697158/denouncing-the-horrors-of-socialism"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…give some examples of these practices.\n\nIn December 2023, Rutgers University found that TikTok's algorithm  disproportionately amplified anti-Israel and, by extension, anti- Semitic content compared with other social media platforms. This  amplification observed in the context of a major geopolitical events,  such as the portrayal of the Israel-Hamas…", "date": "2025-06-18", "source_url": "https://justfacts.votesmart.org/public-statement/1692683/tiktok"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…believe it? Can you believe it? The swastika is no longer a  recognized hate symbol?\n\nThey did this just after the horrible shootings in Sydney and so many  other shootings--anti-Semitic shootings--and activities that have been  plaguing America.\n\nThe new policy of the Coast Guard is shameful. It is dangerous and  another troubling instance of the Trump administration…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698255/nominations"}, {"senator": "Tim Walberg", "party": "Republican", "sentence": "…contribute billions of dollars to American  universities. The lack of transparency around foreign relationships  should concern every American as we see stolen research, anti-Semitic  propaganda, and academic censorship. None of these things belong inside  our borders let alone on our college campuses.\n\nBy establishing footholds in American schools, bad…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689032/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Gabe Evans", "party": "Republican", "sentence": "Mr. EVANS of Colorado. Mr. Speaker, I rise today in strong support of  this resolution to denounce the anti-Semitic terrorist attacks that  occurred in Boulder, Colorado, on June 1, 2025.\n\nFirst and foremost, let me say my heart goes out to the Jewish  community, who were peacefully advocating…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692192/denouncing-the-antisemitic-terrorist-attack-in-boulder-colorado"}, {"senator": "Michael Baumgartner", "party": "Republican", "sentence": "…foreign funding data  between 2024 and 2019 and found that universities receiving undisclosed  donations from Middle Eastern sources saw, on average, 300 percent more  anti-Semitic incidents than other institutions.\n\nCorrelation is not causation, but one thing is certain: Secrecy  allows these influences to operate unchecked and unexamined. The less…", "date": "2025-03-25", "source_url": "https://justfacts.votesmart.org/public-statement/1689028/defending-education-transparency-and-ending-rogue-regimes-engaging-in-nefarious-transactions-act"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…our country. We celebrate this month amidst a persistent increase in  anti-Semitism in our country.\n\nSince the October 7, 2023, attacks by Hamas on Israel, incidents of  anti-Semitic attacks and harassment have skyrocketed. The American  Jewish Committee found that 77 percent of American Jews say they feel  less safe in the United States since the October…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691192/calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism-and-educate-the-public-on-the-contributions-of-the-jewish-american-community"}, {"senator": "Roger Williams", "party": "Republican", "sentence": "Mr. WILLIAMS of Texas. Mr. Speaker, I rise today in support of H.  Res. 481, which condemns the disturbing rise in anti-Semitic attacks  across the United States.\n\nOn October 7, 2023, Hamas terrorists murdered and took hostage  innocent Israelis in an unprovoked attack. Since then, anti-Semitic  incidents…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692174/condemning-the-rise-in-ideologically-motivated-attacks-on-jewish-individuals-in-the-united-states-including-the-recent-violent-assault-in-boulder-colorado-and-reaffirming-the-house-of-representatives-commitment-to-combating-antisemitism-and-politically-motivated-violence"}, {"senator": "Jeff Crank", "party": "Republican", "sentence": "…support the ``be it resolved'' in that  resolution.\n\nI rise today in support of my friend and colleague, Representative  Gabe Evans, and his resolution denouncing this anti-Semitic terrorist  attack.\n\nWe shouldn't even be here today debating this resolution. Because of  the radical, illegal, and harmful policies being rubberstamped by the  Governor of…", "date": "2025-06-09", "source_url": "https://justfacts.votesmart.org/public-statement/1692193/denouncing-the-antisemitic-terrorist-attack-in-boulder-colorado"}, {"senator": "Tracey Mann", "party": "Republican", "sentence": "…sympathizer threw Molotov cocktails into a crowd and  injured more than a dozen people while yelling: ``Free Palestine.''\n\nAudrey and I are deeply grieved by these senseless anti-Semitic  terror attacks, and we continue to lift up the victims, their families,  and their loved ones in prayer.\n\nNow is not the time to waver in our commitment to Israel or the…", "date": "2025-06-05", "source_url": "https://justfacts.votesmart.org/public-statement/1692073/condemning-anti-semitism"}, {"senator": "Mariannette Miller-Meeks", "party": "Republican", "sentence": "…Anti-Semitism Has No Place in America\n\nMrs. MILLER-MEEKS. Mr. Speaker, I rise today with urgency and  determination to address the alarming rise in anti-Semitic violence  that is sweeping across our Nation.\n\nIn recent weeks, two young Israeli Embassy staffers, Yaron Lischinsky  and Sarah Milgrim, were shot and killed outside the Capital…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692297/recognizing-davenport-assumption-girls-soccer-team"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…ever see anything like it in  this country. I think when you have proposals in Congress that  encourage that, that are very much thematically aligned with the pro- Hamas, anti-Semitic encampments that took over universities in the  country, it is very important that that is condemned strongly and  unequivocally. I am very proud that that is exactly what…", "date": "2025-03-27", "source_url": "https://justfacts.votesmart.org/public-statement/1689211/protecting-medicaid-for-californians"}, {"senator": "Rick Scott", "party": "Republican", "sentence": "Mr. SCOTT of Florida. Madam President, I stand today to condemn the  anti-Semitic and hate-fueled murders of Yaron Lischinsky and Sarah  Milgrim that occurred last night at the hands of a Hamas sympathizer.  This was a sickening, violent, and anti-Semitic…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691647/recognizing-the-significance-of-jewish-american-heritage-month-and-calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism"}]