[{"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "\"Americans are facing unprecedented disruptions to their daily lives and we need to make sure that in the midst of this pandemic, Americans don't also lose their ability to vote,\" Senator Klobuchar said."}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "Senator Klobuchar does such  a great job on so many issues."}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "Inaccessible polling places and voting booths, limited access to transportation, insufficient options for casting ballots, and inaccessible voter websites are all obstacles to voting for millions of Americans,\" said Senator Klobuchar."}, {"senator": "Richard J. Durbin", "party": "Democrat", "sentence": "Senator Klobuchar and I have discussed it."}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "That's why Senator Klobuchar, Casey, and I have introduced bipartisan and bicameral legislation, the ACCESS Act.\"\n\n\"The situation in our nation's nursing homes and long-term care facilities is dire."}, {"senator": "Debbie Dingell", "party": "Democrat", "sentence": "I also thank Chairman Bilirakis and my co-leads,  Representatives Salazar, Dean, and Pfluger, as well as Senator Cruz and  Senator Klobuchar, my compatriot many days, who works to prioritize  violence against women."}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "\"That's why Senator Klobuchar, Senator Wyden, and I are advocating within Congress to secure more funding and direction in the next stimulus package to help states expand vote-by-mail, early voting, and online voter registration, because it's our responsibility to ensure that a safe and accessible election will happen."}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "KEILAR: Dana, thank you so much and thank you so much to Senator Klobuchar."}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "We would like to thank Senator Klobuchar and her staff for reducing the barrier to mental health access for millions of Americans,\" said the American Counseling Association."}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "\"As we continue to confront the coronavirus pandemic, Americans should not have to worry about the privacy and security of their personal health data,\" said Senator Klobuchar."}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "Senator Klobuchar, welcome back to Meet the Press."}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "And Senator Klobuchar joins me now."}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "\"Thanks to Senator Klobuchar and Senator Smith for their bipartisan cooperation in securing these funds.\""}, {"senator": "Kirsten E. Gillibrand", "party": "Democrat", "sentence": "BALDWIN: Speaking of women and female candidates, you want to endorse either of your female colleagues in the Senate here, Senator Warren or Senator Klobuchar right now on CNN."}, {"senator": "Christopher A. Coons", "party": "Democrat", "sentence": "Coons: Well Kasie, I really don't think that we should be bringing all 100 senators back to the floor to cast a vote in this context if we can possibly avoid it, and frankly, that's the subject of a letter that Senator Klobuchar and Senator Wyden and I have been leading and an effort that we've been leading to appropriate more money to make sure that the average American citizen also isn't forced to go and vote in person while we still have shelter in place orders."}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "Senator Klobuchar told us she selected the piece for its vast, open  landscape, noting how its enduring horizon reflects our enduring  democracy."}, {"senator": "Joni Ernst", "party": "Republican", "sentence": "\"At a time when many farmers and rural communities are feeling disproportionate impacts from the coronavirus pandemic, it's important we work to keep our renewable fuel industry strong,\" said Senator Klobuchar."}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "Senator Klobuchar of Minnesota and I have introduced a bipartisan  resolution to recognize C-SPAN2 and the public service it provides the  American people through its live, nonpartisan coverage."}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "I'm proud to join Senator Klobuchar in helping to introduce this bipartisan legislation to do that.\"\n\n\"Many of our servicemembers and veterans are particularly vulnerable to the coronavirus pandemic, especially those who were stationed near burn pits,\" Klobuchar said."}]