[{"senator": "Adam Schiff", "party": "Democrat", "sentence": "…nonpartisan Government Accountability Office, saying  that their unprecedented action was preceded, almost warranted, by the  GAO's actions.\n\nYes, my colleagues Senator Whitehouse, Senator Padilla, and myself  went to the GAO to ask for their guidance on whether this expedited  measure, called the CRA, could be used to target California's waiver,  California's…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691452/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Chuck Schumer", "party": "Democrat", "sentence": "…at Arms, and Capitol  Police to ensure everyone's safety. This weekend, I asked Capitol  Police and the Sergeant at Arms to increase the security for Members,  including Senator Padilla and the Minnesota Senators. Knowing that the  Sergeant at Arms, her entire operation, and the Capitol Police are  there to help us right now is comforting.\n\nTomorrow,…", "date": "2025-06-16", "source_url": "https://justfacts.votesmart.org/public-statement/1692571/senate-security"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…CANTWELL. Mr. President, I come to the floor to join my  colleagues to express outrage over the actions taking place in Los  Angeles when our dear colleague Alex Padilla, Senator Padilla, was  thrown out of an event where he was just simply trying to express his  opinion on behalf of the millions of Californians that he represents.\n\nIt is so interesting…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692451/alex-padilla"}, {"senator": "Adriano Espaillat", "party": "Democrat", "sentence": "…number, anonymous masked ICE agents,  patrolling our streets, pushing people up against a wall, slamming to  the ground a sitting U.S. Senator for the State of California, Senator  Padilla, slamming a woman to the ground at 26 Federal Plaza in front of  her young girl, not representing or respecting sensitive locations like  places of worship, houses of…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697446/fighting-dhs-immigration-raids"}, {"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "Ms. WARREN. Mr. President, this is a horrifying moment in our  Nation's history. Today, U.S. Senator Alex Padilla was violently  removed from a public briefing for asking questions on behalf of the  people he represents, people in California who deserve answers about  the brutal…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692473/alex-padilla"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…afternoon, but I have to join my colleagues in  addressing the shocking video out of Los Angeles. I have now looked at  it. If you are following at home, our colleague Senator Padilla was  carrying out his constitutional responsibilities to conduct oversight  and defend the people he represents. At that time, he was physically  accosted and shoved out…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692429/alex-padilla"}, {"senator": "Angela Alsobrooks", "party": "Democrat", "sentence": "Ms. ALSOBROOKS. Mr. President, I stand today, and I am shaking. I am  so angry. I am so enraged with the treatment that I witnessed today of  my colleague Senator Padilla. This is not the America--this is not the  America--that each of us comes here each day to stand on behalf of.\n\nThere are some who are saying they don't recognize this…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692441/alex-padilla"}, {"senator": "Martin Heinrich", "party": "Democrat", "sentence": "Mr. HEINRICH.  I rise  today to object on behalf of my colleague from California Senator  Padilla and my colleague from Colorado Senator Bennet.\n\nThe Energy and Natural Resources Committee does have a long tradition  of bipartisanship and cooperation when it comes…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696960/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-extension-of-deadlines-in-standards-of-performance-for-new-reconstructed-and-modified-sources-and-emissions-guidelines-for-existing-sources-oil-and-natural-gas-sector-climate"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…clear: Rights without remedy are empty promises. Rights  without enforcement, when they are violated, are a mirage. And so I  proposed, along with a number of my colleagues Senator Padilla  and Senator Whitehouse, a very simple change in the law--four words--so  that Federal agents have the same kind of legal responsibility and the  same liability, if they…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699650/9999"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…through for their  fossil fuel donors. Period. End of story. They don't care what they  break. But, please, don't pretend that you are overruling GAO.\n\nMy team, along with Senator Padilla's team, was in the L.B.J. Room  making those arguments to the Parliamentarian. There was robust debate.  We filed briefs. Questions were asked. The whole thing was a very…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691447/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…need to ensure that  that right is protected.\n\nI want to thank Ranking Members Padilla and Reed for their leadership  on this issue and in organizing this floor block. Senator Padilla, a  former Secretary of State himself, understands to a core how important  the right to vote is.\n\nThe right to vote is sacred to our democracy. It secures all of our…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690545/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Jack Reed", "party": "Democrat", "sentence": "…President, I rise today alongside my colleagues to  speak out against the attack on a fundamental right of every American  citizen: the right to vote.\n\nI want to thank Senator Padilla for leading this important effort.  The progress, the prosperity, and success of our Nation, both as an  economic power and as an inspiration for freedom-loving people…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690531/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…next day you might  be arrested; the next day you might be disappeared or even killed.\n\nThat is not who we are. We need brave, patriotic Americans to stand  up, just as Senator Padilla has done, and insist upon their right to  peacefully assemble and present whatever critiques or complaints they  have about policies that they find to be objectionable.", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692555/alex-padilla"}, {"senator": "Chris Murphy", "party": "Democrat", "sentence": "…gather some additional facts, to come to a conclusion. But we need our  Republican colleagues to be on the floor right now with us because this  is not simply an assault on Senator Padilla. This is not an assault on  Democratic Senators. This is an assault on the rule of law. This is an  assault on our democracy. And ultimately, we are robbing the ability…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692557/alex-padilla"}, {"senator": "Mark Kelly", "party": "Democrat", "sentence": "…President and his  ability to just work outside of the boundaries of what most Americans  feel are in accordance with our values and our ethics.\n\nWhat happened today to Senator Padilla was outrageous. It was  violent. It is a scary thing to see happen in the United States of  America.\n\nAlex Padilla is a great guy. He is thoughtful. He is passionate.…", "date": "2025-06-12", "source_url": "https://justfacts.votesmart.org/public-statement/1692559/alex-padilla"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…thank  my colleague from California, my friend from California who has worked  with me, by the way, on one of the other bills that just passed. I was  a cosponsor with Senator Padilla on that, so this is good Senate  cooperation on these issues.\n\nSo that is an important issue for Alaskan Native heritage, culture,  artists, and now it has passed the…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696086/alaskas-right-to-ivory-sales-and-tradition-act"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "…Administration has adopted rules governing its procedures for the 119th  Congress. Pursuant to rule XXVI, paragraph 2, of the Standing Rules of  the Senate, on behalf of myself and Senator Padilla, I ask unanimous  consent that a copy of the committee rules be printed in the Record.\n\nThe regular meeting dates of the Committee shall be       the second and fourth…", "date": "2025-02-25", "source_url": "https://justfacts.votesmart.org/public-statement/1687982/us-senate-committee-on-rules-and-administration-rules-of-procedure"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…considered read a third time and  passed and that the motion to reconsider be considered made and laid  upon the table.\n\nMr. GRAHAM. Mr. President, I thank my good friend Senator Padilla.\n\nNo. 1, we are going to have an election in November. Senator Padilla  says that sanctuary policies are not part of the problem. I think they  are. I think the American…", "date": "2026-02-12", "source_url": "https://justfacts.votesmart.org/public-statement/1700070/9999"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…Native Vietnam  veterans, and I am going to explain this bill a little bit.\n\nHopefully, the Senate is going to work well, because when I tried to  pass this a month ago, Senator Padilla said: Hey, I am going to object,  but if you work with us on some bills that you can move in a pairing,  then we will pass this.\n\nSo I have done that, and I will talk…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696959/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-extension-of-deadlines-in-standards-of-performance-for-new-reconstructed-and-modified-sources-and-emissions-guidelines-for-existing-sources-oil-and-natural-gas-sector-climate"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "…State of North Dakota to  manage its own State lands.\n\nS. 1142 is the Scarper Ridge Golden Gate National Recreation Area  Boundary Adjustment Act. This bill, sponsored by Senator Padilla,  passed last year and would make a minor boundary adjustment to the  Golden Gate National Recreation Area. It is entirely noncontroversial.\n\nS. 1016 is the Vicksburg…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698423/unanimous-consent-requests-the-calendar"}]