[{"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "Senator Tammy Duckworth (D-IL), a Purple Heart recipient and member of the Senate Armed Services Committee (SASC), issued the following statement after Lt."}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "Senator Tammy Duckworth (D-IL) re-introduced the National Institute of Standards and Technology (NIST) Plumbing Research Act to improve the safety, water efficiency and reliability of our plumbing systems."}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "Senator Tammy Duckworth (D-IL), a Purple Heart recipient and one of the first handful of Army women to fly combat missions during Operation Iraqi Freedom, highlighted several key priorities she authored and successfully included in the Fiscal Year (FY) 2021 National Defense Authorization Act (NDAA) that passed the Senate Armed Services Committee (SASC) on a bipartisan vote of 25-2 this week."}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "Senator Tammy Baldwin, a member of the Senate Commerce Committee, the Senate Appropriations Committee and the Senate Health, Education, Labor and Pensions (HELP) Committee, voted in favor of moving the United States Mexico Canada Agreement (USMCA) forward."}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "Senator Tammy Duckworth (D-IL) pressed Doug Benevento, the Nominee to be Deputy Administrator of the U.S."}, {"senator": "Richard J. Durbin", "party": "Democrat", "sentence": "Last year, Durbin, along with Senator Tammy Duckworth (D-IL) and U.S."}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "Senator Tammy Duckworth (D-IL) released the following statement today after the Senate passed a nearly $500 billion package to provide funding for small businesses, hospitals and health care workers:\n\n \n\n\"After a week of stonewalling, I'm glad Republicans finally came to their senses and joined Democrats to support emergency funding for our hospitals and health care workers on the frontlines of the COVID-19 pandemic in addition to struggling small businesses."}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "Senator Tammy Baldwin, a member of the Senate Health, Education, Labor, and Pensions (HELP) Committee, joined her colleagues to introduce the Child Care is Essential Act to address the child care crisis exacerbated by coronavirus through creating a $50 billion Child Care Stabilization Fund."}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "Senator Tammy Duckworth (D-IL) today released the following statement after the U.S."}, {"senator": "Tammy Duckworth", "party": "Democrat", "sentence": "Senator Tammy Duckworth (D-IL) that would provide financial relief for small businesses across the country was included in the bipartisan COVID-19 relief compromise that passed out of the Senate earlier this week."}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "1938, the Police Training and Independent Review Act, legislation introduced by Senator Tammy Duckworth (D-IL) to improve police training and encourage independent, impartial investigations into law enforcement officials' use of deadly force."}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "Senator Tammy Baldwin joined her bipartisan colleagues led by Senator Jeanne Shaheen (D-NH) to introduce legislation to protect children from the dangers of e-cigarettes."}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "Senator Jeff Merkley and Senator Tammy Baldwin (D-WI) have introduced new legislation to expedite the procurement of medical equipment, under the Defense Production Act (DPA), to combat the spread of coronavirus and keep health care workers on the frontlines of the pandemic safe."}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "Senator Tammy Baldwin helped introduce a legislative fix that would make dependents 17 and older count toward what a family gets in direct payments from the bipartisan coronavirus relief package signed into law last week."}, {"senator": "Richard J. Durbin", "party": "Democrat", "sentence": "Senator Tammy Duckworth (D-IL) sent a letter to ArcelorMittal urging it to take financial responsibility for the facility's Clean Water Act violations and permit's reporting and notification requirements, ensure that proper testing procedures and operating protocols are followed, and work closely with both Indiana Department of Environmental Management (IDEM) and U.S."}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "Senator Tammy Duckworth (D-IL), Senator Dick Durbin (D-IL), Senator Chuck Grassley (R-IA), Congressman David McKinley (WV-1), and Congresswoman Cheri Bustos (IL-17), announced today that the Federal Bureau of Prisons (BOP), in coordination with the United States Marshall Service (USMS), will now test all inmates for COVID-19 prior to transferring them to BOP quarantine sites."}, {"senator": "Joni Ernst", "party": "Republican", "sentence": "Senator Joni Ernst (R-IA), a retired lieutenant colonel in the Iowa Army National Guard, along with her fellow female combat veteran, Senator Tammy Duckworth (D-IL), are announcing successful passage of their bipartisan legislation to award the U.S."}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "Senator Tammy Baldwin (D-IL) authored a letter calling for increased patient access to affordable drugs at compounding pharmacies."}, {"senator": "Susan M. Collins", "party": "Republican", "sentence": "Senator Tammy Duckworth (D-IL), U.S."}, {"senator": "Cory Gardner", "party": "Republican", "sentence": "Senator Tammy Baldwin, a member of the Senate Commerce, Science, and Transportation Committee, helped introduce the bipartisan Industries of the Future Act of 2020."}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "Senator Tammy Duckworth joined Senators Amy Klobuchar (D-MN), Mike Rounds (R-SD) and Dan Sullivan (R-AK) in introducing legislation to ensure that servicemembers and veterans with previous exposure to burn pits receive the care they need during the COVID-19 pandemic."}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "Sullivan introduced the bill with Senator Tammy Baldwin (D-Wis.)."}, {"senator": "Lamar Alexander", "party": "Republican", "sentence": "Senator Tammy Baldwin, a member of the Senate Committee on Health, Education, Labor and Pensions (HELP), helped introduce the Commission on America's Medical Security Act, bipartisan legislation led by Senators Dick Durbin (D-IL) and Lamar Alexander (R-TN) to safeguard America's medical supply chain and address shortages due to the United States' dependence on foreign-made medical equipment."}]