[{"senator": "Edward J. Markey", "party": "Democrat", "sentence": "United States Senators Elizabeth Warren (D-MA) and Edward J."}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "United States Senators Elizabeth Warren (D-Mass.), Tammy Duckworth (D-Ill.), and Mazie K."}, {"senator": "Edward J. Markey", "party": "Democrat", "sentence": "United States Senators Elizabeth Warren (D-Mass.) and Edward J."}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "United States Senators Elizabeth Warren (D-Mass.), Edward J."}, {"senator": "Edward J. Markey", "party": "Democrat", "sentence": "United States Senators Elizabeth Warren (D-MA) and Edward J."}, {"senator": "Christopher Murphy", "party": "Democrat", "sentence": "Senators Elizabeth Warren (D-MA), Kevin Cramer (R-ND), Chris Murphy (D-CT), and Tim Kaine (D-VA) joined Rubio in introducing the bill in the Senate, and U.S."}, {"senator": "Edward J. Markey", "party": "Democrat", "sentence": "United States Senators Elizabeth Warren (D-MA) and Edward J."}, {"senator": "Edward J. Markey", "party": "Democrat", "sentence": "Senators Elizabeth Warren (D-MA) and Edward J."}, {"senator": "Cory A. Booker", "party": "Democrat", "sentence": "Booker, along with Senators Elizabeth Warren (D-MA) and Kamala Harris (D-CA), and Congresswoman Ayanna Pressley (D-MA) had been pushing for such detailed information, writing a letter to the Health and Human Services Department late last month and introducing a bill earlier this week to require such data collection."}, {"senator": "Edward J. Markey", "party": "Democrat", "sentence": "Massachusetts Senators Elizabeth Warren and Edward J."}, {"senator": "Christopher A. Coons", "party": "Democrat", "sentence": "Today United States Senators Elizabeth Warren (D-Mass.), Richard Blumenthal (D-Conn.), Chris Coons (D-Del.), Co-chair of the Congressional Progressive Caucus Representative Pramila Jayapal (D-WA), and the Chair of the House Democracy Reform Task Force Representative John Sarbanes (D-MD) introduced a discussion draft of their legislation to ensure stronger oversight, accountability, and transparency in the federal government's response to COVID-19 crisis."}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "Senators Elizabeth Warren (D-MA) and Tina Smith (D-MN), and Congressman Andy Levin (D-MI-9), introduced new legislation that would create a federal contact tracing program to halt the spread of the coronavirus disease, and are calling for the bill to be included in the next pandemic response package."}, {"senator": "Chris Van Hollen", "party": "Democrat", "sentence": "United States Senators Elizabeth Warren (D-Mass.), a member of the Senate Health, Education, Labor, and Pensions (HELP) and Senate Aging Committees, and Bob Casey (D-Pa.), a member of the HELP Committee and Ranking Member of the Aging Committee, along with Senators Maggie Hassan (D-N.H.), Kirsten Gillibrand (D-N.Y.), Chris Van Hollen (D-Md.), Chris Murphy (D-Conn.), Sherrod Brown (D-Ohio), and Tim Kaine (D-Va.), sent a letter to U.S."}, {"senator": "Tina Smith", "party": "Democrat", "sentence": "It's time to lift up workers and their families, and put a stop to unfair \"right-to-work' laws once and for all.\"\n\nThe Nationwide Right to Unionize Act is also supported by Senators Elizabeth Warren (D-Mass.), Sherrod Brown (D-Ohio), Kirsten Gillibrand (D-N.Y.), Tammy Baldwin (D-Wis.), Jeff Merkley (D-Ore.), Edward J."}]