[{"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "United States Senator Elizabeth Warren (D-Mass.) today joined Senator Steve Daines (R-Mont.), along with Senators Jon Tester (D-Mont.), John Hoeven (R-N.D.), Kevin Cramer (R-N.D.), Ron Wyden (D-Ore.), James Lankford (R-Okla.), Tom Udall (D-N.M.), Mike Crapo (R-Idaho), Martha McSally (R-Ariz.), Lisa Murkowski (R-Alaska), and James Risch (R-Idaho), in reintroducing a Senate resolution marking May 5, 2020 as the National Day of Awareness for Missing and Murdered Native Women and Girls."}, {"senator": "Michael F. Bennet", "party": "Democrat", "sentence": "Senator Steve Daines (R-Mont.) in 2017 to increase funding for the program."}, {"senator": "Tom Udall", "party": "Democrat", "sentence": "Udall joined Senator Steve Daines (R-Mont.), along with Senators Jon Tester (D-Mont.), Elizabeth Warren (D-Mass.), John Hoeven (R-N.D.), Kevin Cramer (R-N.D.), Ron Wyden (D-Ore.), James Lankford (R-Okla.), Mike Crapo (R-Idaho), Martha McSally (R-Ariz.), Lisa Murkowski (R-Alaska), and James Risch (R-Idaho)."}, {"senator": "Steve Daines", "party": "Republican", "sentence": "Senator Steve Daines today celebrated President Trump signing the United States-Mexico-Canada Agreement (USMCA), a trade deal between the three countries."}, {"senator": "Steve Daines", "party": "Republican", "sentence": "Senator Steve Daines today announced he successfully had the Paycheck Protection Program (PPP) guidelines expanded to offer fair relief for Montana seasonal businesses and workers."}, {"senator": "John Hoeven", "party": "Republican", "sentence": "Senator Steve Daines today announced that he was able to successfully secure stronger provisions and critical funding for tribal communities in the Coronavirus Economic Recovery Package."}, {"senator": "Steve Daines", "party": "Republican", "sentence": "Senator Steve Daines today announced that the U.S."}, {"senator": "Steve Daines", "party": "Republican", "sentence": "Senator Steve Daines stressed the need to end the nation's reliance on China and other nations and bring critical life-saving drugs and medical supply equipment jobs back to the U.S."}, {"senator": "Steve Daines", "party": "Republican", "sentence": "Senator Steve Daines today introduced bipartisan legislation that would guarantee benefits for families of any first responder who tragically dies from COVID-19 in the line of duty."}, {"senator": "Steve Daines", "party": "Republican", "sentence": "Senator Steve Daines today introduced a bipartisan bill, the Great American Outdoors Act, which will provide full, mandatory funding of the Land and Water Conservation Fund (LWCF) and address the maintenance backlog in our national parks and forests."}, {"senator": "Steve Daines", "party": "Republican", "sentence": "Senator Steve Daines today issued the following statement following President Trump's announcement on new guidelines to implement the $19 billion Coronavirus Food Assistance Program (CFAP) for farmers and ranchers impacted by the ongoing coronavirus pandemic."}, {"senator": "Steve Daines", "party": "Republican", "sentence": "Senator Steve Daines today announced the U.S."}, {"senator": "Steve Daines", "party": "Republican", "sentence": "Senator Steve Daines today announced that the U.S."}, {"senator": "Steve Daines", "party": "Republican", "sentence": "Senator Steve Daines today announced that USDA will be providing $19 billion in assistance for farmers and ranchers hurting from challenging market conditions due to the Coronavirus pandemic through the Coronavirus Food Assistance Program (CFAP)."}, {"senator": "Steve Daines", "party": "Republican", "sentence": "Senator Steve Daines today announced $2.5 million will be directed to the University of Montana to begin COVID-19 vaccine development."}, {"senator": "Cindy Hyde-Smith", "party": "Republican", "sentence": "\"This legislation would authorize the President to take appropriate actions against the Chinese government to ensure similar outbreaks do not happen in the future.\"\n\n \n\n\"This legislation is about taking necessary actions against China to hold them accountable for the cover up of the COVID-19 outbreak and to prevent the spread of future pandemics,\" said Senator Steve Daines."}, {"senator": "Steve Daines", "party": "Republican", "sentence": "Senator Steve Daines today announced that Montana will be receiving $49,914,794 to develop, purchase, administer, process, and analyze COVID-19 tests, scale-up laboratory capacity, trace contacts, and support employer testing."}, {"senator": "Steve Daines", "party": "Republican", "sentence": "Senator Steve Daines today announced that $5,524,715 will be directed to Montana to fund programs that provide home-delivered meals, care services in the home, respite care and other support services to help meet the needs of older Montanans and individuals with disabilities during the COVID-19 emergency."}]