[{"senator": "Alex Padilla", "party": "Democrat", "sentence": "…with this and establish this precedent.\n\nSo let's take a step back. Republicans are admitting that they don't  have the votes to pass these California resolutions under the Senate  rules that the Parliamentarian says apply in this case, so they will  overrule the Parliamentarian--why not throw out the rulebook  altogether?\n\nBy voting to go nuclear on the…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691542/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Ed Markey", "party": "Democrat", "sentence": "…Republicans to promote chaos and conflict in our  economy for the sake of billionaires. They now want to create chaos and  conflict as well.\n\nBy intentionally modifying the Senate rules that protect this  institution at a moment when Donald Trump is actively undermining the  checks and balances enshrined in our Constitution, that is a serious  threat, not…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691549/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-national-highway-traffic-safety-administration-relating-to-federal-motor-vehicle-safety-standards-fuel-system-integrity-of-hydrogen-vehicles-compressed-hydrogen-storage-system-integrity-incorporation-by-reference"}, {"senator": "Adam Schiff", "party": "Democrat", "sentence": "…cancer.\n\nThat will be the pay-for because this is about power, and it is about  profit, and it is about punishing States that dare to lead. It is about  undermining the Senate's own rules to score a short-term win that will  do long-term damage but will placate the oil industry, because once you  start twisting the CRA into a weapon to attack anything…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691621/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "Sheldon Whitehouse", "party": "Democrat", "sentence": "…got a lot of  money. He got north of a 100 million, and now, sure enough, he has  given them everything he wants.\n\nAnd this is one of the payments--this breaking of the Senate rules,  this overruling of the Parliamentarian, this going nuclear, this  pretending that something that was never a rule, and is clearly not a  rule by any reasonable reading…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691581/hj-res-88"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…to stop  the endless partisan gridlock that prevents so much more progress that  the American people deserve.\n\nI have voted to make that rule change and codify it in the Senate  rules; but in 2022, when we did so, Republicans opposed it, and they  defended the filibuster and the 60-vote threshold as sacred.\n\nToday, as the ranking member of the Senate…", "date": "2025-05-20", "source_url": "https://justfacts.votesmart.org/public-statement/1691454/guiding-and-establishing-national-innovation-for-us-stablecoins-act"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…Inaugural Ceremonies--JCCIC--hosted the  inauguration of President Donald Trump.\n\nThis year, I chaired the joint committee with Senator Fischer, my  counterpart on the Senate Committee on Rules and Administration. I  thank her and the rest of the committee members--Leader Schumer,  Speaker Johnson, Leader Scalise, and Leader Jeffries--for their  partnership.…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691709/recognizing-the-joint-congressional-committee-on-the-inauguration"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…overseeing funding for this space.\n\nI rise today, with my colleagues, out of grave concern for the future  of our democracy.\n\nI currently serve as the ranking member of the Senate Rules and  Administration Committee. I also, as many of you know, am the former  secretary of state for the State of California. So I have seen  firsthand, not just through the…", "date": "2025-04-30", "source_url": "https://justfacts.votesmart.org/public-statement/1690535/terminating-the-national-emergency-declared-to-impose-global-tariffs"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…government. Trump's efforts to tilt the playing field to his       advantage have been more worrying. In May 2017, he called for       changes in what he called ``archaic'' Senate rules, including       the elimination of the filibuster, which would have       strengthened the Republican majority at the expense of the       Democratic minority. Senate Republicans…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696337/trump-administration"}, {"senator": "Tom Cole", "party": "Republican", "sentence": "…Government of the United States,  which you willfully tried to shut down. Fortunately, you did not  succeed in that in this Chamber, but some of your colleagues, using  arcane Senate rules, did manage to do it but finally came to their  senses. You ought to pay attention to those people. They said enough is  enough. Let's reopen the government.\n\nI urge my…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696725/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Susan Collins", "party": "Republican", "sentence": "…Committee who is floor manager of an       appropriations bill is hereby authorized to make points of       order against any amendment offered in violation of the       Senate Rules on the floor of the Senate to such       appropriations bill.                          IX. Ex Officio Membership\n\nThe Chairman and Ranking Minority Member of the full…", "date": "2025-02-27", "source_url": "https://justfacts.votesmart.org/public-statement/1688276/us-senate-committee-on-appropriations-rules-of-procedure"}, {"senator": "Chip Roy", "party": "Republican", "sentence": "…it can do, which is force those who are saying that  they are going to filibuster to actually take the floor of the Senate  and filibuster.\n\nSee, people don't understand Senate rules. They think that the ``Mr.  Smith Goes to Washington'' version of the filibuster is the filibuster.  But the truth is that Senators have, for a long time, hidden behind…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699673/united-states-fiscal-situation"}, {"senator": "Stephanie Bice", "party": "Republican", "sentence": "…this time.\n\nThe capsule will remain sealed until July 4th, 2276, and the burial  site will be marked by a plaque approved by the Committee on House  Administration and the Senate Rules and Administration Committee.\n\nI thank the ranking member, Mr. Morelle, for working with me on this  effort.\n\nMadam Speaker, I urge my colleagues to support the bill, and…", "date": "2026-02-09", "source_url": "https://justfacts.votesmart.org/public-statement/1699840/semiquincentennial-congressional-time-capsule-act"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…have made progress, and more progress is coming. Most  States have age limits.\n\nTo add insult to injury, we are given this legislation in an  appropriations bill. We have Senate rules against this.\n\nSo I would recommend that we vote for this amendment, and my  amendment would strip out the language.\n\nI would transfer the remainder of my time to Senator…", "date": "2025-11-10", "source_url": "https://justfacts.votesmart.org/public-statement/1696661/continuing-appropriations-and-extensions-act-2026"}, {"senator": "James Risch", "party": "Republican", "sentence": "…given to each member at least 72       hours prior to the meeting at which action thereon is to be       taken. However, rules of the committee which are based upon       Senate rules may not be superseded by committee vote alone.", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691700/us-senate-committee-on-foreign-relations-rules-of-procedure"}, {"senator": "James Lankford", "party": "Republican", "sentence": "…Reported       below is the information describing the Committee's       activities in 2025 in the categories set forth in the Act:\n\n(1) The number of alleged violations of Senate rules       received from any source, including the number raised by a       Senator or       staff of the Committee--181. (In addition, 5 alleged       violations from previous…", "date": "2026-01-29", "source_url": "https://justfacts.votesmart.org/public-statement/1699425/us-senate-select-committee-on-ethics-annual-report"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…determination whether such       testimony, papers, and other materials shall be presented in       open or executive session shall be made pursuant to the Rules       of the Senate and Rules of the Committee.\n\n11.3. The Staff Director shall ensure that covert action       programs of the U.S. Government receive appropriate       consideration by the Committee…", "date": "2025-02-26", "source_url": "https://justfacts.votesmart.org/public-statement/1688225/us-senate-select-committee-on-intelligence-rules-of-procedure"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…it, whether you want  us to or not. So I hope they can sue.\n\nAs to me, I am a Senator. If this provision--the private cause of  action--is seen out of line with what the Senate rules now, I will  gladly fix that. But you are off base if you think I am doing this for  $1 million. I am going to sue for much more than that, not just to try  to make my life…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699105/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Shelley Capito", "party": "Republican", "sentence": "…from exercising its authority provided by the CRA,  keeping the California EV mandate in place without a vote in this  Chamber.\n\nNothing in the Congressional Review Act, Senate rules, or Senate  precedents gives unelected staff at the GAO the authority to prevent  elected Senators from considering a resolution of disapproval against a  rule. In fact,…", "date": "2025-05-21", "source_url": "https://justfacts.votesmart.org/public-statement/1691584/hj-res-88"}, {"senator": "John Thune", "party": "Republican", "sentence": "Mr. THUNE. Mr. President, as expected, there has been some commentary  on the process I initiated Monday--a process to restore Senate  precedent and codify in Senate rules what was once understood to be  standard practice, and that is the Senate's acting expeditiously on  Presidential nominees to allow a President to get his team in place.…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695295/rules-change"}, {"senator": "Rand Paul", "party": "Republican", "sentence": "…unanimously object, unless the Committee on       Homeland Security and Governmental Affairs (the       ``Committee'') approves of such public hearing by a majority       vote.\n\nSenate Rules will govern all closed sessions convened by       the Subcommittee (Rule XXVI, Sec. 5(b), Standing Rules of the       Senate).\n\n2. Subpoenas for witnesses, as well as documents…", "date": "2025-02-24", "source_url": "https://justfacts.votesmart.org/public-statement/1687952/us-senate-permanent-subcommittee-on-investigations-rules-of-procedure"}]