[{"senator": "Elizabeth Warren", "party": "Democrat", "sentence": "Senator Joni Ernst's (R-IA) bipartisan bill to ensure body armor and personal protective equipment (PPE) is adequate, properly-fitted, and readily available for female servicemembers."}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "Senator Joni Ernst (R-IA) met with Iowa Governor Kim Reynolds, Lieutenant Governor Adam Gregg, and other state officials, as well as spoke with a number of Iowa grocers from Hy-Vee, Fareway, Casey's, Kum & Go, Walmart, Target, Kwik Star, CVS, Walgreens, and independent grocers, at the State Emergency Operations Center (SEOC) in Camp Dodge this morning."}, {"senator": "Gary C. Peters", "party": "Democrat", "sentence": "Senator Joni Ernst (R-IA) to rein in excessive spending on unwarranted bonuses to contractors that fail to meet certain standards on federal projects."}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "In 2016, Klobuchar's bipartisan legislation with Senator Joni Ernst (R-IA) to establish a patient self-scheduling appointment system at VA Medical Facilities was signed into law."}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "In the great State  of Iowa, Senator Joni Ernst showed up at a townhall meeting in Iowa."}, {"senator": "Joni Ernst", "party": "Republican", "sentence": "Senator Joni Ernst (R-IA) joined Senator Ted Cruz (R-TX) and 41 Senate colleagues in supporting a resolution honoring the members of the military and intelligence community who carried out the successful mission that killed Qasem Soleimani, a designated terrorist and head of the Iranian Revolutionary Guard Corps-Quds Force (IRGC-QF)."}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "Senator Joni Ernst (R-IA), known as the Senate's leading foe of wasteful government spending, is continuing her efforts to make Washington squeal."}, {"senator": "Joni Ernst", "party": "Republican", "sentence": "Senator Joni Ernst (R-IA) is calling for the Small Business Administration (SBA) to ensure Iowa's farmers, producers, ranchers, and growers have access to the relief they need during COVID-19."}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "Senator Joni Ernst (R-IA) today encouraged her colleagues in Congress, as well as officials at the state and local levels, to continue working together to protect Iowans and all Americans from the coronavirus (COVID-19)."}, {"senator": "Joni Ernst", "party": "Republican", "sentence": "Senator Joni Ernst (R-IA), a survivor of domestic violence and sexual assault, is calling on the federal government to ensure that survivors of domestic violence who are estranged or living separately from their married abuser have access to the direct payments Congress approved in the Phase 3 relief package."}, {"senator": "Joni Ernst", "party": "Republican", "sentence": "Senator Joni Ernst (R-IA), chairman of the Senate Armed Services Subcommittee on Emerging Threats and Capabilities, joined both Varney & Co."}, {"senator": "Joni Ernst", "party": "Republican", "sentence": "Senator Joni Ernst (R-IA), a relentless advocate for Iowa's biofuel community and member of the Senate Environment and Public Works Committee (EPW), is joining her fellow Iowan Senator Chuck Grassley (R-IA) and Senator Amy Klobuchar (D-MN) on bipartisan legislation to support biofuel producers negatively affected by the pandemic."}, {"senator": "Joni Ernst", "party": "Republican", "sentence": "Senator Joni Ernst (R-IA), the first female elected to federal office from the state of Iowa and the first female combat veteran elected to the Senate, today highlighted two trailblazing women--Susan B."}, {"senator": "Joni Ernst", "party": "Republican", "sentence": "Senator Joni Ernst (R-IA) met with the Assistant Secretary of the Army, R.D."}, {"senator": "Joni Ernst", "party": "Republican", "sentence": "Senator Joni Ernst (R-IA), and her SASC colleague, Senator Rick Scott (R-FL), are working to reform and improve foreign military student training programs following the terrorist attack at Naval Air Station Pensacola on December 6th, 2019."}, {"senator": "Joni Ernst", "party": "Republican", "sentence": "Senator Joni Ernst (R-IA), a retired lieutenant colonel in the Iowa Army National Guard, along with her fellow female combat veteran, Senator Tammy Duckworth (D-IL), are announcing successful passage of their bipartisan legislation to award the U.S."}, {"senator": "Joni Ernst", "party": "Republican", "sentence": "Senator Joni Ernst (R-IA) held another telephone town hall with thousands of Iowa seniors, answering questions on a range of topics related to the COVID-19 pandemic and providing information and resources for seniors to utilize and to protect against scammers and fraud."}, {"senator": "Joni Ernst", "party": "Republican", "sentence": "Senator Joni Ernst (R-IA) is calling for support for Iowa's newspapers, television and radio stations."}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "Another provision, which I co-sponsored with my fellow Iowan, Senator Joni Ernst, increases access to safe disposal locations of unused medications."}, {"senator": "Joni Ernst", "party": "Republican", "sentence": "Senator Joni Ernst (R-IA), a relentless advocate for Iowa's biofuels industry, is commending the U.S."}]