[{"senator": "Michael F. Bennet", "party": "Democrat", "sentence": "Senators Amy Klobuchar (D-Minn.), Kirsten Gillibrand (D-N.Y.), Chris Van Hollen (D-Va.), Dianne Feinstein (D-Calif.), Bob Casey (D-Pa.), and Bernie Sanders (I-Vt.)."}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "Senators Amy Klobuchar, D-Minn., Tammy Duckworth, D-Ill., Maria Cantwell, D-Wash., Ed Markey, D-Mass., and Jeanne Shaheen, D-N.H."}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "Senators Amy Klobuchar (D-MN) and Mike Rounds (R-SD) introduced legislation to ensure that servicemembers and veterans with previous exposure to burn pits receive the care they need during the coronavirus (COVID-19) pandemic."}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "Senators Amy Klobuchar (D-MN) and Tina Smith (D-MN) joined a bipartisan effort with 14 of their Senate colleagues urging President Trump to support the Renewable Fuel Standard (RFS) as coronavirus pushes ethanol prices to record lows."}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "\"This bill is critical to supporting state and local employees including first responders with the paid leave they need as they continue to work at the forefront of this health crisis.\"\n\nAlong with Kaine, Durbin, and Smith, the Supporting State and Local Leaders Act is also cosponsored by Senators Amy Klobuchar (D-MN), Michael Bennet (D-CO), Chris Van Hollen (D-MD), and Dianne Feinstein (D-CA)."}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "Senators Amy Klobuchar and Tina Smith announced that $3 million of the additional funding for the nation's rural water projects--approved by Congress in December--will go the Lewis and Clark Regional Water System."}, {"senator": "Tina Smith", "party": "Democrat", "sentence": "Senators Amy Klobuchar and Tina Smith (D-Minn.) are backing legislation to significantly expand national service programs as the country works to respond and recover from the coronavirus (COVID-19) pandemic."}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "Senators Amy Klobuchar and Tina Smith announced that veterans in Minnesota and across the country who receive benefits through the Department of Veterans Affairs (VA) will automatically receive direct coronavirus relief payments without having to file tax returns."}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "Senators Amy Klobuchar and Tina Smith announced seven separate NeighborWorks grants totaling $3,087,500 for community organizations throughout Minnesota."}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "Senators Amy Klobuchar and Tina Smith along with Representative Jim Hagedorn (MN-1) announced that the Department of Transportation (DOT) has awarded the Minnesota Department of Transportation (MnDOT) $1,000,000 in grant funding to improve infrastructure in Winona."}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "Senators Amy Klobuchar (D-MN) and Tina Smith (D-MN) are reminding Minnesota landowners interested in the Conservation Reserve Program (CRP) to enroll before the February 28 general signup deadline."}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "Senators Amy Klobuchar (D-MN) and Chuck Grassley (R-IA) introduced a resolution designating January 2020 as National Stalking Awareness Month to raise awareness on the dangers of stalking and educate Americans about how to prevent this serious offense."}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "Senators Amy Klobuchar (D-MN) and Lisa Murkowski (R-AK) introduced legislation to combat the rise of hate crimes."}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "Senator Tammy Duckworth joined Senators Amy Klobuchar (D-MN), Mike Rounds (R-SD) and Dan Sullivan (R-AK) in introducing legislation to ensure that servicemembers and veterans with previous exposure to burn pits receive the care they need during the COVID-19 pandemic."}, {"senator": "Bill Cassidy", "party": "Republican", "sentence": "Senators Amy Klobuchar (D-MN) and Bill Cassidy, M.D."}]