[{"senator": "Cory A. Booker", "party": "Democrat", "sentence": "\"The fighting men and women of our nation's greatest generation deserve the utmost respect and care for their service in World War II,\" said Senator Daines."}, {"senator": "Jon Tester", "party": "Democrat", "sentence": "\"I appreciate President Trump acting to ensure our state, particularly the Montana National Guard, has resources it needs to combat the COVID-19 outbreak.\"\n\n\"I'm glad we were able to get the federal support necessary for the Montana National Guard to help our communities, first responders, and care providers on the front lines of the Coronavirus pandemic,\" Senator Daines said."}, {"senator": "Steve Daines", "party": "Republican", "sentence": "Last night, Senator Daines led a colloquy with Senate Pro-Life Caucus members Senators Ernst, Sasse, and Braun ahead of the votes today."}, {"senator": "Steve Daines", "party": "Republican", "sentence": "On March 24th, 2020, Senator Daines took to the floor of the United States Senate with Senator Lindsey Graham to urge an immediate Senate vote to pass the Coronavirus Economic Recovery Package that would provide relief for Montana workers, families, small businesses and healthcare professionals."}, {"senator": "Steve Daines", "party": "Republican", "sentence": "On March 24th, 2020, Senator Daines took to the floor of the United States Senate with Senator Lindsey Graham to urge an immediate Senate vote to pass the Coronavirus Economic Recovery Package that would provide relief for Montana workers, families, small businesses and healthcare professionals."}, {"senator": "Steve Daines", "party": "Republican", "sentence": "On March 24th, 2020, Senator Daines took to the floor of the United States Senate with Senator Lindsey Graham to urge an immediate Senate vote to pass the Coronavirus Economic Recovery Package that would provide relief for Montana workers, families, small businesses and healthcare professionals."}, {"senator": "Steve Daines", "party": "Republican", "sentence": "RMEF       strongly urges Members of the Senate and House to rally       alongside Senator Daines, pass this measure, and forward it       to President Trump's desk so it can be signed into law."}, {"senator": "Steve Daines", "party": "Republican", "sentence": "Stakeholder Quotes:\n\n\"We sincerely appreciate all the work that Senator Daines did to secure much needed relief for Montana's farmers and ranchers in the CARES Act, and other means."}, {"senator": "Lamar Alexander", "party": "Republican", "sentence": "Everybody here knows that it has been since 1964 that people have  tried to pass the Land and Water Conservation Fund funding, even though  the idea--money from environmental burden, that is drilling offshore-- for an environmental benefit--that is to let States and the Federal  Government buy land that is treasured, as Senator Daines from Montana  says, 80 percent of the access good fishing in Montana comes with Land  and Water Conservation Fund money."}, {"senator": "Mitch McConnell", "party": "Republican", "sentence": "I also want to thank Senator Daines, Senator Tillis, and Senator  Gardner for their hard work on these modifications."}, {"senator": "Cory Gardner", "party": "Republican", "sentence": "I thank the President for his support, and I encourage all my colleagues in Congress to support full and permanent funding of the LWCF so future generations will have access to our great outdoors.\"\n\n\"The Land and Water Conservation Fund is a critical conservation program that protects public access to public lands and our Montana way of life,\"said Senator Daines."}, {"senator": "Steve Daines", "party": "Republican", "sentence": "Senator Daines' legislation ensures such outrageous actions will no longer be tolerated under the law."}, {"senator": "John Cornyn", "party": "Republican", "sentence": "Our friend from Montana, Senator Daines, established the first-ever  Senate Pro-Life Caucus to fight for the lives of our most vulnerable  citizens."}, {"senator": "Cindy Hyde-Smith", "party": "Republican", "sentence": "\"If we are going to be pro-life, we should be pro-all-of-life and ensure we give moms the support they need.\"\n\n\"Fatherhood is an important responsibility,\" said Senator Daines."}, {"senator": "David Perdue", "party": "Republican", "sentence": "It is the Senate's duty to take up these articles without delay, and to resolve them in a timely and constitutionally appropriate manner.\"\n\nSenator Daines said, \"It's time to put up or shut up, and stand up to Nancy Pelosi."}, {"senator": "Steve Daines", "party": "Republican", "sentence": "On March 24th, 2020, Senator Daines took to the floor of the United States Senate with Senator Lindsey Graham to urge an immediate Senate vote to pass the Coronavirus Economic Recovery Package that would provide relief for Montana workers, families, small businesses and healthcare professionals."}, {"senator": "Steve Daines", "party": "Republican", "sentence": "MOGA is grateful to Senator Daines for recognizing that if harnessed, Outfitters can clear hundreds of miles of trails, improving public access, and bolster our piece of Montana's robust tourism industry during these difficult times.\"- Mac Minard, Executive Director, Montana Outfitters and Guides Association."}]