[{"senator": "Jacky Rosen", "party": "Democrat", "sentence": "Senator Kevin Cramer (R-ND) issued the following statement after the Senate by voice vote passed the Never Again Education Act, bipartisan legislation he introduced:\n\n\"Anti-Semitism is a serious threat in the United States and around the world."}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "A number of Senators, including  Senator Kaine and Senator Shaheen and Senator Welch and Senator Kevin  Cramer of North Dakota, a Republican--we went up there together to  Ottawa a few months back, met with Prime Minister Carney."}, {"senator": "Charles E. Schumer", "party": "Democrat", "sentence": "We look forward to a meeting with you and working together to ensure their names are added and their sacrifice is rightfully commemorated.\" \n\nSenator Shaheen cosponsored bipartisan legislation led by Senator Kevin Cramer (R-ND) to require the Department of Defense to add the names of the \"Lost 74\" to the Vietnam War Memorial and called on Senate and House Armed Services Committee leaders to include the bill in the National Defense Authorization Act for the current fiscal year."}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "In her questioning, Klobuchar highlighted how students rely on the internet to learn from home and outlined how legislation she introduced with Senator Kevin Cramer (R-ND), the Keeping Critical Connections Act, would establish a temporary fund at the Federal Communications Commission to help small broadband providers continue to provide internet services for students and low-income families during the pandemic."}, {"senator": "Cory A. Booker", "party": "Democrat", "sentence": "Senator Kevin Cramer (R-ND), a member of the Armed Services and Veterans Affairs committees, with Bob Menendez (D-NJ) introduced the WWII Veterans Hospital and Medical Eligibility Act."}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "Senator Kevin Cramer (R-ND) with his colleagues introduced the Health Care Broadband Expansion During COVID-19 Act this week."}, {"senator": "Jacky Rosen", "party": "Democrat", "sentence": "Senator Rosen's dedication to workforce development is further demonstrated by the introduction of:\n\nThe Cyber Ready Workforce Act, bipartisan legislation she introduced last year alongside Senator Kevin Cramer (R-ND)."}, {"senator": "Charles E. Schumer", "party": "Democrat", "sentence": "Senator Kevin Cramer (R-ND) requested unanimous consent on the Senate floor today to pass the USS Frank E."}, {"senator": "Catherine Cortez Masto", "party": "Democrat", "sentence": "Senator Catherine Cortez Masto (D-Nev.) and Senator Kevin Cramer (R.-N.D.) today introduced bipartisan legislation to make pedestrian and bicycle safety projects targeting high school students who walk or bike to school eligible for federal support from the Department of Transportation (DOT)."}, {"senator": "Chris Van Hollen", "party": "Democrat", "sentence": "Senator Kevin Cramer (R-ND), a Senate Banking Committee member, issued the following statement on the Senate -- by unanimous consent -- passing S."}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "Senator Kevin Cramer (R-ND) issued the following statement on the Department of the Interior's Bureau of Reclamation signing an Operation, Maintenance, and Replacement (OM&R) with the Dickey Sargent Irrigation District (DSID) for the Oakes Test Area (OTA):\n\n\"This signing is another good step toward transferring the Oakes Test Area."}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "Senator Kevin Cramer, Chairman of the Senate Environment and Public Works Subcommittee on Fisheries, Water, and Wildlife, issued the following statement on the U.S."}, {"senator": "John Hoeven", "party": "Republican", "sentence": "Senator Kevin Cramer (R-ND) with U.S."}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "Senator Kevin Cramer (R-ND) spoke with members of North Dakota's agricultural community today about the assistance for agriculture found in the Phase Three Coronavirus (COVID--19) relief package and about ongoing efforts to assist agriculture during the pandemic."}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "Senator Kevin Cramer (R-ND), a Senate Banking Committee member, issued the following statement on the Export-Import (EXIM) Bank of the United States raising the guarantee coverage option for the Supply Chain Finance Program (SCF) and Working Capital Guarantee Program (WCGP):\n\n\"EXIM raising the guarantee coverage option for these programs will make it easier for our exporters and suppliers to get the capital they need to stay afloat."}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "Senator Kevin Cramer (R-ND) voiced support for the Trump Administration's Notice of Proposed Rulemaking to help businesses utilize carbon capture tax credits at a Senate Budget hearing with Office of Management and Budget (OMB) Director nominee Russ Vought today."}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "Senator Kevin Cramer (R-ND) issued the following statement on the U.S."}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "Senator Kevin Cramer (R-ND) issued the following statement on U.S."}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "Senator Kevin Cramer (R-ND), a Senate Environment and Public Works (EPW) Committee member, issued the following statement on the U.S."}, {"senator": "John Hoeven", "party": "Republican", "sentence": "This follows Hoeven, along with Senator Kevin Cramer, hosting Interior Secretary David Bernhardt in North Dakota to highlight the need for due process and regulatory relief for farmers and ranchers impacted by FWS wetlands easements."}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "Senator Kevin Cramer (R-ND) helped advance the United States-Mexico-Canada (USMCA) trade agreement in the Senate today, voting for its passage from his seats on the Budget Committee and the Environment and Public Works (EPW) Committee."}, {"senator": "John Hoeven", "party": "Republican", "sentence": "Further, Hoeven, along with Senator Kevin Cramer, hosted Bernhardt in the state last year so he could learn about these priorities firsthand."}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "Senator Kevin Cramer (R-ND) issued the following statement on the Paycheck Protection Program running out of funds today:\n\n\"The blame lies at the feet of Democrats who would rather exploit a crisis to advance their extreme partisan agenda than fund a wildly popular program they helped create."}, {"senator": "Kevin Cramer", "party": "Republican", "sentence": "Senator Kevin Cramer (R-ND) secured a commitment from the nominee to be White House Office of Management and Budget (OMB) Director, Russ Vought, to review concerns raised by farmers in North Dakota about bureaucrats in the U.S."}]