[{"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Americans. And USPS continues to support our democracy by helping  Americans send and receive their mail-in ballots for local, State, and  national elections.\n\nOn October 9, the Senate passed S. Res. 337, a resolution recognizing  the 250th anniversary of the Postal Service of the United States and  commending its indispensable role in the success of our Nation.…", "date": "2025-12-03", "source_url": "https://justfacts.votesmart.org/public-statement/1697376/250th-anniversary-of-the-united-states-postal-service"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…makes targeted, responsible administrative fixes to the Marine Debris  Foundation, so the public-private partnerships deliver results faster  and more effectively.\n\nThe Senate passed this bipartisan bill unanimously earlier this year,  and today, Congress can send it to the President's desk.\n\nWe often think of plastic pollution as an overwhelming problem,…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698190/save-our-seas-amendments-act"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…no, come  back to the table, and join us in the work to make healthcare  affordable and accessible for all.\n\nMr. MOORE of North Carolina. Mr. Speaker, as we take up the Senate- passed bill to reopen the government, I want to clarify that we should  be proceeding through regular order before taking any action that could  potentially impact the entire…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696722/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…firm and made clear we would not provide the  votes to increase funding for the administration's illegal terror  campaign.\n\nI am pleased to say that last Friday night, the Senate passed five  remaining bipartisan appropriations bills, and all the bills together  that we have passed fund 96 percent of the Federal Government. Over the  course of the next…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699485/department-of-homeland-security"}, {"senator": "Jim McGovern", "party": "Democrat", "sentence": "…voters no cuts to Medicaid and no new  debt. Now, they are flipping faster than pancakes at a campaign  breakfast. The House passed it hoping the Senate would kill it. The  Senate passed it hoping the House would grow a spine.\n\nEveryone is playing a game of legislative chicken, voting for a bad  bill and thinking the other Chamber will be the one to fix…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693225/providing-for-consideration-of-senate-amendment-to-hr-one-big-beautiful-bill-act"}, {"senator": "Jeanne Shaheen", "party": "Democrat", "sentence": "…much of my time in the Senate  doing what I can to help stop those drugs from entering the United  States and to getting help for those who need it. Just last month, the  Senate passed the HALT Fentanyl Act, which is legislation I  cosponsored, along with a lot of my colleagues, which would permanently  schedule fentanyl-related substances.\n\nImposing…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689483/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Mike Quigley", "party": "Democrat", "sentence": "…Reauthorizing this program now will allow the Great Lakes  Science Center to continue its research and provide datasets that are  stable and reliable into the future.\n\nThe Senate has already passed this reauthorization. I encourage my  colleagues to help get this bill over the finish line.\n\nLastly, I thank my colleagues on the other side of the aisle and in…", "date": "2025-12-15", "source_url": "https://justfacts.votesmart.org/public-statement/1698193/great-lakes-fishery-research-reauthorization-act"}, {"senator": "Gabe Vasquez", "party": "Democrat", "sentence": "…rural communities across New Mexico and across the country that they  are not invisible, not expendable, and not expected to bear the weight  of this lapse alone.\n\nThe Senate has already passed this reauthorization, and I urge my  colleagues to help us finish the job and send the bill to the  President's desk for his signature.\n\nThis is the kind of win that…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697655/secure-rural-schools-reauthorization-act-of-2025"}, {"senator": "Tammy Baldwin", "party": "Democrat", "sentence": "…Democrats in opposing it. It failed, and that was the end of  it.\n\nThen, 3 months later, a combined Defense and Labor-Health and Human  Services bill passed. It passed the Senate; it passed the House; and it  was signed into law by President Trump on September 28--just days short  of the expiration of fiscal year 2018. It wasn't the only pair of  bills.…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693591/rescissions-act-of-2025"}, {"senator": "Suzanne Bonamici", "party": "Democrat", "sentence": "…partisan legislation. I  strongly opposed the original House version of this bill, which passed  by one vote, but the bill that came back from the Senate is even worse.  The Senate bill passed only with arm-twisting and a tie-breaking vote  by the Vice President. And here we are again, in the middle of the  night again, considering a bill that will have devastating…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693169/one-big-beautiful-bill-act"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "Mr. WYDEN. Mr. President, last week, the Senate passed legislation to  fund the Department of Health and Human Services and other Agencies,  including a section reflecting bipartisan, bicameral negotiations on  healthcare policies…", "date": "2026-02-02", "source_url": "https://justfacts.votesmart.org/public-statement/1699474/hospital-at-home-program"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…others on the Democratic side. We produced a measure that had the  support of business and labor and Democrats and Republicans.\n\nWe brought it to the floor of the U.S. Senate and passed it with over  60 votes. It was a glorious day and a great celebration. What was it  all about? It was all about the 11 million undocumented people in the  United States…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696348/trump-administration"}, {"senator": "Maria Cantwell", "party": "Democrat", "sentence": "…more  flying in the dark. And what is most important, it strikes the deadly  language that is in the NDAA bill that just passed here that had  widened that loophole. The Senate passed the NDAA with that provision  in it, but this bill repeals it, and we hope that our House colleagues  will take it up very expeditiously, and I thank the chairman for…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698319/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…renegotiate it and make it a lot  better.\n\nGuess what. He did. He and his team did make it better.\n\nSo when it came to the Senate, my recollection is it came to the  Senate, and it passed by about 89 to 10. We can't get that vote on a  Mother's Day resolution here. Donald Trump should be proud of USMCA.\n\nUSMCA had a provision that, in 2026, we would…", "date": "2025-10-29", "source_url": "https://justfacts.votesmart.org/public-statement/1696447/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Hakeem Jeffries", "party": "Democrat", "sentence": "…House  Republican Conference on June 6. I am really confused by this  combination of this particular letter followed by an interesting  statement that was made after the Senate passed Donald Trump's one big,  ugly bill by Lisa Murkowski.\n\nMaybe somebody, Mr. Speaker, can help me reconcile these statements,  because all of us in the House and Senate were…", "date": "2025-07-02", "source_url": "https://justfacts.votesmart.org/public-statement/1693182/one-big-beautiful-bill-act"}, {"senator": "John Thune", "party": "Republican", "sentence": "…the CRA-- the Congressional Review Act--process and then blocked this misguided  tax in the One Big Beautiful Bill this summer.\n\nOur efforts continue. A few weeks ago, the Senate passed a resolution  blocking the Biden administration's restriction on energy development  in the National Petroleum Reserve in Alaska--an area established  specifically--specifically--for…", "date": "2025-12-02", "source_url": "https://justfacts.votesmart.org/public-statement/1697344/biden-administration"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…relief for the American people. We passed our first draft of the  National Defense Authorization Act in the Senate.\n\nIn addition to these impressive accomplishments, the Senate has also  passed the first tranche of government funding bills and a continuing  resolution to keep the lights on through January. While it may seem odd  to commend Congress for just…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697200/senate-agenda"}, {"senator": "Bryan Steil", "party": "Republican", "sentence": "…critique those eight Democrats in the  United States Senate who were involved in drafting the final  legislation. In fact, my suggestion the whole time was that the Senate  should have passed the clean CR the House sent to them.\n\nIf we look at the record, time after time after time, Democrats in  the United States Senate refused to pass the clean CR, which…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696929/repeal-of-senate-notification-requirements-relating-to-legal-process-on-disclosures-of-senate-data"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…greater economic growth.\n\nYou might ask yourself, what is at the heart of this economic  comeback? Well, let me tell you. The working family tax cuts, which  passed the Senate, passed the House, and were signed into law by the  President--that is at the heart of our economic comeback.\n\nThis is the most pro-worker, pro-family tax relief in years. In…", "date": "2025-11-05", "source_url": "https://justfacts.votesmart.org/public-statement/1696537/government-funding"}, {"senator": "Josh Hawley", "party": "Republican", "sentence": "…is not that 1 or 2 or 10 or 20 Senators  would take a different point of view. That is fine. The real scandal  here is this bill cannot get a vote on the floor of this Senate. It  passed unanimously--not once but twice out of committee--unanimously  out of the Judiciary Committee of the United States.\n\nNow, for years in a row, it can't get so much as…", "date": "2025-12-09", "source_url": "https://justfacts.votesmart.org/public-statement/1697735/9999"}, {"senator": "John Thune", "party": "Republican", "sentence": "…determined by the majority leader, in consultation with the  Democratic Leader, during Thursday's session of the Senate.\n\nMr. THUNE. Mr. President, just over 2 weeks ago, the Senate passed  the HALT Fentanyl Act with bipartisan support. As I said at the time,  this bill joins other efforts to combat the fentanyl crisis that is  taking so many lives in our…", "date": "2025-04-02", "source_url": "https://justfacts.votesmart.org/public-statement/1689477/terminating-the-national-emergency-declared-to-impose-duties-on-articles-imported-from-canada"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…for 5 more years. That is it. This is a  one-sentence bill. It changes the words ``5 years'' to ``10 years.''\n\nGuess what. Last year in December, I came down to the Senate floor,  and I passed this unanimously. It passed. So the Senate passed it last  year. The House has already passed it. If this bill passes tonight, it  is going to go to the President,…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696959/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-extension-of-deadlines-in-standards-of-performance-for-new-reconstructed-and-modified-sources-and-emissions-guidelines-for-existing-sources-oil-and-natural-gas-sector-climate"}, {"senator": "John Thune", "party": "Republican", "sentence": "…eliminating the marine archeology  rule that targeted offshore energy development and the other stopping  the implementation of the Biden tax on natural gas.\n\nLast week, the Senate passed another CRA resolution to block a Biden- era regulation on walk-in freezers and coolers. This rule, part of the  Biden administration's climate agenda, would have heaped…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689698/energy-regulations"}, {"senator": "James Comer, Jr.", "party": "Republican", "sentence": "…difficult despite rising crime in the District.\n\nWhen the D.C. Council passed this law, Congress acted swiftly in a  bipartisan, bicameral fashion to overturn it. The House and Senate  passed H.J. Res. 42, which would have overturned the entire D.C. law,  with 14 House Democrats and 6 Senate Democrats joining Republicans in  support of the resolution.\n\nHowever,…", "date": "2025-06-10", "source_url": "https://justfacts.votesmart.org/public-statement/1692305/protecting-our-nations-capital-emergency-act"}, {"senator": "David Schweikert", "party": "Republican", "sentence": "…leverage and what is going on there.\n\nI don't think we are spending enough time talking about our own work.  Last Friday--actually, it may have been Saturday morning--the Senate  passed their version of a reconciliation budget. It was a completely  unserious document.\n\nI am going to show over and over here how they took a pass on doing  what was difficult.…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689614/its-the-math"}, {"senator": "John Rose", "party": "Republican", "sentence": "…funding bill into law  yesterday that did more than just end a partial government shutdown. It  corrected a serious wrong.\n\nBuried deep inside the funding bill that the Senate passed and sent  to us last November was a hidden provision that never should have seen  the light of day. It was quietly inserted without transparency, without  debate, and without…", "date": "2026-02-04", "source_url": "https://justfacts.votesmart.org/public-statement/1699753/repeal-of-senate-payday-provision"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "Mr. LEE. Mr. President, last year this body, the United States  Senate, passed 41 bills from the Energy and Natural Resources  Committee. And 25 of those bills have been reintroduced. They all have  bipartisan support. They all have been vetted in…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691666/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-pollution-control-standards-heavy-duty-vehicle-and-engine-emission-warranty-and-maintenance-provisions-advanced-clean-trucks-zero-emission-airport-shuttle-zero-emission-power-train-certification-waiver-of-preemption-notice-of-decision"}, {"senator": "Derek Schmidt", "party": "Republican", "sentence": "…history of the United States;\n\nWhereas Congress has played a central role in recognizing       ``Jewish American Heritage Month'' since the House of       Representatives and Senate passed resolutions in 2005 and       2006, respectively, urging the President to proclaim the       national observation of a month recognizing the Jewish-      American community;…", "date": "2025-05-14", "source_url": "https://justfacts.votesmart.org/public-statement/1691192/calling-on-elected-officials-and-civil-society-leaders-to-counter-antisemitism-and-educate-the-public-on-the-contributions-of-the-jewish-american-community"}, {"senator": "French Hill", "party": "Republican", "sentence": "…belief in the cause. In the       end, opposition from last minute concerns related to paper,       oil and gas and air quality issues were all turned away and       the U.S. Senate passed S. 2125 on August 9, 1984. Following       House passage, President Reagan signed the bill into law on       October 19, 1984 (PL 98-508).\n\nI'll conclude with this photo…", "date": "2025-05-13", "source_url": "https://justfacts.votesmart.org/public-statement/1691095/flatside-wilderness-additions-act"}, {"senator": "Kevin Kiley", "party": "Republican", "sentence": "…back  our own legislative priorities but was also making the House irrelevant  in any deal to reopen the government. Of course, that is what ended up  happening. The Senate never passed our CR. They negotiated their own  deal. After 50 days away, the House was brought back for one fly-by  vote to ratify what the Senate had come up with as our only opportunity…", "date": "2025-11-19", "source_url": "https://justfacts.votesmart.org/public-statement/1696926/repeal-of-senate-notification-requirements-relating-to-legal-process-on-disclosures-of-senate-data"}]