[{"senator": "Chris Van Hollen", "party": "Democrat", "sentence": "This is a much-needed step forward -- no one should be above the law and Constitution,\" said Senator Van Hollen."}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "President, I first want to begin by thanking my  colleagues Senator Kaine and Senator Van Hollen--I believe Senator  Schumer will be joining us--for this important issue."}, {"senator": "Brian Schatz", "party": "Democrat", "sentence": "We cannot risk letting American students fall behind,\" said Senator Van Hollen."}, {"senator": "Chris Van Hollen", "party": "Democrat", "sentence": "I will continue to press my colleagues in the Senate to follow suit with urgency,\" said Senator Van Hollen."}, {"senator": "Benjamin L. Cardin", "party": "Democrat", "sentence": "\"Congress must address this issue by providing financial support specifically dedicated to expanding home internet access in the next emergency relief package so that no child falls behind in their education.\"\n\nIn addition to this letter, Senator Van Hollen has previously urged leadership to include dedicated funding for closing the homework gap within the federal coronavirus response."}, {"senator": "Chris Van Hollen", "party": "Democrat", "sentence": "In his letter, Senator Van Hollen writes, \"I urge you to dedicate some of this new grant funding to address the homework gap in districts that need help to meet their plans of delivering digital learning to their students."}, {"senator": "Benjamin L. Cardin", "party": "Democrat", "sentence": "We will continue to offer our assistance in addressing these issues, and we will keep fighting at the federal level for the resources Maryland needs,\" said Senator Van Hollen."}, {"senator": "Mark Warner", "party": "Democrat", "sentence": "I know Senator Van Hollen is going to say a lot of the same things  that I was going to say."}, {"senator": "Benjamin L. Cardin", "party": "Democrat", "sentence": "I urge Congress to take up this legislation without delay,\" said Senator Van Hollen."}, {"senator": "Benjamin L. Cardin", "party": "Democrat", "sentence": "I will keep working to push Congress to fully invest in America's education system and our children's success,\" said Senator Van Hollen."}, {"senator": "Chris Van Hollen", "party": "Democrat", "sentence": "Inaction is complicity,\" said Senator Van Hollen, who has introduced the Handgun Purchaser Licensing Act to address gun violence."}, {"senator": "Chris Van Hollen", "party": "Democrat", "sentence": "While President Trump refuses to address this issue, we must continue to speak out and urge action,\" said Senator Van Hollen."}, {"senator": "Christopher A. Coons", "party": "Democrat", "sentence": "\"I'm pleased that this legislative effort incorporates key aspects of the UNITE Act, which I announced with Senator Van Hollen last week, through its robust commitment to the flagship AmeriCorps programs to aid our most vulnerable communities and its commitment to increase service opportunities for those left unemployed by the coronavirus emergency.\"\n\n\"For decades, our national service organizations have provided invaluable assistance to communities across our country and across the globe."}, {"senator": "Chris Van Hollen", "party": "Democrat", "sentence": "I was proud to first introduce this concept in the UNITE Act with Senator Markey, and I'm pleased we are building on that effort here,\" said Senator Van Hollen."}, {"senator": "Christopher Murphy", "party": "Democrat", "sentence": "And I appreciate Senator Van Hollen, sort of, leading this effort to learn lessons."}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "I'm proud to join Senator Sullivan in introducing this bipartisan legislation to address these concerns, and I urge my colleagues to take it up immediately,\" said Senator Van Hollen."}, {"senator": "Todd Young", "party": "Republican", "sentence": "I urge Congress to take up this legislation without delay,\" said Senator Van Hollen."}, {"senator": "John Barrasso", "party": "Republican", "sentence": "Senator Van  Hollen said it was an illegal ``act of war,'' a complete reversal of  his previous positions."}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "My Democratic colleagues have tried to justify their obstruction by  pointing to the hold by then-Senator Vance last Congress."}, {"senator": "Richard Burr", "party": "Republican", "sentence": "I'm proud to see the Senate unanimously pass this important legislation to give working parents peace of mind and better safeguard our children.\"\n\n\"As we work to make sure childcare is affordable, we must also ensure that it's safe and that parents have peace of mind about who is watching their children,\" said Senator Van Hollen."}]