[{"senator": "Ron Wyden", "party": "Democrat", "sentence": "…those trade policies and actions.  USTR can provide valuable input to the Supply Chain Resilience Working  Group, and the committees with jurisdiction over trade--the Senate  Committee on Finance and House Committee on Ways and Means--can  likewise provide valuable oversight. I look forward to working with my  colleagues who sponsor this bill to bring…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1692998/promoting-resilient-supply-chains-act"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "…part of crafting policies to actually achieve  those goals and implementing those policies and programs. I went on to  serve for 6 years as chair of the California State Senate Committee on  Energy, Utilities and Communications.\n\nSince then, California has continued to lead the Nation with  increasingly ambitious goals for cutting emissions.\n\nIt is a remarkable…", "date": "2025-05-22", "source_url": "https://justfacts.votesmart.org/public-statement/1691620/providing-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-environmental-protection-agency-relating-to-california-state-motor-vehicle-and-engine-and-nonroad-engine-pollution-control-standards-the-omnibus-low-noinfxinf-regulation-waiver-of-preemption-notice-of-decision"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…that they bailed on  the first deal? The answer is probably not.\n\nSo how will we come together and continue what we did a year ago--11  out of 12 bills passing out of the Senate committee in a hugely  bipartisan fashion--if one side comes back and breaks the deal? I would  invite my Republican colleagues: Come to the floor and explain to me  how breaking…", "date": "2025-07-15", "source_url": "https://justfacts.votesmart.org/public-statement/1693589/rescissions-act-of-2025"}, {"senator": "Al Green", "party": "Democrat", "sentence": "…legislature did not pass race-based electoral districts for       any of those three political maps. Texas State Senator Joan       Huffman, who chaired the Senate Redistricting Committee,       testified under oath that she drew Texas districts blind to       race, and sought to maximize Republican political advantage       balanced against traditional…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1694943/bloody-sunday-and-voting-rights-act"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…Inaugural Ceremonies--JCCIC--hosted the  inauguration of President Donald Trump.\n\nThis year, I chaired the joint committee with Senator Fischer, my  counterpart on the Senate Committee on Rules and Administration. I  thank her and the rest of the committee members--Leader Schumer,  Speaker Johnson, Leader Scalise, and Leader Jeffries--for their  partnership.…", "date": "2025-06-02", "source_url": "https://justfacts.votesmart.org/public-statement/1691709/recognizing-the-joint-congressional-committee-on-the-inauguration"}, {"senator": "Eleanor Norton", "party": "Democrat", "sentence": "…involved in the  physical transmittal process: the offices of the Speaker and President  of the Senate, the House and Senate Parliamentarians, the House Clerk,  the Senate Secretary, the House Committee on Oversight and  Accountability and the Senate Committee on Homeland Security and  Governmental Affairs.\n\nThe aftermath of the January 6, 2021, attack on the…", "date": "2025-04-07", "source_url": "https://justfacts.votesmart.org/public-statement/1689607/introduction-of-the-district-of-columbia-electronic-transmittal-of-legislation-act"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…supports the access of       communities to emergency alert systems.\n\nMr. President, Senator Angela Alsobrooks of Maryland supports the  motion to recommit bill H.R. 4 to the Senate Committee on  Appropriations to eliminate rescissions that would undermine the public  broadcasting infrastructure that supports the access of communities to  emergency alert systems.…", "date": "2025-07-16", "source_url": "https://justfacts.votesmart.org/public-statement/1693616/hr-4"}, {"senator": "Michael Bennet", "party": "Democrat", "sentence": "…White House to celebrate the restoration  of the Bears Ears National Monument. When we introduced the Tribal  Access to Clean Water Act, the chairman testified before the Senate  Committee on Indian Affairs to remind Congress of the Federal  Government's responsibility to ensure all of Indian Country has access  to clean, reliable drinking water.\n\nChairman…", "date": "2025-11-06", "source_url": "https://justfacts.votesmart.org/public-statement/1696559/directing-the-removal-of-united-states-armed-forces-from-hostilities-within-or-against-venezuela-that-have-not-been-authorized-by-congress"}, {"senator": "Sam Graves", "party": "Republican", "sentence": "…Appropriate committees of congress.--The term       ``appropriate committees of Congress'' means the Committee on       Commerce, Science, and Transportation of the Senate and the       Committee on Transportation and Infrastructure of the House       of Representatives.\n\n(6) Cabinet member.--The term ``Cabinet Member'' means an       individual who is the…", "date": "2026-02-23", "source_url": "https://justfacts.votesmart.org/public-statement/1700111/rotorcraft-operations-transparency-and-oversight-reform-act"}, {"senator": "Jim Justice, Jr.", "party": "Republican", "sentence": "…Strategy.--Not later than 90 days after completing the       evaluation under subsection (a), the Director shall submit to       the Committee on the Judiciary of the Senate and the       Committee on the Judiciary of the House of Representatives a       strategy to provide all Federal correctional facilities with       capabilities necessary to--\n\n(1) protect…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689519/9999"}, {"senator": "John Thune", "party": "Republican", "sentence": "…Capitol alleging discrimination based on gender, age,  and military status or service.\n\nPlaintiffs have sent a subpoena to Nichole Kotschwar, deputy staff  director of the Senate Committee on Rules and Administration, seeking  deposition testimony and document production regarding matters in  connection with the underlying employment dispute. The subpoena…", "date": "2025-06-04", "source_url": "https://justfacts.votesmart.org/public-statement/1691911/authorizing-testimony-document-production-and-representation-by-the-senate-legal-counsel-in-the-case-of-in-re-architect-of-the-capitol-employment-dispute"}, {"senator": "Warren Davidson", "party": "Republican", "sentence": "…executive order, but we  don't have a legislature that is doing the work to stop it.\n\nWe were talking about moving crypto bills today. The Senate passed  the GENIUS Act in the Senate Committee on Banking, Housing, and Urban  Affairs and on the floor of the Senate, which regulates stablecoin.\n\nStablecoins are about 7 percent of the crypto market. The rest is…", "date": "2025-06-26", "source_url": "https://justfacts.votesmart.org/public-statement/1693006/central-bank-digital-currency"}, {"senator": "Mitch McConnell, Jr.", "party": "Republican", "sentence": "Mr. McCONNELL. Mr. President, pursuant to Senate Rule XXXIII, the  Committee on Rules and Administration adopted the U.S. Senate Hallways  and Balconies Regulations, on May 9, 2025, which supersede and replace  the current ``Display of…", "date": "2025-05-12", "source_url": "https://justfacts.votesmart.org/public-statement/1690981/us-senate-hallways-and-balconies-regulations"}, {"senator": "Steve Scalise", "party": "Republican", "sentence": "…because  they have never cared about lowering premiums.\n\nThat bill goes to the Senate. Senate Democrats worked overtime to get  that provision removed. If we look at the Senate Committee on the  Budget website, they still brag that they removed that provision that  would have lowered premiums for families.\n\nRepublicans absolutely have worked and will continue,…", "date": "2025-11-12", "source_url": "https://justfacts.votesmart.org/public-statement/1696745/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…year.\n\nAfter serving the U.S. House of Representatives for nearly four  years, Kaitlyn will depart the House Committee on Energy and Commerce  to take a position with the Senate Committee on Environment and Public  Works, handling a portfolio of energy, fish, and wildlife issues. I  thank her for her service to the committee and wish her well in her new…", "date": "2025-11-21", "source_url": "https://justfacts.votesmart.org/public-statement/1697136/recognizing-kaitlyn-peterson"}, {"senator": "Dan Sullivan", "party": "Republican", "sentence": "…Leaders.\n\nPursuant to rule XXVI, paragraph 5(a), of the Standing Rules of the  Senate, the following committees are authorized to meet during today's  session of the Senate:             COMMITTEE ON HEALTH. EDUCATION. LABOR, AND PENSIONS\n\nThe Committee on Health, Education, Labor, and Pensions is authorized  to meet during the session of the Senate on Thursday,…", "date": "2025-07-17", "source_url": "https://justfacts.votesmart.org/public-statement/1693750/authority-for-commitees-to-meet"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…congress.--The term       ``appropriate committees of Congress'' means--\n\n(A) the Committee on Foreign Relations and the Committee on       the Judiciary of the Senate; and\n\n(B) the Committee on Foreign Affairs and the Committee on       the Judiciary of the House of Representatives.\n\n(2) Forced organ harvesting.--The term ``forced organ       harvesting''…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690630/stop-forced-organ-harvesting-act-of-2025"}, {"senator": "Brett Guthrie", "party": "Republican", "sentence": "…University of Sydney,  and The Catholic University of America's Columbus School of Law, Joanne  began her career on Capitol Hill as a Law Clerk for the United States  Senate Committee on the Judiciary in 2022 after having previously  worked in the legal field. In January 2023, Joanne joined the House  Committee on Energy and Commerce to serve as Counsel…", "date": "2025-06-06", "source_url": "https://justfacts.votesmart.org/public-statement/1692136/recognizing-joanne-thomas"}, {"senator": "Brian Mast", "party": "Republican", "sentence": "…not later than 90 days after completing a review       required by paragraph (1)(A), submit an updated report to the       Committee on Foreign Relations of the Senate and the       Committee on Foreign Affairs of the House of Representatives.\n\n``(2) Matters to be included.--The updated reports required       under paragraph (1)(B) shall include--\n\n``(A)…", "date": "2025-05-05", "source_url": "https://justfacts.votesmart.org/public-statement/1690686/taiwan-assurance-implementation-act"}, {"senator": "Jerry Moran", "party": "Republican", "sentence": "…operate. It is because we are coming to the end of the fiscal year. Not  all the appropriations bills have been approved, though most all of  them have been approved by the Senate Committee on Appropriations. In  fact, three have been passed by the Senate.\n\nThis makes no sense to me. This is not a shutdown that makes any  sense at all. The American people,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695918/continuing-appropriations-and-extensions-act-2026"}, {"senator": "Mike Lee", "party": "Republican", "sentence": "…the U.S. Department of the Interior, known as BOEM and BSEE, to provide  their feedback or offer testimony on the implications of this  legislation.\n\nNow, look, the Senate's committee process exists, and it exists for a  reason. It exists for exactly these sets of reasons. While it might  have slightly different implications depending on the committee…", "date": "2025-12-17", "source_url": "https://justfacts.votesmart.org/public-statement/1698296/9999"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…than 5 years after the date of       enactment of this Act, the Commission shall submit to the       Committee on Commerce, Science, and Transportation of the       Senate and the Committee on Energy and Commerce of the House       of Representatives, a report regarding fires, explosions, and       other hazards relating to lithium-ion batteries used…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690261/setting-consumer-standards-for-lithium-ion-batteries-act"}, {"senator": "Gus Bilirakis", "party": "Republican", "sentence": "…Act of 2025, and       every 2 years thereafter, the Assistant Secretary shall       submit to the Committee on Commerce, Science, and       Transportation of the Senate and the Committee on Energy and       Commerce of the House of Representatives a report of       activities, findings, achievements, and vulnerabilities       relating to the goals…", "date": "2025-04-28", "source_url": "https://justfacts.votesmart.org/public-statement/1690271/american-music-tourism-act-of-2025"}]