[{"senator": "Mark Warner", "party": "Democrat", "sentence": "…Arab  American communities.\n\nNow, unfortunately, neither religious discrimination nor acts of  hate-fueled violence are new or are uniquely American.\n\nLast month, I joined Senator Schumer and all of my Democratic  colleagues in speaking out against the horrible anti-Semitism targeting  our Jewish communities and calling out disgusting vitriol from the…", "date": "2026-01-12", "source_url": "https://justfacts.votesmart.org/public-statement/1698866/commerce-justice-science-energy-and-water-development-and-interior"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "…fund doesn't come close to offsetting the losses rural  providers will face from the cuts of Medicaid, just to give you one  example. That is why I have joined Senator Wyden and Senator Schumer in  introducing a bill that will repeal the health provisions in the ``Big  Blatant Betrayal.'' It is not a Big Beautiful Bill; it is a ``Big  Blatant Betrayal.''…", "date": "2025-07-30", "source_url": "https://justfacts.votesmart.org/public-statement/1694385/9999"}, {"senator": "Alex Padilla", "party": "Democrat", "sentence": "Mr. PADILLA. Mr. President, I first want to begin by thanking my  colleagues Senator Kaine and Senator Van Hollen--I believe Senator  Schumer will be joining us--for this important issue. I want to thank  them for their efforts to provide some needed moral clarity at this  critical time.\n\nEarlier this year--I…", "date": "2025-05-15", "source_url": "https://justfacts.votesmart.org/public-statement/1691401/motion-to-discharge-s-res-195"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…the Senate will vote on an  important resolution put forward by our colleague and friend Senator  Kaine on the topic of U.S. energy production.\n\nAs my colleagues know, Senator Schumer and I led the development of  the clean energy tax credits, which set in motion the possibility of  hundreds of billions of dollars of investment in clean energy and,…", "date": "2025-10-08", "source_url": "https://justfacts.votesmart.org/public-statement/1696128/terminating-the-national-emergency-declared-with-respect-to-energy"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…many  dollars you have leftover when you file your taxes. It is a life and  death issue that we are debating.\n\nI want to thank those who have spoken this evening already--Senator  Schumer and Senator Merkley--for their leadership on this issue. I  plead with my colleagues on the other side of the aisle: Please, there  has got to be someone over there who…", "date": "2025-04-03", "source_url": "https://justfacts.votesmart.org/public-statement/1689510/establishing-the-congressional-budget-for-the-united-states-government-for-fiscal-year-2025-and-setting-forth-the-appropriate-budgetary-levels-for-fiscal-years-2026-through-2034"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…dine, and to dance with billionaires and power brokers of the  world, while letting--in fact, forcing--America's children and  vulnerable families to go hungry.\n\nI thank Senator Schumer and the other 44 additional cosponsors who  have joined this resolution. I invited all 100 Senators to join it. The  five points are certainly ones I have heard expressed…", "date": "2025-11-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696499/unanimous-consent-request"}, {"senator": "Cory Booker", "party": "Democrat", "sentence": "…or  label you slap on it, those are the kinds of Americans who are stepping  up to take care of their loved ones who will get hurt.\n\nMr. BOOKER. Yes.\n\nMr. BOOKER. Yes, Senator Schumer.\n\nTo tell a family to just double up or triple up drives up their  costs. It is often that the elder who is living with them who might  have dementia demands care. So…", "date": "2025-03-31", "source_url": "https://justfacts.votesmart.org/public-statement/1689305/privileges-of-the-floor"}, {"senator": "Amy Klobuchar", "party": "Democrat", "sentence": "…that it didn't happen  here. There was no crossing over the fence with some coffee for the  neighbors to try to have a meeting, to try to work this out.\n\nIn fact, it was Senator Schumer and Leader Jeffries who had to  request time and time again--that got canceled on--a meeting with the  President.\n\nThere is still time to continue to negotiate, but not…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695910/government-funding"}, {"senator": "Tim Kaine", "party": "Democrat", "sentence": "…too big an issue to allow one person to make the  decision that sends our sons and daughters into harm's way.\n\nMr. KAINE. Mr. President, the remaining two speakers and Senator  Schumer have yielded their time to me. I will be the last speaker  before the vote.\n\nMy colleague from Idaho says this is driven by hate and vitriol  toward President Trump. He…", "date": "2025-06-27", "source_url": "https://justfacts.votesmart.org/public-statement/1693124/motion-to-discharge-sj-res-59"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…too expensive.\n\nWe went back and forth, and every day I came to this floor and stated  our  position on the case. Senator Thune, Senator Barrasso stated their  position. Senator Schumer, of course, was part of this dialogue that  went on week after week.\n\nThe decision was finally made by a number of us to end the government  shutdown by voting to open…", "date": "2025-12-08", "source_url": "https://justfacts.votesmart.org/public-statement/1697576/department-of-defense"}, {"senator": "Jeff Merkley", "party": "Democrat", "sentence": "…demand accountability, and the victims demand  justice.\n\nAnd we had a chance to deliver it today, and we failed them.\n\nMy bill, which was introduced as the amendment by Senator Schumer,  requires the Attorney General to release all materials and records  related to Jeffrey Epstein and Ghislaine Maxwell, including the flight  and travel records, the names…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695214/jeffrey-epstein"}, {"senator": "Richard Blumenthal", "party": "Democrat", "sentence": "Mr. BLUMENTHAL. Mr. President, I thank my colleagues for this unified  support for a measure that is eminently reasonable, and I thank the  leader of our side, Senator Schumer, for advancing this proposal.\n\nIt is a compromise. It is simple and plain. And I will be very blunt:  It is not everything I would have wanted. Like the Senator from…", "date": "2025-11-07", "source_url": "https://justfacts.votesmart.org/public-statement/1696612/9999"}, {"senator": "Ron Wyden", "party": "Democrat", "sentence": "…healthcare premiums and taking on big insurance has been  for show, and the American people are fed up with excuses.\n\nToday is an opportunity, finally, to do the right thing. Senator  Schumer has made it clear that extending the tax credits for middle- class healthcare is a key first step--a first step--toward moving  America toward a healthcare system that…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699115/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "Dick Durbin", "party": "Democrat", "sentence": "…Gang of 8--four Republicans and four Democrats who sat  down to write a comprehensive immigration reform bill. Senator McCain  led the effort on the Republican side, and Senator Schumer joined me  with others on the Democratic side. We produced a measure that had the  support of business and labor and Democrats and Republicans.\n\nWe brought it to the floor…", "date": "2025-10-21", "source_url": "https://justfacts.votesmart.org/public-statement/1696348/trump-administration"}, {"senator": "Glenn Ivey", "party": "Democrat", "sentence": "…the board.\n\nThe Republican Party didn't wake up to this until the American people  started screaming in their ears. Well, now, here we are. What is the  path forward?\n\nSenator Schumer back during the government shutdown at the end of it  said: Tell you what. Why don't we just extend it for a year. Let's put  a task force together to try and work out…", "date": "2025-12-01", "source_url": "https://justfacts.votesmart.org/public-statement/1697216/medical-bills-are-too-high"}, {"senator": "Tom Cotton", "party": "Republican", "sentence": "…Maduro's ouster and America's success, our Democratic  colleagues are determined to condemn the operation, all because  President Trump ordered it.\n\nConsider that, in 2020, Senator Schumer criticized President Trump  for bragging ``about his Venezuela policy'' but failing to bring ``an  end to the Maduro regime.'' It sounds like a call for regime change…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698556/venezuela"}, {"senator": "Deb Fischer", "party": "Republican", "sentence": "…single government funding  bill in this Chamber before August, and that was since 2018. And that  failure was not accidental. Under the previous Democrat majority  leader, Senator Schumer, the Senate was repeatedly blocked from holding  full votes on appropriations bills. That approach was unacceptable to  many Members on both sides of the aisle.\n\nIt was…", "date": "2026-02-10", "source_url": "https://justfacts.votesmart.org/public-statement/1699921/providing-for-congressional-disapproval-under-chapter-8-of-title-united-states-code-of-the-rule-submitted-by-the-internal-revenue-service-relating-to-interim-guidance-simplifying-application-of-the"}, {"senator": "John Kennedy", "party": "Republican", "sentence": "…the Democratic Party that can only be described accurately as the  socialist wing of the party. And that party is in ascendance. That  party is in control.\n\nMy friend Senator Schumer is the leader of the Democrats in the U.S.  Senate. And he, of course, has instructed his colleagues to vote to  shut down the government. And Senator Schumer has been…", "date": "2025-10-03", "source_url": "https://justfacts.votesmart.org/public-statement/1695979/government-funding"}, {"senator": "Chuck Grassley", "party": "Republican", "sentence": "…alarm as the  lapse in government funding endangered food assistance for 42 million  Americans and rapidly approached. That was November 1, the approach  date. I called on Senator Schumer to end the partisanship and vote for  a clean extension of government funding.\n\nForty-five Democrats have opposed a clean extension of funding 13  times. Republicans have…", "date": "2025-11-03", "source_url": "https://justfacts.votesmart.org/public-statement/1696506/government-funding"}, {"senator": "Virginia Foxx", "party": "Republican", "sentence": "…way that we  are doing it now.\n\nI also remind my colleagues who are speaking against or saying we are  not dealing with the tariffs issue is that former Speaker Pelosi,  Senator Schumer, and other Democrats railed against Chinese tariffs  years ago but did nothing about them. They even supported President  Biden's preserving of the tariffs from the Chinese…", "date": "2025-04-08", "source_url": "https://justfacts.votesmart.org/public-statement/1689703/providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-overdraft-lending-very-large-financial-institutions-providing-for-consideration-of-sj-res-disapproving-the-rule-submitted-by-the-bureau-of-consumer-financial-protection-relating-to-defining-larger-participants-of-a-market-for-general-use-digital-consumer-payment-applications-providing-for-consideration-of-hr-no-rogue-rulings-act-of-providing-for-consideration-of-hr-safeguard-american-voter-eligibility-act-and-for-other-purposes"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…overtime--that means a  lot for the miners and the linemen in Wyoming. They are going to be  able to keep $1,400 more this year in their paychecks.\n\nNow, the Democrat leader, Senator Schumer, was just on the floor, and  he talked about firefighters. Well, firefighters work a lot of  overtime. They need to stay on the job. They do that. No tax on  overtime…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699081/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}, {"senator": "John Cornyn", "party": "Republican", "sentence": "…outright misrepresenting what is contained in it. One of the  accusations made is that it will take away healthcare coverage from  people who need it.\n\nDemocratic Leader Senator Schumer said of the bill:\n\nThere is nothing beautiful about stripping away people's       healthcare, forcing kids to go hungry, denying communities       the resources they need,…", "date": null, "source_url": "https://justfacts.votesmart.org/public-statement/1695530/national-defense-authorization-act-for-fiscal-year-2026"}, {"senator": "John Barrasso", "party": "Republican", "sentence": "…Maduro is good for the United  States.'' That is one of the Democrats who are opposing what the  President of the United States has done. He called for it in the past.\n\nSenator Chuck Schumer, the Democratic leader, who will be on this  floor in a few minutes, came to this very floor in 2020 and complained  about President Trump, saying President Trump ``hasn't…", "date": "2026-01-07", "source_url": "https://justfacts.votesmart.org/public-statement/1698571/venezuela"}, {"senator": "Lindsey Graham", "party": "Republican", "sentence": "…Trump. And  anytime we look at what you all did, you know, we are, I guess, a bunch  of crooks.\n\nNow let's talk about me and enrichment. The Democratic majority  leader, Senator Schumer, signed off on this. I want the world to know-- and the world is paying no attention because it is blowing up right  now--that this provision was coordinated between Senators…", "date": "2026-01-14", "source_url": "https://justfacts.votesmart.org/public-statement/1699105/commerce-justice-science-energy-and-water-development-and-interior-and-environment-appropriations-act-2026"}]